Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-pidsubsystem-code.po
Languages: es_mx, fr_ca

source: Writing the Code for a PIDSubsystem
es_mx: Escribiendo el Código para un Subsistema PID
fr_ca: Écrire le code pour PIDSubsystem

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
es_mx: ¡RobotBuilder se ha actualizado para admitir el nuevo marco basado en comandos! Desafortunadamente, esta documentación está desactualizada y solo para el antiguo marco basado en comandos. Las personas interesadas en actualizar esta documentación pueden abrir una solicitud de extracción en el repositorio `frc-docs <https://github.com/wpilibsuite/frc-docs>`__.
fr_ca: RobotBuilder a été mis à jour pour prendre en charge le nouveau cadre de développement orienté commande! Malheureusement, cette documentation est obsolète et n'est valable que pour l’ancien cadre de développement orienté commande. Les personnes intéressées à mettre à jour la nouvelle documentation peuvent ouvrir un pull request sur le dépôt `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ .

source: PIDSubsystems use feedback to control the actuator and drive it to a particular position. In this example we use an elevator with a 10-turn potentiometer connected to it to give feedback on the height. The skeleton of the PIDSubsystem is generated by the RobotBuilder and we have to fill in the rest of the code to provide the potentiometer value and drive the motor with the output of the embedded PIDController.
es_mx: Los subsistemas PID utilizan la retroalimentación para controlar el actuador y conducirlo a una posición determinada. En este ejemplo usamos un ascensor con un potenciómetro de 10 vueltas conectado a él para dar retroalimentación en la altura. El esqueleto del subsistema PID es generado por RobotBuilder y nosotros tenemos que rellenar el resto del código para proporcionar el valor del potenciómetro y conducir el motor con la salida del controlador PID incorporado.
fr_ca: PIDSubsystem utilise la rétroaction pour contrôler le dispositif actionneur et le mener vers une position particulière. Dans cet exemple, nous utilisons un élevateur avec un potentiomètre à 10 tours qui sert comme "feedback" sur la hauteur. Le squelette du PIDSubsystem est généré par RobotBuilder et nous devons remplir le reste du code pour fournir la valeur du potentiomètre et entraîner le moteur avec la sortie du PIDController intégré.

source: Setting the PID Constants
es_mx: Establecer las Constantes PID
fr_ca: Définition des constantes PID

source: Make sure the Elevator PID subsystem has been created in the RobotBuilder. In the case of our elevator we use a proportional constant of 6.0 and 0 for the I and D terms. Once it's all set, generate Java/C++ code for the project using the Export menu or the Java/C++ toolbar menu.
es_mx: Esté seguro de que el subsistema PID del elevador ha sido creado en el RobotBuilder. En el caso de nuestro elevador, usamos una constante proporcional de 6.0 y 0 para los términos I y D. Una vez que todo esté establecido, genere el código Java/C++ para el proyecto usando el menú de exportación o el menú de la barra de herramientas Java/C++.
fr_ca: Assurez-vous que le sous-système Elevator PID a été créé dans RobotBuilder. Dans le cas de notre élévateur, nous utilisons une constante proportionnelle de 6,0 et 0 pour les termes I et D respectivement. Une fois que tout est défini, générer le code Java / C ++ pour le projet à l'aide du menu Export ou du menu de la barre d'outils Java / C ++.

source: Add Constants for Elevator Preset Positions
es_mx: Añadir Constantes para las Posiciones Preestablecidas del Elevador
fr_ca: Ajouter des constantes pour les positions prédéfinies d'élévateur

source: To make it easier to drive the elevator to preset positions, we added preset positions for the bottom, stow, and table height. Then the elevator is set to the STOW position by setting the PID setpoint and the PID controller is enabled. This will cause the elevator to move to the stowed position when the robot is enabled.
es_mx: Para facilitar la conducción del elevador a las posiciones predefinidas, hemos añadido posiciones predefinidas para el fondo, estiba y altura de la mesa. Luego el elevador se pone en la posición STOW ajustando el punto de ajuste de PID y el controlador PID está activado. Esto hará que el elevador se mueva a la posición de estiba cuando el robot esté activado.
fr_ca: Pour faciliter la conduite de l'élévateur vers des positions prédéfinies, nous en avons ajouté trois niveaux, soit pour le bas niveau, le rangement (STOW) et le haut niveau (correspondant à la hauteur de la table, dans notre exemple). Ensuite, l'élévateur est réglé sur la position STOW en réglant le point de consigne PID et ensuite, le contrôleur PID est activé. Cela entraînera l'élévateur à se déplacer vers la position stow lorsque le robot est activé.

source: Adding the Constants to the Header File (C++ Only)
es_mx: Añadiendo las Constantes al Archivo de Cabecera (Sólo C++).
fr_ca: Ajout des constantes au fichier "header" d'en-tête (C ++ uniquement)

source: Return PID Input Values
es_mx: Devolver los Valores de Entrada del PID.
fr_ca: Renvoyer les valeurs d'entrée PID

source: The ``returnPIDInput()`` method is used to set the value of the sensor that is providing the feedback for the PID controller. In this case, the code is automatically generated and returns the potentiometer raw analog input value (a number that ranges from 0-1023). In our case we would like the PID controller to be based on the average voltage read by the analog input for the potentiometer, not the raw value.
es_mx: El método ``returnPIDInput()``se utiliza para establecer el valor del sensor que está proporcionando la retroalimentación para el controlador PID. En este caso, el código se genera automáticamente y devuelve el valor de la entrada analógica bruta del potenciómetro (un número que oscila entre 0-1023). En nuestro caso, nos gustaría que el controlador PID se basara en el voltaje promedio leído por la entrada analógica para el potenciómetro, no el valor bruto.
fr_ca: La méthode ``returnPIDInput()`` est utilisée pour définir la valeur du capteur qui fournit la rétroaction pour le contrôleur PID. Dans ce cas, le code est généré automatiquement et renvoie la valeur d'entrée analogique brute du potentiomètre (un nombre compris entre 0 et 1023). Dans notre cas, nous aimerions que le contrôleur PID soit basé sur la tension moyenne lue par l'entrée analogique du potentiomètre, et non sur la valeur brute.

source: If we just change the line:
es_mx: Si sólo cambiamos la línea:
fr_ca: Si nous changeons simplement la ligne:

source: ``return potentiometer.pidGet();`` for Java or ``return potentiometer->PIDGet();`` for C++
es_mx: ``return potentiometer.pidGet();`` para Java o ``return potentiometer->PIDGet();`` para C++
fr_ca: ``return potentiometer.pidGet();`` pour Java, ou ``return potentiometer->PIDGet();`` pour C++

source: it will be overwritten by RobotBuilder next time we export to Java. You can tell which lines are automatically generated by looking at the "//BEGIN AUTOGENERATED CODE" and "//END AUTOGENERATED CODE" comments. Any code in-between those markers will be overwritten next time RobotBuilder is run. You're free to change anything outside of those blocks.
es_mx: Será sobrescrita por RobotBuilder la próxima vez que exportemos a Java. Puedes saber qué líneas son generadas automáticamente mirando los comentarios "//BEGIN AUTOGENERATED CODE" y "//END AUTOGENERATED CODE". Cualquier código entre esos marcadores será sobrescrito la próxima vez que se ejecute RobotBuilder. Eres libre de cambiar cualquier cosa fuera de esos bloques.
fr_ca: elle sera écrasée par RobotBuilder lors de notre prochaine exportation vers Java. Vous pouvez savoir quelles lignes sont générées automatiquement en consultant les commentaires "// BEGIN AUTOGENERATED CODE" et "// END AUTOGENERATED CODE". Tout code entre ces marqueurs sera écrasé la prochaine fois que RobotBuilder sera exécuté. Vous êtes libre de changer quoi que ce soit en dehors de ces blocs.

source: Return the Average Voltage
es_mx: Devolver el Voltaje Promedio.
fr_ca: Renvoyer la tension moyenne

source: To get around the problem from the last step, the comment blocks can be removed. Then if the line is changed as shown, it will no longer be overwritten by RobotBuilder.
es_mx: Para evitar el problema desde el último paso, se pueden eliminar los bloques de comentarios. Entonces si la línea se cambia como se muestra, ya no será sobrescrita por RobotBuilder.
fr_ca: Pour contourner le problème de la dernière étape, les blocs de commentaires peuvent être supprimés. Ensuite, si la ligne est modifiée comme indiqué, elle ne sera plus remplacée par RobotBuilder.

source: Remember, if we just wanted to add code to a method it could be added safely outside of the comment blocks.
es_mx: Recuerde, si sólo quisiéramos añadir código a un método, podría ser añadido de forma segura fuera de los bloques de comentarios.
fr_ca: N'oubliez pas que si nous voulions simplement ajouter du code à une méthode, il pourrait être ajouté en toute sécurité en dehors des blocs de commentaires.

source: That's all that is required to create the Elevator PIDSubsystem.
es_mx: Eso es todo lo que se requiere para crear un subsistema PID del elevador.
fr_ca: C'est tout ce qui est nécessaire pour créer le PIDSubsystem Elevator.
