Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code.po
Languages: fr_ca, zh_cn

source: Writing the Code for a Subsystem
fr_ca: Écrire le code d'un sous-système
zh_cn: 为子系统编写代码

source: Adding code to create an actual working subsystem is very straightforward. For simple subsystems that don't use feedback it turns out to be extremely simple. In this section we will look at an example of a `Claw` subsystem. The `Claw` subsystem also has a limit switch to determine if an object is in the grip.
fr_ca: L'ajout de code pour créer un sous-système fonctionnel est très simple. Pour les sous-systèmes qui n'utilisent pas de rétroaction, cela s'avère extrêmement simple. Dans cette section, nous allons regarder un exemple de sous-système de pince ou `Claw` sur un bras articulé de robot. Le sous-système `Claw` dispose également d’un interrupteur de fin de course pour déterminer si un objet est bien saisi.
zh_cn: 添加代码以创建实际工作子系统非常简单。对于不使用反馈的简单子系统，结果证明非常简单。在本节中，我们将看一个 `Claw` 子系统的示例。 `Claw` 子系统还有一个限位开关来确定物体是否在抓地力中。

source: RobotBuilder Representation of the Claw Subsystem
fr_ca: Représentation de RobotBuilder du sous-système Claw
zh_cn: 爪子系统的RobotBuilder表示

source: The claw at the end of a robot arm is a subsystem operated by a single VictorSPX Motor Controller. There are three things we want the motor to do, start opening, start closing, and stop moving. This is the responsibility of the subsystem. The timing for opening and closing will be handled by a command later in this tutorial. We will also define a method to get if the claw is gripping an object.
fr_ca: La pince à l’extrémité du bras du robot est un sous-système actionné par un seul contrôleur de moteur VictorSPX. Il y a trois choses que nous voulons que la pince fasse, commence à s'ouvrir, commencer à se fermer, et s'arrêter. C’est la responsabilité du sous-système. La prise en charge pour l’ouverture et la fermeture sera assurée par une commande plus tard dans ce didacticiel. Nous définirons également une méthode pour savoir si la pince est en train de saisir un objet.
zh_cn: 机械臂末端的爪子是一个由单个 VictorSPX 电机控制器控制的子系统。我们希望电机做三件事，打开，关闭和停止移动。这是子系统的责任。打开和关闭的时间将在本教程后面的指令处讨论到。我们还将定义一个方法来判断爪子是否正在抓取物体。

source: Adding Subsystem Capabilities
fr_ca: Ajout de capacités de sous-système
zh_cn: 添加子系统功能

source: Add methods to the ``claw.java`` or ``claw.cpp`` that will open, close, and stop the claw from moving and get the claw limit switch. Those will be used by commands that actually operate the claw.
fr_ca: Ajoutez des méthodes aux fichiers ``claw.java`` ou ``claw.cpp`` qui ouvriront, fermeront et empêcheront la pince de bouger et de lire l’état de l'interrupteur de fin de course de la pince. Ceux-ci seront utilisés par les commandes qui gèrent réellement le fonctionnement de la pince.
zh_cn: 将方法添加到 ``claw.java`` 或 ``claw.cpp`` 将打开，关闭和停止爪子移动并获取爪子限位开关。这些将由实际操作爪子的命令使用。

source: The comments have been removed from this file to make it easier to see the changes for this document.
fr_ca: Les commentaires ont été éliminés de ce fichier pour faciliter le suivi des changements de ce document.
zh_cn: 注释已从此文件中删除，以便更轻松地查看此文档的更改。

source: Notice that member variable called ``motor`` and ``limitswitch`` are created by RobotBuilder so it can be used throughout the subsystem. Each of your dragged-in palette items will have a member variable with the name given in RobotBuilder.
fr_ca: Notez que les variables membres appelées ``motor`` et ``limitswitch`` sont créés par RobotBuilder afin qu’elles puissent être utilisées dans l’ensemble du sous-système. Chacun de vos éléments glissés dans la palette aura une variable membre avec le nom donné dans RobotBuilder.
zh_cn: 请注意，名为“motor”和“limitswitch”的成员变量是由 RobotBuilder 创建的，因此可以在整个子系统中使用。每个拖入的调色板项目都有一个成员变量，其名称在 RobotBuilder 中给出。

source: Adding the Method Declarations to the Header File (C++ Only)
fr_ca: Ajout des déclarations de méthode au fichier Header, ou d'en-tête (C ++ uniquement)
zh_cn: 将方法声明添加到头文件（仅C ++）

source: In addition to adding the methods to the class implementation file, ``Claw.cpp``, the declarations for the methods need to be added to the header file, ``Claw.h``. Those declarations that must be added are shown here.
fr_ca: En plus d'ajouter les méthodes au fichier d'implémentation de classe, ``Claw.cpp``, les déclarations des méthodes doivent être ajoutées au fichier d'en-tête, soit ``Claw.h``. Les déclarations à ajouter sont indiquées ici.
zh_cn: 除了将方法添加到类实现文件“Claw.cpp”之外，还需要将方法的声明添加到头文件“Claw.h”中。必须添加的那些声明显示在此处。

source: To add the behavior to the claw subsystem to handle opening and closing you need to :doc:`define commands <../introduction/robotbuilder-creating-command>`.
fr_ca: Pour ajouter la fonctionnalité au sous-système Claw afin de gérer l'ouverture et la fermeture, vous devez :doc:`définir des commandes <../introduction/robotbuilder-creating-command>`.
zh_cn: 要将行为添加到爪子子系统以处理打开和关闭，您需要 :doc:`define commands <../introduction/robotbuilder-creating-command>`。
