Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-drive-tank.po
Languages: fr_ca, tr_tr, zh_cn

source: Driving the Robot with Tank Drive and Joysticks
fr_ca: Conduire le robot avec le mode Tank Drive et Joysticks
tr_tr: Robotu Tank Sürüş methodu ve Joysticklerle Sürmek
zh_cn: 用 Tank Drive 和 Joystick 操控机器人

source: A common use case is to have a joystick that should drive some actuators that are part of a subsystem. The problem is that the joystick is created in the RobotContainer class and the motors to be controlled are in the subsystem. The idea is to create a command that, when scheduled, reads input from the joystick and calls a method that is created on the subsystem that drives the motors.
fr_ca: Un cas d'utilisation courant est d'avoir un joystick qui devrait entraîner certains dispositifs actionneurs qui font partie d'un sous-système. Le problème est que le joystick est créé dans la classe OI et que les moteurs à contrôler sont dans le sous-système. L'idée est de créer une commande qui, lorsqu'elle est planifiée, lit les entrées du joystick et appelle une méthode créée sur le sous-système qui entraîne les moteurs.
tr_tr: Yaygın bir kullanım durumu, bir alt sistemin parçası olan bazı aktüatörleri çalıştırması gereken bir kumanda çubuğuna sahip olmaktır. Sorun, joystick'in RobotContainer sınıfında oluşturulması ve kontrol edilecek motorların alt sistemde olmasıdır. Buradaki fikir, programlandığında, joystick'ten girdi okuyan ve motorları çalıştıran alt sistemde oluşturulan bir yöntemi çağıran bir komut oluşturmaktır.
zh_cn: 一个常见的用例是有一个操纵杆来驱动作为子系统一部分的一些执行器。问题是操纵杆是在 RobotContainer 类中创建的，要控制的电机在子系统中。这个想法是创建一个指令，在调度时从操纵杆读取输入并调用在驱动电机的子系统上创建的方法。

source: In this example a drive base subsystem is shown that is operated in tank drive using a pair of joysticks.
fr_ca: Dans cet exemple, un sous-système de base d'entraînement est montré qui fonctionne en entraînement de réservoir à l'aide d'une paire de joysticks.
tr_tr: Bu örnekte, bir çift kumanda kolu kullanılarak tank sürücüsünde çalıştırılan bir sürücü tabanı alt sistemi gösterilmektedir.
zh_cn: 在这个例子中，一个底盘子系统在一个用一对操纵杆的 tank drive 被运行。

source: Create a Drive Train Subsystem
fr_ca: Créer un sous-système d'entraînement
tr_tr: Drive Train Subsystem Oluşturun
zh_cn: 建造一个 Drive Train Subsystem 。

source: Create a subsystem called Drive Train. Its responsibility will be to handle the driving for the robot base.
fr_ca: Créez un sous-système appelé Drive Train. Sa responsabilité sera de gérer la conduite de la base de robots.
tr_tr: Drive Train adlı bir alt sistem oluşturun. Sorumluluğu, robot tabanı için sürüşü idare etmek olacaktır.
zh_cn: 创建一个名为 Drive Train 的子系统。它的职责是处理机器人基地的驱动。

source: Inside the Drive Train create a Differential Drive object for a two motor drive. There is a left motor and right motor as part of the Differential Drive class.
fr_ca: À l’intérieur du Drive Train créer un objet Differential Drive pour un entraînement à deux moteurs. Il y a un moteur gauche et un moteur droit dans le cadre de la classe Differential Drive.
tr_tr: Aktarma Organının içinde iki motorlu sürücü için bir Diferansiyel Sürücü nesnesi oluşturun. Diferansiyel Sürücü sınıfının bir parçası olarak bir sol motor ve sağ motor vardır.
zh_cn: 在 Drive Train 内部，为两个电机驱动器创建一个差分驱动器对象。作为差动驱动类的一部分，有一个左电机和右电机。

source: Since we want to use more then two motors to drive the robot, inside the Differential Drive, create two Speed Controller Groups. These will group multiple speed controllers so they can be used with Differential Drive.
fr_ca: Puisque nous voulons utiliser plus de deux moteurs pour conduire le robot, à l’intérieur de l'objet Differential Drive, créer deux groupes de contrôleurs de vitesse ou Speed Controller Groups. Ceux-ci regrouperont plusieurs contrôleurs de vitesse afin qu’ils puissent être utilisés avec l'objet Differential Drive.
tr_tr: Robotu sürmek için ikiden fazla motor kullanmak istediğimizden, Diferansiyel Sürücünün içinde iki Hız Kontrol Grubu oluşturun. Bunlar, Diferansiyel Sürücü ile kullanılabilmeleri için birden fazla hız kontrol cihazını gruplayacaktır.

source: Finally, create two Speed Controllers in each Speed Controller Group.
fr_ca: Enfin, créez deux objets Speed Controllers créez dans chaque objet Speed Controller Group.
tr_tr: Son olarak, her Hız Kontrol Grubunda iki Hız Kontrol Cihazı oluşturun.

source: Add the Joysticks to the Operator Interface
fr_ca: Ajouter les joysticks à l'interface opérateur
tr_tr: Joystickleri Operatör Arayüzüne Ekleyin
zh_cn: 将 Joystick 添加到 Operator Interface。

source: Add two joysticks to the Operator Interface, one is the left stick and the other is the right stick. The y-axis on the two joysticks are used to drive the robots left and right sides.
fr_ca: Ajoutez deux joysticks à l'interface opérateur, l'un est le joystick gauche et l'autre est le joystick droit. L'axe des y sur les deux joysticks est utilisé pour contrôler les moteurs gauche et droit du robot, respectivement.
tr_tr: Operatör Arayüzüne iki kumanda çubuğu ekleyin, biri sol çubuk ve diğeri sağ çubuktur. İki kumanda kolundaki y ekseni, robotları sola ve sağa sürmek için kullanılır.
zh_cn: 将两个操纵杆添加到 Operator Interface。其中一个为左杆，另一个为右杆。两个操纵杆的y轴是用来让机器人左右移动的。

source: Be sure to export your program to C++ or Java before continuing to the next step.
fr_ca: Assurez-vous d'exporter votre programme en C++ ou Java avant de passer à l'étape suivante.
tr_tr: Sonraki adıma geçmeden önce programınızı C ++ veya Java'ya aktardığınızdan emin olun.
zh_cn: 注意在继续下一步前用 C++ 或 Java 输出程序。

source: Create a Method to Write the Motors on the Subsystem
fr_ca: Créer une méthode pour écrire aux moteurs dans le sous-système
tr_tr: Motorları Alt Sisteme Yazmak İçin Bir Yöntem Oluşturun
zh_cn: 建造一个 Method 来在 Subsystem 中 Write the Motor。

source: C++ (Header)
fr_ca: C++ (Header ou en-tête)

source: Create a method that takes the joystick inputs, in this case the the left and right driver joystick. The values are passed to the DifferentialDrive object that in turn does tank steering using the joystick values. Also create a method called stop() that stops the robot from driving, this might come in handy later.
fr_ca: Créez une méthode qui prend les entrées de joysticks, dans ce cas-ci, les joysticks gauche et droit du pilote. Les valeurs sont transmises à l'objet DifferentialDrive qui à son tour, se charge de diriger le robot en mode Tank à l'aide des valeurs des joysticks. Créez également une méthode que vous appelée stop(), qui empêchera le robot de bouger, cela sera utile ultérieurement.
zh_cn: 创建一个接受操纵杆输入的方法，在本例中为左右驱动操纵杆。这些值被传递给DifferentialDrive 对象，该对象反过来使用操纵杆值进行坦克转向。还要创建一个名为 stop() 的方法来阻止机器人驾驶，这可能会在以后派上用场。

source: Some RobotBuilder output has been removed for this example for clarity
fr_ca: Certaines sorties du RobotBuilder ont été supprimées dans cet exemple pour plus de clarté
tr_tr: Anlaşılır olması için bu örnekte bazı RobotBuilder çıktıları kaldırılmıştır
zh_cn: 为清楚起见，此示例中删除了一些 RobotBuilder 输出

source: Read Joystick Values and Call the Subsystem Methods
fr_ca: Lire les valeurs des joysticks et appeler les méthodes du sous-système
tr_tr: Kumanda Kolu Değerlerini Okuyun ve Subsystem Methodlarını Çağırın
zh_cn: 读取 Joystick Values 和 Call the Subsystem Methods 。

source: Create a command, in this case called Tank Drive. Its purpose will be to read the joystick values and send them to the Drive Base subsystem. Notice that this command Requires the Drive Train subsystem. This will cause it to stop running whenever anything else tries to use the Drive Train.
fr_ca: Créez une commande, dans ce cas appelée Tank Drive. Son but sera de lire une valeur de joystick et de la renvoyer au sous-système "Drive Base". Notez que cette commande nécessite le sous-système "Drive Train". Ce qui fera en sorte que cette commande cessera de fonctionner chaque fois que quelque chose d'autre tentera d'utiliser le "Drive Train"
tr_tr: Bu durumda Tank Drive adlı bir komut oluşturun. Amacı, joystick değerlerini okumak ve Drive Base alt sistemine göndermek olacaktır. Bu komutun Drive Train alt sistemini Gerektirdiğine dikkat edin. Bu, Drive Train'i başka bir şey kullanmaya çalıştığında çalışmasının durmasına neden olacaktır.
zh_cn: 创建一个指令，在本例中称为 Tank Drive。它的目的是读取操纵杆值并将它们发送到 Drive Base 子系统。请注意，此指令需要 Drive Train 子系统。这将导致它在任何其他尝试使用 Drive Train 时停止运行。

source: Add the Code to do the Driving
fr_ca: Ajoutez le code pour conduite le robot
tr_tr: Sürüş yapmak için Kodu Ekleyin
zh_cn: 把这个代码加入到 Driving 中。

source: Add code to the execute method to do the actual driving. All that is needed is to get the Joystick objects for the left and right drive joysticks and pass them to the Drive Train subsystem. The subsystem just uses them for the tank steering method on its DifferentialDrive object. And we get tank steering.
fr_ca: Ajoutez du code à la méthode d'exécution pour effectuer la conduite réelle. Il suffit d'obtenir les objets Joystick pour les joysticks gauche et droit et de les transmettre au sous-système "Drive Train". Le sous-système les utilise uniquement pour la méthode de pilotage tank sur l'objet DifferentialDrive. Et nous obtenons une conduite en mode Tank.
zh_cn: 将代码添加到执行方法中以进行实际驱动。所需要做的就是获取左右驱动操纵杆的 Joystick 对象并将它们传递给 Drive Train 子系统。子系统仅将它们用于其 DifferentialDrive 对象上的底盘转向方法。我们得到底盘转向。

source: We also filled in the ``end()`` method so that when this command is interrupted or stopped, the motors will be stopped as a safety precaution.
fr_ca: Nous avons également rempli la méthodes ``end()`` afin que lorsque cette commande est interrompue ou arrêtée, les moteurs soient arrêtés par mesure de sécurité.
tr_tr: Ayrıca ``end()`` methodu da doldurduk, böylece bu komut kesildiğinde veya durdurulduğunda, motorlar bir güvenlik önlemi olarak durdurulacak.
zh_cn: 我们还填写了 ``end()`` 方法，以便当此指令被中断或停止时，电机将停止作为安全预防措施。

source: Make Default Command
fr_ca: Créer une commande par défaut
tr_tr: Varsayılan Komutu Yap
zh_cn: 创建 Default Command 。

source: The last step is to make the Tank Drive command be the "Default Command" for the Drive Train subsystem. This means that whenever no other command is using the Drive Train, the Joysticks will be in control. This is probably the desirable behavior. When the autonomous code is running, it will also require the drive train and interrupt the Tank Drive command. When the autonomous code is finished, the DriveWithJoysticks command will restart automatically (because it is the default command), and the operators will be back in control. If you write any code that does teleop automatic driving, those commands should also "require" the DriveTrain so that they too will interrupt the Tank Drive command and have full control.
fr_ca: La dernière étape consiste à faire de la commande Tank Drive la "commande par défaut" du sous-système "Drive Train". Cela signifie que les joysticks seront en contrôle tout le temps de la conduite, sauf lorsqu'une autre commande va utiliser "Drive Train". C'est probablement le comportement souhaitable. Lorsque le code du mode autonome est en cours d'exécution, il nécessitera également "Drive Train" et interrompra la commande Tank Drive. Une fois le code autonome terminé, la commande Tank Drive redémarrera automatiquement (car il s'agit de la commande par défaut) et les opérateurs reprendront le contrôle. Si vous écrivez un code qui effectue une conduite automatisée (en se servant de capteurs, par exemple), ces commandes nécessitent également le DriveTrain et elles aussi vont interrompre la commande Tank Drive pour et prendre le contrôle du déplacement.
tr_tr: Son adım, Tank Tahrik komutunun Aktarma Organları alt sistemi için "Default Command" olmasını sağlamaktır. Bu, Aktarma Sistemini başka bir komut kullanmadığında kumanda kollarının kontrol altında olacağı anlamına gelir. Muhtemelen arzu edilen davranış budur. Otonom kod çalışırken, aynı zamanda aktarma organını da gerektirecek ve Tank Sürüş komutunu kesecektir. Otonom kod bittiğinde, DriveWithJoysticks komutu otomatik olarak yeniden başlayacak (çünkü bu varsayılan komuttur) ve operatörler kontrolü geri alacak. Teleop otomatik sürüş yapan herhangi bir kod yazarsanız, bu komutlar da Tank Sürüşü komutunu kesecek ve tam kontrole sahip olacak şekilde DriveTrain'i "require-gerektirmelidir".
zh_cn: 最后一步是使 Tank Drive 指令成为 Drive Train 子系统的“默认指令”。这意味着只要没有其他指令使用 Drive Train，操纵杆将处于控制之中。这可能是理想的行为。当自动阶段代码运行时，它还需要传动系统并中断 Tank Drive 指令。自动阶段代码完成后，DriveWithJoysticks 指令将自动重新启动（因为它是默认命令），操作员将重新获得控制权。如果您编写任何执行遥控自动驾驶的代码，这些指令也应该“需要”DriveTrain，以便它们也会中断 Tank Drive 指令并拥有完全控制权。

source: Be sure to export your program to C++ or Java before continuing.
fr_ca: Assurez-vous d'exporter votre programme en C++ ou Java avant de continuer.
tr_tr: Devam etmeden önce programınızı C++ veya Java'ya aktardığınızdan emin olun.
zh_cn: 确保在继续前把你的程序导出到 C++ 或 Java。
