Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-4/creating-test-drivetrain-program-cpp-java-python.po
Languages: fr_ca, ja

source: Creating your Test Drivetrain Program (Java/C++/Python)
fr_ca: Création de votre programme test Drivetrain (Java/C++/Python)
ja: テスト用ドライブベースプログラムの作成 (Java/C++/Python)

source: Once everything is installed, we're ready to create a robot program. WPILib comes with several templates for robot programs. Use of these templates is highly recommended for new users; however, advanced users are free to write their own robot code from scratch. This article walks through creating a project from one of the provided examples which has some code already written to drive a basic robot.
fr_ca: Une fois que tout est installé, nous sommes prêts à créer un programme de robot. WPILib est livré avec plusieurs modèles pour les programmes de robots. L’utilisation de ces modèles est fortement recommandée pour les nouveaux utilisateurs; cependant, les utilisateurs avancés sont libres d’écrire leur propre code robot à partir de zéro. Cet article explore la création d’un projet à partir de l’un des exemples fournis qui a un certain code déjà écrit pour piloter un robot de base.
ja: すべてをインストールできたら、ロボットプログラムを作成することが出来ます。WPILibには複数のロボットプログラムテンプレートがあります。初心者にはこれらのテンプレートの利用をおすすめしますが、上級者はゼロからロボットのコードを書いても構いません。この記事では、基本のロボットを動かすコードが既に書かれているテンプレートを利用してプログラムを作成していきます。

source: This guide includes code examples that involve vendor hardware for the convenience of the user. In this document, :term:`PWM` refers to the motor controller included in the KOP. The CTRE tab references the Talon FX motor controller (Falcon 500 motor), but usage is similar for TalonSRX and VictorSPX. The REV tab references the CAN SPARK MAX controlling a brushless motor, but it's similar for brushed motor. There is an assumption that the user has already installed the required :doc:`vendordeps </docs/software/vscode-overview/3rd-party-libraries>` and configured the device(s) (update firmware, assign CAN IDs, etc) according to the manufacturer documentation (`CTRE <https://docs.ctr-electronics.com/>`__ `REV <https://docs.revrobotics.com/sparkmax/gs-sm>`__).
fr_ca: Ce guide comprend des exemples de code qui impliquent le matériel du fournisseur pour la commodité de l'utilisateur. Dans ce document, :term:`PWM` fait référence au contrôleur de moteur inclus dans le KOP. L'onglet CTRE fait référence au contrôleur de moteur Talon FX (moteur Falcon 500), mais l'utilisation est similaire pour TalonSRX et VictorSPX. L'onglet REV fait référence au CAN SPARK MAX contrôlant un moteur sans balais, mais il est similaire pour un moteur à balais. On suppose que l'utilisateur a déjà installé le :doc:`vendordeps ` requis et configuré le(s) périphérique(s) (mettre à jour le micrologiciel, attribuer des ID CAN, etc.) conformément à la documentation du fabricant (`CTRE <https://docs. ctr-electronics.com/>`__ `REV <https://docs.revrobotics.com/sparkmax/gs-sm>`__).
ja: このガイドは、わかりやすさのためベンダのハードウェアを利用するコードを紹介します。このドキュメントでは、 :term:`PWM` はKOP(Kit Of Parts)に入っているモーターコントローラーを指します。CTREはTalon FX (Falcon 500 motor)を指しますが、利用方法はTalonSRXやVictorSPXと似ています。REVはブラシレスモーターをコントロールする、CAN SPARK MAXを指しますが、利用方法はブラシ付きモーターと似ています。以下では、 :doc:`vendordeps </docs/software/vscode-overview/3rd-party-libraries>` を既にインストールしており、製造元のドキュメント（ `CTRE <https://docs.ctr-electronics.com/>`__ `REV <https://docs.revrobotics.com/sparkmax/gs-sm>`__ ）を参考にデバイスの設定(ファームウェアのアップデートやCAN IDの振り分けなど)が行われていることを前提としています。

source: Creating a New WPILib Project (Java/C++)
fr_ca: Création d’un nouveau projet WPILib (Java/C++)
ja: 新規WPILibプロジェクトの作成 (Java/C++)

source: Bring up the Visual Studio Code command palette with :kbd:`Ctrl+Shift+P`. Then, type "WPILib" into the prompt. Since all WPILib commands start with "WPILib", this will bring up the list of WPILib-specific VS Code commands. Now, select the "Create a new project" command:
fr_ca: Affichez la palette de commandes de Visual Studio Code avec :kbd:`Ctrl+Shift+P`. Ensuite, tapez "WPILib" dans l'invite. Étant donné que toutes les commandes WPILib commencent par "WPILib", cela affichera la liste des commandes VS Code spécifiques à WPILib. Maintenant, sélectionnez la commande "Créer un nouveau projet":
ja: :kbd:`Ctrl+Shift+P` を押してVisual Studio Codeのコマンドパレットを開きます。そして、出てきたプロンプトに「WPILib」と入力します。そうすると、WPILibのVS Codeコマンドの一覧が出ます。その中から、「Create a new project」を選びます。

source: Choose "WPILib: Create a new project".
fr_ca: Choisissez "WPILib: Create a new project".
ja: 「WPILib: Create a new project」を選択

source: This will bring up the "New Project Creator Window:"
fr_ca: Cette opération fera apparaître la fenêtre "New Project Creator Window":
ja: すると、「New Project Creator」ウィンドウが表示されます。

source: The different parts of the new project creation window.
fr_ca: Les différentes parties de la fenêtre de création du nouveau projet.
ja: 「New Project Creator」ウィンドウのさまざまな部分。

source: The elements of the New Project Creator Window are explained below:
fr_ca: Les éléments de la fenêtre New Project Creator sont expliqués ci-dessous :
ja: New Project Creator ウィンドウのそれぞれの要素の説明は以下です。

source: **Project Type**: The kind of project we wish to create. For this example, select **Example**
fr_ca: **Project Type**: Le genre de projet que nous voulons créer. Pour cet exemple, sélectionnez **Example**
ja: **Project Type**: 作成するプロジェクトの種類。この例では、 **Example** を選択します。

source: **Language**: This is the language (C++ or Java) that will be used for this project.
fr_ca: **Language**: C’est le langage de programmation (C++ ou Java) qui sera utilisé pour ce projet.
ja: **Language**: プロジェクトで利用する言語 (C++またはJava)。

source: **Project Base**: This box is used to select the base class or example to generate the project from. For this example, select **Getting Started**
fr_ca: **Project Base**: Cette zone est utilisée pour sélectionner la classe de base ou l’exemple à utiliser comme source pour générer le projet. Pour cet exemple, sélectionnez **Getting Started**
ja: **Project Base**: これは、プロジェクトを生成するベース・クラスまたはサンプル・プロジェクトを選択するために使用します。この例では、 **Getting Started** を選びます。

source: **Base Folder**: This determines the folder in which the robot project will be located.
fr_ca: **Base Folder**: Ce paramètre détermine le dossier dans lequel le projet de robot sera situé.
ja: **Base Folder**: ロボットプロジェクトを配置するフォルダ。

source: **Project Name**: The name of the robot project. This also specifies the name that the project folder will be given if the Create New Folder box is checked.
fr_ca: **Project Name**: Le nom du projet de robot. Ce paramètre spécifie également le nom du dossier de projet si la zone Create New Folder est cochée.
ja: **Project Name**: プロジェクト名。「Create New Folder」と書かれたチェックボックスを選択した場合は、プロジェクトのフォルダの名前にもなります。

source: **Create a New Folder**: If this is checked, a new folder will be created to hold the project within the previously-specified folder. If it is *not* checked, the project will be located directly in the previously-specified folder. An error will be thrown if the folder is not empty and this is not checked. project folder will be given if the Create New Folder box is checked.
fr_ca: **Create a New Folder**: Si cette case est cochée, un nouveau dossier sera créé pour contenir le projet dans le dossier précédemment spécifié. Si elle n'est *pas* cochée, le projet sera situé directement dans le dossier précédemment spécifié. Une erreur sera générée si le dossier n'est pas vide et que cette case n'est pas cochée. Un dossier de projet sera créé si la case Create New Folder est cochée.
ja: **Create a New Folder**: 前の項目で指定されたフォルダ内に新しくプロジェクトのフォルダを作るかどうか。チェックされた場合はフォルダを新しく作成し、 *されていない場合は* 直接配置されます。フォルダが空でなくチェックもされていなかった場合エラーが発生します。

source: **Team Number**: The team number for the project, which will be used for package names within the project and to locate the robot when deploying code.
fr_ca: **Team Number**: Numéro d’équipe du projet, qui sera utilisé pour les noms de packages dans le projet et pour localiser le robot au moment du déploiement du code.
ja: **Team Number**: プロジェクト用のチーム番号。プロジェクト内のパッケージ名やロボットにデプロイするために利用されます。

source: **Enable Desktop Support**: Enables unit test and simulation. While WPILib supports this, third party software libraries may not. If libraries do not support desktop, then your code may not compile or may crash. It should be left unchecked unless unit testing or simulation is needed and all libraries support it. For this example, do not check this box.
fr_ca: **Enable Desktop Support**: Permet de faire le test unitaire et la simulation. Bien que WPILib prenne en charge cette fonctionnalité, pour les bibliothèques de logiciels tiers cette prise en charge n'est pas garantie. Si les bibliothèques logicielles ne prennent pas en charge les applications de bureau, votre code peut ne pas compiler ou planter. Cette case doit être laissée non cochée à moins que des tests unitaires ou une simulation ne soient nécessaires et que toutes les bibliothèques de logiciels le prennent en charge. Pour cet exemple, ne cochez pas cette case.
ja: **Enable Desktop Support**: ユニットテストやシミュレーションを行うかどうか。WPILibはこれをサポートしていますが、サードパーティソフトウェアライブラリはそうとは限りません。ライブラリがデスクトップをサポートしていなかった場合、コンパイルが不可能であったりクラッシュしたりする可能性があります。ユニットテストやシミュレーションが必要で、すべてのライブラリがサポートしていない限りチェックするべきではありません。この例では、チェックしません。

source: Once all the above have been configured, click "Generate Project" and the robot project will be created.
fr_ca: Une fois que tout ce qui précède a été configuré, cliquez sur "Generate Project" et le projet robot sera créé.
ja: 上記項目を設定したら、「Generate Project」をクリックします。そうするとロボットのプロジェクトが作成されます。

source: Any errors in project generation will appear in the bottom right-hand corner of the screen.
fr_ca: Toutes les erreurs lors de la génération de projet apparaîtront dans le coin inférieur droit de l’écran.
ja: プロジェクト作成のエラーは、画面の右下隅に表示されます。

source: Creating projects on OneDrive is not supported as OneDrive's caching interferes with the build system. Some Windows installations put the Documents and Desktop folders on OneDrive by default.
fr_ca: La création de projets sur OneDrive n'est pas prise en charge car la mise en cache de OneDrive interfère avec le système de build. Certaines installations Windows placent par défaut les dossiers Documents et Bureau sur OneDrive.
ja: OneDriveのキャッシュがビルドシステムに干渉するため、OneDrive上でのプロジェクトの作成はサポートされていません。Windowsのインストールによっては、デフォルトでOneDriveに「ドキュメント」と「デスクトップ」フォルダが置かれています。

source: Opening The New Project
fr_ca: Ouverture du nouveau projet
ja: 新しいプロジェクトを開く

source: Open Project Dialog in VS Code
fr_ca: Ouvrir la boîte de dialogue du projet dans VS Code
ja: VS Codeの「プロジェクトを開く」ダイアログ

source: After successfully creating your project, VS Code will give the option of opening the project as shown above. We can choose to do that now or later by typing :kbd:`Ctrl+K` then :kbd:`Ctrl+O` (or just :kbd:`Command+O` on macOS) and select the folder where we saved our project.
fr_ca: Après avoir réussi à créer votre projet, VS Code vous donnera la possibilité d'ouvrir le projet comme indiqué ci-dessus. Nous pouvons choisir de le faire maintenant ou plus tard en tapant :kbd:`Ctrl+K` puis :kbd:`Ctrl+O` (ou simplement :kbd:`Command+O` sur macOS) et sélectionner le dossier où nous avons enregistré notre projet.
ja: プロジェクトの作成後、VS Codeは上記のようにプロジェクトを開くかどうかの選択肢を表示します。Yesを選択するか、後ほど :kbd:`Ctrl+K` を押してから :kbd:`Ctrl+O` を押し(macOSでは単に :kbd:`Command+O` ) 、プロジェクトを保存したフォルダを選択します。

source: Trusted Workspace dialog in VS Code.
fr_ca: Boîte de dialogue Espace de travail de confiance dans VS Code.
ja: VS Codeの信頼できるワークスペースかのダイアログ。

source: Click :guilabel:`Yes I trust the authors`.
fr_ca: Cliquez sur :guilabel:`Yes I trust the authors`. (Oui, je fais confiance aux auteurs.)
ja: :guilabel:`はい、作成者を信頼します` をクリックしてください。

source: Once opened we will see the project hierarchy on the left. Double clicking on the file will open that file in the editor.
fr_ca: Une fois ouvert, nous pouvons voir la hiérarchie du projet à gauche. En double-cliquant sur un fichier, on ouvre ce fichier dans l’éditeur.
ja: プロジェクトを開くと、左の方にプロジェクト階層が表示されます。ファイルをダブルクリックするとエディタにてファイルを表示できます。

source: The robot.java code shown after opening a new project.
fr_ca: Le code robot.java affiché après l'ouverture d'un nouveau projet.
ja: 新規プロジェクトを開くとrobot.javaが表示されます。

source: C++ Configurations (C++ Only)
fr_ca: Configurations C++ (C++ uniquement)
ja: C++の設定 (C++のみ)

source: For C++ projects, there is one more step to set up IntelliSense. Whenever we open a project, we should get a pop-up in the bottom right corner asking to refresh C++ configurations. Click "Yes" to set up IntelliSense.
fr_ca: Pour les projets C++, il y a une étape de plus pour configurer IntelliSense. Chaque fois que nous ouvrons un projet, nous devrions obtenir un pop-up dans le coin inférieur droit demandant de rafraîchir les configurations C++. Cliquez sur "Yes" pour configurer IntelliSense.
ja: C++プロジェクトでは、IntelliSenseをセットアップしなければなりません。プロジェクトを開くと、右下隅にC++の設定をリフレッシュするかを聞くポップアップが出現します。「はい」をクリックしてIntelliSenseをセットアップします。

source: You must choose "Yes" to refresh the C++ configurations.
fr_ca: Vous devez choisir "Oui" pour actualiser les configurations C++.
ja: C++の設定をリフレッシュするには、「はい」を選びます。

source: Creating a New WPILib Project (Python)
ja: 新規WPILibプロジェクトの作成 (Python)

source: Running the ``robotpy init`` command will initialize a new robot project:
ja: ``robotpy init`` コマンドを実行すると、新規ロボットプロジェクトが初期化されます：

source: This will create a ``robot.py`` and ``pyproject.toml`` file, but will not overwrite an existing file.
ja: そうすると、 ``robot.py`` と ``pyproject.toml`` ファイルが作成されますが、既存のファイルは上書きされません。

source: The ``pyproject.toml`` file contains the requirements for your project, which are downloaded and installed via the ``robotpy sync`` command.
ja: ``robotpy sync`` コマンドを実行することで、 ``pyproject.toml`` ファイルに含まれているプロジェクトの依存関係がダウンロードされ、インストールされます。

source: The ``robot.py`` file is where you will put the your Robot class.
ja: ``robot.py`` ファイルは、Robotクラスを配置する場所です。

source: Basic Drivetrain example
fr_ca: Exemple de transmission de base
ja: 基本ドライブベースの例

source: First, here is what a simple code can look like for a Drivetrain with PWM controlled motors (such as SparkMax).
fr_ca: Tout d'abord, voici à quoi peut ressembler un code simple pour une transmission avec des moteurs contrôlés par PWM (tels que SparkMax).
ja: 最初に、PWM制御モーター（SparkMaxなど）を使ったドライブトレインの簡単なコードを示します。

source: the Python example below is from `<https://github.com/robotpy/examples/tree/main/GettingStarted>`__
fr_ca: l'exemple Python ci-dessous provient de `<https://github.com/robotpy/examples/tree/main/GettingStarted>`__
ja: 以下のPythonの例はここから引用しています： `<https://github.com/robotpy/examples/tree/main/GettingStarted>`__

source: Now let's look at various parts of the code.
fr_ca: Examinons maintenant différentes parties du code.
ja: では、コードの色々な部分を見てみましょう。

source: Our code needs to reference the components of WPILib that are used. In C++ this is accomplished using ``#include`` statements; in Java it is done with ``import`` statements. The program references classes for ``Joystick`` (for driving), ``PWMSparkMax`` / ``WPI_TalonFX`` / ``CANSparkMax (for controlling motors), ``TimedRobot`` (the base class used for the example), ``Timer`` (used for autonomous), and ``DifferentialDrive`` (for connecting the joystick control to the motors).
fr_ca: Notre code doit référencer les composants de WPILib qui sont utilisés. Cela se fait en utilisant les instructions ``#include`` (en C++) ou ``import`` (en Java). Le programme fait référence aux classes pour ``Joystick`` (pour le pilotage), ``PWMSparkMax`` / ``WPI_TalonFX`` / ``CANSparkMax (pour la commande des moteurs), ``TimedRobot`` (la classe de base utilisée pour l'exemple) , ``Timer`` (utilisé pour le mode autonome) et ``DifferentialDrive`` (pour connecter la commande par joystick aux moteurs).
ja: コードはWPILibのコンポーネントを参照する必要があります。C++では、 ``#include`` 文を、Javaでは ``import`` 文を利用することで行なえます。プログラムは、次のようなクラスを参照しています： ``Joystick`` (運転用), ``PWMSparkMax`` / ``WPI_TalonFX`` / ``CANSparkMax`` (モータの制御用), ``TimedRobot`` (例のための基本クラス), ``Timer`` (自動制御用), と ``DifferentialDrive`` (ジョイスティックでのドライブベースの操作用)。

source: Defining the variables for our sample robot
fr_ca: Définition des variables de notre prototype de robot
ja: サンプルロボット用の変数の定義

source: The sample robot in our examples will have a joystick on USB port 0 for arcade drive and two motors on PWM ports 0 and 1 (Vendor examples use CAN with IDs 1 and 2). Here we create objects of type DifferentialDrive (m_robotDrive), Joystick (m_stick) and Timer (m_timer). This section of the code does three things:
fr_ca: Le robot de nos exemples a un joystick branché au port USB 0 pour le mode Arcade drive et deux moteurs branchés aux ports PWM 0 et 1 (les exemples des tierces parties utilisent CAN avec les ID 1 et 2). Ici nous créons des objets de type DifferentialDrive(m_robotDrive), Joystick(m_stick) et Timer(m_timer). Cette section du code accomplit trois choses:
ja: サンプルロボットには、USBポート0番にarcade drive用のジョイスティックが、PWMポート0番と1番(CANでIDを0と1に設定します)に2つのモーターがあります。そして、DifferentialDrive型(m_robotDrive)、Joystick型(m_stick)、Timer型(m_timer)のオブジェクトを作成しています。このセクションでは、3つのことを行っています：

source: Defines the variables as members of our Robot class.
fr_ca: Définit les variables en tant que membres de notre classe Robot.
ja: Robotクラスのメンバとして、変数を定義します。

source: Initializes the variables.
fr_ca: Initialise les variables.
ja: 変数を初期化します。

source: The variable initializations for C++ are in the ``private`` section at the bottom of the program. This means they are private to the class (``Robot``). The C++ code also sets the Motor Safety expiration to 0.1 seconds (the drive will shut off if we don't give it a command every .1 seconds) and starts the ``Timer`` used for autonomous.
fr_ca: L'initialisation des variables en C++ se trouve dans la section ``private`` en bas du programme. Cela signifie qu’elles sont privées à la classe ``Robot``. Le code C++ configure également le paramètre ``Motor Safety expiration`` à 0,1 seconde (le déplacement s’arrêtera si nous ne lui donnons pas une commande à toutes les 0,1 secondes) et démarre le ``Timer`` utilisé pour le mode autonome.
ja: C++の変数初期化はプログラム下部の ``private`` セクションで行われています。これは、クラス(``Robot``)でプライベートであるということです。C++コードでは、モーター安全期限を0.1秒に設定し(0.1秒以上命令がないとドライブベースは停止します)、自動制御用に ``Timer`` を開始しています。

source: Robot Initialization
fr_ca: Initialisation du robot
ja: ロボットの初期化

source: The ``RobotInit`` method is run when the robot program is starting up, but after the constructor. The ``RobotInit`` for our sample program inverts the right side of the drivetrain. Depending on your drive setup, you might need to invert the left side instead.
ja: ``RobotInit`` メソッドは、ロボットが起動した際に実行されますが、コンストラクタの実行後です。サンプルプログラムの ``RobotInit`` はドライブトレインの右側を逆転させます。ドライブのセットアップによっては、代わりに左側を逆転させる必要があるかもしれません。

source: In C++, the drive inversion is handled in the ``Robot()`` constructor above.
ja: C++で、ドライブの逆転は上記の ``Robot()`` コンストラクタで扱われます。

source: Simple Autonomous Example
fr_ca: Exemple de mode autonome simple
ja: シンプルなAutonomousの例

source: The ``AutonomousInit`` method is run once each time the robot transitions to autonomous from another mode. In this program, we restart the ``Timer`` in this method.
fr_ca: La méthode ``AutonomousInit`` est exécutée une seule fois au moment où le robot passe au mode autonomie à partir d’un autre mode. Dans le programme, nous redémarrons le ``Timer`` dans cette méthode.
ja: ``AutonomousInit`` メソッドは別のモードからAutonomousモードに変化した瞬間に実行されます。このプログラムでは、 ``Timer`` をリスタートしています。

source: ``AutonomousPeriodic`` is run once every period while the robot is in autonomous mode. In the ``TimedRobot`` class the period is a fixed time, which defaults to 20ms. In this example, the periodic code checks if the timer is less than 2 seconds and if so, drives forward at half speed using the ``ArcadeDrive`` method of the ``DifferentialDrive`` class. If more than 2 seconds has elapsed, the code stops the robot drive.
fr_ca: ``AutonomousPeriodic`` est exécuté une fois par période lorsque que le robot est en mode autonome. Dans la classe ``TimedRobot`` la période est de durée fixe et par défaut est égale à 20ms. Dans cet exemple, le code périodique vérifie si la minuterie est inférieure à 2 secondes et, dans ce cas, fait avancer le robot à mi-vitesse à l’aide de la méthode ``ArcadeDrive`` de la classe ``DifferentialDrive``. S'il s'est écoulé plus de 2 secondes, le code met fin au déplacement du robot.
ja: ``AutonomousPeriodic`` はロボットがAutonomousモードの間、特定の間隔で何回も実行されます。 ``TimedRobot`` クラスでは間隔は一定で、デフォルトで20msです。この例では、タイマーが2秒以下であるかをチェックし、もしそうなら ``DifferentialDrive`` クラスの ``ArcadeDrive`` メソッドを用いて半分のスピードで前進します。2秒経過したら、ロボットの動きを止めます。

source: Joystick Control for Teleoperation
fr_ca: Contrôle par Joystick pendant le mode téléopéré
ja: Teleopでのジョイスティック操作

source: Like in Autonomous, the Teleop mode has a ``TeleopInit`` and ``TeleopPeriodic`` function. In this example we don't have anything to do in ``TeleopInit``, it is provided for illustration purposes only. In ``TeleopPeriodic``, the code uses the ``ArcadeDrive`` method to map the Y-axis of the ``Joystick`` to forward/back motion of the drive motors and the X-axis to turning motion.
fr_ca: Comme dans le mode Autonomous, le mode Teleop possède les fonctions ``TeleopInit`` et ``TeleopPeriodic``. Dans cet exemple, nous n’avons rien à faire dans ``TeleopInit``, qui est fourni uniquement à des fins d’illustration. Dans ``TeleopPeriodic``, le code utilise la méthode ``ArcadeDrive`` pour faire correspondre l’axe Y du ``Joystick`` au mouvement rectiligne avancer/reculer des moteurs d’entraînement et l’axe X pour le mouvement de rotation.
ja: Autonomousの様に、Teleopモードには ``TeleopInit`` 関数と ``TeleopPeriodic`` 関数があります。この例では、 ``TeleopInit`` では何もしておらず、説明のために記述されているだけです。 ``TeleopPeriodic`` では、 ``Joystick`` のY軸をドライブベースの前進/後進に、X軸を回転動作に対応させるため ``ArcadeDrive`` メソッドを使用しています。

source: Test Mode
fr_ca: Mode test
ja: テストモード

source: Test Mode is used for testing robot functionality. Similar to ``TeleopInit``, the ``TestInit`` and ``TestPeriodic`` methods are provided here for illustrative purposes only.
fr_ca: Le mode test est utilisé afin de tester la fonctionnalité du robot. À l’instar de ``TeleopInit``, les méthodes ``TestInit`` et ``TestPeriodic`` sont fournies ici uniquement à des fins d'illustration.
ja: Testモードはロボットの機能のテストのために使われます。 ``TeleopInit`` と同様に、 ``TestInit`` や ``TestPeriodic`` は説明のために記述されています。

source: Deploying the Project to a Robot
fr_ca: Déploiement du code projet sur un robot
ja: ロボットへのデプロイ

source: :doc:`Deploy Python code </docs/software/python/subcommands/deploy>`
ja: :doc:`Pythonコードをデプロイする </docs/software/python/subcommands/deploy>`

source: The ``RobotInit`` method is run when the robot program is starting up, but after the constructor. The ``RobotInit`` for our sample program doesn't do anything. If we wanted to run something here we could provide the code above to override the default).
fr_ca: La méthode ``RobotInit`` est exécutée lorsque le programme robot démarre, mais après le constructeur. La méthode ``RobotInit`` dans notre exemple de programme ne fait rien. Si nous voulions exécuter quelque chose ici, nous pourrions fournir le code ci-dessus et surchager la méthode par défaut.

source: Please see the instructions :ref:`here <docs/software/vscode-overview/deploying-robot-code:Building and Deploying Robot Code>` for deploying the program onto a robot.
fr_ca: Veuillez consulter les instructions :ref:`ici <docs/software/vscode-overview/deploying-robot-code:Building and Deploying Robot Code>` pour déployer le programme sur un robot.
