Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-4/creating-benchtop-test-program-cpp-java.po
Languages: es_mx, tr_tr, zh_cn

source: Creating your Benchtop Test Program (C++/Java)
es_mx: Creando tu programa de prueba (C++/Java)
tr_tr: Masaüstü Test Programınızı Oluşturma (C ++ / Java)
zh_cn: 创建您的台式测试程序（C ++ / Java）

source: Once everything is installed, we're ready to create a robot program. WPILib comes with several templates for robot programs. Use of these templates is highly recommended for new users; however, advanced users are free to write their own robot code from scratch. This article walks through creating a project from one of the provided examples which has some code already written to drive a basic robot.
es_mx: Una vez que todo esté instalado, estamos listos para crear un programa para el robot. WPILib viene con varias plantillas para los programas. El uso de estas de estas plantillas está altamente recomendado para nuevos usuarios; sin embargo, los usuarios avanzados son libres para escribir su propio código para el robot desde cero. Este artículo es una guía paso a paso para crear un proyecto desde uno de los ejemplos dados, el cual tiene algo de código ya escrito para manejar un robot básico.
tr_tr: Her şey kurulduktan sonra bir robot programı oluşturmaya hazırız. WPILib, robot programları için çeşitli şablonlarla birlikte gelir. Bu şablonların kullanımı yeni kullanıcılar için şiddetle tavsiye edilir; ancak, ileri düzey kullanıcılar kendi robot kodlarını sıfırdan yazmakta özgürdür. Bu makale, temel bir robotu sürmek için önceden yazılmış bazı kodlara sahip olan örneklerden birinden bir proje oluşturmayı açıklamaktadır.
zh_cn: 一旦所有内容安装完毕，我们就可以创建机器人程序了。WPILib 附带了几个机器人程序的模板。强烈建议新用户使用这些模板;但是，高级用户可以从头开始自由编写自己的机器人代码。本文介绍从提供的示例之一创建项目，该示例包含一些代码，用于驱动基础机器人。

source: Creating a New WPILib Project
es_mx: Creando un nuevo proyecto WPILib
tr_tr: Yeni bir WPILib Projesi Oluşturma
zh_cn: 创建新的 WPILib 项目

source: Bring up the Visual Studio Code command palette with :kbd:`Ctrl+Shift+P`:
es_mx: Abra la paleta de comandos de Visual Studio Code con :kbd:`Ctrl+Shift+P`:
tr_tr: Visual Studio Code komut paletini şu şekilde getirin :kbd:`Ctrl+Shift+P`:

source: |Command Palette|
tr_tr: |Command Palette| -Komut Paleti

source: Then, type "WPILib" into the prompt. Since all WPILib commands start with "WPILib," this will bring up the list of WPILib-specific VS Code commands:
es_mx: Luego, escriba “WPILib” en el aviso. Dado que todos los comandos de WPILib empiezan con “WPILib,” esto abrirá la lista de comandos WPILib específicos para VS Code:
tr_tr: Ardından, bilgi istemine "WPILib" yazın. Tüm WPILib komutları "WPILib" ile başladığından, bu, WPILib'e özgü VS Kodu komutlarının listesini getirecektir:

source: |WPILib Commands|
tr_tr: |WPILib Commands| - WPILib Komutları

source: Now, select the "Create a new project" command:
es_mx: Ahora, selecciona el comando “Create a new project”:
tr_tr: Şimdi, "Create a new project-Yeni proje oluştur" komutunu seçin:

source: |Create New Project|
tr_tr: |Create New Project| - Yeni Proje Oluştur

source: This will bring up the "New Project Creator Window:"
es_mx: Esto abrirá la ventana “New Project Creator Window:”
tr_tr: Bu, "Yeni Proje Oluşturucu Penceresini" getirecektir:
zh_cn: 这将打开“创建新项目窗口”：

source: |New Project Creator|
tr_tr: |New Project Creator| - Yeni Proje Oluşturucu

source: The elements of the New Project Creator Window are explained below:
es_mx: Los elementos de la ventana New Project Creator se explican a continuación:
tr_tr: Yeni Proje Oluşturucu Penceresinin öğeleri aşağıda açıklanmıştır:
zh_cn: 创建新建项目窗口的元素说明如下：

source: **Project Type**: The kind of project we wish to create. For this example, select **Example**
es_mx: **Project Type**: El tipo de proyecto que deseamos crear. Para este ejemplo, seleccione **Example**
tr_tr: **Project Type-Proje Türü **: Oluşturmak istediğimiz proje türü. Bu örnek için **Example-Örnek ** seçin
zh_cn: **项目类型**：我们希望创建的项目类型。对于此示例，请选择**示例**

source: **Language**: This is the language (C++ or Java) that will be used for this project.
es_mx: **Language**: Este es el lenguaje (C++ o Java) que se utilizará para este proyecto.
tr_tr: ** Language-Dil **: Bu proje için kullanılacak dildir (C ++ veya Java).
zh_cn: **语言**：这是将用于该项目的语言（C ++或Java）。

source: **Project Base**: This box is used to select the base class or example to generate the project from. For this example, select **Getting Started**
es_mx: **Project Base**: Este recuadro se utiliza para generar el proyecto desde la clase base o ejemplo. Para este ejemplo, seleccione **Getting Started**
tr_tr: **Project Base- Proje Tabanı**: Bu kutu, projenin oluşturulacağı temel sınıfı veya örneği seçmek için kullanılır. Bu örnek için, ** Getting Started-Başlarken** 'yi seçin.
zh_cn: ** Project Base **：此框用于选择要从中生成项目的基类或示例。在此示例中，选择“入门” **

source: **Base Folder**: This determines the folder in which the robot project will be located.
es_mx: **Base Folder**: determina la carpeta en la que se ubicará el proyecto del robot.
tr_tr: **Base Folder-Temel Klasör**: Bu, robot projesinin konumlandırılacağı klasörü belirler.
zh_cn: **基础文件夹**：确定机器人项目所在的文件夹。

source: **Project Name**: The name of the robot project. This also specifies the name that the
es_mx: **Project Name**: El nombre del proyecto del robot. Esto también especifica el nombre que el
tr_tr: **Project Name-Proje Adı**: Robot projesinin adı. Bu aynı zamanda,

source: **Create a New Folder**: If this is checked, a new folder will be created to hold the project within the previously-specified folder. If it is *not* checked, the project will be located directly in the previously-specified folder. An error will be thrown if the folder is not empty and this is not checked. project folder will be given if the Create New Folder box is checked.
es_mx: **Create a New Folder**: Si está marcada, se creará una nueva carpeta para albergar el proyecto dentro de la carpeta previamente especificada. Si está marcado como *no* el proyecto se ubicará directamente en la carpeta previamente especificada. Se producirá un error si la carpeta no está vacía y esto no está marcado. La carpeta del proyecto se dará si la casilla Crear nueva carpeta está marcada.
tr_tr: **Create a New Folder-Yeni Klasör Oluştur**: Bu işaretlenirse, projeyi önceden belirtilen klasör içinde tutmak için yeni bir klasör oluşturulur. *not-işaretli değilse*, proje doğrudan önceden belirtilen klasörde yer alacaktır. Klasör boş değilse ve bu kontrol edilmezse bir hata atılacaktır. Yeni Klasör Oluştur kutusu işaretlenmiş ise proje klasörü verilecektir.
zh_cn: **创建新文件夹**：如果选中，将创建一个新文件夹以将项目保存在先前指定的文件夹中。如果未选中，则项目将直接位于先前指定的文件夹中。如果文件夹不为空且未选中，将引发错误。如果选中“创建新文件夹”框，则将提供项目文件夹。

source: **Team Number**: The team number for the project, which will be used for package names within the project and to locate the robot when deploying code.
es_mx: **Team Number**: El número de equipo para el proyecto, el cual se utilizará para los nombres de paquetes dentro del proyecto y para localizar el robot al implementar el código.
tr_tr: **Team Number-Takım Numarası**: Proje içindeki paket isimleri için ve kodu dağıtırken robotu bulmak için kullanılacak proje takım numarası.
zh_cn: **团队编号**：项目的团队编号，将用于项目中的程序包名称并在部署代码时定位机器人。

source: **Enable Desktop Support**: Enables unit test and simulation. While WPILib supports this, third party software libraries may not. If libraries do not support desktop, then your code may not compile or may crash. It should be left unchecked unless unit testing or simulation is needed and all libraries support it. For this example, do not check this box.
es_mx: **Enable Desktop Support** Habilita las pruebas unitarias y la simulación. Mientras que WPILib soporta esto, las bibliotecas de software de terceros pueden no hacerlo. Si las bibliotecas no soportan el escritorio, entonces su código puede no compilar o puede fallar. Debe dejarse sin marcar a menos que la prueba unitaria o la simulación sean necesarias y todas las bibliotecas lo soporten. Para este ejemplo, no marque esta casilla.
tr_tr: **Enable Desktop Support-Masaüstü Desteğini Etkinleştir**: Birim testi ve simülasyonu etkinleştirir. WPILib bunu desteklerken, üçüncü taraf yazılım kitaplıkları desteklemeyebilir. Kitaplıklar masaüstünü desteklemiyorsa, kodunuz derlenmeyebilir veya çökebilir. Birim testi veya simülasyon gerekmedikçe ve tüm kitaplıklar bunu desteklemedikçe, işaretlenmeden bırakılmalıdır. Bu örnek için bu kutuyu işaretlemeyin.
zh_cn: **启用桌面支持**：启用单元测试和模拟。尽管WPILib支持此功能，但第三方软件库可能不支持。如果库不支持桌面，则您的代码可能无法编译或崩溃。除非需要进行单元测试或仿真并且所有库都支持它，否则应将其保留为未选中状态。对于此示例，请勿选中此框。

source: Once all the above have been configured, click "Generate Project" and the robot project will be created.
es_mx: Una vez que se haya configurado todo lo anterior, haga clic en “Generate Project” y el proyecto del robot será generado.
tr_tr: Yukarıdakilerin tümü yapılandırıldıktan sonra, "Generate Project-Proje Oluştur" u tıklayın ve robot projesi oluşturulacaktır.
zh_cn: 完成以上所有配置后，单击“生成项目”，将创建机器人项目。

source: Any errors in project generation will appear in the bottom right-hand corner of the screen.
es_mx: Cualquier error en la generación del proyecto aparecerá en la esquina inferior derecha de la pantalla.
tr_tr: Proje oluşturmadaki herhangi bir hata, ekranın sağ alt köşesinde görünecektir.
zh_cn: 项目生成中的任何错误将显示在屏幕的右下角。

source: Opening The New Project
es_mx: Abriendo el nuevo proyecto
tr_tr: Yeni Projeyi Açmak
zh_cn: 打开新项目

source: After successfully creating your project, VS Code will give the option of opening the project as shown below. We can choose to do that now or later by typing :kbd:`Ctrl+K` then :kbd:`Ctrl+O` (or just :kbd:`Command+O` on macOS) and select the folder where we saved our project.
tr_tr: Projenizi başarıyla oluşturduktan sonra VS Code, aşağıda gösterildiği gibi projeyi açma seçeneği verecektir. Bunu şimdi veya daha sonra şunu yazarak yapmayı seçebiliriz :kbd:`Ctrl+K` sonra :kbd:`Ctrl+O` (veya macOS'ta sadece: kbd: `Command + O`) ve kaydettiğimiz klasörü seçebiliriz. proje.

source: Once opened we will see the project hierarchy on the left. Double clicking on the file will open that file in the editor.
es_mx: Una vez abierto, veremos la jerarquía del proyecto a la izquierda. Al hacer doble clic en el archivo se abre el archivo en el editor.
tr_tr: Açıldıktan sonra solda proje hiyerarşisini göreceğiz. Dosyaya çift tıklamak o dosyayı düzenleyicide açacaktır.
zh_cn: 打开后，我们将在左侧看到项目层次结构。双击文件将在编辑器中打开该文件。

source: |Opened Robot Project|
tr_tr: |Opened Robot Project| - Açılan Robot Projesi

source: C++ Configurations (C++ Only)
es_mx: Configuraciones de C++ (solo C++)
tr_tr: C ++ Yapılandırmaları (Yalnızca C ++)
zh_cn: C ++配置（仅C ++）

source: For C++ projects, there is one more step to set up IntelliSense. Whenever we open a project, we should get a pop-up in the bottom right corner asking to refresh C++ configurations. Click "Yes" to set up IntelliSense.
es_mx: Para proyectos C++, hay un paso más para configurar IntelliSense. Cada vez que abrimos un proyecto, debería aparecernos una ventana emergente en la esquina inferior derecha pidiendo actualizar las configuraciones de C++. Haga clic en "Yes" para configurar IntelliSense
tr_tr: C ++ projeleri için IntelliSense'i kurmak için bir adım daha vardır. Ne zaman bir proje açsak, sağ alt köşede C ++ yapılandırmalarını yenilememizi isteyen bir pencere açmalıyız. IntelliSense'i kurmak için "Yes-Evet" i tıklayın.
zh_cn: 对于C ++项目，还有另外一步来设置IntelliSense。每当我们打开一个项目时，我们都应该在右下角出现一个弹出窗口，要求刷新C ++配置。单击“是”以设置IntelliSense。

source: |C++ Configurations|
tr_tr: |C++ Configurations| - C ++ Yapılandırmaları

source: Imports/Includes
tr_tr: Imports/Includes-İthalat / İçerir
zh_cn: 启用

source: Our code needs to reference the components of WPILib that are used. In C++ this is accomplished using ``#include`` statements; in Java it is done with ``import`` statements. The program references classes for ``Joystick`` (for driving), ``PWMVictorSPX`` (for controlling motors), ``TimedRobot`` (the base class used for the example), ``Timer`` (used for autonomous), ``DifferentialDrive`` (for connecting the joystick control to the motors), and ``LiveWindow`` (C++ only).
tr_tr: Kodumuzun kullanılan WPILib bileşenlerine başvurması gerekir. C ++ 'da bu, ``#include`` ifadeleri kullanılarak gerçekleştirilir; Java'da bu, ``import`` ifadeleriyle yapılır. Program, `` Joystick '' (sürüş için), ``PWMVictorSPX`` (motorları kontrol etmek için), ``TimedRobot`` (örnek için kullanılan temel sınıf), ``Timer`` (otonom için kullanılır. ), ``DifferentialDrive`` (joystick kontrolünü motorlara bağlamak için) ve ``LiveWindow`` (yalnızca C ++).

source: Defining the variables for our sample robot
es_mx: Definiendo las variables para nuestro robot de muestra
tr_tr: Örnek robotumuz için değişkenleri tanımlama
zh_cn: 定义示例机器人的变量

source: The sample robot in our examples will have a joystick on USB port 0 for arcade drive and two motors on PWM ports 0 and 1. Here we create objects of type DifferentialDrive (m_robotDrive), Joystick (m_stick) and time (m_timer). This section of the code does three things:
es_mx: El robot de muestra en nuestros ejemplos tendrá un joystick en el puerto USB 0 para la unidad arcade y dos motores en los puertos PWM 0 y 1. Aquí creamos objetos de tipo DifferentialDrive (m_robotDrive), Joystick (m_stick) y tiempo (m_timer). Esta sección del código tiene tres cosas
tr_tr: Örneklerimizdeki örnek robot, arcade sürücüsü için USB port 0'da bir joystick'e ve PWM portu 0 ve 1'de iki motora sahip olacaktır. Burada, DifferentialDrive (m_robotDrive), Joystick (m_stick) ve zaman (m_timer) tipi nesneler oluşturuyoruz. Kodun bu bölümü üç şey yapar:

source: Defines the variables as members of our Robot class.
es_mx: Define las variables como miembros de nuestra clase Robot.
tr_tr: Değişkenleri Robot sınıfımızın üyeleri olarak tanımlar.
zh_cn: 将变量定义为我们的Robot类的成员。

source: Initializes the variables.
es_mx: Inicializa las variables.
tr_tr: Değişkenleri başlatır.
zh_cn: 初始化变量。

source: The variable initializations for C++ are in the ``private`` section at the bottom of the program. This means they are private to the class (``Robot``). The C++ code also sets the Motor Safety expiration to 0.1 seconds (the drive will shut off if we don't give it a command every .1 seconds) and starts the ``Timer`` used for autonomous.
es_mx: La inicialización de variables para C++ está en la sección ``private`` en la parte inferior del programa. Esto significa que son privados para la clase (``Robot``). El código C++ también establece la expiración de la seguridad del motor de 0.1 segundos (la unidad se apagará si no le damos un comando cada .1 segundos) e inicia el ``Timer`` utilizado para autónomo.
tr_tr: C ++ için değişken başlatmalar, programın altındaki ``private- özel`` bölümdedir. Bu, sınıfa özel oldukları anlamına gelir (``Robot``). C ++ kodu ayrıca Motor Güvenliği sona erme süresini 0,1 saniyeye ayarlar (her .1 saniyede bir komut vermezsek sürücü kapanır) ve otonom için kullanılan ``Timer-Zamanlayıcıyı`` başlatır.
zh_cn: C ++的变量初始化位于程序底部的“private”部分。这意味着它们是该类（``Robot''）的私有对象。 C ++代码还将电机安全到期时间设置为0.1秒（如果我们每隔0.1秒不给驱动器发出命令，驱动器将关闭），并启动用于自动阶段的“Timer”。

source: Robot Initialization
es_mx: Inicialización del robot
tr_tr: Robot Başlatma
zh_cn: 机器人初始化

source: Simple Autonomous Example
es_mx: Ejemplo de un autónomo simple
tr_tr: Basit Otonom Örnek
zh_cn: 简单的自动阶段示例

source: The ``AutonomousInit`` method is run once each time the robot transitions to autonomous from another mode. In this program, we reset the ``Timer`` and then start it in this method.
es_mx: El método ``AutonomousInit`` se ejecuta una vez cada vez que el robot pasa a ser autónomo de otro modo En este programa, reiniciamos el ``Timer`` y luego lo iniciamos en este método.
tr_tr: ``AutonomousInit`` yöntemi, robot başka bir moddan otonom moda her geçişinde bir kez çalıştırılır. Bu programda ``Zamanlayıcı`` yı sıfırlıyoruz ve ardından bu yöntemde başlatıyoruz.
zh_cn: 每次机器人从另一种模式转换为自主模式时，都会运行一次“ AutonomousInit”方法。在此程序中，我们重置“ Timer”，然后以这种方法启动它。

source: ``AutonomousPeriodic`` is run once every period while the robot is in autonomous mode. In the ``TimedRobot`` class the period is a fixed time, which defaults to 20ms. In this example, the periodic code checks if the timer is less than 2 seconds and if so, drives forward at half speed using the ``ArcadeDrive`` method of the ``DifferentialDrive`` class. If more than 2 seconds has elapsed, the code stops the robot drive.
es_mx: ``AutonomousPeriodic`` se ejecuta una vez cada período mientras el robot está en modo autónomo. En la clase ``TimedRobot`` el período es un tiempo fijo, que por defecto es de 20 ms. En este ejemplo, el código periódico verifica si el temporizador es inferior a 2 segundos y, de ser así, avanza a media velocidad utilizando el método ``ArcadeDrive`` de la clase ``DifferentialDrive``. Si tiene más de 2 segundos transcurridos, el código detiene el accionamiento del robot.
tr_tr: Robot otonom moddayken ``AutonomousPeriodic`` her periyotta bir kez çalıştırılır. ``TimedRobot`` sınıfında periyot, varsayılan olarak 20 ms olan sabit bir zamandır. Bu örnekte, periyodik kod, zamanlayıcının 2 saniyeden az olup olmadığını kontrol eder ve öyleyse, ``DifferentialDrive`` sınıfının `` ArcadeDrive`` yöntemini kullanarak yarı hızda ilerler. 2 saniyeden fazla bir süre geçtiyse, kod robot sürücüsünü durdurur.
zh_cn: 机器人处于自主模式时，每个周期运行一次``AutonomousPeriodic''。在“ TimedRobot”类中，周期为固定时间，默认为20ms。在此示例中，定期代码检查计时器是否少于2秒，如果是，则使用DifferentialDrive类的ArcadeDrive方法以半速向前行驶。如果超过2秒钟，代码将停止机器人驱动器。

source: Joystick Control for teleoperation
es_mx: Control del joystick para teleoperación
tr_tr: Teleoperasyon için Joystick Kontrolü
zh_cn: 遥控操纵杆控制

source: Like in Autonomous, the Teleop mode has a ``TeleopInit`` and ``TeleopPeriodic`` function. In this example we don't have anything to do in ``TeleopInit``, it is provided for illustration purposes only. In ``TeleopPeriodic``, the code uses the ``ArcadeDrive`` method to map the Y-axis of the ``Joystick`` to forward/back motion of the drive motors and the X-axis to turning motion.
es_mx: Como en Autónomo, el modo Teleop tiene una función ``TeleopInit`` y ``TeleopPeriodic``. En este ejemplo, no tenemos nada que hacer en ``TeleopInit``, se proporciona con fines ilustrativos solamente. En ``TeleopPeriodic``, el código usa el método``ArcadeDrive`` para mapear el eje Y del ``Joystick`` para avanzar / retroceder los motores de accionamiento y el eje X para girar.
tr_tr: Otonom modda olduğu gibi, Teleop modunda da bir ``TeleopInit`` ve ``TeleopPeriodic`` işlevi vardır. Bu örnekte, ``TeleopInit`` ile yapabileceğimiz bir şey yok, sadece örnekleme amacıyla sağlanmıştır. ``TeleopPeriodic`` de kod, ``Joystick`` in Y eksenini sürücü motorlarının ileri/geri hareketine ve X eksenini dönüş hareketine eşlemek için ``ArcadeDrive`` yöntemini kullanır.
zh_cn: 像在自主模式中一样，Teleop模式具有“ TeleopInit”和“ TeleopPeriodic”功能。在这个例子中，我们在``TeleopInit``中没有任何关系，仅出于说明目的提供它。在``TeleopPeriodic''中，代码使用``ArcadeDrive''方法将``操纵杆''的Y轴映射到驱动马达的前进/后退运动，而X轴映射到旋转运动。

source: Test Mode
es_mx: Modo prueba
tr_tr: Test modu
zh_cn: 测试模式

source: Deploying the Project to a Robot
es_mx: Desplegando el proyecto a un robot
tr_tr: Projeyi Robota Deploy etmek
zh_cn: 将项目部署到机器人

source: Please see the instructions :ref:`here <docs/software/vscode-overview/deploying-robot-code:Building and Deploying Robot Code>` for deploying the program onto a robot.
es_mx: Consulte las instrucciones :ref:`aquí <docs/software/vscode-overview/deploying-robot-code:Building and Deploying Robot Code>` para desplegar el programa en un robot.
tr_tr: Programı bir robota dağıtmak için lütfen talimatlara bakın :ref:`here <docs/software/vscode-overview/deploying-robot-code:Building and Deploying Robot Code>` .
zh_cn: 请参阅:ref:`此处 <docs/software/vscode-overview/deploying-robot-code:Building and Deploying Robot Code>` 的说明，以将程序部署到机器人上。

source: The ``RobotInit`` method is run when the robot program is starting up, but after the constructor. The ``RobotInit`` for our sample program doesn't do anything. If we wanted to run something here we could provide the code above to override the default).
es_mx: El método ``RobotInit`` se ejecuta cuando el programa del robot está arrancando, pero después del constructor. El ``RobotInit`` de nuestro programa de muestra no hace nada. Si quisiéramos ejecutar algo aquí podríamos proporcionar el código anterior para anular el predeterminado).
zh_cn: 机器人程序启动时但在构造函数之后运行``RobotInit``方法。示例程序的``RobotInit``没有任何作用。如果我们想在此处运行某些内容，我们可以提供上面的代码以覆盖默认代码）。

source: Test Mode is used for testing robot functionality. Similar to ``TeleopInit``, the ``TestInit`` and ``TestPeriodic`` methods are provided here for illustrative purposes only.
es_mx: El modo de prueba se utiliza para probar la funcionalidad del robot. Al igual que ``TeleopInit``, los métodos ``TestInit`` y ``TestPeriodic`` se proporcionan aquí sólo con fines ilustrativos.
zh_cn: 测试模式用于测试机器人功能。与“ TeleopInit”类似，此处提供的“ TestInit”和“ TestPeriodic”方法仅用于说明目的。

source: Choose "WPILib: Create a new project".
zh_cn: 选择“WPILib：创建新项目”。

source: The different parts of the new project creation window.
zh_cn: 新项目创建窗口的不同部分。

source: Our code needs to reference the components of WPILib that are used. In C++ this is accomplished using ``#include`` statements; in Java it is done with ``import`` statements. The program references classes for ``Joystick`` (for driving), ``PWMSparkMax`` (for controlling motors), ``TimedRobot`` (the base class used for the example), ``Timer`` (used for autonomous), ``DifferentialDrive`` (for connecting the joystick control to the motors), and ``LiveWindow`` (C++ only).
zh_cn: 我们的代码需要引用所使用的 WPILib 组件。在 C++ 中，这是使用“#include”语句完成的；在 Java 中，它是通过“import”语句完成的。该程序引用了“操纵杆”（用于驾驶）、“PWMSparkMax”（用于控制电机）、“TimedRobot”（用于示例的基类）、“Timer”（用于自动驾驶的类)、“DifferentialDrive”（用于将操纵杆控制连接到电机）和“LiveWindow”（仅限 C++）。
