Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-4/creating-benchtop-test-program-labview.po
Languages: fr_ca, tr_tr

source: Creating your Benchtop Test Program (LabVIEW)
fr_ca: Création de votre Programme prototype (LabVIEW)
tr_tr: Benchtop Test Programınızı Oluşturma (LabVIEW)

source: This document covers how to create, build and load an FRC\ |reg| LabVIEW program onto a roboRIO. Before beginning, make sure that you have installed LabVIEW for FRC and the FRC Game Tools and that you have configured and imaged your roboRIO as described in the :ref:`Zero-to-Robot tutorial <docs/zero-to-robot/introduction:Introduction>`.
fr_ca: Ce document explique comment créer, construire et charger un programme LabVIEW sur un roboRIO. Avant de commencer, assurez-vous que vous avez installé LabVIEW pour FRC et FRC Game Tools et que vous avez configuré et imagé votre roboRIO comme décrit dans le :ref:`Tutoriel Zero-to-Robot <docs/zero-to-robot/introduction :Introduction>`.

source: Creating a Project
fr_ca: Création d’un projet
tr_tr: Proje Oluşturmak

source: Creating a new roboRIO project from the LabVIEW home screen.
fr_ca: Création d’un nouveau projet roboRIO à partir de l’écran d’accueil labVIEW.

source: Launch LabVIEW and click the FRC roboRIO Robot Project link to display the Create New FRC Robot Project dialog box.
fr_ca: Lancez LabVIEW et cliquez sur le lien Projet de robot FRC roboRIO pour afficher la boîte de dialogue Créer un nouveau projet de robot FRC.

source: Configuring Project
fr_ca: Configuration du projet
tr_tr: Projeyi Yapılandırma

source: The different sections of the dialog for configuring a new LabVIEW project.
fr_ca: Les différentes sections de la boîte de dialogue pour la configuration d’un nouveau projet LabVIEW.

source: Fill in the Create New FRC Project Dialog:
fr_ca: Remplissez la boîte de dialogue Create New FRC Project:
tr_tr: Yeni FRC Projesi Oluştur İletişim Kutusunu Doldurun:

source: Pick a name for your project
fr_ca: Choisissez un nom pour votre projet
tr_tr: Projeniz için bir isim seçin

source: Select a folder to place the project in.
fr_ca: Sélectionnez un dossier dans lequel placer le projet.
tr_tr: Projeyi yerleştirmek için bir klasör seçin.

source: Enter your team number
fr_ca: Entrez votre numéro d’équipe
tr_tr: Takım numaranızı girin

source: Select a project type. If unsure, select :guilabel:`Arcade Drive`.
fr_ca: Sélectionnez un type de projet. En cas de doute, sélectionnez :guilabel:`Arcade Drive`.

source: Click :guilabel:`Finish`
fr_ca: Cliquez sur :guilabel:`Finish`

source: Running the Program
fr_ca: Exécution du programme
tr_tr: Programı Çalıştırmak

source: Robot Main in the project window with its corresponding front panel open.
fr_ca: Robot Main dans la fenêtre du projet avec son panneau avant correspondant ouvert.

source: Note that a program deployed in this manner will not remain on the roboRIO after a power cycle. To deploy a program to run every time the roboRIO starts follow the next step, Deploying the program.
fr_ca: Notez qu’un programme déployé de cette manière ne restera pas dans le roboRIO une fois que celui-ci aura été mis hors tension. Pour déployer un programme qui s'exécute à chaque fois que le roboRIO démarre, suivre l’étape suivante, Déploiement du programme.

source: In the Project Explorer window, double-click the Robot Main.vi item to open the Robot Main VI.
fr_ca: Dans la fenêtre Explorateur de projets, double-cliquez sur l’instrument virtuel Robot Main.vi pour l'ouvrir.
tr_tr: Proje Gezgini penceresinde, Robot Ana VI'yı açmak için Robot Main.vi öğesine çift tıklayın.

source: Click the Run button (White Arrow on the top ribbon) of the Robot Main VI to deploy the VI to the roboRIO. LabVIEW deploys the VI, all items required by the VI, and the target settings to memory on the roboRIO. If prompted to save any VIs, click Save on all prompts.
fr_ca: Cliquez sur le bouton Run (Flèche blanche sur le ruban supérieur) du Robot Main VI pour déployer le VI sur le roboRIO. LabVIEW déploie le VI, tous les éléments requis par le VI et les paramètres cibles à la mémoire sur le roboRIO. Si vous êtes invité à enregistrer des vis, cliquez sur Save sur toutes les invites qui apparaissent.
tr_tr: VI'yı roboRIO'ya dağıtmak için Robot Main VI'nın Çalıştır düğmesine (üst şeritte Beyaz Ok) tıklayın. LabVIEW VI'yı, VI'nın gerektirdiği tüm öğeleri ve hedef ayarları roboRIO üzerindeki belleğe dağıtır. Herhangi bir VI'yı kaydetmeniz istenirse, tüm istemlerde Kaydet'i tıklayın.

source: Using the Driver Station software, put the robot in Teleop Mode. For more information on configuring and using the Driver Station software, see the FRC Driver Station Software article.
fr_ca: À l’aide de l'application Driver Station, placez le robot en mode Teleop. Pour plus d’informations sur la configuration et l’utilisation de la Driver Station, voir l’article FRC Driver Station Software.

source: Click Enable.
fr_ca: Cliquez sur Enable.

source: Move the joysticks and observe how the robot responds.
fr_ca: Activez les joysticks et observez comment le robot réagit.

source: Click the Abort button of the Robot Main VI. Notice that the VI stops. When you deploy a program with the Run button, the program runs on the roboRIO, but you can manipulate the front panel objects of the program from the host computer.
fr_ca: Cliquez sur le bouton Abort du Robot Main VI. Notez que le VI s’arrête. Lorsque vous déployez un programme avec le bouton Run, le programme s’exécute sur le roboRIO, mais vous pouvez manipuler les objets du panneau frontal du programme à partir de l’ordinateur hôte.
tr_tr: Robot Main VI'nın Abort butonuna tıklayın. VI'nın durduğuna dikkat edin. Çalıştır düğmesiyle bir programı devreye aldığınızda, program roboRIO üzerinde çalışır, ancak programın ön panel nesnelerini ana bilgisayardan değiştirebilirsiniz.

source: Deploying the Program
fr_ca: Déploiement du programme

source: Right clicking on the robot build specification and choosing "build". Then right clicking again and choosing "Run as startup".
fr_ca: Cliquez à l'aide du bouton droit sur robot build specification et choisissez "build". Ensuite, cliquez à nouveau sur le bouton droit et choisissez "Run as startup".

source: To run in the competition, you will need to deploy a program to your roboRIO. This allows the program to survive across reboots of the controller, but doesn't allow the same debugging features (front panel, probes, highlight execution) as running from the front panel. To deploy your program:
fr_ca: Pour participer à la compétition, vous devrez déployer un programme dans la mémoire de votre roboRIO. Cela permet au programme d'être présent au roboRIO et de s'exécuter à tous les redémarrages du contrôleur, mais n'offre pas les mêmes fonctionnalités de débogage (panneau frontal, sondes, mise en surbrillance de l'exécution) que l’exécution à partir du panneau frontal. Pour déployer votre programme :
tr_tr: Yarışmada koşmak için roboRIO'nuza bir program dağıtmanız gerekecek. Bu, programın denetleyicinin yeniden başlatılması sırasında hayatta kalmasını sağlar, ancak ön panelden çalıştırılanla aynı hata ayıklama özelliklerine (ön panel, sondalar, vurgu yürütme) izin vermez. Programınızı dağıtmak için:

source: In the Project Explorer, click the + next to Build Specifications to expand it.
fr_ca: Dans l’Explorateur de projets, cliquez sur le + à côté de Build Specifications pour l’étendre.
tr_tr: Proje Gezgini'nde, Genişletmek için Özellikler Oluştur'un yanındaki + işaretine tıklayın.

source: Right-click on FRC Robot Boot-up Deployment and select Build. Wait for the build to complete.
fr_ca: Cliquez avec le bouton droit sur FRC Robot Boot-up Deployment et sélectionnez Build. Attendez que la compilation se termine.
tr_tr: FRC Robot Önyükleme Dağıtımı'na sağ tıklayın ve Oluştur'u seçin. Yapının tamamlanmasını bekleyin.

source: Right-click again on FRC Robot Boot-Up Deployment and select Run as Startup. If you receive a conflict dialog, click OK. This dialog simply indicates that there is currently a program on the roboRIO which will be terminated/replaced.
fr_ca: Cliquez à nouveau avec le bouton droit sur le FRC Robot Boot-Up Deployment et sélectionnez Run as Startup. Si vous recevez une boîte de dialogue de conflit, cliquez sur OK. Cette boîte de dialogue indique simplement qu’il existe actuellement un programme sur le roboRIO qui sera terminé/remplacé.
tr_tr: FRC Robot Önyükleme Dağıtımı'na tekrar sağ tıklayın ve Başlangıç Olarak Çalıştır'ı seçin. Çakışma iletişim kutusu alırsanız, Tamam'a tıklayın. Bu iletişim kutusu, roboRIO'da şu anda sonlandırılacak / değiştirilecek bir program olduğunu gösterir.

source: Either check the box to close the deployment window on successful completion or click the close button when the deployment completes.
fr_ca: Cochez la case pour fermer la fenêtre de déploiement après une réussite de celui-ci, soit cliquez sur le bouton close lorsque le déploiement se termine.
tr_tr: Başarılı bir şekilde tamamlandığında dağıtım penceresini kapatmak için kutuyu işaretleyin veya dağıtım tamamlandığında kapat düğmesini tıklayın.

source: The roboRIO will automatically start running the deployed code within a few seconds of the dialog closing.
fr_ca: Le roboRIO démarre automatiquement l’exécution du code déployé dans les quelques secondes suivant la fermeture de la boîte de dialogue.
tr_tr: RoboRIO, iletişim kutusu kapandıktan birkaç saniye sonra konuşlandırılan kodu otomatik olarak çalıştırmaya başlayacaktır.

source: This document covers how to create, build and load an FRC\ |reg| LabVIEW program onto a roboRIO. Before beginning, make sure that you have installed LabVIEW for FRC and the FRC Driver Station and that you have configured and imaged your roboRIO as described previously.
tr_tr: Bu belge bir FRC'nin nasıl oluşturulacağını, oluşturulacağını ve yükleneceğini kapsar \ |reg| RoboRIO'ya LabVIEW programı. Başlamadan önce, FRC için LabVIEW ve FRC Sürücü İstasyonunu yüklediğinizden ve roboRIO'nuzu daha önce açıklandığı gibi yapılandırıp görüntülediğinizden emin olun.

source: Launch LabVIEW and click the FRC roboRIO Robot Project link in the Projects window to display the Create New FRC Robot Project dialog box.
tr_tr: LabVIEW'i başlatın ve Yeni FRC Robot Projesi Oluştur iletişim kutusunu görüntülemek için Projeler penceresindeki FRC roboRIO Robot Projesi bağlantısını tıklayın.

source: Select a project type. If unsure, select Arcade Drive - roboRIO.
tr_tr: Bir proje türü seçin. Emin değilseniz, Arcade Drive - roboRIO seçin.

source: Click Finish
tr_tr: Bitir'e tıklayın

source: A program deployed in this manner will not remain on the roboRIO after a power cycle. To deploy a program to run every time the roboRIO starts follow the next step, Deploying the program.
tr_tr: Bu şekilde dağıtılan bir program, güç çevriminden sonra roboRIO'da kalmayacaktır. Bir programı roboRIO her başladığında çalışacak şekilde dağıtmak için sonraki adımı, Programı Dağıtma'yı izleyin.

source: Deploying the program
tr_tr: Programı dağıtmak
