Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-4/running-benchtop-test.po
Languages: es_mx, zh_cn

source: Running your Benchtop Test Program
es_mx: Ejecutando el programa de prueba del robot prototipo
zh_cn: 运行您的台式测试程序

source: Overview
es_mx: Vista general
zh_cn: 概述

source: You should create and download a Benchtop Test Program as described for your programming language:
es_mx: Debe crear y descargar un programa de prueba para el robot prototipo tal como se describe para su lenguaje de programación:
zh_cn: 您应该按照您的编程语言中的描述创建并下载“台式机测试程序”：

source: Tethered Operation
es_mx: Operación Alámbrica
zh_cn: 连接操作

source: Running your benchtop testing program while tethered to the Driver Station via ethernet or USB cable will confirm the the program was successfully deployed and that the driver station and roboRIO are properly configured.
es_mx: Al ejecutar el programa de pruebas mientras esta conectado a la Driver Station a través de Ethernet o un cable USB confirmará que el programa se cargó correctamente y que la driver station y la roboRIO están configuradas correctamente
zh_cn: 通过以太网或USB线将台式机测试程序连接到Driver Station时，将确认该程序已成功部署，并且Driver Station和roboRIO已正确配置。

source: The roboRIO should be powered on and connected to the PC over Ethernet or USB.
es_mx: La roboRIO debe estar encendida y conectada a la PC a través de Ethernet o USB.
zh_cn: roboRIO应该已打开电源并通过以太网或USB连接到PC。

source: Starting the FRC Driver Station
es_mx: Iniciando la FRC Driver Station
zh_cn: 启动 FRC Driver Station

source: The Driver Station icon found on the desktop.
zh_cn: FRC Driver Station的图标可以在桌面上找到。

source: The FRC\ |reg| Driver Station can be launched by double-clicking the icon on the Desktop or by selecting Start->All Programs->FRC Driver Station.
es_mx: La FRC Driver Station se puede iniciar haciendo doble clic en el ícono del Escritorio o seleccionando Inicio->Todos los programas ->FRC Driver Station.
zh_cn: 可以通过双击桌面上的图标或选择开始->所有程序-> FRC Driver Station来启动FRC Driver Station。

source: Setting Up the Driver Station
es_mx: Configurando la Driver Station
zh_cn: 设置 Driver Station

source: Using the 3rd tab with the gear of the Driver Station to set the team number.
zh_cn: 使用带有Driver Station齿轮的第三个选项卡来设置团队编号。

source: The DS must be set to your team number in order to connect to your robot. In order to do this click the Setup tab then enter your team number in the team number box. Press return or click outside the box for the setting to take effect.
es_mx: La DS debe configurarse con el número de su equipo para conectarse a su robot. Para hacer esto haga clic en la pestaña de Setup y luego ingrese su número de equipo en el cuadro de número de equipo. Presione Return o haga clic fuera del cuadro para que la configuración surta efecto.
zh_cn: 必须将 Driver Station 设置为您的团队编号，才能连接到您的机器人。为此，请单击“ Setting （设置）”选项卡，然后在“团队编号”框中输入您的团队编号。按回车键或在框外单击以使设置生效。

source: PCs will typically have the correct network settings for the DS to connect to the robot already, but if not, make sure your Network adapter is set to DHCP.
es_mx: Las computadoras tendrán normalmente la configuración de red correcta para que la DS se conecte al robot, pero si no, asegúrese de que su adaptador de red esté configurado en DHCP.
zh_cn: 电脑通常应该有正确的网络设置，以便 Driver Station 连接到机器人，但如果没有，请确保你已将你的网络适配器设置为 DHCP。

source: Confirm Connectivity
es_mx: Confirmar conectividad
zh_cn: 确认连接

source: Tethered
es_mx: Alámbrico
zh_cn: 有线

source: Wireless
es_mx: Inalámbrico
zh_cn: 无线

source: Using the Driver Station software, click Diagnostics and confirm that the Enet Link (or Robot Radio led, if operating wirelessly) and Robot leds are green.
es_mx: Usando el software de la Driver Station, haga clic en Diagnostics y confirme que el Enet Link (o Robot Radio led, si funciona de forma inalámbrica) y los leds del robot están verdes.
zh_cn: 使用Driver Station软件，单击“诊断”，并确认Enet Link（或机器人无线电LED，如果以无线方式操作）和机器人LED为绿色。

source: Operate the Robot
es_mx: Operar el robot
zh_cn: 操作机器人

source: Highlights the different sections of the Drive Tab (1st)
zh_cn: 高亮显示驱动器选项卡的不同部分（第 1 个）

source: Click the Operation Tab
es_mx: Haga click en la pestaña Operation
zh_cn: 单击操作选项卡

source: Confirm that battery voltage is displayed
es_mx: Confirme que se muestre el voltaje de la batería
zh_cn: 确认电池电压已显示

source: Communications, Robot Code, and Joysticks indicators are green.
es_mx: Los indicadores de Communications, Robot Code, y Joysticks están verdes.
zh_cn: Communications, Robot Code, 和Joysticks指示灯为绿色。

source: Put the robot in Teleop Mode
es_mx: Ponga el robot en modo Teleop
zh_cn: 将机器人置于Teleop模式

source: Click Enable. Move the joysticks and observe how the robot responds.
es_mx: Presione Enable. Mueva los joysticks y observe como responde el robot
zh_cn: 单击 Enable。移动操纵杆，观察机器人的反应。

source: Click Disable
es_mx: Presione Disable
zh_cn: 单击Disable

source: Wireless Operation
es_mx: Operación inalámbrica
zh_cn: 无线操作

source: Before attempting wireless operation, tethered operation should have been confirmed as described in `Tethered Operation`_. Running your benchtop testing program while connected to the Driver Station via WiFi will confirm that the access point is properly configured.
es_mx: Antes de intentar la operación inalámbrica, la operación alámbrica debe haberse confirmado como se describe en la `Tethered Operation`_. Ejecutar su programa de pruebas mientras está conectado a la Driver Station a través de WiFi confirmará que el punto de acceso está configurado correctamente
zh_cn: 在尝试无线操作之前，应按照“连接操作”中所描述的进行确认。在通过WiFi连接操控站的同时运行您的台式测试程序，将确认接入点配置正确。

source: Configuring the Access Point
es_mx: Configurando el punto de acceso
zh_cn: 配置接入点

source: See the article :ref:`Programming your radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>` for details on configuring the robot radio for use as an access point.
es_mx: Consulte el artículo :ref:`Programando tu radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>` para detalles en la configuración de la radio del robot para uso como un punto de acceso.
zh_cn: 有关配置机器人无线电以用作接入点的详细信息，请参阅:ref:`Programming your radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`。

source: After configuring the access point, connect the driver station wirelessly to the robot. The SSID will be your team number (as entered in the Bridge Configuration Utility). If you set a key when using the Bridge Configuration Utility you will need to enter it to connect to the network. Make sure the computer network adapter is set to DHCP ("Obtain an IP address automatically").
es_mx: Después de configurar el punto de acceso, conecte la Driver Station de forma inalámbrica al robot. El SSID será el número de su equipo (como se ingresó en la Bridge Configuration Utility). Si estableces un código cuando utilice la Bridge Configuration Utility, deberá ingresarla para conectarse a la red. Asegúrese de que el adaptador de red de la computadora esté configurado en DHCP (“Obtenga una dirección IP automáticamente").
zh_cn: 配置接入点后，将驱动程序站无线连接到机器人。SSID将是您的团队编号（在桥接配置程序中输入）。如果您在使用桥接配置程序时设置了一个密钥，则需要输入该密钥才能连接到网络。确保将计算机网络适配器设置为DHCP（“自动获取IP地址”）。

source: You can now confirm wireless operation using the same steps in **Confirm Connectivity** and **Operate the Robot** above.
es_mx: Ahora puede confirmar la operación inalámbrica utilizando los mismos pasos en **Confirmar Conectividad** y **Operar el Robot** mostrado anteriormente.
zh_cn: 现在，您可以通过上文“确认连接”和“操作机器人”中的相同步骤来确认无线操作。
