Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-4/running-test-program.po
Languages: fr_ca, ja

source: Running your Test Program
ja: テストプログラムの実行

source: Overview
fr_ca: Aperçu
ja: 概要

source: You should create and download a Test Program as described for your programming language:
ja: お使いのプログラミング言語の説明に従ってテストプログラムを作成し、ダウンロードしてください：

source: Tethered Operation
fr_ca: Opération par l'intermédiaire d'un câble
ja: 有線操作

source: Running your test program while tethered to the Driver Station via ethernet or USB cable will confirm the program was successfully deployed and that the driver station and roboRIO are properly configured.
ja: イーサネットまたは USB ケーブルでドライバーステーションに接続した状態でテストプログラムを実行すると、プロ グラムが正常にデプロイされ、ドライバーステーションと roboRIO が正しく設定されていることを確認できます。

source: The roboRIO should be powered on and connected to the PC over Ethernet or USB.
fr_ca: Le roboRIO doit être mis sous tension et connecté au PC via Ethernet ou USB.
ja: roboRIOの電源を入れ、イーサネットまたはUSBでPCに接続します。

source: Starting the FRC Driver Station
ja: FRCドライバーステーションの起動

source: The Driver Station icon found on the desktop.
fr_ca: Icône de l'application Driver Station située sur le bureau.
ja: デスクトップにあるドライバーステーションのアイコン。

source: The FRC\ |reg| Driver Station can be launched by double-clicking the icon on the Desktop or by selecting Start->All Programs->FRC Driver Station.
fr_ca: L'application FRC\ |reg| Driver Station peut être lancée en double-cliquant sur l'icône localisée sur le bureau ou en sélectionnant Démarrer-> Tous les programmes-> FRC Driver Station.
ja: デスクトップ上のアイコンをダブルクリックするか、「スタート」をクリックしてから「FRC Driver Station」を検索して選択することでFRC Driver Stationを起動できます。

source: Setting Up the Driver Station
ja: ドライバーステーションのセットアップ

source: Using the 3rd tab with the gear of the Driver Station to set the team number.
fr_ca: En utilisant le 3ème onglet avec l’engrenage de l'application Driver Station pour définir le numéro d’équipe.
ja: ドライバーステーションのギアのある3番目のタブでチーム番号を設定します。

source: The DS must be set to your team number in order to connect to your robot. In order to do this click the Setup tab then enter your team number in the team number box. Press return or click outside the box for the setting to take effect.
fr_ca: L'application DS doit être configurée à votre numéro d’équipe afin de se connecter à votre robot. Pour ce faire, cliquez sur l’onglet Setup, puis entrez votre numéro d’équipe dans la zone Team number. Appuyez sur Return ou cliquez en dehors de la zone pour que le paramètre prenne effet.
ja: ロボットに接続するためには、DSにチーム番号を設定する必要があります。これを行うには、Setupタブをクリックし、チーム番号ボックスにチーム番号を入力します。リターンキーを押すか、ボックスの外をクリックすると、設定が有効になります。

source: PCs will typically have the correct network settings for the DS to connect to the robot already, but if not, make sure your Network adapter is set to DHCP.
ja: PCは通常、DSがロボットに接続するための正しいネットワーク設定をしていますが、そうでない場合は、ネットワークアダプタがDHCPに設定されていることを確認してください。

source: Confirm Connectivity
ja: 接続の確認

source: Tethered
ja: 有線

source: Wireless
fr_ca: Sans fil
ja: 無線

source: Using the Driver Station software, click Diagnostics and confirm that the Enet Link (or Robot Radio led, if operating wirelessly) and Robot leds are green.
ja: ドライバーステーションソフトウェアを使用して、「Diagnostics」をクリックし、Enet Link（またはワイヤレスで動作している場合はロボット無線の LED）とロボットの LED が緑色になっていることを確認します。

source: Operate the Robot
fr_ca: Faire fonctionner le robot
ja: ロボットを操作する

source: Highlights the different sections of the Drive Tab (1st)
fr_ca: Met en évidence les différentes sections de l’onglet Drive (1er)
ja: ドライブタブの各セクションのハイライト（1番目）

source: Click the Operation Tab
fr_ca: Cliquer sur l'onglet Operation
ja: Operationタブをクリックします

source: Confirm that battery voltage is displayed
fr_ca: Confirmer que la tension de la batterie s’affiche
ja: バッテリー電圧が表示されていることを確認する

source: Communications, Robot Code, and Joysticks indicators are green.
fr_ca: Les indicateurs Communications, Code Robot et Joysticks sont verts.
ja: Communications、Robot Code、Joysticksのインジケータが緑色に点灯する。

source: Put the robot in Teleop Mode
ja: ロボットをTeleopモードにする

source: Click Enable. Move the joysticks and observe how the robot responds.
fr_ca: Cliquez sur Enable. Actionnez les joysticks et observez comment le robot réagit.
ja: Enableをクリックする。ジョイスティックを動かし、ロボットの反応を確認する。

source: Click Disable
fr_ca: Cliquez sur Disable
ja: Disableをクリックする

source: Wireless Operation
fr_ca: Fonctionnement sans fil
ja: ワイヤレス操作

source: Before attempting wireless operation, tethered operation should have been confirmed as described in `Tethered Operation`_. Running your test program while connected to the Driver Station via WiFi will confirm that the access point is properly configured.
ja: ワイヤレス操作を試す前に、 `有線操作`_ セクションで説明されているように、有線接続での操作を確認する必要があります。WiFi 経由でドライバーステーションに接続した状態でテストプログラムを実行することで、アクセスポイントが適切に設定されていることを確認できます。

source: Configuring the Access Point
fr_ca: Configuration du point d’accès
ja: アクセスポイントの設定

source: See the article :ref:`Programming your radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>` for details on configuring the robot radio for use as an access point.
fr_ca: Consultez l’article :ref:`Programmer votre radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>` pour plus de détails sur la configuration de la radio robot en vue d'une utilisation comme point d’accès.
ja: ロボットの無線機をアクセスポイントとして設定するためには、 :ref:`無線機のプログラミング <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>` をご覧ください。

source: After configuring the access point, connect the driver station wirelessly to the robot. The SSID will be your team number (as entered in the Bridge Configuration Utility). If you set a key when using the Bridge Configuration Utility you will need to enter it to connect to the network. Make sure the computer network adapter is set to DHCP ("Obtain an IP address automatically").
ja: アクセスポイントの設定後、ドライバーステーションをロボットに無線接続します。SSIDはチーム番号（ブリッジ設定ユーティリティで入力したもの）になります。ブリッジ設定ユーティリティを使用する際にキーを設定した場合は、ネットワークに接続するためにキーを入力する必要があります。コンピュータのネットワークアダプターがDHCP（「IPアドレスを自動的に取得する」）に設定されていることを確認してください。

source: You can now confirm wireless operation using the same steps in **Confirm Connectivity** and **Operate the Robot** above.
ja: 上記の **接続の確認** と **ロボットを操作する** と同じ手順でワイヤレスの動作を確認することができます。
