Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/axon/create-a-dataset-with-open-images.po
Languages: fr_ca

source: Creating a Dataset with Open Images
fr_ca: Création d'un jeu de données avec des images ouvertes

source: For the detection of more generic objects, Axon's dataset creator can be used to make a dataset from `Google's Open Images dataset <https://storage.googleapis.com/openimages/web/index.html>`__ .
fr_ca: Pour la détection d'objets plus génériques, le créateur d'ensemble de données d'Axon peut être utilisé pour créer un ensemble de données à partir de `l’ensemble de données Open Images de Google <https://storage.googleapis.com/openimages/web/index.html>`__ .

source: Creating a Dataset
fr_ca: Création d'un ensemble de données

source: Click the :guilabel:`Create Dataset` button to begin.
fr_ca: Cliquez sur le bouton :guilabel:`Create Dataset` pour commencer.

source: Create Dataset Button.
fr_ca: Création d'un bouton Dataset

source: Choosing the Class Names
fr_ca: Choisir les noms de classe

source: Next, you need to pick the classes that you would like to detect. They must be selected from the classes available at the `Open Images dataset website <https://storage.googleapis.com/openimages/web/index.html>`__ . Change the :guilabel:`category` in the top bar to see available classes. In the below picture, :guilabel:`Cat` is selected, but other class names like :guilabel:`Caterpillar` are shown to be valid.
fr_ca: Ensuite, vous devez choisir les classes que vous souhaitez détecter. Ils doivent être sélectionnés parmi les classes disponibles sur ` le site Web du curpus de données Open Images <https://storage.googleapis.com/openimages/web/index.html>`__ . Modifiez le :guilabel:`category` dans la barre supérieure pour voir les classes disponibles. Dans l'image ci-dessous, :guilabel:`Cat` est sélectionné, mais d'autres noms de classe comme :guilabel:`Caterpillar` sont valides.

source: The Open Images website
fr_ca: Le site Web Open Images

source: When you have determined the valid class names of the objects that you wish to detect, you can type them into dialog as shown below.
fr_ca: Lorsque vous avez déterminé les noms de classe valides des objets que vous souhaitez détecter, vous pouvez les saisir dans la boîte de dialogue comme indiqué ci-dessous.

source: Choose the Class Name you want to get images of.
fr_ca: Choisissez le nom de la classe dont vous souhaitez obtenir des images.

source: Furthermore, using the :guilabel:`add` button, you can choose to make a dataset containing more than one class. Subsequently, you can also remove classes using the :guilabel:`remove` button.
fr_ca: De plus, en utilisant le bouton :guilabel:`add`, vous pouvez choisir de créer un ensemble de données contenant plus d'une classe. Par la suite, vous pouvez également supprimer des classes en utilisant le bouton :guilabel:`remove`.

source: Add or remove classes.
fr_ca: Ajouter ou supprimer des classes

source: Choosing the Number of Images
fr_ca: Choix du nombre d'images

source: Finally, you can select the amount of images that you want for each class category in your dataset and click :guilabel:`CREATE`.
fr_ca: Enfin, vous pouvez sélectionner la quantité d'images que vous souhaitez pour chaque catégorie de classe dans votre ensemble de données et cliquer sur :guilabel:`CREATE`.

source: Set the number of images you want.
fr_ca: Définissez le nombre d’images souhaité.

source: Waiting
fr_ca: Attendre

source: The creation process will take from a couple seconds to several minutes, depending on the size of your dataset. The newly-created dataset will be automatically imported into the dataset pane on the left side of the screen, but there is a :guilabel:`Download` button for sending the dataset to a teammate.
fr_ca: Le processus de création prendra de quelques secondes à plusieurs minutes, selon la taille de votre ensemble de données. L'ensemble de données nouvellement créé sera automatiquement importé dans le volet de l'ensemble de données sur le côté gauche de l'écran, mais il existe un bouton :guilabel:`Download` pour envoyer l'ensemble de données à un coéquipier.

source: What a completed creation job should look like.
fr_ca: À quoi devrait ressembler un travail de création terminé.
