Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/axon/inferencing-on-a-raspberry-pi.po
Languages: es_mx, fr_ca

source: Inferencing on a Raspberry Pi
es_mx: Inferencia en una Raspberry PI
fr_ca: Inférence sur un Raspberry Pi

source: Hardware Requirements
es_mx: Requerimientos de Hardware
fr_ca: Exigences matérielles

source: This section requires a Romi or a Raspberry Pi that is running the WPILibPi Image.
es_mx: Esta sección requiere una Romi o una Raspberry PI que esté ejecutando la imagen WPILibPi.
fr_ca: Cette section nécessite un Romi ou un Raspberry Pi qui exécute l'image WPILibPi.

source: Instructions to setup WPILibPi can be found :ref:`here <docs/software/vision-processing/wpilibpi/walkthrough-video:A Video Walkthrough of using WPILibPi with the Raspberry Pi>`.
es_mx: Instrucciones para configurar WPILibPI pueden encontrarse :ref:`aquí <docs/software/vision-processing/wpilibpi/walkthrough-video:A Video Walkthrough of using WPILibPi with the Raspberry Pi>`.
fr_ca: Les instructions pour configurer WPILibPi peuvent être trouvées :ref:`ici <docs/software/vision-processing/wpilibpi/walkthrough-video:A Video Walkthrough of using WPILibPi with the Raspberry Pi>`.

source: Other hardware that is required is:
es_mx: Otro hardware requerido es:
fr_ca: L'autre matériel requis est :

source: A USB Camera
es_mx: Una cámara USB
fr_ca: Une caméra USB

source: A Coral TPU (Highly Recommended)
es_mx: Un Coral TPU (Altamente recomendado)
fr_ca: Un TPU Coral (fortement recommandé)

source: A Coral Edge TPU is a USB Accelerator that the Raspberry Pi uses as a co-processor to improve its performance while inferencing. In our experience it has shown to improve performance by around 9 times.
es_mx: Un Coral Edge TPU es un acelerador USB que la Raspberry PI usa como un coprocesador para mejorar su funcionamiento mientras inferencia. En nuestra experiencia ha mostrado mejorar su funcionamiento alrededor de 9 veces más.
fr_ca: Un Coral Edge TPU est un accélérateur USB que le Raspberry Pi utilise comme coprocesseur pour améliorer ses performances lors de l'inférence. D'après notre expérience, il a été démontré qu'il améliore les performances d'environ 9 fois.

source: Uploading the Model to the Pi
es_mx: Cargar el modelo a la PI
fr_ca: Téléchargement du modèle sur le Pi

source: To upload your tflite model to the Raspberry Pi, you must connect to it and open the Web-interface. Select the :guilabel:`Application` tab, go to the :guilabel:`File Upload` section and turn the :guilabel:`Extract` slider on.
es_mx: Para subir su modelo tflite a la Raspberry PI, debe conectarse a esta y abrir la interfaz. Seleccione la :guilabel:`Application` pestaña, vaya a la sección :guilabel:`File Upload` y active la barra deslizante :guilabel:`Extract` .
fr_ca: Pour télécharger votre modèle tflite sur le Raspberry Pi, vous devez vous y connecter et ouvrir l'interface Web. Sélectionnez l'onglet :guilabel:`Application`, allez dans la section :guilabel:`File Upload` et activez le curseur :guilabel:`Extract`.

source: Click the Extract Slider
es_mx: Haga clic en la barra deslizadora Extract
fr_ca: Cliquez sur le curseur Extract

source: Once this is checked, you can upload the zip that you downloaded from Axon onto the Pi.
es_mx: Una vez que esté marcado, puede subir el archivo zip que descargó de Axon a la PI.
fr_ca: Une fois que cela est vérifié, vous pouvez télécharger le zip que vous avez téléchargé depuis Axon sur le Pi.

source: Inferencing
es_mx: Inferencia
fr_ca: Interférence

source: Once the model has been uploaded, now the Pi needs python code to utilize it. Here is a link to the provided inference script through the release page: `Github <https://github.com/wpilibsuite/Axon/releases/>`__
es_mx: Una vez que el modelo se ha cargado completamente, ahora la PI necesita un código de phynton para utilizarlo. Aquí hay un link al script de inferencia proporcionado a través de la página de lanzamiento: `Github <https://github.com/wpilibsuite/Axon/releases/>`__
fr_ca: Une fois le modèle téléchargé, le Pi a maintenant besoin de code python pour l'utiliser. Voici un lien vers le script d'inférence fourni via la page de publication: `Github <https://github.com/wpilibsuite/Axon/releases/>`__

source: Once this is downloaded, utilize the :guilabel:`Vision Application Configuration` section to upload the python file.
es_mx: Una vez descargado, utilice la sección :guilabel:`Vision Application Configuration` para subir el archivo de phynton.
fr_ca: Une fois celui-ci téléchargé, utilisez la section :guilabel:`Vision Application Configuration` pour télécharger le fichier python.

source: Upload file
es_mx: Subir archivo
fr_ca: Téléverser le fichier

source: Once uploaded, utilize the :guilabel:`Vision Status` tab to check on the state of the script. You should be able to see an update with a framerate indicating that everything is working.
es_mx: Una vez cargado completamente, utilice la pestaña :guilabel:`Vision Status` para revisar el estado del script. Usted debería de poder ver una actualización con una velocidad de fotogramas indicando que todo está funcionando.
fr_ca: Une fois téléchargé, utilisez l'onglet :guilabel:`Vision Status` pour vérifier l'état du script. Vous devriez pouvoir voir une mise à jour avec un framerate indiquant que tout fonctionne.

source: Status Console
es_mx: Estado de la consola
fr_ca: Console d’état

source: Head to the :guilabel:`Vision Settings` tab. First click on the camera stream and change the resolution to be greater than 300 pixels by 300 pixels (e.g. 640 by 480).
es_mx: Diríjase a la pestaña :guilabel:`Vision Settings`. Primero haga clic en la transmisión de la cámara y cambie la resolución a más de 300 pixeles por 300 pixeles (ej. 640 por 480).
fr_ca: Dirigez-vous vers l'onglet :guilabel:`Paramètres de vision`. Cliquez d'abord sur le flux de la caméra et modifiez la résolution pour qu'elle soit supérieure à 300 pixels par 300 pixels (par exemple 640 par 480).

source: Resolution settings
es_mx: Ajustes de Resolución
fr_ca: Paramètres de résolution

source: Then click on :guilabel:`Open Stream` to view the camera stream. Increase the port number at the top by one each time to move through the various camera streams until you arrive at the desired one. The default port is always at 1181, and the additional streams will start at 1182.
es_mx: A continuación, haga clic en :guilabel:`Open Stream` para ver el flujo de la cámara. Aumente el número de puerto en la parte superior de uno en uno para moverse a través de los diferentes flujos de la cámara hasta que llegue al deseado. El puerto por defecto es siempre el 1181, y los flujos adicionales comenzarán en el 1182.
fr_ca: Cliquez ensuite sur :guilabel:`Open Stream` pour afficher le flux de la caméra. Augmentez le numéro de port en haut d'un à chaque fois pour parcourir les différents flux de caméra jusqu'à ce que vous arriviez à celui souhaité. Le port par défaut est toujours à 1181 et les flux supplémentaires commenceront à 1182.

source: Changing Ports
es_mx: Cambiar puertos
fr_ca: Modification des ports

source: Then you can see the output stream from the Machine Learning Model. You should be able to see the Raspberry Pi identifying objects!
es_mx: Entonces podrás ver el flujo de salida del modelo de aprendizaje automático. ¡Deberías ser capaz de ver la Raspberry Pi identificando objetos!
fr_ca: Ensuite, vous pouvez voir le flux de sortie du modèle d'apprentissage automatique. Vous devriez pouvoir voir les objets identifiant le Raspberry Pi !

source: Coffee Inference
es_mx: Inferencia de café
fr_ca: Inférence du café

source: When using a Romi, robot code must be running on the simulator to receive network tables data.
es_mx: Cuando utilizamos una Romi, el código del robot debe de estar corriendo en el simulador para recibir información de las tablas de datos.
fr_ca: Lors de l'utilisation d'un Romi, le code du robot doit être exécuté sur le simulateur pour recevoir les données des Network Tables.

source: The python script from the releases page that is responsible for inferencing, also pushes that data to network tables. To see the results, one can use the :ref:`OutlineViewer <docs/software/wpilib-tools/outlineviewer/index:OutlineViewer>` tool.
es_mx: El script de python de la página de lanzamientos que es responsable de la inferencia, también empuja esos datos a las tablas de red. Para ver los resultados, puede utilzar la herramienta :ref:`OutlineViewer <docs/software/wpilib-tools/outlineviewer/index:OutlineViewer>`.
fr_ca: Le script python de la page des versions responsable de l'inférence transmet également ces données aux Network Tables. Pour voir les résultats, on peut utiliser l'outil :ref:`OutlineViewer <docs/software/wpilib-tools/outlineviewer/index:OutlineViewer>`.

source: Outline Viewer
fr_ca: Visionneuse de contour

source: Use Server Location ``localhost`` when running on a Romi
es_mx: Utilizar la ubicación del servidor ``localhost`` cuando se ejecuta en una Romi
fr_ca: Utiliser l'emplacement du serveur ``localhost`` lors de l'exécution sur un Romi
