Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/axon/introduction.po
Languages: es_mx, fr_ca

source: Introduction to Axon
es_mx: Introducción a Axon
fr_ca: Introduction à Axon

source: Axon is a tool that brings machine learning to the FIRST robotics competition. Axon provides an interface for training, testing, and exporting a machine learning model.
es_mx: Axon es una herramienta que trae el aprendizaje automático a la FIRST robotics competition. Axon provee una interfaz para entrenar, probar y exportar un modelo de aprendizaje automático.
fr_ca: Axon est un outil qui apporte l'apprentissage automatique au concours de robotique FIRST. Axon fournit une interface pour la formation, le test et l'exportation d'un modèle d'apprentissage automatique.

source: hatch panels being inferenced.
es_mx: inferenciando hatch panels.
fr_ca: panneaux d’hachures en cours d’inférence.

source: What is Machine Learning?
es_mx: ¿Qué es el Aprendizaje Automático?
fr_ca: Qu'est-ce que l'apprentissage automatique ?

source: Machine learning is a new, exciting field of computer science. Machine learning is a powerful tool that can accomplish computational tasks that traditional algorithms cannot. In the FIRST Robotics Competition, machine learning can be used to detect game pieces, scoring locations, or even other robots.
es_mx: El aprendizaje automático es un nuevo y emocionante campo de las ciencias computacionales. Es una herramienta poderosa que puede resolver tareas computacionales que algoritmos tradicionales no pueden. En la FIRST Robotics Competition, el aprendizaje automático puede ser usado para detectar piezas de juego, sitios de puntaje o inclusive otros robots.
fr_ca: L'apprentissage automatique est un nouveau domaine passionnant de l'informatique et un outil puissant qui peut accomplir des tâches de calcul que les algorithmes traditionnels ne peuvent pas. Dans la compétition FIRST Robotics, l'apprentissage automatique peut être utilisé pour détecter des pièces de jeu, des emplacements de score ou même d'autres robots.

source: A machine learning solution is better than traditional computer vision algorithms in many scenarios. The patterns that a machine learning algorithm (in this case, a neural network) can recognize can be much more complex than what an HSV-filtering algorithm can recognize. For example, a neural network could detect the location of a FRC robot within an image, which is an unreasonable challenge for a HSV-filtering algorithm.
es_mx: Una solución de aprendizaje automático es mejor que los algoritmos de visión computacional tradicionales en varios escenarios. Los patrones que un algoritmo de aprendizaje automático ( en este caso, una red neuronal) puede reconocer son mucho más complejos que lo que un algoritmo de filtrado de HSV puede reconocer. Por ejemplo, una red neuronal puede detectar la localización de un robot de FRC con una imagen, algo que no es posible de obtener con el algoritmo de filtrado HSV
fr_ca: Une solution d'apprentissage automatique est meilleure que les algorithmes de vision par ordinateur traditionnels dans de nombreux scénarios. Les modèles qu'un algorithme d'apprentissage automatique (dans ce cas, un réseau de neurones) peut reconnaître peuvent être beaucoup plus complexes que ce qu'un algorithme de filtrage HSV peut reconnaître. Par exemple, un réseau de neurones pourrait détecter l'emplacement d'un robot FRC dans une image, ce qui est un défi considérable pour un algorithme de filtrage HSV.

source: Object detection is a field of machine learning that is particularly relevant for the FRC use-case. A neural network can be taught to determine the box that surrounds an object within an image. This box is known as a bounding box. An object detection neural network is given an image, and it provides a set of predictions. Each prediction contains a bounding box, a label of what the object is, and a number representing how confident the neural network is that there is the chosen object within that bounding box.
es_mx: La detección de objetos es un campo del aprendizaje automático que es particularmente relevante para el caso de uso de FRC. Una red neuronal puede ser entrenada para determinar la caja que envuelve un objeto dentro de una imagen. Esta caja es conocida como caja delimitadora, una etiqueta de cual es el objeto, y un numero que representa que tan segura está la red neuronal de que el objeto que está reconociendo es el objeto que se necesita.
fr_ca: La détection d'objets est un domaine de l'apprentissage automatique qui est particulièrement pertinent pour le cas d'utilisation FRC. Un réseau de neurones peut être enseigné pour déterminer la boîte qui entoure un objet dans une image. Cette boîte est connue sous le nom de boîte englobante. Un réseau de neurones de détection d'objets reçoit une image et fournit un ensemble de prédictions. Chaque prédiction contient un cadre de délimitation, une étiquette indiquant ce qu'est l'objet et un nombre représentant le degré de confiance du réseau de neurones quant à la présence de l'objet choisi dans ce cadre de délimitation.

source: Features of Axon
es_mx: Características de Axon
fr_ca: Caractéristiques d'Axon

source: Dataset Viewing
es_mx: Vista del Dataset
fr_ca: Affichage du jeu de données

source: Machine learning requires giant datasets for the machines to recognize patterns in real-world data. The Axon tool supports custom datasets made with Supervisely. It also supports datasets made from a slice of the Open Images dataset, a Google dataset made of over 6 million images of generic objects. Please go to the :ref:`dataset page <docs/software/wpilib-tools/axon/labeling-a-dataset-with-supervisely:Labeling a Dataset with Supervisely>` to see how to upload a supported dataset format.
es_mx: El aprendizaje automático requiere conjuntos de datos gigantes para que las maquinas reconozcan patrones con datos del mundo real. La herramienta Axon admite conjuntos de datos personalizados creados con Supervisely. También soporta conjuntos de datos hechos de una parte del Open Images dataset, un conjunto de datos de Google hecho de más de 6 millones de imágenes de objetos genéricos. Porfavor vaya a la :ref:`pagina del dataset <docs/software/wpilib-tools/axon/labeling-a-dataset-with-supervisely:Etiquetando un Dataset con Supervisely>`
fr_ca: L'apprentissage automatique nécessite des ensembles de données énormes pour que les machines reconnaissent des modèles dans les données du monde réel. L'outil Axon prend en charge les ensembles de données personnalisés créés avec Supervisely. Il prend également en charge les ensembles de données constitués d'une tranche de l'ensemble de données Open Images, un ensemble de données Google composé de plus de 6 millions d'images d'objets génériques. Veuillez vous rendre sur la page :ref:`dataset <docs/software/wpilib-tools/axon/labeling-a-dataset-with-supervisely:Labeling a Dataset with Supervisely>` pour voir comment télécharger un format d'ensemble de données pris en charge.

source: Training
es_mx: Formación
fr_ca: La formation

source: Axon provides an excellent UI for doing transfer learning with a quantised COCO-trained MobileNet V2. Transfer learning is a technique that reuses parts of a previously trained model, a MobileNet v2 in this case, to improve the learning of a new task like locating hatch panels. Real-time metrics are provided, showing the precision of your model.
es_mx: Axon proporciona una interfaz de usuario excelente para realizar el aprendizaje por transferencia con un MobileNetV2 cuantificado entrenado en COCO. El aprendizaje por transferencia es una tecnica que reúsa partes de un modelo previamente entrenado, un MobileNet v2 en este caso, para mejorar el aprendizaje de una nueva tarea como localizar hatch panels. Métricas de tiempo real son proveídos, mostrando la precisión de su modelo.
fr_ca: Axon fournit une excellente interface utilisateur pour effectuer un apprentissage par transfert avec un MobileNet V2 quantifié formé par COCO. L'apprentissage par transfert est une technique qui réutilise des parties d'un modèle préalablement formé, un MobileNet v2 dans ce cas, pour améliorer l'apprentissage d'une nouvelle tâche comme la localisation de panneaux de trappe. Des métriques en temps réel sont fournies, montrant la précision de votre modèle.

source: Testing
es_mx: Probar
fr_ca: Faire les essais

source: Axon provides a way to test a trained model before using it on a robot. Simply upload a video to the testing page, and watch the neural network work in real-time. A ``.mp4`` is provided when testing is complete, if so desired.
fr_ca: Axon fournit un moyen de tester un modèle entraîné avant de l'utiliser sur un robot. Téléchargez simplement une vidéo sur la page de test et regardez le réseau de neurones fonctionner en temps réel. Un ``.mp4`` est fourni lorsque le test est terminé, si vous le souhaitez.

source: Exporting
es_mx: Exportando
fr_ca: Export

source: Axon provides a way to export your model in both a normal TFLite format, as well as a Edge-TPU optimized model. The outputted ``.zip`` can be directly uploaded to the WPILib Raspberry Pi image, but the format works on many other platforms.
fr_ca: Axon fournit un moyen d'exporter votre modèle à la fois dans un format TFLite normal, ainsi qu'un modèle optimisé Edge-TPU. Le ``.zip`` généré peut être directement téléchargé sur l'image WPILib Raspberry Pi, mais le format fonctionne sur de nombreuses autres plates-formes.

source: Inferencing
es_mx: Inferencia
fr_ca: Interférence

source: Axon provides a Python script for running models on a coprocessor. This script will utilize the hardware of a Google Coral Edge TPU if there is one plugged in. The is officially supported on the WPILibPi image. All inference data is outputted over NetworkTables, and an output MJPEG stream is also provided.
fr_ca: Axon fournit un script Python pour exécuter des modèles sur un coprocesseur. Ce script utilisera le matériel d'un Google Coral Edge TPU s'il y en a un branché. Le est officiellement pris en charge sur l'image WPILibPi. Toutes les données d'inférence sont sorties sur NetworkTables et un flux de sortie MJPEG est également fourni.

source: Docker is a system that allows for virtual machines to be run in containers. Machine Learning utilizes many difficult to install dependencies, so we have provided docker containers to make this installation painless.
fr_ca: Docker est un système qui permet d'exécuter des machines virtuelles dans des contenants. Machine Learning utilise de nombreuses dépendances difficiles à installer, nous avons donc fourni des conteneurs Docker pour simplifier cette installation.

source: To install docker visit the link and installation instructions provided here: `Docker Desktop <https://www.docker.com/products/docker-desktop>`__
fr_ca: Pour installer docker, visitez le lien et les instructions d'installation fournis ici: `Docker Desktop <https://www.docker.com/products/docker-desktop>`__

source: For Windows users an installation of Windows Subsystem for Linux (WSL) is required and can be found `here <https://docs.microsoft.com/en-us/windows/wsl/install-win10>`__
fr_ca: Pour les utilisateurs de Windows, une installation du sous-système Windows pour Linux (WSL) est requise et peut être trouvée `ici <https://docs.microsoft.com/en-us/windows/wsl/install-win10>`__

source: For Mac users, follow these instructions to increase Memory allowance to at least 6GBs of RAM. Instructions can be found `here <https://docs.docker.com/docker-for-mac/#resources>`__
fr_ca: Pour les utilisateurs de Mac, suivez ces instructions pour augmenter l'allocation de mémoire à au moins 6 Go de RAM. Les instructions peuvent être trouvées `here <https://docs.docker.com/docker-for-mac/#resources>`__

source: For Linux users, follow `these <https://docs.docker.com/engine/install/ubuntu/>`__ instructions to complete the installation.
fr_ca: Pour les utilisateurs de Linux, suivez `ces instructions <https://docs.docker.com/engine/install/ubuntu/>`__ pour terminer l'installation.

source: Axon Launcher
fr_ca: Lancer Axon

source: You can download the latest release of the installer from `Github <https://github.com/wpilibsuite/Axon/releases/>`__. Ensure that you download the correct binary for your OS and architecture.
fr_ca: Vous pouvez télécharger la dernière version du programme d'installation depuis `Github <https://github.com/wpilibsuite/Axon/releases/>`__. Assurez-vous de télécharger le bon binaire pour votre système d'exploitation et votre architecture.

source: Extract the installer and click the setup executable file to get started.
fr_ca: Extaire le programme d'installation et cliquer sur le fichier exécutable d'installation pour commencer.

source: Installation
es_mx: Instalación
