Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/axon/retraining-mobilenet.po
Languages: es_mx, fr_ca

source: Retraining Mobilenet V2
es_mx: Reentrenando Mobilenet V2
fr_ca: Ré-entraîner Mobilenet V2

source: Upload a Dataset
es_mx: Subiendo un Dataset
fr_ca: Télécharger un ensemble de données

source: To retrain the mobilenet object detection model using Axon, first upload the dataset you would like to retrain with.
es_mx: Para reentrenar el modelo de detección de objetos mobilenet usando Axon, primero suba el dataset con el cual le gustaría reentrenar el modelo.
fr_ca: Pour réentraîner le modèle de détection d'objets mobilenet à l'aide d'Axon, téléchargez d'abord l'ensemble de données avec lequel vous souhaitez réentraîner.

source: Create or Upload a Dataset
es_mx: Cree o suba un dataset
fr_ca: Créer ou télécharger un ensemble de données

source: Once you have uploaded a dataset, you should see it in the tree above this button.
es_mx: Una vez que haya subido un dataset, usted debería verlo en el menú encima de este botón
fr_ca: Une fois que vous avez téléchargé un ensemble de données, vous devriez le voir dans l'arborescence au-dessus de ce bouton.

source: Create a Project
es_mx: Crea un proyecto
fr_ca: Créer un projet

source: Next, you must create a project. A project will hold the data from the retraining, and any TFLite exports or tests you create with the retrained model.
es_mx: Después, debe crear un proyecto. Un proyecto mantendrá los datos para el reentrenamiento y cualquier prueba o exportación de TFLite que cree con el modelo reentrenado.
fr_ca: Ensuite, vous devez créer un projet. Un projet contiendra les données du réentraînement et toutes les exportations ou tests TFLite que vous créez avec le modèle.

source: To create a project, click the :guilabel:`Add Project` button.
es_mx: Para crear un proyecto, haga clic en el botón de :guilabel:`Add Project`
fr_ca: Pour créer un projet, cliquez sur le bouton :guilabel:`Add Project`

source: Add a Project
es_mx: Añadir un proyecto
fr_ca: Ajouter un projet

source: A dialog will appear, asking you to name the project. Pick a name and click :guilabel:`Create`. When you create your project, you will see it above the button to the left.
es_mx: Un cuadro de dialogo aparecerá preguntándole el nombre del proyecto. Escoja un nombre y haga clic en :guilabel:`Create`. Cuando esté creado el proyecto, lo verá arriba del botón a la izquierda
fr_ca: Une boîte de dialogue apparaîtra, vous demandant de nommer le projet. Choisissez un nom et cliquez sur :guilabel:`Create`. Lorsque vous créez votre projet, vous le verrez au-dessus du bouton à gauche.

source: Click on the project, and you will be taken to its page.
es_mx: Clic en el proyecto y será llevado a su pagina.
fr_ca: Cliquez sur le projet et vous serez redirigé vers sa page.

source: Start Retraining
es_mx: Empezar a reentrenar
fr_ca: Commencer la reconversion

source: At the top of the project window, there are several parameters to specify how you want the model to be retrained.
es_mx: En la parte de arriba de la ventana del proyecto, hay varios parámetros para especificar de que manera quiere que el modelo sea reentrenado.
fr_ca: En haut de la fenêtre du projet, il y a plusieurs paramètres pour spécifier comment vous voulez que le modèle soit réentraîné.

source: **Epochs**: The number of times the dataset will be passed through the model during training. Generally more epochs are better, and a model should continue to be trained until the performance increase becomes very small or it stops improving.
es_mx: **Epochs**: El numero de veces que el dataset será pasado a través del modelo durante el entrenamiento. Generalmente más épocas es mejor y un modelo debería continuar siendo entrenado hasta que el aumento de desempeño sea muy pequeño o deje de mejorar.
fr_ca: **Époques** : nombre de fois que l'ensemble de données sera transmis au modèle pendant l'entraînement. En général, plus qu'il y a d'époques, mieux c'est. Un modèle doit continuer à être entraîné jusqu'à ce que l'augmentation des performances devienne très faible ou qu'elle cesse de s'améliorer.

source: **Batch Size**: The amount of images to use in each training iteration. A larger batch size will make epochs train faster as there will be less batches, but it will require more memory to load all of the images. Generally we recommend leaving this value at default.
es_mx: **Batch Size**: La cantidad de imágenes para usar en cada iteración de entrenamiento. Una cantidad de ejemplos más grande hará el entrenamiento de épocas más rápido ya que habrá menos ejemplos, pero requerirá más memoria para cargar todas las imágenes. Generalmente recomendamos dejar esto en el valor default.
fr_ca: **Taille du lot** : La quantité d'images à utiliser dans chaque itération d'entraînement. Une taille de lot plus grande accélérera l'entraînement des époques car il y aura moins de lots, mais cela nécessitera plus de mémoire pour charger toutes les images. En général, nous vous recommandons de laisser cette valeur par défaut.

source: **Evaluation Frequency**: The amount of epochs to run before each evaluation of the models precision. Each evaluation will be viewable so you can check the progress of your model.
es_mx: **Evaluation Frequency**: La cantidad de épocas para correr antes de cada evaluación de la precisión del modelo. Cada evaluación será visible así que puede checar el progreso de su modelo.
fr_ca: **Fréquence d'évaluation** : le nombre d'époques à exécuter avant chaque évaluation de la précision des modèles. Chaque évaluation sera visible afin que vous puissiez vérifier la progression de votre modèle.

source: **Percent Evaluation**: The percent of the dataset to be reserved exclusively for evaluation of the models precision during training. A higher percent evaluation means that more images are used to test the model. Those images will not be used to train the model so there will be less training data. Generally we recommend leaving this value at default.
es_mx: **Percent Evaluation**: El porcentaje del dataset para ser reservado exclusivamente para la evaluación de modelos de precisión durante el entrenamiento. Un porcentaje más alto de evaluación significa que más imágenes serán usadas para probar el modelo. Esas imágenes no serán usadas para entrenar el modelo así que habrá menos datos para el entrenamiento. Generalmente recomendamos dejar este valor en el predeterminado.
fr_ca: **Evaluation en pourcentage** : le pourcentage de l'ensemble de données à réserver exclusivement à l'évaluation de la précision des modèles pendant l'entraînement. Un pourcentage d'évaluation plus élevé signifie que davantage d'images sont utilisées pour tester le modèle. Ces images ne seront pas utilisées pour entraîner le modèle, il y aura donc moins de données d'entraînement. En général, nous vous recommandons de laisser cette valeur par défaut.

source: **Datasets**: The datasets you would wish to retrain with. Edit these input parameters to fit your needs, and tick the checkboxes of the desired datasets from the dropdown.
es_mx: *Datasets**: Los datos con los que le gustaría reentrenar. Edite estos parámetros de entrada para que se adecúen a sus necesidades, y seleccione las casillas de verificación de los datasets deseados desde el menú desplegable.
fr_ca: **Ensembles de données** : les ensembles de données avec lesquels vous souhaitez vous entraîner. Modifiez ces paramètres d'entrée en fonction de vos besoins et cochez les cases des ensembles de données souhaités dans la liste déroulante.

source: Hyperparameters
es_mx: Hiperparámetros
fr_ca: Hyperparamèters

source: When you are ready to start the retraining, click the play button to the right of the dataset dropdown.
es_mx: Cuando esté listo para empezar a reentrenar, haga clic en el botón de play en el lado derecho del menú desplegable del dataset.
fr_ca: Lorsque vous êtes prêt à commencer l'entraînement, cliquez sur le bouton de lecture à droite de la liste déroulante de l'ensemble de données.

source: When an evaluation happens, a checkpoint is produced. This is a copy of the model at a particular point in the training. While the model trains, you will see checkpoints appear as points on the graph.
es_mx: Cuando la evaluación suceda, un checkpoint es producido. Esta es una copia de el modelo en un punto particular del entrenamiento. Mientras el modelo entrene, verá los checkpoints aparecer como puntos en la grafica.
fr_ca: Lorsqu'une évaluation se produit, un point de contrôle est produit. Il s'agit d'une copie du modèle à un moment particulier de la formation. Pendant que le modèle s'entraîne, vous verrez des points de contrôle apparaître sous forme de points sur le graphique.

source: Exporting a Checkpoint in TFLite Format
es_mx: Exportando un Checkpoint en formato de TFLite
fr_ca: Exportation d'un point de contrôle au format TFLite

source: To export a checkpoint as a TFLite model for use, select the desired checkpoint by clicking the point on the graph.
es_mx: Para exportar un checkpoint como un modelo de TFLite para usar, seleccione el checkpoint deseado dando clic en su punto en la grafica.
fr_ca: Pour exporter un point de contrôle en tant que modèle TFLite à utiliser, sélectionnez le point de contrôle souhaité en cliquant sur le point sur le graphique.

source: Select a Checkpoint
es_mx: Seleccionar un checkpoint.
fr_ca: Choisir un point de contrôle

source: This will select the checkpoint. Export this checkpoint by clicking the export button below the graph.
es_mx: Esto seleccionará el checkpoint. Exportar este checkpoint dando click en el botón de export abajo de la grafica.
fr_ca: Cela sélectionnera le point de contrôle. Exportez ce point de contrôle en cliquant sur le bouton d'exportation sous le graphique.

source: Click the Export Button
es_mx: Haga Clic en el Botón de Exportar
fr_ca: Cliquer le bouton Export

source: You will soon see an export appear below the button.
es_mx: Pronto verá aparecer una exportación debajo del botón
fr_ca: Vous verrez bientôt une exportation apparaître sous le bouton.

source: Exporting
es_mx: Exportando
fr_ca: Exporter

source: When the export has completed, you will see the checkpoint appear in the checkpoint menu where you can select and work with any of the exported checkpoints.
es_mx: Cuando se haya completado la exportación, verá aparecer el punto de control en el menú del punto de control, donde puede seleccionar y trabajar con cualquiera de los puntos de control exportados.
fr_ca: Une fois l'exportation terminée, vous verrez le point de contrôle apparaître dans le menu des points de contrôle où vous pouvez sélectionner et utiliser n'importe lequel des points de contrôle exportés.

source: Export Menu
es_mx: Menú Exportar
fr_ca: Menu Export

source: You may click the menu to the right of an exported model, providing options to rename, and delete.
es_mx: Puede hacer clic en el menú a la derecha de un modelo exportado, proporcionando opciones para cambiar el nombre y eliminar.
fr_ca: Vous pouvez cliquer sur le menu à droite d'un modèle exporté, offrant des options pour renommer et supprimer.

source: Menu Options
es_mx: Opciones de menú

source: Click the download button, and your browser will download a tarfile containing two TFLite models of the selected checkpoint, one of which is optimized for the Coral TPU. There is also a label map file, for use when converting the model's output to a human-readable format.
es_mx: Haga clic en el botón de descarga y su navegador descargará un archivo tar que contiene dos modelos TFLite del punto de control seleccionado, uno de los cuales está optimizado para Coral TPU. También hay un archivo de mapa de etiquetas, para usar al convertir la salida del modelo a un formato legible por humanos.
fr_ca: Cliquez sur le bouton de téléchargement et votre navigateur téléchargera un fichier tar contenant deux modèles TFLite du point de contrôle sélectionné, dont l'un est optimisé pour le Coral TPU. Il existe également un fichier de mappage d'étiquettes, à utiliser lors de la conversion de la sortie du modèle dans un format humainement lisible.

source: Select and Download Checkpoints
es_mx: Selecciona y descarga los puntos de control
fr_ca: Choisir et télécharger les points de contrôle

source: Testing an Exported Model
es_mx: Probando un modelo exportado
fr_ca: Test d'un modèle exporté

source: To test an exported model, open the testing dialog by clicking the :guilabel:`Test` button in the menu of the export you would like to test.
es_mx: Para probar un modelo exportado, abra el cuadro de dialogo de testing haciendo clic en el botón :guilabel:`Test` en el menú de la exportación que le gustaría probar.
fr_ca: Pour tester un modèle exporté, ouvrez la boîte de dialogue de test en cliquant sur le bouton :guilabel:`Test` dans le menu de l'export que vous souhaitez tester.

source: Test Checkpoint
es_mx: Probar Punto de control
fr_ca: Test des points de contrôle

source: Test Menu
es_mx: Menú de prueba
fr_ca: Menu de Test

source: First, click the :guilabel:`Select Video` box, and click the :guilabel:`+` that will appear to upload a video.
es_mx: Primero, haga clic en la caja de :guilabel:`Select Video` y luego haga clic en el :guilabel:`+` que aparecerá para subir un video.
fr_ca: Tout d'abord, cliquez sur la case :guilabel:`Select Video`, puis cliquez sur :guilabel:`+` qui apparaîtra pour télécharger une vidéo.

source: Upload
es_mx: Subir
fr_ca: Télécharger

source: This will open a window that allows you to upload a ``.mp4`` file.
es_mx: Esto abrirá una ventana que le permita subir un archivo de tipo ``.mp4``
fr_ca: Cela ouvrira une fenêtre qui vous permettra de télécharger un fichier ``.mp4``.

source: Save
es_mx: Guardar
fr_ca: Sauver

source: Drop a ``.mp4`` in the dropzone, or click to select the file. Once the file is in the dropzone, click :guilabel:`Save`.
es_mx: Ponga un ``.mp4`` en la dropzone, o haga clic para seleccionar el archivo. Una vez que el archivo está en la dropzone, haga clic en :guilabel:`Save`.
fr_ca: Déposez un ``.mp4`` dans la zone de dépôt, ou cliquez pour sélectionner le fichier. Une fois le fichier dans la dropzone, cliquez sur :guilabel:`Save`.

source: When uploaded, you will see the video in the dropdown menu, allowing you to select it for the test.
es_mx: Cuando esté arriba, verá el video en el menú desplegable, permitiéndole seleccionarlo para su prueba.
fr_ca: Une fois téléchargée, vous verrez la vidéo dans le menu déroulant, vous permettant de la sélectionner pour le test.

source: You have the option to change the name of the annotated output video produced by the test.
es_mx: Usted tiene la opción de cambiar el nombre de la salida de vídeo anotada producida por la prueba.
fr_ca: Vous avez la possibilité de modifier le nom de la vidéo de sortie annotée produite par le test.

source: Press Test
es_mx: Presione test
fr_ca: Appuyer sur Test

source: Click the :guilabel:`Test` button, and you will see the test begin.
es_mx: Haga clic en el botón de :guilabel:`Test`, y usted verá la prueba empezar.
fr_ca: Cliquez sur le bouton :guilabel:`Test`, et vous verrez le test commencer.

source: View the Test
es_mx: Mire la prueba
fr_ca: Visualiser le Test

source: The test uses your model to annotate the video, creating a stream for you to watch as it happens. Click the :guilabel:`View` button, and the stream will open in a separate tab.
es_mx: La prueba usa su modelo para anotar en el video, creando un stream para que usted lo vea mientras sucede. Haga clic en el botón de :guilabel:`View`, y el stream se abrirá en una pestaña separada.
fr_ca: Le test utilise votre modèle pour annoter la vidéo, créant un flux que vous pouvez regarder au fur et à mesure. Cliquez sur le bouton :guilabel:`View`, et le flux s'ouvrira dans un onglet séparé.

source: When the test completes, you will see it at the bottom of the test dialog.
es_mx: Cuando se complete la prueba, la verá al fondo del cuadro de dialogo.
fr_ca: Une fois le test terminé, vous le verrez en bas de la boîte de dialogue de test.

source: Test Dialog
es_mx: Dialogo de prueba
fr_ca: Dialogue du Test

source: You can download the annotated video. Click the download icon next to the test’s name, and your browser will begin the download. The video is currently a ``.mp4`` within a ``.zip``.
es_mx: Usted puede descargar el video con anotaciones. Haga clic en el icono descargar al lado del nombre de la prueba, y su navegador empezará a descargar el video. El video es un ``.mp4`` dentro de un ``.zip``.
fr_ca: Vous pouvez télécharger la vidéo annotée. Cliquez sur l'icône de téléchargement à côté du nom du test et votre navigateur commencera le téléchargement. La vidéo est actuellement un ``.mp4`` dans un ``.zip``.
