Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/axon/using-on-a-robot.po
Languages: fr_ca

source: Using Inference Output on a Robot
fr_ca: Utilisation de la sortie d'inférence sur un robot

source: The provided script for running inference on a coprocessor outputs all inference data over NetworkTables for ease of access.
fr_ca: Le script fourni pour exécuter l'inférence sur un coprocesseur génère toutes les données d'inférence sur NetworkTables pour faciliter l'accès.

source: Output Format
fr_ca: Format de sortie

source: Because there can be any number of detected objects in a given image, the inference data is sent in a JSON string to the ``ML/detections`` NetworkTables entry. By compiling all data into a single entry, it is certain that the labels match with the bounding boxes, which may not be true if these items were separate entries.
fr_ca: Comme il peut y avoir n'importe quel nombre d'objets détectés dans une image donnée, les données d'inférence sont envoyées dans une chaîne JSON à l'entrée NetworkTables ``ML/detections``. En compilant toutes les données en une seule entrée, il est certain que les étiquettes correspondent aux cadres de délimitation, ce qui peut ne pas être vrai si ces éléments étaient des entrées distinctes.

source: The JSON string has the following format:
fr_ca: La chaîne JSON a le format suivant :

source: The example above shows the value of the ``ML/detections`` entry if two objects are detected. It is a list of objects, where the ``label`` attribute means the kind of object that was detected. The ``box`` attribute describes the bottom left and top right corners of the bounding box, i.e. the box that completely surrounds the detected object within the image. There will be an empty list if no objects are detected. The ``confidence`` attribute is how confident the model is that the given object is correctly detected.
fr_ca: L'exemple ci-dessus montre la valeur de l'entrée ``ML/detections`` si deux objets sont détectés. C'est une liste d'objets, où l'attribut ``label`` désigne le type d'objet qui a été détecté. L'attribut ``box`` décrit les coins inférieur gauche et supérieur droit de la boîte englobante, c'est-à-dire la boîte qui entoure complètement l'objet détecté dans l'image. Il y aura une liste vide si aucun objet n'est détecté. L'attribut ``confidence`` est le degré de confiance du modèle que l'objet donné est correctement détecté.

source: There are three more NetworkTables entries that the provided script uses to help the programmer. The first is ``ML/fps``, which tells the programmer how many frames their model is processing per second. Another is ``ML/coral``, which tells the programmer is a Google Coral USB accelerator is currently being used. This is included in case someone removes the Coral from the robot and forgets to put it back, or a similar scenario. The final NetworkTables entry is ``ML/resolution``, which is the string ``WIDTH, HEIGHT``, telling the programmer the size of the processed image, for use with calculations.
fr_ca: Il existe trois autres entrées NetworkTables que le script fourni utilise pour aider le programmeur. Le premier est ``ML/fps``, qui indique au programmeur combien d'images son modèle traite par seconde. Un autre est ``ML/coral``, qui indique au programmeur qu'un accélérateur USB Google Coral est actuellement utilisé. Ceci est inclus dans le cas où quelqu'un retire le corail du robot et oublie de le remettre, ou dans un scénario similaire. L'entrée finale de NetworkTables est ``ML/resolution``, qui est la chaîne ``WIDTH, HEIGHT``, indiquant au programmeur la taille de l'image traitée, à utiliser avec les calculs.

source: Applications of Inference
fr_ca: Applications de l'inférence

source: Machine learning is applicable to the FIRST Robotics Competition when non-uniform objects need to be detected, i.e. a hatch panel from the 2019 game.
fr_ca: L'apprentissage automatique est applicable à la compétition de robotique FIRST lorsque des objets non uniformes doivent être détectés, c'est-à-dire une écoutille du jeu 2019.

source: hatch panels being inferenced.
fr_ca: panneaux d’hachures en cours d’inférence.

source: A model could also be trained to recognize other robots, if a collision-avoidance system were wanted to be implemented. The WPILib team has found that uniform objects, such as the 2020 Power Cells, are also easily detected by neural networks, but other algorithms may be more appropriate.
fr_ca: Un modèle pourrait également être entraîné à reconnaître d'autres robots, si un système d'évitement des collisions devait être mis en œuvre. L'équipe WPILib a découvert que les objets uniformes, tels que les cellules d'énergie 2020, sont également facilement détectés par les réseaux de neurones, mais d'autres algorithmes peuvent être plus appropriés.
