Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/smartdashboard/test-mode-and-live-window/enabling-test-mode.po
Languages: fr_ca, tr_tr

source: Enabling Test mode (LiveWindow)
fr_ca: Activation du mode Test (LiveWindow)
tr_tr: Test Modunun Etkinleştirilmesi (LiveWindow)

source: You may add code to your program to display values for your sensors and actuators while the robot is in Test mode. This can be selected from the Driver Station whenever the robot is not on the field. The code to display these values is automatically generated by RobotBuilder and is described in the next article. Test mode is designed to verify the correct operation of the sensors and actuators on a robot. In addition it can be used for obtaining setpoints from sensors such as potentiometers and for tuning PID loops in your code.
fr_ca: Vous pouvez ajouter du code à votre programme pour afficher les valeurs de vos capteurs et actionneurs pendant que le robot est en mode Test. Cela peut être fait à partir de Driver Station quand le robot n’est pas sur le terrain en compétition. Le code pour afficher ces valeurs est généré automatiquement par RobotBuilder et est décrit dans l’article suivant. Le mode Test est conçu pour vérifier le bon fonctionnement des capteurs et des actionneurs sur un robot. En outre, il peut être utilisé pour obtenir des valeurs cibles à partir de capteurs tels que des potentiomètres et pour régler les boucles de rétroation PID dans votre code.

source: Setting Test mode with the Driver Station
fr_ca: Configuration du mode Test avec Driver Station

source: Selecting the "Test" button on the Driver Station and then "Enable".
fr_ca: En sélectionnant le bouton "Test" sur Driver Station, puis "Enable".

source: Enable Test Mode in the Driver Station by clicking on the "Test" button and setting "Enable" on the robot. When doing this, the SmartDashboard display will switch to test mode (LiveWindow) and will display the status of any actuators and sensors used by your program.
fr_ca: Activez le mode Test dans l'application Driver Station en cliquant sur le bouton "Test" et en cliquant "Enable" pour le robot. Ce faisant, l’écran de SmartDashboard passera en mode Test (LiveWindow) et affichera l’état de tous les actionneurs et capteurs utilisés par votre programme.

source: Explicitly vs. implicit test mode display
fr_ca: Affichage en mode test explicite vs implicite
tr_tr: Açık ve örtük test modu ekranı

source: Highlights explicitly adding sensors to test in code.
fr_ca: Met en évidence l’ajout explicite de capteurs à tester dans le code.

source: All sensors and actuators will automatically be displayed on the SmartDashboard in test mode and will be named using the object type (such as Jaguar, Analog, Victor, etc.) with the module number and channel number with which the object was created. In addition, the program can explicitly add sensors and actuators to the test mode display, in which case programmer-defined subsystem and object names can be specified making the program clearer. This example illustrates explicitly defining those sensors and actuators in the highlighted code.
fr_ca: Tous les capteurs et actionneurs seront automatiquement affichés sur SmartDashboard en mode test et seront nommés en utilisant le type d’objet (tel que Jaguar, Analog, Victor, etc.) avec le numéro du module et le numéro de canal avec lequel l’objet a été créé. En outre, le programme peut explicitement ajouter des capteurs et des actionneurs au mode test; dans cas, les noms de sous-systèmes et d’objets définis par le programmeur peuvent être spécifiés, ce qui rend le programme plus clair. Cet exemple illustre la définition explicite des capteurs et actionneurs dans le code mis en surbrillance.

source: Understanding what is displayed in Test mode
fr_ca: Comprendre ce qui s’affiche en mode Test
tr_tr: Test modunda nelerin görüntülendiğini anlamak

source: Highlights both ungrouped and subsystem motors displayed in test mode.
fr_ca: Met en relief aussi bien les moteurs non groupés que les moteurs de sous-système affichés en mode test.
tr_tr: Test modunda görüntülenen gruplanmamış motorlar ve alt sistem motorlarının daire içine alınması.

source: This is the output in the SmartDashboard display when the robot is placed into test mode. In the display shown above the objects listed as Ungrouped were implicitly created by WPILib when the corresponding objects were created. These objects are contained in a subsystem group called "Ungrouped" **(1)** and are named with the device type (Analog, Jaguar in this case), and the module and channel numbers. The objects shown in the "SomeSubsystem" **(2)** group are explicitly created by the programmer from the code example in the previous section. These are named in the calls to ``LiveWindow.addActuator()`` and ``LiveWindow.AddSensor()``. Explicitly created sensors and actuators will be grouped by the specified subsystem.
fr_ca: Ceci correspond à la sortie affichée par SmartDashboard lorsque le robot est placé en mode test. Dans l’affichage indiqué ci-dessus, les objets listés sous Ungrouped ont été créés implicitement par WPILib lorsque les objets correspondants ont été créés. Ces objets sont contenus dans un groupe de sous-systèmes appelé "Ungrouped" **(1)** et sont nommés avec le type du dispositif (dans le cas présent: Analogique, Jaguar), ainsi que les numéros de module et de canal. Les objets apparaissant dans le groupe "SomeSubsystem" **(2)** sont explicitement créés par le programmeur à partir de l’exemple de code de la section précédente. Ceux-ci figurent dans les appels aux méthodes ``LiveWindow.addActuator()`` et ``LiveWindow.AddSensor()``. Les capteurs et actionneurs créés explicitement seront regroupés sous le sous-système spécifié.

source: You may add code to your program to display values for your sensors and actuators while the robot is in Test mode. This can be selected from the Driver Station whenever the robot is not on the field (see :ref:`docs/software/basic-programming/using-test-mode:Enabling Test Mode` for details on how to do this). Test mode is designed to verify the correct operation of the sensors and actuators on a robot. In addition it can be used for obtaining setpoints from sensors such as potentiometers and for tuning PID loops in your code. When the robot is enabled in Test mode, the SmartDashboard display will switch to test mode (LiveWindow) and will display the status of any actuators and sensors used by your program.
tr_tr: Robot Test modundayken sensörler ve aktüatörlerinizin görüntülemesi için programınıza kod ekleyebilirsiniz. Bu kod, robot sahada değilken Driver Station - Sürücü İstasyonu üzerinden seçilebilmektedir (bunu nasıl yapacağınıza dair daha fazla bilgi için bkz. :ref:`docs/software/basic-programming/using-test-mode:Enabling Test Mode`). Test modu robottaki sensörler ve aktüatörlerin hatasız bir şekilde çalıştığını doğrulamak için tasarlanmıştır. Buna ek olarak mod potansiyometre gibi sensörlerden ayar noktaları edinmek ve kodunuzdaki PID döngülerini ayaralamak için de kullanılabilmektedir. Robotun Test modu etkinken SmartDashboard ekranı test moduna (LiveWindow) geçecek ve programınız tarafından kullanılan herhangi bir aktüatör ile sensörün durumunu görüntüleyecektir.

source: Since 2024, LiveWindow is not enabled by default in Test mode!
tr_tr: 2024 yılından itibaren LiveWindow varsayılan olarak Test modunda etkinleştirilmemektedir.

source: Enabling LiveWindow in Test Mode
tr_tr: Test Modunda LiveWindow'un Etkinleştirilmesi

source: To run LiveWindow in Test Mode, the following code is needed in the ``Robot`` class:
tr_tr: LiveWindow'u Test modunda çalıştırmak için ``Robot`` sınıfında aşağıdaki kodun bulunmasına ihtiyaç vardır:

source: All sensors and actuators will automatically be displayed on the SmartDashboard in test mode and will be named using the object type (such as PWMSparkMax, PWMVictorSPX, BuiltInAccelerometer, etc.) with channel number with which the object was created. In addition, the program can explicitly add sensors and actuators to the test mode display, in which case programmer-defined subsystem and object names can be specified making the program clearer. This example illustrates explicitly defining those sensors and actuators.
tr_tr: Tüm sensörler ve aktüatörler test modunda SmartDashboard'da kendiliğinden görüntülenecek ve nesnenin oluşturulduğu kanalın sınıfıyla (PWMSparkMax, PWMVictorSPX, BuiltInAccelerometer vb. gibi) nesne sınıfları kullanılarak adlandırılacaklardır. Buna ek olarak program test modu ekranına açıkça sensör ve aktüatör ekleyebilmektedir, bu durumda programı daha anlaşılır bir hale getirmek adına programcı tarafından tanımlanan alt sistem ve nesne isimleri belirlenebilmektedir. Yukarıdaki örnek, bahsi geçen sensör ve aktüatörlerin açıkça nasıl tanımlandığını netleştirmektedir:

source: This is the output in the SmartDashboard display when the robot is placed into test mode. In the display shown above the objects listed as Ungrouped were implicitly created by WPILib when the corresponding objects were created. These objects are contained in a subsystem group called "Ungrouped" **(1)** and are named with the device type (PWMSparkMax in this case), and the channel numbers. The objects shown in the "SomeSubsystem" **(2)** group are explicitly created by the programmer from the code example in the previous section. These are named in the calls to ``SendableRegistry.setName()``. Explicitly created sensors and actuators will be grouped by the specified subsystem.
tr_tr: Robot test moduna getirildiğinde SmartDashboard ekranındaki çıktı bu şekildedir. Yukarıda gösterilen ekranda Ungrouped - Gruplanmamış olarak sıralanan nesneler ilişkili oldukları nesneler oluşturulduktan sonra WPILib tarafından açıkça oluşturulmuştur. Bu nesneler "Ungrouped" **(1)** olarak adlandırılan bir alt sistem gurubunda toplanmış ve (bu durumda PWMSparkMax olan) cihaz türüyle kanal numaraları aracılığıyla isimlendirilmişlerdir. "SomeSubsystem" **(2)** grubundaki nesneler önceki bölümdeki kod örneğinden yola çıkılarak programcı tarafından açıkça oluşturulmuştur. Nesneler ``SendableRegistry.setName()``'e yapılan çağrılarda isimlendirilmektedir. Açıkça oluşturulmuş sensörler ve aktüatörler belirtilen alt sistem tarafından gruplanacaktır.
