Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/introduction.po
Languages: he_il, tr_tr, zh_cn

source: Introduction
he_il: מבוא
tr_tr: Giriş
zh_cn: 简介

source: Welcome to the official documentation home for the *FIRST*\ |reg| Robotics Competition Control System and WPILib software packages. This page is the primary resource documenting the use of the FRC\ |reg| Control System (including wiring, configuration, and software) as well as the WPILib libraries and tools.
tr_tr: *FIRST*\ |reg| Robotik Yarışması Kpntrol Sistemi ve WPILib yazılım paketlerinin resmi belgeleme ana sayfasına hoş geldiniz. Bu sayfa (kablolama, yapılandırma ve yazılım dahil olmak üzere) FRC\ |reg| Kontrol Sisteminin kullanımının yanı sıra WPILib kütüphaneleri ve araçlarını belgeleyen ana kaynaktır.

source: New to Programming?
he_il: חדשים בתכנות?
tr_tr: Programlamaya Yeni Mi Başladınız?
zh_cn: 不熟悉编程？

source: These pages cover the specifics of the WPILib libraries and the FRC Control System and do not describe the basics of using the supported programming languages. If you would like resources on learning the supported programming languages check out the recommendations below:
he_il: עמודים אלו מכסים את המפרט של ספריות WPILib ומערכת הבקרה של FRC ואינם מתארים את יסודות השימוש בשפות התכנות הנתמכות. אם ברצונכם לקבל משאבים ללימוד שפות התכנות הנתמכות, עיינו בהמלצות הבאות:
tr_tr: Bu sayfalar, WPILib kitaplıklarının ve FRC Kontrol Sisteminin özelliklerini kapsamakta ve desteklenen programlama dillerini kullanmanın temellerini açıklamamaktadır. Desteklenen programlama dillerini öğrenmeye yönelik kaynaklar arıyorsanız, aşağıdaki önerilere göz atabilirsiniz:
zh_cn: 这些页面涵盖了WPILib库和FRC控制系统的细节，但没有讲述如何使用支持的基础编程语言。如果您想获得学习支持的编程语言的资源，请查看以下建议：

source: You can continue with this Zero-to-Robot section to get a functioning basic robot without knowledge of the programming language. To go beyond that, you will need to be familiar with the language you choose to program in.
he_il: ניתן להמשיך עם חלק זה של ״מאפס לרובוט״ כדי לקבל רובוט בסיסי מתפקד ללא ידיעת שפת התכנות. כדי לעבור מעבר לכך, יהיה עליכם להכיר את השפה בה בחרתם לתכנת.
tr_tr: Programlama dili bilgisi olmadan işlevsel temel bir robot elde etmek için bu Sıfırdan Robota bölümünü okumaya devam edebilirsiniz. Bunun ötesine geçmek içinse programlamada kullanmayı seçtiğiniz dile aşina olmanız gerekecektir.
zh_cn: 您可以继续执行“零到机器人”部分，以在不了解编程语言的情况下获得正常运行的基本机器人。除此之外，您将需要熟悉选择的编程语言。

source: `Head First Java 2nd Edition <https://www.amazon.com/dp/0596009208/>`__ is a very beginner friendly introduction to programming in Java (ISBN-10: 0596009208).
he_il: `Head First Java 2nd Edition <https://www.amazon.com/dp/0596009208/>`__ הוא מבוא ידידותי למתחילים לתכנות ב-Java (מסת״ב: 0596009208).
tr_tr: `Head First Java 2. Baskı <https://www.amazon.com/dp/0596009208/>`__ Java ile programlama konusunda yeni başlayanlar için açık ve anlaşılır bir kaynaktır (ISBN-10: 0596009208).
zh_cn: `Head First Java 2nd Edition <https://www.amazon.com/dp/0596009208/>`__ 是一个对新手极其友好的 Java 编程教程 (ISBN-10: 0596009208).

source: `Programming: Principles and Practice Using C++ 2nd Edition <https://www.amazon.com/dp/B00KPTEH8C>`__ is an introduction to C++ by the creator of the language himself (ISBN-10: 0321992784).
he_il: `Programming: Principles and Practice Using C++ 2nd Edition <https://www.amazon.com/dp/B00KPTEH8C>`__ הוא מבוא ל-C++ על ידי יוצר השפה בעצמו (מסת״ב: 0321992784).
tr_tr: `Programming: Principles and Practice Using C++ 2. Baskı <https://www.amazon.com/dp/B00KPTEH8C>`__ C++ dilinin mucidinden tarafından bu programlama dili için bir giriş niteliğindedir (ISBN-10: 0321992784).
zh_cn: `编程：使用C ++的原理和实践第二版<https://www.amazon.com/dp/B00KPTEH8C>`__是该语言的创建者自己对C ++的介绍（ISBN-10：0321992784）。

source: `C++ Primer Plus 6th Edition <https://www.amazon.com/dp/0321928423/>`__ (ISBN-10: 0321776402).
he_il: `C++ Primer Plus 6th Edition <https://www.amazon.com/dp/0321928423/>`__ (מסת״ב: 0321776402).
tr_tr: `C++ Primer Plus 6. Baskı <https://www.amazon.com/dp/0321928423/>`__ (ISBN-10: 0321776402).

source: `List of various guides to learn Python <http://docs.python-guide.org/en/latest/intro/learning/>`__
tr_tr: `Python öğrenmek için kullanılabilecek çeşitli rehberlerin bir listesi <http://docs.python-guide.org/en/latest/intro/learning/>`__

source: Zero to Robot
he_il: מאפס לרובוט
tr_tr: Sıfırdan Robota
zh_cn: 零到机器人

source: The remaining pages in this tutorial are designed to be completed in order to go from zero to a working basic robot. The documents will walk you through wiring your robot, installation of all needed software, configuration of hardware, and loading a basic example program that should allow your robot to operate. When you complete a page, simply click **Next** to navigate to the next page and continue with the process. When you're done, you can click **Next** to continue to an overview of WPILib in C++/Java/Python or jump back to the home page using the logo at the top left to explore the rest of the content.
tr_tr: Bu rehberin geri kalan sayfaları, sıfırdan başlayıp işlevsel temel bir robota ulaşmak için tamamlanmak üzere tasarlanmıştır. İleriki sayfalardaki belgeler size robot kablolaması, gerekli yazılımların yüklenmesi, donanımın yapılandırması ve robotunuzun işlevsel hale gelmesine olanak tanıyacak temel bir örnek programın kurulumu konularında yol gösterecektir. Bu aşamaları tamamlamanızla birlikte *Sonraki* tuşuna tıklayarak C++/Java/Python'da WPILib'e genel bir bakış ile devam edebilir veya içeriklerin geri kalanını keşfetmek için sol üstteki logoya tıklayarak ana sayfaya dönebilirsiniz.

source: Welcome to the official documentation home for the *FIRST*\ |reg| Robotics Competition Control System and WPILib software packages. This page is the primary resource documenting the use of the FRC\ |reg| Control System (including wiring, configuration and software) as well as the WPILib libraries and tools.
he_il: ברוכים הבאים לתיעוד הרשמי של מערכת הבקרה של *FIRST*\ |reg| Robotics Competition וחבילות התוכנה של WPILib. העמוד הזה הוא המשאב העיקרי המתעד את השימוש של מערכת הבקרה של FRC\ |reg| (כולל חיווט, קונפיגורציה, ותוכנה) וגם הספריות והכלים של WPILib.
zh_cn: 欢迎来到 *FIRST*\ |reg| Robotics Competition 控制系统和 WPILib 软件包的官方文档主页。此网页是记录 FRC\ |reg| 控制系统 (包括排线、设置与软件) 和 WPILib 库和工具使用方法的一手资源。

source: LabVIEW
zh_cn: LabVIEW 软件

source: `NI Learn LabVIEW <https://www.ni.com/getting-started/labview-basics/>`__
zh_cn: `NI学习LabVIEW <https://www.ni.com/getting-started/labview-basics/>`__

source: The remaining pages in this tutorial are designed to be completed in order to go from zero to a working basic robot. The documents will walk you through wiring your robot, installation of all needed software, configuration of hardware, and loading a basic example program that should allow your robot to operate. When you complete a page, simply click **Next** to navigate to the next page and continue with the process. When you're done, you can click **Next** to continue to an overview of WPILib in C++/Java or jump back to the home page using the logo at the top left to explore the rest of the content.
he_il: שאר העמודים במדריך זה נועדו להשלים על מנת לעבור מאפס לרובוט בסיסי עובד. המסמכים ינחו אתכם דרך חיווט של הרובוט שלך, התקנת כל התוכנות הדרושות, קונפיגורציית החומרה וטעינה של תוכנית דוגמה בסיסית שתאפשר לרובוט שלכם לפעול. לאחר השלמת עמוד, פשוט לחץ על **Next** כדי לעבור לדף הבא ולהמשיך בתהליך. לאחר שתסיימו, תוכלו ללחוץ על **Next** כדי להמשיך לסקירה כללית של WPILib ב-C++/Java או לקפוץ חזרה לדף הבית באמצעות הלוגו בצד ימין למעלה כדי לחקור את שאר התוכן.
zh_cn: 本教程的其余页面旨在从零到可以运行的基本机器人完成。这些文档将引导您完成机器人的接线，所有必需软件的安装，硬件配置以及加载应允许机器人操作的基本示例程序。完成页面后，只需单击“下一步”即可导航到下一页并继续该过程。完成后，您可以单击** Next **以继续使用C ++ / Java进行WPILib的概述，或使用左上方的徽标跳回到主页以浏览其余内容。
