Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/resources/adding-safety-features-to-your-robot-code.po
Languages: es_mx, tr_tr, zh_cn

source: Adding Safety Features to Your Robot Code
es_mx: Agregar funciones de seguridad a su código de robot
tr_tr: Robot Kodunuza Güvenlik Özellikleri Ekleme
zh_cn: 在机器人代码中添加安全功能

source: A common problem with complex projects is making sure that all of your code is executing when you expect it to. Problems can arise when tasks with high priority, long execution times, or frequent calls hog processing power on the roboRIO. This leads to what is known as "starvation" for the tasks that are not able to execute due to the processor being busy. In most cases this will simply slow the reaction time to your input from the joysticks and other devices. However, this can also cause the drive motors of your robot to stay on long after you try to stop them. To avoid any robotic catastrophes from this, you can implement safety features that check for task input starvation and automatically shut down potentially harmful operations.
es_mx: Un problema común con los proyectos complejos es asegurarse de que todo su código se esté ejecutando cuando lo espera. Pueden surgir problemas cuando las tareas con alta prioridad, tiempos de ejecución prolongados o llamadas frecuentes acaparan la potencia de procesamiento del roboRIO. Esto conduce a lo que se conoce como "starvation" para las tareas que no se pueden ejecutar debido a que el procesador está ocupado. En la mayoría de los casos, esto simplemente ralentizará el tiempo de reacción a su entrada de los joysticks y otros dispositivos. Sin embargo, esto también puede hacer que los motores de accionamiento de su robot permanezcan encendidos mucho tiempo después de que intente detenerlos. Para evitar cualquier catástrofe robótica a causa de esto, puede implementar funciones de seguridad que verifiquen la falta de entrada de tareas y apague automáticamente las operaciones potencialmente dañinas.
tr_tr: Karmaşık projelerde yaygın olarak görülen bir sorun, tüm kodunuzun beklediğiniz anda çalıştığından emin olmaktır. RoboRIO'da yüksek önceliğe sahip görevler, uzun yürütme süreleri veya sık çağırmalar işlem gücü aldığında sorunlar ortaya çıkabilir. Bu, işlemcinin meşgul olması nedeniyle gerçekleştirilemeyen görevler için "starvation-açlıktan ölme" olarak bilinen duruma yol açar. Çoğu durumda bu, kumanda kollarından ve diğer cihazlardan girişinize tepki süresini basitçe yavaşlatır. Ancak bu, robotunuzun tahrik motorlarının siz onları durdurmaya çalıştıktan sonra uzun süre açık kalmasına da neden olabilir. Bundan dolayı herhangi bir robotik felaketten kaçınmak için, görev girdisi tıkanmasını kontrol eden ve potansiyel olarak zararlı işlemleri otomatik olarak kapatan güvenlik özellikleri uygulayabilirsiniz.
zh_cn: 复杂项目的常见问题是确保所有代码都能按预期执行。当优先级高，执行时间长或频繁调用roboRIO的处理能力任务持续运行时，可能会出现问题。这导致由于处理器繁忙而无法执行其他任务。在大多数情况下，这只会减慢处理器对来自操纵杆和其他设备的输入的反应时间。但是，这也可能导致机器人的驱动电机在下达停止命令后仍保持运转很长时间。为了避免一切灾祸，您可以实施安全功能，以检查命令输入是否缺乏处理，并自动关闭可能有害的操作。

source: There are built-in functions for the motors that allow easy implementation of safety checks. These functions are:
es_mx: Hay funciones integradas para los motores que permiten una fácil implementación de los controles de seguridad. Estas funciones son:
tr_tr: Motorlar için güvenlik kontrollerinin kolay uygulanmasını sağlayan yerleşik fonksiyonlar vardır. Bu işlevler şunlardır:
zh_cn: 电机具有内置功能，可轻松执行安全检查。这些功能是：

source: Robot Drive Safety Configuration
es_mx: Configuración de seguridad del accionamiento del robot
tr_tr: Robot Sürüş Güvenlik Yapılandırması
zh_cn: 机器驱动器安全配置

source: Motor Drive Safety Configuration
es_mx: Configuración de seguridad del accionamiento del motor
tr_tr: Motor Sürücü Güvenlik Yapılandırması
zh_cn: 电机驱动器安全配置

source: Relay Safety Configuration
es_mx: Configuración de seguridad de la retransmisión
tr_tr: Röle Güvenliği Yapılandırması
zh_cn: 继电器安全配置

source: PWM Safety Configuration
es_mx: Configuración de seguridad PWM
tr_tr: PWM Güvenlik Yapılandırması
zh_cn: PWM安全配置

source: Solenoid Safety Configuration
es_mx: Configuración de seguridad del solenoide
tr_tr: Solenoid Güvenlik Yapılandırması
zh_cn: 电磁阀安全配置

source: Robot Drive Delay and Update Safety
es_mx: Seguridad de actualización y retardo del accionamiento del robot
tr_tr: Robot Sürücü Gecikmesi ve Güncelleme Güvenliği
zh_cn: 机器驱动延迟和更新安全

source: In all of the Safety Configuration functions, you can enable and disable the safety checks while your programming is running and configure what timeout you think is appropriate. The functions keep a cache of all devices that have the safety enabled and will check if any of them have exceeded their time limit. If any has, all devices in the cache will be disabled and the robot will come to an immediate stop or have its relay/PWM/solenoid outputs turned off. The code below demonstrates how to use the Drive Safety Configuration functions to set a maximum time limit that the motors will receive no input before being shut off.
es_mx: En todas las funciones de configuración de seguridad, puede habilitar y deshabilitar las comprobaciones de seguridad mientras se ejecuta la programación y configurar el tiempo de espera que considere apropiado. Las funciones mantienen un caché de todos los dispositivos que tienen la seguridad habilitada y comprobarán si alguno de ellos ha superado su límite de tiempo. Si alguno lo ha hecho, todos los dispositivos en la caché se desactivarán y el robot se detendrá inmediatamente o se apagarán sus salidas de retransmisión / PWM / solenoide. El código a continuación demuestra cómo usar las funciones de configuración de seguridad del variador para establecer un límite de tiempo máximo en el que los motores no recibirán ninguna entrada antes de apagarse.
tr_tr: Tüm Güvenlik Yapılandırması işlevlerinde, programlamanız çalışırken güvenlik kontrollerini etkinleştirebilir ve devre dışı bırakabilir ve hangi zaman aşımının uygun olduğunu düşündüğünüzü yapılandırabilirsiniz. İşlevler, güvenliği etkinleştirilmiş tüm aygıtların bir önbelleğini tutar ve bunlardan herhangi birinin zaman sınırlarını aşıp aşmadığını kontrol eder. Varsa, önbellekteki tüm cihazlar devre dışı bırakılır ve robot hemen durur veya röle / PWM / solenoid çıkışları kapatılır. Aşağıdaki kod, motorların kapatılmadan önce hiçbir giriş almayacağı maksimum bir zaman sınırı ayarlamak için Sürücü Güvenlik Yapılandırması işlevlerinin nasıl kullanılacağını gösterir.
zh_cn: 在所有安全配置功能中，您可以在程序运行时启用和禁用这些安全检查，并配置您认为合适的最大时间限制。这些功能会管理一个所有启用了安全性的设备的缓存，并会检查其中是否有超过其时间限制的设备。如果有，则将禁用缓存中的所有设备，并且机器将立即停止或关闭其继电器/ PWM /电磁阀输出。下面的代码演示了如何使用“驱动器安全配置”功能来设置最大时间限制，即电动机在关闭之前所能接受的最长无输入时长。

source: To test the safety shut-off, try adding a Wait function to the loop that is longer than your timeout!
es_mx: Para probar el apagado de seguridad, intente agregar una función de espera al ciclo que sea más largo que su tiempo de espera.
tr_tr: Emniyet kapatmasını test etmek için, döngüye zaman aşımınızdan daha uzun bir Bekleme işlevi eklemeyi deneyin!
zh_cn: 要测试自关闭这一个安全机制，请尝试在循环中添加比您的最大时间限制更长的一个等待函数！

source: The final function that relates to implementing safety checks--Robot Drive Delay and Update Safety--allows you to put the roboRIO in Autonomous Mode without exceeding the time limit. It will maintain the current motor output without making costly calls to the Drive Output functions, and will also make sure that the safety checks are regularly updated so that the motors will not suddenly stop.
es_mx: La función final que se relaciona con la implementación de verificaciones de seguridad, el retardo de la unidad de robot y la actualización de seguridad, le permite poner el roboRIO en modo autónomo sin exceder el límite de tiempo. Mantendrá la salida actual del motor sin realizar costosas llamadas a las funciones de salida del variador y también se asegurará de que las comprobaciones de seguridad se actualicen periódicamente para que los motores no se detengan repentinamente.
tr_tr: Güvenlik kontrollerinin uygulanmasıyla ilgili son işlev--Robot Drive Delay and Update Safety-- roboRIO'yu zaman sınırını aşmadan Otonom Moda geçirmenizi sağlar. Sürücü Çıkışı işlevlerine ağır yüklü çağrılar yapmadan mevcut motor çıkışını koruyacak ve ayrıca motorların aniden durmaması için güvenlik kontrollerinin düzenli olarak güncellenmesini sağlayacaktır.
zh_cn: 与实施安全检查有关的最终功能-机器人驱动延迟和更新安全性-使您可以将roboRIO置于自动阶段而不会超过前文设置的时间限制。它可以保持当前的电动机输出，而无需频繁调用驱动输出功能，而还可以确保定期进行安全检查，以防止电动机突然停止运行。

source: Overall, it is highly recommended that some sort of safety check is implemented in your project to make sure that your robot is not unintentionally left in a dangerous state!
es_mx: En general, es muy recomendable que se implemente algún tipo de control de seguridad en su proyecto para asegurarse de que su robot no quede involuntariamente en un estado peligroso.
tr_tr: Genel olarak, robotunuzun kasıtsız olarak tehlikeli bir durumda bırakılmadığından emin olmak için projenizde bir tür güvenlik kontrolünün uygulanması şiddetle tavsiye edilir!
zh_cn: 总的来说，强烈建议您在项目中进行某项安全检查，以确保您的机器人不会意外地处于危险状态！
