Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/resources/how-to-use-joystick-buttons-to-control-motors-*-solenoids.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: How to Use Joystick Buttons to Control Motors or Solenoids
es_mx: Cómo utilizar los botones del Joystick para controlar motores o solenoides
fr_ca: Comment utiliser des boutons du Joystick pour contrôler les moteurs ou les solénoïdes
tr_tr: Motorları veya Solenoidleri Kontrol Etmek İçin Kumanda Kolu Düğmelerini Kullanma
zh_cn: 如何使用操纵杆按钮控制电机或电磁阀

source: As we all get our drive systems working, we are moving on to connecting our auxiliary devices such as motors and solenoids. With this, we will generally use joystick buttons to control these devices. To get started with this, we'll go through several ways to control devices with joystick buttons.
es_mx: A medida que todos ponemos en funcionamiento nuestros sistemas, pasaremos a conectar nuestros dispositivos auxiliares, como motores y solenoides. Con esto, generalmente usaremos botones de joystick para controlar estos dispositivos. Para comenzar con esto, veremos varias formas de controlar dispositivos con botones del joystick.
fr_ca: Comme tous nous avons nos systèmes d’entraînement fonctionnels, nous allons à présent connecter nos périphériques tels que les moteurs et les solénoïdes. À cet effet, nous allons généralement utiliser des boutons de joystick afin de contrôler ces périphériques. Pour commencer, nous allons passer en revue plusieurs façons de contrôler les dispositfs avec des boutons de joystick.
tr_tr: Tahrik sistemlerimizi çalışır hale getirdikçe, motorlar ve solenoidler gibi yardımcı cihazlarımızı bağlamaya geçiyoruz. Bununla birlikte, bu cihazları kontrol etmek için genellikle joystick düğmelerini kullanacağız. Buna başlamak için, joystick düğmeleriyle cihazları kontrol etmenin birkaç yolunu inceleyeceğiz.
zh_cn: 随着驱动系统的正常工作，我们可以开始连接辅助设备，例如电动机和电磁阀。对此，我们通常将使用操纵杆按钮来控制这些设备。首先，我们将介绍几种通过操纵杆按钮控制设备的方法。

source: Did you know that you can click and drag a VI Snippet from a document like this right into your LabVIEW code? Try it with the snippets in this document.
es_mx: ¿Sabía que puede hacer clic y arrastrar un fragmento de VI desde un documento como este directamente a su código de LabVIEW? Pruébelo con los fragmentos de este documento.
fr_ca: Saviez-vous que vous pouvez cliquer et faire glisser un extrait de code VI d’un document comme celui-ci directement dans votre code LabVIEW? Essayez-le avec les extraits de ce document.
tr_tr: Bunun gibi bir belgeden VI Snippet'i tıklayıp doğrudan LabVIEW kodunuza sürükleyebileceğinizi biliyor muydunuz? Bunu bu belgedeki parçacıklarla deneyin.
zh_cn: 您是否知道可以从这样的文档中单击VI片段并将其拖放到您的LabVIEW代码中？用这个文档的VI片段先试试看吧

source: Setup:
es_mx: Preparación:
fr_ca: Configuration:
tr_tr: Kurulum:
zh_cn: 初始设置:

source: No matter what the configuration, you'll need to add one, two, or more (if you're really excited) joysticks to the "Begin.vi". The first example uses 2 joysticks and the others only use one. Give each one a unique name so we can use it in other places, like the snippet below. I named them "LeftStick" and "RightStick" because they are on the left and right sides of my desk. If your joysticks are already configured, great! You can skip this step.
es_mx: Independientemente de la configuración, deberá agregar uno, dos o más (si está realmente emocionado) joysticks al "Begin.vi". El primer ejemplo usa 2 joysticks y los otros solo usan uno. Dé a cada uno un nombre único para que podamos usarlo en otros lugares, como el fragmento de abajo. Los llamé "LeftStick" y "RightStick" porque están en los lados izquierdo y derecho de mi escritorio. Si sus joysticks ya están configurados, ¡genial! Puede omitir este paso.
fr_ca: Quelle que soit la configuration, vous devrez ajouter un, deux ou plusieurs (si vous êtes vraiment motivé) joysticks à l'instrument virtuel "Begin.vi". Le premier exemple utilise 2 joysticks alors que les autres n’en utilisent qu’un. Donnez à chacun un nom unique afin que vous puissiez l’utiliser à d’autres endroits, comme l’extrait de code ci-dessous. Je les ai nommés "LeftStick" et "RightStick" parce qu’ils sont sur les côtés gauche et droit de mon bureau. Si vos joysticks sont déjà configurés, super! Vous pouvez sauter cette étape.
tr_tr: Yapılandırma ne olursa olsun, "Begin.vi" ye bir, iki veya daha fazla (gerçekten heyecanlıysanız) joystick eklemeniz gerekir. İlk örnek 2 oyun çubuğu kullanır ve diğerleri yalnızca birini kullanır. Aşağıdaki snippet gibi başka yerlerde de kullanabilmemiz için her birine benzersiz bir ad verin. Masamın sol ve sağ tarafında oldukları için onlara "LeftStick" ve "RightStick" adını verdim. Oyun çubuklarınız zaten yapılandırılmışsa, harika! Bu adımı atlayabilirsiniz.
zh_cn: 无论配置如何，您都需要在 “Begin.vi” 中添加一个，两个或更多（如果您真的很兴奋）手柄。第一个示例使2个手柄，而其他示例仅使用一个。给每个手柄起一个唯一的名称，这样我们就可以在其他地方使用它，例如下面的代码段。我将它们命名为 “LeftStick”和 “RightStick”，因为它们位于我桌子的左右两侧。如果你的手柄已经配置好了，那太好了，你可以跳过此步骤。

source: The rest of the code in this document will be placed in the "Teleop.VI" This is where we will be programming our joystick buttons to control different aspects of our motors or solenoids.
es_mx: El resto del código en este documento se colocará en el "Teleop.VI" Aquí es donde estaremos programando nuestros botones de joystick para controlar diferentes aspectos de nuestros motores o solenoides.
fr_ca: Le reste du code dans ce document sera placé dans le "Teleop.VI". C’est là que nous allons programmer nos boutons de joystick pour contrôler différents aspects de nos moteurs ou solénoïdes.
tr_tr: Bu belgedeki kodun geri kalanı "Teleop.VI" içine yerleştirilecektir. Burada, kumanda kolu düğmelerimizi motorlarımızın veya solenoidlerimizin farklı yönlerini kontrol etmek için programlayacağız.
zh_cn: 本文档中的其余代码将置于Teleop.VI中。在此处，我们将对操纵杆按钮进行编程，以控制电动机或电磁阀的不同功能。

source: Scenario 1
es_mx: escenario 1
fr_ca: Scénario 1
tr_tr: Senaryo 1
zh_cn: 场景1

source: **"I want a motor to move one way when I press one button and the other way when I press a different button."**
es_mx: **"Quiero que un motor se mueva en una dirección cuando presione un botón y en la otra cuando presione un botón diferente".**
fr_ca: **"Je veux qu’un moteur tourne dans un sens quand j’appuie sur un bouton et l’autre façon quand j’appuie sur un autre bouton."**
tr_tr: **"Bir düğmeye bastığımda motorun bir yöne, farklı bir düğmeye bastığımda diğer yöne hareket etmesini istiyorum."**
zh_cn: **“当我按下一个按钮时，我希望电机以一种方式移动，而当按下另一按钮时，我希望电机以另一种方式移动。”**

source: This code uses button 0 on two different joysticks to control the same motor. If button 0 on LeftStick is pressed, the motor moves backward, and if button 0 on RightStick is pressed, the motor moves forward. If both buttons are pressed or neither button is pressed, the motor doesn't move. Here I named my motor reference "Motor5", but you can name your motor whatever you want in the "Begin.vi"
es_mx: Este código usa el botón 0 en dos joysticks diferentes para controlar el mismo motor. Si se presiona el botón 0 en LeftStick, el motor se mueve hacia atrás, y si se presiona el botón 0 en RightStick, el motor avanza. Si se presionan ambos botones o no se presiona ninguno, el motor no se mueve. Aquí llamé a mi motor de referencia "Motor5", pero puedes nombrar tu motor como quieras en el "Begin.vi"
fr_ca: Ce code utilise le bouton 0 sur deux joysticks différents pour contrôler le même moteur. Si le bouton 0 sur LeftStick est appuyé, le moteur se déplace vers l’arrière, et si le bouton 0 sur RightStick est appuyé, le moteur se déplace vers l’avant. Si les deux boutons sont appuyés ou si aucun des deux boutons n’est appuyé, le moteur ne bouge pas. Ici, j’ai nommé ma référence moteur "Motor5", mais vous pouvez nommer votre moteur comme vous le voulez dans le "Begin.vi".
tr_tr: Bu kod, aynı motoru kontrol etmek için iki farklı kumanda kolundaki 0 düğmesini kullanır. LeftStick üzerindeki 0 butonuna basılırsa, motor geriye doğru hareket eder ve RightStick üzerindeki 0 butonuna basılırsa, motor ileri doğru hareket eder. Her iki düğmeye de basılırsa veya hiçbir düğmeye basılmazsa, motor hareket etmez. Burada motor referansıma "Motor5" adını verdim, ancak motorunuza "Begin.vi" de istediğiniz adı verebilirsiniz.
zh_cn: 该代码使用两个不同手柄上的按钮0来控制同一电机。如果按下 LeftStick 上的按钮0，则电机向后移动，如果按下 RightStick 上的按钮0，则电机向前移动。如果同时按下两个按钮或两个按钮均未按下，则电机不会移动。在这里，我将电机参考命名为 “ Motor5” ，但是您可以在 “Begin.vi” 中随意命名电机。

source: You may want to use multiple buttons from the same joystick for control. For an example of this, look at the following VI snippet or the VI snippet in Scenario 2.
es_mx: Es posible que desee utilizar varios botones del mismo joystick para su control. Para ver un ejemplo de esto, mire el siguiente fragmento de VI o el fragmento de VI en el Escenario 2.
fr_ca: Vous pouvez utiliser plusieurs boutons à partir du même joystick pour le contrôle. Pour en voir un exemple, regardez l’extrait de code VI suivant ou l’extrait de code VI dans le scénario 2.
tr_tr: Kontrol için aynı joystick'ten birden fazla düğme kullanmak isteyebilirsiniz. Bunun bir örneği için, Senaryo 2'deki VI snippetine veya aşağıdaki VI snippetine bakın.
zh_cn: 您可能需要使用同一手柄上的多个按钮进行控制。有关此示例，请查看以下VI片段或场景2中的VI片段。

source: Here I used joystick buttons 0 and 2, but feel free to use whatever buttons you need.
es_mx: Aquí usé los botones de joystick 0 y 2, pero siéntase libre de usar los botones que necesite.
fr_ca: Ici, j’ai utilisé les boutons 0 et 2 du joystick, mais sentez-vous à l'aise d'utiliser tous les boutons dont vous avez besoin.
tr_tr: Burada 0 ve 2 numaralı kumanda kolu düğmelerini kullandım, ancak ihtiyacınız olan düğmeleri kullanmaktan çekinmeyin.
zh_cn: 在这里，我使用了操纵杆按钮0和2，但您可以随意使用所需的任何按钮。

source: Scenario 2
es_mx: Escenario 2
fr_ca: Scénario 2
tr_tr: Senaryo 2
zh_cn: 场景2

source: **"I want different joystick buttons move at various speeds."**
es_mx: **"Quiero que los diferentes botones del joystick se muevan a distintas velocidades".**
fr_ca: **"Je veux des vitesses de déplacement variées pour différents boutons de joystick."**
tr_tr: ** Farklı kumanda kolu düğmelerinin çeşitli hızlarda hareket etmesini istiyorum."**
zh_cn: “我希望使用不同的手柄按钮令机器以不同的速度移动。”

source: This example could be helpful if you need to have one motor do different things based on the buttons you press. For instance, let's say my joystick has a trigger (button 0) and 4 buttons on top (buttons 1 through 4). In this case, the following buttons should have the following functions:
es_mx: Este ejemplo podría ser útil si necesita que un motor haga diferentes cosas según los botones que presione. Por ejemplo, digamos que mi joystick tiene un gatillo (botón 0) y 4 botones en la parte superior (botones 1 a 4). En este caso, los siguientes botones deben tener las siguientes funciones:
fr_ca: Cet exemple pourrait être utile si vous avez besoin d’avoir un même moteur faire différentes choses en fonction des boutons que vous appuyez. Par exemple, disons que mon joystick a un déclencheur (bouton 0) et 4 boutons par dessus (boutons 1 à 4). Dans ce cas, les boutons suivants peuvent avoir les fonctions suivantes :
tr_tr: Bu örnek, bastığınız düğmelere bağlı olarak bir motora farklı şeyler yaptırmanız gerektiğinde yardımcı olabilir. Örneğin, oyun çubuğumun bir tetikleyici (düğme 0) ve üstte 4 düğme (1-4 arası düğmeler) olduğunu varsayalım. Bu durumda, aşağıdaki düğmeler aşağıdaki işlevlere sahip olmalıdır:
zh_cn: 如果您需要让一个电机根据所按的按钮执行不同的操作，则此示例可能会有所帮助。例如，假设我的手柄有一个扳机（按钮0）和顶部的4个按钮（按钮1至4）。在这种情况下，以下按钮应具有以下功能：

source: button 1 - move backward at half speed
es_mx: botón 1 - retroceder a la mitad de la velocidad
fr_ca: bouton 1 - recule à mi-vitesse
tr_tr: button 1 - yarım hızda geri git
zh_cn: 按钮1-以一半速度向后移动

source: button 2 - move forward at half speed
es_mx: botón 2 - avanzar a la mitad de la velocidad
fr_ca: bouton 2 - avance à mi-vitesse
tr_tr: button 2 - yarım hızda ileri git
zh_cn: 按钮2-以半速前进

source: button 3 - move backward at 1/4 speed
es_mx: botón 3 - retroceder a 1/4 de velocidad
fr_ca: bouton 3 - recule à 1/4 de vitesse
tr_tr: button 3 - 1/4 hızda geri git
zh_cn: 按钮3-以1/4速度向后移动

source: button 4 - move forward at 1/4 speed
es_mx: botón 4 - avanzar a 1/4 de velocidad
fr_ca: bouton 4 - avance à 1/4 de vitesse
tr_tr: button 4 - 1/4 hızda ileri git
zh_cn: 按钮4-以1/4速度向前移动

source: trigger - full speed ahead! (forward at full speed)
es_mx: gatillo - ¡adelante a toda velocidad! (avanzar a toda velocidad)
fr_ca: déclencheur - pleine vitesse en avant! (en avant à pleine vitesse)
tr_tr: trigger- tam hız ileri! (tam hızda ileri)
zh_cn: 扳机-全速前进！（以满速向前移动）

source: We would then take the boolean array from the "JoystickGetValues.vi" and wire it to a "Boolean Array to Number" node (Numeric Palette-Conversion Palette). This converts the boolean array to a number that we can use. Wire this numeric to a case structure.
es_mx: Luego tomaríamos la matriz booleana de "JoystickGetValues.vi" y la conectaríamos a un nodo "Boolean Array to Number" (Paleta numérica de conversión de paleta). Esto convierte la matriz booleana en un número que podemos usar. Conecte este número a una estructura case.
fr_ca: Nous prenons ensuite le tableau booléen à partir de "JoystickGetValues.vi" et on le relie à un nœud "Boolean Array to Number" (Numeric Palette-Conversion Palette). Ce qui convertit le tableau booléen en un nombre que nous pouvons alors utiliser. Relier ce nombre à une structure case.
tr_tr: Daha sonra boolen dizisini "JoystickGetValues.vi" den alır ve onu bir "Boolean Array to Number" düğümüne (Numeric Palette-Conversion Palette) bağlarız. Bu, boolen dizisini kullanabileceğimiz bir sayıya dönüştürür. Bu rakamı bir case structure'a bağlayın.
zh_cn: 然后，我们将从 JoystickGetValues.vi 中获取布尔数组，并将其连接到“布尔数组到数字”节点（数值选板转换选板）。这会将布尔数组转换为我们可以使用的数字。将此数字连接到条件结构。

source: Each case corresponds to a binary representation of the values in the array. In this example, each case corresponds to a one-button combination. We added six cases: 0 (all buttons off), 1 (button 0 on), 2 (button 1 on), 4 (button 2 on), 8 (button 3 on), and 16 (button 4 on). Notice we skipped value 3. 3 would correspond to buttons 0 and 1 pressed at the same time. We did not define this in our requirements so we'll let the default case handle it.
es_mx: Cada caso corresponde a una representación binaria de los valores de la matriz. En este ejemplo, cada caso corresponde a una combinación de un botón. Agregamos seis casos: 0 (todos los botones apagados), 1 (botón 0 encendido), 2 (botón 1 encendido), 4 (botón 2 encendido), 8 (botón 3 encendido) y 16 (botón 4 encendido). Observe que omitimos el valor 3. 3 correspondería a los botones 0 y 1 presionados al mismo tiempo. No definimos esto en nuestros requisitos, por lo que dejaremos que el caso predeterminado lo maneje.
fr_ca: Chaque cas correspond à une représentation binaire des valeurs du tableau. Dans cet exemple, chaque cas correspond à une combinaison d'un seul bouton. Nous avons ajouté six cas : 0 (tous les boutons sont à OFF), 1 (bouton 0 sur ON), 2 (bouton 1 sur ON), 4 (bouton 2 sur ON), 8 (bouton 3 sur ON), et 16 (bouton 4 sur ON). Notez que nous avons sauté la valeur 3. 3 correspondrait aux boutons 0 et 1 appuyés en même temps. Nous ne l'avons pas défini dans nos requis, donc nous allons laisser le cas par défaut le gérer.
tr_tr: Her durum, dizideki değerlerin ikili gösterimine karşılık gelir. Bu örnekte, her durum tek düğmeli bir kombinasyona karşılık gelir. Altı durum ekledik: 0 (tüm düğmeler kapalı), 1 (düğme 0 açık), 2 (düğme 1 açık), 4 (düğme 2 açık), 8 (düğme 3 açık) ve 16 (düğme 4 açık). 3 değerini atladığımıza dikkat edin. 3 aynı anda basılan 0 ve 1 düğmelerine karşılık gelir. Bunu gereksinimlerimizde tanımlamadık, bu yüzden varsayılan durumun ele almasına izin vereceğiz.
zh_cn: 每种情况都对应于数组中值的二进制表示形式。在此示例中，每种情况都对应一个按钮组合。我们添加了六种情况：0（关闭所有按钮），1（打开按钮0），2（打开按钮1），4（打开按钮2），8（打开按钮3）和16（打开按钮4）。请注意，我们跳过了值3。3将对应于同时按下的按钮0和1。我们没有在需求中定义它，所以我们以默认情况处理。

source: It might be helpful to review the LabVIEW 2014 Case Structure Help document here:
es_mx: Puede ser útil revisar el documento de ayuda de estructura Case de LabVIEW 2014 aquí:
fr_ca: Il pourrait être utile d’examiner le document d’aide sur la structure case LabVIEW 2014 ici :
tr_tr: LabVIEW 2014 Case Structure Yardım belgesini buradan incelemek faydalı olabilir:
zh_cn: 在以下位置查看 LabVIEW 2014 条件结构帮助文档可能会有所帮助：

source: There are also 3 Community Tutorials on case structures here:
es_mx: También hay 3 tutoriales comunitarias sobre estructuras de casos aquí:
fr_ca: Il ya aussi 3 tutoriels communautaires sur les structures case ici:
tr_tr: Ayrıca, burada case yapılarıyla ilgili 3 Topluluk rehberi vardır:
zh_cn: 这里还有关于条件结构的3个社区教程：

source: Since our requirements were simple, we only need a single constant in each case. For case 1 (full ahead) we use a 1, for case 2 (half back) we use a -0.5, etc. We can use any constant value between 1 and -1. I left case 0 as the default so if multiple buttons are pressed (any undefined state was reached) the motor will stop. You of course are free to customize these states however you want.
es_mx: Dado que nuestros requisitos eran simples, solo necesitamos una única constante en cada caso. Para el caso 1 (completo adelante) usamos un 1, para el caso 2 (medio reverso) usamos -0.5, etc. Podemos usar cualquier valor constante entre 1 y -1. Dejé el caso 0 como predeterminado, por lo que si se presionan varios botones (se alcanzó cualquier estado indefinido) el motor se detendrá. Por supuesto, usted puede personalizar estos estados como quiera.
fr_ca: Comme nos requis étaient simples, nous n’avons besoin que d’une seule constante dans chaque cas. Pour le cas 1 (en avant toutes) nous utilisons un 1, pour le cas 2 (en arrière à moitié) nous utilisons un -0,5, etc. Nous pouvons utiliser n’importe quelle valeur constante entre 1 et -1. J’ai laissé le cas 0 comme cas par défaut, donc si plusieurs boutons sont appuyés (n’importe quel état indéfini a été atteint) le moteur s’arrêtera. Vous êtes bien sûr libre de personnaliser ces états comme vous le souhaitez.
tr_tr: Gereksinimlerimiz basit olduğundan, her durumda sadece tek bir sabite ihtiyacımız var. Durum 1 için (tam ileri) 1, 2. durum için (yarım geri) a -0.5 kullanıyoruz, vb. 1 ile -1 arasındaki herhangi bir sabit değeri kullanabiliriz. 0 durumunu varsayılan olarak bıraktım, bu nedenle birden fazla düğmeye basıldığında (tanımlanmamış herhangi bir duruma ulaşıldığında) motor duracaktır. Elbette bu durumları istediğiniz gibi özelleştirmekte özgürsünüz.
zh_cn: 由于我们的要求很简单，因此在每种情况下我们只需要一个常数。我们可以使用1到-1之间的任何常量值。对于情况1（全力向前），我们使用1，对于情况2（半速向后），我们使用-0.5，依此类推。我将情况0保留为默认值，因此如果按下多个按钮（达到任何未定义状态），电动机将停止。当然，您可以随意自定义这些状态。

source: Scenario 3
es_mx: Escenario 3
fr_ca: Scénario 3
tr_tr: Senaryo 3
zh_cn: 场景3

source: **"I want to control a solenoid with my joystick buttons."**
es_mx: **"Quiero controlar un solenoide con los botones de mi joystick".**
fr_ca: **"Je veux contrôler un solénoïde à l'aide des boutons de mon joystick."**
tr_tr: **"Joystick düğmelerimle bir solenoidi kontrol etmek istiyorum."**
zh_cn: “我想用手柄按钮控制电磁阀。”

source: By now, we are familiar with how the joystick outputs the buttons in an array of booleans. We need to index this array to get the button we are interested in, and wire this boolean to a select node. Since the "Solenoid Set.vi" requires a Enum as an input, the easiest way to get the enum is to right click the "Value" input of the "Solenoid Set.vi" and select "Create Constant". Duplicate this constant and wire one copy to the True terminal and one to the False terminal of the select node. Then wire the output of the select node to the "Value" input of the solenoid VI.
es_mx: A estas alturas, estamos familiarizados con cómo el joystick genera los botones en una matriz de valores booleanos. Necesitamos indexar esta matriz para obtener el botón que nos interesa y conectar este booleano a un nodo seleccionado. Dado que el "Solenoide Set.vi" requiere un Enum como entrada, la forma más fácil de obtener el enum es hacer clic con el botón derecho en la entrada "Valor" del "Solenoide Set.vi" y seleccionar "Crear constante". Duplique esta constante y conecte una copia al terminal Verdadero y otra al terminal Falso del nodo seleccionado. Luego conecte la salida del nodo de selección a la entrada "Valor" del solenoide VI.
fr_ca: Maintenant, nous sommes familiers avec la façon dont on peut regrouper les boutons d'un joystick dans un tableau de booleans. Nous devons indexer ce tableau pour obtenir le bouton qui nous intéresse, et relier ce boolean à un nœud sélectionné. Étant donné que le "Solenoid Set.vi" nécessite un Enum comme entrée, la façon la plus simple d’obtenir l’enum est de cliquer avec le bouton droit sur l’entrée "Value" de "Solenoid Set.vi" et sélectionnez "Create Constant". Dupliquez cette constante et relier une copie avec le terminal True et une autre avec le terminal False du nœud sélectionné. Ensuite, relier la sortie du nœud sélectionné avec l’entrée "Value" du solenoid VI.
tr_tr: Şimdiye kadar, joystick'in düğmeleri bir dizi boolen'den nasıl çıkarıldığını biliyoruz. İlgilendiğimiz düğmeyi elde etmek için bu diziyi indekslememiz ve bu booleanı bir seçili düğüme bağlamamız gerekir. "Solenoid Set.vi" giriş olarak bir Enum gerektirdiğinden, numaralandırmanın en kolay yolu "Solenoid Set.vi" nin "Value" girişine sağ tıklamak ve "Create Constant" u seçmektir. Bu sabiti çoğaltın ve bir kopyasını True terminale ve birini de seçilen düğümün False terminaline bağlayın. Ardından, seçme düğümünün çıkışını solenoid VI'nın "Value" girişine bağlayın.
zh_cn: 到目前为止，我们已经熟悉手柄如何以布尔数组的形式输出按钮。我们需要索引该数组以获得我们感兴趣的按钮数值，并将此布尔值连接到一个选择节点。由于 Solenoid Set.vi 需要一个枚举类作为输入，因此获取枚举的最简单方法是右键单击 Solenoid Set.vi 的 “ Value” 输入，然后选择“创建常量”。复制此常量，然后将一个副本连接到这个选择节点的 True 端口，将一个副本连接到选择节点的False 端口。然后将该选择节点的输出连接到电磁阀VI的 “Value” 输入。

source: Happy Roboting!
es_mx: ¡Feliz Roboteo!
fr_ca: Ayez du plaisir en robotique!
tr_tr: Mutlu Robot Çalışmaları!
zh_cn: 祝您编程愉快！
