Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/resources/labview-resources.po
Languages: es_mx, fr_ca, zh_cn

source: LabVIEW Resources
es_mx: Recursos LabVIEW
fr_ca: Ressources pour LabVIEW
zh_cn: LabVIEW资源

source: To learn more about programming in LabVIEW and specifically programming FRC\ |reg| robots in LabVIEW, check out the following resources.
es_mx: Para aprender más sobre la programación en LabVIEW y específicamente la programación de robots FRC\ |reg| en LabVIEW, revise los siguientes recursos.
fr_ca: Pour en savoir plus sur la programmation en LabVIEW et plus particulièrement sur la programmation des robots FRC\ |reg| en LabVIEW, consultez les ressources suivantes.
zh_cn: 要了解有关在LabVIEW中进行编程的更多信息，以及在LabVIEW中对FRC®机器进行特定编程的更多信息，请查看以下资源。

source: LabVIEW Basics
es_mx: Fundamentos de LabVIEW
fr_ca: Les bases de LabVIEW
zh_cn: LabVIEW基础

source: NI provides `tutorials on the basics of LabVIEW <https://www.ni.com/getting-started/labview-basics/>`_. These tutorials can help you get acquainted with the LabVIEW environment and the basics of the graphical, dataflow programing model used in LabVIEW.
es_mx: NI proporciona `tutoriales sobre los básicos de LabVIEW <https://www.ni.com/getting-started/labview-basics/>`_. Estos tutoriales pueden ayudarlo a familiarizarse con el entorno de LabVIEW y los conceptos básicos del modelo gráfico de programación de flujo de datos utilizado en LabVIEW.
fr_ca: NI fournit des `tutoriels sur les bases de LabVIEW <https://www.ni.com/getting-started/labview-basics/>`_. Ces tutoriels peuvent vous aider à vous familiariser avec l’environnement LabVIEW et les bases du modèle de programmation graphique et de flux de données utilisés dans LabVIEW.
zh_cn: NI提供了有关LabVIEW <https://www.ni.com/getting-started/labview-basics/> _基础知识的教程。这些教程可以帮助您熟悉LabVIEW环境以及LabVIEW中使用的图形化数据流编程模型的基础。

source: Todo
es_mx: Qué hacer
fr_ca: À faire
zh_cn: 待办事项

source: Add academic videos when link fixed www.ni.com/academic/students/learn-labview/
es_mx: Agregue videos académicos en el enlace fijo www.ni.com/academic/students/learn-labview/
fr_ca: Ajouter des vidéos académiques lorsque le lien fixe www.ni.com/academic/students/learn-labview/
zh_cn: 链接后添加教学视频www.ni.com/academic/students/learn-labview/

source: NI FRC Tutorials
es_mx: Tutoriales de NI FRC
fr_ca: Tutoriels NI FRC
zh_cn: NI FRC教程

source: NI also hosts many `FRC specific tutorials and presentations ranging from basic to advanced <https://forums.ni.com/t5/FIRST-Robotics-Competition/Archived-2015-FRC-LabVIEW-Additional-Resources/ta-p/3528790?profile.language=en>`_. For an in-depth single resource check out the FRC Basic and Advanced Training Classes linked near the bottom of the page.
es_mx: NI también hospeda algunos `Tutoriales y presentaciones específicos de FRC de básico a avanzado <https://forums.ni.com/t5/FIRST-Robotics-Competition/Archived-2015-FRC-LabVIEW-Additional-Resources/ta-p/3528790?profile.language=en>`_. Para un recurso único y profundo, revisa las Clases de Entrenamiento Básico y Avanzado del FRC enlazadas cerca de la parte inferior de la página.
fr_ca: NI héberge également de `nombreux tutoriels et présentations spécifiques à la FRC allant du niveau de base au niveau avancé <https://forums.ni.com/t5/FIRST-Robotics-Competition/Archived-2015-FRC-LabVIEW-Additional-Resources/ta-p/3528790?profile.language=en>`_. Pour une ressource unique en profondeur, consultez des ateliers de formation FRC des niveaux de base et avancé dont le lien est situé près du bas de la page.
zh_cn: NI还提供了许多`FRC特有的教程和演示，从基础到高级。要获得深入的某一方面的资源，请查看页面底部附近的FRC基础和高级培训课程。

source: Installed Tutorials and Examples
es_mx: Tutoriales Instalados y Ejemplos
fr_ca: Didacticiels et exemples installés
zh_cn: 已安装的教程和示例

source: There are also tutorials and examples for all sorts of tasks and components provided as part of your LabVIEW installation. To access the tutorials, from the LabVIEW Splash screen (the screen that appears when the program is first launched) click on the ``Tutorials`` tab on the left side. Note that the tutorials are all in one document, so once it is open you are free to browse to other tutorials without returning to the splash screen.
es_mx: También hay tutoriales y ejemplos para todo tipo de tareas y componentes proporcionados como parte de su instalación de LabVIEW. Para acceder a los tutoriales, desde la pantalla de LabVIEW Splash (la pantalla que aparece cuando se lanza el programa por primera vez) haga clic en la pestaña ``Tutoriales`` en el lado izquierdo. Tenga en cuenta que los tutoriales están todos en un solo documento, así que una vez que esté abierto podrá navegar a otros tutoriales sin volver a la pantalla de inicio.
fr_ca: Il existe également des tutoriels et des exemples pour toutes sortes de tâches et de composants fournis avec votre installation LabVIEW. Pour accéder aux didacticiels, à partir de l’écran LabVIEW Splash (l’écran qui apparaît lors du premier démarrage du programme), cliquez sur l’onglet ``Tutorials`` sur le côté gauche. Notez que les tutoriels sont tous dans un seul document, donc une fois qu’il est ouvert, vous pouvez naviguer vers d’autres tutoriels sans avoir à revenir à l’écran de démarrage.
zh_cn: LabVIEW安装包还提供了有关各种任务和组件的教程和示例。要访问教程，请在LabVIEW Splash屏幕（程序首次启动时出现的屏幕）上，单击“Tutorials”左侧的选项。请注意，这些教程全都在一个文档中，因此一旦打开一个，您就可以自由浏览其他教程，无需返回初始屏幕。

source: To access the examples either click the ``Support`` tab, then ``Find FRC Examples`` or anytime you're working on a program open the ``Help`` menu, select ``Find Examples`` and open the ``FRC Robotics`` folder.
es_mx: Para acceder a los ejemplos, haga clic en la pestaña ``Support``, luego en ``Find FRC Examples`` o cada vez que trabajes en un programa abre el menú ``Help``, seleccione ``Find Examples`` y abra la carpeta ``FRC Robotics``.
fr_ca: Pour accéder aux exemples, cliquez sur l’onglet ``Support``, puis ``Find FRC Examples`` ou chaque fois que vous travaillez sur un programme ouvrez le menu ``Help``, sélectionnez ``Find Examples`` et ouvrez le dossier ``FRC Robotics``.
zh_cn: 要访问示例，请单击“Support”选项，然后在使用程序或进行操作时打开菜单，选择并打开文件夹“Find FRC ExamplesHelpFind ExamplesFRC Robotics”
