Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/resources/labview-examples-and-tutorials.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: LabVIEW Examples and Tutorials
es_mx: Ejemplos y Tutoriales de WPILib
fr_ca: Exemples et didacticiels LabVIEW
tr_tr: LabVIEW Örnekleri ve Rehberleri
zh_cn: LabVIEW实例和教程

source: Popular Tutorials
es_mx: Tutoriales Populares
fr_ca: Didacticiels populaires
tr_tr: Popüler Öğreticiler
zh_cn: 热门教程

source: `Autonomous Timed Movement Tutorial <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2016-Autonomous-Timed-Movement-Tutorial/ta-p/3535608?profile.language=en>`__
es_mx: `Tutorial de Movimiento Autónomo Temporal <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2016-Autonomous-Timed-Movement-Tutorial/ta-p/3535608?profile.language=en>`__
fr_ca: `Didacticiel sur un déplacement chronométré en mode autonome <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2016-Autonomous-Timed-Movement-Tutorial/ta-p/3535608?profile.language=en>`__
tr_tr: `Otonom Zamanlı Hareket Eğitimi <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2016-Autonomous-Timed-Movement-Tutorial/ta-p/3535608?profile.language=en>`__
zh_cn: `自动阶段定时运动教程 <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2016-Autonomous-Timed-Movement-Tutorial/ta-p/3535608?profile.language=en>`__

source: Move your robot autonomously based on different time intervals
es_mx: Mueva su robot autónomamente en base a diferentes intervalos de tiempo
fr_ca: Déplace votre robot de façon autonome selon différents intervalles de temps
tr_tr: Robotunuzu farklı zaman aralıkların da otonom olarak hareket ettirin
zh_cn: 根据不同的时间间隔自动移动机器人

source: `See more on Autonomous Movement <https://forums.ni.com/t5/FIRST-Robotics-Competition/Autonomous-Timed-Movement-Tutorial/ta-p/3732667?profile.language=en>`__
es_mx: `Vea más en Movimiento Autónomo <https://forums.ni.com/t5/FIRST-Robotics-Competition/Autonomous-Timed-Movement-Tutorial/ta-p/3732667?profile.language=en>`__
fr_ca: `Pour en en savoir plus sur le déplacement en mode autonome <https://forums.ni.com/t5/FIRST-Robotics-Competition/Autonomous-Timed-Movement-Tutorial/ta-p/3732667?profile.language=en>`__
tr_tr: `Otonom Hareket <https://forums.ni.com/t5/FIRST-Robotics-Competition/Autonomous-Timed-Movement-Tutorial/ta-p/3732667?profile.language=en>`__ hakkında daha fazla bilgi edinin
zh_cn: `查看有关自动阶段运动的更多信息<https://forums.ni.com/t5/FIRST-Robotics-Competition/Autonomous-Timed-Movement-Tutorial/ta-p/3732667?profile.language=en>`__

source: `Basic Motor Control Tutorial <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2014-Basic-Motor-Control-Tutorial/ta-p/3504064?profile.language=en>`__
es_mx: `Tutorial de Control de Motor Básico <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2014-Basic-Motor-Control-Tutorial/ta-p/3504064?profile.language=en>`__
fr_ca: `Didacticiel sur un contrôle de moteur simple <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2014-Basic-Motor-Control-Tutorial/ta-p/3504064?profile.language=en>`__
tr_tr: `Temel Motor Kontrol Eğitimi <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2014-Basic-Motor-Control-Tutorial/ta-p/3504064?profile.language=en>`__
zh_cn: `基本电动机控制教程<https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2014-Basic-Motor-Control-Tutorial/ta-p/3504064?profile.language=en>`__

source: Setup your roboRIO motor hardware and software
es_mx: Configure el hardware y software del motor roboRIO
fr_ca: Configuration matérielle et logicielle d'un moteur pour votre roboRIO
tr_tr: RoboRIO motor donanımınızı ve yazılımınızı kurun
zh_cn: 设置您的roboRIO电机硬件和软件

source: Learn to setup the FRC\ |reg| Control System and FRC Robot Project
es_mx: Aprenda a configurar el Sistema de Control de FRC\ |reg| y el Proyecto de Robot de FRC
fr_ca: Apprenez à configurer le système de contrôle FRC\ |reg| ainsi qu'un projet de robot FRC
tr_tr: FRC \ |reg| 'i kurmayı öğrenin Kontrol Sistemi ve FRC Robot Projesi
zh_cn: 了解如何设置FRC \ | reg |控制系统和FRC机器人项目

source: `See more on Motor Control <https://forums.ni.com/t5/FIRST-Robotics-Competition/Basic-Motor-Control-Tutorial/ta-p/3733426?profile.language=en>`__
es_mx: `Vea más en Control del Motor <https://forums.ni.com/t5/FIRST-Robotics-Competition/Basic-Motor-Control-Tutorial/ta-p/3733426?profile.language=en>`__
fr_ca: `Pour en savoir plus sur le contrôle du moteur <https://forums.ni.com/t5/FIRST-Robotics-Competition/Basic-Motor-Control-Tutorial/ta-p/3733426?profile.language=en>`__
tr_tr: `Motor Kontrolü <https://forums.ni.com/t5/FIRST-Robotics-Competition/Basic-Motor-Control-Tutorial/ta-p/3733426?profile.language=en>`__ hakkında daha fazlasını görün
zh_cn: `查看有关电动机控制的更多信息<https://forums.ni.com/t5/FIRST-Robotics-Competition/Basic-Motor-Control-Tutorial/ta-p/3733426?profile.language=en>`__

source: `Image Processing Tutorial <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-Image-Processing-Tutorial/ta-p/3490518?profile.language=en>`__
es_mx: `Tutorial de Procesamiento de Imagen <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-Image-Processing-Tutorial/ta-p/3490518?profile.language=en>`__
fr_ca: `Didacticiel sur le traitement d’images <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-Image-Processing-Tutorial/ta-p/3490518?profile.language=en>`__
tr_tr: `Görüntü İşleme Eğitimi <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-Image-Processing-Tutorial/ta-p/3490518?profile.language=en>`__
zh_cn: `图像处理教程<https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-Image-Processing-Tutorial/ta-p/3490518?profile.language=en>`__

source: Learn basic Image Processing techniques and how to use NI Vision Assistant
es_mx: Aprenda técnicas básicas de Procesamiento de Imagen y cómo usar la Asistencia de Visión NI
fr_ca: Apprendre les techniques de base de traitement d’images et comment utiliser NI Vision Assistant
tr_tr: Temel Görüntü İşleme tekniklerini ve NI Vision Assistant'ı nasıl kullanacağınızı öğrenin
zh_cn: 了解基本的图像处理技术以及如何使用NI Vision Assistant

source: `See more on Cameras and Image Processing <https://forums.ni.com/t5/FIRST-Robotics-Competition/Image-Processing-in-LabVIEW-for-FRC/ta-p/3732677?profile.language=en>`__
es_mx: `Vea más en Procesamiento de Cámaras e Imagen <https://forums.ni.com/t5/FIRST-Robotics-Competition/Image-Processing-in-LabVIEW-for-FRC/ta-p/3732677?profile.language=en>`__
fr_ca: `En savoir plus sur les caméras et le traitement d’images <https://forums.ni.com/t5/FIRST-Robotics-Competition/Image-Processing-in-LabVIEW-for-FRC/ta-p/3732677?profile.language=en>`__
tr_tr: `Kameralar ve Görüntü İşleme hakkında daha fazla bilgi edinin <https://forums.ni.com/t5/FIRST-Robotics-Competition/Image-Processing-in-LabVIEW-for-FRC/ta-p/3732677?profile.language=en>`__
zh_cn: `查看有关相机和图像处理的更多信息<https://forums.ni.com/t5/FIRST-Robotics-Competition/Image-Processing-in-LabVIEW-for-FRC/ta-p/3732677?profile.language=en>`__

source: `PID Control Tutorial <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-PID-Tutorial/ta-p/3535805?profile.language=en>`__
es_mx: `Tutorial de Control PID <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-PID-Tutorial/ta-p/3535805?profile.language=en>`__
fr_ca: `Didacticiel sur la commande PID <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-PID-Tutorial/ta-p/3535805?profile.language=en>`__
tr_tr: `PID Kontrol Eğitimi <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-PID-Tutorial/ta-p/3535805?profile.language=en>`__
zh_cn: `PID控制指南<https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-PID-Tutorial/ta-p/3535805?profile.language=en>`__

source: What is PID Control and how can I implement it?
es_mx: ¿Qué es el Control PID y cómo se puede implementar?
fr_ca: Qu’est-ce que c'est une commande PID et comment puis-je l’implémenter?
tr_tr: PID Kontrolü nedir ve bunu nasıl uygulayabilirim?
zh_cn: 什么是PID控制，我该如何实施？

source: `Command and Control Tutorial <https://forums.ni.com/t5/FIRST-Robotics-Competition/Command-and-Control-Tutorial/ta-p/3534946?profile.language=en>`__
es_mx: `Tutorial de Comandos y Control <https://forums.ni.com/t5/FIRST-Robotics-Competition/Command-and-Control-Tutorial/ta-p/3534946?profile.language=en>`__
fr_ca: `Didacticiel de commande et de contrôle <https://forums.ni.com/t5/FIRST-Robotics-Competition/Command-and-Control-Tutorial/ta-p/3534946?profile.language=en>`__
tr_tr: `Command and Control<https://forums.ni.com/t5/FIRST-Robotics-Competition/Command-and-Control-Tutorial/ta-p/3534946?profile.language=en>`__
zh_cn: `指令和控制指南<https://forums.ni.com/t5/FIRST-Robotics-Competition/Command-and-Control-Tutorial/ta-p/3534946?profile.language=en>`__

source: What is Command and Control?
es_mx: ¿Qué es un Comando y Control?
fr_ca: Qu’est-ce que sont la commande et le contrôle?
tr_tr: Command ve Control nedir ?
zh_cn: 什么是指令与控制？

source: How do I implement it?
es_mx: ¿Cómo lo puedo implementar?
fr_ca: Comment puis-je l'implémenter?
tr_tr: Nasıl uygularım?
zh_cn: 我该如何实施？

source: `Driver Station Tutorial <https://forums.ni.com/t5/FIRST-Robotics-Competition/Archived-FRC-2015-Driver-Station-Tutorial/ta-p/3535650?profile.language=en>`__
es_mx: `Tutorial de la Driver Station <https://forums.ni.com/t5/FIRST-Robotics-Competition/Archived-FRC-2015-Driver-Station-Tutorial/ta-p/3535650?profile.language=en>`__
fr_ca: `Didacticiel sur la Driver Station <https://forums.ni.com/t5/FIRST-Robotics-Competition/Archived-FRC-2015-Driver-Station-Tutorial/ta-p/3535650?profile.language=en>`__
tr_tr: `Sürücü İstasyonu Eğitimi <https://forums.ni.com/t5/FIRST-Robotics-Competition/Archived-FRC-2015-Driver-Station-Tutorial/ta-p/3535650?profile.language=en>`__
zh_cn: `Driver Station教程<https://forums.ni.com/t5/FIRST-Robotics-Competition/Archived-FRC-2015-Driver-Station-Tutorial/ta-p/3535650?profile.language=en>`__

source: Get to know the FRC Driver Station
es_mx: Conozca la Driver Station de FRC
fr_ca: Découvrez la Driver Station FRC
tr_tr: FRC Driver Station'ı tanıyın
zh_cn: 了解FRC Driver Station

source: `Test Mode Tutorial <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-Test-Mode-Tutorial/ta-p/3535797?profile.language=en>`__
es_mx: `Tutorial del Modo Prueba <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-Test-Mode-Tutorial/ta-p/3535797?profile.language=en>`__
fr_ca: `Didacticiel sur le mode Test <https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-Test-Mode-Tutorial/ta-p/3535797?profile.language=en>`__
tr_tr: `Test Modu Rehberi<https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-Test-Mode-Tutorial/ta-p/3535797?profile.language=en>`__
zh_cn: `测试模式教程<https://forums.ni.com/t5/FIRST-Robotics-Competition/FRC-2015-Test-Mode-Tutorial/ta-p/3535797?profile.language=en>`__

source: Learn to setup and use Test Mode
es_mx: Aprenda a configurar el Modo Prueba
fr_ca: Apprendre à configurer et à utiliser le mode Test
tr_tr: Test Modunu kurmayı ve kullanmayı öğrenin
zh_cn: 学习设置和使用测试模式

source: Looking for more examples and discussions? Search through more documents or post your own discussion, example code, or tutorial by \ `clicking here! <https://forums.ni.com/t5/FIRST-Robotics-Competition/tkb-p/3019?profile.language=en>`__\ Don’t forget to mark your posts with a tag!
es_mx: ¿Está buscando más ejemplos y discusiones? Busque en más documentos o publique su propia duda, ejemplo de código, o tutorial al \ `hacer clic aquí! <https://forums.ni.com/t5/FIRST-Robotics-Competition/tkb-p/3019?profile.language=en>`__\ ¡No olvide marcar sus mensajes con una etiqueta!
fr_ca: Vous cherchez d’autres exemples et discussions? Recherchez dans d’autres documents ou publiez votre propre discussion, exemple de code ou tutoriel en \ `cliquant ici! <https://forums.ni.com/t5/FIRST-Robotics-Competition/tkb-p/3019?profile.language=en>`__\ N’oubliez pas de marquer vos publications avec une balise!
tr_tr: Daha fazla örnek ve bilgi mi arıyorsunuz? Daha fazla belgede arama yapın veya kendi sorunuzu, örnek kodunuzu veya rehberinizi \ `buraya tıklayarak gönderin! <https://forums.ni.com/t5/FIRST-Robotics-Competition/tkb-p/3019?profile.language=en> `__\ Yayınlarınızı bir etiketle işaretlemeyi unutmayın!
zh_cn: 寻找更多示例和讨论？单击此处搜索更多文档或发布您自己的讨论，示例代码或教程！ <https://forums.ni.com/t5/FIRST-Robotics-Competition/tkb-p/3019?profile.language=en>`__ \’别忘了用标签标记您的帖子！
