Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/resources/local-and-global-variables-*-labview-for-frc.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Local and Global Variables in LabVIEW for FRC
es_mx: Variables locales y globales en LabVIEW para FRC
fr_ca: Variables locales et globales en LabVIEW pour FRC
tr_tr: FRC için LabVIEW'de Local ve Global Değişkenler
zh_cn: LabVIEW中用于FRC的局部变量和全局变量

source: This example serves as an introduction to local and global variables, how they are used in the default LabVIEW for FRC\ |reg| Robot Project, and how you might want to use them in your project.
es_mx: Este ejemplo sirve como una introducción a las variables locales y globales, cómo se utilizan en el proyecto de robot por defecto de LabVIEW para FRC\ |reg| y cómo podría querer utilizarlas en su proyecto.
fr_ca: Cet exemple sert d’introduction aux variables locales et globales, comment elles sont utilisées dans un projet LabVIEW FRC\ |reg| par défaut, et comment vous pouvez les utiliser dans votre projet.
tr_tr: Bu örnek, yerel ve genel değişkenlere, FRC için varsayılan LabVIEW'de nasıl kullanıldıklarına bir giriş olarak hizmet eder \ |reg| Robot Projesi ve bunları projenizde nasıl kullanmak isteyebileceğiniz.
zh_cn: 本示例介绍了局部变量和全局变量、如何在默认LabVIEW for FRC® Robot Project中使用它们以及如何在您的项目中使用它们。

source: Local variables and global variables may be used to transfer data between locations within the same VI (local variables) or within different VI’s (global variables), breaking the conventional `Data Flow Paradigm <https://www.ni.com/getting-started/labview-basics/dataflow>`__ for which LabVIEW is famous. Thus, they may be useful when, for whatever reason, you cannot wire the value directly to the node to another.
es_mx: Las variables locales y las variables globales se pueden usar para transferir datos entre ubicaciones dentro del mismo VI (variables locales) o dentro de diferentes VI (variables globales), rompiendo el convencional ` Paradigma de Data Flow <https://www.ni.com/getting-started/labview-basics/dataflow>`__ por el cual LabVIEW es famoso. Por lo tanto, pueden ser útiles cuando, por cualquier motivo, no puede conectar el valor directamente el nodo a otro.
fr_ca: Les variables locales et les variables globales peuvent être utilisées pour transférer des données entre les emplacements à l'intérieur du même VI (variables locales) ou dans différents VI’s (variables globales), brisant le conventionnel `Paradigme de flux de données <https://www.ni.com/getting-started/labview-basics/dataflow>`__ pour lequel LabVIEW est reconnu. Ainsi, ils peuvent être utiles lorsque, pour une raison quelconque, vous ne pouvez pas transférer la valeur directement sur le nœud à un autre nœud.
tr_tr: Localk ve global değişkenler, aynı VI (yerel değişkenler) veya farklı VI'lar (global değişkenler) içindeki konumlar arasında veri aktarmak için kullanılabilir ve LabVIEW'in meşhur olduğu geleneksel `Veri Akışı Paradigması <https://www.ni.com/getting-started/labview-basics/dataflow>`__ 'i bozar. Bu nedenle, herhangi bir nedenle değeri doğrudan bir node dan başka bir node a bağlayamadığınızda yararlı olabilirler.
zh_cn: 局部变量和全局变量可用于在同一VI（局部变量）或不同VI（全局变量）内的位置之间传输数据，这打破了LabVIEW众所周知的传统的“数据流范例<https://www.ni.com/getting-started/labview-basics/dataflow>”。因此，当由于某种原因而无法将值直接连接到另一个节点时，它们可能很有用。

source: Note: One possible reason may be that you need to pass data between consecutive loop iterations; Miro\_T covered this `in this post <https://forums.ni.com/t5/FIRST-Robotics-Competition/Use-of-Shift-Registers-to-Pass-Data-Between-Loop-Iterations/ta-p/3498415?profile.language=en>`__. It should also be noted that the `feedback node <https://zone.ni.com/reference/en-XX/help/371361L-01/lvconcepts/block_diagram_feedback/>`__ in LabVIEW may be used as an equivalent to the shift register, although that may be a topic for another day!
es_mx: Nota: Una posible razón puede ser que necesite pasar datos entre iteraciones de bucle consecutivas; Miro\_T cubrió esto `en éste post <https://forums.ni.com/t5/FIRST-Robotics-Competition/Use-of-Shift-Registers-to-Pass-Data-Between-Loop-Iterations/ta-p/3498415?profile.language=en>`__. También debe tenerse en cuenta que el `feedback node <https://zone.ni.com/reference/en-XX/help/371361L-01/lvconcepts/block_diagram_feedback/>`__ en LabVIEW puede usarse como un equivalente al registro de desplazamiento, ¡aunque ese puede ser un tema para otro día!
fr_ca: Note: Une raison possible peut être que vous devez transmettre des données entre les itérations consécutives d'une boucle ; Miro\_T l'a couvert `dans cette publication <https://forums.ni.com/t5/FIRST-Robotics-Competition/Use-of-Shift-Registers-to-Pass-Data-Between-Loop-Iterations/ta-p/3498415?profile.language=en>`__. Il convient également de noter que le `nœud de rétroaction <https://zone.ni.com/reference/en-XX/help/371361L-01/lvconcepts/block_diagram_feedback/>`__ dans LabVIEW peut être utilisé comme un équivalent au registre à décalage, bien que cela puisse être un sujet pour un autre jour!
tr_tr: Not: Olası nedenlerden biri, verileri ardışık döngü yinelemeleri arasında geçirmeniz gerekmesidir; Miro\_T, `bu yazıda <https://forums.ni.com/t5/FIRST-Robotics-Competition/Use-of-Shift-Registers-to-Pass-Data-Between-Loop-Iterations/ta-p/3498415?profile.language=en>`__ ele alındı. LabVIEW'deki `feedback node<https://zone.ni.com/reference/en-XX/help/371361L-01/lvconcepts/block_diagram_feedback/>`__ shift register'a eşdeğer olarak kullanılabileceği, ancak bu başka bir konu olabilir!
zh_cn: 注意：一种可能的原因可能是您需要在连续的循环迭代之间传递数据。 Miro\_T在这篇文章<https://forums.ni.com/t5/FIRST-Robotics-Competition/Use-of-Shift-Registers-to-Pass-Data-Between-Loop-Iterations/ta-p/3498415?profile.language=en>涵盖了它。还应该注意的是，LabVIEW中的“反馈节点<https://zone.ni.com/reference/en-XX/help/371361L-01/lvconcepts/block_diagram_feedback/>” 可以等效于移位寄存器，尽管这可能是另一回事了！

source: Introduction to Local and Global Variables
es_mx: Introducción a las variables locales y globales
fr_ca: Introduction aux variables locales et globales
tr_tr: Local ve Global Değişkenlere Giriş
zh_cn: 局部和全局变量简介

source: Local variables may be used within the same VI. Create a local variable by right-clicking a control or indicator on your Front Panel:
es_mx: Las variables locales se pueden usar dentro del mismo VI. Cree una variable local haciendo clic con el botón derecho en un control o indicador en su panel frontal:
fr_ca: Les variables locales peuvent être utilisées dans le même VI. Créez une variable locale en cliquant avec le bouton droit sur un contrôle ou un indicateur sur votre panneau frontal :
tr_tr: Yerel değişkenler aynı VI içerisinde kullanılabilir. Ön Panelinizde bir kontrole veya göstergeye sağ tıklayarak yerel bir değişken oluşturun:
zh_cn: 局部变量可在同一VI中使用。通过右键单击前面板上的输入控件或显示控件来创建局部变量：

source: You may create a local variable from the Structures palette on the block diagram as well. When you have multiple local variables in one VI, you can left-click to choose which variable it is:
es_mx: También puede crear una variable local desde la paleta Estructuras en el diagrama de bloques. Cuando tiene múltiples variables locales en un VI, puede hacer clic izquierdo para elegir qué variable es:
fr_ca: Vous pouvez également créer une variable locale à partir de la Structures palette du diagramme bloc. Lorsque vous avez plusieurs variables locales dans un VI, vous pouvez cliquer à gauche pour choisir la bonne variable:
tr_tr: Blok diyagram üzerindeki Structures paletinden de bir yerel değişken oluşturabilirsiniz. Bir VI'da birden fazla yerel değişkeniniz olduğunda, hangi değişkeni seçmek için sol tıklayabilirsiniz:
zh_cn: 您也可以从程序框图的“结构”选项板中创建局部变量。当一个VI中有多个局部变量时，可以单击鼠标左键选择它是哪个变量：

source: Global variables are created slightly differently. Add one to the block diagram from the Structures palette, and notice that when you double-click it, it opens a separate front panel. This front panel does not have a block diagram, but you add as many entities to the front panel as you wish and save it as a \*.vi file:
es_mx: Las variables globales se crean de forma ligeramente diferente. Agregue uno al diagrama de bloques de la paleta Estructuras y observe que cuando hace doble clic en él, se abre un panel frontal separado. Este panel frontal no tiene un diagrama de bloques, pero agrega tantas entidades al panel frontal como desee y lo guarda como un archivo \*.Vi:
fr_ca: Les variables globales sont créées de manière légèrement différente. Ajoutez-y un diagramme bloc à partir de Structures palette et remarquez que lorsque vous cliquez deux fois, il ouvre un panneau avant séparé. Ce panneau avant n’a pas de diagramme bloc, mais vous pouvez ajouter autant d’entités au panneau avant que vous souhaitez et enregistrez-le sous forme de fichier \*.vi :
tr_tr: Global değişkenler biraz farklı oluşturulur. Structures paletinden blok diyagrama bir tane ekleyin ve üzerine çift tıkladığınızda ayrı bir ön panel açtığına dikkat edin. Bu ön panelin bir blok diyagramı yoktur, ancak ön panele istediğiniz kadar varlık ekleyip \*.Vi dosyası olarak kaydedersiniz:
zh_cn: 全局变量的创建略有不同。从“结构”选项板中向框图添加一个，然后注意，双击它会打开一个单独的前面板。该前面板没有程序框图，但是您可以根据需要向该前面板添加尽可能多的控件，并将其另存为* .vi文件：

source: Be very careful to avoid race conditions when using local and global variables! Essentially, make sure that you are not accidentally writing to the same variable in multiple locations without a way to know to which location it was last written. For a more thorough explanation, see `this help document <https://zone.ni.com/reference/en-XX/help/371361L-01/lvconcepts/using_local_and_global/>`_
es_mx: ¡Tenga mucho cuidado de evitar condiciones de carrera al usar variables locales y globales! Básicamente, asegúrese de no escribir accidentalmente en la misma variable en varias ubicaciones sin una forma de saber en qué ubicación se escribió por última vez. Para obtener una explicación más detallada, consulte `este documento <https://zone.ni.com/reference/en-XX/help/371361L-01/lvconcepts/using_local_and_global/>`_
fr_ca: Soyez très prudent afin d'éviter les conditions de course lorsque vous utilisez des variables locales et globales! Essentiellement, assurez-vous que vous n’écrivez pas accidentellement à la même variable dans plusieurs endroits sans avoir un moyen de savoir à quel endroit elle a été écrite pour la dernière fois. Pour une explication plus approfondie, consulter `ce document d’aide <https://zone.ni.com/reference/en-XX/help/371361L-01/lvconcepts/using_local_and_global/>`_
tr_tr: Local ve Global değişkenleri kullanırken yarış koşullarından kaçınmaya çok dikkat edin! Esasen, en son hangi konuma yazıldığını bilmenin bir yolu olmadan aynı değişkene birden çok konumda yanlışlıkla yazmadığınızdan emin olun. Daha kapsamlı bir açıklama için `şu yardım belgesine bakın: <https://zone.ni.com/reference/en-XX/help/371361L-01/lvconcepts/using_local_and_global/>`_
zh_cn: 使用局部和全局变量时要非常小心，避免出现相互干扰的变量！本质上，请确保不要在不知道最后将变量写入哪个位置的情况下，在多个位置意外写入同一变量。有关更详尽的说明，请参阅`此帮助文档<https://zone.ni.com/reference/en-XX/help/371361L-01/lvconcepts/using_local_and_global/>`

source: How They are Used in the Default LabVIEW for FRC Robot Project
es_mx: Cómo se utilizan en el LabVIEW predeterminado para el proyecto de robot FRC
fr_ca: Comment elles sont utilisées dans un projet de robot FRC LabVIEW par défaut
tr_tr: FRC Robot Project için Default LabVIEW Nasıl Kullanılırlar?
zh_cn: 在默认的LabVIEW for FRC机器人项目中如何使用它们

source: Global variables for "Enable Vision" and "Image Size" are written to during each iteration of the Robot Main VI…
es_mx: Las variables globales para "Enable Vision" e "Image Size" se escriben durante cada iteración del Robot Main VI ...
fr_ca: Des variables globales pour "Enable Vision" et "Image Size" sont écrites à chaque itération de Robot Main VI...
tr_tr: "Vizyonu Etkinleştir" ve "Görüntü Boyutu" için global değişkenler, Robot Ana VI'nın her yinelemesi sırasında yazılır…
zh_cn: 在Robot Main VI的每次迭代期间，都会写入“Enable Vision”和“Image Size”两个全局变量。

source: … And then read in each iteration of the Vision Processing VI:
es_mx: ... Y luego lea en cada iteración del Vision Processing VI:
fr_ca: ... Et puis lire à chaque itération de l'instrument virtuel Vision Processing VI:
tr_tr: … Ve sonra Vision Processing VI'nın her yinelemesinde okuyun:
zh_cn: …然后在Vision Processing VI的每次迭代中进行读取：

source: This allows the user, when deploying to Robot Main VI from the LabVIEW Development Environment, to enable/disable vision and change the image size from Robot Main’s Front Panel.
es_mx: Esto permite al usuario, al implementar en Robot Main VI desde el entorno de desarrollo de LabVIEW, habilitar / deshabilitar la visión y cambiar el tamaño de la imagen desde el panel frontal de Robot Main.
fr_ca: Ce qui permet à l’utilisateur, lors du déploiement sur Robot Main VI à partir de l’environnement de développement LabVIEW, d’activer/désactiver la vision et de modifier la taille de l’image à partir du panneau avant de Robot Main.
tr_tr: Bu, kullanıcının, LabVIEW Development Environment dan Robot Main VI'ya konuşlandırırken, görüntü işlemeyi enable/disable etmesine ve Robot Main'nin Ön Panelinden görüntü boyutunu değiştirmesine olanak tanır.
zh_cn: 这使用户可以在将程序从LabVIEW开发环境部署到Robot Main VI时，从Robot Main的前面板启用/禁用视觉并更改图像大小。

source: How Can You Use Them in Your Project?
es_mx: ¿Cómo puede utilizarlos en su proyecto?
fr_ca: Comment pouvez-vous les utiliser dans votre projet?
tr_tr: Bunları Projenizde Nasıl Kullanabilirsiniz?
zh_cn: 您如何在项目中使用它们？

source: Check out the block diagram for the Periodic Tasks VI. Perhaps there is some value, such as a boolean, that may be written to a global variable in the Teleop VI, and then read from in the Periodic Tasks VI. You can then decide what code or values to use in the Periodic Tasks VI, depending on the boolean global variable:
es_mx: Consulte el diagrama de bloques del VI Periodic Tasks. Quizás haya algún valor, como un booleano, que se pueda escribir en una variable global en el VI Teleop y luego leer en el VI Periodic Tasks. Luego puede decidir qué código o valores usar en el VI Periodic Tasks, dependiendo de la variable global booleana:
fr_ca: Consultez le diagramme bloc de l'instrument virtuel Periodic Tasks VI. Il existe peut-être y a-t-il une valeur, par exemple un booléen, qui peut être écrite à une variable globale dans le Teleop VI, puis lue dans Periodic Tasks VI. Vous pouvez ensuite décider quel code ou valeurs utiliser dans Periodic Tasks VI, selon la variable globale booléenne :
tr_tr: Periodic Tasks VI için blok şemasına bakın. Belki de Boolen gibi, Teleop VI'da global bir değişkene yazılabilen ve ardından Periodic Tasks VI'dan okunabilen bir değer vardır. Ardından, boolean genel değişkenine bağlı olarak, Periodic Tasks VI'da hangi kod veya değerleri kullanacağınıza karar verebilirsiniz:
zh_cn: 请查看Periodic Tasks VI的框图。可能存在一些值，例如布尔值，可以将其写入Teleop VI中的全局变量，然后从Periodical Tasks VI中读取。然后，可以根据布尔型全局变量决定在Periodic Tasks VI中使用哪些代码或值：
