Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/resources/making-a-one-shot-button-press.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Making a One-Shot Button Press
es_mx: Hacer una pulsación de botón de un disparo
fr_ca: Concevoir un bouton à pression unique
tr_tr: One-Shot Buton yapmak
zh_cn: 单响应按键

source: When using the Joystick Get Values function, pushing a joystick button will cause the button to read TRUE until the button is released. This means that you will most likely read multiple TRUE values for each press. What if you want to read only one TRUE value each time the button is pressed? This is often called a "One-Shot Button". The following tutorial will show you how to create a subVI that you can drop into your Teleop.vi to do this.
es_mx: Cuando utilice la función Obtener valores del joystick, al presionar un botón del joystick, el botón se leerá VERDADERO hasta que se suelte el botón. Esto significa que lo más probable es que lea varios valores VERDADEROS para cada pulsación. ¿Qué sucede si desea leer solo un valor VERDADERO cada vez que se presiona el botón? A esto se le suele llamar "One-Shot Button". El siguiente tutorial le mostrará cómo crear un subVI que puede colocar en su Teleop.vi para hacer esto.
fr_ca: Lorsque vous utilisez la fonction ``Joystick Get Values``, en appuyant sur un bouton du joystick, le bouton est lu TRUE jusqu’à ce que le bouton soit libéré. Cela signifie que vous lirez probablement plusieurs valeurs TRUE tant que la pression sur le bouton est maintenue. Que faire si vous voulez lire une seule valeur TRUE chaque fois que l'on maintient la pression sur le bouton? C’est ce qu’on appelle souvent un "One-Shot Button". Le didacticiel suivant vous montrera comment créer un subVI que vous pouvez insérer dans votre ``Teleop.vi`` pour réaliser cette fonctionnalité.
tr_tr: Joystick Get Values işlevini kullanırken, bir joystick düğmesine basmak, düğme bırakılana kadar düğmenin TRUE okumasına neden olur. Bu, büyük olasılıkla her basışta birden çok DOĞRU değeri okuyacağınız anlamına gelir. Ya düğmeye her basıldığında yalnızca bir DOĞRU değeri okumak isterseniz? Bu genellikle "One-shot Button" olarak adlandırılır. Aşağıdaki eğitim, bunu yapmak için Teleop.vi'nize bırakabileceğiniz bir subVI'yı nasıl oluşturacağınızı gösterecektir.
zh_cn: 读取操纵杆数值时，按下操纵杆按钮将导致该按钮读数为TRUE，直到松开该按钮为止。这意味着您极有可能在每次按下按键时读取多个TRUE值。如果在每次按下按钮时，你仅想读取一个TRUE值怎么办？通常将其称为“单响应按钮”。以下教程将向您展示如何创建一个子VI，您可以将其放入Teleop.vi。

source: First, create a new VI in the Support Code folder of your project.
es_mx: Primero, cree un nuevo VI en la carpeta Support Code de su proyecto.
fr_ca: Pour commencer, créez un nouveau VI dans le dossier *Code de support* de votre projet.
tr_tr: Öncelikle, projenizin Support Code klasöründe yeni bir VI oluşturun.
zh_cn: 首先，在项目的Support Code文件夹中创建一个新的VI。

source: Now on the block diagram of the new VI, drop in the following code snippet.
es_mx: Ahora, en el diagrama de bloques del nuevo VI, coloque el siguiente fragmento de código.
fr_ca: Maintenant, sur le diagramme bloc du nouveau VI, ajouter l’extrait de code suivant.
tr_tr: Şimdi yeni VI'nın blok diyagramında, aşağıdaki kod parçacığını bırakın.
zh_cn: 现在在新VI的程序框图上，添加以下代码段。

source: This code uses a function called the Feedback Node. We have wired the current value of the button into the left side of the feedback node. The wire coming out of the arrow of the feedback node represents the previous value of the button. If the arrow on your feedback node is going the opposite direction as shown here, right click to find the option to reverse the direction.
es_mx: Este código utiliza una función llamada Nodo de retroalimentación. Hemos cableado el valor actual del botón en el lado izquierdo del nodo de retroalimentación. El cable que sale de la flecha del nodo de retroalimentación representa el valor anterior del botón. Si la flecha en su nodo de retroalimentación va en la dirección opuesta como se muestra aquí, haga clic derecho para encontrar la opción para invertir la dirección.
fr_ca: Ce code utilise une fonction appelée ``Feedback Node``. Nous avons relié la valeur actuelle du bouton à l'entrée ``Feedback Node``. Le fil sortant de la flèche ``Feedback Node`` représente la valeur précédente du bouton. Si la flèche de votre nœud de rétroaction va dans la direction opposée comme c'est indiqué ici, cliquez avec le bouton droit pour trouver l’option d’inversion de direction.
tr_tr: Bu kod, Feedback Node adı verilen bir işlevi kullanır. Düğmenin mevcut değerini feedack node düğümünün sol tarafına bağladık. Feedback node düğümünün okundan çıkan tel, düğmenin önceki değerini temsil eder. Geri bildirim düğümünüzdeki ok burada gösterildiği gibi ters yöne gidiyorsa, yönü tersine çevirme seçeneğini bulmak için sağ tıklayın.
zh_cn: 此代码使用了一个被称为反馈节点的功能。我们已经将按钮的当前值连接到了反馈节点的左侧。从反馈节点的箭头中出来的导线表示按钮的先前值。如果您的反馈节点上的箭头正朝着相反的方向（如此处所示），请单击右键以找到反向的选项。

source: When a button is pressed, the value of the button goes from FALSE to TRUE. We want the output of this VI to be TRUE only when the current value of the button is TRUE, and the previous value of the button is FALSE.
es_mx: Cuando se presiona un botón, el valor del botón pasa de FALSE a TRUE. Queremos que la salida de este VI sea VERDADERA solo cuando el valor actual del botón sea VERDADERO y el valor anterior del botón sea FALSO.
fr_ca: Lorsqu’un bouton est appuyé, la valeur du bouton passe de FALSE à TRUE. Nous voulons que la sortie de ce VI ne soit TRUE que lorsque la valeur actuelle du bouton est TRUE et que la valeur précédente du bouton est FALSE.
tr_tr: Bir düğmeye basıldığında, düğmenin değeri FALSE'dan TRUE'ya gider. Bu VI'nın çıktısının yalnızca düğmenin mevcut değeri TRUE ve düğmenin önceki değeri FALSE olduğunda TRUE olmasını istiyoruz.
zh_cn: 当按下按钮时，按钮的值从FALSE变为TRUE。我们希望仅当按钮的当前值为TRUE且按钮的先前值为FALSE时，该VI的输出才为TRUE。

source: Next we need to connect the boolean control and indicator to the inputs and outputs of the VI. To do this, first click the block on the connector pane, then click the button to connect the two (see the diagram below). Repeat this for the indicator.
es_mx: A continuación, necesitamos conectar el control booleano y el indicador a las entradas y salidas del VI. Para hacer esto, primero haga clic en el bloque en el panel del conector, luego haga clic en el botón para conectar los dos (vea el diagrama a continuación). Repita esto para el indicador.
fr_ca: Puis, nous devons connecter le contrôle booléen et l’indicateur aux entrées et sorties du VI. Pour ce faire, cliquez d’abord sur le bloc dans le volet connecteur, puis cliquez sur le bouton pour connecter les deux (voir le diagramme ci-dessous). Répétez cette même opération avec l’indicateur.
tr_tr: Daha sonra boolen kontrolünü ve göstergesini VI'nın giriş ve çıkışlarına bağlamamız gerekir. Bunu yapmak için, önce bağlayıcı bölmesindeki bloğa tıklayın, ardından ikisini bağlamak için düğmeye tıklayın (aşağıdaki şemaya bakın). Gösterge için bunu tekrarlayın.
zh_cn: 接下来，我们需要将布尔控件和显示控件连接到VI的输入和输出。为此，请首先单击连接器窗格上的方格，然后单击按钮以将两者连接（请参见下图）。对显示控件重复此操作。

source: Next, we need to change the properties of this VI so that we can use multiples of this VI in our TeleOp.vi. Right click the VI Icon and go to VI Properties. Then select the category "Execution" and select "Preallocated clone reentrant execution".
es_mx: A continuación, necesitamos cambiar las propiedades de este VI para que podamos usar múltiplos de este VI en nuestro TeleOp.vi. Haga clic derecho en el icono VI y vaya a Propiedades VI. Luego seleccione la categoría "Execution" y seleccione "Preallocated clone reentrant execution".
fr_ca: Ensuite, nous devons changer les propriétés de ce VI afin de pouvoir en utiliser plusieurs copies dans notre ``TeleOp.vi``. Cliquez avec le bouton droit sur l’icône VI et accédez à ``VI Properties``. Sélectionnez ensuite la catégorie "Execution" et sélectionnez "Preallocated clone reentrant execution".
tr_tr: Daha sonra, bu VI'nın özelliklerini TeleOp.vi'mizde bu VI'nın katlarını kullanabilmemiz için değiştirmemiz gerekiyor. VI Simgesine sağ tıklayın ve VI Özellikleri'ne gidin. Ardından "Execution" kategorisini seçin ve "Preallocated clone reentrant execution" yı seçin.
zh_cn: 接下来，我们需要更改该VI的属性，以便我们可以在TeleOp.vi中使用这个VI的倍数。右键单击VI图标，然后转到VI属性。然后选择类别“执行”，然后选择“预分配的副本重入执行”。

source: Lastly, we should change the VI Icon to be more descriptive of the VI's function. Right click the Icon and go to Edit Icon. Create a new Icon.
es_mx: Por último, deberíamos cambiar el icono VI para que sea más descriptivo de la función del VI. Haga clic derecho en el icono y vaya a Editar icono. Crea un nuevo icono.
fr_ca: De plus, il serait judicieux de changer l’icône VI pour être plus descriptif de la fonction du VI. Cliquez avec le bouton droit sur l’icône et accédez à Edit Icon. Créez une icône.
tr_tr: Son olarak, VI Simgesini VI'nın işlevini daha açıklayıcı olacak şekilde değiştirmeliyiz. Simgeye sağ tıklayın ve Edit Icon'a gidin. Create a new Icon-Yeni bir Simge oluşturun.
zh_cn: 最后，我们应该更改VI图标，以更贴近VI的功能。右键单击图标，然后转到编辑图标。创建一个新的图标。

source: Finally, save the VI with a descriptive name. You can now drag and drop this VI from the Support Files folder into your TeleOp.vi. Here is a copy of the completed VI: :download:`Button_Press.vi <files/Button_Press.vi>`
es_mx: Finalmente, guarde el VI con un nombre descriptivo. Ahora puede arrastrar y soltar este VI desde la carpeta Support Files a su TeleOp.vi. Aquí hay una copia del VI completo: :download:`Button_Press.vi <files/Button_Press.vi>`
fr_ca: Pour terminer, enregistrez le VI avec un nom descriptif. Vous pouvez maintenant faire glisser et déposer ce VI du dossier Fichiers de support dans votre ``TeleOp.vi``. Voici une copie du VI: :download:`Button_Press.vi <files/Button_Press.vi>` complété
tr_tr: Son olarak, VI'yı açıklayıcı bir adla kaydedin. Artık bu VI'yı Support Files klasöründen TeleOp.vi'nize sürükleyip bırakabilirsiniz. İşte tamamlanan VI'nın bir kopyası: :download:`Button_Press.vi <files/Button_Press.vi>`
zh_cn: 最后，命名并保存该VI。现在，您可以将该VI从Support Files文件夹拖放到TeleOp.vi中。这是完成的VI的副本：:download:`Button_Press.vi <files/Button_Press.vi>`

source: Here's an example of how you could use this VI.
es_mx: Aquí hay un ejemplo de cómo podría usar este VI.
fr_ca: Voici un exemple vous montrant la façon dont vous pourriez utiliser ce VI.
tr_tr: İşte bu VI'yı nasıl kullanabileceğinize dair bir örnek.
zh_cn: 这是如何使用该VI的示例。
