Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/resources/using-the-compressor-*-labview.po
Languages: tr_tr

source: Using the Compressor in LabVIEW
tr_tr: Kompresörü LabVIEW'de Kullanma

source: This snippet shows how to set up your roboRIO project to use the Pneumatic Control Module (PCM). The PCM automatically starts and stops the compressor when specific pressures are measured in the tank. In your roboRIO program, you will need to add the following VIs.
tr_tr: Bu kod parçası roboRIO projenizi Pnömatik Kontrol Modülünü (PCM) kullanmak için nasıl ayarlayacağınızı gösterir. PCM, tankta belirli basınçlar ölçüldüğünde kompresörü otomatik olarak başlatır ve durdurur. RoboRIO programınızda aşağıdaki VI'ları eklemeniz gerekecektir.

source: For more information, check out the following links:
tr_tr: Daha fazla bilgi için aşağıdaki bağlantılara bakın:

source: `PCM User's Guide <https://ctr-electronics.com/PCM%20User's%20Guide.pdf>`__
tr_tr: `PCM Kullanım Kılavuzu <https://ctr-electronics.com/PCM%20User's%20Guide.pdf>`__

source: `Pneumatics Step by Step for the roboRIO <http://team358.org/files/pneumatic/Pneumatics-StepByStep-roboRIO.pdf>`__
tr_tr: `RoboRIO için Adım Adım Pnömatik<http://team358.org/files/pneumatic/Pneumatics-StepByStep-roboRIO.pdf>`__

source: Begin VI
tr_tr: VI'yı başlatın

source: Place this snippet in the Begin.vi.
tr_tr: Bu pasajı Begin.vi'ye yerleştirin.

source: Place this snippet in the Teleop.vi. This portion is only required if you are using the outputs for other processes.
tr_tr: Bu bölümü Teleop.vi'ye yerleştirin. Bu bölüm yalnızca çıktıları diğer işlemler için kullanıyorsanız gereklidir.

source: Finish VI
tr_tr: VI'yı sonlandır

source: Place this snippet in Close Refs, save data, etc. frame of the Finish.vi.
tr_tr: Bu parçacığı, Finish.vi'nin Close Refs, verileri kaydetme vb. bölümüne yerleştirin.
