Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/resources/waiting-for-target-to-respond.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Waiting for Target to Respond - Recovering from bad loops
es_mx: Esperando que el objetivo responda - Recuperándose de bucles defectuosos
fr_ca: En attendant que la cible réponde - Se remettre des boucles mal conçues
tr_tr: Waiting for Target to Respond - Bozuk döngülerden kurtarma
zh_cn: 等待目标响应-从错误循环中恢复

source: If you download LabVIEW code which contains an unconstrained loop (a loop with no delay) it is possible to get the roboRIO into a state where LabVIEW is unable to connect to download new code. This document explains the process required to load new, fixed, code to recover from this state.
fr_ca: Si vous téléchargez du code LabVIEW qui contient une boucle sans contrainte (une boucle sans délai), il est possible de mettre le roboRIO dans un état où LabVIEW est incapable de se connecter pour télécharger un nouveau code. Ce document explique le processus requis pour charger un nouveau code fixe pour récupérer de cet état.

source: The Symptom
es_mx: El síntoma
fr_ca: Le symptôme
tr_tr: Belirti
zh_cn: 错误特征

source: The primary symptom of this issue is attempts to download new robot code hang at the "Waiting for the target (Target) to respond" step as shown above. Note that there are other possible causes of this symptom (such as switching from a C++\Java program to LabVIEW program) but the steps described here should resolve most or all of them.
es_mx: El síntoma principal de este problema es que los intentos de descargar un nuevo código de robot se cuelgan en el paso "Esperando que el objetivo (Target) responda" como se muestra arriba. Tenga en cuenta que hay otras causas posibles de este síntoma (como cambiar de un programa C++\Java a un programa LabVIEW) pero los pasos descritos aquí deberían resolver la mayoría o todos ellos.
fr_ca: Le symptôme principal de ce problème consiste aux tentatives de déploiement du nouveau code robot figé à l’étape "Waiting for the target (Target) to respond" comme indiqué ci-dessus. Notez qu’il existe d’autres causes possibles de ce symptôme (comme le passage d’un programme C++ ou Java à un programme LabVIEW), mais les étapes décrites ici devraient résoudre la plupart ou la totalité d’entre elles.
tr_tr: Bu sorunun birincil belirtisi, yukarıda gösterildiği gibi "Waiting for the target (Target) to respond" adımında askıda kalan yeni robot kodunu indirme girişimleridir. Bu semptomun başka olası nedenleri de olduğunu unutmayın (bir C++\Java programından LabVIEW programına geçmek gibi), ancak burada açıklanan adımlar bunların çoğunu veya tümünü çözecektir.
zh_cn: 此问题出现时的主要特征是在“等待目标响应”一步时尝试上传新的机器人代码，如上图所示。请注意，还有其他可能的原因导致这种现象（例如，从C ++ 、Java程序切换到LabVIEW程序），但是此处描述的步骤应该可以解决大多数或全部问题。

source: Click ``Cancel`` to close the download dialog.
es_mx: Haga clic en ``Cancelar`` para cerrar el cuadro de diálogo de descarga.
fr_ca: Cliquez sur ``Cancel`` pour fermer la boîte de dialogue du déploiement.
tr_tr: İndirme iletişim kutusunu kapatmak için ``Cancel`` a tıklayın.
zh_cn: 单击“取消”以关闭上传对话框。

source: The Problem
es_mx: El problema
fr_ca: Le problème
tr_tr: Sorun
zh_cn: 问题

source: One common source of this issue is unconstrained loops in your LabVIEW code. An unconstrained loop is a loop which does not contain any delay element (such as the one on the left). If you are unsure where to begin looking, Disabled.VI, Periodic Tasks.VI and Vision Processing.VI are the common locations for this type of loop. To fix the issue with the code, add a delay element such as the Wait (ms) VI from the Timing palette, found in the right loop.
es_mx: Una fuente común de este problema son los bucles sin restricciones en su código de LabVIEW. Un bucle sin restricciones es un bucle que no contiene ningún elemento de retardo (como el de la izquierda). Si no está seguro de dónde empezar a buscar, Disabled.VI, Periodic Tasks.VI y Vision Processing.VI son las ubicaciones comunes para este tipo de bucle. Para solucionar el problema con el código, agregue un elemento de retardo como Wait (ms) VI de la paleta Timing, que se encuentra en el bucle derecho.
fr_ca: L’une des sources courantes de ce problème est la présence de boucles non contraintes dans votre code LabVIEW. Une boucle sans contrainte est une boucle qui ne contient aucun élément de délai (comme celle de gauche). Si vous ne savez pas par où commencer à chercher, Disabled.VI, Periodic Tasks.VI et Vision Processing.VI sont les endroits communs où on retrouve ce type de boucle. Pour corriger ce problème, ajoutez dans votre code un élément de délai tel que le Wait(ms) VI de la palette Timing, présent dans la boucle droite.
tr_tr: Bu sorunun yaygın bir kaynağı, LabVIEW kodunuzdaki kısıtlanmamış döngülerdir. Sınırlandırılmamış döngü, herhangi bir gecikme öğesi içermeyen bir döngüdür (soldaki gibi). Nereden bakmaya başlayacağınızdan emin değilseniz, Disabled.VI, Periodic Tasks.VI ve Vision Processing.VI, bu tür döngü için ortak konumlardır. Kodla ilgili sorunu çözmek için, sağ döngüde bulunan Timing paletinden Wait(ms) VI gibi bir gecikme öğesi ekleyin.
zh_cn: 这个问题的一个常见原因是LabVIEW代码中存在无限制循环。无限制循环是不包含任何延迟元素（例如左侧的延迟元素）的循环。如果不确定从哪里开始找，Disabled.VI，Periodic Tasks.VI和Vision Processing.VI是此类循环的常见位置。要解决代码问题，请在右侧循环中添加一个延迟元素，如“定时”选板中的“等待（ms）” VI。

source: Set No App
es_mx: Establecer ninguna aplicación
fr_ca: Ne définir aucune App
tr_tr: Set No App - Uygulama Yok Ayarla
zh_cn: 设置禁用程序

source: Using the roboRIO webserver (see the article on the :ref:`roboRIO Web Dashboard Startup Settings <docs/software/roborio-info/roborio-web-dashboard:Startup Settings>` for more details). **Check** the box to "Disable RT Startup App".
es_mx: Usando el servidor web roboRIO (consulte el artículo sobre :ref:`roboRIO Web Dashboard Startup Settings <docs/software/roborio-info/roborio-web-dashboard:Startup Settings>` para obtener más detalles) **Marque** la casilla para "Desactivar la aplicación de inicio RT".
fr_ca: L'utilisation du serveur web du roboRIO (voir l’article :ref:`roboRIO Web Dashboard Startup Settings <docs/software/roborio-info/roborio-web-dashboard:Startup Settings>` pour plus de détails). **Cochez** la case "Disable RT Startup App".
tr_tr: RoboRIO web sunucusunu kullanma (daha fazla ayrıntı için :ref:`roboRIO Web Dashboard Startup Settings <docs/software/roborio-info/roborio-web-dashboard:Startup Settings>` deki makaleye bakın). "RT Başlangıç Uygulamasını Devre Dışı Bırak" kutusunu **Check** işaretleyin .
zh_cn: 使用roboRIO Web服务器（有关更多详细信息，请参见“roboRIO Web Dashboard Startup Settings”上的文章）。选中“禁用RT启动应用程序”。

source: Reboot
es_mx: Reiniciar
fr_ca: Redémarrer
tr_tr: Reboot -Yeniden başlat
zh_cn: 重启

source: Reboot the roboRIO, either using the Reset button on the device or by click Restart in the top right corner of the webpage.
es_mx: Reinicia el roboRIO, ya sea usando el botón Restablecer en el dispositivo o haciendo clic en Reiniciar en la esquina superior derecha de la página web.
fr_ca: Redémarrez le roboRIO, soit à l’aide du bouton Reset situé sur l’appareil, soit en cliquant sur Restart dans le coin supérieur droit de la page Web.
tr_tr: Cihazdaki Reset düğmesini kullanarak veya web sayfasının sağ üst köşesindeki Restart sseçeneğine tıklayarak roboRIO'yu yeniden başlatın.
zh_cn: 使用设备上的“重置”按钮或单击网页右上角的“重新启动”以重新启动roboRIO。

source: Clear No App
es_mx: Borrar ninguna aplicación
fr_ca: N'effacer aucune App
tr_tr: Uygulama Yok'u Temizle
zh_cn: 取消禁用程序

source: Using the roboRIO webserver (see the article on the :ref:`roboRIO Web Dashboard Startup Settings <docs/software/roborio-info/roborio-web-dashboard:Startup Settings>` for more details). **Uncheck** the box to "Disable RT Startup App".
es_mx: Usando el servidor web roboRIO (consulte el artículo sobre: :ref:`roboRIO Web Dashboard Startup Settings <docs/software/roborio-info/roborio-web-dashboard:Startup Settings>` para obtener más detalles) **Desmarque** la casilla para "Desactivar la aplicación de inicio RT".
fr_ca: Utilisation du serveur web du roboRIO (voir l’article sur :ref:`roboRIO Web Dashboard Startup Settings <docs/software/roborio-info/roborio-web-dashboard:Startup Settings>`, pour plus de détails). **Décochez** la case "Disable RT Startup App".
tr_tr: RoboRIO web sunucusunu kullanma (daha fazla ayrıntı için: :ref:`roboRIO Web Dashboard Startup Settings <docs/software/roborio-info/roborio-web-dashboard:Startup Settings>` 'deki makaleye bakın). "RT Başlangıç Uygulamasını Devre Dışı Bırak" kutusunun **Uncheck** işaretini kaldırın.
zh_cn: 使用roboRIO Web服务器 (有关更多详细信息，请参见:ref:`roboRIO Web Dashboard Startup Settings <docs/software/roborio-info/roborio-web-dashboard:Startup Settings>` 上的文章). 取消选中“禁用RT启动应用程序”。

source: Load LabVIEW Code
es_mx: Cargar código de LabVIEW
fr_ca: Charger le code LabVIEW
tr_tr: LabVIEW Kodunu Yükle
zh_cn: 加载LabVIEW代码

source: Load LabVIEW code (either using the Run button or Run as Startup). Make sure to set LabVIEW code to Run as Startup before rebooting the roboRIO or you will need to follow the instructions above again.
es_mx: Cargue el código de LabVIEW (ya sea usando el botón Ejecutar o Ejecutar como inicio). Asegúrese de configurar el código de LabVIEW en Ejecutar como inicio antes de reiniciar el roboRIO o deberá seguir las instrucciones anteriores nuevamente.
fr_ca: Chargez le code LabVIEW (à l’aide du bouton Run ou Run as Startup). Assurez-vous de configurer le code LabVIEW à "Startup before rebooting the roboRIO" ou vous devrez à nouveau suivre les instructions ci-dessus.
tr_tr: LabVIEW kodunu yükleyin (Run düğmesini veya Run as Startup'ı kullanarak). RoboRIO'yu yeniden başlatmadan önce LabVIEW kodunu Run as Startup olarak ayarladığınızdan emin olun, aksi takdirde yukarıdaki talimatları tekrar izlemeniz gerekecektir.
zh_cn: 加载LabVIEW代码（使用“运行”按钮或“以启动方式运行”）。在重启roboRIO之前，请确保将LabVIEW代码设置为“以启动方式运行”，否则您将需要再次按照上述说明进行操作。
