Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/binding-commands-to-triggers.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Binding Commands to Triggers
es_mx: Enlazando comandos a Triggers
fr_ca: Liaison de commandes à des déclencheurs
tr_tr: Komutları Trigger-Tetikleyicilere Bağlama
zh_cn: 将命令绑定到触发器

source: Apart from autonomous commands, which are scheduled at the start of the autonomous period, and default commands, which are automatically scheduled whenever their subsystem is not currently in-use, the most common way to run a command is by binding it to a triggering event, such as a button being pressed by a human operator. The command-based paradigm makes this extremely easy to do.
es_mx: Además de los comandos autónomos, que se programan al inicio del período autónomo, y los comandos predeterminados, que se programan automáticamente cuando su subsistema no está en uso, la forma más común de ejecutar un comando es vinculándolo a un evento de activación, como un botón que presiona un operador humano. El paradigma basado en comandos hace que esto sea extremadamente fácil de hacer.
fr_ca: Mis à part les commandes autonomes, qui sont planifiées au début de la période autonome, et les commandes par défaut, qui sont automatiquement planifiées chaque fois que leur sous-système n’est pas actuellement en cours d’utilisation, la façon la plus courante d’exécuter une commande est de la lier à un événement déclencheur, comme un bouton appuyé par un opérateur humain. Le paradigme orienté commande rend cela extrêmement facile à faire.
tr_tr: Otonom dönemin başlangıcında programlanan otonom komutlar ve alt sistemleri halihazırda kullanımda olmadığında otomatik olarak programlanan varsayılan komutlar dışında, bir komutu çalıştırmanın en yaygın yolu onu tetikleyici bir olaya bağlamaktır. Bir insan operatörün bir düğmeye basması gibi. Komut tabanlı paradigma, bunu yapmayı son derece kolaylaştırır.
zh_cn: 除了在自动阶段开始时调度的自动阶段命令以及在当前不使用其子系统的情况下自动调度的缺省命令之外，运行命令的最常见方法是将其绑定到触发事件，例如人工操作员按下的按钮。基于命令的范例使此操作非常容易。

source: As mentioned earlier, command-based is a `declarative <https://en.wikipedia.org/wiki/Declarative_programming>`__ paradigm. Accordingly, binding buttons to commands is done declaratively; the association of a button and a command is "declared" once, during robot initialization. The library then does all the hard work of checking the button state and scheduling (or canceling) the command as needed, behind-the-scenes. Users only need to worry about designing their desired UI setup - not about implementing it!
fr_ca: Comme mentionné précédemment, la commande est un paradigme `declaratif <https://en.wikipedia.org/wiki/Declarative_programming>`__. En conséquence, la liaison des boutons aux commandes se fait de manière déclarative; l'association d'un bouton et d'une commande est "déclarée" une fois, lors de l'initialisation du robot. La bibliothèque effectue ensuite tout le travail ardu de vérification de l'état du bouton et de planification (ou d'annulation) de la commande selon les besoins, en arrière-plan. Les usagers n'ont qu'à se soucier de la conception de l'interface utilisateur - pas de sa mise en œuvre!
zh_cn: 如前所述，基于命令是`声明性<https://en.wikipedia.org/wiki/Declarative_programming>`__范例。因此，以声明方式将按钮绑定到命令。在机器人初始化期间，一次“声明”了按钮和命令的关联。然后，该库将进行所有艰苦的工作，以检查按钮状态并根据需要在幕后安排（或取消）命令。用户只需要担心设计自己所需的UI设置，而不必担心实现它！

source: Command binding is done through the ``Trigger`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/Trigger.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_trigger.html>`__) and its various ``Button`` subclasses (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/Button.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_button.html>`__).
fr_ca: La liaison de commande se fait à travers la classe ``Trigger`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/Trigger.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_trigger.html>`__) et sa variété de sous-classes ``Button`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/Button.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_button.html>`__).

source: Trigger/Button Bindings
es_mx: Enlaces de gatillo / botón
fr_ca: Liaisons déclencheur/bouton
tr_tr: Tetik/Düğme Bağlamaları
zh_cn: 触发器/按钮绑定

source: The C++ command-based library offers two overloads of each button binding method - one that takes a forwarding reference, and one that takes a raw pointer. The forwarding reference overload transfers ownership (by either moving or copying depending on if the command is an `rvalue or an lvalue <http://thbecker.net/articles/rvalue_references/section_01.html>`__) to the scheduler, while the raw pointer overload leaves the user responsible for the lifespan of the command object. It is recommended that users preferentially use the forwarding reference overload unless there is a specific need to retain a handle to the command in the calling code.
fr_ca: La bibliothèque orientée commandes C++ offre deux surcharges (deux jeux de paramètres différents) de chaque méthode de liaison de boutons : l’une qui prend une référence de transfert et l’autre qui prend un pointeur brut. La surcharge de référence de transfert transfère la propriété (en déplaçant ou en copiant selon que la commande est une `rvalue ou une lvalue <http://thbecker.net/articles/rvalue_references/section_01.html>`__) au planificateur, tandis que la surcharge du pointeur brut laisse l’utilisateur responsable de la durée de vie de l’objet commande. Il est recommandé aux utilisateurs d’utiliser de préférence la surcharge de référence de transfert, sauf s’il est spécifiquement nécessaire de conserver un handle pour la commande dans le code appelant.

source: There are a number of bindings available for the ``Trigger`` class. All of these bindings will automatically schedule a command when a certain trigger activation event occurs - however, each binding has different specific behavior. ``Button`` and its subclasses have bindings with identical behaviors, but slightly different names that better-match a button rather than an arbitrary triggering event.
es_mx: Hay varios enlaces disponibles para la clase ``Trigger``. Todos estos enlaces programarán automáticamente un comando cuando se produzca un determinado evento de activación de botón; sin embargo, cada enlace tiene un comportamiento específico diferente. ``Button`` y sus subclases tienen enlaces con comportamientos idénticos, pero nombres ligeramente diferentes que combinan mejor con un botón en lugar de un evento de activación arbitrario.
fr_ca: Il existe un certain nombre de liaisons disponibles pour la classe ``Trigger``. Toutes ces liaisons planifient automatiquement une commande lorsqu’un événement d’activation de déclencheur se produit - cependant, chaque liaison a un comportement spécifique différent. ``Button`` et ses sous-classes ont des liaisons avec des comportements identiques, mais des noms légèrement différents qui correspondent mieux à un bouton plutôt qu’à un événement déclencheur arbitraire.
tr_tr: ``Trigger`` sınıfı için mevcut olan bir dizi bağlama vardır. Bu bağlamaların tümü, belirli bir tetikleyici etkinleştirme olayı gerçekleştiğinde otomatik olarak bir komut zamanlayacaktır - ancak, her bağlamanın farklı belirli davranışları vardır. ``Button`` ve alt sınıfları, aynı davranışlara sahip bağlamalara sahiptir, ancak keyfi bir tetikleyici olay yerine bir düğmeyle daha iyi eşleşen farklı adlara sahiptir.
zh_cn: “Trigger”类有许多可用的绑定。当发生某些触发器激活事件时，所有这些绑定将自动调度命令——但是，每个绑定具有不同的特定行为。“Button”及其子类的绑定具有相同的行为，但是名称稍有不同，可以更好地匹配按钮而不是任意触发事件。

source: This binding schedules a command when a trigger changes from inactive to active (or, accordingly, when a button changes is initially pressed). The command will be scheduled on the iteration when the state changes, and will not be scheduled again unless the trigger becomes inactive and then active again (or the button is released and then re-pressed).
es_mx: Esta vinculación programa un comando cuando un botón cambia de inactivo a activo (o, en consecuencia, cuando se presiona inicialmente un cambio de botón). El comando se programará en la iteración cuando cambie el estado, y no se programará nuevamente a menos que el botón se vuelva inactivo y luego se active nuevamente (o se suelte el botón y luego se vuelva a presionar).
fr_ca: Cette liaison planifie une commande lorsqu’un déclencheur passe de l'état inactif à l'état actif (ou, en conséquence, lorsqu’un bouton déclencheur est initialement appuyé). La commande sera planifiée sur l’itération lorsque l’état change, et ne sera pas planifiée à nouveau à moins que le déclencheur ne devienne inactif, puis actif à nouveau (ou le bouton est libéré, puis appuyé à nouveau).
tr_tr: Bu bağlama, bir tetikleyici inaktif durumdan aktif duruma geçtiğinde (veya buna göre, bir düğmeye ilk basıldığında) bir komut zamanlar. Komut, durum değiştiğinde yinelemeye programlanacak ve tetik devre dışı bırakılıp ardından tekrar etkin hale gelmedikçe (veya düğme bırakılıp ardından yeniden basılmadıkça) tekrar programlanmayacaktır.
zh_cn: 当触发器从非活动状态更改为活动状态时（或相应地，最初按下按钮更改时），此绑定可调度命令。当状态改变时，该命令将在迭代中进行调度，除非触发器变为非活动状态然后再次处于活动状态（或者释放按钮然后再次按下），否则将不会再次调度该命令。

source: This binding schedules a command repeatedly while a trigger is active (or, accordingly, while a button is held), and cancels it when the trigger becomes inactive (or when the button is released). Note that scheduling an already-running command has no effect; but if the command finishes while the trigger is still active, it will be re-scheduled.
es_mx: Esta vinculación programa un comando repetidamente mientras un botón está activo (o, en consecuencia, mientras se mantiene presionado un botón) y lo cancela cuando el disparador se vuelve inactivo (o cuando se suelta el botón). Tenga en cuenta que programar un comando que ya se esté ejecutando no tiene ningún efecto; pero si el comando finaliza mientras el botón o gatillo aún está activo, se reprogramará.
fr_ca: Cette liaison planifie une commande à plusieurs reprises pendant qu’un déclencheur est actif (ou, en conséquence, pendant qu’un bouton est maintenu), et l’annule lorsque le déclencheur devient inactif (ou lorsque le bouton est libéré). Notez que la planification d’une commande déjà en cours d’exécution n’a aucun effet ; mais si la commande se termine pendant que le déclencheur est toujours actif, elle sera re-planifiée.
tr_tr: Bu bağlama, bir tetikleme etkinken (veya buna göre bir düğme basılıyken) bir komutu tekrar tekrar zamanlar ve tetik etkin olmadığında (veya düğme bırakıldığında) bunu iptal eder. Zaten çalışan bir komutun zamanlanmasının hiçbir etkisi olmadığını unutmayın; ancak komut tetikleyici hala etkinken biterse, yeniden zamanalanacaktır.
zh_cn: 此绑定在触发器处于活动状态时（或相应地，在按住按钮时）重复调度命令，并在触发器变为非活动状态（或释放按钮时）取消该命令。请注意，调度已经在运行的命令无效。但是如果在触发器仍处于活动状态时命令完成，则将重新安排它的时间。

source: This binding schedules a command when a trigger changes from inactive to active (or, accordingly, when a button is initially pressed) and cancels it when the trigger becomes inactive again (or the button is released). The command will *not* be re-scheduled if it finishes while the trigger is still active.
es_mx: Esta vinculación programa un comando cuando un botón o gatillo cambia de inactivo a activo (o, en consecuencia, cuando se presiona un botón inicialmente) y lo cancela cuando el botón vuelve a estar inactivo (o se suelta el botón). El comando *no* se reprogramará si finaliza mientras el botón aún está activo.
fr_ca: Cette liaison planifie une commande lorsqu’un déclencheur passe de l’état inactif à l'état actif (ou, en conséquence, lorsqu’un bouton est initialement appuyé) et l’annule lorsque le déclencheur redevient inactif (ou que le bouton est libéré). La commande *ne* sera *pas* re-planifiée si elle se termine pendant que le déclencheur est toujours actif.
tr_tr: Bu bağlama, bir tetikleyici devre dışı durumdan etkin duruma geçtiğinde (veya buna göre, bir düğmeye ilk basıldığında) bir komut programlar ve tetik tekrar devre dışı kaldığında (veya düğme bırakıldığında) bunu iptal eder. Tetikleyici hala etkinken tamamlanırsa komut *yeniden programlanmayacaktır*.
zh_cn: 当触发器从非活动状态变为活动状态（或相应地，最初按下按钮时）时，此绑定调度命令，并在触发器再次变为非活动状态（或释放按钮）时取消命令。如果在触发器仍处于活动状态时完成命令，该命令将*不*重新安排。

source: This binding schedules a command when a trigger changes from active to inactive (or, accordingly, when a button is initially released). The command will be scheduled on the iteration when the state changes, and will not be re-scheduled unless the trigger becomes active and then inactive again (or the button is pressed and then re-released).
es_mx: Este enlace programa un comando cuando un botón o gatillo cambia de activo a inactivo (o, en consecuencia, cuando se suelta inicialmente un botón). El comando se programará en la iteración cuando cambie el estado y no se reprogramará a menos que el botón o gatillo se active y luego se vuelva inactivo (o se presione el botón y luego se vuelva a soltar).
fr_ca: Cette liaison planifie une commande lorsqu’un déclencheur passe de l'état actif à l'état inactif (ou, en conséquence, lorsqu’un bouton est initialement libéré). La commande sera planifiée sur l’itération lorsque l’état change, et ne sera pas re-planifiée à moins que le déclencheur ne devienne actif, puis inactif à nouveau (ou le bouton est appuyé, puis re-relâché).
tr_tr: Bu bağlanma, bir tetikleyici aktif durumdan pasif duruma geçtiğinde (veya buna göre, bir buton ilk bırakıldığında) bir komutu zamanlar. Komut, durum değiştiğinde yinelemeye programlanacak ve tetik etkinleşene ve ardından tekrar devre dışı kalmadıkça (veya düğmeye basıp ardından yeniden bırakılmadıkça) yeniden programlanmayacaktır.
zh_cn: 当触发器从活动变为活动（或相应地，最初释放按钮时）时，此绑定调度命令。当状态改变时，该命令将在迭代中进行调度，除非触发器变为活动状态然后又变为非活动状态（或者按下按钮然后重新释放），否则不会重新调度该命令。

source: This binding toggles a command, scheduling it when a trigger changes from inactive to active (or a button is initially pressed), and canceling it under the same condition if the command is currently running. Note that while this functionality is supported, toggles are not a highly-recommended option for user control, as they require the driver to keep track of the robot state. The preferred method is to use two buttons; one to turn on and another to turn off. Using a `StartEndCommand <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/StartEndCommand.html>`__ or a `ConditionalCommand <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ConditionalCommand.html>`__ is a good way to specify the commands that you want to be want to be toggled between.
fr_ca: Cette liaison bascule une commande, la programmant lorsqu’un déclencheur passe de inactif à actif (ou un bouton est initialement appuyé), et l’annulant sous la même condition si la commande est actuellement en cours d’exécution. Notez que bien que cette fonctionnalité soit prise en charge, les basculements ne sont pas une option fortement recommandée pour le contrôle par l’utilisateur, car ils exigent que le pilote garde une trace de l’état du robot. La méthode préférée est d’utiliser deux boutons; l’un pour allumer et l’autre pour éteindre. L'usage d’une commande `StartEndCommand <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/StartEndCommand.html>`__ ou d'une commande `ConditionalCommand <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ConditionalCommand.html>`__ constitue un bon moyen de spécifier les commandes entre lesquelles vous vous basculer.
zh_cn: 此绑定可切换命令，在触发器从非活动状态更改为活动状态（或最初按下按钮时）进行调度，如果命令当前正在运行，则在相同条件下将其取消。请注意，虽然支持此功能，但对于用户控制而言，并不是非常推荐的切换选项，因为它们需要驱动程序来跟踪机器人状态。首选方法是使用两个按钮。一个打开，另一个关闭。使用`StartEndCommand <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/StartEndCommand.html>`__或`ConditionalCommand <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ConditionalCommand.html>`__是指定要在其间切换的命令的好方法。

source: This binding cancels a command when a trigger changes from inactive to active (or, accordingly, when a button is initially pressed). the command is canceled on the iteration when the state changes, and will not be canceled again unless the trigger becomes inactive and then active again (or the button is released and re-pressed). Note that canceling a command that is not currently running has no effect.
es_mx: Esta vinculación cancela un comando cuando un botón o gatillo cambia de inactivo a activo(o, en consecuencia, cuando un botón es presionado inicialmente). el comando es cancelado en la iteración cuando el estado cambia, y no será cancelado a menos que el botón o gatillo cambie de inactivo a activo de nuevo (o se suelte el botón y se vuelva a presionar). Note que cancelar un comando que no funciona al momento no tiene efecto.
fr_ca: Cette liaison annule une commande lorsqu'un déclencheur passe d'inactif à actif (ou, par conséquent, lorsqu'un bouton est initialement enfoncé). la commande est alors annulée lorsque l'état change. Elle ne sera pas annulée une seconde fois, sauf si le déclencheur devient inactif puis à nouveau actif (ou si le bouton est relâché et ré-enfoncé). Notez que l'annulation d'une commande qui n'est pas en cours d'exécution n'a aucun effet.
tr_tr: Bu bağlama, bir tetikleyici inaktif durumdan aktif duruma geçtiğinde (veya buna göre bir düğmeye ilk basıldığında) bir komutu iptal eder. durum değiştiğinde komut yinelemede iptal edilir ve tetik devre dışı kalmadıkça ve ardından tekrar etkinleşmedikçe (veya düğme bırakılıp yeniden basılmadıkça) tekrar iptal edilmeyecektir. Şu anda çalışmayan bir komutu iptal etmenin hiçbir etkisi olmadığını unutmayın.
zh_cn: 当触发器从非活动状态变为活动状态（或相应地，最初按下按钮时）时，此绑定会取消命令。当状态改变时，命令将在迭代中取消，除非触发器变为非活动状态然后再次活动（或释放并重新按下按钮），否则该命令将不会再次被取消。请注意，取消当前未运行的命令无效。

source: Binding a command to a joystick button
es_mx: Vincular un comando a un botón del joystick
fr_ca: Liaison d’une commande à un bouton joystick
tr_tr: Bir komutun bir oyun çubuğu düğmesine bağlanması
zh_cn: 将命令绑定到操纵杆按钮

source: The most-common way to trigger a command is to bind a command to a button on a joystick or other HID (human interface device). To do this, users should use the ``JoystickButton`` class.
es_mx: La manera más común para desencadenar un comando es vincular un comando a un botón en un joystick o algún otro DIH (dispositivo para intervención humana). Para hace resto , los usuarios deben de utilizar la clase ``JoystickButton``.
fr_ca: La façon la plus courante de déclencher une commande est de lier une commande à un bouton d’un joystick ou d’un autre HID (dispositif d’interface humaine). Pour ce faire, les utilisateurs doivent utiliser la classe ``JoystickButton``.
tr_tr: Bir komutu tetiklemenin en yaygın yolu, bir komutu bir kumanda kolundaki veya başka bir HID'deki (insan arayüz cihazı) bir düğmeye bağlamaktır. Bunu yapmak için kullanıcılar ``JoystickButton`` sınıfını kullanmalıdır.
zh_cn: 触发命令的最常见方法是将命令绑定到操纵杆或其他HID（人机界面设备）上的按钮。为此，用户应使用“JoystickButton”类。

source: Creating a JoystickButton
es_mx: Crear un JoystickButton
fr_ca: Création d’un JoystickButton
tr_tr: Bir JoystickButton Oluşturma
zh_cn: 创建一个JoystickButton

source: In order to create a ``JoystickButton``, we first need a Joystick. All types of joysticks (including gamepads) are represented in code by the ``GenericHID`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/GenericHID.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_generic_h_i_d.html>`__), or one of its subclasses:
fr_ca: Dans le but de créer un ``JoystickButton``, nous avons d'abord besoin d'un objet Joystick. Tous les types de manettes (y compris les manettes de jeu) sont représentés sous forme de code par la classe ``GenericHID`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/GenericHID.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_generic_h_i_d.html>`__), ou une de ses classes filles:

source: When creating a ``JoystickButton`` with an XboxController, it is usually a good idea to use the button enum (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/XboxController.Button.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/structfrc_1_1_xbox_controller_1_1_button.html>`__) to get the button number corresponding to a given button.
fr_ca: Lors de la création d’un ``JoystickButton`` avec un XboxController, il est généralement judicieux d’utiliser l’enum du bouton (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/XboxController.Button.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/structfrc_1_1_xbox_controller_1_1_button.html>`__) pour obtenir le numéro de bouton correspondant à un bouton donné.

source: After the joystick is instantiated, users can then pass it to a ``JoystickButton`` object (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/JoystickButton.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_joystick_button.html>`__):
fr_ca: Une fois le joystick est instancié, les utilisateurs peuvent ensuite le transmettre à un objet ``JoystickButton`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/JoystickButton.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_joystick_button.html>`__):

source: Binding a Command to a JoystickButton
es_mx: Vincular un comando a un JoystickButton
fr_ca: Liaison d’une commande à un JoystickButton
tr_tr: Bir Joystick butonuna Command Bağlama
zh_cn: 将命令绑定到JoystickButton

source: In the C++ command-based library, button objects *do not need to survive past the call to a binding method*, and so the binding methods may be simply called on a temp.
es_mx: En la biblioteca a base de comandos de C++ *no necesita llegar después de la llamada a un método de vinculación*, entonces los métodos de vinculación podrán ser llamados solamente de manera temporal.
fr_ca: Dans la bibliothèque orientée commande C++, les objets button *n’ont pas besoin de survivre après l’appel à une méthode de liaison*, de sorte que les méthodes de liaison peuvent être simplement appelées sur une temp.
tr_tr: C++ komut tabanlı kitaplıkta, düğme nesnelerinin *bir bağlama yöntemine* çağrıldıktan sonra devam etmesi gerekmez ve bu nedenle bağlama yöntemleri geçici olarak çağrılabilir.
zh_cn: 在基于C ++命令的库中，按钮对象*不需要在对绑定方法的调用之后存活*，因此可以简单地在临时对象上调用绑定方法。

source: Putting it all together, it is very simple to bind a button to a JoystickButton:
es_mx: Poniéndolo todo junto, es muy sencillo vincular un botón a un JoystickButton:
fr_ca: En mettant tout cela ensemble, il est très simple de lier un bouton à un JoystickButton:
tr_tr: Hepsini bir araya getirirsek, bir düğmeyi bir JoystickButton'a bağlamak çok kolaydır:
zh_cn: 放在一起，将按钮绑定到JoystickButton非常简单：
