Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/binding-commands-to-triggers.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: It is useful to note that the command binding methods all return the trigger/button that they were initially called on, and thus can be chained to bind multiple commands to different states of the same button. For example:
es_mx: Es útil notar que los métodos de vinculación de comandos todos devuelven el gatillo/botón al cual fueron inicialmente vinculados a , entonces puede ser encadenado a vincular múltiples comandos a diferentes estados del mismo botón. Por ejemplo:
fr_ca: Il est utile de noter que les méthodes de liaison de commande renvoient toutes le déclencheur/bouton sur lequel elles ont été initialement appelées, et peuvent donc être enchaînées pour lier plusieurs commandes à différents états du même bouton. Par exemple:
tr_tr: Komut bağlama yöntemlerinin hepsinin başlangıçta çağrıldıkları tetiği / düğmeyi döndürdüğünü ve bu nedenle birden fazla komutu aynı düğmenin farklı durumlarına bağlamak için zincirlenebileceğini not etmek yararlıdır. Örneğin:
zh_cn: 值得注意的是，命令绑定方法都返回最初被调用的触发器/按钮，因此可以链接起来将多个命令绑定到同一按钮的不同状态。例如：

source: Remember that button binding is *declarative*: bindings only need to be declared once, ideally some time during robot initialization. The library handles everything else.
es_mx: Recuerde que la vinculación de botones es *declarativa*: los vínculos solo se necesitan declarar una vez, idealmente durante la inicialización del robot. La biblioteca maneja el resto.
fr_ca: N’oubliez pas que la liaison des boutons est *déclarative*: les liaisons ne doivent être déclarées qu’une seule fois, idéalement pendant l’initialisation du robot. La bibliothèque gère tout le reste.
tr_tr: Düğme bağlamanın *declarative - bildirime dayalı* olduğunu unutmayın: bağlamaların yalnızca bir kez, ideal olarak robot başlatma sırasında bir süre bildirilmesi gerekir. Kütüphane diğer her şeyi halleder.
zh_cn: 请记住，按钮绑定是“声明式”的：绑定只需要声明一次，理想情况下是在机器人初始化期间声明一次。该库处理其他所有事务。

source: Composing Triggers
es_mx: Componer botones
fr_ca: Composition de déclencheurs
tr_tr: Tetikleyicileri Oluşturma
zh_cn: 构成触发器

source: The ``Trigger`` class (including its ``Button`` subclasses) can be composed to create composite triggers through the ``and()``, ``or()``, and ``negate()`` methods (or, in C++, the ``&&``, ``||``, and ``!`` operators). For example:
es_mx: La clase ``Trigger``(incluye sus subclases ``Button``) puede estar compuesta para crear botones compuestos a través de los métodos ``and()``, ``or()``, y ``negate()`` (o, en C++, los operadores ``&&``, ``||``, y ``!`` ). Por ejemplo:
fr_ca: La classe ``Trigger`` (incluant ses sous-classes ``Button``) peut être composée pour créer des déclencheurs composites à travers les méthodes ``and()``, ``or()``, et ``negate()`` (ou, en C++, les opérateurs ``&&``, ``||``, et ``!`` ). Par exemple :
tr_tr: ``Trigger`` sınıfı (``Button`` alt sınıfları dahil), ``and()``, ``or()`` ve ``negate()`` yöntemleri aracılığıyla bileşik tetikleyiciler oluşturmak için kullanılabilir (veya C++ 'da ``&&``, ``||``, ve ``!`` operatörleri). Örneğin:
zh_cn: “Trigger”类（包括其“Button”子类）可以通过“and()”，“or()”和“negate()”组成复合触发器来创建方法（或在C ++中为“&&”，“||”和“!”运算符）。例如：

source: Note that these methods return a ``Trigger``, not a ``Button``, so the ``Trigger`` binding method names must be used even when buttons are composed.
es_mx: Note que estos métodos devuelven un ``Trigger``, no un ``Button``, entonces los nombres de métodos de vinculación ``Trigger`` deben ser usados cuando los botones se componen.
fr_ca: Notez que ces méthodes renvoient un ``Trigger``, pas un ``Button``, de sorte que les noms de méthode de liaison ``Trigger`` doivent être utilisés même lorsque les boutons sont composés.
tr_tr: Bu yöntemlerin bir ``Button`` değil, bir ``Trigger`` döndürdüğüne dikkat edin, bu nedenle ``Trigger`` bağlama yöntemi adlarının düğmeler oluşturulsa bile kullanılması gerekir.
zh_cn: 请注意，这些方法返回的是“Trigger”，而不是“Button”，因此即使组成按钮，也必须使用“Trigger”绑定方法名称。

source: Debouncing Triggers
fr_ca: Déclencheurs anti-rebonds

source: To avoid rapid repeated activation, triggers (especially those originating from digital inputs) can be debounced with the :ref:`WPILib Debouncer class <docs/software/advanced-controls/filters/debouncer:Debouncer>` using the `debounce` method:
fr_ca: Pour éviter une activation répétée rapide, les déclencheurs (en particulier ceux provenant d’entrées numériques) peuvent être traités par des filtres anti-rebonds à l'aide de la :ref:`classe Debouncer de la WPILIb <docs/software/advanced-controls/filters/debouncer:Debouncer>` par l'intérmédiaire de sa méthode `debounce` :

source: Creating Your Own Custom Trigger
es_mx: Crear tu botón personalizado
fr_ca: Création de votre propre déclencheur personnalisé
tr_tr: Kendi Özel Tetikleyicinizi Oluşturma
zh_cn: 创建自己的自定义触发器

source: While binding to HID buttons is by far the most common use case, advanced users may occasionally want to bind commands to arbitrary triggering events. This can be easily done by simply writing your own subclass of ``Trigger`` or ``Button``:
fr_ca: Bien que la liaison aux boutons HID soit de loin le cas d'utilisation le plus courant, les utilisateurs avancés peuvent parfois vouloir lier des commandes à des événements déclencheurs arbitraires. Cela peut être facilement fait en écrivant simplement votre propre sous-classe de ``Trigger`` ou ``Button`` :

source: Alternatively, this can also be done inline by passing a lambda to the constructor of ``trigger`` or ``button``:
es_mx: Alternativamente, esto también se puede realizar en línea pasando un lambda al constructor de un ``trigger`` o un ``button``:
fr_ca: Alternativement, cela peut également être fait en ligne en passant un lambda au constructeur de ``trigger`` ou ``button``:
tr_tr: Alternatif olarak, bu aynı zamanda ``trigger`` veya ``buton`` yapıcısına bir lambda geçirilerek de yapılabilir:
zh_cn: 或者，也可以通过将lambda传递给“trigger”或“button”的构造函数来内联完成：

source: As mentioned earlier, command-based is a `declarative <https://en.wikipedia.org/wiki/Declarative_programming>`__ paradigm. Accordingly, binding buttons to commands is done declaratively; the association of a button and a command is “declared” once, during robot initialization. The library then does all the hard work of checking the button state and scheduling (or canceling) the command as needed, behind-the-scenes. Users only need to worry about designing their desired UI setup - not about implementing it!
es_mx: Como se mencionó anteriormente, basado en comandos es un paradigma `declarativo <https://en.wikipedia.org/wiki/Declarative_programming>` __. En consecuencia, la vinculación de botones a comandos se realiza de forma declarativa; la asociación de un botón y un comando se “declara” una vez, durante la inicialización del robot. Luego, la biblioteca hace todo el trabajo duro de verificar el estado del botón y programar (o cancelar) el comando según sea necesario, detrás de escena. Los usuarios solo deben preocuparse por diseñar la configuración de interfaz de usuario deseada, ¡no por implementarla!
tr_tr: Daha önce de belirtildiği gibi, komut tabanlı bir `bildirim temelli <https://en.wikipedia.org/wiki/Declarative_programming>`__ paradigmasıdır. Buna göre, düğmeleri komutlara bağlamak bildirimsel olarak yapılır; Robotun başlatılması sırasında bir düğme ve bir komutun ilişkilendirilmesi bir kez "declared-bildirilir". Kütüphane daha sonra düğme durumunu kontrol etmek ve komutun perde arkasında gerektiği gibi zamanlanması (veya iptal edilmesi) için tüm zor işi yapar. Kullanıcıların yalnızca istedikleri UI kurulumunu tasarlama konusunda endişelenmeleri gerekir - uygulama konusunda değil!

source: Command binding is done through the ``Trigger`` class (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/button/Trigger.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1Trigger.html>`__) and its various ``Button`` subclasses (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/button/Button.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1Button.html>`__).
es_mx: El enlace de comandos se realiza a través de la clase ``Trigger`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/button/Trigger.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1Trigger.html>`__) y sus diversas subclases de `` Button`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/button/Button.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1Button.html>`__).
tr_tr: Komut binding, ``Trigger`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/button/Trigger.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1Trigger.html>`__) ve çeşitli ``Button`` alt sınıfları (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/button/Button.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1Button.html>`__) aracılığıyla yapılır.

source: The C++ command-based library offers two overloads of each button binding method - one that takes a forwarding reference, and one that takes a raw pointer. The forwarding reference overload transfers ownership (by either moving or copying depending on if the command is an `rvalue or and lvalue <http://thbecker.net/articles/rvalue_references/section_01.html>`__) to the scheduler, while the raw pointer overload leaves the user responsible for the lifespan of the command object. It is recommended that users preferentially use the forwarding reference overload unless there is a specific need to retain a handle to the command in the calling code.
es_mx: La biblioteca basada en comandos de C++ ofrece dos sobrecargas de cada método de enlace de botón: una que toma una referencia de reenvío y otra que toma un puntero sin formato. La sobrecarga de referencia de reenvío transfiere la propiedad (ya sea moviendo o copiando dependiendo de si el comando es un `rvalue o un lvalue <http://thbecker.net/articles/rvalue_references/section_01.html>` __) al programador, mientras que la sobrecarga del puntero sin formato deja al usuario responsable de la vida útil del objeto de comando. Se recomienda que los usuarios usen preferentemente la sobrecarga de referencia de reenvío a menos que exista una necesidad específica de retener un identificador para el comando en el código de llamada.
tr_tr: C++ komut tabanlı kitaplık, her düğme bağlama yönteminin iki detaylı çalışmasını sunar - biri yönlendirme başvurusu alır, diğeri ise ham işaretçi alır. İletim referansı, sahipliği (komutun bir `rvalue veya ve lvalue <http://thbecker.net/articles/rvalue_references/section_01.html>`__ olup olmadığına bağlı olarak hareket ettirerek veya kopyalayarak) zamanlayıcıya aktarırken, ham işaretçi aşırı yüklemesi kullanıcıyı komut nesnesinin çalıştırma süresinde sorumlu kılar. Çağrılan kodda komutun bir tutamacını tutmaya özel bir ihtiyaç olmadığı sürece, kullanıcıların tercihli olarak yönlendirme referansı aşırı yüklemesini kullanmaları önerilir.
zh_cn: 基于C ++命令的库为每种按钮绑定方法提供了两种重载——一种采用转发引用，另一种采用原始指针。转发参考重载将所有权（通过移动或复制，取决于命令是`rvalue or and lvalue <http://thbecker.net/articles/rvalue_references/section_01.html>`__）转移到调度程序，而原始指针重载则使用户对命令对象的寿命负责。建议用户优先使用转发参考重载，除非特别需要在调用代码中保留命令的句柄。

source: This binding toggles a command, scheduling it when a trigger changes from inactive to active (or a button is initially pressed), and canceling it under the same condition if the command is currently running. Note that while this functionality is supported, toggles are *not* a highly-recommended option for user control, as they require the driver to mentally keep track of the robot state.
es_mx: Esta vinculación alterna un comando, programándolo cuando un botón cambia de inactivo a activo (o se presiona un botón inicialmente) y cancelando en la misma condición si el comando se está ejecutando actualmente. Tenga en cuenta que, aunque se admite esta funcionalidad, los conmutadores *no* son una opción muy recomendada para el control del usuario, ya que requieren que el conductor realice un seguimiento mental del estado del robot.

source: In order to create a ``JoystickButton``, we first need a Joystick. All types of joysticks (including gamepads) are represented in code by the ``GenericHID`` class (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/GenericHID.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1GenericHID.html>`__), or one of its subclasses:
es_mx: Para crear un ``JoystickButton``, necesitamos primero un Joystick. Todo tipo de Joysticks (incluyendo gamepads) son representados en el código por la clase ``GenericHID`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/GenericHID.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1GenericHID.html>`__), o alguna de sus subclases.
tr_tr: Bir ``JoystickButton`` oluşturmak için öncelikle bir Joystick'e ihtiyacımız var. Tüm oyun çubuğu türleri (oyun kumandaları dahil) kodda ``GenericHID`` sınıfı (`Java<https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/GenericHID.html>`__, `C++<https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1GenericHID.html>`__) veya alt sınıflarından biri tarafından temsil edilir:

source: When creating a ``JoystickButton`` with an XboxController, it is usually a good idea to use the button enum (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/XboxController.Button.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1XboxController.html#a1034633d4be2db9277b3864efa55b99b>`__) to get the button number corresponding to a given button.
es_mx: Al crear un ``JoystickButton`` con un XboxController, usualmente es una buena idea utilizar el botón enum (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/XboxController.Button.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1XboxController.html#a1034633d4be2db9277b3864efa55b99b>`__) para obtener el número de botón correspondiente al botón a vincular.
tr_tr: Bir XboxController ile bir ``JoystickButton`` oluştururken, belirli bir düğmeye karşılık gelen düğme numarasını almak için düğme numaralandırmasını (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/XboxController.Button.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1XboxController.html#a1034633d4be2db9277b3864efa55b99b>`__) kullanmak genellikle iyi bir fikirdir.

source: After the joystick is instantiated, users can then pass it to a ``JoystickButton`` object (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/button/JoystickButton.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1JoystickButton.html>`__):
es_mx: Después que el joystick fue instanciado, los usuarios pueden pasarlo a un objeto ``JoystickButton`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/button/JoystickButton.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1JoystickButton.html>`__):
tr_tr: Joystick başlatıldıktan sonra, kullanıcılar bunu bir ``JoystickButton`` nesnesine (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/button/JoystickButton.html>`__, `C++<https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1JoystickButton.html>`__) aktarabilir:

source: While binding to HID buttons is by far the most common use case, advanced users may occasionally want to bind commands to arbitrary triggering events. This can be easily done by simply writing your own subclass of ``trigger`` or ``button``:
es_mx: Si bien la vinculación a botones HID es, con mucho, el caso de uso más común, es posible que los usuarios avanzados ocasionalmente deseen vincular comandos a eventos de activación arbitrarios. Esto se puede hacer fácilmente simplemente escribiendo su propia subclase de ``trigger`` o ``button``:
tr_tr: HID düğmelerine bağlanma en yaygın kullanım durumu olsa da, ileri düzey kullanıcılar bazen komutları rastgele tetikleme olaylarına bağlamak isteyebilir. Bu, kendi ``trigger`` veya ``button`` alt sınıfınızı yazarak kolayca yapılabilir:
zh_cn: 尽管绑定到HID按钮是最常见的用例，但是高级用户有时可能希望将命令绑定到任意触发事件。只需编写自己的“trigger”或“button”子类即可轻松完成此操作：

source: Command binding is done through the ``Trigger`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/Trigger.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Trigger.html>`__) and its various ``Button`` subclasses (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/Button.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Button.html>`__).
zh_cn: 通过Trigger类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/Trigger.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Trigger.html>`__）和其各种Button类（Java Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/Button.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Button.html>`__）完成命令绑定。

source: In order to create a ``JoystickButton``, we first need a Joystick. All types of joysticks (including gamepads) are represented in code by the ``GenericHID`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/GenericHID.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1GenericHID.html>`__), or one of its subclasses:
zh_cn: 为了创建一个``游戏摇杆按钮''，我们首先需要一个游戏杆。所有类型的操纵杆（包括游戏手柄）均由GenericHID类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/GenericHID.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1GenericHID.html>`__）或其中一个子类表示：

source: When creating a ``JoystickButton`` with an XboxController, it is usually a good idea to use the button enum (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/XboxController.Button.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1XboxController.html#a1034633d4be2db9277b3864efa55b99b>`__) to get the button number corresponding to a given button.
zh_cn: 当使用XboxController创建``JoystickButton''时，通常最好使用按钮枚举（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/XboxController.Button.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1XboxController.html#a1034633d4be2db9277b3864efa55b99b>`__）获取与给定按钮相对应的按钮编号。

source: After the joystick is instantiated, users can then pass it to a ``JoystickButton`` object (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/JoystickButton.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1JoystickButton.html>`__):
zh_cn: 实例化操纵杆之后，用户可以将其传递到“ JoystickButton”对象（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/button/JoystickButton.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1JoystickButton.html>`__）：
