Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/commands.po
Languages: fr_ca, tr_tr

source: Similarly to subsystems, the recommended method for most users to create a command is to subclass the abstract ``CommandBase`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandBase.html>`__), as seen in the command-based template (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/commands/ExampleCommand.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/commands/ExampleCommand.h>`__):
tr_tr: Alt sistemlere benzer şekilde, çoğu kullanıcının bir komut oluşturması için önerilen yöntem, soyut " CommandBase`` sınıfını alt sınıflara ayırmaktır. (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandBase.html>`__), as seen in the command-based template (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/commands/ExampleCommand.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/commands/ExampleCommand.h>`__):

source: The ``initialize()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#initialize()>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ad3f1971a1b44ecdd4683d766f831bccd>`__) is run exactly once per time a command is scheduled, as part of the scheduler’s ``schedule()`` method. The scheduler’s ``run()`` method does not need to be called for the ``initialize()`` method to run. The initialize block should be used to place the command in a known starting state for execution. It is also useful for performing tasks that only need to be performed once per time scheduled, such as setting motors to run at a constant speed or setting the state of a solenoid actuator.
tr_tr: ``initialize()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#initialize()>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ad3f1971a1b44ecdd4683d766f831bccd>`__) , zamanlayıcının ``schedule()`` methodunun bir parçası olarak, bir komut zamanlandığında tam olarak bir kez çalıştırılır. Planlayıcının ``run()`` yönteminin, ``initialize()`` yönteminin çalışması için çağrılmasına gerek yoktur. Başlatma bloğu, komutu yürütme için bilinen bir başlangıç durumuna yerleştirmek için kullanılmalıdır. Motorları sabit bir hızda çalışacak şekilde ayarlamak veya bir solenoid aktüatörün durumunu ayarlamak gibi programlanan zamanda yalnızca bir kez gerçekleştirilmesi gereken görevleri gerçekleştirmek için de kullanışlıdır.

source: The ``execute()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#execute()>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a7d7ea1271f7dcc65c0ba3221d179b510>`__) is called repeatedly while the command is scheduled, whenever the scheduler’s ``run()`` method is called (this is generally done in the main robot periodic method, which runs every 20ms by default). The execute block should be used for any task that needs to be done continually while the command is scheduled, such as updating motor outputs to match joystick inputs, or using the output of a control loop.
tr_tr: ``execute()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#execute()>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a7d7ea1271f7dcc65c0ba3221d179b510>`__), zamanlayıcının ``run()`` yöntemi çağrıldığında, komut zamanlanırken tekrar tekrar çağrılır (bu genellikle varsayılan olarak her 20 ms'de bir çalışan ana robot periyodik yöntemi). Yürütme bloğu, motor çıkışlarını kumanda kolu girişleriyle eşleşecek şekilde güncelleme veya bir kontrol döngüsünün çıkışını kullanma gibi komut programlanırken sürekli olarak yapılması gereken herhangi bir görev için kullanılmalıdır.

source: The ``end()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#end(boolean)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a134eda3756f00c667bb5415b23ee920c>`__) is called once when the command ends, whether it finishes normally (i.e. ``isFinished()`` returned true) or it was interrupted (either by another command or by being explicitly canceled). The method argument specifies the manner in which the command ended; users can use this to differentiate the behavior of their command end accordingly. The end block should be used to “wrap up” command state in a neat way, such as setting motors back to zero or reverting a solenoid actuator to a “default” state.
tr_tr: ``end()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#end(boolean)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a134eda3756f00c667bb5415b23ee920c>`__), komut normal şekilde bittiğinde (yani ``isFinished()`` doğru döndürüldüğünde) veya kesintiye uğradığında bir kez çağrılır (başka bir komutla veya açıkça iptal edilerek). Yöntem argümanı, komutun sona erme şeklini belirtir; kullanıcılar bunu komut sonlarının davranışını buna göre ayırt etmek için kullanabilir. Uç blok, komut durumunu düzgün bir şekilde “wrap up-sarmak” için kullanılmalıdır, örneğin motorları sıfıra geri getirmek veya bir solenoid aktüatörü “default-varsayılan” duruma döndürmek gibi.

source: The ``isFinished()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#end(boolean)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#af5e8c12152d195a4f3c06789366aac88>`__) is called repeatedly while the command is scheduled, whenever the scheduler’s ``run()`` method is called. As soon as it returns true, the command’s ``end()`` method is called and it is un-scheduled. The ``isFinished()`` method is called *after* the ``execute()`` method, so the command *will* execute once on the same iteration that it is un-scheduled.
tr_tr: ``isFinished()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#end(boolean)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#af5e8c12152d195a4f3c06789366aac88>`__), zamanlayıcının ``run()`` methodu her çağrıldığında, komut zamanlanırken tekrar tekrar çağrılır. True döndürür döndürmez, komutun ``end()`` yöntemi çağrılır ve planlanmamış olur. `` İsFinished () '' yöntemi, ``execute()`` yönteminden *after-sonra* çağrılır, bu nedenle komut, *zamanlanmamış* olduğu aynı yinelemede bir kez çalıştırılacaktır.
