Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/command-groups.po
Languages: fr_ca, tr_tr

source: Command Groups
fr_ca: Groupes de commandes
tr_tr: Komut Grupları-Command Groups

source: Individual commands are capable of accomplishing a large variety of robot tasks, but the simple three-state format can quickly become cumbersome when more advanced functionality requiring extended sequences of robot tasks or coordination of multiple robot subsystems is required. In order to accomplish this, users are encouraged to use the powerful command group functionality included in the command-based library.
fr_ca: Les commandes individuelles sont capables d’accomplir une grande variété de tâches du robot, mais le format simple à trois états peut rapidement devenir lourd lorsque des fonctionnalités plus avancées nécessitant des séquences étendues de tâches de robot ou la coordination de sous-systèmes du robot multiples est nécessaire. Pour ce faire, les utilisateurs sont encouragés à utiliser la puissante fonctionnalité du groupe de commandes incluse dans la bibliothèque orientée commande.
tr_tr: Tek tek komutlar çok çeşitli robot görevlerini yerine getirme yeteneğine sahiptir, ancak basit üç durumlu format, genişletilmiş robot görevleri dizilerini veya birden fazla robot alt sisteminin koordinasyonunu gerektiren daha gelişmiş işlevsellik gerektiğinde hızla hantal hale gelebilir. Bunu başarmak için, kullanıcıların komut tabanlı kitaplıkta bulunan güçlü komut grubu işlevini kullanmaları önerilir.

source: As the name suggests, command groups are combinations of multiple commands. The act of combining multiple objects (such as commands) into a bigger object is known as `composition <https://en.wikipedia.org/wiki/Object_composition>`__. Command groups *compose* multiple commands into a *composite* command. This allows code to be kept much cleaner and simpler, as the individual *component* commands may be written independently of the code that combines them, greatly reducing the amount of complexity at any given step of the process.
fr_ca: Comme son nom l’indique, les groupes de commandes sont des combinaisons de commandes multiples. L’acte de combiner plusieurs objets (telles que des commandes) dans un objet plus grand est connu sous le nom de `composition <https://en.wikipedia.org/wiki/Object_composition>`__. Les groupes de commandes *composent* plusieurs commandes dans une commande *composite*. Cela permet de garder le code beaucoup plus propre et plus simple, car les commandes individuelles *composantes* peuvent être conçues indépendamment du code qui les combine, réduisant considérablement la quantité de complexité à n'importe quelle étape donnée du processus.
tr_tr: Adından da anlaşılacağı gibi, komut grupları birden çok komutun birleşimidir. Birden çok nesneyi (komutlar gibi) daha büyük bir nesnede birleştirme eylemi, ``kompozisyon<https://en.wikipedia.org/wiki/Object_composition>`__ olarak bilinir. Komut grupları birden çok komutu *birleşik-composite* komuta dönüştürür. Bu, kodun çok daha temiz ve daha basit tutulmasına izin verir, çünkü ayrı *component* komutları onları birleştiren koddan bağımsız olarak yazılabilir ve işlemin herhangi bir adımında karmaşıklık miktarını büyük ölçüde azaltır.

source: Most importantly, however, command groups *are themselves commands* - they implement the ``Command`` interface. This allows command groups to be `recursively composed <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__ - that is, a command group may contain *other command groups* as components.
fr_ca: Plus important encore, cependant, les groupes de commandes *sont eux-mêmes des commandes* - ils implémentent l’interface ``Command``. Cela permet aux groupes de commandes d’être `récursivement composés <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__ - c’est-à-dire qu’un groupe de commandes peut contenir *d’autres groupes de commandes* comme composants.
tr_tr: Ancak en önemlisi, komut grupları *kendileri komutlardır* - ``Command`` arayüzünü uygularlar. Bu, komut gruplarının `özyinelemeli olarak oluşturulmasına izin verir<https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__ - yani, bir komut grubu bileşen olarak *diğer komut gruplarını* içerebilir.

source: Types of Command Groups
fr_ca: Types de groupes de commandes
tr_tr: Komut Gruplarının Türleri

source: In the C++ command-based library, command groups *own* their component commands. This means that commands passed to command groups will be either moved or copied depending on whether they are rvalues or lvalues (`rvalue/lvalue explanation <http://thbecker.net/articles/rvalue_references/section_01.html>`__). Due to certain technical concerns, command groups themselves are not copyable, and so recursive composition *must* use move semantics.
fr_ca: Dans la bibliothèque orientée commandes C++, les groupes de commandes *possèdent* les commandes qui les composent. Cela signifie que les commandes transmises aux groupes de commandes seront soit déplacées si ce sont des *rvalues*, ou bien copiées s'il s’agit de *lvalues* (`explication sur les rvalues et les lvalues <http://thbecker.net/articles/rvalue_references/section_01.html>`__). En raison de certaines préoccupations techniques, les groupes de commande eux-mêmes ne peuvent pas être copiés, et donc la composition récursive *doit* utiliser la sémantique de déplacement.
tr_tr: C++ komut tabanlı kitaplıkta, komut grupları kendi bileşen komutlarına *sahiptirler*. Bu, komut gruplarına aktarılan komutların rvalue veya lvalue olmalarına bağlı olarak taşınacağı veya kopyalanacağı anlamına gelir (`rvalue/lvalue açıklaması<http://thbecker.net/articles/rvalue_references/section_01.html>`__). Belirli teknik kaygılardan dolayı, komut gruplarının kendileri kopyalanamaz ve bu nedenle yinelemeli kompozisyon *hareket semantiğini kullanmalıdır*.

source: The command-based library supports four basic types of command groups: ``SequentialCommandGroup``, ``ParallelCommandGroup``, ``ParallelRaceGroup``, and ``ParallelDeadlineGroup``. Each of these command groups combines multiple commands into a composite command - however, they do so in different ways:
fr_ca: La bibliothèque orientée commande prend en charge quatre types de groupes de commandes de base : ``SequentialCommandGroup``, ``ParallelCommandGroup``, ``ParallelRaceGroup``, et ``ParallelDeadlineGroup``. Chacun de ces groupes de commandes combine plusieurs commandes dans une commande composite - cependant, ils le font de différentes façons :
tr_tr: Komut tabanlı kütüphane, dört temel komut grubu türünü destekler: ``SequentialCommandGroup``, ``ParallelCommandGroup``, ``ParallelRaceGroup`` ve ``ParallelDeadlineGroup``. Bu komut gruplarının her biri birden çok komutu birleşik bir komutta birleştirir - ancak bunu farklı şekillerde yaparlar:

source: A ``SequentialCommandGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SequentialCommandGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_sequential_command_group.html>`__) runs a list of commands in sequence - the first command will be executed, then the second, then the third, and so on until the list finishes. The sequential group finishes after the last command in the sequence finishes. It is therefore usually important to ensure that each command in the sequence does actually finish (if a given command does not finish, the next command will never start!).
fr_ca: Une commande de type ``SequentialCommandGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SequentialCommandGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_sequential_command_group.html>`__) exécute une liste de commandes dans l’ordre - la première commande sera exécutée, puis la seconde, puis la troisième, et ainsi de suite jusqu’à ce que la liste se termine. L'exécution des commandes du groupe séquentiel se termine après que se termine l'exécution de la dernière commande de la séquence. Il est donc généralement important de s’assurer que l'exécution de chaque commande de la séquence se termine réellement (si l'exécution d'une commande donnée ne se termine pas, l'éxécution de la commande suivante ne commencera jamais!).

source: A ``ParallelCommandGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelCommandGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_parallel_command_group.html>`__) runs a set of commands concurrently - all commands will execute at the same time. The parallel group will end when all commands have finished.
fr_ca: Une commande de type ``ParallelCommandGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelCommandGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_parallel_command_group.html>`__) permet d'exécuter un ensemble de commandes simultanément - toutes les commandes s’exécuteront en même temps. L'exécution de l'ensemble des commandes composant le groupe parallèle prendra fin lorsque l'exécution de chacune des commandes sera terminée.

source: A ``ParallelRaceGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelRaceGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_parallel_race_group.html>`__) is much like a ``ParallelCommandgroup``, in that it runs a set of commands concurrently. However, the race group ends as soon as any command in the group ends - all other commands are interrupted at that point.
fr_ca: Une commande de type ``ParallelRaceGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelRaceGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_parallel_race_group.html>`__) ressemble beaucoup à un `ParallelCommandgroup``, en ce sens qu’il exécute un ensemble de commandes simultanément. Toutefois, l'exécution des commandes composant le groupe de commandes en course se termine dès que l'exécution de n'importe quelle commande dans le groupe se termine - toutes les autres commandes sont interrompues à ce moment-là.

source: A ``ParallelDeadlineGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelDeadlineGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_parallel_deadline_group.html>`__) also runs a set of commands concurrently. However, the deadline group ends when a *specific* command (the "deadline") ends, interrupting all other commands in the group that are still running at that point.
fr_ca: Une commande de type ``ParallelDeadlineGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelDeadlineGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_parallel_deadline_group.html>`__) exécute également un ensemble de commandes simultanément. Toutefois, l'exécution des commandes composant le groupe de commande en deadline se termine lorsqu’une commande *spécifique* (le "deadline") voit son exécution se terminer, interrompant toutes les autres commandes du groupe qui sont encore en cours d’exécution à ce moment-là.

source: Creating Command Groups
fr_ca: Créer des groupes de commandes
tr_tr: Komut Grupları Oluşturma

source: Users have several options for creating command groups. One way - similar to the previous implementation of the command-based library - is to subclass one of the command group classes. Consider the following from the Hatch Bot example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):
fr_ca: Les utilisateurs ont plusieurs options pour créer des groupes de commandes. Une façon - similaire à la mise en œuvre précédente de la librairie orientée commande - est de sous-classer l’une des classes des groupes de commandes. Considérez ce qui suit extrait du projet Hatch Bot exemple (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):

source: C++ (Header)
fr_ca: C++ (Header ou en-tête)

source: The ``addCommands()`` method adds commands to the group, and is present in all four types of command group.
fr_ca: La méthode ``addCommands()`` ajoute des commandes au groupe et est présente dans les quatre types de groupes de commandes.
tr_tr: ``addCommands()`` yöntemi, gruba komutlar ekler ve dört tür komut grubunun hepsinde mevcuttur.

source: Inline Command Groups
fr_ca: Groupes de commandes en une seule ligne
tr_tr: Satır İçi Komut Grupları

source: Due to the verbosity of Java's ``new`` syntax, the Java ``CommandGroupBase`` object offers a factory method for each of the four command-group types: `sequence <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#sequence(edu.wpi.first.wpilibj2.command.Command...)>`__, `parallel <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#parallel(edu.wpi.first.wpilibj2.command.Command...)>`__, `race <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#race(edu.wpi.first.wpilibj2.command.Command...)>`__, and `deadline <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#deadline(edu.wpi.first.wpilibj2.command.Command,edu.wpi.first.wpilibj2.command.Command...)>`__.
fr_ca: En raison de la verbosité de la syntaxe ``new`` de Java, l’objet Java ``CommandGroupBase`` offre une méthode clé en main pour chacun des quatre types de groupes de commandes: `sequence <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#sequence(edu.wpi.first.wpilibj2.command.Command...)>`__, `parallel <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#parallel(edu.wpi.first.wpilibj2.command.Command...)>`__, `race <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#race(edu.wpi.first.wpilibj2.command.Command...)>`__, and `deadline <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#deadline(edu.wpi.first.wpilibj2.command.Command,edu.wpi.first.wpilibj2.command.Command...)>`__.

source: Command groups can be used without subclassing at all: one can simply pass in the desired commands through the constructor:
fr_ca: Les groupes de commande peuvent être utilisés sans la création de sous-classes : on peut simplement passer les commandes souhaitées dans le constructeur :
tr_tr: Komut grupları, alt sınıflandırma olmadan kullanılabilir: biri, istenen komutları consturctor aracılığıyla kolayca geçirebilir:

source: This is called an :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>` command definition, and is very handy for circumstances where command groups are not likely to be reused, and writing an entire class for them would be wasteful.
fr_ca: C’est ce qu’on appelle une définition de commande :ref:`en une seule ligne <docs/software/commandbased/convenience-features:Inline Command Definitions>` : cela est très pratique pour des situations où les groupes de commandes ne sont pas susceptibles d’être réutilisés, et où écrire une classe entière pour ces groupes serait inutile.
tr_tr: Buna :ref:'satır içi-inline <docs/software/commandbased/convenience-features:Inline Command Definitions>' komut tanımı denir ve komut gruplarının yeniden kullanılmasının muhtemel olmadığı ve onlar için bütün bir sınıf yazmak gereksiz olacağı durumlar için çok kullanışlıdır.

source: Recursive Composition of Command Groups
fr_ca: Composition récursive des groupes de commandes
tr_tr: Komut Gruplarının Yinelemeli Kompozisyonu

source: As mentioned earlier, command groups are `recursively composable <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__ - since command groups are themselves commands, they may be included as components of other command groups. This is an extremely powerful feature of command groups, and allows users to build very complex robot actions from simple pieces. For example, consider the following code:
fr_ca: Comme mentionné précédemment, les groupes de commandes peuvent être `composer récursivement <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__ - puisque les groupes de commandes sont eux-mêmes des commandes, ils peuvent être inclus comme composantes d’autres groupes de commandes. Il s’agit d’une caractéristique extrêmement puissante des groupes de commandes, et permet aux utilisateurs de construire des actions de robots très complexes à partir de pièces simples. Par exemple, considérez le code suivant :
tr_tr: Daha önce bahsedildiği gibi, komut grupları `özyinelemeli olarak oluşturulabilir<https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__ - komut gruplarının kendileri komutlar olduğundan, diğer komut gruplarının bileşenleri olarak dahil edilebilirler. Bu, komut gruplarının son derece güçlü bir özelliğidir ve kullanıcıların basit parçalardan çok karmaşık robot eylemleri oluşturmasına olanak tanır. Örneğin, aşağıdaki kodu göz önünde bulundurun:

source: This creates a sequential command group that *contains* a parallel command group. The resulting control flow looks something like this:
fr_ca: Cela crée un groupe de commandes séquentiel qui *contient* un groupe de commandes parallèle. Le flux d'exécution qui en résulte ressemble à ceci :
tr_tr: Bu, paralel bir komut grubu *içeren* sıralı bir komut grubu oluşturur. Ortaya çıkan kontrol akışı şuna benzer:

source: command group with concurrency
fr_ca: groupe de commandes avec accès concurrentiel

source: Notice how the recursive composition allows the embedding of a parallel control structure within a sequential one. Notice also that this entire, more-complex structure, could be again embedded in another structure. Composition is an extremely powerful tool, and one that users should be sure to use extensively.
fr_ca: Remarquez comment la composition récursive permet l’intégration d’une structure de contrôle parallèle à l'intérieur d'une structure séquentielle. Notez également que cette structure entière, plus complexe, pourrait être à nouveau intégrée dans une autre structure. La composition est un outil extrêmement puissant : les utilisateurs doivent s'assurer de l’utiliser autant que possible.
tr_tr: Yinelemeli kompozisyonun, sıralı bir kontrol yapısının içine paralel bir kontrol yapısının gömülmesine nasıl izin verdiğine dikkat edin. Ayrıca, bu daha karmaşık yapının tamamının başka bir yapıya gömülebileceğine de dikkat edin. Kompozisyon, son derece güçlü bir araçtır ve kullanıcıların yoğun şekilde kullanacağından emin olmalıdır.

source: Command Groups and Requirements
fr_ca: Groupes de commandes et exigences
tr_tr: Komut Grupları ve Gereksinimler

source: As command groups are commands, they also must declare their requirements. However, users are not required to specify requirements manually for command groups - requirements are automatically inferred from the commands included. As a rule, *command groups include the union of all of the subsystems required by their component commands.* Thus, the ``ComplexAuto`` shown previously will require both the drive subsystem and the hatch subsystem of the robot.
fr_ca: Comme les groupes de commandes sont des commandes, ils doivent également déclarer leurs exigences. Toutefois, les utilisateurs ne sont pas tenus de spécifier manuellement les exigences pour les groupes de commandes - les exigences sont automatiquement déduites à partir des commandes incluses. En règle générale, *les groupes de commande incluent l’union de tous les sous-systèmes requis par leurs commandes composantes.* Ainsi, le ``ComplexAuto`` montré précédemment nécessitera à la fois le sous-système de base pilotable et le sous-système hatch du robot.
tr_tr: Komut grupları-Command groups komutlar olduğundan, gereksinimlerini de bildirmeleri gerekir. Ancak, kullanıcıların komut grupları için gereksinimleri manuel olarak belirtmeleri gerekmez - gereksinimler, içerilen komutlardan otomatik olarak çıkarılır. kural olarak, *komut grupları, bileşen komutlarının gerektirdiği tüm alt sistemlerin birleşimini içerir * Bu nedenle, daha önce gösterilen ``ComplexAuto``, hem sürücü alt sistemini hem de robotun kapak alt sistemini gerektirecektir.

source: Additionally, requirements are enforced within all three types of parallel groups - a parallel group may *not* contain multiple commands that require the same subsystem.
fr_ca: En outre, les exigences sont appliquées dans les trois types de groupes parallèles - un groupe parallèle peut *ne pas* contenir plusieurs commandes qui nécessitent le même sous-système.
tr_tr: Ek olarak, gereksinimler üç paralel grup türünde de uygulanır - bir paralel grup, aynı alt sistemi gerektiren birden fazla komut *içermeyebilir*.

source: Some advanced users may find this overly-restrictive - for said users, the library offers a ``ScheduleCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_schedule_command.html>`__) that can be used to independently "branch off" from command groups to provide finer granularity in requirement management.
fr_ca: Certains utilisateurs avancés peuvent trouver cela trop restrictif - pour les dits utilisateurs, la librairie offre une classe ``ScheduleCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_schedule_command.html>`__) qui peut être utilisée pour "se détacher" indépendamment des groupes de commandes afin d’offrir une granularité plus fine dans la gestion des requis.

source: Restrictions on Command Group Components
fr_ca: Restrictions sur les composants du groupe de commandes
tr_tr: Komut Grubu Bileşenleriyle-Command Group Components İlgili Kısıtlamalar

source: The following is only relevant for the Java command-based library; the C++ library's ownership model naturally prevents users from making this category of mistake.
fr_ca: Ce qui suit n’est pertinent que pour la bibliothèque orientée commande Java ; Le modèle de propriété de la bibliothèque C++ empêche naturellement les utilisateurs de faire cette catégorie d’erreur.
tr_tr: Aşağıdakiler yalnızca Java komut tabanlı kitaplıkla ilgilidir; C++ kitaplığının sahiplik modeli doğal olarak kullanıcıların bu kategoride hata yapmasını engeller.
