Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/command-based-changes.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: ``void setRunsWhenDisabled(boolean disabled)`` has been replaced by an overrideable ``runsWhenDisabled()`` method. Commands that should run when disabled should override this method to return true.
es_mx: ``void setRunsWhenDisabled(boolean disabled)`` ha sido reemplazado por el metodo sobreescribible ``runsWhenDisabled()`` . Los comandos que deben ejecutarse cuando están deshabilitados deben anular este método para volverse verdaderos.
fr_ca: La méthode ``void setRunsWhenDisabled(boolean disabled)`` a été remplacée par la méthode ``runsWhenDisabled()``, qui peut être redéfinie. Les commandes qui doivent s'exécuter lorsque le robot est désactivé (*disabled*) doivent redéfinir cette méthode afin qu'elle retourne ``true``.
tr_tr: `void setRunsWhenDisabled(boolean disabled)`` , geçersiz kılınabilen bir ``runsWhenDisabled()`` yöntemiyle değiştirildi. Devre dışı bırakıldığında çalışması gereken komutlar, true değerini döndürmek için bu yöntemi geçersiz kılmalıdır.
zh_cn: void setRunsWhenDisabled（boolean disabled）已由可重写的runsWhenDisabled（）方法替换。禁用时应运行的命令应覆盖此方法以返回true。

source: ``void setInterruptible(boolean interruptible)`` has been removed; interruptibility is no longer an innate property of commands, and can be set when the command is scheduled.
es_mx: ``void setInterruptible(boolean interruptible)`` ha sido removido; ia interrumpibilidad ya no es una propiedad innata de los comandos, y se puede establecer cuando el comando está planificado.
fr_ca: La méthode ``void setInterruptible(boolean interruptible)`` a été supprimée. L'interruptibilité n'est plus une propriété des commandes : elle peut être définie lorsque la commande est planifiée.
tr_tr: ``void setInterruptible(boolean interruptible)`` kaldırıldı; kesilebilirlik artık komutların doğuştan gelen bir özelliği değildir ve komut zamanlandığında ayarlanabilir.
zh_cn: ``void setInterruptible（boolean interruptible）``已被删除;可中断性不再是命令的固有属性，可以在计划命令时设置。

source: Several :ref:`"decorator" methods <docs/software/commandbased/convenience-features:Command Decorator Methods>` have been added to allow easy inline modification of commands (e.g. adding a timeout).
es_mx: Diferentes :ref:`"decorator" methods <docs/software/commandbased/convenience-features:Command Decorator Methods>` han sido añadidos para permitir modificaciones de comandos inline sencillas (e.g. agregar un temporizador).
fr_ca: Plusieurs :ref:`méthodes de « décoration » <docs/software/commandbased/convenience-features:Command Decorator Methods>` ont été ajoutées afin de faciliter la modification de commandes en une seule ligne (par exemple, en ajoutant un délai de fin).
tr_tr: Komutların kolayca satır içi değiştirilmesine (örneğin, bir zaman aşımı eklenmesi) izin vermek için birkaç :ref:`"decorator" yöntemi <docs/software/commandbased/convenience-features:Command Decorator Methods>` eklenmiştir.
zh_cn: 添加了几种“ decorator”方法<docs / software / commandbased / convenience-features：Command Decorator Methods>`以允许轻松地内联修改命令（例如，添加超时）。

source: (C++ only) In order to allow the decorators to work with the command ownership model, a `CRTP <https://en.wikipedia.org/wiki/Curiously_recurring_template_pattern>`__ is used via the ``CommandHelper`` `class <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibNewCommands/src/main/native/include/frc2/command/CommandHelper.h>`__. Any user-defined Command subclass ``Foo`` *must* extend ``CommandHelper<Foo, Base>`` where ``Base`` is the desired base class.
fr_ca: (C++ seulement) Afin de permettre aux décorateurs de travailler avec le modèle de commande approprié, un `CRTP <https://en.wikipedia.org/wiki/Curiously_recurring_template_pattern>`__ est utilisé via la `classe <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibNewCommands/src/main/native/include/frc2/command/CommandHelper.h>`__ ``CommandHelper``. Toute sous-classe de la classe Command définie par l’utilisateur ``Foo`` *doit* étendre ``CommandHelper<Foo, Base>` où ``Base`` est la classe de base souhaitée.
zh_cn: （仅C ++）为了允许装饰器使用命令所有权模型，请通过CommandHelper类<https://github.com/wpilibsuite/allwpilib/blob/main/wpilibNewCommands/src/main/native/include/frc2/command/CommandHelper.h>`__使用CRTP <https://en.wikipedia.org/wiki/Curiously_recurring_template_pattern>`__。任何用户定义的Command子类“ Foo” *必须*扩展“ CommandHelper <Foo, Base>”，其中“ Base”是所需的基类。

source: Changes to PIDSubsystem/PIDCommand
es_mx: Cambios a PIDSubsystem/PIDCommand
fr_ca: Changements aux classes PIDSubsystem et PIDCommand
tr_tr: PIDSubsystem/PIDCommand değişiklikleri
zh_cn: PIDS子系统/ PIDCommand的变化

source: For more information, see :doc:`pid-subsystems-commands`, and :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`
es_mx: Para mas información, véase :doc:`pid-subsystems-commands`, and :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`
fr_ca: Pour plus d'informations, consultez :doc:`pid-subsystems-commands`, and :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
tr_tr: Daha fazla bilgi için bkz :doc:`pid-subsystems-commands`, and :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`
zh_cn: 更多的信息，请参见：doc:`pid-subsystems-commands`, and :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`

source: Following the changes to PIDController, these classes now run synchronously from the main robot loop.
es_mx: Después de los cambios en el PIDController, estas clases ahora se ejecutan sincrónicamente desde el loop principal del robot.
fr_ca: Suite aux changements apportés à ``PIDController``, ces classes fonctionnent désormais de manière synchrone à partir de la boucle principale du robot (et non dans un processus séparé).
tr_tr: PIDController'deki değişikliklerin ardından, bu sınıflar artık ana robot döngüsünden eşzamanlı olarak çalışır.
zh_cn: 在对PIDController进行更改之后，这些类现在可以从机器人主循环中同步运行。

source: The ``PIDController`` is now injected through the constructor, removing many of the forwarding methods. It can be modified after construction with ``getController()``.
es_mx: El `` PIDController`` ahora se inyecta a través del constructor, eliminando muchos de los métodos de reenvío. Se puede modificar después de la construcción con `` getController() ``.
fr_ca: Le ``PIDController`` est à présent injecté dans le constructeur, ce qui a permis la suppression de plusieurs méthodes faisant le lien avec le contrôleur. Après l'appel du constructeur, celui-ci peut être modifié en utilisant la méthode ``getController()``.
tr_tr: ``PIDController`` artık constructor aracılığıyla yerleştirilerek birçok yönlendirme methodu kaldırılır. Oluşturulduktan sonra ``getController()`` ile değiştirilebilir.
zh_cn: l 这个PIDController现在通过构造函数注入，删除许多转发方法，构筑后后可以改建为getController().

source: ``PIDCommand`` is intended largely for inline use, as shown in the GyroDriveCommands example (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__).
fr_ca: ``PIDCommand`` est destiné en grande partie à une utilisation en inline, comme le montre l'exemple GyroDriveCommands (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__).
zh_cn: 如GyroDriveCommands示例（Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__）所示，PIDCommand主要用于内联使用。

source: If users wish to use PIDCommand more "traditionally," overriding the protected ``returnPIDInput()`` and ``usePIDOutput(double output)`` methods has been replaced by modifying the protected ``m_measurement`` and ``m_useOutput`` fields. Similarly, rather than calling ``setSetpoint``, users can modify the protected ``m_setpoint`` field.
es_mx: Si los usuarios desean utilizar el PIDCommand mas "tradicionalmente", sobreescribir los metodos protegidos ``returnPIDInput()`` y ``usePIDOutput(double output)`` ha sido reemplazado modificando los campos ``m_measurement`` y ``m_useOutput`` . De manera similar, en vez de llamar a ``setSetpoint``, los usuarios pueden modificar el campo protegido ``m_setpoint`` .
fr_ca: Si les utilisateurs souhaitent utiliser ``PIDCommand`` de façon plus « traditionnelle », la redéfinition des méthodes protégées ``returnPIDInput()`` et ``usePIDOutput(double output)`` a été remplacée par la modification des attributs protégés ``m_measurement`` et ``m_useOutput``. De même, plutôt que d'appeler la méthode ``setSetpoint()``, les utilisateurs peuvent modifier l'attribut protégé ``m_setpoint``.
tr_tr: Kullanıcılar PIDCommand'i daha "geleneksel" olarak kullanmak isterse, korumalı ``returnPIDInput()`` ve ``usePIDOutput (double output)`` yöntemlerini geçersiz kılarak, korumalı ``m_measurement`` ve ``m_useOutput`` düzenlenerek değiştirilmiştir. alanlar. Benzer şekilde, kullanıcılar ``setSetpoint`` i çağırmak yerine korumalı ``m_setpoint`` alanını değiştirebilirler.
zh_cn: 如果用户希望更“传统地”使用PIDCommand，则已覆盖的受保护的“ returnPIDInput（）”和“ usePIDOutput（double output）”方法已被修改为受保护的“ m_measurement”和“ m_useOutput”领域。同样，用户可以调用受保护的m_setpoint字段，而不用调用setSetpoint。

source: This article provides a summary of changes from the :ref:`original command-based framework <docs/software/old-commandbased/basics/what-is-command-based:What is Command-Based Programming?>` to the 2020 rewrite. This summary is not necessarily comprehensive - for rigorous documentation, as always, refer to the API docs (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/package-summary.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/>`__).
tr_tr: yeniden yazmakBu makale:ref:`original command-based framework <docs/software/old-commandbased/basics/what-is-command-based:What is Command-Based Programming?>` dan 2020 yeniden yazılmasına kadar yapılan değişikliklerin bir özetini sunmaktadır. Bu özetin kapsamlı olması gerekmez - her zaman olduğu gibi titiz dokümantasyon için API dokümanlarına bakın (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/package-summary.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/>`__).

source: The new command-based framework is located in the ``wpilibj2`` package for Java, and in the ``frc2`` namespace for C++. The old command-based framework is still available in the original location. The new framework must be installed using the instructions: :ref:`docs/software/vscode-overview/3rd-party-libraries:WPILib Command Libraries`.
es_mx: El nuevo framework para la programación basada en comandos se ubica en el paquete ``wpilibj2`` para Java y en el espacio de nombre ``frc2`` para C++. El framework antiguo para programación basada en comandos aun esta disponible en la ubicación original. El nuevo framework debe ser instalado usando las instrucciones en: :ref:`docs/software/vscode-overview/3rd-party-libraries:WPILib Command Libraries`.
tr_tr: Yeni komut tabanlı yapı, Java için ``wpilibj2`` paketinde ve C++ için ``frc2`` ad alanında bulunur. Eski komut tabanlı yapı, orijinal konumda hala mevcuttur. Yeni yapı şu talimatlar kullanılarak yüklenmelidir :ref:`docs/software/vscode-overview/3rd-party-libraries:WPILib Command Libraries`.

source: ``Command`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>`__) and ``Subsystem`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Subsystem.html>`__) are both now interfaces as opposed to abstract classes, allowing advanced users more potential flexibility. ``CommandBase`` and ``SubsystemBase`` abstract base classes are still provided for convenience, but are not required. For more information, see :doc:`commands` and :doc:`subsystems`.
tr_tr: ``Command`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>`__) ve ``Subsystem`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Subsystem.html>`__) artık ileri düzey kullanıcıların soyuttan farklı olarak arayüzlere izin veriyor daha fazla potansiyel esneklik. ``CommandBase`` ve``SubsystemBase`` soyut temel sınıfları hala kolaylık sağlamak için sağlanmıştır, ancak gerekli değildir. Daha fazla bilgi için bakınız :doc:`commands` and :doc:`subsystems`.

source: ``Scheduler`` has been renamed to ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html>`__).
tr_tr: ``Scheduler-Zamanlayıcı``. ``CommandScheduler`` olarak yeniden adlandırıldı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html>` __).

source: As noted earlier, ``Subsystem`` is now an interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Subsystem.html>`__); the closest equivalent of the old ``Subsystem`` is the new ``SubsystemBase`` class. Many of the Sendable-related constructor overloads have been removed to reduce clutter; users can call the setters directly from their own constructor, if needed.
tr_tr: Daha önce belirtildiği gibi, ``Subsystem`` artık bir arayüzdür (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Subsystem.html>` __); eski ```Subsystem`` in en yakın eşdeğeri yeni ``SubsystemBase`` sınıfıdır. Sendable ile ilgili oluşturucu aşırı yüklemelerinin çoğu, yığılmayı azaltmak için kaldırıldı; Kullanıcılar gerekirse kendi kurucularından ayarlayıcıları doğrudan arayabilirler.

source: As noted earlier, ``Command`` is now an interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>`__); the closest equivalent of the old ``Command`` is the new ``CommandBase`` class. Many of the Sendable-related constructor overloads have been removed to reduce clutter; users can call the setters directly from their own constructor, if needed.
tr_tr: Daha önce belirtildiği gibi, ``Command`` artık bir arayüzdür (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>` __); eski ``Command`` ın en yakın eşdeğeri yeni ``CommandBase``sınıfıdır. Sendable ile ilgili oluşturucu aşırı yüklemelerinin çoğu, yığılmayı azaltmak için kaldırıldı; Kullanıcılar gerekirse kendi kurucularından ayarlayıcıları doğrudan arayabilirler.

source: (C++ only) In order to allow the decorators to work with the command ownership model, a `CRTP <https://en.wikipedia.org/wiki/Curiously_recurring_template_pattern>`__ is used via the ``CommandHelper`` `class <https://github.com/wpilibsuite/allwpilib/blob/master/wpilibNewCommands/src/main/native/include/frc2/command/CommandHelper.h>`__. Any user-defined Command subclass ``Foo`` *must* extend ``CommandHelper<Foo, Base>`` where ``Base`` is the desired base class.
es_mx: (Exclusivo C++) Para permitir a los decorators trabajar con el modelo de propiedad de comados, un `CRTP <https://en.wikipedia.org/wiki/Curiously_recurring_template_pattern>`__ es utilizado via la clase ``CommandHelper`` <https://github.com/wpilibsuite/allwpilib/blob/master/wpilibNewCommands/src/main/native/include/frc2/command/CommandHelper.h>`__. Cada subclase de comando ``Foo`` definida por el usuario *must* extenderse con ``CommandHelper<Foo, Base>`` donde ``Base`` es la clase base deseada.

source: ``PIDCommand`` is intended largely for inline use, as shown in the GyroDriveCommands example (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__).
es_mx: ``PIDCommand`` esta intencionado mayoritariamente para uso inline, como se muestra en los ejemplos de GyroDriveCommands (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__).
