Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/command-based-changes.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: 2020 Command-Based Rewrite: What Changed?
es_mx: Programación basada en comandos, Versión 2020: ¿Qué cambió?
fr_ca: Changements apportés lors de la réécriture de 2020
tr_tr: 2020 Komut Tabanlı Yeniden Yazmak - Rewrite: Ne Değişti?
zh_cn: 2020基于命令的重写：什么改变了？

source: This article provides a summary of changes from the original command-based framework to the 2020 rewrite. This summary is not necessarily comprehensive - for rigorous documentation, as always, refer to the API docs (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/package-summary.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/>`__).
fr_ca: Cet article fournit un résumé des changements à partir de l’infrastructure logicielle orientée commande d’origine à la réécriture de 2020. Ce résumé n’est pas nécessairement complet - pour une documentation rigoureuse, comme toujours, se référer aux documents API (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/package-summary.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/>`__).

source: Package Location
es_mx: Ubicación del paquete
fr_ca: Emplacement du package
tr_tr: Paket Yerleri
zh_cn: 包装位置

source: Major Architectural Changes
es_mx: Cambios arquitectónicos mas grandes
fr_ca: Changements architecturaux majeurs
tr_tr: Başlıca Mimari Değişiklikler
zh_cn: 主要构筑变化

source: The overall structure of the command-based framework has remained largely the same. However, there are some still a few major architectural changes that users should be aware of:
es_mx: La estructura general del framework para la programación basada en comandos ha permanecido predominantemente igual. Aun así hay algunos cambios estructurales de los que los usuarios deberían estar al tanto:
fr_ca: Dans l'ensemble, la structure du cadre d'application orienté commande est restée la même. Il y a toutefois certains changements architecturaux majeurs dont les utilisateurs doivent être conscients :
tr_tr: Komut temelli çerçevenin genel yapısı büyük ölçüde aynı kalmıştır. Bununla birlikte, kullanıcıların bilmesi gereken bazı önemli mimari değişiklikler vardır:
zh_cn: 基于命令的框架的总体结构基本保持不变。然而，仍有一些用户需要注意的主要体系结构变化：

source: Commands and Subsystems as Interfaces
es_mx: Comandos y Subsistemas como interfaces
fr_ca: Commandes et sous-systèmes en tant qu'interfaces
tr_tr: Arayüz Olarak Commands-Komutlar ve Subsystems-Alt Sistemler
zh_cn: 命令和子系统作为接口

source: ``Command`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html>`__) and ``Subsystem`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_subsystem.html>`__) are both now interfaces as opposed to abstract classes, allowing advanced users more potential flexibility. ``CommandBase`` and ``SubsystemBase`` abstract base classes are still provided for convenience, but are not required. For more information, see :doc:`commands` and :doc:`subsystems`.
fr_ca: ``Command`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html>`__) et ``Subsystem`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_subsystem.html>`__) sont maintenant des interfaces par opposition aux classes abstraites, donnant aux utilisateurs avancés plus de flexibilité potentielle. Les classes abstraites de base ``CommandBase`` et ``SubsystemBase`` sont toujours fournies pour plus de commodité, mais ne sont pas nécessaires. Pour plus d’informations, voir :doc:`commands` et :doc:`subsystems`.

source: Multiple Command Group Classes
es_mx: Clases grupales de múltiples comandos
fr_ca: Plusieurs classes de groupes de commandes
tr_tr: Çoklu Komut Grubu Sınıfları - Multiple Command Group Classes
zh_cn: 多命令组类

source: The ``CommandGroup`` class no longer exists, and has been replaced by a number of narrower classes that can be recursively composed to create more-complicated group structures. For more information see :doc:`command-groups`.
es_mx: La clase ``CommandGroup`` no existe ya, y ha sido remplazada por un numero mas estrecho de clases que pueden ser compuestas recursivamente para crear estructuras de grupo mas complicadas. Para mas información vease :doc:`command-groups`.
fr_ca: La classe ``CommandGroup`` n'existe plus : elle a été remplacée par un certain nombre de classes ayant chacune un rôle plus précis. Celles-ci peuvent ensuite être combinées en des hiérarchies plus complexes. Pour plus d'informations, consultez :doc:`command-groups`.
tr_tr: ``CommandGroup`` sınıfı artık mevcut değildir ve daha karmaşık grup yapıları oluşturmak için yinelemeli olarak oluşturulabilen bir dizi daha dar sınıfla değiştirilmiştir. Daha fazla bilgi için bakınız :doc:`command-groups`.
zh_cn: 这个CommandGroup类不再存在，并且已经被许多递归类所组成的较窄类所取代，以创建更复杂的组结构。有关更多信息，请参见:doc:`command-groups`.

source: Inline Command Definitions
es_mx: Definiciones de comandos in-line
fr_ca: Définitions de commandes en une seule ligne
tr_tr: Satır İçi-Inline Komut Tanımları
zh_cn: 内联命令定义

source: Previously, users were required to write a subclass of ``Command`` in almost all cases where a command was needed. Many of the new commands are designed to allow inline definition of command functionality, and so can be used without the need for an explicit subclass. For more information, see :doc:`convenience-features`.
es_mx: Anteriormente, los usuarios requerían escribir una subclase "Command" en casi todos los casos donde un comando era necesario. Muchos de los nuevos comandos están diseñados para permitir una definición inline de la funcionalidad de comando, y así pues, usados sin la necesidad de una subclase explicita. Para mas información véase :doc:`convenience-features`.
fr_ca: Auparavant, les utilisateurs devaient écrire une sous-classe de ``Command`` dans presque toutes les situations où une commande était nécessaire. Plusieurs des nouvelles classes sont maintenant conçues pour permettre la définition de commandes en une seule ligne (*inline*), ce qui évite la déclaration d'une sous-classe explicite. Pour plus d'informations, consultez :doc:`convenience-features`.
tr_tr: Önceden, kullanıcıların bir komutun gerekli olduğu hemen hemen tüm durumlarda bir ``Command`` alt sınıfı yazılması gerekiyordu. Yeni komutların çoğu, komut işlevinin satır içi tanımına izin verecek şekilde tasarlanmıştır ve bu nedenle, açık bir alt sınıfa gerek kalmadan kullanılabilir. Daha fazla bilgi için, bakınız :doc:`convenience-features`.
zh_cn: 以前，用户需要编写一个Command的子类。命令在几乎所有需要命令的情况下。许多新命令被设计为允许命令功能的内联定义，因此可以在不需要显式子类的情况下使用。有关更多信息，请参见 :doc:`convenience-features`.

source: Injection of Command Dependencies
es_mx: Inyección de dependencias de comando
fr_ca: Injection des dépendances des commandes
tr_tr: Komut Bağımlılıklarının Enjeksiyonu - Command Dependencies
zh_cn: 注入命令依赖项

source: While not an actual change to the coding of the library, the recommended use pattern for the new command-based framework utilizes injection of subsystem dependencies into commands, so that subsystems are not declared as globals. This is a cleaner, more maintainable, and more reusable pattern than the global subsystem pattern promoted previously. For more information, see :doc:`structuring-command-based-project`.
es_mx: Aun sin un cambio real al código de la librería, el patrón de uso recomendado para el nuevo framework de programación basada en comandos utiliza inyección de dependencias de subsistemas en los comandos, permitiendo que los subsistemas no sean declarados como globales. Este es un patrón mas limpio, de mayor mantenibilidad y mas reusable que el subsistema global promovido previamente. Para mas información véase :doc:`structuring-command-based-project`.
fr_ca: Bien qu'il ne s'agisse pas d'un réel changement au niveau de la programmation de la bibliothèque, le patron recommandé pour utiliser le nouveau cadre d'application orienté commande est l'injection des sous-systèmes dépendants dans les commandes, ce qui ne requiert plus de déclarer les sous-systèmes comme variables globales. Il s'agit d'un patron beaucoup plus clair, maintenable et réutilisable que la déclaration globale des sous-systèmes, ce qui était anciennement recommandé. Pour plus d'informations, consultez :doc:`structuring-command-based-project`.
tr_tr: Kitaplığın kodlamasında gerçek bir değişiklik olmasa da, yeni komut tabanlı çerçeve için önerilen kullanım modeli, alt sistem bağımlılıklarının komutlara enjeksiyonunu kullanır, böylece alt sistemler global olarak bildirilmez. Bu, daha önce tanıtılan global alt sistem modelinden daha temiz, daha sürdürülebilir ve daha yeniden kullanılabilir bir modeldir. Daha fazla bilgi için, bakınız :doc:`structuring-command-based-project`.
zh_cn: 虽然不是对库的编码的实际改变，但是新的基于命令的框架的推荐使用模式利用子系统依赖性注入命令，因此子系统不被声明为全局。这是一种更清洁、更可维护、更可重用的模式，而不是以前所提倡的全局子系统模式。有关更多信息，请参见 :doc:`structuring-command-based-project`.

source: Command Ownership (C++ Only)
es_mx: Pertenencia de Comando (Solo para C++)
fr_ca: Propriété des commandes (seulement en C++)
tr_tr: Komut Sahipliği (Yalnızca C++)
zh_cn: 命令所有权（C++）

source: The previous command framework required users to use raw pointers for all commands, resulting in nearly-unavoidable memory leaks in all C++ command-based projects, as well as leaving room for common errors such as double-allocating commands within command-groups.
es_mx: El framework de comandos anterior requería a los usuarios el usar punteros en crudo para todos los comandos, resultando en una perdida de memoria casi inevitable en todos los proyectos basados en comandos de C++, así como la oportunidad para que errores comunes se presentaran, como la doble locación de un comando dentro de un grupos de comandos
fr_ca: L'ancien cadre d'application orienté commande requérait l'utilisation de pointeurs primitifs (*raw pointers*) pour toutes les commandes, ce qui entraînait presque inévitablement des fuites de mémoire dans tous les projets C++ qui utilisaient des commandes. De plus, ces pointeurs rendaient également possibles certaines erreurs courantes telles que la double allocation de commandes dans des groupes de commandes.
tr_tr: Önceki komut çerçevesi, kullanıcıların tüm komutlar için ham işaretçiler kullanmasını gerektiriyordu, bu da tüm C++ komut tabanlı projelerde neredeyse kaçınılmaz bellek sızıntılarına yol açmanın yanı sıra komut grupları içinde çift ayırma komutları gibi yaygın hatalara yer bırakıyordu.
zh_cn: 以前的命令框架要求用户对所有命令使用原始指针，从而导致在所有基于C ++命令的项目中几乎不可避免的内存泄漏，并且为常见错误留出了空间，例如在命令组内双重分配命令。

source: The new command framework offers ownership management for all commands. Default commands and commands bound to buttons are typically owned by the scheduler, and component commands are owned by their encapsulating command groups. As a result, users should generally never heap-allocate a command with ``new`` unless there is a very good reason to do so.
es_mx: El framework ofrece gestión de propiedad para todos los comandos. Los comandos predeterminados y los comandos vinculados a botones generalmente son propiedad del planificador, y los comandos de componentes son propiedad de sus grupos de comandos encapsulantes. Como resultado, los usuarios generalmente nunca deberían asignar un comando en montón con `` nuevo '' a menos que haya una muy buena razón para hacerlo.
fr_ca: Le nouveau cadre d'application offre la gestion de la propriété pour toutes les commandes. Les commandes par défaut et les commandes liées à des boutons sont généralement la propriété du ``CommandScheduler``, et les commandes faisant partie d'un groupe de commandes sont la propriété du groupe qui les encapsule. Par conséquent, les utilisateurs ne devraient presque jamais allouer une commande avec ``new`` à moins d'avoir une très bonne raison de le faire.
tr_tr: Yeni komut çerçevesi, tüm komutlar için sahiplik yönetimi sunar. Düğmelere bağlı komutlar ve varsayılan komutlar tipik olarak schedulera aittir ve bileşen komutları, bileşeni içeren komut gruplarına aittir. Sonuç olarak, kullanıcılar, çok iyi bir neden olmadıkça, genellikle bir komutu ``new`` ile yığın olarak ayırmamalıdır.
zh_cn: 新的命令框架为所有命令提供所有权管理。绑定到按钮的默认命令和命令通常由调度器拥有，组件命令由它们的封装命令组拥有。因此，用户通常不应该堆分配new命令。除非有一个很好的理由这样做。

source: Transfer of ownership is done using `perfect forwarding <https://cpppatterns.com/patterns/perfect-forwarding.html>`__, meaning rvalues will be *moved* and lvalues will be *copied* (`rvalue/lvalue explanation <http://thbecker.net/articles/rvalue_references/section_01.html>`__).
es_mx: La transferencia de propiedad se hace usando `perfect forwarding <https://cpppatterns.com/patterns/perfect-forwarding.html>`__, lo que significa que los rvalues seran *moved* y los lvalues seran *copied* (`rvalue/lvalue explanation <http://thbecker.net/articles/rvalue_references/section_01.html>`__).
fr_ca: Le transfert de propriété se fait par `transfert parfait ou perfect forwarding <https://cpppatterns.com/patterns/perfect-forwarding.html>`__, ce qui signifie que les *rvalues* seront *déplacées* et que les *lvalues* seront *copiées* (en anglais :`explication des *rvalues* et des *lvalues* <http://thbecker.net/articles/rvalue_references/section_01.html>`__).
tr_tr: Sahiplik aktarımı, `perfect forwarding <https://cpppatterns.com/patterns/perfect-forwarding.html>`__ kullanılarak yapılır, yani rvalues *taşınacak* ve lvalues *kopyalanacaktır* (`rvalue/lvalue açıklaması<http://thbecker.net/articles/rvalue_references/section_01.html>`__).
zh_cn: 所有权的转移是通过完美的转发完成的，<https://cpppatterns.com/patterns/perfect-forwarding.html>`__,这意味着右值将被移动，左值将被复制（右值/左值说明<http://thbecker.net/articles/rvalue_references/section_01.html>`__).

source: Changes to the Scheduler
es_mx: Cambios al Planificador
fr_ca: Changements à la classe Scheduler
tr_tr: Planlayıcıdaki-Scheduler Değişiklikler
zh_cn: 对调度程序的更改

source: ``Scheduler`` has been renamed to ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html>`__).
fr_ca: La classe ``Scheduler`` (planificateur) s'appelle désormais ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html>`__).

source: Interruptibility of commands is now the responsibility of the scheduler, not the commands, and can be specified during the call to ``schedule``.
es_mx: La interrupbilidad de los comandos ahora es responsabilidad del planificador, no de los comandos, y se puede especificar durante la llamada a `` schedule ''.
fr_ca: L'interruptibilité des commandes est maintenant la responsabilité du ``CommandScheduler``, et non des commandes, ce qui peut être spécifié lors de l'appel à la méthode ``schedule``.
tr_tr: Komutların kesilebilirliği artık komutların değil programlayıcının sorumluluğundadır ve ``schedule`` çağrısı sırasında belirtilebilir.
zh_cn: 现在命令的可中断性是调度程序的责任，而不是命令的责任，可以在调用``schedule''时指定。

source: Users can now pass actions to the scheduler which are taken whenever a command is scheduled, interrupted, or ends normally. This is highly useful for cases such as event logging.
es_mx: Los usuarios ahora pueden pasar acciones al planificador que se realizan cada vez que un comando se programa, interrumpe o finaliza normalmente. Esto es muy útil para casos como el registro de eventos.
fr_ca: Les utilisateurs peuvent à présent passer au ``CommandScheduler`` des actions qui seront exécutées chaque fois qu'une commande est programmée, interrompue ou complétée normalement. Cela est très utile pour, par exemple, la journalisation d'événements.
tr_tr: Kullanıcılar artık, bir komut programlandığında, kesintiye uğradığında veya normal şekilde sona erdiğinde gerçekleştirilen eylemleri planlayıcıya aktarabilir. Bu, olay günlüğü gibi durumlarda oldukça kullanışlıdır.
zh_cn: 用户现在可以将操作传递给调度程序，只要命令被调度，中断或正常结束，便会采取这些操作。这对于事件记录之类的情况非常有用。

source: Changes to Subsystem
es_mx: Cambios al Subsistema
fr_ca: Changements à la classe Subsystem
tr_tr: Alt Sistemdeki Değişiklikler
zh_cn: 子系统变化

source: For more information on subsystems, see :doc:`subsystems`.
es_mx: Para mas información sobre subsistemas, véase :doc:`subsystems`.
fr_ca: Pour plus d'informations sur les sous-systèmes, consultez :doc:`subsystems`.
tr_tr: Alt sistemler hakkında daha fazla bilgi için, bakınız :doc:`subsystems`
zh_cn: 有关子系统的更多信息，请参见子系统。

source: As noted earlier, ``Subsystem`` is now an interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_subsystem.html>`__); the closest equivalent of the old ``Subsystem`` is the new ``SubsystemBase`` class. Many of the Sendable-related constructor overloads have been removed to reduce clutter; users can call the setters directly from their own constructor, if needed.
fr_ca: Tel qu'indiqué précédemment, ``Subsystem`` est maintenant une interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_subsystem.html>`__); l'équivalent le plus proche de l'ancienne classe ``Subsystem`` est la nouvelle classe ``SubsystemBase``. De nombreuses surcharges du constructeur liées à l'interface ``Sendable`` ont été supprimées afin de réduire l'encombrement. Les utilisateurs peuvent utiliser les mutateurs ou *setters* directement dans le constructeur de leurs propres sous-systèmes, si nécessaire.

source: ``initDefaultCommand`` has been removed; subsystems no longer need to "know about" their default commands, which are instead registered directly with the ``CommandScheduler``. The new ``setDefaultCommand`` method simply wraps the ``CommandScheduler`` call.
es_mx: ``initDefaultCommand`` ha sido removido; los subsistemas no necesitan más "conocer" sus comandos por default , los que mejor se registran directamente con ``CommandScheduler``. El nuevo método ``setDefaultCommand`` simplemente envuelve la llamada ``CommandScheduler`` .
fr_ca: La méthode ``initDefaultCommand`` a été supprimée; les sous-systèmes n'ont plus besoin de « connaître » leurs commandes par défaut. Celles-ci sont plutôt configurées directement avec le ``CommandScheduler``. La nouvelle méthode ``setDefaultCommand`` encapsule simplement l'appel vers le ``CommandScheduler``.
tr_tr: ``initDefaultCommand`` kaldırıldı; alt sistemlerin artık varsayılan komutlarını "bilmelerine" gerek yoktur, bunun yerine doğrudan ``CommandScheduler`` ile kaydedilir. Yeni ``setDefaultCommand`` yöntemi, ``CommandScheduler`` çağrısını basitçe kapsar.
zh_cn: initDefaultCommand已被删除；子系统不再需要“知道”它们的默认命令，而是直接注册到CommandScheduler. 新的setDefaultCommand方法简单地包装CommandScheduler程序打电话。

source: Subsystems no longer "know about" the commands currently requiring them; this is handled exclusively by the ``CommandScheduler``. A convenience wrapper on the ``CommandScheduler`` method is provided, however.
es_mx: Los subsistemas ya no "conocen" los comandos que los requieren en ese momento; esto es manejado exclusivamente por el `` CommandScheduler``. Sin embargo, se proporciona un contenedor de conveniencia en el método `` CommandScheduler``.
fr_ca: Les sous-systèmes n'ont plus besoin de « connaître » les commandes qui les requièrent à tout moment; cela est géré exclusivement par le ``CommandScheduler``. Cependant, une méthode qui encapsule l'appel vers le ``CommandScheduler`` est fournie.
tr_tr: Alt sistemler artık şu anda onları gerektiren komutları "bilmiyor"; bu yalnızca ``CommandScheduler`` tarafından ele alınır. Bununla birlikte, ``CommandScheduler`` yöntemiyle ilgili bir kullanışlı paket sağlanmıştır.
zh_cn: 子系统不再“知道”当前需要它们的命令；这只由CommandScheduler. 然而，一个方便包装命CommandScheduler.提供了方法。

source: Changes to Command
es_mx: Cambios a Comandos
fr_ca: Changements à la classe Command
tr_tr: Command Değişiklikleri
zh_cn: 命令更改

source: For more information on commands, see :doc:`commands`.
es_mx: Para mas información sobre comandos, véase :doc:`commands`.
fr_ca: Pour plus d'informations sur les commandes, consultez :doc:`commands`.
tr_tr: Komutlar hakkında daha fazla bilgi için, bakınız :doc:`commands`.
zh_cn: 有关命令的更多信息，请参见：doc:`commands`.

source: As noted earlier, ``Command`` is now an interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html>`__); the closest equivalent of the old ``Command`` is the new ``CommandBase`` class. Many of the Sendable-related constructor overloads have been removed to reduce clutter; users can call the setters directly from their own constructor, if needed.
fr_ca: Tel qu'indiqué précédemment, ``Command`` est maintenant une interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html>`__); l'équivalent le plus proche de l'ancienne ``Command`` est la nouvelle classe ``CommandBase``. De nombreuses surcharges du constructeur liées à l’interface ``Sendable`` ont été supprimées afin de réduire l’encombrement. Les utilisateurs peuvent utiliser les mutateurs ou *setters* directement dans le constructeur de leurs propres commandes, si nécessaire.

source: Commands no longer handle their own scheduling state; this is now the responsibility of the scheduler.
es_mx: Los comandos ya no manejan su propio estado de programación; ahora es responsabilidad del planificador.
fr_ca: Les commandes ne gèrent plus l'état de leur planification; il s'agit maintenant la responsabilité de la classe ``CommandScheduler``.
tr_tr: Komutlar artık kendi zamanlama durumlarını işlemez; bu artık planlayıcının-scheduler sorumluluğundadır.
zh_cn: 命令不再处理自己的调度状态；现在这是调度程序的责任。

source: The ``interrupted()`` method has been rolled into the ``end()`` method, which now takes a parameter specifying whether the command was interrupted (``false`` if it ended normally).
es_mx: El método ``interrupted()`` ha sido unido al método ``end()``, lo cual ahora agrega un parámetro que especifica si el comando fue interrumpido o no ("false" si finalizó normalmente)
fr_ca: La méthode ``interrupted()`` a été intégrée dans la méthode ``end()``, qui reçoit désormais un paramètre spécifiant si la commande a été interrompue (``false`` si elle s'est terminée normalement).
tr_tr: ``İnterrupted()`` yöntemi, artık komutun kesintiye uğrayıp uğramadığını belirten bir parametre alan ``end()`` yöntemine aktarıldı (normal şekilde sona erdiyse ``false``).
zh_cn: ``interrupted（）''方法已经被卷入到``end（）``方法中，该方法现在使用一个参数来指定命令是否被中断（如果正常结束则为``false''）。

source: The ``requires()`` method has been renamed to ``addRequirement()``.
es_mx: El método ``requires()``ha cambiado su nombre a ``addRequirement()``.
fr_ca: La méthode ``requires()`` s'appelle maintenant ``addRequirement()``.
tr_tr: ``Requires()`` yöntemi, ``addRequirement()`` olarak yeniden adlandırıldı.
zh_cn: ``requires（）``方法已重命名为``addRequirement（）``。
