Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/command-groups.po
Languages: fr_ca, tr_tr

source: Since command group components are run through their encapsulating command groups, errors could occur if those same command instances were independently scheduled at the same time as the group - the command would be being run from multiple places at once, and thus could end up with inconsistent internal state, causing unexpected and hard-to-diagnose behavior.
fr_ca: Étant donné que les composants du groupe de commandes sont exécutés à travers leurs groupes de commande encapsulants, des erreurs peuvent se produire si ces mêmes instances de commandes étaient planifiées indépendamment en même temps que le groupe - la commande serait en cours d’exécution à partir de plusieurs endroits à la fois, et pourrait donc se retrouver avec un état interne incohérent, provoquant un comportement inattendu et difficile à diagnostiquer.
tr_tr: Komut grubu bileşenleri, kapsayıcı komut grupları aracılığıyla çalıştırıldıklarından, aynı komut örnekleri grupla aynı anda bağımsız olarak planlandıysa hatalar meydana gelebilir - komut aynı anda birden fazla yerden çalıştırılır ve bu nedenle tutarsızlıkla sonuçlanabilir. Dahili durum, beklenmedik ve teşhis edilmesi zor davranışlara neden olur.

source: For this reason, command instances that have been added to a command group cannot be independently scheduled or added to a second command group. Attempting to do so will throw an exception and crash the user program.
fr_ca: Pour cette raison, les instances de commande qui ont été ajoutées à un groupe de commandes ne peuvent pas être planifiées de manière indépendante ou ajoutées à un second groupe de commandes. Tenter de le faire lancera une exception et bloquera le programme utilisateur.
tr_tr: Bu nedenle, bir komut grubuna eklenen komut örnekleri bağımsız olarak planlanamaz veya ikinci bir komut grubuna eklenemez. Bunu yapmaya çalışmak bir istisna atacak ve kullanıcı programını çökertecektir.

source: Advanced users who wish to re-use a command instance and are *certain* that it is safe to do so may bypass this restriction with the ``clearGroupedCommand()`` `method <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#clearGroupedCommand(edu.wpi.first.wpilibj2.command.Command)>`__ in the ``CommandGroupBase`` class.
fr_ca: Les utilisateurs avancés qui souhaitent réutiliser une instance de commande et qui sont *certains* qu’on peut le faire sans courir de risque peuvent contourner cette restriction avec la `méthode <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#clearGroupedCommand(edu.wpi.first.wpilibj2.command.Command)>` ``clearGroupedCommand()``__ définie dans la classe ``CommandGroupBase``.

source: A ``SequentialCommandGroup`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/SequentialCommandGroup.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1SequentialCommandGroup.html>`__) runs a list of commands in sequence - the first command will be executed, then the second, then the third, and so on until the list finishes. The sequential group finishes after the last command in the sequence finishes. It is therefore usually important to ensure that each command in the sequence does actually finish (if a given command does not finish, the next command will never start!).
tr_tr: Bir ``SequentialCommandGroup`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/SequentialCommandGroup.html>`__, `C++<https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1SequentialCommandGroup.html>`__) sırayla bir komut listesi çalıştırır - ilk komut çalıştırılır, ardından ikincisi, ardından üçüncü ve liste bitene kadar devam eder. Sıralı grup, sıradaki son komut bittikten sonra biter. Bu nedenle, dizideki her komutun gerçekten bitmesini sağlamak genellikle önemlidir (belirli bir komut bitmezse, sonraki komut asla başlamaz!).

source: A ``ParallelCommandGroup`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/ParallelCommandGroup.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1ParallelCommandGroup.html>`__) runs a set of commands concurrently - all commands will execute at the same time. The parallel group will end when all commands have finished.
tr_tr: Bir ``ParallelCommandGroup`` (`Java<https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/ParallelCommandGroup.html>`__, `C++<https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1ParallelCommandGroup.html>`__) aynı anda bir dizi komut çalıştırır - tüm komutlar aynı anda çalıştırılır. Paralel grup, tüm komutlar bittiğinde sona erecektir.

source: A ``ParallelRaceGroup`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/ParallelRaceGroup.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1ParallelRaceGroup.html>`__) is much like a ``ParallelCommandgroup``, in that it runs a set of commands concurrently. However, the race group ends as soon as any command in the group ends - all other commands are interrupted at that point.
tr_tr: Bir ``ParallelRaceGroup`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/ParallelRaceGroup.html>`__, `C++<https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1ParallelRaceGroup.html>`__), bir ``ParallelCommandgroup`` gibidir, çünkü aynı anda bir dizi komutu çalıştırır. Bununla birlikte, gruptaki herhangi bir komut biter bitmez grubu sona erer - diğer tüm komutlar bu noktada kesilir.

source: A ``ParallelDeadlineGroup`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/ParallelDeadlineGroup.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1ParallelDeadlineGroup.html>`__) also runs a set of commands concurrently. However, the deadline group ends when a *specific* command (the “deadline”) ends, interrupting all other commands in the group that are still running at that point.
tr_tr: Bir ``ParallelDeadlineGroup`` (`Java<https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/ParallelDeadlineGroup.html>`__, `C++<https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1ParallelDeadlineGroup.html>`__) aynı zamanda bir dizi komutu da çalıştırır. Bununla birlikte, Deadline Goup, *belirli* bir komut ("deadline") sona erdiğinde sona erer ve gruptaki diğer tüm çalışan komutlar o noktada çalışmayı sonlandırır.

source: Users have several options for creating command groups. One way - similar to the previous implementation of the command-based library - is to subclass one of the command group classes. Consider the following from the Hatch Bot example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):
tr_tr: Kullanıcıların komut grupları oluşturmak için çeşitli seçenekleri vardır. Komut tabanlı kitaplığın önceki uygulamasına benzer bir yol, komut grubu sınıflarından birini alt sınıflara ayırmaktır. Hatch Bot örnek projesinden (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__) aşağıdakileri göz önünde bulundurun:

source: Due to the verbosity of Java's ``new`` syntax, the Java ``CommandGroupBase`` object offers a factory method for each of the four command-group types: `sequence <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#sequence(edu.wpi.first.wpilibj2.command.Command...)>`__, `parallel <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#parallel(edu.wpi.first.wpilibj2.command.Command...)>`__, `race <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#race(edu.wpi.first.wpilibj2.command.Command...)>`__, and `deadline <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#deadline(edu.wpi.first.wpilibj2.command.Command,edu.wpi.first.wpilibj2.command.Command...)>`__.
tr_tr: Java'nın ``new`` sözdiziminin ayrıntı düzeyi nedeniyle, Java ``CommandGroupBase`` nesnesi, dört komut grubu türünün her biri için bir üretim yöntemi sunar: ``sequence<https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#sequence(edu.wpi.first.wpilibj2.command.Command...)>`__, `parallel<https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#parallel(edu.wpi.first.wpilibj2.command.Command...)>`__, `race<https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#race(edu.wpi.first.wpilibj2.command.Command...)>`__ ve `deadline<https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#deadline(edu.wpi.first.wpilibj2.command.Command,edu.wpi.first.wpilibj2.command.Command...)>`__.

source: Some advanced users may find this overly-restrictive - for said users, the library offers a ``ScheduleCommand`` class (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1ScheduleCommand.html>`__) that can be used to independently “branch off” from command groups to provide finer granularity in requirement management.
tr_tr: Bazı ileri düzey kullanıcılar bunu aşırı derecede kısıtlayıcı bulabilir - söz konusu kullanıcılar için kütüphane, komut gruplarından bağımsız olarak ihtiyaç yönetiminde daha ince ayrıntı sağlamak ve "ayrılmak" için kullanılabilecek bir ``ScheduleCommand`` sınıfı (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__, `C++<https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1ScheduleCommand.html>`__) sunar.

source: Advanced users who wish to re-use a command instance and are *certain* that it is safe to do so may bypass this restriction with the ``clearGroupedCommand()`` `method <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#clearGroupedCommand(edu.wpi.first.wpilibj2.command.Command)>`__ in the ``CommandGroupBase`` class.
tr_tr: Bir komut örneğini yeniden kullanmak isteyen ve bunu yapmanın güvenli olduğundan *emin* olan ileri düzey kullanıcılar, ``CommandGroupBase`` sınıfındaki ``clearGroupedCommand()`` `yöntemi<https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#clearGroupedCommand(edu.wpi.first.wpilibj2.command.Command)>`__ ile bu kısıtlamayı atlayabilir.
