Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/command-scheduler.po
Languages: es_mx, fr_ca, zh_cn

source: The Command Scheduler
es_mx: El planificador de comandos
fr_ca: Le planificateur de commandes
zh_cn: 命令调度程序

source: The ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html>`__) is the class responsible for actually running commands. Each iteration (ordinarily once per 20ms), the scheduler polls all registered buttons, schedules commands for execution accordingly, runs the command bodies of all scheduled commands, and ends those commands that have finished or are interrupted.
fr_ca: La classe ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html>`__) est la classe responsable de l’exécution des commandes. Chaque itération (habituellement une toutes les 20ms), le planificateur sonde tous les boutons enregistrés, planifie les commandes pour l’exécution en conséquence, exécute les corps des commandes de toutes les commandes sur la liste des commandes à exécuter, et met fin aux commandes dont l'exécution normale a pris fin ou sont interrompues.

source: The ``CommandScheduler`` also runs the ``periodic()`` method of each registered ``Subsystem``.
es_mx: El ``CommandScheduler`` también ejecuta el método ``periodic()`` de cada `` Subsistema`` registrado.
fr_ca: Le ``CommandScheduler`` exécute aussi la méthode ``periodic()`` de chaque ``Subsystem`` enrégistré.
zh_cn: “CommandScheduler”还运行每个已注册“Subsystem”的“periodic()”方法。

source: Using the Command Scheduler
es_mx: Uso del programador de comandos
fr_ca: Utiliser le planificateur de commandes
zh_cn: 使用命令调度程序

source: The ``CommandScheduler`` is a *singleton*, meaning that it is a globally-accessible class with only one instance. Accordingly, in order to access the scheduler, users must call the ``CommandScheduler.getInstance()`` command.
es_mx: El ``CommandScheduler`` es un *singleton*, lo que significa que es una clase accesible globalmente con una sola instancia. En consecuencia, para acceder al programador, los usuarios deben llamar al comando ``CommandScheduler.getInstance()``.
fr_ca: Le ``CommandScheduler`` est un *singleton*, ce qui veux dire qu'il est une classe accessible globalement avec une seule instance. Donc, pour accéder au planificateur, l'utilisateur devra appeler la commande ``CommandScheduler.getInstance()``.
zh_cn: "CommandScheduler" 是一个 *单例类* ，这意味着它是一个只有一个实例的全局类。因此，为了访问调度程序，用户必须调用 "CommandScheduler.getInstance()" 命令。

source: For the most part, users do not have to call scheduler methods directly - almost all important scheduler methods have convenience wrappers elsewhere (e.g. in the ``Command`` and ``Subsystem`` interfaces).
es_mx: En su mayor parte, los usuarios no tienen que llamar directamente a los métodos del planificador; casi todos los métodos importantes del planificador tienen envoltorios de conveniencia en otros lugares. (ej. en las interfaces de los comandos ``Command`` y ``Subsystem`` ).
fr_ca: En général, l'utilisateur ne doit pas appeler les méthodes du planificateur directement - presque tout les méthodes importantes du planificateur ont des enveloppe de commodité ailleurs (p. ex. dans les interfaces ``Command`` et ``Subsystem``).
zh_cn: 在大多数情况下，用户不必直接调用调度程序方法——几乎所有重要的调度程序方法在其他位置都有方便包装器（例如，在“Command”和“Subsystem”接口中）。

source: However, there is one exception: users *must* call ``CommandScheduler.getInstance().run()`` from the ``robotPeriodic()`` method of their ``Robot`` class. If this is not done, the scheduler will never run, and the command framework will not work. The provided command-based project template has this call already included.
es_mx: Sin embargo, hay una excepción: los usuarios *deben* llamar a ``CommandScheduler.getInstance().run()`` del método ``robotPeriodic()`` de su clase ``Robot`` . Si no se hace esto, el programador nunca se ejecutará y el marco de comandos no funcionará. La plantilla de proyecto a base de comandos proporcionada ya tiene esta llamada incluida.
fr_ca: Cependant, il y a une exception: l'utilisateur *doit* appeler ``CommandScheduler.getInstance().run()`` de la méthode ``robotPeriodic()`` de la classe ``Robot``. Si ce n'est pas effectué, le planificateur ne s'exécutera jamais et le cadre d'application des commandes ne fonctionnera pas. Le modèle de projet orienté commande fourni inclus déjà cet appel.
zh_cn: 但是，有一个例外：用户必须从其“Robot”类的“robotPeriodic()”方法中调用“CommandScheduler.getInstance().run()”。如果不这样做，则调度程序将永远不会运行，并且命令框架将无法运行。提供的基于命令的项目模板已包含此调用。

source: The ``schedule()`` Method
es_mx: El método ``schedule()``
fr_ca: La méthode ``schedule()``
zh_cn: “schedule()”方法

source: Flow diagram showing how a scheduled command is evaluated to be run.
fr_ca: Organigramme montrant comment une commande planifiée est évaluée pour être exécutée.

source: To schedule a command, users call the ``schedule()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#schedule(boolean,edu.wpi.first.wpilibj2.command.Command...)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#a26c120054ec626806d740f2c42d9dc4f>`__. This method takes a command (and, optionally, a specification as to whether that command is interruptible), and attempts to add it to list of currently-running commands, pending whether it is already running or whether its requirements are available. If it is added, its ``initialize()`` method is called.
fr_ca: Pour planifier une commande, les utilisateurs appellent la méthode ``schedule()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#schedule(boolean,edu.wpi.first.wpilibj2.command.Command...)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#a26c120054ec626806d740f2c42d9dc4f>`__. Cette méthode prend une commande (et, en option, une spécification quant à savoir si cette commande est interrompable), et tente de l’ajouter à la liste des commandes actuellement en cours d’exécution, en attendant si elle est déjà en cours d’exécution ou si les ressources qu'elle requiert sont disponibles. Si elle est ajoutée, sa méthode ``initialize()`` est appelée.

source: The Scheduler Run Sequence
es_mx: La secuencia de ejecución del programador
fr_ca: La séquence d'exécution du planificateur
zh_cn: 调度程序运行顺序

source: The ``initialize()`` method of each ``Command`` is called when the command is scheduled, which is not necessarily when the scheduler runs (unless that command is bound to a button).
es_mx: El método ``initialize()`` de cada ``Comando`` es llamado cuando el comando es programado, lo cual no es necesariamente cuando un programador este ejecutándose (a menos que ese comando este atado a un botón).
fr_ca: La méthode ``initialize()`` de chaque ``Command`` est appelée lorsque la commande est programmée, ce qui n'est pas forcément quand le planificateur s'exécute (sauf si cette commande est liée à un bouton).
zh_cn: 每个“Command”的“initialize()”方法都是在调度命令时调用的，而不必在调度程序运行时调用（除非该命令已绑定到按钮）。

source: Flow diagram that show the sequence of each individual command.
fr_ca: Organigramme qui montre la séquence de chaque commande individuelle.

source: What does a single iteration of the scheduler's ``run()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#run()>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#aa5000fa52e320da7ba72c196f34aa0f5>`__) actually do? The following section walks through the logic of a scheduler iteration.
fr_ca: Que fait réellement une seule itération de la méthode ``run()`` du planificateur de commandes (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#run()>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#aa5000fa52e320da7ba72c196f34aa0f5>`__) ? La section suivante passe en revue la logique d’une itération du planificateur de commandes.

source: Step 1: Run Subsystem Periodic Methods
es_mx: Paso 1: ejecutar los métodos periódicos del subsistema
fr_ca: Étape 1: exécuter les méthodes périodique des sous-systèmes
zh_cn: 步骤1：运行子系统定期方法

source: First, the scheduler runs the ``periodic()`` method of each registered ``Subsystem``.
es_mx: Primero, el programador ejecuta el método ``periodic()`` de cada ``Subsistema`` registrado.
fr_ca: Premièrement, le planificateur exécute la méthode ``periodic()`` de chaque ``Subsystem`` enregistré.
zh_cn: 首先，调度程序对每个已注册的“子系统”运行“periodic()”方法。

source: Step 2: Poll Command Scheduling Triggers
es_mx: Paso 2: Activadores de programación de comandos
fr_ca: Étape 2: sonder les déclencheurs de planification de commande
zh_cn: 步骤2：轮询命令调度触发器

source: For more information on how trigger bindings work, see :doc:`binding-commands-to-triggers`
es_mx: Para obtener más información sobre cómo funcionan los enlaces de activadores, consulte :doc:`binding-commands-to-triggers`
fr_ca: Pour plus d'informations sur le fonctionnement des liens de déclencheurs, voir :doc:`binding-commands-to-triggers`
zh_cn: 有关触发器绑定如何工作的更多信息，请参阅:doc:`binding-commands-to-triggers`

source: Secondly, the scheduler polls the state of all registered triggers to see if any new commands that have been bound to those triggers should be scheduled. If the conditions for scheduling a bound command are met, the command is scheduled and its ``Initialize()`` method is run.
es_mx: En segundo lugar, el programador sondea el estado de todos los desencadenantes registrados para ver si se debe programar algún comando nuevo que se haya vinculado a esos desencadenantes. Si se cumplen las condiciones para programar un comando vinculado, se programa el comando y se ejecuta su método ``Initialize()``.
fr_ca: Deuxièmement, le planificateur sonde l'état de tous les déclencheurs enregistres pour voir si des nouvelles commandes qui ont été liées à ces déclencheurs devraient être planifiées. Si les conditions pour planifier une commande liée sont remplies, la commande est planifié et sa méthode ``initialize()`` est exécutée.
zh_cn: 其次，调度程序轮询所有已注册触发器的状态，以查看是否应调度已绑定到这些触发器的任何新命令。如果满足调度绑定命令的条件，则对命令进行调度并运行其“Initialize()”方法。

source: Step 3: Run/Finish Scheduled Commands
es_mx: Paso 3: ejecutar/finalizar comandos programados
fr_ca: Étape 3: exécuter/terminer les commandes planifiées
zh_cn: 步骤3：运行/完成计划的命令

source: Thirdly, the scheduler calls the ``execute()`` method of each currently-scheduled command, and then checks whether the command has finished by calling the ``isFinished()`` method. If the command has finished, the ``end()`` method is also called, and the command is de-scheduled and its required subsystems are freed.
es_mx: En tercer lugar, el planificador llama al método ``execute()`` de cada comando programado actualmente, y luego verifica si el comando ha terminado llamando al método ``isFinished()``. Si el comando ha finalizado, también se llama al método ``end()``, y el comando se desprograma y se liberan los subsistemas necesarios.
fr_ca: Troisièmement, le planificateur appelle la méthode ``execute()`` de chaque commande en cours d'exécution après avoir vérifié si la commande est terminé en appelant la méthode ``isFinished()``. Si la commande est terminé, la méthode ``end()`` est appelée aussi, et la commande est dé-planifiée et ses sous-systèmes requis sont libérés.
zh_cn: 第三，调度程序调用每个当前调度的命令的“execute()”方法，然后通过调用“isFinished()”方法检查命令是否完成。如果命令已完成，则还将调用“end()”方法，并对该命令进行调度，并释放其所需的子系统。

source: Note that this sequence of calls is done in order for each command - thus, one command may have its ``end()`` method called before another has its ``execute()`` method called. Commands are handled in the order they were scheduled.
es_mx: Tenga en cuenta que esta secuencia de llamadas se realiza en orden para cada comando; por lo tanto, un comando puede tener su método ``end()`` llamado antes de que otro tenga su método ``execute()`` llamado. Los comandos se manejan en el orden en que fueron programados.
fr_ca: Notez qui cette séquence d'appels est faite en ordre pour chaque commande - ainsi, une commande peut avoir sa méthode ``end()`` appelée avant qu'une autre ait sa méthode ``execute()`` appelée. Les commandes sont manipulées dans l'ordre dont elles ont été planifiées.
zh_cn: 请注意，此调用顺序是针对每个命令按顺序进行的——因此，一个命令可能会先调用其“end()”方法，而另一命令可能会调用其“execute()”方法。命令按计划的顺序处理。

source: Step 4: Schedule Default Commands
es_mx: Paso 4: Programar comandos predeterminados
fr_ca: Étape 4: planifier les commandes par défaut
zh_cn: 步骤4：调度默认命令

source: Finally, any registered ``Subsystem`` has its default command scheduled (if it has one). Note that the ``initialize()`` method of the default command will be called at this time.
es_mx: Finalmente, cualquier ``Subsistema`` registrado tiene su comando predeterminado programado (si lo tiene). Tenga en cuenta que en este momento se llamará al método ``initialize()`` del comando predeterminado.
fr_ca: Finalement, chaque ``Subsystem`` enrégistré a sa commande par défaut planifiée (si elle existe). Notez que la méthode ``initialize()`` de la commande de défaut sera appelée à ce moment.
zh_cn: 最后，任何已注册的“子系统”都有其默认命令（如果有的话）。注意，此时将调用默认命令的“initialize()”方法。

source: Disabling the Scheduler
es_mx: Deshabilitar el programador
fr_ca: Désactiver le Planificateur
zh_cn: 禁用调度程序

source: The scheduler can be disabled by calling ``CommandScheduler.getInstance().disable()``. When disabled, the scheduler's ``schedule()`` and ``run()`` commands will not do anything.
es_mx: El planificador se puede desactivar llamando a ``CommandScheduler.getInstance().disable()``. Cuando está deshabilitado, los comandos ``schedule()`` y ``run()`` del programador no harán nada.
fr_ca: Le planificateur peut être désactiver en appelant ``CommandScheduler.getInstance().disable()``. Quand il est désactivé, les commandes ``schedule()`` et ``run()`` du planificateur ne font rien.
zh_cn: 可以通过调用“CommandScheduler.getInstance().disable()”来禁用调度程序。禁用时，调度程序的“schedule()”和“run()”命令将不执行任何操作。

source: The scheduler may be re-enabled by calling ``CommandScheduler.getInstance().enable()``.
es_mx: El programador se puede volver a habilitar al llamar a ``CommandScheduler.getInstance().enable()``.
fr_ca: Le planificateur peut être ré-activé en appelant ``CommandScheduler.getInstance().enable()``.
zh_cn: 可以通过调用“CommandScheduler.getInstance.()enable()”来重新启用调度程序。

source: Command Event Methods
es_mx: Métodos de eventos de comando
fr_ca: Méthodes d’évènement de commande
zh_cn: 命令事件方法

source: Occasionally, it is desirable to have the scheduler execute a custom action whenever a certain command event (initialization, execution, or ending) occurs. This can be done with the following methods:
fr_ca: Parfois, il est souhaitable que le planificateur exécute une action personnalisée chaque fois qu'un certain événement de commande (initialisation, exécution ou fin) se produit. Cela peut être fait avec les méthodes suivantes :

source: The ``onCommandInitialize`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandInitialize(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#a5f983f0e45b0500c96eebe52780324d4>`__) runs a specified action whenever a command is initialized.
fr_ca: La méthode ``onCommandInitialize`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandInitialize(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#a5f983f0e45b0500c96eebe52780324d4>`__) exécute une action spécifiée chaque fois qu’une commande est initialisée.

source: The ``onCommandExecute`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandExecute(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#a58c538f4b8dd95e266e4a99167aa7f99>`__) runs a specified action whenever a command is executed.
fr_ca: La méthode ``onCommandExecute`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandExecute(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#a58c538f4b8dd95e266e4a99167aa7f99>`__) exécute une action spécifiée chaque fois qu’une commande est exécutée.

source: The ``onCommandFinish`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandFinish(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#a068e61446afe2341cc0651f0dfd2a55f>`__) runs a specified action whenever a command finishes normally (i.e. the ``isFinished()`` method returned true).
fr_ca: La méthode ``onCommandFinish`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandFinish(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#a068e61446afe2341cc0651f0dfd2a55f>`__) exécute une action spécifiée chaque fois qu’une commande se termine normalement (c’est-à-dire que la méthode ``isFinished()`` retourne la valeur logique true).

source: The ``onCommandInterrupt`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandInterrupt(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#ab5ba99a542aa778a76726d7c68461bf0>`__) runs a specified action whenever a command is interrupted (i.e. by being explicitly canceled or by another command that shares one of its requirements).
fr_ca: La méthode ``onCommandInterrupt`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandInterrupt(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command_scheduler.html#ab5ba99a542aa778a76726d7c68461bf0>`__) exécute une action spécifiée chaque fois qu’une commande est interrompue (c’est-à-dire en étant explicitement annulée ou par une autre commande qui partage l’une des ressources qu'elle requiert pour son exécution).

source: A typical use-case for these methods is adding markers in an event log whenever a command scheduling event takes place, as demonstrated in the SchedulerEventLogging example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/schedulereventlogging>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SchedulerEventLogging>`__):
es_mx: Un caso de uso típico para estos métodos es añadir marcadores en un registro de eventos cada vez que se produce un evento de programación de comandos, como se demuestra en el proyecto de ejemplo SchedulerEventLogging (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/schedulereventlogging>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SchedulerEventLogging>`__):
fr_ca: Un cas d’utilisation typique pour ces méthodes est l’ajout de marqueurs dans un journal d’événements chaque fois qu’un événement défini dans le planificateur de commandes se produit, comme démontré dans le projet d’exemple SchedulerEventLogging (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/schedulereventlogging>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SchedulerEventLogging>`__):

source: The ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html>`__) is the class responsible for actually running commands. Each iteration (ordinarily once per 20ms), the scheduler polls all registered buttons, schedules commands for execution accordingly, runs the command bodies of all scheduled commands, and ends those commands that have finished or are interrupted.
es_mx: El ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html>`__) es la clase responsable de correr los comandos. Cada repetición (normalmente una vez cada 20ms) el scheduler sondea todos los botones registrados, programa los comandos para su ejecución en consecuencia, ejecuta los cuerpos de comando de todos los comandos programados y finaliza los comandos que han finalizado o están interrumpidos
zh_cn: ``CommandScheduler''（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html>`__）是负责实际运行命令的类。每次迭代（通常每20毫秒一次），调度程序都会轮询所有已注册的按钮，调度要执行的命令，运行所有已调度命令的命令主体，并结束已完成或被中断的命令。

source: To schedule a command, users call the ``schedule()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#schedule(boolean,edu.wpi.first.wpilibj2.command.Command...)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#a26c120054ec626806d740f2c42d9dc4f>`__. This method takes a command (and, optionally, a specification as to whether that command is interruptible), and attempts to add it to list of currently-running commands, pending whether it is already running or whether its requirements are available. If it is added, its ``initialize()`` method is called.
es_mx: Para programar un comando, los usuarios llaman al metodo ``schedule()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#schedule(boolean,edu.wpi.first.wpilibj2.command.Command...)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#a26c120054ec626806d740f2c42d9dc4f>`__. Este metodo toma un comando (y opcionalmente, una especificación de si el comando es interrupible), e intenta añadirlo a la lista de comandos que se están corriendo en este momento, pendiente de si ya se está ejecutando o si sus requisitos están disponibles. si es añadido, su método ``initialize()`` es llamado.
zh_cn: 为了安排命令，用户调用schedule（）方法（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#schedule(boolean,edu.wpi.first.wpilibj2.command.Command...)>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#a26c120054ec626806d740f2c42d9dc4f>`__。该方法接受命令（以及可选的关于该命令是否可中断的规范），并尝试将其添加到当前正在运行的命令列表中，等待它是否已在运行或是否满足要求（如果已添加），将调用其“ initialize（）”方法。
