Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/convenience-features.po
Languages: fr_ca

source: Convenience Features
fr_ca: Fonctions pratiques

source: While the previously-described methodologies will work fine for writing command-based robot code, the command-based libraries contain several convenience features for more-advanced users that can greatly reduce the verbosity/complexity of command-based code. It is highly recommended that users familiarize themselves with these features to maximize the value they get out of the command-based libraries.
fr_ca: Alors que les méthodologies décrites précédemment fonctionneront bien pour écrire du code de robot basé sur des commandes, les librairies basées sur des commandes contiennent plusieurs fonctionnalités pratiques pour les utilisateurs plus avancés qui peuvent réduire considérablement la verbosité/complexité du code basé sur les commandes. Il est fortement recommandé aux utilisateurs de se familiariser avec ces fonctionnalités pour maximiser la valeur qu'ils retirent des librairies orientées commandes.

source: Inline Command Definitions
fr_ca: Définitions des commandes en ligne

source: While users are able to create commands by explicitly writing command classes (either by subclassing ``CommandBase`` or implementing ``Command``), for many commands (such as those that simply call a single subsystem method) this involves a lot of wasteful boilerplate code. To help alleviate this, many of the prewritten commands included in the command-based library may be *inlined* - that is, the command body can be defined in a single line of code at command construction.
fr_ca: Alors que les utilisateurs peuvent créer des commandes en écrivant explicitement des classes de commandes (soit en sous-classant ``CommandBase`` ou en implémentant ``Command``), pour de nombreuses commandes (telles que celles qui appellent simplement une seule méthode de sous-système), cela implique beaucoup de code inutile. Pour aider à atténuer cela, la plupart des commandes pré-écrites incluses dans la librairie basée sur les commandes peuvent être *inline* - c'est-à-dire que le corps de la commande peut être défini dans une seule ligne de code lors de la construction de la commande.

source: Passing Subroutines As Parameters
fr_ca: Passer des sous-programmes en tant que paramètres

source: In order to inline a command definition, users require some way to specify what code the commands will run as constructor parameters. Fortunately, both Java and C++ offer users the ability to pass subroutines as parameters.
fr_ca: Afin d'insérer une définition de commande, les utilisateurs ont besoin d'un moyen de spécifier le code que les commandes exécuteront en tant que paramètres de constructeur. Heureusement, Java et C ++ offrent aux utilisateurs la possibilité de transmettre des sous-programmes en tant que paramètres.

source: Method References (Java)
fr_ca: Références de méthode (Java)

source: In Java, a reference to a subroutine that can be passed as a parameter is called a method reference. The general syntax for a method reference is ``object::method``. Note that no method parameters are included, since the method *itself* is the parameter. The method is not being called - it is being passed to another piece of code (in this case, a command) so that *that* code can call it when needed. For further information on method references, see `the official Oracle documentation <https://docs.oracle.com/javase/tutorial/java/javaOO/methodreferences.html>`__.
fr_ca: En Java, une référence à un sous-programme qui peut être passé en tant que paramètre est appelée une référence de méthode. La syntaxe générale d'une référence de méthode est ``object::method``. Notez qu'aucun paramètre de méthode n'est inclus, puisque la méthode *elle-même* est le paramètre. La méthode n'est pas appelée - elle est transmise à un autre bout de code (dans ce cas, une commande) afin que *ce* code puisse l'appeler en cas de besoin. Pour plus d'informations sur les références de méthodes, voir `la documentation officielle d'Oracle <https://docs.oracle.com/javase/tutorial/java/javaOO/methodreferences.html>`__.

source: Lambda Expressions (Java)
fr_ca: Expressions Lambda (Java)

source: While method references work well for passing a subroutine that has already been written, often it is inconvenient/wasteful to write a subroutine solely for the purpose of sending as a method reference, if that subroutine will never be used elsewhere. To avoid this, Java also supports a feature called "lambda expressions." A lambda expression is an inline method definition - it allows a subroutine to be defined *inside of a parameter list*. For specifics on how to write Java lambda expressions, see `this tutorial <https://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html#syntax>`__.
fr_ca: Alors que les références de méthode fonctionnent bien pour passer un sous-programme qui a déjà été écrit, il est souvent peu pratique/inutile d'écrire un sous-programme uniquement dans le but de l'envoyer comme référence de méthode, si ce sous-programme ne sera jamais utilisé ailleurs. Pour éviter cela, Java prend également en charge une fonctionnalité appelée "expressions lambda". Une expression lambda est une définition de méthode "inline" - elle permet à un sous-programme d'être défini *à l'intérieur d'une liste de paramètres*. Pour plus de détails sur l'écriture d'expressions lambda Java, consultez `ce tutoriel <https://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html#syntax>`__.

source: Lambda Expressions (C++)
fr_ca: Expressions Lambda (C ++)

source: Due to complications in C++ semantics, capturing ``this`` in a C++ lambda can cause a null pointer exception if done from a component command of a command group. Whenever possible, C++ users should capture relevant command members explicitly and by value. For more details, see `here <https://github.com/wpilibsuite/allwpilib/issues/3109>`__.
fr_ca: En raison de complications dans la sémantique C ++, la capture de `` this '' dans un lambda C ++ peut provoquer une exception de pointeur nul si elle est effectuée à partir d'une commande de composant d'un groupe de commandes. Dans la mesure du possible, les utilisateurs C ++ doivent capturer les membres de commande pertinents de manière explicite et par valeur. Pour plus de détails, voir `ici <https://github.com/wpilibsuite/allwpilib/issues/3109>`__.

source: C++ lacks a close equivalent to Java method references - pointers to member functions are generally not directly useable as parameters due to the presence of the implicit ``this`` parameter. However, C++ does offer lambda expressions - in addition, the lambda expressions offered by C++ are in many ways more powerful than those in Java. For specifics on how to write C++ lambda expressions, see `cppreference <https://en.cppreference.com/w/cpp/language/lambda>`__.
fr_ca: C++ n'a pas d'équivalent proche des références de méthode Java - les pointeurs vers les fonctions membres ne sont généralement pas directement utilisables en tant que paramètres en raison de la présence du paramètre implicite ``this``. Cependant, C++ propose des expressions lambda - en outre, les expressions lambda proposées par C++ sont à bien des égards plus puissantes que celles de Java. Pour plus d'informations sur l'écriture d'expressions lambda C++, consultez `cppreference <https://en.cppreference.com/w/cpp/language/lambda>`__.

source: Inlined Command Example
fr_ca: Exemple de commande "inline"

source: So, what does an inlined command definition look like in practice?
fr_ca: Alors, à quoi ressemble une définition de commande "inline" dans la pratique?

source: The ``InstantCommand`` class provides an example of a type of command that benefits greatly from inlining. Consider the following from the HatchBotInlined example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotInlined>`__):
fr_ca: La classe ``InstantCommand`` fournit un exemple d’un type de commande qui bénéficie grandement de l’inlining. Considérez ce qui suit du projet HatchBotInlined example (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotInlined>`__):

source: C++ (Header)
fr_ca: C++ (Header ou en-tête)

source: Instead of wastefully writing separate ``GrabHatch`` and ``ReleaseHatch`` commands which call only one method before ending, both can be accomplished with a simple inline definition by passing appropriate subsystem method.
fr_ca: Au lieu d'écrire inutilement des commandes séparées ``GrabHatch`` et ``ReleaseHatch`` qui n'appellent qu'une seule méthode avant de se terminer, les deux peuvent être accomplies avec une simple définition "inline" en passant la méthode du sous-système appropriée.

source: Included Command Types
fr_ca: Types de commandes incluses

source: The command-based library includes a variety of pre-written commands for commonly-encountered use cases. Many of these commands are intended to be used "out-of-the-box" via `inlining <#inline-command-definitions>`_, however they may be subclassed, as well. A list of the included pre-made commands can be found below, along with brief examples of each - for more rigorous documentation, see the API docs (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/package-summary.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html>`__).
fr_ca: La librairie orientée commandes comprend une variété de commandes préalablement programmées pour les cas d’utilisation couramment rencontrés. Beaucoup de ces commandes sont de nature "prêtes-à-être-utilisés" via le mécanisme appelé `inlining <#inline-command-definitions>`_, cependant, elles peuvent également être dérivées en sous-classes. Une liste des commandes pré-programmées et incluses dans la distribution peut être trouvée ci-dessous, ainsi que de brefs exemples de l'utilisation de chacune d'elles- pour une documentation plus rigoureuse, reférez-vous aux documents des APIs (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/package-summary.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html>`__).

source: The ``ConditionalCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ConditionalCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_conditional_command.html>`__) runs one of two commands when executed, depending on a user-specified true-or-false condition:
fr_ca: La classe``ConditionalCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ConditionalCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_conditional_command.html>`__) permet l'exécuttion de l’une des deux commandes suivantes lorsqu’elle est elle-même exécutée, en fonction d’une condition true ou false spécifiée par l’utilisateur:

source: While the Java version of SelectCommand simply uses an ``Object`` as a key, the C++ version is templated on the key type.
fr_ca: Alors que la version Java de SelectCommand utilise simplement un ``Object`` comme clé, la version C++ est basée sur le type de clé.

source: An alternate version of SelectCommand simply takes a method that supplies the command to be run - this can be very succinct, but makes inferring the command's requirements impossible, and so leaves the user responsible for manually adding the requirements to the SelectCommand.
fr_ca: Une version alternative de SelectCommand prend simplement une méthode qui fournit la commande à exécuter - cela peut être très succinct, mais rend impossible à déduire les exigences de la commande, et laisse ainsi l'utilisateur responsable de l'ajout manuel des exigences à SelectCommand.

source: The ``SelectCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SelectCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_select_command.html>`__) is a generalization of the ``ConditionalCommand`` class that runs one of a selection of commands based on the value of a user-specified selector. The following example code is taken from the SelectCommand example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SelectCommand>`__):
fr_ca: La classe ``SelectCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SelectCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_select_command.html>`__) est une généralisation de la classe ``ConditionalCommand`` qui exécute l’une des commandes d’une sélection basée sur la valeur d’un sélecteur spécifié par l’utilisateur. L’exemple de code suivant est tiré de l’exemple de projet SelectCommand (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SelectCommand>`__):

source: The ``InstantCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/InstantCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_instant_command.html>`__) executes a single action on initialization, and then ends immediately:
fr_ca: La classe``InstantCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/InstantCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_instant_command.html>`__) exécute une seule action lors de l’initialisation, puis se termine immédiatement:

source: The ``RunCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RunCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_run_command.html>`__) runs a specified method repeatedly in its ``execute()`` block. It does not have end conditions by default; users can either subclass it, or `decorate <#command-decorator-methods>`_ it to add them.
fr_ca: La classe ``RunCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RunCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_run_command.html>`__) exécute de manière répétitive une méthode spécifiée dans son bloc ``execute()``. Elle n’a pas de conditions de fin par défaut; les utilisateurs peuvent soit la dériver en sous-classe, soit `la décorer <#command-decorator-methods>`_ pour les ajouter.

source: The ``StartEndCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/StartEndCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_start_end_command.html>`__) executes an action when starting, and a second one when ending. It does not have end conditions by default; users can either subclass it, or `decorate <#command-decorator-methods>`_ an inlined command to add them.
fr_ca: La classe ``StartEndCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/StartEndCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_start_end_command.html>`__) exécute une action au démarrage, et une seconde action à la fin. Il n’a pas de conditions de fin par défaut; les utilisateurs peuvent soit la dériver en sous-classes, soit `décorer <#command-decorator-methods>`_ une commande incorporée (inlined) pour les ajouter.

source: The ``FunctionalCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/FunctionalCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_functional_command.html>`__) allows all four ``Command`` methods to be passed in as method references or lambdas:
fr_ca: La classe ``FunctionalCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/FunctionalCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_functional_command.html>`__) permet de passer les quatre méthodes ``Command`` comme références de méthode ou lambdas :

source: The ``PrintCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PrintCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_print_command.html>`__) prints a given string.
fr_ca: La classe ``PrintCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PrintCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_print_command.html>`__) affiche à l'écran une chaîne de caractères donnée.

source: The ``ScheduleCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_schedule_command.html>`__) schedules a specified command, and ends instantly:
fr_ca: La classe ``ScheduleCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_schedule_command.html>`__) planifie une commande spécifiée et se termine instantanément:

source: This is often useful for "forking off" from command groups: by default, commands in command groups are run *through* the command group, and are never themselves seen by the scheduler. Accordingly, their requirements are added to the group's requirements. While this is usually fine, sometimes it is undesirable for the entire command group to gain the requirements of a single command - a good solution is to "fork off" from the command group and schedule that command separately.
fr_ca: Ceci est souvent utile pour "sortir" du groupe de commandes: par défaut, les commandes des groupes de commandes sont exécutées *via* le groupe de commandes, et ne sont jamais elles-mêmes vues par le planificateur. En conséquence, leurs exigences s'ajoutent aux exigences du groupe. Bien que ce soit généralement bien, il n'est parfois pas souhaitable que tout le groupe de commandes obtienne les exigences d'une seule commande - une bonne solution est de «sortir» du groupe de commandes et de planifier cette commande séparément.

source: The ``ProxyScheduleCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ProxyScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_proxy_schedule_command.html>`__) schedules a specified command, and does not end until that command ends:
fr_ca: La classe ``ProxyScheduleCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ProxyScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_proxy_schedule_command.html>`__) planifie une commande spécifiée et ne se termine pas tant que cette commande n’est pas terminée:

source: This is often useful for "forking off" from command groups: by default, commands in command groups are run *through* the command group, and are never themselves seen by the scheduler. Accordingly, their requirements are added to the group's requirements. While this is usually fine, sometimes it is undesirable for the entire command group to gain the requirements of a single command - a good solution is to "fork off" from the command group and schedule the command separately.
fr_ca: Ceci est souvent utile pour "sortir" des groupes de commandes: par défaut, les commandes des groupes de commandes sont exécutées *via* le groupe de commandes, et ne sont jamais elles-mêmes vues par le planificateur. En conséquence, leurs exigences s'ajoutent aux exigences du groupe. Bien que ce soit généralement bien, il n'est parfois pas souhaitable que tout le groupe de commandes obtienne les exigences d'une seule commande - une bonne solution est de «sortir» du groupe de commandes et de planifier la commande séparément.

source: The ``WaitCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_wait_command.html>`__) does nothing, and ends after a specified period of time elapses after its initial scheduling:
fr_ca: La classe ``WaitCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_wait_command.html>`__) ne fait rien, et se termine après qu'une période de temps spécifiée se soit s’écoulée après sa planification initiale:

source: This is often useful as a component of a command group.
fr_ca: Ceci est souvent utile en tant que composant d'un groupe de commandes.

source: ``WaitCommand`` can also be subclassed to create a more complicated command that runs for a period of time. If ``WaitCommand`` is used in this method, the user must ensure that the ``WaitCommand``'s ``Initialize``, ``End``, and ``IsFinished`` methods are still called in order for the WaitCommand's timer to work.
fr_ca: ``WaitCommand`` peut également être dérivée (sous-classée) pour créer une commande plus compliquée qui s’exécute pendant un certain temps. Si ``WaitCommand`` est utilisée dans cette méthode, l’utilisateur doit s’assurer que les méthodes ``WaitCommand`` ``Initialize``, ``End`` et ``IsFinished`` sont toujours appelées pour le timer de WaitCommand fonctionne.

source: The match timer used by WaitUntilCommand does *not* provide an official match time! While it is fairly accurate, use of this timer can *not* guarantee the legality of your robot's actions.
fr_ca: La minuterie de match utilisé par WaitUntilCommand ne fournit *pas* un temps de match officiel! Bien qu'elle soit assez précise, l'utilisation de cette minuterie ne peut *pas* garantir la légalité des actions de votre robot.

source: The ``WaitUntilCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitUntilCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_wait_until_command.html>`__) does nothing, and ends once a specified condition becomes true, or until a specified match time passes.
fr_ca: La classe ``WaitUntilCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitUntilCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_wait_until_command.html>`__) ne fait rien, et se termine une fois qu’une condition spécifiée devient vraie, ou jusqu’à ce qu’un temps de jeu spécifié s'écoule.
