Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/convenience-features.po
Languages: fr_ca

source: The ``PerpetualCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PerpetualCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_perpetual_command.html>`__) runs a given command with its end condition removed, so that it runs forever (unless externally interrupted):
fr_ca: La classe ``PerpetualCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PerpetualCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_perpetual_command.html>`__) exécute une commande donnée avec sa condition de fin supprimée, de sorte qu’elle s'exécute pour toujours (sauf si elle est interrompue de l’extérieur):

source: Command Decorator Methods
fr_ca: Méthodes "Command Decorator"

source: The ``Command`` interface contains a number of defaulted "decorator" methods which can be used to add additional functionality to existing commands. A "decorator" method is a method that takes an object (in this case, a command) and returns an object of the same type (i.e. a command) with some additional functionality added to it. A list of the included decorator methods with brief examples is included below - for rigorous documentation, see the API docs (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html>`__).
fr_ca: L'interface ``Command`` contient un certain nombre de méthodes "décoratrices" ou "decorator" par défaut qui peuvent être utilisées pour ajouter des fonctionnalités supplémentaires aux commandes existantes. Une méthode "décoratrice" est une méthode qui prend un objet (dans ce cas, une commande) et renvoie un objet du même type (c’est-à-dire une commande) avec quelques fonctionnalités supplémentaires qui lui été ajoutées au passage. Une liste des méthodes décoratrices fournies avec de brefs exemples est incluse ci-dessous - pour une documentation rigoureuse, voir les documents des APIs (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html>`__).

source: The ``withTimeout()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withTimeout(double)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html#a7d1ba6905ebca2f7e000942b318b59ae>`__) adds a timeout to a command. The decorated command will be interrupted if the timeout expires:
fr_ca: Le décorateur ``withTimeout()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withTimeout(double)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html#a7d1ba6905ebca2f7e000942b318b59ae>`__) ajoute un délai d'attente à une commande. La commande décorée sera interrompue si le délai expire:

source: The ``andThen()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#andThen(edu.wpi.first.wpilibj2.command.Command...)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html#ab0cc63118f578b328222ab2e9f1b7b65>`__) adds a method to be executed after the command ends:
fr_ca: La méthode décoratrice ``andThen()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#andThen(edu.wpi.first.wpilibj2.command.Command...)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html#ab0cc63118f578b328222ab2e9f1b7b65>`__) ajoute une méthode à exécuter après la fin de l'exécution de la commande:

source: The ``beforeStarting()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#beforeStarting(edu.wpi.first.wpilibj2.command.Command)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html#ab8d1d6ccf24f90ffa9be270544dd7162>`__) adds a method to be executed before the command starts:
fr_ca: La méthode décoratrice ``beforeStarting()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#beforeStarting(edu.wpi.first.wpilibj2.command.Command)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html#ab8d1d6ccf24f90ffa9be270544dd7162>`__) ajoute une méthode à exécuter avant le début de l'exécution de la commande :

source: alongWith (Java only)
fr_ca: alongWith (Java seulement)

source: This decorator is not supported in C++ due to technical constraints - users should simply construct a parallel command group the ordinary way instead.
fr_ca: Ce décorateur n'est pas pris en charge en C ++ en raison de contraintes techniques - les utilisateurs doivent simplement construire un groupe de commandes parallèle de la manière habituelle.

source: The ``alongWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#alongWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a :ref:`parallel command group <docs/software/commandbased/command-groups:ParallelCommandGroup>`. All commands will execute at the same time and each will end independently of each other:
fr_ca: La méthode `décoratrice <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#alongWith(edu.wpi.first.wpilibj2.command.Command...)>` ``alongWith()`` retourne un :ref:`parallel command group <docs/software/commandbased/command-groups:ParallelCommandGroup>`. Toutes les commandes s'exécuteront simultanément et l'exécution de chaque commande se terminera indépendamment des autres.

source: raceWith (Java only)
fr_ca: raceWith (Java seulement)

source: This decorator is not supported in C++ due to technical constraints - users should simply construct a parallel race group the ordinary way instead.
fr_ca: Ce décorateur n'est pas pris en charge en C ++ en raison de contraintes techniques - les utilisateurs doivent simplement construire un groupe de type "race" (ou course) parallèle de la manière habituelle.

source: The ``raceWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#raceWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a :ref:`parallel race group <docs/software/commandbased/command-groups:ParallelRaceGroup>` that ends as soon as the first command ends. At this point all others are interrupted. It doesn't matter which command is the calling command:
fr_ca: La méthode `décoratrice <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#raceWith(edu.wpi.first.wpilibj2.command.Command...)>`__ ``raceWith()`` retourne :ref:`un groupe de commandes parallèles en compétition <docs/software/commandbased/command-groups:ParallelRaceGroup>` , dont l'exécution se termine aussitôt que l'exécution de la première commande prend s'achève. En ce moment-là, l'exécution de toutes les autres commandes est interrompue. Et ce peu importe la commande appellante.

source: deadlineWith (Java only)
fr_ca: deadlineWith (Java seulement)

source: This decorator is not supported in C++ due to technical constraints - users should simply construct a parallel deadline group the ordinary way instead.
fr_ca: Ce décorateur n'est pas pris en charge en C++ en raison de contraintes techniques - les utilisateurs doivent simplement créer un groupe de type "deadline" (échéance) parallèle de la manière habituelle.

source: The ``deadlineWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#deadlineWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a :ref:`parallel deadline group <docs/software/commandbased/command-groups:ParallelDeadlineGroup>` with the calling command being the deadline. When this deadline command ends it will interrupt any others that are not finished:
fr_ca: La méthode `décoratrice <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#deadlineWith(edu.wpi.first.wpilibj2.command.Command...)>`__ ``deadlineWith()`` retourne un :ref:`groupe deadline (échéance) de commandes en parallèle <docs/software/commandbased/command-groups:ParallelDeadlineGroup>` avec la commande appellante jouant le rôle de deadline. Quand l'exécution de cette deadline s'achève, l'exécution de toutes les autres commandes du groupe encore en cours est interrompue.

source: withName (Java only)
fr_ca: withName (Pour Java uniquement)

source: This decorator is not supported in C++ due to technical constraints - users should set the name of the command inside their command class instead.
fr_ca: Ce décorateur n’est pas supporté en C++ en raison de contraintes techniques - à la place, les utilisateurs devraient définir le nom de la commande à l’intérieur de leur classe de commande.

source: The ``withName()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#withName(java.lang.String)>`__ adds a name to a command. This name will appear on a dashboard when the command is sent via the `sendable interface <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#initSendable(edu.wpi.first.util.sendable.SendableBuilder)>`__.
fr_ca: La méthode `décoratrice <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#withName(java.lang.String)>`__ ``withName()`` ajoute un nom à une commande. Ce nom apparaîtra au dashboard si la commande est envoyée à travers `l’interface sendable <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#initSendable(edu.wpi.first.util.sendable.SendableBuilder)>`__.

source: The ``perpetually()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#perpetually()>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html#a4e72c5be424accbf416cf35be061c918>`__) removes the end condition of a command, so that it runs forever.
fr_ca: La méthode décoratrice ``perpetually()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#perpetually()>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_command.html#a4e72c5be424accbf416cf35be061c918>`__) supprime la condition de fin d'exécution d'une commande, de sorte que cette commande s’exécute pour toujours.

source: Composing Decorators
fr_ca: Décorateurs de composition

source: Remember that decorators, like all command groups, can be composed! This allows very powerful and concise inline expressions:
fr_ca: N'oubliez pas que les décorateurs, comme tous les groupes de commandes, peuvent être composés! Cela permet des expressions en ligne très puissantes et concises:

source: Static Factory Methods for Command Groups (Java only)
fr_ca: Méthodes "Static Factory" pour les groupes de commandes (Java seulement)

source: These factory methods are not included in the C++ command library, as the reduction in verbosity would be minimal - C++ commands should be stack-allocated, removing the need for the ``new`` keyword.
fr_ca: Ces méthodes de type "Factory" ne sont pas incluses dans la librairie de commandes C++, car la réduction de la verbosité serait minimale - les commandes C++ devraient être allouées dans la pile (stack), supprimant ainsi le besoin du mot clé ``new``.

source: If users do not wish to use the ``andThen``, ``alongWith``, ``raceWith``, and ``deadlineWith`` decorators for declaring command groups, but still wish to reduce verbosity compared to calling the constructors, the ``CommandGroupBase`` `class <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html>`__ contains four static factory methods for declaring command groups: ``sequence()``, ``parallel()``, ``race()``, and ``deadline()``. When used from within a command group subclass or in combination with ``import static``, these become extremely concise and greatly aid in command composition:
fr_ca: Si les usagers ne souhaitent pas utiliser les décorateurs ``andThen``, ``alongWith``, ``raceWith``, et ``deadlineWith`` pour déclarer des groupes de commandes, mais souhaitent toujours réduire la verbosité par rapport à l’appel des constructeurs, la `classe <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html>`__ ``CommandGroupBase`` contient quatre méthodes statiques déjà programmées pour déclarer les groupes de commandes : ``sequence()``, ``parallel()``, ``race()``, et ``deadline()``. Lorsqu’ils sont utilisés à partir d’une sous-classe de groupe de commandes ou en combinaison avec l’importation ``import static``, ceux-ci deviennent extrêmement concis et aident grandement à la composition de commandes:
