Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/cpp-command-discussion.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Our initial solution to this was to create a virtual method in ``Command`` called ``TransferOwnership()`` that every subclass of ``Command`` had to override. Such an override would have looked like this:
es_mx: Nuestra solución inicial a esto fue crear un método virtual en ``Command`` llamado ``TransferOwnership()`` que cada subclase de ``Command`` tenía que anular. Tal anulación se habría visto así:
fr_ca: Notre solution initiale à cela était de créer une méthode virtuelle dans ``Command`` appelée ``TransferOwnership()`` que chaque sous-classe de ``Command`` devait remplacer. Un tel remplacement aurait ressemblé à ceci:
tr_tr: Buna ilk çözümümüz, ``Command`` içinde ``TransferOwnership()`` adlı, ``Command`` in her alt sınıfının geçersiz kılmak zorunda olduğu sanal bir yöntem oluşturmaktı. Böyle bir geçersiz kılma şuna benzerdi:
zh_cn: 我们对此的最初解决方案是在“Command”中创建一个虚拟方法，称为“TransferOwnership()”，“Command”的每个子类都必须重写。这样的覆盖看起来像这样：

source: Because the code would be in the derived subclass, ``*this`` would actually point to the desired subclass instance and the user has the type info of the derived class to make the unique pointer.
es_mx: Debido a que el código estaría en la subclase derivada, ``*this`` realmente apuntaría a la instancia de subclase deseada y el usuario tiene la información de tipo de la clase derivada para hacer el puntero único.
fr_ca: Parce que le code serait dans la sous-classe dérivée, ``*this`` pointerait alors vers l'instance souhaitée de la sous-classe, et par conséquant, l'utilisateur dispose alors des informations de type de la classe dérivée pour créer le pointeur unique.
tr_tr: Kod türetilmiş alt sınıfta olacağından, ``*this`` aslında istenen alt sınıf örneğini işaret eder ve kullanıcı, benzersiz işaretçiyi yapmak için türetilmiş sınıfın tür bilgisine sahiptir.
zh_cn: 因为代码将在派生的子类中，所以“*this”实际上将指向所需的子类实例，并且用户具有派生类的类型信息以构成唯一的指针。

source: After a few days of deliberation, a CRTP method was proposed. Here, an intermediary derived class of ``Command`` called ``CommandHelper`` would exist. ``CommandHelper`` would have two template arguments, the original base class and the desired derived subclass. Let's take a look at a basic implementation of ``CommandHelper`` to understand this:
es_mx: Después de unos días de deliberación, se propuso un método CRTP. Aquí, una clase derivada intermedia de ``Command`` llamada ``CommandHelper`` esxistiría. ``CommandHelper`` tendría dos argumentos de plantilla, la clase base original y la subclase derivada deseada. Echemos un vistazo a una implementación básica de ``CommandHelper`` para entender esto:
fr_ca: Après quelques jours de délibération, une méthode CRTP a été proposée. Ici, une classe dérivée intermédiaire de ``Command`` appelée ``CommandHelper`` serait créé. ``CommandHelper`` aurait deux arguments de modèle, la classe de base d'origine et la sous-classe dérivée souhaitée. Jetons un coup d'œil à une implémentation de base de ``CommandHelper`` pour comprendre ceci:
tr_tr: Birkaç günlük değerlendirmeden sonra, bir CRTP yöntemi önerildi. Burada, ``CommandHelper`` adı verilen, aracı olarak türetilmiş bir ``Command`` sınıfı mevcut olacaktır. ``CommandHelper`` iki şablon argümanına sahip olacaktır, orijinal temel sınıf ve istenen türetilmiş alt sınıf. Bunu anlamak için ``CommandHelper``' ın temel uygulamasına bir göz atalım:
zh_cn: 经过几天的审议，提出了一种CRTP方法。在这里，将存在一个称为“CommandCommander”的中间派生类“Command”。 “CommandHelper”有两个模板参数，原始基类和所需的派生子类。让我们看一下“CommandHelper”的基本实现以了解这一点：

source: Thus, making your custom commands extend ``CommandHelper`` instead of ``Command`` will automatically implement this boilerplate for you and this is the reasoning behind asking teams to use what may seem to be a rather obscure way of doing things.
es_mx: Así, haciendo que tus comandos personalizados extiendan ``CommandHelper`` en lugar de ``Command`` implementará automáticamente esta plantilla para ti y este es el razonamiento detrás de pedir a los equipos que usen lo que puede parecer una forma bastante oscura de hacer las cosas.
fr_ca: Ainsi, en faisant étendre vos commandes personnalisées via ``CommandHelper`` au lieu de ``Command`` fera implémenter automatiquement ce processus pour vous et c'est le raisonnement derrière le fait de demander aux équipes d'utiliser ce qui peut sembler être une façon assez obscure de faire les choses.
tr_tr: Bu nedenle, özel komutlarınızı ``Command`` yerine ``CommandHelper`` kapsamında yapmak, bu standart levhayı -boilerplate sizin için otomatik olarak uygulayacaktır ve ekiplerden işleri yapmak için oldukça belirsiz gibi görünen bir yöntemi kullanmalarını istemenin arkasındaki sebep budur.
zh_cn: 因此，使您的自定义命令扩展为“CommandHelper”而不是“Command”将自动为您实现此样板，这就是要求团队使用似乎是一种相当晦涩的处理方式的原因。

source: Going back to our ``AndThen()`` example, we can now do the following:
es_mx: Volviendo a nuestro ``AndThen()`` ejemplo, ahora podemos hacer lo siguiente:
fr_ca: Pour revenir à notre exemple ``AndThen()``, nous pouvons maintenant faire ce qui suit:
tr_tr: ``AndThen()`` örneğimize geri dönersek, şimdi aşağıdakileri yapabiliriz:
zh_cn: 回到我们的“AndThen()”示例，我们现在可以执行以下操作：

source: Lack of Advanced Decorators
es_mx: Falta de decoradores avanzados
fr_ca: Manque de décorateurs avancés
tr_tr: Gelişmiş Dekoratörlerin Eksikliği
zh_cn: 缺乏高级装饰

source: Most of the C++ decorators take in ``std::function<void()>`` instead of actual commands themselves. The idea of taking in actual commands in decorators such as ``AndThen()``, ``BeforeStarting()``, etc. was considered but then abandoned due to a variety of reasons.
es_mx: La mayoría de los decoradores de C++ toman ``std::function<void()>`` en lugar de comandos reales ellos mismos. La idea de tomar comandos reales en decoradores como ``AndThen()``, ``BeforeStarting()``, etc. fue considerada pero luego abandonada debido a una variedad de razones.
fr_ca: La plupart des décorateurs C ++ utilisent ``std::function<void()>`` au lieu des commandes proprement dites. L'idée de prendre des commandes réelles dans les décorateurs telles que ``AndThen()``, ``BeforeStarting()``, etc. a été envisagée mais abandonnée pour diverses raisons.
tr_tr: C++ dekoratörlerinin çoğu, gerçek komutların kendileri yerine ``std::function<void()>`` alır. Dekoratörlerde ``AndThen()``, ``BeforeStarting()`` vb. gibi gerçek komutları alma fikri düşünüldü, ancak daha sonra çeşitli nedenlerle terk edildi.
zh_cn: 大多数C ++装饰器都采用“std::function <void()>”代替实际的命令本身。考虑了在装饰器中接收实际命令的想法，例如“AndThen()”，“BeforeStarting()”等，但由于多种原因而被放弃。

source: Templating Decorators
es_mx: Decoradores de plantillas
fr_ca: Décorateurs de modèles
tr_tr: Dekoratörleri Şablonlama
zh_cn: 模板装饰器

source: Because we need to know the types of the commands that we are adding to a command group at compile-time, we will need to use templates (variadic for multiple commands). However, this might not seem like a big deal. The constructors for command groups do this anyway:
es_mx: Debido a que necesitamos saber los tipos de los comandos que estamos añadiendo a un grupo de comandos en tiempo de compilación, necesitaremos usar plantillas (variadic para múltiples comandos). Sin embargo, esto podría no parecer un gran problema. Los constructores de grupos de comandos lo hacen de todas formas:
fr_ca: Parce que nous avons besoin de connaître les types de commandes que nous ajoutons à un groupe de commandes au moment de la compilation, nous devrons utiliser des modèles (variadic pour plusieurs commandes). Cependant, cela peut ne pas sembler un gros problème. Les constructeurs des groupes de commandes le font par défaut:
tr_tr: Derleme zamanında, bir komut grubuna eklediğimiz komutların türlerini bilmemiz gerektiğinden, şablonları (çoklu komutlar için değişken) kullanmamız gerekecek. Ancak, bu büyük bir uğraş gibi görünmeyebilir. Komut grupları için yapıcılar bunu yine de yapar:
zh_cn: 因为我们需要在编译时知道要添加到指令组的指令的类型，所以我们将需要使用模板（对于多个指令来说是可变的）。但是，这似乎没什么大不了的。无论如何，指令组的构造函数都会这样做：

source: This is a secondary constructor for ``SequentialCommandGroup`` in addition to the vector constructor that we described above.
es_mx: Este es un constructor secundario para el ``SequentialCommandGroup``, además del constructor de vectores que describimos anteriormente.
fr_ca: Il s'agit d'un constructeur secondaire pour ``SequentialCommandGroup`` en plus du constructeur vectoriel que nous avons décrit ci-dessus.
tr_tr: Bu, yukarıda tanımladığımız vektör yapıcısına ek olarak ``SequentialCommandGroup`` için ikincil bir kurucudur.
zh_cn: 除了我们上面描述的向量构造器之外，这是“SequentialCommandGroup”的辅助构造器。

source: However, when we make a templated function, its definition must be declared inline. This means that we will need to instantiate the ``SequentialCommandGroup`` in the ``Command.h`` header, which poses a problem. ``SequentialCommandGroup.h`` includes ``Command.h``. If we include ``SequentialCommandGroup.h`` inside of ``Command.h``, we have a circular dependency. How do we do it now then?
es_mx: Sin embargo, cuando realizamos una función de plantilla, su definición debe ser declarada en línea. Esto significa que tendremos que instanciar el ``SequentialCommandGroup`` en el encabezado "Command.h", lo que plantea un problema. ``SequentialCommandGroup`` incluye "Command.h". Si incluimos ``SequentialCommandGroup`` dentro de "Command.h", tenemos una dependencia circular. ¿Cómo lo hacemos ahora entonces?
fr_ca: Cependant, lorsque nous créons une fonction basée sur un modèle, sa définition doit être déclarée en ligne. Cela signifie que nous devrons instancier le ``SequentialCommandGroup`` dans l'en-tête ``Command.h``, ce qui pose un problème. ``SequentialCommandGroup.h`` inclut ``Command.h``. Si nous incluons ``SequentialCommandGroup.h`` à l'intérieur de ``Command.h``, nous avons une dépendance circulaire. Comment procéder alors?
tr_tr: Bununla birlikte, şablonlanmış bir fonksiyon yaptığımızda, tanımı satır içi-inline olarak bildirilmelidir. Bu, bir sorun oluşturan ``Command.h`` başlığındaki ``SequentialCommandGroup`` örneğini oluşturmamız gerektiği anlamına gelir. ``SequentialCommandGroup.h``, ``Command.h`` içerir. ``Command.h`` içerisine ``SequentialCommandGroup.h`` eklersek, döngüsel bir bağımlılığımız olur. Şimdi nasıl yapacağız peki?
zh_cn: 但是，当我们制作模板函数时，必须将其定义内联声明。这意味着我们将需要在“Command.h”标头中实例化“SequentialCommandGroup”，这会带来问题。 “SequentialCommandGroup.h”包括“Command.h”。如果我们在“Command.h”内包含“SequentialCommandGroup.h”，则具有循环依赖关系。那我们现在怎么办呢？

source: We use a forward declaration at the top of ``Command.h``:
es_mx: Usamos una declaración hacia adelante en la parte superior de ``Command.h``:
fr_ca: Nous utilisons une déclaration en haut de ``Command.h``:
tr_tr: `Command.h`` başlığının üstünde ileriye dönük bir bildirim kullanıyoruz:
zh_cn: 我们在“Command.h”的顶部使用前向声明：

source: And then we include ``SequentialCommandGroup.h`` in ``Command.cpp``. If these decorator functions were templated however, we cannot write definitions in the ``.cpp`` files, resulting in a circular dependency.
es_mx: Y luego incluimos ``SequentialCommandGroup.h`` en "Command.cpp". Sin embargo, si estas funciones de decorador se templaron, no podemos escribir definiciones en los archivos ``.cpp``, resultando en una dependencia circular.
fr_ca: Et puis nous incluons ``SequentialCommandGroup.h`` dans ``Command.cpp``. Cependant, si ces fonctions décoratrices ont été modélisées, nous ne pouvons pas écrire de définitions dans les fichiers ``.cpp``, ce qui entraîne une dépendance circulaire.
tr_tr: Ve sonra ``SequentialCommandGroup.h`` yi ``Command.cpp`` içine dahil ediyoruz. Bu dekoratör işlevleri şablon haline getirildiyse, ``.cpp`` dosyalarına tanım yazamayız ve bu da döngüsel bir bağımlılıkla sonuçlanır.
zh_cn: 然后我们在“Command.cpp”中包含“SequentialCommandGroup.h”。但是，如果这些装饰器函数是模板化的，则无法在“.cpp”文件中编写定义，从而导致循环依赖。

source: Java vs C++ Syntax
es_mx: Sintaxis de Java vs Sintaxis de C++
fr_ca: Syntaxe Java vs C ++
tr_tr: Java vs. C++ Sözdizimi Kuralları
zh_cn: Java与C ++语法

source: These decorators usually save more verbosity in Java (because Java requires raw ``new`` calls) than in C++, so in general, it does not make much of a syntanctic difference in C++ if you create the command group manually in user code.
es_mx: Estos decoradores suelen ahorrar más verbosidad en Java (porque Java requiere llamadas ``nuevas`` sin procesar) que en C++, así que en general, no hay mucha diferencia sintáctica en C++ si se crea el grupo de comandos manualmente en código de usuario.
fr_ca: Ces décorateurs réduisent la verbosité en Java (car Java nécessite des appels bruts de type ``new``) par rapport à C ++, donc en général, cela ne fait pas beaucoup de différence au niveau de la syntaxe en C ++ si vous créez le groupe de commandes manuellement dans le code utilisateur.
tr_tr: Bu dekoratörler genellikle Java'da C++'dan daha fazla ayrıntıyı kaydeder (çünkü Java, ham ``new -yeni`` çağrılar gerektirir), bu nedenle genel olarak; komut grubunu, kullanıcı kodunda manuel olarak oluşturursanız, C++' da söz dizimsel bir fark yaratmaz.
zh_cn: 这些装饰器通常在Java中保存比在C ++中更多的详细信息（因为Java需要原始的“new”调用），因此通常，如果您在用户代码中手动创建指令组，则在C ++中并不会产生太大的区别。
