Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/cpp-command-discussion.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: A Technical Discussion on C++ Commands
es_mx: Una discusión técnica sobre los comandos de C ++
fr_ca: Une discussion technique sur les commandes C++
tr_tr: C++ Komutları Üzerine Teknik Bir Tartışma
zh_cn: 有关C ++指令的技术讨论

source: This article serves as a technical discussion on some of the design decisions that were made when designing the new command-based framework in C++. You do not need to understand the information within this article to use the command-based framework in your robot code.
es_mx: Este artículo sirve como una discusión técnica sobre algunas de las decisiones de diseño que se tomaron al diseñar el nuevo marco basado en comandos en C++. No es necesario que comprenda la información de este artículo para utilizar el marco basado en comandos en su código de robot.
fr_ca: Le présent article est une discussion technique sur certaines des décisions qui ont été prises lors de la conception du nouveau cadre basé sur les commandes (Command-based Framework) en C++. Il ne vous est pas nécessaire de comprendre les informations contenues dans cet article pour utiliser ce cadre dans votre code robot.
tr_tr: Bu makale, C++ 'da yeni komut tabanlı framework tasarlanırken alınan bazı tasarım kararları hakkında teknik bir tartışma görevi görür. Robot kodunuzda komut tabanlı framework'ü kullanmak için bu makaledeki bilgileri anlamanıza gerek yoktur.
zh_cn: 本文是对在C ++中设计基于指令的新框架时所做的一些设计决策的技术讨论。您无需了解本文中的信息即可在机器人代码中使用基于指令的框架。

source: This article assumes that you have a fair understanding of advanced C++ concepts, including templates, smart pointers, inheritance, rvalue references, copy semantics, move semantics, and CRTP.
es_mx: Este artículo asume que usted comprende los conceptos avanzados de C++, incluidas plantillas, punteros inteligentes, herencia, referencias de rvalue, semántica de copia, semántica de movimiento y CRTP.
fr_ca: Cet article suppose que vous avez une bonne compréhension des concepts avancés du C ++, y compris les modèles, les pointeurs intelligents, l'héritage, les références rvalue, la sémantique de copie, la sémantique de déplacement et CRTP.
tr_tr: Bu makale, şablonlar, akıllı işaretçiler, inheritance -kalıtım, rvalue referansları, semantik kopyalama, semantik taşıma ve CRTP dahil olmak üzere gelişmiş C++ kavramları hakkında net bir bilgiye sahip olduğunuzu varsayar.
zh_cn: 本文假定您对高级C ++概念有一定的了解，包括模板，智能指针，继承，右值引用，复制语义，移动语义和CRTP。

source: This article will help you understand the reasoning behind some of the decisions made in the new command-based framework (such as the use of ``std::unique_ptr``, CRTP in the form of ``CommandHelper<Base, Derived>``, the lack of more advanced decorators that are available in Java, etc.)
es_mx: Este artículo lo ayudará a comprender el razonamiento detrás de algunas de las decisiones tomadas en el nuevo marco basado en comandos (como el uso de ``std::unique_ptr``, CRTP en la forma de ``CommandHelper<Base, Derived>``, la falta de decoradores más avanzados que están disponibles en Java, etc.)
fr_ca: Cet article vous aidera à comprendre le raisonnement derrière certaines des décisions prises dans le nouveau cadre basé sur les commandes (comme l'utilisation de `` std :: unique_ptr '', CRTP sous la forme de `` CommandHelper <Base, Derived> `` `, le manque de décorateurs plus avancés disponibles en Java, etc.)
tr_tr: Bu makale, yeni komut tabanlı framework'te verilen bazı kararların arkasındaki mantığı anlamanıza yardımcı olacaktır (``std::unique_ptr`` kullanımı, ``CommandHelper<Base, Derived>`` şeklinde CRTP, Java'da bulunan daha gelişmiş araçların eksikliği vb. gibi).
zh_cn: 本文将帮助您了解在基于指令的新框架中做出某些决策的原因（例如“std :: unique_ptr”的使用，CRTP以“CommandHelper <Base, Derived>”的形式存在，缺乏Java可用的更高级的装饰器等）

source: Ownership Model
es_mx: Modelo de propiedad
fr_ca: Modèle de propriété
tr_tr: Sahiplik Modeli
zh_cn: 所有权模型

source: The old command-based framework employed the use of raw pointers, meaning that users had to use ``new`` (resulting in manual heap allocations) in their robot code. Since there was no clear indication on who owned the commands (the scheduler, the command groups, or the user themselves), it was not apparent who was supposed to take care of freeing the memory.
es_mx: El antiguo marco basado en comandos empleaba el uso de punteros sin procesar, lo que significa que los usuarios tenían que usar ``nuevo`` (lo que resultaba en asignaciones de montón manuales) en su código de robot. Dado que no había una indicación clara sobre quién era el propietario de los comandos (el programador, los grupos de comandos o el usuario mismo), no era evidente quién se suponía que debía encargarse de liberar la memoria.
fr_ca: L'ancien cadre basé sur les commandes utilisait des pointeurs bruts, ce qui signifie que les usagers devaient employer la déclaration ``new`` (résultant en des allocations manuelles de mémoire de type "heap") dans leur code robot. Comme il n'y avait aucune indication claire sur quel partie du programme qui était responsable des commandes (le planificateur, les groupes de commandes ou l'utilisateur lui-même), il n'était pas évident de savoir qui devait s'occuper de libérer cette mémoire allouée.
tr_tr: Eski komut tabanlı framework, ham işaretçilerin kullanımını kullanıyordu, bu da kullanıcıların robot kodlarında ``new -yeni`` (manuel öbek ayrımlarıyla sonuçlanan) kullanmaları gerektiği anlamına geliyordu. Komutların kime ait olduğuna dair net bir gösterge olmadığından (zamanlayıcı, komut grupları veya kullanıcının kendisi), hafızayı boşaltmakla kimin ilgileneceği belli değildi.
zh_cn: 基于指令的旧框架使用原始指针，这意味着用户必须在其机器人代码中使用“new'”（导致手动堆分配）。由于没有明确指示谁拥有命令（调度程序，指令组或用户自己），因此不清楚谁应该负责释放内存。

source: Several examples in the old command-based framework involved code like this:
es_mx: Varios ejemplos en el antiguo marco basado en comandos involucraban código como este:
fr_ca: Plusieurs exemples dans l'ancien cadre basé sur des commandes impliquaient du code comme celui-ci:
tr_tr: Eski komut tabanlı framework'teki birkaç örnek şu şekilde kod içeriyordu:
zh_cn: 旧的基于命指令的框架中的几个示例涉及如下代码：

source: In the command-group above, the component commands of the command group were being heap allocated and passed into ``AddSequential`` all in the same line. This meant that that user had no reference to that object in memory and therefore had no means of freeing the allocated memory once the command group ended. The command group itself never freed the memory and neither did the command scheduler. This led to memory leaks in robot programs (i.e. memory was allocated on the heap but never freed).
es_mx: En el grupo de comandos anterior, los comandos de los componentes del grupo de comandos se asignaban en montón y se pasaban a ``AddSequential`` todos en la misma línea. Esto significaba que ese usuario no tenía ninguna referencia a ese objeto en la memoria y, por lo tanto, no tenía forma de liberar la memoria asignada una vez que finalizaba el grupo de comando. El grupo de comandos en sí nunca liberó la memoria y tampoco el programador de comandos. Esto condujo a pérdidas de memoria en los programas de robot (es decir, la memoria se asignó en el montón pero nunca se liberó).
fr_ca: Dans le groupe de commandes ci-dessus, les commandes des composants relatifs au groupe de commandes ont leur mémoire allouée (heap) passée via ``AddSequential`` sur la même ligne. Cela signifie que cet utilisateur n'avait aucune référence à cet objet en mémoire et n'avait donc aucun moyen de libérer la mémoire allouée une fois le groupe de commandes terminé. Le groupe de commandes lui-même n'a jamais libéré la mémoire ni le planificateur de commandes. Ceci est néfaste, causant ainsi des 'fuites' de mémoire dans le programme (c'est-à-dire que la mémoire a été allouée, mais jamais libérée).
tr_tr: Yukarıdaki komut grubunda, komut grubunun bileşen komutlarının hepsi aynı satırda öbek ayrılıyor ve ``AddSequential -Sıralı Ekle`` ye aktarılıyordu. Bu, kullanıcının bellekteki bu nesneye referansının olmadığı ve bu nedenle komut grubu sona erdiğinde tahsis edilen belleği boşaltmanın hiçbir yolu olmadığı anlamına geliyordu. Komut grubunun kendisi ve komut zamanlayıcı da hiçbir zaman belleği boşaltmadı. Bu, robot programlarında bellek sızıntılarına yol açtı (yani bellek öbek üzerine ayrıldı, ancak asla boşaltılmadı).
zh_cn: 在上面的指令组中，指令组的组件指令正在堆中分配，并传递到同一行中的“AddSequential”中。这意味着该用户没有对内存中该对象的引用，因此，一旦指令组结束，该用户就无法释放分配的内存。指令组本身从不释放内存，指令调度程序也没有。这导致机器人程序中的内存泄漏（即，内存在堆上分配但从未释放）。

source: This glaring problem was one of the reasons for the rewrite of the framework. A comprehensive ownership model was introduced with this rewrite, along with the usage of smart pointers which will automatically free memory when they go out of scope.
es_mx: Este problema evidente fue una de las razones de la reescritura del marco. Se introdujo un modelo de propiedad integral con esta reescritura, junto con el uso de punteros inteligentes que liberarán memoria automáticamente cuando se salgan del alcance.
fr_ca: Ce problème flagrant a été l'une des raisons de la réécriture du cadre. Un nouveau modèle de propriété complet a été généré avec cette réécriture, qui comprend l'utilisation de pointeurs intelligents pour libérer automatiquement la mémoire lorsqu'ils ne seront plus actifs.
tr_tr: Bu göze batan sorun, framework-çerçevenin yeniden yazılmasının nedenlerinden biriydi. Bu yeniden yazma ile birlikte kapsamlı bir sahiplik modeli ve kapsam dışına çıktıklarında hafızayı otomatik olarak boşaltacak akıllı işaretçilerin kullanımıyla birlikte tanıtıldı.
zh_cn: 这个明显的问题是重写框架的原因之一。这次重写引入了一个全面的所有权模型，以及智能指针的使用，这些智能指针将在超出范围时自动释放内存。

source: Default commands are owned by the command scheduler whereas component commands of command groups are owned by the command group. Other commands are owned by whatever the user decides they should be owned by (e.g. a subsystem instance or a ``RobotContainer`` instance). This means that the ownership of the memory allocated by any commands or command groups is clearly defined.
es_mx: Los comandos predeterminados son propiedad del programador de comandos, mientras que los comandos de componentes de los grupos de comandos pertenecen al grupo de comandos. Otros comandos son propiedad de lo que el usuario decida que debe pertenecer (por ejemplo, una instancia de subsistema o una instancia de ``RobotContainer``). Esto significa que la propiedad de la memoria asignada por cualquier comando o grupo de comando está claramente definida.
fr_ca: Les commandes par défaut appartiennent au planificateur de commandes, tandis que les commandes de composants des groupes de commandes appartiennent au groupe de commandes. Les autres commandes appartiennent à tout ce que l'utilisateur décide qu'elles devraient appartenir (par exemple, une instance de sous-système ou une instance de ``RobotContainer``). Cela signifie que la propriété de la mémoire allouée par les commandes ou groupes de commandes est clairement définie.
tr_tr: Varsayılan komutlar, komut zamanlayıcıya aitken komut gruplarının bileşen komutları, komut grubuna aittir. Diğer komutlar, kullanıcının sahip olması gerektiğine karar verdiği herhangi bir şeye aittir (örneğin bir alt sistem örneği veya bir ``RobotContainer`` örneği). Bu, herhangi bir komut veya komut grubu tarafından ayrılan belleğin sahipliğinin açıkça tanımlandığı anlamına gelir.
zh_cn: 默认指令归指令调度程序所有，而指令组的组件指令归指令组所有。其他指令归用户决定应归其所有的对象（例如子系统实例或“RobotContainer”实例）。这意味着可以清楚地定义任何指令或指令组分配的内存的所有权。

source: Using ``std::unique_ptr`` allows us to clearly determine who owns the object. Because an ``std::unique_ptr`` cannot be copied, there will never be more than one instance of a ``std::unique_ptr`` that points to the same block of memory on the heap. For example, a constructor for ``SequentialCommandGroup`` takes in a ``std::vector<std::unique_ptr<Command>>&&``. This means that it requires an rvalue reference to a vector of ``std::unique_ptr<Command>``. Let's go through some example code step-by-step to understand this better:
es_mx: El uso de ``std::unique_ptr`` nos permite determinar claramente quién es el propietario del objeto. Debido a que un ``std::unique_ptr`` no se puede copiar, nunca habrá más de una instancia de un `` td::unique_ptr`` que apunte al mismo bloque de memoria en el montón. Por ejemplo, un constructor para ``SequentialCommandGroup`` toma un ``std::vector<std::unique_ptr<Command>> &&``. Esto significa que requiere una referencia rvalue a un vector de ``std::unique_ptr <Command>``. Repasemos un código de ejemplo paso a paso para comprender esto mejor:
fr_ca: L'utilisation de ``std::unique_ptr`` nous permet de déterminer clairement à qui appartient l'objet. Comme un ``std::unique_ptr`` ne peut pas être copié, il n'y aura jamais plus d'une instance de ``std::unique_ptr`` qui pointe vers le même bloc de mémoire allouée. Par exemple, un constructeur pour ``SequentialCommandGroup`` prend un ``std::vector<std::unique_ptr<Command>>&&``. Cela signifie qu'il nécessite une référence rvalue à un vecteur de ``std::unique_ptr``<Command>. Passons en revue un exemple de code étape par étape pour mieux comprendre cela:
tr_tr: ``std::unique_ptr`` kullanmak, nesneye kimin sahip olduğunu açıkça belirlememizi sağlar. Bir ``std::unique_ptr`` kopyalanamadığı için, öbek üzerinde aynı bellek bloğunu işaret eden bir ``std::unique_ptr`` nin birden fazla örneği olmayacaktır. Örneğin, ``SequentialCommandGroup`` için bir constructor -yapıcı, bir ``std::vector<std::unique_ptr<Command>>&&`` alır. Bu, ``std::unique_ptr<Command>`` vektörüne bir rvalue referansı gerektirdiği anlamına gelir. Bunu daha iyi anlamak için bazı örnek kodları adım adım inceleyelim:
zh_cn: 使用“std::unique_ptr”以让我们清楚地确定谁拥有对象。由于无法复制“std::unique_ptr”，因此不会有超过一个“std::unique_ptr”实例指向堆上的同一内存块。例如，“SequentialCommandGroup”的构造函数采用“std :: vector <std::unique_ptr<Command>> &&”。这意味着它需要对向量“std::unique_ptr <Command>”的右值引用。让我们逐步看一些示例代码，以更好地理解这一点：

source: With ``std::shared_ptr``, there is no clear ownership model because there can be multiple instances of a ``std::shared_ptr`` that point to the same block of memory. If commands were in ``std::shared_ptr`` instances, a command group or the command scheduler cannot take ownership and free the memory once the command has finished executing because the user might still unknowingly still have a ``std::shared_ptr`` instance pointing to that block of memory somewhere in scope.
es_mx: Con ``std::shared_ptr``, no hay un modelo de propiedad claro porque puede haber varias instancias de un ``std::shared_ptr`` que apuntan al mismo bloque de memoria. Si los comandos estuvieran en instancias ``std::shared_ptr``, un grupo de comandos o el programador de comandos no puede tomar posesión y liberar la memoria una vez que el comando ha terminado de ejecutarse porque el usuario, sin saberlo, todavía podría tener un ``std::shared_ptr`` instancia que apunta a ese bloque de memoria en algún lugar del alcance.
fr_ca: Avec ``std::shared_ptr``, il n'y a pas de modèle de propriété clair car il peut y avoir plusieurs instances d'un ``std::shared_ptr`` qui pointent vers le même bloc de mémoire. Si les commandes étaient dans des instances ``std::shared_ptr``, un groupe de commandes ou le planificateur de commandes ne peuvent pas prendre possession et libérer la mémoire une fois que la commande a fini de s'exécuter car l'utilisateur peut encore, sans le savoir, avoir une instance ``std::shared_ptr`` pointant vers ce bloc de mémoire quelque part.
tr_tr: ``std::shared_ptr`` ile, açık bir sahiplik modeli yoktur çünkü aynı bellek bloğunu işaret eden bir ``std::shared_ptr`` nin birden fazla örneği olabilir. Komutlar ``std::shared_ptr`` örneklerinde olsaydı, bir komut grubu veya komut zamanlayıcı, komutun yürütülmesi bittikten sonra sahipliği alamaz ve belleği boşaltamaz çünkü kullanıcı hala kapsamı içinde bir yerdeki bellek bloğuna işaret eden örnek ``std::shared_ptr`` ye sahip olabilir.
zh_cn: 使用“std::shared_ptr”时，没有明确的所有权模型，因为“std::shared_ptr”可能有多个实例指向同一块内存。如果指令在“std::shared_ptr”实例中，则指令组或指令调度程序将无法获得所有权并在指令完成执行后释放内存，因为用户可能仍然不知不觉中仍然拥有“std::shared_ptr”。指向范围内某处内存块的实例。

source: Use of CRTP
es_mx: Uso de CRTP
fr_ca: Utilisation de CRTP
tr_tr: CRTP kullanımı
zh_cn: CRTP的使用

source: You may have noticed that in order to create a new command, you must extend ``CommandHelper``, providing the base class (usually ``frc2::Command``) and the class that you just created. Let's take a look at the reasoning behind this:
es_mx: Es posible que haya notado que para crear un nuevo comando, debe extender ``std::shared_ptr`` , proporcionando la clase base (generalmente ``frc2::Command`` ) y la clase que acaba de crear. Echemos un vistazo al razonamiento detrás de esto:
fr_ca: Vous avez peut-être remarqué que pour créer une nouvelle commande, vous devez étendre ``CommandHelper``, en fournissant la classe de base (généralement ``frc2::Command``) et la classe que vous venez de créer. Analysons ce raisonnement:
tr_tr: Yeni bir komut oluşturmak için, temel sınıfı (genellikle ``frc2::Command`) ve yeni oluşturduğunuz sınıfı sağlayarak ``CommandHelper`` ı genişletmeniz gerektiğini fark etmiş olabilirsiniz. Bunun arkasındaki nedene bir göz atalım:
zh_cn: 您可能已经注意到，为了创建新指令，必须扩展“CommandHelper”，提供基类（通常是“frc2::Command”）和刚创建的类。让我们看一下其背后的原因：

source: Command Decorators
es_mx: Decoradores de comando
fr_ca: Décorateurs de commandes
tr_tr: Komut Dekoratörleri

source: The new command-based framework includes a feature known as "command decorators", which allows the user to something like this:
es_mx: El nuevo marco basado en comandos incluye una función conocida como "decoradores de comandos", que permite al usuario hacer algo como esto:
fr_ca: Le nouveau cadre basé sur les commandes comprend une fonctionnalité connue sous le nom de "décorateurs de commandes", qui permet à l'utilisateur de faire quelque chose comme ceci:
tr_tr: Yeni komut tabanlı framework, kullanıcının aşağıdaki gibi bir şey yapmasına olanak tanıyan "komut dekoratörleri" olarak bilinen bir özelliği içerir:
zh_cn: 新的基于指令的框架包括称为“command decorators”的功能，该功能允许用户执行以下操作：

source: When ``task`` is scheduled, it will first execute ``MyCommand()`` and once that command has finished executing, it will print the message to the console. The way this is achieved internally is by using a sequential command group.
es_mx: Cuando se programa la ``tarea`` , primero ejecutará ``MyCommand()`` y una vez que ese comando haya terminado de ejecutarse, imprimirá el mensaje en la consola. La forma en que esto se logra internamente es mediante el uso de un grupo de comando secuencial.
fr_ca: Lorsque ``task`` est planifiée, elle exécutera d'abord ``MyCommand()`` et une fois que cette commande aura fini de s'exécuter, elle imprimera le message sur la console. La façon dont cela est réalisé en interne consiste à utiliser un groupe de commandes séquentielles.
tr_tr: ``task -görev`` zamanlandığında, ilk önce ``MyCommand()`` çalıştıracak ve bu komutun yürütülmesi bittiğinde, mesajı konsola yazdıracaktır. Bunun dahili olarak elde etmenin yolu, sıralı bir komut grubu kullanmaktır.
zh_cn: 计划好“task”之后，它将首先执行“MyCommand()”，一旦该命令执行完毕，它将把消息打印到控制台。在内部实现此目标的方法是使用顺序指令组。

source: Recall from the previous section that in order to construct a sequential command group, we need a vector of unique pointers to each command. Creating the unique pointer for the print function is pretty trivial:
es_mx: Recuerde de la sección anterior que para construir un grupo de comando secuencial, necesitamos un vector de punteros únicos para cada comando. Crear el puntero único para la función de impresión es bastante trivial:
fr_ca: Rappelez-vous de la section précédente que pour construire un groupe de commandes séquentielles, nous avons besoin d'un vecteur de pointeurs uniques vers chaque commande. La création du pointeur unique pour la fonction d'impression est assez simple:
tr_tr: Bir önceki bölümden, sıralı bir komut grubu oluşturmak için her komuta benzersiz bir işaretçi vektörüne ihtiyacımız olduğunu hatırlayın. Yazdırma işlevi için benzersiz bir işaretçi oluşturmak oldukça basittir:
zh_cn: 回顾上一节，为了构建顺序指令组，我们需要一个指向每个指令的唯一指针的向量。为打印功能创建唯一的指针非常简单：

source: Here ``temp`` is storing the vector of commands that we need to pass into the ``SequentialCommandGroup`` constructor. But before we add that ``InstantCommand``, we need to add ``MyCommand()`` to the ``SequentialCommandGroup``. How do we do that?
es_mx: Aquí, ``temp`` almacena el vector de comandos que necesitamos pasar al constructor ``SequentialCommandGroup`` . Pero antes de agregar ese ``InstantCommand``,necesitamos agregar ``MyCommand()`` al``SequentialCommandGroup`` . ¿Como hacemos eso?
fr_ca: Ici, ``temp`` stocke le vecteur de commandes que nous devons passer dans le constructeur ``SequentialCommandGroup``. Mais avant d'ajouter ``InstantCommand``, nous devons ajouter `` MyCommand () '' au ``SequentialCommandGroup``. Comment fait-on cela?
tr_tr: Burada ``temp`` , ``SequentialCommandGroup`` yapıcısına iletmemiz gereken komut vektörünü depoluyor. Ancak ``InstantCommand``i eklemeden önce, ``SequentialCommandGroup`` a, ``MyCommand()`` eklememiz gerekiyor. Bunu nasıl yaparız?
zh_cn: 这里的“temp”存储我们需要传递给“SequentialCommandGroup”构造函数的指令向量。但是在添加“InstantCommand”之前，我们需要将“MyCommand()”添加到“SequentialCommandGroup”中。我们该怎么做？

source: You might think it would be this straightforward, but that is not the case. Because this decorator code is in the ``Command`` interface, ``*this`` refers to the ``Command`` in the subclass that you are calling the decorator from and has the type of ``Command``. Effectively, you will be trying to move a ``Command`` instead of ``MyCommand``. We could cast the ``this`` pointer to a ``MyCommand*`` and then dereference it but we have no information about the subclass to cast to at compile-time.
es_mx: Podría pensar que sería así de sencillo, pero ese no es el caso. Debido a que este código de decorador está en el ``Command`` interface, ``*this`` referiendo a ``Command`` en la subclase desde la que está llamando al decorador y tiene el tipo de ``Command``. Efectivamente, intentará mover un ``Command`` en lugar de ``MyCommand``. Podríamos lanzar el ``esto`` puntero a un ``MyCommand*`` y luego desreferenciarlo, pero no tenemos información sobre la subclase a la que convertir en tiempo de compilación.
fr_ca: Vous pourriez penser que ce serait simple, mais ce n'est pas le cas. Le code de décorateur se trouve dans l'interface ``Command``, ``*this`` (notez l'astérisque) fait référence à ``Command`` dans la sous-classe à partir de laquelle vous appelez le décorateur et possède le type ``Command``. En effet, vous essaierez de déplacer ``Command`` au lieu de ``MyCommand``. Nous pourrions convertir le pointeur ``this`` en ``MyCommand*``, puis le déréférencer, mais nous n'avons aucune information sur la sous-classe à convertir au moment de la compilation.
tr_tr: Bunun bu kadar basit olacağını düşünebilirsiniz, ancak durum bu değil. Bu dekoratör kodu ``Command`` arayüzünde olduğu için, ``*this``, dekoratörü çağırdığınız alt sınıfta aynı zamanda ``Command`` türüne sahip bulunan ``Command`` anlamına gelir. Etkili bir şekilde, ``MyCommand`` yerine bir ``Command`` taşımaya çalışacaksınız. ``this`` işaretçisini bir ``MyCommand*``e çevirebilir ve sonra referansını kaldırabiliriz, ancak derleme sırasında kullanılacak alt sınıf hakkında hiçbir bilgimiz yoktur.
zh_cn: 您可能会认为这很简单，但事实并非如此。因为此修饰符代码在“Command”界面中，所以“*this”指代您从其调用修饰符的子类中的“Command”，并且具有“Command”的类型。实际上，您将尝试移动“Command”而不是“MyCommand”。我们可以将“this”指针转换为“MyCommand*”，然后取消引用，但我们没有有关在编译时要转换为子类的信息。

source: Solutions to the Problem
es_mx: Soluciones al problema
fr_ca: Solutions au problème
tr_tr: Soruna Yönelik Çözümler
zh_cn: 解决问题的方法
