Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/pid-subsystems-commands.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: PID Control through PIDSubsystems and PIDCommands
es_mx: Control PID a través de subsistemas PID y comandos PID
fr_ca: Contrôle PID via PIDSubsystems et PIDCommands
tr_tr: PIDSubsystems ve PIDCommands üzerinden PID Kontrol
zh_cn: 通过PID子系统和PID指令进行PID控制

source: For a description of the WPILib PID control features used by these command-based wrappers, see :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
es_mx: Para obtener una descripción de las funciones de control de WPILib PID utilizadas por estos contenedores basados en comandos, consulte :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
fr_ca: Pour une description des fonctionnalités de contrôle PID WPILib utilisées par ces wrappers basés sur des commandes, voir :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
tr_tr: Bu komut tabanlı sarmalayıcılar tarafından kullanılan WPILib PID kontrol özelliklerinin bir açıklaması için, bakınız :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`
zh_cn: 有关这些基于指令的程序包使用的WPILib PID控制功能的描述，请参阅WPILib中的:ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`。

source: Unlike the earlier version of ``PIDController``, the 2020 ``PIDController`` class runs *synchronously*, and is not handled in its own thread. Accordingly, changing its ``period`` parameter will *not* change the actual frequency at which it runs in any of these wrapper classes. Users should never modify the ``period`` parameter unless they are certain of what they are doing.
es_mx: A diferencia de la versión anterior de ``PIDController``, la clase 2020 ``PIDController`` se ejecuta *síncronamente* y no se maneja en su propio hilo. En consecuencia, cambiar su parámetro de ``period`` *no* cambiará la frecuencia real a la que se ejecuta en ninguna de estas clases de envoltura. Los usuarios nunca deben modificar el parámetro ``period`` a menos que estén seguros de lo que están haciendo.
fr_ca: Contrairement à la version précédente de ``PIDController``, la version 2020 de la classe ``PIDController`` s'exécute *de manière synchrone* et n'est pas gérée dans son propre thread. Par conséquent, la modification de son paramètre ``period`` ne changera *pas* la fréquence réelle à laquelle elle s'exécute dans l'une de ces classes wrapper. Les utilisateurs ne doivent jamais modifier le paramètre ``period`` à moins d'être certains de ce qu'ils font.
tr_tr: ``PIDController`` in önceki sürümünden farklı olarak, 2020 ``PIDController`` sınıfı *eşzamanlı olarak* çalışır ve kendi iş parçacığında ele alınmaz. Buna göre, ``period`` parametresini değiştirmek, bu sarmalayıcı sınıflarının herhangi birinde çalıştığı gerçek frekansı *değiştirmeyecektir*. Kullanıcılar ne yaptıklarından emin olmadıkları sürece ``period`` parametresini asla değiştirmemelidir.
zh_cn: 与早期版本的“PIDController”不同，2020年的“PIDController”类将会*同步运行*，并且不在其自己的线程中完成处理。因此，更改其“period”参数将*不会*更改在任何这些程序包类中运行的实际频率。除非用户确定自己在做什么，否则切勿修改“period”参数。

source: One of the most common control algorithms used in FRC\ |reg| is the `PID controller <https://en.wikipedia.org/wiki/PID_controller>`__. WPILib offers its own :ref:`PIDController <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>` class to help teams implement this functionality on their robots. To further help teams integrate PID control into a command-based robot project, the command-based library includes two convenience wrappers for the ``PIDController`` class: ``PIDSubsystem``, which integrates the PID controller into a subsystem, and ``PIDCommand``, which integrates the PID controller into a command.
es_mx: Uno de los algoritmos de control más comunes utilizados en FRC\ |reg| es el `PID controller <https://en.wikipedia.org/wiki/PID_controller>`__. WPILib ofrece su propia clase :ref:`PIDController <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>` para ayudar a los equipos a implementar esta funcionalidad en sus robots. Para ayudar aún más a los equipos a integrar el control PID en un proyecto de robot basado en comandos, la biblioteca basada en comandos incluye dos envoltorios de conveniencia para la clase ``PIDController``: ``PIDSubsystem``, que integra el controlador PID en un subsistema, y ``PIDCommand``, que integra el controlador PID en un comando.
fr_ca: L’un des algorithmes de contrôle les plus couramment utilisés en FRC\ |reg| est le `contrôleur PID <https://en.wikipedia.org/wiki/PID_controller>`__. WPILib propose son propre classe :ref:`PIDController <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>` pour aider les équipes à implémenter cette fonctionnalité dans leurs robots. Pour aider davantage les équipes à intégrer le contrôleur PID dans un projet de robot orienté commande, la bibliothèque orientée commande possède deux wrappers pour la classe ``PIDController`` : ``PIDSubsystem``, qui intègre le contrôleur PID dans un sous-système, et ``PIDCommand``, qui intègre le contrôleur PID dans une commande.
tr_tr: FRC \ | reg | yazılımında kullanılan en yaygın kontrol algoritmalarından biri `PID kontrolörü <https://en.wikipedia.org/wiki/PID_controller>`__. WPILib, ekiplerin bu işlevi robotlarında uygulamalarına yardımcı olmak için kendi :ref:`PIDController <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>` sınıfını sunar. Ekiplerin PID kontrolünü komut tabanlı bir robot projesine entegre etmelerine daha fazla yardımcı olmak için, komuta dayalı kütüphane ``PIDController`` sınıfı için iki kullanışlı sarmalayıcı içerir: PID denetleyicisini bir alt sisteme entegre eden ``PIDSubsystem`` ve PID denetleyicisini bir komuta entegre eden ``PIDCommand`` .
zh_cn: FRC \ | reg |中最常用的控制算法之一是`PID controller <https://en.wikipedia.org/wiki/PID_controller>`__。 WPILib提供了自己的:ref:`PIDController <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`类，以帮助团队在其机器人上实现此功能。为了进一步帮助团队将PID控制集成到基于指令的机器人项目中，基于指令的库包括两个方便包装器，用于“PIDController”类：“PIDSubsystem”，它将PID控制器集成到子系统中， “PIDCommand”，它将PID控制器集成到指令中。

source: PIDSubsystems
es_mx: Subsistemas PIDS
fr_ca: Sous-systèmes PIDS
zh_cn: PID子系统

source: The ``PIDSubsystem`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PIDSubsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_p_i_d_subsystem.html>`__) allows users to conveniently create a subsystem with a built-in ``PIDController``. In order to use the ``PIDSubsystem`` class, users must create a subclass of it.
fr_ca: La classe ``PIDSubsystem`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PIDSubsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_p_i_d_subsystem.html>`__) permet aux utilisateurs de créer facilement un sous-système avec un ``PIDController`` intégré. Pour utiliser la classe ``PIDSubsystem``, les utilisateurs doivent en créer une sous-classe.

source: Creating a PIDSubsystem
es_mx: Creación de un subsistema PIDS
fr_ca: Création d'un sous-système PIDS
tr_tr: PIDSubsystem oluşturma
zh_cn: 创建一个PID子系统

source: When subclassing ``PIDSubsystem``, users must override two abstract methods to provide functionality that the class will use in its ordinary operation:
es_mx: Al subclasificar ``PIDSubsystem``, los usuarios deben anular dos métodos abstractos para proporcionar la funcionalidad que la clase usará en su operación ordinaria:
fr_ca: Lors de la sous-classification de ``PIDSubsystem``, les utilisateurs doivent remplacer deux méthodes abstraites pour fournir des fonctionnalités que la classe utilisera dans son fonctionnement ordinaire:
tr_tr: ``PIDSubsystem`` alt sınıfını oluştururken, kullanıcılar sınıfın normal işleminde kullanacağı işlevselliği sağlamak için iki soyut yöntemi geçersiz kılmalıdır:
zh_cn: 创建“PIDSubsystem”的子类时，用户必须覆盖其父类的以下两个抽象方法以提供该类将在其常规运算中使用的功能：

source: The ``getMeasurement`` method returns the current measurement of the process variable. The ``PIDSubsystem`` will automatically call this method from its ``periodic()`` block, and pass its value to the control loop.
es_mx: El método ``getMeasurement`` devuelve la medición actual de la variable de proceso. El ``PIDSubsystem`` llamará automáticamente a este método desde su bloque ``periodic()`` y pasará su valor al bucle de control.
fr_ca: La méthode ``getMeasurement`` renvoie la mesure actuelle de la variable de processus. Le ``PIDSubsystem`` appellera automatiquement cette méthode depuis son bloc ``periodic()``, et passera sa valeur à la boucle de contrôle.
tr_tr: ``getMeasurement`` yöntemi, süreç değişkeninin mevcut ölçümünü döndürür. ``PIDSubsystem`` bu yöntemi ``periodic()`` bloğundan otomatik olarak çağıracak ve değerini kontrol döngüsüne aktaracaktır.
zh_cn: “getMeasurement”方法返回过程变量的当前测量值。 PIDSubsystem将自动从其“periodic()”块中调用此方法，并将它的值传递给控制循环。

source: Users should override this method to return whatever sensor reading they wish to use as their process variable measurement.
es_mx: Los usuarios deben anular este método para devolver cualquier lectura del sensor que deseen utilizar como medida de la variable de proceso.
fr_ca: Les utilisateurs doivent remplacer cette méthode pour renvoyer plutôt la lecture du capteur qu'ils souhaitent utiliser comme mesure de variable de processus.
tr_tr: Kullanıcılar, işlem değişken ölçümü olarak kullanmak istedikleri sensör okumasını döndürmek için bu yöntemi geçersiz kılmalıdır.
zh_cn: 用户应覆盖此方法，以返回他们希望的用作过程变量测量的任何传感器读数。

source: The ``useOutput()`` method consumes the output of the PID controller, and the current setpoint (which is often useful for computing a feedforward). The ``PIDSubsystem`` will automatically call this method from its ``periodic()`` block, and pass it the computed output of the control loop.
es_mx: El método ``useOutput()`` consume la salida del controlador PID y el punto de ajuste actual (que a menudo es útil para calcular un feedforward). El ``PIDSubsystem`` llamará automáticamente a este método desde su bloque ``periodic()`` y le pasará la salida calculada del bucle de control.
fr_ca: La méthode ``useOutput()`` utilise la sortie du contrôleur PID et le point de consigne actuel (qui est souvent utile pour calculer un feedforward). ``PIDSubsystem`` appellera automatiquement cette méthode depuis son segment ``periodic()``, et lui passera la sortie calculée de la boucle de contrôle.
tr_tr: ``useOutput()`` yöntemi, PID denetleyicisinin çıkışını ve mevcut ayar noktası durumunu (bu genellikle bir ileri beslemeyi hesaplamak için yararlıdır) kullanır. ``PIDSubsystem`` , bu yöntemi ``periodic()`` bloğundan otomatik olarak çağıracak ve ona kontrol döngüsünün hesaplanmış çıktısını iletecektir.
zh_cn: useOutput()方法使用PID控制器的输出和当前设定值（这通常对于计算前馈很有用）。“PIDSubsystem”将自动从其“periodic()”块中调用此方法，并将控制环的计算输出传递给该方法。

source: Users should override this method to pass the final computed control output to their subsystem's motors.
es_mx: Los usuarios deben anular este método para pasar la salida de control calculada final a los motores de su subsistema.
fr_ca: Les utilisateurs doivent remplacer cette méthode pour transmettre plutôt la sortie de contrôle calculée et finale aux moteurs de leur sous-système.
tr_tr: Kullanıcılar, son hesaplanmış kontrol çıkışını alt sistemlerinin motorlarına geçirmek için bu yöntemi geçersiz kılmalıdır.
zh_cn: 用户应覆盖此方法，以将最终计算出的控制输出传递给其子系统的电机。

source: Passing In the Controller
es_mx: Pasando el controlador
fr_ca: La transmission d'un contrôleur
tr_tr: Controller'a Geçirme
zh_cn: 控制器中的传递

source: Users must also pass in a ``PIDController`` to the ``PIDSubsystem`` base class through the superclass constructor call of their subclass. This serves to specify the PID gains, as well as the period (if the user is using a non-standard main robot loop period).
es_mx: Los usuarios también deben pasar un ``PIDController`` a la clase base ``PIDSubsystem`` a través de la llamada al constructor de superclase de su subclase. Esto sirve para especificar las ganancias de PID, así como el período (si el usuario está utilizando un período de bucle de robot principal no estándar).
fr_ca: Les utilisateurs doivent également transmettre un ``PIDController`` à la classe de base ``PIDSubsystem`` via l'appel de constructeur de superclasse de leur sous-classe. Cela permet de spécifier les gains PID, ainsi que la période (si l'utilisateur utilise une période de boucle différente de celle utilisée dans le code du robot standard).
tr_tr: Kullanıcılar ayrıca, alt sınıflarının üst sınıf yapıcı çağrısı aracılığıyla ``PIDSubsystem`` temel sınıfına bir ``PIDController`` geçirmelidir. Bu, PID kazançlarının yanı sıra periyodu (kullanıcı standart olmayan bir main robot looğ döngü periyodu kullanıyorsa) belirlemeye yarar.
zh_cn: 用户还必须通过“PIDController”和“PIDSubsystem”的子类的超类构造函数调用将“PIDController”传递给“PIDSubsystem”基类。这一步骤用于指定PID增益以及周期（如果用户使用的是非标准主机器人循环周期）。

source: Additional modifications (e.g. enabling continuous input) can be made to the controller in the constructor body by calling ``getController()``.
es_mx: Se pueden realizar modificaciones adicionales (por ejemplo, habilitar la entrada continua) al controlador en el cuerpo del constructor llamando a ``getController()``.
fr_ca: Des modifications supplémentaires (par exemple l'activation d'une entrée continue) peuvent être apportées au contrôleur dans le corps du constructeur en appelant ``getController()``.
tr_tr: ``getController()`` çağrısı yapılarak, yapıcı gövdesindeki denetleyicide ek değişiklikler (e.g. enabling continuous input- ör. sürekli girişi etkinleştirmek) yapılabilir.
zh_cn: 用户还可以通过调用“getController()”在构造函数主体中对控制器进行其他修改（例如启用连续输入）。

source: Using a PIDSubsystem
es_mx: Usando un subsistema PIDS
fr_ca: Utilisation d'un sous-système PIDS
tr_tr: PIDSubsystem kullanımı
zh_cn: 使用PID子系统

source: Once an instance of a ``PIDSubsystem`` subclass has been created, it can be used by commands through the following methods:
es_mx: Una vez que se ha creado una instancia de una subclase ``PIDSubsystem``, los comandos pueden usarla a través de los siguientes métodos:
fr_ca: Une fois qu'une instance d'une sous-classe ``PIDSubsystem`` a été créée, elle peut être utilisée par des commandes via les méthodes suivantes:
tr_tr: Bir ``PIDSubsystem`` alt sınıfının bir örneği oluşturulduktan sonra, aşağıdaki yöntemler aracılığıyla komutlar tarafından kullanılabilir:
zh_cn: 一旦创建了“PIDSubsystem”子类的实例，就可以在指令中通过以下方法使用它：

source: The ``setSetpoint()`` method can be used to set the setpoint of the ``PIDSubsystem``. The subsystem will automatically track to the setpoint using the defined output:
es_mx: El método ``setSetpoint()`` se puede utilizar para establecer el punto de ajuste del ``PIDSubsystem``. El subsistema rastreará automáticamente el punto de ajuste usando la salida definida:
fr_ca: La méthode ``setSetpoint()`` peut être utilisée pour définir le point de consigne du ``PIDSubsystem``. Le sous-système suivra automatiquement le point de consigne en utilisant la sortie définie:
tr_tr: ``setSetpoint()`` yöntemi, ``PIDSubsystem`` in ayar noktasını ayarlamak için kullanılabilir. Alt sistem, tanımlanan çıktıyı kullanarak ayar noktasını otomatik olarak izleyecektir:
zh_cn: “setSetpoint()”方法可用于设置“PIDSubsystem”的设定值。子系统将使用已经定义的输出自动跟踪到设定点：

source: The ``enable()`` and ``disable()`` methods enable and disable the PID control of the ``PIDSubsystem``. When the subsystem is enabled, it will automatically run the control loop and track the setpoint. When it is disabled, no control is performed.
es_mx: Los métodos ``enable()`` y ``disable()`` habilitan y deshabilitan el control PID del ``PIDSubsystem``.Cuando el subsistema está habilitado, automáticamente ejecutará el circuito de control y rastreará el punto de ajuste. Cuando está deshabilitado, no se realiza ningún control.
fr_ca: Les méthodes ``enable()`` et ``disable()`` activent et désactivent respectivement le contrôle PID du ``PIDSubsystem``. Lorsque le sous-système est activé, il exécute automatiquement la boucle de contrôle et suit le point de consigne. Lorsqu'il est désactivé, aucun contrôle n'est effectué.
tr_tr: ``enable()`` ve ``disable()`` yöntemleri ``PIDSubsystem`` in PID kontrolünü etkinleştirir ve devre dışı bırakır. Alt sistem etkinleştirildiğinde, kontrol döngüsünü otomatik olarak çalıştıracak ve ayar noktasını izleyecektir. Devre dışı bırakıldığında hiçbir kontrol gerçekleştirilmez.
zh_cn: “enable()”和“disable()”方法能够启用和禁用“PIDSubsystem”的PID控制。启用子系统后，它将自动运行控制回路并跟踪设定值。禁用时，子系统不执行任何控制。

source: Additionally, the ``enable()`` method resets the internal ``PIDController``, and the ``disable()`` method calls the user-defined `useOutput()`_ method with both output and setpoint set to ``0``.
es_mx: Además, el método ``enable()`` restablece el ``PIDController`` interno, y el método ``disable()`` llama al método `useOutput()`_ definido por el usuario con la salida y el punto de ajuste establecidos en ``0``.
fr_ca: De plus, la méthode ``enable()`` réinitialise le ``PIDController`` interne, et la méthode ``disable()`` appelle la méthode définie par l'utilisateur `useOutput ()`_ avec à la fois la sortie et le point de consigne définis sur la valeur ``0``.
tr_tr: Ek olarak, ``enable()`` yöntemi dahili ``PIDController`` i sıfırlar ve ``disable()`` yöntemi hem çıktı hem de ayar noktası ``olarak ayarlanmış şekilde kullanıcı tanımlı `useOutput()`_ yöntemini ``0``a ayarlar.
zh_cn: 此外，“enable()”方法能够重置内部的“PIDController”，并且“disable()”方法能够调用用户定义的‘useOutput()’_方法，并将输出值和设定值都设置为“0”。

source: Full PIDSubsystem Example
es_mx: Ejemplo completo de subsistema PIDS
fr_ca: Exemple complet avec PIDSubsystem
tr_tr: Tam PIDSubsystem Örneği
zh_cn: 完整的PID子系统示例

source: What does a ``PIDSubsystem`` look like when used in practice? The following examples are taken from the FrisbeeBot example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/frisbeebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Frisbeebot>`__):
es_mx: ¿Cómo se ve un ``PIDSubsystem`` cuando se usa en la práctica? Los siguientes ejemplos se han extraído del proyecto de ejemplo de FrisbeeBot (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/frisbeebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Frisbeebot>`__):
fr_ca: À quoi ressemble un ``PIDSubsystem`` lorsqu’il est utilisé dans la pratique? Les exemples suivants sont pris à partir du projet d’exemple FrisbeeBot(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/frisbeebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Frisbeebot>`__):
tr_tr: Pratikte kullanıldığında bir ``PIDS alt sistemi``neye benzer? Aşağıdaki örnekler, FrisbeeBot örnek projesinden alınmıştır (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/frisbeebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Frisbeebot>`__):
zh_cn: 在实践中使用时，“ PIDSubsystem”是什么样的？以下示例取自FrisbeeBot示例项目（Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/frisbeebot>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Frisbeebot>`__）：

source: C++ (Header)
fr_ca: C++ (Header ou en-tête)

source: Using a ``PIDSubsystem`` with commands can be very simple:
es_mx: Usar un ``PIDSubsystem`` con comandos puede ser muy simple:
fr_ca: L'utilisation d'un ``PIDSubsystem`` avec des commandes peut être très simple:
tr_tr: Komutlarla bir ``PIDSubsystem`` kullanmak çok basit olabilir:
zh_cn: 通过命令使用“PIDSubsystem”非常简单：

source: PIDCommand
fr_ca: La classe PIDCommand
zh_cn: PID指令

source: The ``PIDCommand`` class allows users to easily create commands with a built-in PIDController. As with PIDSubsystem, users can create a ``PIDCommand`` by subclassing the ``PIDCommand`` class. However, as with many of the other command classes in the command-based library, users may want to save code by defining a ``PIDCommand`` :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`.
es_mx: La clase ``PIDCommand`` permite a los usuarios crear fácilmente comandos con un PIDController incorporado. Al igual que con el subsistema PIDS, los usuarios pueden crear un ``PIDCommand`` subclasificando la clase ``PIDCommand``. Sin embargo, al igual que con muchas de las otras clases de comandos en la biblioteca basada en comandos, los usuarios pueden querer guardar el código definiendo un ``PIDCommand`` :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`.
fr_ca: La classe ``PIDCommand`` permet aux utilisateurs de créer facilement des commandes avec un PIDController intégré. Comme avec PIDSubsystem, les utilisateurs peuvent créer un ``PIDCommand`` en sous-classant la classe ``PIDCommand``. Cependant, comme avec la plupart des autres classes de la librairie basée sur les commandes, les utilisateurs peuvent vouloir réduire la quantité de code/programme en définissant une version :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>` de ``PIDCommand``.
tr_tr: ``PIDCommand`` sınıfı, kullanıcıların yerleşik bir PIDController ile kolayca komutlar oluşturmasına olanak tanır. PIDSubsystem ile olduğu gibi, kullanıcılar ``PIDCommand`` sınıfını alt sınıflayarak bir ``PIDCommand`` oluşturabilir. Bununla birlikte, komut tabanlı kitaplıktaki diğer birçok komut sınıfında olduğu gibi, kullanıcılar bir `` PIDCommand`` tanımlayarak kodu kaydetmek isteyebilir :ref: `inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`.
zh_cn: “PIDCommand”类允许用户使用内置的PID控制器轻松创建指令。与PID子系统一样，用户可以通过子类化“PIDCommand”类来创建PID指令。但是，与基于指令的库中的许多其他指令类一样，用户可能希望通过定义一个“PIDCommand”来保存代码:ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`。

source: Creating a PIDCommand
es_mx: Crear un comando PID
fr_ca: Création d'une commande PID
tr_tr: Bir PIDCommand oluşturma
zh_cn: 创建一个PID指令

source: A ``PIDCommand`` can be created two ways - by subclassing the ``PIDCommand`` class, or by defining the command :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. Both methods ultimately extremely similar, and ultimately the choice of which to use comes down to where the user desires that the relevant code be located.
fr_ca: Un ``PIDCommand`` peut être créé de deux manières - en sous-classant la classe ``PIDCommand``, ou en définissant la commande de façon :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. Les deux méthodes sont extrêmement similaires et, finalement, le choix de la méthode à utiliser se résume à l'endroit où l'utilisateur souhaite que le code correspondant soit situé.
