Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/pid-subsystems-commands.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: In either case, a ``PIDCommand`` is created by passing the necessary parameters to its constructor (if defining a subclass, this can be done with a `super()` call):
es_mx: En cualquier caso, se crea un ``PIDCommand`` pasando los parámetros necesarios a su constructor (si se define una subclase, esto se puede hacer con una llamada `super()` call):
fr_ca: Dans les deux cas, un ``PIDCommand`` est créé en passant les paramètres nécessaires à son constructeur (lors de la définition d'une sous-classe, cela peut être fait avec un appel `super()` ):
tr_tr: Her iki durumda da, gerekli parametreleri kurucusuna ileterek bir ``PIDCommand`` oluşturulur (eğer bir alt sınıf tanımlıyorsa, bu bir `super()` çağrısıyla yapılabilir):
zh_cn: 无论哪种情况，都会通过将必要的参数传递给“PIDCommand”的构造函数来创建“PIDCommand”（如果定义了子类，则可以通过“ super()”调用来完成）：

source: controller
fr_ca: manette
tr_tr: Kontrolör - Controller

source: The ``controller`` parameter is the ``PIDController`` object that will be used by the command. By passing this in, users can specify the PID gains and the period for the controller (if the user is using a nonstandard main robot loop period).
es_mx: El parámetro ``controller`` es el objeto ``PIDController`` que será utilizado por el comando. Al pasar esto, los usuarios pueden especificar las ganancias de PID y el período para el controlador (si el usuario está utilizando un período de bucle de robot principal no estándar).
fr_ca: Le paramètre ``controller`` est l'objet ``PIDController`` qui sera utilisé par la commande. En transmettant cela, les utilisateurs peuvent spécifier les gains PID et la période pour le contrôleur (dans ce dernier cas, si l'utilisateur utilise une période de boucle de robot principal non standard).
tr_tr: ``Controller`` parametresi, komut tarafından kullanılacak olan ``PIDController`` nesnesidir. Bunu bilerek, kullanıcılar PID kazanımlarını, ve kontrolör için süreyi belirleyebilir (eğer kullanıcı standart olmayan bir ana robot döngü periyodu kullanıyorsa).
zh_cn: “controller”参数是在指令中将使用的“PIDController”对象。通过传递此参数，用户可以详细指定PID增益和控制器的周期（如果用户使用的是非标准主机器人循环周期）。

source: When subclassing ``PIDCommand``, additional modifications (e.g. enabling continuous input) can be made to the controller in the constructor body by calling ``getController()``.
es_mx: Al subclasificar ``PIDCommand``, se pueden realizar modificaciones adicionales (por ejemplo, habilitar la entrada continua) al controlador en el cuerpo del constructor llamando a ``getController()``.
fr_ca: Lors de la sous-classification de ``PIDCommand``, des modifications supplémentaires (par exemple, l'activation d'une entrée continue) peuvent être apportées au contrôleur dans le corps du constructeur en appelant ``getController()``.
tr_tr: ``PIDCommand`` alt sınıfını oluştururken, ``getController()`` çağrısı yapılarak yapıcı gövdesindeki denetleyicide ek değişiklikler (ör. Sürekli girişi etkinleştirmek) yapılabilir.
zh_cn: 当子类化“PIDCommand”时，可以通过调用getController()对构造函数主体中的控制器进行额外的修改（例如启用连续输入）。

source: measurementSource
fr_ca: Le paramètre measurementSource

source: The ``measurementSource`` parameter is a function (usually passed as a :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) that returns the measurement of the process variable. Passing in the ``measurementSource`` function in ``PIDCommand`` is functionally analogous to overriding the `getMeasurement()`_ function in ``PIDSubsystem``.
es_mx: El parámetro ``measurementSource`` es una función (generalmente pasada como :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) que devuelve la medición de la variable de proceso. Pasar la función ``measurementSource`` en ``PIDCommand`` es funcionalmente análogo a anular la función `getMeasurement()`_ en ``PIDSubsystem``.
fr_ca: Le paramètre ``measurementSource`` est une fonction (généralement transmise sous la forme :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) qui renvoie la mesure de la variable de processus. Le passage de la fonction ``measurementSource`` dans ``PIDCommand`` est fonctionnellement similaire à la substitution de la fonction `getMeasurement()`_ dans ``PIDSubsystem``.
tr_tr: ``MeasurementSource`` parametresi, işlem değişkeninin ölçümünü döndüren bir işlevdir (genellikle a: ref: `lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)> olarak geçer) ``PIDCommand`` içindeki ``MeasurementSource`` işlevini geçmek, işlevsel olarak `` PIDSubsystem`` içindeki `getMeasurement ()`_ işlevini geçersiz kılmaya benzer.
zh_cn: “measurementSource”参数是一个函数（通常作为:ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`传递），该函数返回过程变量的度量值。在“PIDCommand”中传递“measurementSource”函数在功能上类似于覆盖“PIDSubsystem”中的“getMeasurement()”_函数。

source: When subclassing ``PIDCommand``, advanced users may further modify the measurement supplier by modifying the class's ``m_measurement`` field.
es_mx: Al realizar una subclasificación de ``PIDCommand``, los usuarios avanzados pueden modificar aún más el proveedor de medición modificando el campo ``m_measurement`` de la clase.
fr_ca: Lors de la sous-classification de ``PIDCommand``, les utilisateurs plus expérimentés peuvent modifier le système qui fournit les mesures en modifiant le champ ``m_measurement`` de la classe.
tr_tr: ``PIDCommand`` alt sınıfını oluştururken, ileri düzey kullanıcılar, sınıfın ``m_measurement`` alanını değiştirerek ayar noktası tedarikçisini daha da değiştirebilir.
zh_cn: 当子类化“PIDCommand”时，高级用户可以通过修改类的“m_measurement”字段来进一步修改度量值提供器。

source: setpointSource
fr_ca: Le paramètre setpointSource

source: The ``setpointSource`` parameter is a function (usually passed as a :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) that returns the current setpoint for the control loop. If only a constant setpoint is needed, an overload exists that takes a constant setpoint rather than a supplier.
es_mx: El parámetro ``setpointSource`` es una función (generalmente pasada como :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) que devuelve el punto de ajuste actual para el bucle de control. Si solo se necesita un punto de ajuste constante, existe una sobrecarga que toma un punto de ajuste constante en lugar de un proveedor.
fr_ca: Le paramètre ``setpointSource`` est une fonction (généralement transmise sous la forme :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) qui renvoie le point de consigne actuel pour la boucle de contrôle. Si seulement un point de consigne constant est nécessaire, il existe une version qui utilise ce seul point de consigne constant plutôt qu'une fonction-fournisseur.
tr_tr: ``setpointSource`` parametresi, kontrol döngüsü için geçerli ayar noktasını döndüren bir işlevdir (genellikle :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>` olarak geçer). Yalnızca sabit bir ayar noktasına ihtiyaç duyulursa, bir tedarikçiden ziyade sabit bir ayar noktası alan bir aşırı yük vardır.
zh_cn: “setpointSource”参数是一个函数（通常作为:ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`传递），该函数返回控制回路的当前设定值。如果仅需要一个恒定的设定值，则存在一个需要恒定的设定值而不是提供器的过载。

source: When subclassing ``PIDCommand``, advanced users may further modify the setpoint supplier by modifying the class's ``m_setpoint`` field.
es_mx: Al subclasificar ``PIDCommand``, los usuarios avanzados pueden modificar aún más el proveedor del punto de ajuste modificando el campo``m_setpoint`` de la clase.
fr_ca: Lors de la sous-classification de ``PIDCommand``, les utilisateurs plus expérimentés peuvent modifier le système qui fournit les mesures en modifiant le champ ``m_measurement`` de la classe.
tr_tr: ``PIDCommand`` alt sınıfını oluştururken, ileri düzey kullanıcılar, sınıfın ``m_setpoint`` alanını değiştirerek ayar noktası tedarikçisini daha da değiştirebilir.
zh_cn: 当子类化“PIDCommand”时，高级用户可以通过修改类的“m_setpoint”字段来进一步修改设定值提供器。

source: useOutput
fr_ca: Le paramètre useOutput

source: The ``useOutput`` parameter is a function (usually passed as a :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) that consumes the output and setpoint of the control loop. Passing in the ``useOutput`` function in ``PIDCommand`` is functionally analogous to overriding the `useOutput()`_ function in ``PIDSubsystem``.
es_mx: El parámetro ``useOutput`` es una función (generalmente pasada como :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) que consume la salida y el punto de ajuste del bucle de control. Pasar la función ``useOutput`` en ``PIDCommand`` es funcionalmente análogo a anular la función `useOutput()`_ en ``PIDSubsystem``.
fr_ca: Le paramètre ``useOutput`` est une fonction (généralement transmise sous la forme :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) qui utilise la sortie et le point de consigne de la boucle de contrôle. Le passage de la fonction ``useOutput`` dans ``PIDCommand`` est fonctionnellement similaire à la substitution de la fonction `useOutput ()`_ dans ``PIDSubsystem``.
tr_tr: ``useOutput`` parametresi, kontrol döngüsünün çıkış ve ayar noktası durumunu tüketen bir işlevdir (genellikle :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) olarak geçirilir. ``PIDCommand`` içindeki ``useOutput`` işlevini geçirmek, işlevsel olarak ``PIDSubsystem`` içindeki `useOutput()' işlevini geçersiz kılmaya benzer.
zh_cn: “useOutput”参数是一个函数（通常作为:ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`传递），该函数使用控制循环的输出值和设定值。在“PIDCommand”中传递“useOutput”函数在功能上类似于覆盖“PIDSubsystem”中的“useOutput()”_函数。

source: When subclassing ``PIDCommand``, advanced users may further modify the output consumer by modifying the class's ``m_useOutput`` field.
es_mx: Al subclasificar ``PIDCommand``, los usuarios avanzados pueden modificar aún más el consumidor de salida modificando el campo ``m_useOutput`` de la clase.
fr_ca: Lors de la sous-classification de ``PIDCommand``, les utilisateurs plus expérimentés peuvent modifier le système qui fournit les mesures en modifiant le champ ``m_measurement`` de la classe.
tr_tr: ``PIDCommand`` alt sınıfını oluştururken, ileri düzey kullanıcılar, sınıfın ``m_useOutput`` alanını değiştirerek çıktı tüketicisini daha da değiştirebilir.
zh_cn: 当子类化“PIDCommand”时，高级用户可以通过修改类的“m_useOutput”字段来进一步修改输出值使用器。

source: requirements
es_mx: requisitos
fr_ca: exigences
tr_tr: Gereksinimler
zh_cn: 要求

source: Like all inlineable commands, ``PIDCommand`` allows the user to specify its subsystem requirements as a constructor parameter.
es_mx: Como todos los comandos en línea, ``PIDCommand`` permite al usuario especificar los requisitos de su subsistema como un parámetro de constructor.
fr_ca: Comme toutes les commandes en ligne, ``PIDCommand`` permet à l'utilisateur de spécifier des exigences de sous-système via ses paramètres de constructeur.
tr_tr: Tüm satır içi komutlar gibi, ``PIDCommand`` kullanıcının alt sistem gereksinimlerini bir constructor parametresi olarak belirtmesine izin verir.
zh_cn: 像所有内联命令一样，“PIDCommand”允许用户将其子系统要求指定为构造函数参数。

source: Full PIDCommand Example
es_mx: Ejemplo completo de comando PID
fr_ca: Exemple complet de PIDCommand
tr_tr: Tam PIDCommand Örneği
zh_cn: 完整的PID指令示例

source: What does a ``PIDCommand`` look like when used in practice? The following examples are from the GyroDriveCommands example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__):
es_mx: ¿Qué aspecto tiene un ``PIDCommand`` cuando se utiliza en la práctica? Los siguientes ejemplos proceden del proyecto de ejemplo GyroDriveCommands (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__):
fr_ca: À quoi ressemble un ``PIDCommand`` lorsqu’il est utilisé dans la pratique? Les exemples suivants proviennent du projet d’exemple GyroDriveCommands (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__):
tr_tr: Pratikte kullanıldığında bir``PIDCommand`` neye benzer? Aşağıdaki örnekler GyroDriveCommands örnek projesinden alınmıştır (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>` __):
zh_cn: 在实际使用中，“ PIDCommand”是什么样的？以下示例来自GyroDriveCommands示例项目（`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__）：

source: And, for an :ref:`inlined <docs/software/commandbased/convenience-features:Inline Command Definitions>` example:
es_mx: Y, para un ejemplo :ref:`inlined <docs/software/commandbased/convenience-features:Inline Command Definitions>`.
fr_ca: Et, pour un exemple de type :ref:`inlined <docs/software/commandbased/convenience-features:Inline Command Definitions>` :
tr_tr: Ve bir :ref:`inlined<docs/software/commandbased/convenience-features:Inline Command Definitions>` örneği için :
zh_cn: 以及对于:ref:`inlined <docs/software/commandbased/convenience-features:Inline Command Definitions>` 的示例：

source: The ``PIDSubsystem`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PIDSubsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDSubsystem.html>`__) allows users to conveniently create a subsystem with a built-in ``PIDController``. In order to use the ``PIDSubsystem`` class, users must create a subclass of it.
es_mx: La clase ``PIDSubsystem`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PIDSubsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDSubsystem.html>`__) permite a los usuarios crear convenientemente un subsistema con un ``PIDController``. Para utilizar la clase ``PIDSubsystem``, los usuarios deben crear una subclase de la misma.

source: enable() and disable()
es_mx: enable() y disable()
tr_tr: enable() ve disable()
zh_cn: enable()和disable()

source: A ``PIDCommand`` can be created two ways - by subclassing the ``PIDCommand`` class, or by defining the command :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. Both methods ultimately extremely similar, and ultimately the choice of which to use comes down to where the user desires that the relevant code be located.
es_mx: Se puede crear un ``PIDCommand`` de dos maneras: subclasificando la clase ```PIDCommand`` o definiendo el comando :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. En última instancia, ambos métodos son extremadamente similares y, en última instancia, la elección de cuál usar se reduce al lugar donde el usuario desea que se ubique el código relevante.
