Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/profilepid-subsystems-commands.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: In C++, the ``ProfiledPIDCommand`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in values *must* have units consistent with the distance units, or a compile-time error will be thrown. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
es_mx: En C++, la clase ``ProfiledPIDCommand`` se basa en el tipo de unidad utilizado para las mediciones de distancia, que puede ser angular o lineal. Los valores pasados *deben* tener unidades consistentes con las unidades de distancia, o se lanzará un error en tiempo de compilación. Para obtener más información sobre las unidades C++, consulte :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
fr_ca: En C++, la classe ``ProfiledPIDCommand`` est basée sur le type d'unité utilisé pour les mesures de distance, qui peut être angulaire ou linéaire. Les valeurs transmises *doivent* avoir des unités cohérentes avec les unités de distance, sinon une erreur de compilation sera levée. Pour plus d'informations sur les unités C++, voir :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
tr_tr: C ++ 'da, ``ProfiledPIDCommand`` sınıfı, açısal veya doğrusal olabilen mesafe ölçümleri için kullanılan birim türüne göre şablonlanır. İletilen değerler *zorunlu* mesafe birimleriyle tutarlı birimlere sahip olmalıdır, aksi takdirde derleme zamanı hatası atılır. C ++ birimleri hakkında daha fazla bilgi için bkz . :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
zh_cn: 在C ++中，“ProfiledPIDCommand”类以用于距离测量的单位类型为模板，该单位类型可以是角度或线性的。传入的值*必须*具有与距离单位一致的单位，否则将引发编译时错误。有关C ++单元的更多信息，请参阅:ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`。

source: The ``ProfiledPIDCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ProfiledPIDCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_profiled_p_i_d_command.html>`__) allows users to easily create commands with a built-in ProfiledPIDController. As with ``ProfiledPIDSubsystem``, users can create a ``ProfiledPIDCommmand`` by subclassing the ``ProfiledPIDCommand`` class. However, as with many of the other command classes in the command-based library, users may want to save code by defining it :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`.
fr_ca: La classe ``ProfiledPIDCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ProfiledPIDCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_profiled_p_i_d_command.html>`__) permet aux utilisateurs de créer facilement des commandes avec un ProfiledPIDController intégré. Comme pour ``ProfiledPIDSubsystem``, les utilisateurs peuvent créer un ``ProfiledPIDCommmand`` en sous-classant la classe ``ProfiledPIDCommand``. Cependant, comme avec la plupart des autres classes de commandes de la librairie basée sur les commandes, les utilisateurs peuvent vouloir enregistrer le code en le définissant :ref:`en-ligne <docs/software/commandbased/convenience-features:Inline Command Definitions>`.

source: Creating a PIDCommand
es_mx: Creación de un comando PID
fr_ca: Création d'une commande PID
tr_tr: Bir PIDCommand oluşturma
zh_cn: 创建一个PIDCommand

source: A ``ProfiledPIDCommand`` can be created two ways - by subclassing the ``ProfiledPIDCommand`` class, or by defining the command :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. Both methods ultimately extremely similar, and ultimately the choice of which to use comes down to where the user desires that the relevant code be located.
es_mx: Un ``ProfiledPIDCommand`` se puede crear de dos formas: subclasificando la clase ``ProfiledPIDCommand`` o definiendo el comando :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. En última instancia, ambos métodos son extremadamente similares y, en última instancia, la elección de cuál usar se reduce al lugar donde el usuario desea que se ubique el código relevante.
fr_ca: Un ``ProfiledPIDCommand`` peut être créé de deux manières - en sous-classant la classe ``ProfiledPIDCommand``, ou en définissant la commande :ref:`en-ligne <docs/software/commandbased/convenience-features:Inline Command Definitions>`. Les deux méthodes sont extrêmement similaires et, en fin de compte, le choix de l'utilisation se résume à l'endroit où l'utilisateur souhaite que le code correspondant soit situé.
tr_tr: Bir ``ProfiledPIDCommand`` iki şekilde oluşturulabilir - `` ProfiledPIDCommand`` sınıfını alt sınıflara ayırarak veya şu komutu tanımlayarak :ref: `inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. Her iki yöntem de nihayetinde son derece benzer ve nihayetinde hangisinin kullanılacağına ilişkin seçim, kullanıcının ilgili kodun yerleştirilmesini istediği yere iner.
zh_cn: 可以通过两种方式创建“ProfiledPIDCommand”：通过对“ProfiledPIDCommand”类进行子类化，或者通过定义指令:ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`。两种方法最终都极为相似，最终选择使用哪种方法取决于用户希望找到相关代码的位置。

source: In either case, a ``ProfiledPIDCommand`` is created by passing the necessary parameters to its constructor (if defining a subclass, this can be done with a `super()` call):
es_mx: En cualquier caso, se crea un ``ProfiledPIDCommand`` pasando los parámetros necesarios a su constructor (si se define una subclase, esto se puede hacer con una llamada `super()`):
fr_ca: Dans les deux cas, un ``ProfiledPIDCommand`` est créé en passant les paramètres nécessaires à son constructeur (si vous définissez une sous-classe, cela peut être fait avec un appel `super()`):
tr_tr: Her iki durumda da, gerekli parametreleri yapıcısına ileterek bir ``ProfiledPIDCommand`` oluşturulur (bir alt sınıf tanımlıyorsa, bu bir `super ()` çağrısıyla yapılabilir):
zh_cn: 无论哪种情况，都通过向构造函数传递必要的参数来创建“ProfileDPIDCommand”（如果定义了子类，则可以通过调用“super()”来完成）：

source: controller
es_mx: controlador
fr_ca: Le paramètre controller
tr_tr: Kontrolör - Controller

source: The ``controller`` parameter is the ``ProfiledPIDController`` object that will be used by the command. By passing this in, users can specify the PID gains, the motion profile constraints, and the period for the controller (if the user is using a nonstandard main robot loop period).
es_mx: El parámetro ``controller`` es el objeto ``ProfiledPIDController`` que será utilizado por el comando. Al pasar esto, los usuarios pueden especificar las ganancias de PID, las restricciones del perfil de movimiento y el período para el controlador (si el usuario está utilizando un período de bucle de robot principal no estándar).
fr_ca: Le paramètre ``controller`` est l'objet ``ProfiledPIDController`` qui sera utilisé par la commande. En transmettant cela, les utilisateurs peuvent spécifier les gains PID, les contraintes de profil de mouvement et la période pour le contrôleur (si l'utilisateur utilise une période de boucle de robot principal non standard).
tr_tr: ``Controller`` parametresi, komut tarafından kullanılacak olan ``ProfiledPIDController`` nesnesidir. Bunu geçerek, kullanıcılar PID kazanımlarını, hareket profili kısıtlamalarını ve kontrolör için süreyi belirleyebilir (eğer kullanıcı standart olmayan bir ana robot döngü periyodu kullanıyorsa).
zh_cn: “controller”参数是在指令中将使用的“ProfiledPIDController”对象。通过传递此参数，用户可以指定PID增益，运动曲线约束和控制器的周期（如果用户使用的是非标准的主机器人循环周期）。

source: When subclassing ``ProfiledPIDCommand``, additional modifications (e.g. enabling continuous input) can be made to the controller in the constructor body by calling ``getController()``.
es_mx: Al subclasificar ``ProfiledPIDCommand``, se pueden realizar modificaciones adicionales (por ejemplo, habilitar la entrada continua) al controlador en el cuerpo del constructor llamando a ``getController()``.
fr_ca: Lors de la sous-classification de ``ProfiledPIDCommand``, des modifications supplémentaires (par exemple, l'activation d'une entrée continue) peuvent être apportées au contrôleur dans le corps du constructeur en appelant ``getController()``.
tr_tr: ``ProfiledPIDCommand`` alt sınıfını oluştururken, ``getController()`` çağrısı yapılarak yapıcı gövdesindeki denetleyicide ek değişiklikler (ör. Sürekli girişi etkinleştirmek) yapılabilir.
zh_cn: 当将“ProfiledPIDCommand”子类化时，可以通过调用“getController()”对构造函数主体中的控制器进行其他修改（例如，启用连续输入）。

source: measurementSource
fr_ca: Le paramètre measurementSource

source: The ``measurementSource`` parameter is a function (usually passed as a :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) that returns the measurement of the process variable. Passing in the ``measurementSource`` function in ``ProfiledPIDCommand`` is functionally analogous to overriding the `getMeasurement()`_ function in ``ProfiledPIDSubsystem``.
es_mx: El parámetro ``measurementSource`` es una función (normalmente pasada como :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) que devuelve la medida de la variable de proceso. Pasar la función ``measurementSource`` en ``ProfiledPIDCommand`` es funcionalmente análogo a anular la función `getMeasurement()`_ en ``ProfiledPIDSubsystem``.
fr_ca: Le paramètre ``measurementSource`` est une fonction (généralement transmise sous la forme :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) qui renvoie la mesure de la variable de processus. Le passage de la fonction ``measurementSource`` dans ``ProfiledPIDCommand`` est fonctionnellement analogue à la substitution de la fonction `getMeasurement()`_ dans ``ProfiledPIDSubsystem``.
tr_tr: ``measurementSource`` parametresi, işlem değişkeninin ölçümünü döndüren bir işlevdir (genellikle a :ref: `lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) olarak geçer. ``ProfiledPIDCommand`` içindeki `` measurementSource '' işlevini geçirmek, işlevsel olarak ``ProfiledPIDSubsystem`` içindeki `getMeasurement()`_ işlevinin geçersiz kılınmasına benzer.
zh_cn: “measurementSource”参数是一个函数（通常作为:ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`传递），该函数返回过程变量的度量值。在“ProfiledPIDCommand”中传递“measurementSource”函数在功能上类似于重写“ProfiledPIDSubsystem”中的`getMeasurement()`_函数。

source: When subclassing ``ProfiledPIDCommand``, advanced users may further modify the measurement supplier by modifying the class's ``m_measurement`` field.
es_mx: Al subclasificar ``ProfiledPIDCommand``, los usuarios avanzados pueden modificar aún más el proveedor de medidas modificando el campo ``m_measurement`` de la clase.
fr_ca: Lors de la sous-classe de ``ProfiledPIDCommand``, les utilisateurs avancés peuvent modifier davantage les sources de mesures en modifiant le champ ``m_measurement`` de la classe.
tr_tr: ``ProfiledPIDCommand`` alt sınıfını oluştururken, ileri düzey kullanıcılar, sınıfın ``m_measurement`` alanını değiştirerek ölçüm tedarikçisini daha da değiştirebilir.
zh_cn: 在子类化“ProfiledPIDCommand”时，高级用户可以通过修改类的“m_measurement”字段来进一步修改度量提供者。

source: goalSource
fr_ca: Le paramètre goalSource

source: The ``goalSource`` parameter is a function (usually passed as a :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) that returns the current goal state for the mechanism. If only a constant goal is needed, an overload exists that takes a constant goal rather than a supplier. Additionally, if goal velocities are desired to be zero, overloads exist that take a constant distance rather than a full profile state.
es_mx: El parámetro ``goalSource`` es una función (generalmente pasada como :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) que devuelve el estado objetivo actual para el mecanismo. Si solo se necesita un objetivo constante, existe una sobrecarga que requiere un objetivo constante en lugar de un proveedor. Además, si se desea que las velocidades objetivo sean cero, existen sobrecargas que toman una distancia constante en lugar de un estado de perfil completo.
fr_ca: Le paramètre ``goalSource`` est une fonction (généralement passée sous la forme :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) qui renvoie l'état actuel de l'objectif pour le mécanisme. Si seul un objectif constant est nécessaire, il existe une version qui prend un objectif constant plutôt qu'un fournisseur. De plus, si l'on veut que les vitesses d'objectif soient nulles, il existe des versions qui prennent une distance constante plutôt qu'un état de profil complet.
tr_tr: ``goalSource`` parametresi, mekanizma için geçerli hedef durumunu döndüren bir işlevdir (genellikle a: ref: `lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) olarak geçirilir. Yalnızca sabit bir hedefe ihtiyaç duyulursa, bir tedarikçiden ziyade sabit bir hedef alan bir aşırı yük vardır. Ek olarak, hedef hızlarının sıfır olması isteniyorsa, tam profil durumundan ziyade sabit bir mesafe alan aşırı yükler mevcuttur.
zh_cn: “goalSource”参数是一个函数（通常作为:ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`传递），返回该机制的当前目标状态。如果仅需要一个不变的目标，那么就存在一个需要一个不变的目标而不是供应商的过载。另外，如果希望目标速度为零，则存在以恒定距离而不是完整轮廓状态存在的过载。

source: When subclassing ``ProfiledPIDCommand``, advanced users may further modify the setpoint supplier by modifying the class's ``m_goal`` field.
es_mx: Al subclasificar ``ProfiledPIDCommand``, los usuarios avanzados pueden modificar aún más el proveedor del punto de ajuste modificando el campo ``m_goal`` de la clase.
fr_ca: Lors de la sous-classe de ``ProfiledPIDCommand``, les utilisateurs avancés peuvent modifier davantage le fournisseur de point de consigne en modifiant le champ ``m_goal`` de la classe.
tr_tr: ``ProfiledPIDCommand`` alt sınıfını oluştururken, ileri düzey kullanıcılar, sınıfın ``m_goal`` alanını değiştirerek ayar noktası tedarikçisini daha da değiştirebilir.
zh_cn: 当子类化“ProfiledPIDCommand”时，高级用户可以通过修改类的“m_goal”字段来进一步修改设定值供应商。

source: useOutput
fr_ca: Le paramètre useOutput

source: The ``useOutput`` parameter is a function (usually passed as a :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) that consumes the output and setpoint state of the control loop. Passing in the ``useOutput`` function in ``ProfiledPIDCommand`` is functionally analogous to overriding the `useOutput()`_ function in ``ProfiledPIDSubsystem``.
es_mx: El parámetro ``useOutput`` es una función (generalmente pasada como :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) que consume la salida y el estado del punto de ajuste del lazo de control. Pasar la función ``useOutput`` en ``ProfiledPIDCommand`` es funcionalmente análogo a anular la función `useOutput()`_ en ``ProfiledPIDSubsystem``.
fr_ca: Le paramètre ``useOutput`` est une fonction (généralement transmise sous la forme :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) qui utilise l'état de sortie et le point de consigne de la boucle de contrôle. Le passage de la fonction ``useOutput`` dans ``ProfiledPIDCommand`` est fonctionnellement analogue à la substitution de la fonction `useOutput ()`_ dans ``ProfiledPIDSubsystem``.
tr_tr: ``useOutput`` parametresi, kontrol döngüsünün çıkış ve ayar noktası durumunu tüketen bir işlevdir (genellikle a: ref: `lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) olarak geçirilir. ``ProfiledPIDCommand``' içindeki ``useOutput`` işlevini geçirmek, işlevsel olarak ``ProfiledPIDSubsystem`` içindeki `useOutput() `_ işlevini geçersiz kılmaya benzer.
zh_cn: “useOutput”参数是一个函数（通常作为:ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`传递），它消耗控制循环的输出和设定点状态。在“ProfiledPIDCommand”中传递“useOutput”函数在功能上类似于重写“ProfiledPIDSubsystem”中的`useOutput()`_函数。

source: When subclassing ``ProfiledPIDCommand``, advanced users may further modify the output consumer by modifying the class's ``m_useOutput`` field.
es_mx: Al subclasificar ``ProfiledPIDCommand``, los usuarios avanzados pueden modificar aún más el consumidor de salida modificando el campo ``m_useOutput`` de la clase.
fr_ca: Lors de la sous-classe de ``ProfiledPIDCommand``, les utilisateurs avancés peuvent modifier davantage l'état de sortie en modifiant le champ ``m_useOutput`` de la classe.
tr_tr: ``ProfiledPIDCommand`` alt sınıfını oluştururken, ileri düzey kullanıcılar, sınıfın ``m_useOutput`` alanını değiştirerek çıktı tüketicisini daha da değiştirebilir.
zh_cn: 在子类化“ProfiledPIDCommand”时，高级用户可以通过修改类的“m_useOutput”字段来进一步修改输出使用者。

source: requirements
es_mx: requisitos
fr_ca: Les exigences
tr_tr: Gereksinimler

source: Like all inlineable commands, ``ProfiledPIDCommand`` allows the user to specify its subsystem requirements as a constructor parameter.
es_mx: Como todos los comandos en línea, ``ProfiledPIDCommand`` permite al usuario especificar los requisitos de su subsistema como un parámetro de constructor.
fr_ca: Comme toutes les commandes en ligne, ``ProfiledPIDCommand`` permet à l'utilisateur de spécifier ses exigences de sous-système en tant que paramètre constructeur.
tr_tr: Tüm satır içi olmayan komutlar gibi, ``ProfiledPIDCommand`` kullanıcının alt sistem gereksinimlerini bir yapıcı parametresi olarak belirtmesine izin verir.
zh_cn: 像所有内联命令一样，“ProfiledPIDCommand”允许用户将其子系统要求指定为构造函数参数。

source: Full ProfiledPIDCommand Example
es_mx: Ejemplo completo de ProfiledPIDCommand
fr_ca: Exemple complet de ProfiledPIDCommand
tr_tr: Tam ProfiledPIDCommand Örneği
zh_cn: 完整ProfiledPIDCommand示例

source: What does a ``ProfiledPIDCommand`` look like when used in practice? The following examples are from the GyroDriveCommands example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__):
es_mx: ¿Qué aspecto tiene un ``ProfiledPIDCommand`` cuando se utiliza en la práctica? Los siguientes ejemplos proceden del proyecto de ejemplo GyroDriveCommands (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__):
fr_ca: À quoi ressemble un ``ProfiledPIDCommand`` lorsqu’il est utilisé dans la pratique? Les exemples suivants proviennent du projet d’exemple GyroDriveCommands (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__):
tr_tr: Pratikte kullanıldığında bir ``ProfiledPIDCommand`` neye benziyor? Aşağıdaki örnekler GyroDriveCommands örnek projesinden alınmıştır (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>` __):
zh_cn: 在实际使用中，“ ProfiledPIDCommand”是什么样的？以下示例来自GyroDriveCommands示例项目（`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__）：

source: Todo
es_mx: Que hacer
fr_ca: Ce qui reste à faire

source: inlined example?
es_mx: ¿ejemplo en línea?
fr_ca: Un exemple en ligne?
tr_tr: Satır İçi Örnek?
zh_cn: 内联示例？

source: ProfiledPIDSubsystem
es_mx: Subsistema ProfiledPIDS

source: C++ (Source)
es_mx: C++ (Fuente)

source: ProfiledPIDCommand
es_mx: Comando ProfiledPID
