Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/profile-subsystems-commands.po
Languages: fr_ca, tr_tr, zh_cn

source: The ``output`` parameter is a function (usually passed as a :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) that consumes the output and setpoint of the control loop. Passing in the ``useOutput`` function in ``PIDCommand`` is functionally analogous to overriding the `useState()`_ function in ``PIDSubsystem``.
fr_ca: Le paramètre ``sortie`` est une fonction (généralement transmise sous la forme :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) qui utilise la sortie et le point de consigne de la boucle de contrôle. Le passage de la fonction ``useOutput`` dans ``PIDCommand`` est fonctionnellement similaire à la substitution de la fonction `useState()`_ dans ``PIDSubsystem``.
tr_tr: ``Output`` çıktı parametresi, kontrol döngüsünün çıkışını ve ayar noktasını kullanan bir işlevdir (genellikle :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>` olarak geçer). ``PIDCommand`` içindeki ``useOutput`` işlevini geçirmek, işlevsel olarak ``PIDSubsystem`` içindeki `useState()`_ işlevini geçersiz kılmaya benzer.
zh_cn: “output”参数是一个函数（通常作为:ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`传递），它消耗控制回路的输出和设定值。在“PIDCommand”中传递“useOutput”函数在功能上类似于重写“PIDSubsystem”中的`useState()`_函数。

source: requirements
fr_ca: Les exigences
tr_tr: gereksinimler

source: Like all inlineable commands, ``TrapezoidProfileCommand`` allows the user to specify its subsystem requirements as a constructor parameter.
fr_ca: Comme toutes les commandes en ligne, ``TrapezoidProfileCommand`` permet à l'utilisateur de spécifier ses exigences de sous-système en tant que paramètre constructeur.
tr_tr: Tüm satır içi komutlar gibi, ``TrapezoidProfileCommand`` kullanıcının alt sistem gereksinimlerini bir constructor parametresi olarak belirtmesine izin verir.
zh_cn: 像所有内联命令一样，“TrapezoidProfileCommand”允许用户将其子系统要求指定为构造函数参数。

source: Full TrapezoidProfileCommand Example
fr_ca: Exemple de commande TrapezoidProfileCommand complète
tr_tr: Tam TrapezoidProfileCommand Örneği
zh_cn: 完整的TrapezoidProfileCommand示例

source: What does a ``TrapezoidProfileSubsystem`` look like when used in practice? The following examples are taking from the DriveDistanceOffboard example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>`__):
fr_ca: À quoi ressemble un ``TrapezoidProfileSubsystem`` lorsqu’il est utilisé dans la pratique? Les exemples suivants proviennent du projet d’exemple DriveDistanceOffboard (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>`__):
tr_tr: Pratikte kullanıldığında bir ``TrapezoidProfileSubsystem`` neye benziyor? Aşağıdaki örnekler DriveDistanceOffboard örnek projesinden alınmıştır (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>` __):
zh_cn: 在实践中使用时，“ TrapezoidProfileSubsystem”是什么样的？以下示例取自DriveDistanceOffboard示例项目（Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>`__）：

source: And, for an :ref:`inlined <docs/software/commandbased/convenience-features:Inline Command Definitions>` example:
fr_ca: Et, pour un exemple de type :ref:`inlined <docs/software/commandbased/convenience-features:Inline Command Definitions>` :
tr_tr: Ve bir :ref:`inlined <docs/software/commandbased/convenience-features:Inline Command Definitions>` örneği için :
zh_cn: 并且，对于:ref:`inlined <docs/software/commandbased/convenience-features:Inline Command Definitions>` 的示例：

source: When controlling a mechanism, is often desirable to move it smoothly between two positions, rather than to abruptly change its setpoint. This is called "motion-profiling," and is supported in WPILib through the ``TrapezoidProfile`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/TrapezoidProfile.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TrapezoidProfile.html>`__).
tr_tr: Bir mekanizmayı kontrol ederken, ayar noktasını aniden değiştirmek yerine, genellikle onu iki konum arasında yumuşak bir şekilde hareket ettirmek istenir. Buna "motion-profiling, hareket profili oluşturma" denir ve WPILib'de ``TrapezoidProfile`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/TrapezoidProfile.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TrapezoidProfile.html>` __) aracılığıyla desteklenir.
zh_cn: 在控制机构时，通常希望在两个位置之间平稳地移动它，而不是突然更改其设定值。这称为“运动分析”，并且在WPILib中通过“ TrapezoidProfile”类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/TrapezoidProfile.html>` __，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TrapezoidProfile.html>`__）得到支持。

source: The ``TrapezoidProfileSubsystem`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileSubsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1TrapezoidProfileSubsystem.html>`__) will automatically create and execute trapezoidal motion profiles to reach the user-provided goal state. To use the ``TrapezoidProfileSubsystem`` class, users must create a subclass of it.
tr_tr: ``TrapezoidProfileSubsystem`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileSubsystem.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1TrapezoidProfileSubsystem.html>` __), kullanıcı tarafından sağlanan hedef durumuna ulaşmak için otomatik olarak trapezoidal hareket profilleri oluşturacak ve yürütecektir. ``TrapezoidProfileSubsystem`` sınıfını kullanmak için kullanıcılar bunun bir alt sınıfını oluşturmalıdır.
zh_cn: TrapezoidProfileSubsystem类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileSubsystem.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1TrapezoidProfileSubsystem.html>`__）将自动创建并执行梯形运动轮廓以达到用户提供的目标状态。要使用“ TrapezoidProfileSubsystem”类，用户必须创建它的子类。

source: The ``TrapezoidProfileCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1TrapezoidProfileCommand.html>`__) allows users to create a command that will execute a single ``TrapezoidProfile``, passing its current state at each iteration to a user-defined function.
tr_tr: ``TrapezoidProfileCommand`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1TrapezoidProfileCommand.html>`__), kullanıcıların her yinelemede mevcut durumunu kullanıcı tanımlı bir işleve geçirerek tek bir ``TrapezoidProfile`` yürütecek bir komut oluşturmasına olanak tanır. .
zh_cn: TrapezoidProfileCommand类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1TrapezoidProfileCommand.html>`__）允许用户创建一个执行单个``TrapezoidProfile''的命令，将每次迭代的当前状态传递给用户定义的函数。
