Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/profile-subsystems-commands.po
Languages: fr_ca, tr_tr, zh_cn

source: Motion Profiling through TrapezoidProfileSubsystems and TrapezoidProfileCommands
fr_ca: Profilage de mouvement via TrapezoidProfileSubsystems et TrapezoidProfileCommands
tr_tr: TrapezProfileSubsystems ve TrapezoidProfileCommands ile Hareket Profilleme
zh_cn: 通过TrapezoidProfileSubsystems和TrapezoidProfileCommands进行运动分析

source: For a description of the WPILib motion profiling features used by these command-based wrappers, see :ref:`docs/software/advanced-controls/controllers/trapezoidal-profiles:Trapezoidal Motion Profiles in WPILib`.
fr_ca: Pour une description des fonctionnalités de profilage de mouvement WPILib utilisées par ces wrappers basés sur des commandes, voir :ref:`docs/software/advanced-controls/controllers/trapezoidal-profiles:Trapezoidal Motion Profiles in WPILib`.
tr_tr: Bu komut tabanlı sarmalayıcılar tarafından kullanılan WPILib hareket profili oluşturma özelliklerinin bir açıklaması için bakınız :ref:`docs/software/advanced-controls/controllers/trapezoidal-profiles:Trapezoidal Motion Profiles in WPILib`
zh_cn: 有关这些基于指令的包装程序使用的WPILib运动分析功能的描述，请参阅:ref:`docs/software/advanced-controls/controllers/trapezoidal-profiles:Trapezoidal Motion Profiles in WPILib`。

source: The ``TrapezoidProfile`` command wrappers are generally intended for composition with custom or external controllers. For combining trapezoidal motion profiling with WPILib's ``PIDController``, see :doc:`profilepid-subsystems-commands`.
fr_ca: Les wrappers de commande ``TrapezoidProfile`` sont généralement destinés pour usage avec des contrôleurs personnalisés ou externes. Pour combiner le profilage de mouvement trapézoïdal avec le ``PIDController`` de WPILib, voir :doc:`profilepid-subsystems-commands`.
tr_tr: TrapezoidProfile`` komut sarmalayıcıları genellikle özel veya harici denetleyicilerle kompozisyon için tasarlanmıştır. Trapezoidal hareket profillemeyi WPILib'in ``PIDController`` ile birleştirmek için, bakınız :doc:`profilepid-subsystems-commands`.
zh_cn: “TrapezoidProfile”指令包装通常用于自定义或外部控制器的组合。要将梯形运动轮廓与WPILib的“PIDController”结合使用，请参阅:doc:`profilepid-subsystems-commands`。

source: When controlling a mechanism, is often desirable to move it smoothly between two positions, rather than to abruptly change its setpoint. This is called "motion-profiling," and is supported in WPILib through the ``TrapezoidProfile`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/TrapezoidProfile.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_trapezoid_profile.html>`__).
fr_ca: Lorsqu'on active un mécanisme, il est souvent souhaitable de le déplacer en douceur entre deux positions, plutôt que de changer brusquement son point de consigne. Ceci s'appelle "motion-profiling" et WPILib supporte plusieurs fonctionnalités via la classe ``TrapezoidProfile`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/TrapezoidProfile.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_trapezoid_profile.html>`__).

source: To further help teams integrate motion profiling into their command-based robot projects, WPILib includes two convenience wrappers for the ``TrapezoidProfile`` class: ``TrapezoidProfileSubsystem``, which automatically generates and executes motion profiles in its ``periodic()`` method, and the ``TrapezoidProfileCommand``, which executes a single user-provided ``TrapezoidProfile``.
fr_ca: Pour aider davantage les équipes à intégrer le profilage de mouvement dans leurs projets de robot basés sur des commandes, WPILib comprend deux wrappers pratiques pour la classe ``TrapezoidProfile``: ``TrapezoidProfileSubsystem``, qui génère et exécute automatiquement des profils de mouvement dans la méthode ``periodic()``, et ``TrapezoidProfileCommand``, qui exécute un seul ``TrapezoidProfile`` fourni par l'utilisateur.
tr_tr: WPILib, takımların komut tabanlı robot projelerine hareket profillemeyi entegre etmelerine daha fazla yardımcı olmak için, ``TrapezoidProfile`` sınıfı için iki kullanışlı sarmalayıcı içerir: ``TrapezoidProfileSubsystem``, otomatik olarak ``periodic()`` içinde hareket profilleri oluşturan ve ``TrapezoidProfileCommand``, kullanıcı tarafından sağlanan tek bir ``TrapezoidProfile`` çalıştırır.
zh_cn: 为了进一步帮助团队将运动分析集成到基于指令的机器人项目中，WPILib为“TrapezoidProfile”类提供了两个便捷包装器：“TrapezoidProfileSubsystem”，该包装器自动在其“periodic()”中生成并执行运动配置文件。方法和“TrapezoidProfileCommand”，后者执行一个用户提供的“TrapezoidProfile”。

source: In C++, the ``TrapezoidProfileSubsystem`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in values *must* have units consistent with the distance units, or a compile-time error will be thrown. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
fr_ca: En C ++, la classe ``TrapezoidProfileSubsystem`` est basée sur le type d'unité utilisé pour les mesures de distance, qui peut être angulaire ou linéaire. Les valeurs transmises *doivent* avoir des unités cohérentes avec les unités de distance, sinon une erreur de compilation sera indiquée. Pour plus d'informations sur les unités C ++, voir :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
tr_tr: C ++ 'da, ``TrapezoidProfileSubsystem`` sınıfı, açısal veya doğrusal olabilen mesafe ölçümleri için kullanılan birim türüne göre şablonlanır. İletilen değerler *zorunlu* mesafe birimleriyle tutarlı birimlere sahip olmalıdır, aksi takdirde bir derleme zamanı hatası atılır. C ++ birimleri hakkında daha fazla bilgi için bakınız :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
zh_cn: 在C ++中，“TrapezoidProfileSubsystem”类在用于距离测量的单位类型（可能是角度的或线性的）上模板化。传入的值*必须*具有与距离单位一致的单位，否则将引发编译时错误。有关C ++单元的更多信息，请参阅:ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`。

source: The ``TrapezoidProfileSubsystem`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileSubsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_trapezoid_profile_subsystem.html>`__) will automatically create and execute trapezoidal motion profiles to reach the user-provided goal state. To use the ``TrapezoidProfileSubsystem`` class, users must create a subclass of it.
fr_ca: La classe ``TrapezoidProfileSubsystem`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileSubsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_trapezoid_profile_subsystem.html>`__) créera et exécutera automatiquement des profils de mouvement trapézoïdal pour atteindre l'état du système souhaité. Pour utiliser la classe ``TrapezoidProfileSubsystem``, les utilisateurs doivent en créer une sous-classe.

source: Creating a TrapezoidProfileSubsystem
fr_ca: Création d'un sous-système TrapezoidProfile
tr_tr: TrapezoidProfileSubsystem Oluşturma
zh_cn: 创建一个TrapezoidProfileSubsystem

source: When subclassing ``TrapezoidProfileSubsystem``, users must override a single abstract method to provide functionality that the class will use in its ordinary operation:
fr_ca: Lors de la sous-classification de ``TrapezoidProfileSubsystem``, les utilisateurs doivent remplacer une seule méthode abstraite pour fournir des fonctionnalités que la classe utilisera dans son fonctionnement ordinaire:
tr_tr: ``TrapezoidProfileSubsystem`` alt sınıfını oluştururken, kullanıcılar sınıfın olağan işleminde kullanacağı işlevselliği sağlamak için tek bir soyut methodu geçersiz kılmalıdır:
zh_cn: 当子类化“TrapezoidProfileSubsystem”时，用户必须重写单个抽象方法，以提供该类将在其常规操作中使用的功能：

source: The ``useState()`` method consumes the current state of the motion profile. The ``TrapezoidProfileSubsystem`` will automatically call this method from its ``periodic()`` block, and pass it the motion profile state corresponding to the subsystem's current progress through the motion profile.
fr_ca: La méthode ``useState()`` utilise l'état actuel du profil de mouvement pour les calculs. Le ``TrapezoidProfileSubsystem`` appellera automatiquement cette méthode à partir de son segment ``periodic()``, et lui passera l'état du profil de mouvement correspondant à la progression actuelle du sous-système à travers le profil de mouvement.
tr_tr: ``useState()`` metodu, hareket profilinin mevcut durumunu tüketir. ``TrapezoidProfileSubsystem``, bu yöntemi ``periodic()`` bloğundan otomatik olarak çağıracak ve alt sistemin hareket profili boyunca mevcut ilerlemesine karşılık gelen hareket profili durumunu iletecektir.
zh_cn: “useState()”方法消耗运动配置文件的当前状态。 “TrapezoidProfileSubsystem”将自动从其“periodic()”块中调用此方法，并将与子系统当前进度相对应的运动配置文件状态通过运动配置文件传递给该方法。

source: Users may do whatever they want with this state; a typical use case (as shown in the `Full TrapezoidProfileSubsystem Example`_) is to use the state to obtain a setpoint and a feedforward for an external "smart" motor controller.
fr_ca: Les utilisateurs peuvent faire ce qu'ils veulent avec cet état; un cas d'utilisation typique (comme indiqué dans `Full TrapezoidProfileSubsystem Example`_) consiste à utiliser l'état pour obtenir un point de consigne et une action directe pour un contrôleur de moteur externe "intelligent".
tr_tr: Kullanıcılar bu durumla istediklerini yapabilir; tipik bir kullanım durumu (`Full TrapezoidProfileSubsystem Example`_ 'da gösterildiği gibi), harici "akıllı" bir motor denetleyicisi için bir ayar noktası ve ileri besleme elde etmek için kullanmaktır.
zh_cn: 用户可以在这种状态下做任何想做的事情。典型的用例（如`Full TrapezoidProfileSubsystem Example`_中所示）是使用状态获取外部“智能”电动机控制器的设定值和前馈。

source: Constructor Parameters
fr_ca: Paramètres du constructeur
tr_tr: Constructor Parametreleri
zh_cn: 构造器参数

source: Users must pass in a set of ``TrapezoidProfile.Constraints`` to the ``TrapezoidProfileSubsystem`` base class through the superclass constructor call of their subclass. This serves to constrain the automatically-generated profiles to a given maximum velocity and acceleration.
fr_ca: Les utilisateurs doivent transmettre un ensemble de valeurs-contraintes, soit ``TrapezoidProfile.Constraints`` à la classe de base ``TrapezoidProfileSubsystem`` via l'appel de constructeur de superclasse de leur sous-classe. Cela permet de contraindre les profils générés automatiquement à une vitesse et une accélération maximales données.
tr_tr: Kullanıcılar, alt sınıflarının superclass yapıcı çağrısı aracılığıyla ``TrapezoidProfile.Constraints`` temel sınıfına bir ``TrapezoidProfile.Constraints`` kümesi göndermelidir. Bu, otomatik olarak oluşturulan profilleri belirli bir maksimum hız ve ivmeyle sınırlamaya yarar.
zh_cn: 用户必须通过子类的超类构造函数调用将一组“TrapezoidProfile.Constraints”传递给“TrapezoidProfileSubsystem”基类。这用于将自动生成的轮廓约束到给定的最大速度和加速度。

source: Users must also pass in an initial position for the mechanism.
fr_ca: Les utilisateurs doivent également définir et transmettre une position initiale pour le mécanisme.
tr_tr: Kullanıcılar ayrıca mekanizma için bir başlangıç pozisyonuna geçmelidir.
zh_cn: 用户还必须通过机制的初始位置。

source: Advanced users may pass in an alternate value for the loop period, if a non-standard main loop period is being used.
fr_ca: Les utilisateurs avancés peuvent transmettre une autre valeur pour la période de boucle, si la période de boucle principale est différente de la valeur standard.
tr_tr: Standart olmayan bir ana loop periyodu kullanılıyorsa, gelişmiş kullanıcılar loop periyodu için alternatif bir değer geçebilir.
zh_cn: 如果正在使用非标准的主循环周期，则高级用户可以在循环周期中输入备用值。

source: Using a TrapezoidProfileSubsystem
fr_ca: Utilisation d'un sous-système TrapezoidProfile
tr_tr: TrapezoidProfileSubsystem Kullanma
zh_cn: 使用TrapezoidProfileSubsystem

source: Once an instance of a ``TrapezoidProfileSubsystem`` subclass has been created, it can be used by commands through the following methods:
fr_ca: Une fois qu'une instance d'une sous-classe ``TrapezoidProfileSubsystem`` a été créée, elle peut être utilisée par les commandes via les méthodes suivantes:
tr_tr: Bir ``TrapezoidProfileSubsystem`` alt sınıfının bir örneği oluşturulduktan sonra, aşağıdaki yöntemler aracılığıyla komutlar tarafından kullanılabilir:
zh_cn: 一旦创建了“TrapezoidProfileSubsystem”子类的实例，命令就可以通过以下方法使用它：

source: If you wish to set the goal to a simple distance with an implicit target velocity of zero, an overload of ``setGoal()`` exists that takes a single distance value, rather than a full motion profile state.
fr_ca: Si vous souhaitez définir l'objectif à atteindre comme étant une distance fixe, avec une vitesse de zéro, il existe une version simplifiée de ``setGoal()`` qui prend une seule valeur de distance, plutôt qu'un état de profil de mouvement complet.
tr_tr: Hedefi, örtük hedef hızı sıfır olan basit bir mesafeye ayarlamak isterseniz, tam hareket profili durumu yerine tek bir mesafe değeri alan bir ``setGoal()`` aşırı yükü vardır.
zh_cn: 如果希望将目标设置为隐式目标速度为零的简单距离，则存在“setGoal()”重载，该重载采用单个距离值而不是完整的运动轮廓状态。

source: The ``setGoal()`` method can be used to set the goal state of the ``TrapezoidProfileSubsystem``. The subsystem will automatically execute a profile to the goal, passing the current state at each iteration to the provided `useState()`_ method.
fr_ca: La méthode ``setGoal()`` peut être utilisée pour définir l'état de l'objectif du ``TrapezoidProfileSubsystem``. Le sous-système exécutera automatiquement un profil vers l'objectif, en passant l'état actuel à chaque itération à la méthode `useState()`_ fournie.
tr_tr: ``setGoal()`` metodu, ``TrapezoidProfileSubsystem`` in hedef durumunu ayarlamak için kullanılabilir. Alt sistem, her yinelemede mevcut durumu sağlanan `useState()`_ metoduna geçirerek hedefe otomatik olarak bir profil yürütür.
zh_cn: “setGoal()”方法可用于设置“TrapezoidProfileSubsystem”的目标状态。子系统将自动执行针对目标的配置文件，将每次迭代时的当前状态传递给提供的`useState()`_方法。

source: Todo
fr_ca: Ce qui reste à faire
tr_tr: Yapılacaklar

source: add section on enable/disable once these are added to profilesubsystem classes.
fr_ca: ajouter une section sur les commandes enable/disable une fois celles-ci ajoutées aux classes ProfileSubsystem.
tr_tr: profilesubsystem sınıflarına eklendikten sonra etkinleştir/devre dışı bırak - enable/disable ile ilgili bölüm ekleyin.
zh_cn: 一旦将这些添加到profilesubsystem类，请添加有关启用/禁用的部分。

source: Full TrapezoidProfileSubsystem Example
fr_ca: Un exemple complet de sous-système TrapezoidProfile
tr_tr: Tam TrapezoidProfileSubsystem Örneği
zh_cn: 完整的TrapezoidProfileSubsystem示例

source: What does a ``TrapezoidProfileSubsystem`` look like when used in practice? The following examples are taking from the ArmbotOffobard example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>`__):
fr_ca: À quoi ressemble un ``TrapezoidProfileSubsystem`` lorsqu’il est utilisé dans la pratique? Les exemples suivants proviennent du projet d’exemple ArmbotOffobard (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>`__):
tr_tr: Pratikte kullanıldığında bir``TrapezoidProfileSubsystem`` neye benziyor? Aşağıdaki örnekler, ArmbotOffobard örnek projesinden alınmıştır (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>` __):
zh_cn: 在实践中使用时，“ TrapezoidProfileSubsystem”是什么样的？以下示例摘自ArmbotOffobard示例项目（`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>`__）：

source: C++ (Header)
fr_ca: C++ (Header ou en-tête)

source: Using a ``TrapezoidProfileSubsystem`` with commands can be quite simple:
fr_ca: L'utilisation d'un ``TrapezoidProfileSubsystem`` avec des commandes peut être assez simple:
tr_tr: Komutlarla bir ``TrapezoidProfileSubsystem`` kullanmak oldukça basit olabilir:
zh_cn: 通过命令使用“TrapezoidProfileSubsystem”可能非常简单：

source: In C++, the ``TrapezoidProfileCommand`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in values *must* have units consistent with the distance units, or a compile-time error will be thrown. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
fr_ca: En C ++, la classe ``TrapezoidProfileCommand`` est basée sur le type d'unité utilisé pour les mesures de distance, qui peut être angulaire ou linéaire. Les valeurs transmises *doivent* avoir des unités cohérentes avec les unités de distance, sinon une erreur de compilation sera indiquée. Pour plus d'informations sur les unités C++, voir :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
tr_tr: C ++ 'da, ``TrapezoidProfileCommand`` sınıfı, açısal veya doğrusal olabilen mesafe ölçümleri için kullanılan birim türüne göre şablonlanır. İletilen değerler *zorunlu* mesafe birimleriyle tutarlı birimlere sahip olmalıdır, aksi takdirde bir derleme zamanı hatası atılır. C ++ birimleri hakkında daha fazla bilgi için bakınız :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
zh_cn: 在C ++中，“TrapezoidProfileCommand”类在用于距离测量的单位类型（可能是角度的或线性的）上模板化。传入的值*必须*具有与距离单位一致的单位，否则将引发编译时错误。有关C ++单元的更多信息，请参阅:ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`。

source: The ``TrapezoidProfileCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_trapezoid_profile_command.html>`__) allows users to create a command that will execute a single ``TrapezoidProfile``, passing its current state at each iteration to a user-defined function.
fr_ca: La classe `` TrapezoidProfileCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_trapezoid_profile_command.html>`__) permet aux utilisateurs de créer une commande qui exécutera un seul ``TrapezoidProfile``, qui passe son état actuel à chaque itération à une fonction définie par l'utilisateur.

source: As with ``TrapezoidProfileSubsystem``, users can create a ``TrapezoidProfileCommand`` by subclassing the ``TrapezoidProfileCommand`` class. However, as with many of the other command classes in the command-based library, users may want to save code by defining a ``TrapezoidProfileCommand`` :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`.
fr_ca: Comme avec ``TrapezoidProfileSubsystem``, les utilisateurs peuvent créer un ``TrapezoidProfileCommand`` en sous-classant la classe ``TrapezoidProfileCommand``. Cependant, comme avec la plupart des autres classes de commandes de la librairie, les utilisateurs peuvent vouloir réduire la dimension du code-programme en définissant une version :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`de ``TrapezoidProfileCommand``.
tr_tr: ``TrapezoidProfileSubsystem`` ile olduğu gibi, kullanıcılar``TrapezoidProfileCommand`` sınıfını alt sınıflandırarak bir ``TrapezoidProfileCommand`` oluşturabilirler. Bununla birlikte, komut tabanlı kitaplıktaki diğer komut sınıflarının çoğunda olduğu gibi, kullanıcılar bir ``TrapezoidProfileCommand`` tanımlayarak kodu kaydetmek isteyebilir :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`.
zh_cn: 与“TrapezoidProfileSubsystem”一样，用户可以通过将“TrapezoidProfileCommand”类作为子类来创建“TrapezoidProfileCommand”。但是，与基于指令的库中的许多其他指令类一样，用户可能希望通过定义“TrapezoidProfileCommand”:ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`来保存代码。

source: Creating a TrapezoidProfileCommand
fr_ca: Création d'un TrapezoidProfileCommand
tr_tr: TrapezoidProfileCommand Oluşturma
zh_cn: 创建一个TrapezoidProfileCommand

source: A ``TrapezoidProfileCommand`` can be created two ways - by subclassing the ``TrapezoidProfileCommand`` class, or by defining the command :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. Both methods ultimately extremely similar, and ultimately the choice of which to use comes down to where the user desires that the relevant code be located.
fr_ca: Un ``TrapezoidProfileCommand`` peut être créé de deux manières - en sous-classant la classe ``TrapezoidProfileCommand``, ou en définissant la commande de façon :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. Les deux méthodes sont extrêmement similaires et, en fin de compte, le choix de l'utilisation se résume à l'endroit où l'utilisateur souhaite que le code correspondant soit situé.
tr_tr: Bir ``TrapezoidProfileCommand`` iki şekilde oluşturulabilir - ``TrapezoidProfileCommand`` sınıfını alt sınıflara ayırarak veya şu komutu tanımlayarak :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. Her iki yöntem de nihayetinde son derece benzerdir ve nihayetinde hangisinin kullanılacağının seçimi, kullanıcının ilgili kodun yerleştirilmesini istediği yer ile ilgilidir.
zh_cn: “TrapezoidProfileCommand”可以通过两种方式创建——通过子类化“TrapezoidProfileCommand”类或定义指令:ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`。两种方法最终都极为相似，最终选择使用哪种方法取决于用户希望将相关代码定位在何处。

source: In either case, a ``TrapezoidProfileCommand`` is created by passing the necessary parameters to its constructor (if defining a subclass, this can be done with a `super()` call):
fr_ca: Dans les deux cas, un ``TrapezoidProfileCommand`` est créé en passant les paramètres nécessaires à son constructeur (si vous définissez une sous-classe, cela peut être fait avec un appel `super()` ):
tr_tr: Her iki durumda da, bir ``TrapezoidProfileCommand``, constructor'a gerekli parametreler iletilerek oluşturulur (eğer bir alt sınıf tanımlıyorsa, bu bir ``super()`` çağrısıyla yapılabilir):
zh_cn: 无论哪种情况，都通过将必要的参数传递给其构造函数来创建“TrapezoidProfileCommand”（如果定义了子类，则可以通过“super()”调用来完成）：

source: profile
fr_ca: Le paramètre Profile (Profil)
tr_tr: profil

source: The ``profile`` parameter is the ``TrapezoidProfile`` object that will be executed by the command. By passing this in, users specify the start state, end state, and motion constraints of the profile that the command will use.
fr_ca: Le paramètre ``profile`` est l'objet ``TrapezoidProfile`` qui sera exécuté par la commande. En transmettant cela, les utilisateurs spécifient l'état de début, l'état de fin et les contraintes de mouvement du profil que la commande utilisera.
tr_tr: ``profile`` parametresi, komut tarafından çalıştırılacak olan ``TrapezoidProfile`` nesnesidir. Kullanıcılar bunu ileterek, komutun kullanacağı profilin başlangıç durumunu, bitiş durumunu ve hareket kısıtlamalarını belirler.
zh_cn: “profile”参数是将由指令执行的“TrapezoidProfile”对象。通过传递此参数，用户可以指定指令将使用的配置文件的开始状态，结束状态和运动约束。

source: output
fr_ca: Le paramètre Output (Sortie)
tr_tr: çıktı
