Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/profilepid-subsystems-commands.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Combining Motion Profiling and PID in Command-Based
es_mx: Combinando Motion Profiling y PID Basado en Comandos
fr_ca: Combinaison du profilage de mouvement et du PID dans les commandes
tr_tr: Komut Tabanlı Hareket Profilleme ve PID'yi Birleştirme
zh_cn: 在基于指令中将运动分析和PID结合

source: For a description of the WPILib PID control features used by these command-based wrappers, see :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
es_mx: Para obtener una descripción de las funciones de control de WPILib PID utilizadas por estos contenedores basados en comandos, consulte :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
fr_ca: Pour une description des fonctionnalités de contrôle PID WPILib utilisées par ces wrappers basés sur des commandes, voir: :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
tr_tr: Bu komut tabanlı sarmalayıcılar tarafından kullanılan WPILib PID kontrol özelliklerinin bir açıklaması için, bakınız: ref: `docs / software / advanced-controls / controller / pidcontroller: WPILib'de PID Control`.
zh_cn: 有关这些基于指令的包装程序使用的WPILib PID控制功能的描述，请参阅:ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`。

source: Unlike the earlier version of ``PIDController``, the 2020 ``ProfiledPIDController`` class runs *synchronously*, and is not handled in its own thread. Accordingly, changing its ``period`` parameter will *not* change the actual frequency at which it runs in any of these wrapper classes. Users should never modify the ``period`` parameter unless they are certain of what they are doing.
es_mx: A diferencia de la versión anterior de ``PIDController``, la clase 2020 ``ProfiledPIDController`` se ejecuta *sincrónicamente* y no se maneja en su propio hilo. En consecuencia, cambiar su parámetro de ``período`` *no* cambiará la frecuencia real a la que se ejecuta en ninguna de estas clases de envoltura. Los usuarios nunca deben modificar el parámetro ``período`` a menos que estén seguros de lo que están haciendo.
fr_ca: Contrairement à la version précédente de ``PIDController``, la version 2020 de la classe ``ProfiledPIDController`` s'exécute *de manière synchrone* et n'est pas gérée dans son propre thread. Par conséquent, la modification de son paramètre ``period`` ne changera pas la fréquence réelle à laquelle elle s'exécute dans l'une de ces classes "wrapper". Les utilisateurs ne doivent jamais modifier le paramètre ``period`` à moins d'être certains de ce qu'ils font.
tr_tr: `` PIDController `` in önceki sürümünden farklı olarak, 2020 ``ProfiledPIDController`` sınıfı *eşzamanlı olarak* çalışır ve kendi iş parçacığında ele alınmaz. Buna göre, `` period `` parametresini değiştirmek, bu sarmalayıcı sınıflarının herhangi birinde çalıştığı gerçek frekansı *değiştirmeyecektir*. Kullanıcılar ne yaptıklarından emin olmadıkları sürece `` nokta`` parametresini asla değiştirmemelidir.
zh_cn: 与早期版本的PIDController不同，2020年的“ProfiledPIDController”类*同步运行*，并且不在其自己的线程中处理。因此，更改其“ period”参数将*不会*更改在任何这些包装类中运行的实际频率。用户除非确定自己在做什么，否则切勿修改“period”参数。

source: A common FRC\ |reg| controls solution is to pair a trapezoidal motion profile for setpoint generation with a PID controller for setpoint tracking. To facilitate this, WPILib includes its own :ref:`ProfiledPIDController <docs/software/advanced-controls/controllers/profiled-pidcontroller:Combining Motion Profiling and PID Control with ProfiledPIDController>` class. To further aid teams in integrating this functionality into their robots, the command-based framework contains two convenience wrappers for the ``ProfiledPIDController`` class: ``ProfiledPIDSubsystem``, which integrates the controller into a subsystem, and ``ProfiledPIDCommand``, which integrates the controller into a command.
es_mx: Una solución común de controles FRC\ |reg| es emparejar un perfil de movimiento trapezoidal para la generación de puntos de ajuste con un controlador PID para el seguimiento de puntos de ajuste. Para facilitar esto, WPILib incluye su propia clase :ref:`ProfiledPIDController <docs/software/advanced-controls/controllers/profiled-pidcontroller:Combining Motion Profiling and PID Control with ProfiledPIDController>`. Para ayudar aún más a los equipos a integrar esta funcionalidad en sus robots, el marco basado en comandos contiene dos envoltorios de conveniencia para la clase ``ProfiledPIDController``: ``ProfiledPIDSubsystem``, que integra el controlador en un subsistema, y ``ProfiledPIDCommand``, que integra el controlador en un comando.
fr_ca: Une solution des contrôles courants en FRC\ |reg| consiste à jumeler un profil de mouvement trapézoïdal pour la génération de point de consigne avec un contrôleur PID pour le suivi des points de consigne. Pour faciliter cette opération, WPILib inclut sa propre classe :ref:`ProfiledPIDController <docs/software/advanced-controls/controllers/profiled-pidcontroller:Combining Motion Profiling and PID Control with ProfiledPIDController>` . Afin d’aider davantage les équipes à intégrer cette fonctionnalité dans leurs robots, le cadre orientée commande contient deux wrappers conviviaux pour la classe ``ProfiledPIDController`` : ``ProfiledPIDSubsystem``, qui intègre le contrôleur dans un sous-système, et ``ProfiledPIDCommand``, qui intègre le contrôleur dans une commande.
tr_tr: Ortak bir FRC \ |reg| kontrol çözümü, ayar noktası oluşturma için trapezoidal hareket profilini ayar noktası izleme için bir PID denetleyicisi ile eşleştirmektir. Bunu kolaylaştırmak için WPILib kendi: ref: `ProfiledPIDController <docs/software/advanced-controls/controllers/profiled-pidcontroller:Combining Motion Profiling and PID Control with ProfiledPIDController>` sınıfını içerir. Ekiplerin bu işlevselliği robotlarına entegre etmelerine yardımcı olmak için komut tabanlı çerçeve, ``ProfiledPIDController`` sınıfı için iki kolaylık sarmalayıcı içerir: denetleyiciyi bir alt sisteme entegre eden ``ProfiledPIDSubsystem`` ve ``ProfiledPIDCommand`` , denetleyiciyi bir komuta entegre eden.
zh_cn: 常见的FRC \ | reg |控制解决方案是将用于设定值生成的梯形运动曲线与用于设定值跟踪的PID控制器配对。为此，WPILib包含了自己的:ref:`ProfiledPIDController <docs/software/advanced-controls/controllers/profiled-pidcontroller:Combining Motion Profiling and PID Control with ProfiledPIDController>` 类。为了进一步帮助团队将该功能集成到他们的机器人中，基于指令的框架为“ProfiledPIDController”类提供了两个便捷包装：“ProfiledPIDSubsystem”将控制器集成到子系统中以及“ProfiledPIDCommand”，它将控制器集成到指令中。

source: In C++, the ``ProfiledPIDSubsystem`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in values *must* have units consistent with the distance units, or a compile-time error will be thrown. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
es_mx: En C++, la clase ``ProfiledPIDSubsystem`` se basa en el tipo de unidad utilizada para las mediciones de distancia, que puede ser angular o lineal. Los valores pasados *deben* tener unidades consistentes con las unidades de distancia, o se lanzará un error en tiempo de compilación. Para obtener más información sobre las unidades C++, consulte :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
fr_ca: En C ++, la classe ``ProfiledPIDSubsystem`` est basée sur le type d'unité utilisé pour les mesures de distance, qui peut être angulaire ou linéaire. Les valeurs transmises *doivent* avoir des unités cohérentes avec les unités de distance, sinon une erreur de compilation sera levée. Pour plus d'informations sur les unités C++, voir :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
tr_tr: C ++ 'da, ``ProfiledPIDSubsystem`` sınıfı, açısal veya doğrusal olabilen mesafe ölçümleri için kullanılan birim türüne göre şablonlanır. İletilen değerler *zorunlu* mesafe birimleriyle tutarlı birimlere sahip olmalıdır, aksi takdirde derleme zamanı hatası atılır. C ++ birimleri hakkında daha fazla bilgi için bkz.: ref:`docs / software / basic-programlama / cpp-units: The C ++ Units Library`.
zh_cn: 在C ++中，“ProfiledPIDSubsystem”类在用于距离测量的单位类型（可能是角度的或线性的）上模板化。传入的值*必须*具有与距离单位一致的单位，否则将引发编译时错误。有关C ++单元的更多信息，请参阅:ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`。

source: The ``ProfiledPIDSubsystem`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ProfiledPIDSubsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_profiled_p_i_d_subsystem.html>`__) allows users to conveniently create a subsystem with a built-in PIDController. In order to use the ``ProfiledPIDSubsystem`` class, users must create a subclass of it.
fr_ca: La classe ``ProfiledPIDSubsystem`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ProfiledPIDSubsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_profiled_p_i_d_subsystem.html>`__) permet aux utilisateurs de créer facilement un sous-système avec un contrôleur PID intégré. Pour utiliser la classe ``ProfiledPIDSubsystem``, les utilisateurs doivent d'abord créer une sous-classe de celle-ci.

source: Creating a ProfiledPIDSubsystem
es_mx: Creación de un subsistema ProfiledPIDS
fr_ca: Création d'un sous-système ProfiledPIDS
tr_tr: ProfiledPIDSubsystem oluşturma
zh_cn: 创建一个ProfiledPIDSubsystem

source: When subclassing ``ProfiledPIDSubsystem``, users must override two abstract methods to provide functionality that the class will use in its ordinary operation:
es_mx: Al subclasificar ``ProfiledPIDSubsystem``, los usuarios deben anular dos métodos abstractos para proporcionar la funcionalidad que la clase utilizará en su operación ordinaria:
fr_ca: Dans la sous-classe ``ProfiledPIDSubsystem``, les utilisateurs doivent remplacer deux méthodes abstraites pour fournir des fonctionnalités que la classe utilisera dans son fonctionnement normal:
tr_tr: ``ProfiledPIDSubsystem`` alt sınıfını oluştururken, kullanıcılar sınıfın normal işleminde kullanacağı işlevselliği sağlamak için iki soyut yöntemi geçersiz kılmalıdır:
zh_cn: 子类化"ProfiledPIDSubsystem"时，用户必须重写两个抽象方法以提供该类将在其常规操作中使用的功能：

source: The ``getMeasurement`` method returns the current measurement of the process variable. The ``PIDSubsystem`` will automatically call this method from its ``periodic()`` block, and pass its value to the control loop.
es_mx: El método ``getMeasurement`` devuelve la medición actual de la variable de proceso. El ``PIDSubsystem`` llamará automáticamente a este método desde su bloque ``periodic()`` y pasará su valor al bucle de control.
fr_ca: La méthode ``getMeasurement()`` renvoie la mesure actuelle de la variable du processus en cours. ``PIDSubsystem`` appellera automatiquement cette méthode depuis son bloc ``periodic()``, et passera sa valeur à la boucle de contrôle.
tr_tr: ``getMeasurement`` yöntemi, süreç değişkeninin mevcut ölçümünü döndürür. `` PIDSubsystem`` bu yöntemi ``periodic()`` bloğundan otomatik olarak çağıracak ve değerini kontrol döngüsüne aktaracaktır.
zh_cn: “getMeasurement”方法返回过程变量的当前测量值。 “PIDSubsystem”将自动从其“periodic()”块中调用此方法，并将其值传递给控制循环。

source: Users should override this method to return whatever sensor reading they wish to use as their process variable measurement.
es_mx: Los usuarios deben anular este método para devolver cualquier lectura del sensor que deseen utilizar como medida de la variable de proceso.
fr_ca: Les utilisateurs doivent remplacer cette méthode pour renvoyer la lecture du capteur qu'ils souhaitent utiliser comme mesure de variable de processus.
tr_tr: Kullanıcılar, proses değişken ölçümü olarak kullanmak istedikleri sensör okumasını döndürmek için bu yöntemi geçersiz kılmalıdır.
zh_cn: 用户应重写此方法，以返回他们希望用作过程变量测量的任何传感器读数。

source: The ``useOutput()`` method consumes the output of the PID controller, and the current setpoint state (which is often useful for computing a feedforward). The ``PIDSubsystem`` will automatically call this method from its ``periodic()`` block, and pass it the computed output of the control loop.
es_mx: El método ``useOutput()`` consume la salida del controlador PID y el estado del punto de ajuste actual (que a menudo es útil para calcular un feedforward). El ``PIDSubsystem`` llamará automáticamente a este método desde su bloque ``periodic()`` y le pasará la salida calculada del bucle de control.
fr_ca: La méthode ``useOutput()`` utilise la sortie du contrôleur PID et l'état actuel du point de consigne (ce qui est souvent utile pour calculer un feedforward). Le ``PIDSubsystem`` appellera automatiquement cette méthode depuis son bloc ``periodic()``, et lui passera la sortie calculée de la boucle de contrôle.
tr_tr: ``useOutput ()`` yöntemi, PID denetleyicisinin çıkışını ve mevcut ayar noktası durumunu (bu genellikle bir ileri beslemeyi hesaplamak için yararlıdır) kullanır. ``PIDSubsystem`` , bu yöntemi ``periodic()`` bloğundan otomatik olarak çağıracak ve ona kontrol döngüsünün hesaplanmış çıktısını iletecektir.
zh_cn: “useOutput()”方法消耗PID控制器的输出和当前设定值状态（这通常对于计算前馈很有用）。 “PIDSubsystem”将自动从其“periodic()”块中调用此方法，并将控制环的计算输出传递给该方法。

source: Users should override this method to pass the final computed control output to their subsystem's motors.
es_mx: Los usuarios deben anular este método para pasar la salida de control calculada final a los motores de su subsistema.
fr_ca: Les utilisateurs doivent remplacer cette méthode pour transmettre la sortie de contrôle calculée finale aux moteurs de leur sous-système.
tr_tr: Kullanıcılar, son hesaplanmış kontrol çıkışını alt sistemlerinin motorlarına geçirmek için bu yöntemi geçersiz kılmalıdır.
zh_cn: 用户应重写此方法，以将最终计算出的控制输出传递给其子系统的电机。

source: Passing In the Controller
es_mx: Pasando el controlador
fr_ca: Passer le contrôleur
tr_tr: Kontrol Cihazına Geçiş
zh_cn: 传递至控制器

source: Users must also pass in a ``ProfiledPIDController`` to the ``ProfiledPIDSubsystem`` base class through the superclass constructor call of their subclass. This serves to specify the PID gains, the motion profile constraints, and the period (if the user is using a non-standard main robot loop period).
es_mx: Los usuarios también deben pasar un ``ProfiledPIDController`` a la clase base ``ProfiledPIDSubsystem`` a través de la llamada al constructor de superclase de su subclase. Esto sirve para especificar las ganancias de PID, las restricciones del perfil de movimiento y el período (si el usuario está utilizando un período de bucle de robot principal no estándar).
fr_ca: Les utilisateurs doivent également transmettre un ``ProfiledPIDController`` à la classe de base ``ProfiledPIDSubsystem`` via l'appel du constructeur de superclasse de leur sous-classe. Cela permet de spécifier les gains PID, les contraintes du profil de mouvement et la période (si l'utilisateur utilise une période de boucle de robot principal non standard).
tr_tr: Kullanıcılar ayrıca, alt sınıflarının süper sınıf yapıcı çağrısı aracılığıyla ``ProfiledPIDSubsystem`` temel sınıfa bir ``ProfiledPIDController`` geçirmelidir. Bu, PID kazanımlarını, hareket profili kısıtlamalarını ve periyodu (kullanıcı standart olmayan bir ana robot döngüsü periyodu kullanıyorsa) belirlemeye yarar.
zh_cn: 用户还必须通过子类的超类构造函数调用将“ProfiledPIDController”传递给“ProfiledPIDSubsystem”基类。这用于指定PID增益，运动曲线约束和周期（如果用户使用的是非标准主机器人循环周期）。

source: Additional modifications (e.g. enabling continuous input) can be made to the controller in the constructor body by calling ``getController()``.
es_mx: Se pueden realizar modificaciones adicionales (por ejemplo, habilitar la entrada continua) al controlador en el cuerpo del constructor llamando a ``getController()``.
fr_ca: Des modifications supplémentaires (par exemple l'activation d'une entrée continue) peuvent être apportées au contrôleur dans le corps du constructeur en appelant ``getController()``.
tr_tr: ``getController()`` çağrısı yapılarak, yapıcı gövdesindeki denetleyicide ek değişiklikler (e.g. enabling continuous input- ör. sürekli girişi etkinleştirmek) yapılabilir.
zh_cn: 可以通过调用“getController()”在构造函数主体中对控制器进行其他修改（例如启用连续输入）。

source: Using a ProfiledPIDSubsystem
es_mx: Uso de un subsistema ProfiledPIDS
fr_ca: Utilisation d'un sous-système ProfiledPIDS
tr_tr: ProfiledPIDSubsystem Kullanılması
zh_cn: 使用ProfiledPIDSubsystem

source: Once an instance of a ``PIDSubsystem`` subclass has been created, it can be used by commands through the following methods:
es_mx: Una vez que se ha creado una instancia de una subclase ``PIDSubsystem``, los comandos pueden usarla a través de los siguientes métodos:
fr_ca: Une fois qu'une instance d'une sous-classe ``PIDSubsystem`` a été créée, elle peut être utilisée par des commandes via les méthodes suivantes:
tr_tr: Bir ``PIDSubsystem`` alt sınıfının bir örneği oluşturulduktan sonra, aşağıdaki yöntemler aracılığıyla komutlar tarafından kullanılabilir:
zh_cn: 一旦创建了“PIDSubsystem”子类的实例，命令就可以通过以下方法使用它：

source: If you wish to set the goal to a simple distance with an implicit target velocity of zero, an overload of ``setGoal()`` exists that takes a single distance value, rather than a full motion profile state.
es_mx: Si desea establecer el objetivo en una distancia simple con una velocidad objetivo implícita de cero, existe una sobrecarga de ``setGoal()`` que toma un valor de distancia único, en lugar de un estado de perfil de movimiento completo.
fr_ca: Si vous souhaitez définir l'objectif à une distance simple avec une vitesse cible implicite de zéro, il existe une version de ``setGoal()`` qui prend une seule valeur de distance, plutôt qu'un état de profil de mouvement complet.
tr_tr: Hedefi, örtük hedef hızı sıfır olan basit bir mesafeye ayarlamak isterseniz, tam hareket profili durumu yerine tek bir mesafe değeri alan bir ``setGoal()`` aşırı yükü vardır.
zh_cn: 如果希望将目标设置为隐式目标速度为零的简单距离，则存在“setGoal()”重载，该重载采用单个距离值而不是完整的运动轮廓状态。

source: The ``setGoal()`` method can be used to set the setpoint of the ``PIDSubsystem``. The subsystem will automatically track to the setpoint using the defined output:
es_mx: El método ``setGoal()`` se puede utilizar para establecer el punto de ajuste del ``PIDSubsystem``. El subsistema rastreará automáticamente el punto de ajuste usando la salida definida:
fr_ca: La méthode ``setGoal()`` peut être utilisée pour définir le point de consigne du ``PIDSubsystem``. Le sous-système suivra automatiquement le point de consigne à l'aide de la sortie définie:
tr_tr: ``setGoal()`` yöntemi, `` PIDSubsystem`` in ayar noktasını ayarlamak için kullanılabilir. Alt sistem, tanımlanan çıktıyı kullanarak ayar noktasını otomatik olarak izleyecektir:
zh_cn: “setGoal()”方法可用于设置“PIDSubsystem”的设定值。子系统将使用定义的输出自动跟踪到设定点：

source: enable() and disable()
es_mx: enable() y disable()
fr_ca: enable() et disable()
tr_tr: etkinleştir (enable) ve devre dışı bırak (disable)
zh_cn: enable()和disable()

source: The ``enable()`` and ``disable()`` methods enable and disable the automatic control of the ``ProfiledPIDSubsystem``. When the subsystem is enabled, it will automatically run the motion profile and the control loop and track to the goal. When it is disabled, no control is performed.
es_mx: Los métodos ``enable()`` y ``disable()`` habilitan y deshabilitan el control automático del ``ProfiledPIDSubsystem``. Cuando el subsistema está habilitado, ejecutará automáticamente el perfil de movimiento y el bucle de control y seguirá hasta la meta. Cuando está deshabilitado, no se realiza ningún control.
fr_ca: Les méthodes ``enable()`` et ``disable()`` activent et désactivent le contrôle automatique du ``ProfiledPIDSubsystem``. Lorsque le sous-système est activé, il exécutera automatiquement le profil de mouvement et la boucle de contrôle et suivra jusqu'au but. Lorsqu'il est désactivé, aucun contrôle n'est effectué.
tr_tr: ``enable()`` ve ``disable()`` yöntemleri, ``ProfiledPIDSubsystem`` in otomatik kontrolünü etkinleştirir ve devre dışı bırakır. Alt sistem etkinleştirildiğinde, hareket profilini ve kontrol döngüsünü otomatik olarak çalıştıracak ve hedefe giden yolu izleyecektir. Devre dışı bırakıldığında hiçbir kontrol gerçekleştirilmez.
zh_cn: “enable()”和“disable()”方法启用和禁用“ProfiledPIDSubsystem'”的自动控制。启用子系统后，它将自动运行运动曲线和控制循环并跟踪目标。禁用时，不执行任何控制。

source: Additionally, the ``enable()`` method resets the internal ``ProfiledPIDController``, and the ``disable()`` method calls the user-defined `useOutput()`_ method with both output and setpoint set to ``0``.
es_mx: Además, el método ``enable()`` restablece el ``ProfiledPIDController`` interno, y el método``disable()`` llama al método `useOutput()`_ definido por el usuario con la salida y el punto de ajuste establecidos en ``0``.
fr_ca: De plus, la méthode ``enable()`` réinitialise le ``ProfiledPIDController`` interne, et la méthode ``disable()`` appelle la méthode définie par l'utilisateur `useOutput()`_ avec à la fois la sortie et le point de consigne définis sur ``0``.
tr_tr: Ek olarak, ``enable()`` yöntemi dahili ``ProfiledPIDController`` i sıfırlar ve ``disable()`` yöntemi hem çıktı hem de ayar noktası ``olarak ayarlanmış şekilde kullanıcı tanımlı `useOutput()`_ yöntemini ``0``a ayarlar.
zh_cn: 另外，“enable()”方法重置内部ProfileDPIDController，“disable()”方法调用用户定义的`useOutput()`_方法，将output和setpoint都设置为“0”。

source: Full ProfiledPIDSubsystem Example
es_mx: Ejemplo completo de subsistema ProfiledPIDS
fr_ca: Exemple de sous-système ProfiledPIDS complet
tr_tr: Tam ProfiledPIDSubsystem Örneği
zh_cn: 完整ProfiledPIDSubsystem示例

source: What does a PIDSubsystem look like when used in practice? The following examples are taken from the ArmBot example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBot>`__):
es_mx: ¿Qué aspecto tiene un subsistema PIDS cuando se utiliza en la práctica? Los siguientes ejemplos están tomados del proyecto de ejemplo ArmBot (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBot>`__):
fr_ca: À quoi ressemble un PIDSubsystem lorsqu’il est utilisé dans la pratique? Les exemples suivants sont pris à partir du projet d’exemple ArmBot (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBot>`__):
tr_tr: Pratikte kullanıldığında bir PIDS alt sistemi neye benzer? Aşağıdaki örnekler ArmBot örnek projesinden alınmıştır (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbot>`__, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBot>`__):
zh_cn: 在实际使用中，PIDSubsystem是什么样的？以下示例摘自ArmBot示例项目（Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbot>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBot>`__）：

source: C++ (Header)
es_mx: C++ (Encabezado)
fr_ca: C++ (Header ou en-tête)

source: Using a ``ProfiledPIDSubsystem`` with commands can be very simple:
es_mx: Usar un ``ProfiledPIDSubsystem`` con comandos puede ser muy simple:
fr_ca: L'utilisation d'un ``ProfiledPIDSubsystem`` avec des commandes peut être très simple:
tr_tr: Komutlarla bir ``ProfiledPIDSubsystem`` kullanmak çok basit olabilir:
zh_cn: 通过命令使用“ProfiledPIDSubsystem”可以非常简单：
