Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/structuring-command-based-project.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Structuring a Command-Based Robot Project
es_mx: Estructuración de un proyecto de robot basado en comandos
fr_ca: Structurer un projet de robot orienté commande
tr_tr: Komut Tabanlı Bir Robot Projesi Yapılandırma
zh_cn: 构建基于命令的机器人项目

source: While users are free to use the command-based libraries however they like (and advanced users are encouraged to do so), new users may want some guidance on how to structure a basic command-based robot project.
es_mx: Si bien los usuarios son libres de usar las bibliotecas basadas en comandos como lo deseen (y se recomienda a los usuarios avanzados que lo hagan), los nuevos usuarios pueden necesitar orientación sobre cómo estructurar un proyecto de robot básico basado en comandos.
fr_ca: Alors que les utilisateurs sont libres d'utiliser les bibliothèques orientées commande comme ils le veulent (et les utilisateurs avancés sont encouragés à le faire), les nouveaux utilisateurs pourraient avoir besoin de conseils sur la manière de structurer un projet de robot orienté commande de base.
tr_tr: Kullanıcılar komut tabanlı kütüphaneleri istedikleri gibi kullanmakta özgür olduklarında (ki ileri düzey kullanıcılar bunu yapmaya teşvik edilir),yeni kullanıcılar temel komut tabanlı bir robotun nasıl yapılandırılacağı konusunda yardım isteyebilir.
zh_cn: 用户可以随意使用自己喜欢的基于命令的库（鼓励高级用户使用），但是新用户可能需要一些有关如何构建基本的基于命令的机器人项目的指南。

source: A standard template for a command-based robot project is included in the WPILib examples repository (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/templates/commandbased>`__). This section will walk users through the structure of this template.
es_mx: En el repositorio de ejemplos de WPILib se incluye una plantilla estándar para un proyecto de robot basado en comandos (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/templates/commandbased>`__). Esta sección guiará a los usuarios a través de la estructura de esta plantilla.
fr_ca: Un modèle standard pour un projet de robot orienté commande est inclus dans le dépôt d'exemples WPILib (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/templates/commandbased>`__). Cette section guidera les utilisateurs à travers la structure de ce modèle.
tr_tr: Komut tabanlı bir robot projesi için standart bir şablon WPILib örnek havuzunda bulunur (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/templates/commandbased>` __). Bu bölüm, kullanıcılara bu şablonun yapısı boyunca yol gösterecektir.
zh_cn: WPILib示例存储库中包含基于命令的机器人项目的标准模板（Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased> __，C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/templates/commandbased> __）。本节将向用户介绍此模板的结构。

source: The root package/directory generally will contain four classes:
es_mx: El directorio / paquete raíz generalmente contendrá cuatro clases:
fr_ca: Le package/répertoire racine contient généralement quatre classes :
tr_tr: Root paket /dizin genellikle 4 sınıf içerir:
zh_cn: 根包/目录通常将包含四个类：

source: ``Main``, which is the main robot application (Java only). New users *should not* touch this class. ``Robot``, which is responsible for the main control flow of the robot code. ``RobotContainer``, which holds robot subsystems and commands, and is where most of the declarative robot setup (e.g. button bindings) is performed. ``Constants``, which holds globally-accessible constants to be used throughout the robot.
es_mx: ``Main``, que es la aplicación principal del robot (solo Java). Los nuevos usuarios * no deben * tocar esta clase. ``Robot``, que es responsable del flujo de control principal del código del robot. ``RobotContainer``, que contiene los subsistemas y comandos del robot, y es donde se realiza la mayor parte de la configuración declarativa del robot (por ejemplo, enlaces de botones). ``Constants``, que contiene constantes accesibles globalmente para su uso en todo el robot.
fr_ca: ``Main``, qui est l’application principale du robot (Java seulement). Les nouveaux utilisateurs *ne devraient pas* toucher à cette classe. ``Robot``, qui est responsable du flux de contrôle principal du code robot. ``RobotContainer``, qui contient des sous-systèmes et des commandes du robot, et c’est là que l'essentielle de la configuration déclarative du robot (par exemple la liaison des boutons avec les commandes) est effectuée. ``Constants``, qui renferme des constantes accessibles globalement, donc à utiliser dans l’ensemble du programme du robot.
tr_tr: ''Main'', robotun ana uygulamasıdır (yalnızca Java).Yeni kullanıcılar kesinlikle bu sınıfa dokunmamalıdır. ''Robot'', robotun kodunun ana kontrol akışından sorumludur. ``RobotContainer``, robot alt sistemlerini ve komutlarını tutar, ve açıklayıcı robot kurulumunun çoğunun (örneğin düğme bağlamaları) yapıldığı yerdir.``Constants``, robotun tamamında kullanılacak olan ulusal erişilebilir sabitler tutar.
zh_cn: “Main”，这是主要的机器人应用程序（仅Java）。新用户*不应*接触此类。“Robot”，负责机器人代码的主控制流程。 “RobotContainer”包含机器人子系统和命令，是执行大多数声明性机器人设置（例如按钮绑定）的地方。 “Constants”，其中包含可在整个机器人中使用的全局可访问常量。

source: The root directory will also contain two sub-packages/sub-directories: ``Subsystems`` contains all user-defined subsystem classes. ``Commands`` contains all user-defined command classes.
es_mx: El directorio raíz también contendrá dos subpaquetes / subdirectorios: ``Subsystems`` contiene todas las clases de subsistemas definidas por el usuario.``Commands`` contiene todas las clases de comandos definidas por el usuario.
fr_ca: Le répertoire racine contiendra aussi deux sous-packages/sous-répertoires : ``Subsystems`` contiendra toutes les classes sous-systèmes définies par l'utilisateur. ``Commands`` contiendra tout les classes commandes définies par l'utilisateur.
tr_tr: root dizini ayrıca iki alt-paket / alt-dizin içerir: `` Subsystems '', tüm kullanıcı tanımlı alt sistem sınıflarını içerir. `` Commands '', tüm kullanıcı tanımlı komut sınıflarını içerir.
zh_cn: 根目录还将包含两个子包/子目录：“Subsystems”包含所有用户定义的子系统类。 “Commands”包含所有用户定义的命令类。

source: As ``Robot`` (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/Robot.java>`__, `C++ (Header) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/Robot.h>`__, `C++ (Source) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/cpp/Robot.cpp>`__) is responsible for the program’s control flow, and command-based is an declarative paradigm designed to minimize the amount of attention the user has to pay to explicit program control flow, the ``Robot`` class of a command-based project should be mostly empty. However, there are a few important things that must be included
es_mx: Como ``Robot`` (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/Robot.java>`__, `C++ (Header) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/Robot.h>`__, `C++ (Source) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/cpp/Robot.cpp>`__) es responsable del flujo de control del programa, y basado en comandos es un paradigma declarativo diseñado para minimizar La cantidad de atención que el usuario debe prestar al flujo de control explícito del programa, la clase ``Robot`` de un proyecto basado en comandos debe estar prácticamente vacía. Sin embargo, hay algunas cosas importantes que deben incluirse
fr_ca: Alors que ``Robot`` (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/Robot.java>`__, `C++ (En-tête) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/Robot.h>`__, `C++ (Source) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/cpp/Robot.cpp>`__) est responsable du flux de contrôle du programme et la programmation orientée commande est un paradigme déclaratif conçu pour minimiser l'attention que l'utilisateur doit porter au flux de contrôle du programme explicite, la classe ``Robot`` d'un projet orienté commande devrait être presque vide. Cependant, il y a quelques éléments importants qui doivent être inclus.
tr_tr: ``Robot`` (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/Robot.java>`__, `C ++ (Header) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/Robot.h>` __,`C ++ (Source) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/cpp/Robot.cpp>` __) programın kontrol akışından sorumlu olduğundan ve komut tabanlı, en aza indirmek için tasarlanmış bir bildirimsel paradigmadır. kullanıcının açık program kontrol akışına göstermesi gereken dikkat miktarı, komut tabanlı bir projenin ``Robot`` sınıfı çoğunlukla boş olmalıdır. Ancak dahil edilmesi gereken birkaç önemli şey var
zh_cn: 由于``Robot''（Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/Robot.java>`__，`C ++（Header）<https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/Robot.h>`__，`C ++（Source）<https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/cpp/Robot.cpp>`__）负责程序的控制流，基于命令的声明式范例旨在最大程度地减少由于用户必须对显式程序控制流程给予足够的关注，基于命令的项目的“机器人”类应该基本上为空。但是，必须包含一些重要的内容

source: In Java, an instance of ``RobotContainer`` should be constructed during the ``robotInit()`` method - this is important, as most of the declarative robot setup will be called from the ``RobotContainer`` constructor.
es_mx: En Java, se debe construir una instancia de ``RobotContainer`` durante el método ``robotInit()`` ; esto es importante, ya que la mayor parte de la configuración declarativa del robot se llamará desde el constructor ``RobotContainer``.
fr_ca: En Java, une instance de ``RobotContainer`` devrait être construite dans la méthode ``robotInit()`` - cela est important, car l'essentiel de la configuration déclarative du robot sera appelé depuis le constructeur ``RobotContainer``.
tr_tr: Javada, ''RobotContainer''ın bir örneği ``robotInit()`` yöntemi sırasında oluşturulmalıdır.-Bu çok önemlidir, çünkü açıklayıcı robot kurulumunun çoğu `` RobotContainer '' kurucusu tarafından çağırılacaktır.
zh_cn: 在Java中，应在“ robotInit()”方法期间构造“RobotContainer”的实例——这很重要，因为大多数声明式机器人设置将从“RobotContainer”构造函数调用。

source: In C++, this is not needed as RobotContainer is a value member and will be constructed during the construction of ``Robot``.
es_mx: En C++, esto no es necesario ya que RobotContainer es un miembro de valor y se construirá durante la construcción de ``Robot``.
fr_ca: En C++, ce n'est pas nécessaire, car RobotContainer est un membre valeur et va être construit durant la construction de ``Robot``.
tr_tr: C++ da,RobotContainer bir değer üyesi olduğuiçin ve `` Robot''un yapımı sırasında yapılacağı için buna gerek yoktur.
zh_cn: 在C ++中，这是不需要的，因为RobotContainer是值成员，并且将在构建“Robot”时进行构造。

source: C++ (Source)
es_mx: C++ (Fuente)

source: The inclusion of the ``CommandScheduler.getInstance().run()`` call in the ``robotPeriodic()`` method is essential; without this call, the scheduler will not execute any scheduled commands. Since ``TimedRobot`` runs with a default main loop frequency of 50Hz, this is the frequency with which periodic command and subsystem methods will be called. It is not recommended for new users to call this method from anywhere else in their code.
es_mx: La inclusión de la llamada ``CommandScheduler.getInstance().run()`` en el método ``robotPeriodic()`` es esencial; sin esta llamada, el programador no ejecutará ningún comando programado. Dado que ``TimedRobot`` se ejecuta con una frecuencia de bucle principal predeterminada de 50 Hz, esta es la frecuencia con la que se llamarán los comandos periódicos y los métodos de subsistema. No se recomienda que los nuevos usuarios llamen a este método desde cualquier otro lugar de su código.
fr_ca: L'inclusion de l'appel ``CommandScheduler.getInstance().run()`` dans la méthode ``robotPeriodic()`` est essentielle; sans cela, le planificateur n'exécutera pas les commandes programmées. Puisque ``TimedRobot`` s'exécute à la fréquence de la boucle principale (50Hz par défaut), c'est la fréquence à laquelle les commandes périodiques et les méthodes de sous-systèmes s'exécuteront. Il n'est pas recommandé pour les utilisateurs novices d'appeler cette méthode ailleurs dans leur code.
tr_tr: `` RobotPeriodic () '' yöntemine `` CommandScheduler.getInstance (). Run () '' çağrısının dahil edilmesi önemlidir; bu çağrı olmadan, zamanlayıcı programlanmış herhangi bir komutu yürütmeyecektir. `` TimedRobot '' varsayılan ana döngü frekansı 50Hz ile çalıştığı için bu, periyodik komut ve alt sistem yöntemlerinin çağrılacağı frekanstır. Yeni kullanıcıların bu yöntemi kodlarının herhangi bir yerinden çağırmaları önerilmez.
zh_cn: “robotPeriodic()”方法中必须包含“CommandScheduler.getInstance().run()”调用；没有此调用，调度程序将不会执行任何调度的命令。由于“TimedRobot”以默认的主循环频率50Hz运行，因此这是将调用定期命令和子系统方法的频率。不建议新用户从其代码中的其他任何地方调用此方法。

source: The ``autonomousInit()`` method schedules an autonomous command returned by the ``RobotContainer`` instance. The logic for selecting which autonomous command to run can be handled inside of ``RobotContainer``.
es_mx: El método ``autonomousInit()`` programa un comando autónomo devuelto por la instancia de ``RobotContainer``. La lógica para seleccionar qué comando autónomo ejecutar se puede manejar dentro de ``RobotContainer``.
fr_ca: La méthode ``autonomousInit()`` planifie une commande autonome retournée par l'instance de ``RobotContainer``. La logique pour sélectionner quelle commande autonome sera exécutée peut être gérée à l'intérieur de ``RobotContainer``.
tr_tr: ``autonomousInit()" yöntemi, ``RobotContainer`` örneği tarafından döndürülen bir komutu zamanlar. Hangi otonom komutun çalıştırılacağını seçme mantığı, `` RobotContainer '' içinde kullanılabilir.
zh_cn: “autonomousInit()”方法调度由“RobotContainer”实例返回的自治命令。选择要运行的自治命令的逻辑可以在“RobotContainer”内部处理。

source: The ``teleopInit()`` method cancels any still-running autonomous commands. This is generally good practice.
es_mx: El método ``teleopInit()`` cancela cualquier comando autónomo que aún se esté ejecutando. En general, esta es una buena práctica.
fr_ca: La méthode ``teleopInit()`` annulera toutes les commandes du mode autonome qui sont en train d'être exécutées. C'est généralement une bonne pratique.
tr_tr: `teleopInit()`` yöntemi her çalışan otonom komutu reddeder.Bu genellikle iyi bir uygulamadır.
zh_cn: “teleopInit()”方法取消所有仍在运行的自治命令。这通常是好的做法。

source: Advanced users are free to add additional code to the various init and periodic methods as they see fit; however, it should be noted that including large amounts of imperative robot code in ``Robot.java`` is contrary to the declarative design philosophy of the command-based paradigm, and can result in confusingly-structured/disorganized code.
es_mx: Los usuarios avanzados tienen la libertad de agregar código adicional a los diversos métodos de inicio y periódicos como mejor les parezca; sin embargo, debe tenerse en cuenta que incluir grandes cantidades de código de robot imperativo en ``Robot.java`` es contrario a la filosofía de diseño declarativo del paradigma basado en comandos y puede resultar en un código desorganizado o estructurado de manera confusa.
fr_ca: Les utilisateurs avancés peuvent ajouter du code additionnel aux méthodes ``init`` et ``periodic`` comme ils l'entendent; cependant, il faut noter que le fait d'inclure de grandes quantités de code robot impératif dans ``Robot.java`` va à l'encontre de la philosophie de conception déclarative du paradigme orienté commande, et peut entraîner un code structuré de manière confuse/désorganisée.
tr_tr: İleri düzey kullanıcılar, uygun gördükleri şekilde çeşitli başlangıç ve periyodik yöntemlere ek kod eklemekte özgürdürler; fakat, `` Robot.java '' ya büyük miktarlarda zorunlu robot kodu dahil etmenin, komut tabanlı paradigmanın açıklayıcı tasarım felsefesine aykırı olduğunu ve kafa karıştırıcı bir şekilde yapılandırılmış / düzensiz kodla sonuçlanabileceği unutulmamalıdır.
zh_cn: 高级用户可以随意在自己认为合适的各种初始化和定期方法中添加其他代码；但是，应该注意的是，在“Robot.java”中包含大量命令式机器人代码与基于命令的范例的声明式设计哲学相反，并且可能导致结构混乱/结构混乱的代码。

source: This class (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/RobotContainer.java>`__, `C++ (Header) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/RobotContainer.h>`__, `C++ (Source) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/cpp/RobotContainer.cpp>`__) is where most of the setup for your command-based robot will take place. In this class, you will define your robot’s subsystems and commands, bind those commands to triggering events (such as buttons), and specify which command you will run in your autonomous routine. There are a few aspects of this class new users may want explanations for:
es_mx: Esta clase (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/RobotContainer.java>` __, `C ++ (Encabezado) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/RobotContainer.h>` __, `C ++ (Fuente) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/cpp/RobotContainer.cpp>` __) es donde se llevará a cabo la mayor parte de la configuración de su robot basado en comandos. En esta clase, definirá los subsistemas y comandos de su robot, vinculará esos comandos a eventos de activación (como botones) y especificará qué comando ejecutará en su rutina autónoma. Hay algunos aspectos de esta clase para los que los nuevos usuarios pueden querer explicaciones:
fr_ca: Cette classe (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/RobotContainer.java>`__, `C++ (En-tête) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/RobotContainer.h>`__, `C++ (Source) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/cpp/RobotContainer.cpp>`__) est où la plupart de la configuration d'un robot orienté commande sera effectuée. Dans cette classe, on définit les sous-systèmes et commandes du robot, lie ces commandes aux événements déclencheurs (tels que les boutons), et spécifie quelle commande sera exécutée dans la routine autonome. Il y a quelques aspects de cette classe pour lesquels de nouveaux utilisateurs pourraient avoir besoin d'explications:
tr_tr: Bu sınıf (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/RobotContainer.java>` __, `C ++ (Header) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/RobotContainer.h>` __, `C ++ (Kaynak) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/cpp/RobotContainer.cpp>` __), komut tabanlı robotunuz için kurulumun çoğunun gerçekleşeceği yerdir. Bu sınıfta, robotunuzun alt sistemlerini ve komutlarını tanımlayacak, bu komutları tetikleyici olaylara (butonlar gibi) bağlayacak ve otonom rutininizde hangi komutu çalıştıracağınızı belirleyeceksiniz. Bu sınıfın yeni kullanıcıların aşağıdakiler için açıklama isteyebilecekleri birkaç yönü vardır:
zh_cn: 此类（`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/RobotContainer.java>`__，`C ++（Header）<https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/RobotContainer.h>`__，`C ++（Source）<https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/cpp/RobotContainer.cpp>`__）是大多数基于命令的机器人的设置地方。在此类中，您将定义机器人的子系统和命令，将这些命令绑定到触发事件（例如按钮），并指定将在自治例程中运行的命令。新手可能需要对此类进行解释：

source: C++ (Header)
es_mx: C++ (Encabezado)
fr_ca: C++ (Header ou en-tête)
