Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/structuring-command-based-project.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Notice that subsystems are declared as private fields in ``RobotContainer``. This is in stark contrast to the previous incarnation of the command-based framework, but is much more-aligned with agreed-upon object-oriented best-practices. If subsystems are declared as global variables, it allows the user to access them from anywhere in the code. While this can make certain things easier (for example, there would be no need to pass subsystems to commands in order for those commands to access them), it makes the control flow of the program much harder to keep track of as it is not immediately obvious which parts of the code can change or be changed by which other parts of the code. This also circumvents the ability of the resource-management system to do its job, as ease-of-access makes it easy for users to accidentally make conflicting calls to subsystem methods outside of the resource-managed commands.
es_mx: Tenga en cuenta que los subsistemas se declaran como campos privados en ``RobotContainer``. Esto está en marcado contraste con la encarnación anterior del marco basado en comandos, pero está mucho más alineado con las mejores prácticas orientadas a objetos acordadas. Si los subsistemas se declaran como variables globales, permite al usuario acceder a ellos desde cualquier parte del código. Si bien esto puede facilitar ciertas cosas (por ejemplo, no habría necesidad de pasar subsistemas a comandos para que esos comandos accedan a ellos), hace que el flujo de control del programa sea mucho más difícil de rastrear, ya que no es inmediato. obvio qué partes del código pueden cambiar o cambiarse por qué otras partes del código. Esto también evita la capacidad del sistema de administración de recursos para hacer su trabajo, ya que la facilidad de acceso facilita que los usuarios realicen accidentalmente llamadas conflictivas a métodos del subsistema fuera de los comandos administrados por recursos.
fr_ca: Notez que les sous-systèmes sont déclarés comme des champs privés dans ``RobotContainer``. Ceci est en contraste notable avec l'incarnation précédente du cadre orienté commande, mais est beaucoup plus aligné sur les meilleures pratiques orientées objet convenues. Si les sous-systèmes sont déclarés comme des variables globales, cela permet à l'utilisateur d'y accéder n'importe où dans le code. Alors que cela peut faciliter certaines choses (par exemple, il n'y aurait pas besoin de passer les sous-systèmes aux commandes pour que ces commandes puissent y avoir accès), cela rend aussi le flux de contrôle du programme beaucoup plus difficile à suivre, car on ne peut pas voir immédiatement quelles parties du code pourraient changer ou pourraient être changées par d'autres parties du code. Cela peut également empêcher le système de gestion de ressources de faire son travail, car la facilité d'accès rend facile pour un utilisateur de faire un appel à une méthode de sous-systèmes hors des commandes gérées par les ressources.
tr_tr: Dikkat et Alt-sistemler gizli olarak ``RobotContainer`` içine atanmıştır. Bu, komuta dayalı yapının önceki enkarnasyonuyla büyük bir zıtlık içindedir, ancak üzerinde mutabık kalınan nesne odaklı uygulamalarla çok daha uyumludur. Eğer alt sistemler ulusal değişkenler olarak atanırsa, kullanıcılara kodun istedikleri yerinden bunlara ulaşmalarına izin verir. Bu, bazı şeyleri kolaylaştırabilirken (örneğin, bu komutlara erişmeleri için alt sistemleri komutlara geçirmeye gerek kalmaz), programın kontrol akışını olmadığı için takip etmeyi çok daha zor hale getirir. Kodun hangi bölümlerinin, kodun diğer bölümleri tarafından değiştirilebileceği veya değiştirildiği hemen anlaşılır. Erişim kolaylığı, kullanıcıların kaynak tarafından yönetilen komutların dışında yanlışlıkla alt sistem yöntemlerine çakışan çağrılar yapmasını kolaylaştırdığından, bu aynı zamanda kaynak yönetimi sisteminin işini yapmasına da engel olur.
zh_cn: 请注意，子系统在“RobotContainer”中被声明为私有字段。这与基于命令的框架的前身形成了鲜明的对比，但与商定的面向对象的最佳实践更加一致。如果子系统被声明为全局变量，则它允许用户从代码中的任何位置访问它们。虽然这可以使某些事情变得容易（例如，无需将子系统传递给命令以使这些命令可以访问它们），但由于不立即执行，因此使得程序的控制流更难以跟踪很明显，代码的哪些部分可以更改或可以被代码的其他哪些部分更改。这也妨碍了资源管理系统执行其工作的能力，因为易于访问使用户更容易意外地在资源管理命令之外意外调用子系统方法。

source: Since subsystems are declared as private members, they must be explicitly passed to commands (a pattern called "dependency injection") in order for those commands to call methods on them. This is done here with ``ExampleCommand``, which is passed a pointer to an ``ExampleSubsystem``.
es_mx: Dado que los subsistemas se declaran como miembros privados, deben pasarse explícitamente a los comandos (un patrón llamado "inyección de dependencia") para que esos comandos llamen a sus métodos. Esto se hace aquí con ``ExampleCommand``, que se pasa un puntero a un ``ExampleSubsystem``.
fr_ca: Puisque les sous-systèmes sont déclarés comme des membres privés, ils doivent être passés explicitement aux commandes (un modèle nommé "dependency injection") pour que les commandes puissent appeler leurs méthodes. Cela est fait ici avec ``ExampleCommand``, qui se fait passer un pointeur vers un ``ExampleSubsystem``.
tr_tr: Alt-sistemler gizli üyeler olarak açıklandığından beri,bu komutların komutları çağırması için komutlara açıkça aktarılmaları gerekir("dependency injection" adı verilen bir kalıp). Bu, burada bir `` ExampleSubsystem '' e bir işaretçi iletilen `` ExampleCommand '' ile yapılır.
zh_cn: 由于子系统被声明为私有成员，因此必须将它们显式传递给命令（一种称为“依赖注入”的模式），以便这些命令在其上调用方法。这是通过“ExampleCommand”完成的，该示例传递了指向“ExampleSubsystem”的指针。

source: As mentioned before, the ``RobotContainer()`` constructor is where most of the declarative setup for the robot should take place, including button bindings, configuring autonomous selectors, etc. If the constructor gets too "busy," users are encouraged to migrate code into separate subroutines (such as the ``configureButtonBindings()`` method included by default) which are called from the constructor.
es_mx: Como se mencionó anteriormente, el constructor ``RobotContainer()`` es donde la mayor parte de la configuración declarativa para el robot debe tener lugar, incluyendo los enlaces de los botones, la configuración de los selectores autónomos, etc. Si el constructor está demasiado "ocupado", se anima a los usuarios a migrar el código a subrutinas separadas (como el método ``configureButtonBindings()`` incluido por defecto) que se llaman desde el constructor.
fr_ca: Comme indiqué précédemment, le constructeur ``RobotContainer()`` est le lieu où l'essentiel de la configuration déclarative pour le robot devrait prendre place, incluant la liaison des boutons, la configuration des sélectionneurs autonome, etc. Si le constructeur devient trop "occupé", les utilisateurs sont encouragés à déplacer du code dans des sous-routines séparées (comme la méthode ``configureButtonBindings()`` incluse par défaut) qui sont appelées par le constructeur.
zh_cn: 如前所述，应在“ RobotContainer（）”构造函数中进行机器人的大多数声明性设置，包括按钮绑定，配置自主选择器等。如果构造函数太“忙”，则鼓励用户将代码迁移到单独的子例程（例如默认包含的configureButtonBindings（）方法）中，这些子例程从构造函数中调用。

source: Finally, the ``getAutonomousCommand()`` method provides a convenient way for users to send their selected autonomous command to the main ``Robot`` class (which needs access to it to schedule it when autonomous starts).
es_mx: Finalmente, el método ``getAutonomousCommand()`` proporciona una forma conveniente para que los usuarios envíen su comando autónomo seleccionado a la clase principal de ``Robot`` (que necesita acceso a él para programarlo cuando se inicie autónomo).
fr_ca: Finalement, la méthode ``getAutonomousCommand()`` fournit un moyen pratique à l'utilisateur pour envoyer sa commande autonome sélectionnée à la classe ``Robot`` principale (qui a besoin d'y accèder pour la planifier au début de la période autonome).
tr_tr: Son olarak, `` getAutonomousCommand() '' yöntemi, kullanıcıların seçtikleri otonom komutlarını ana ``Robot`` sınıfına göndermeleri için uygun bir yol sağlar (otonom başladığında onu programlamak için ona erişim gerekir).
zh_cn: 最后，“getAutonomousCommand()”方法为用户提供了一种方便的方法，可以将所选的自主命令发送到主要的Robot类（需要在启动自主类时对其进行调度）。

source: The ``Constants`` class (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/Constants.java>`__, `C++ (Header) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/Constants.h>`__) (in C++ this is not a class, but simply a header file in which several namespaces are defined) is where globally-accessible robot constants (such as speeds, unit conversion factors, PID gains, and sensor/motor ports) can be stored. It is recommended that users separate these constants into individual inner classes corresponding to subsystems or robot modes, to keep variable names shorter.
es_mx: La clase ``Constants`` (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/Constants.java>`__, `C++ (Header) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/Constants.h>`__) (en C++ no es una clase, sino simplemente un archivo de cabecera en el que se definen varios espacios de nombres) es donde pueden almacenarse las constantes del robot de acceso global (como las velocidades, los factores de conversión de unidades, las ganancias PID y los puertos de sensores/motores). Se recomienda que los usuarios separen estas constantes en clases internas individuales correspondientes a los subsistemas o modos del robot, para mantener los nombres de las variables más cortos.
fr_ca: La classe ``Constants`` (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/Constants.java>`__, `C++ (En-tête) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/Constants.h>`__) (en C++, ce n'est pas une classe, mais simplement un fichier en-tête dans lequel plusieurs espaces de noms sont définis) est où les constantes du robot accessibles globalement (comme les vitesses, les facteurs de conversion d'unités, les gains PID, les ports de capteurs/moteurs, etc.) peuvent être stockées. Il est recommandé que les utilisateurs séparent ces constantes en classes internes individuelles qui correspondent aux sous-systèmes ou aux modes du robot pour garder le nom des variables le plus court possible.
tr_tr: ``Constants`` sınıfı (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/Constants.java>` __, `C ++ (Header) <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/Constants.h>` __) (C ++ 'da bu bir sınıf değil, yalnızca birkaç ad alanının tanımlandığı bir başlık dosyasıdır) küresel olarak erişilebilir robot sabitler (hızlar, birim dönüştürme faktörleri, PID kazançları ve sensör / motor portları gibi) saklanabilir. Değişken adlarını daha kısa tutmak için, kullanıcıların bu sabitleri alt sistemlere veya robot modlarına karşılık gelen bireysel iç sınıflara ayırmaları önerilir.
zh_cn: ``Constants''类（`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/Constants.java>`__，`C ++（Header）<https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/Constants.h>`__）（在C ++中这不是一个类，而是一个定义了多个名称空间的头文件）是可全局访问的机器人的位置可以存储常数（例如速度，单位转换系数，PID增益和传感器/电动机端口）。建议用户将这些常量分成与子系统或机械手模式相对应的各个内部类，以使变量名更短。

source: In Java, all constants should be declared ``public static final`` so that they are globally accessible and cannot be changed. In C++, all constants should be ``constexpr``.
es_mx: En Java, todas las constantes deben declararse como ``public static final`` para que sean accesibles globalmente y no se puedan cambiar. En C++, todas las constantes deben ser ``constexpr``.
fr_ca: En Java, toutes les constantes devraient être déclarées ``public static final`` pour qu'elles soient accessibles globalement et ne puissent pas être changées. En C++, toutes les constantes devraient être ``constexpr``.
tr_tr: Javada, tüm sabitler ``public static final`` olarak açıklanmalıdır ki ulusal olarak erişilebilsin ve değiştirilemesin. C++ 'da tüm sabitler ``constexpr`` olmalıdır.
zh_cn: 在Java中，所有常量都应声明为“public static final”，以便它们可以全局访问且不能更改。在C ++中，所有常量都应为“constexpr”。

source: For more illustrative examples of what a ``constants`` class should look like in practice, see those of the various command-based example projects:
es_mx: Para obtener más ejemplos ilustrativos de cómo debería verse una clase de ``constants`` en la práctica, consulte los de varios proyectos de ejemplo basados en comandos:
fr_ca: Pour des exemples plus illustratifs de ce à quoi devrait ressembler une classe ``Constants`` en pratique, voir les classes des projets exemples orientés commande :
tr_tr: Bir `` constants '' sınıfının pratikte nasıl görünmesi gerektiğine dair daha fazla açıklayıcı örnekler için, çeşitli komut tabanlı örnek projelerin örneklerine bakın:
zh_cn: 有关实践中“constants”类的外观的更多说明性示例，请参见各种基于命令的示例项目的示例：

source: GyroDriveCommands (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands/Constants.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands/include/Constants.h>`__)
es_mx: Comandos de accionamiento del giroscopio (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands/Constants.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands/include/Constants.h>`__)

source: In Java, it is recommended that the constants be used from other classes by statically importing the necessary inner class. An ``import static`` statement imports the static namespace of a class into the class in which you are working, so that any ``static`` constants can be referenced directly as if they had been defined in that class. In C++, the same effect can be attained with ``using namespace``:
es_mx: En Java, se recomienda que las constantes se utilicen de otras clases importando estáticamente la clase interna necesaria. Una declaración de ``import static`` importa el espacio de nombres estático de una clase en la clase en la que está trabajando, de modo que cualquier constante ``static`` pueda ser referenciada directamente como si se hubiera definido en esa clase. En C++, el mismo efecto se puede lograr con ``using namespace``:
fr_ca: En java, il est recommandé que les constantes soient utilisées à partir d'autres classes par l'importation statique de la classe intérieure nécessaire. Une déclaration ``import static`` importe l'espace de nom statique d'une classe dans la classe dans laquelle vous travaillez pour que les constantes ``static`` puissent être référencées directement comme si elles étaient définies dans cette classe. En C++, la même chose peut être faite avec ``using namespace``:
tr_tr: Javada, sabitlerin diğer sınıflardan gerekli iç- sınıfı içe aktararak kullanılması önerilir. Bir ``import static`` ifadesi bir sınıfın statik ad alanını içinde çalıştığınız sınıfa aktarır, yani her ``static`` sabiti eğer sınıfın içinde tanımlıysa direkt başvurulanabilir. C++ 'da, aynı etki ``using namespace``: kullanılınarak elde edilebilir.
zh_cn: 在Java中，建议通过静态导入必要的内部类从其他类中使用常量。“import static”语句将类的静态名称空间导入到您正在工作的类中，以便可以直接引用任何“static”常量，就好像它们是在该类中定义的一样。在C ++中，使用``使用命名空间''可以达到相同的效果：

source: Subsystems
es_mx: Subsistemas
tr_tr: Alt Sistemler

source: User-defined subsystems should go in this package/directory.
es_mx: Los subsistemas definidos por el usuario deben ir en este paquete / directorio.
fr_ca: Les sous-systèmes définis par l'utilisateur devraient entrer dans ce package/répertoire.
tr_tr: Kullanıcı tanımlı alt sistemler bu paket / dizinine girmelidir.
zh_cn: 用户定义的子系统应放在此软件包/目录中。

source: Commands
es_mx: Comandos
tr_tr: Komutlar

source: User-defined commands should go in this package/directory.
es_mx: Los comandos definidos por el usuario deben ir en este paquete / directorio.
fr_ca: Les commandes définies par l’utilisateur devraient entrer dans cet package/répertoire.
tr_tr: Kullanıcı tanımlı komutlar bu paket / dizinine girmelidir.
zh_cn: 用户定义的命令应放在此软件包/目录中。

source: Constants
tr_tr: Sabitler
