Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/subsystems.po
Languages: es_mx, fr_ca, zh_cn

source: Subsystems
es_mx: Subsistemas
fr_ca: Les sous-systèmes
zh_cn: 子系统

source: Subsystems are the basic unit of robot organization in the command-based paradigm. A subsystem is an abstraction for a collection of robot hardware that *operates together as a unit*. Subsystems `encapsulate <https://en.wikipedia.org/wiki/Encapsulation_(computer_programming)>`__ this hardware, "hiding" it from the rest of the robot code (e.g. commands) and restricting access to it except through the subsystem’s public methods. Restricting the access in this way provides a single convenient place for code that might otherwise be duplicated in multiple places (such as scaling motor outputs or checking limit switches) if the subsystem internals were exposed. It also allows changes to the specific details of how the subsystem works (the "implementation") to be isolated from the rest of robot code, making it far easier to make substantial changes if/when the design constraints change.
es_mx: Los subsistemas son la unidad básica de organización de los robots en el paradigma basado en comandos. Un subsistema es una abstracción de un conjunto de hardware del robot que *funciona como una unidad*. Los subsistemas `encapsulan <https://en.wikipedia.org/wiki/Encapsulation_(computer_programming)>`__ este hardware, "escondiéndolo" del resto del código del robot (por ejemplo, los comandos) y restringiendo el acceso a él excepto a través de los métodos públicos del subsistema. Restringir el acceso de esta manera proporciona un único lugar conveniente para el código que de otro modo podría estar duplicado en varios lugares (como el escalado de las salidas del motor o la comprobación de los interruptores de límite) si los internos del subsistema estuvieran expuestos. También permite que los cambios en los detalles específicos de cómo funciona el subsistema (la "implementación") se aíslen del resto del código del robot, lo que facilita enormemente la realización de cambios sustanciales si/cuando cambian las restricciones de diseño.
fr_ca: Les sous-systèmes sont l'unité de base de l'organisation d'un robot dans le paradigme orienté commande. Un sous-système est une abstraction pour un ensemble de composants matériels du robot qui *fonctionnent ensemble comme une unité*. Les sous-systèmes `encapsulent <https://fr.wikipedia.org/wiki/Encapsulation_(programmation)>`__ ces composants : ils les "cachent" du reste du code du robot (par exemple, les commandes) et limitent l'accès à ceux-ci, sauf par l'intermédiaire des méthodes publiques du sous-système. Restreindre ainsi l'accès permet d'avoir un seul endroit pratique où écrire certains bouts de code (comme la mise à l'échelle des valeurs de sortie des moteurs ou la vérification des interrupteurs de fin de course) qui pourraient autrement être dupliqués à plusieurs endroits si les éléments internes du sous-système étaient accessibles. Cela permet aussi d'isoler du reste du programme les modifications qui peuvent être apportées aux détails spécifiques du fonctionnement du sous-système ("l'implémentation"). Cela facilite grandement les modifications substantielles si (ou plutôt quand) les contraintes de conception changent.
zh_cn: 子系统是基于命令的范例中机器人组织的基本单元。子系统是*可以作为一个单元*一起操作的机器人硬件集合的抽象。子系统将这个硬件封装为<https://en.wikipedia.org/wiki/Encapsulation_(computer_programming)>，将其“隐藏”在机器人代码的其余部分（例如命令）中，并限制对它的访问，除非通过子系统的公共方法。如果子系统内部暴露在外，以这种方式限制访问可为代码提供一个方便的位置，否则该代码可能会在多个位置重复（例如缩放电动机输出或检查限位开关）。它还允许将子系统工作方式的特定细节（“实现”）的更改与其余的机器人代码隔离开，从而在设计约束发生更改时进行实质性更改要容易得多。

source: Subsystems also serve as the backbone of the ``CommandScheduler``\ ’s resource management system. Commands may declare resource requirements by specifying which subsystems they interact with; the scheduler will never concurrently schedule more than one command that requires a given subsystem. An attempt to schedule a command that requires a subsystem that is already-in-use will either interrupt the currently-running command (if the command has been scheduled as interruptible), or else be ignored.
es_mx: Los subsistemas también sirven como columna vertebral del sistema de gestión de recursos de ``CommandScheduler``\. Los comandos pueden declarar los requisitos de recursos especificando con qué subsistemas interactúan; el programador nunca programará simultáneamente más de un comando que requiera un subsistema determinado. Un intento de programar un comando que requiera un subsistema que ya está en uso interrumpirá el comando que se está ejecutando actualmente (si el comando se programó como interrumpible) o se ignorará.
fr_ca: Les sous-systèmes sont la base du système de gestion des ressources du ``CommandScheduler``. Les commandes peuvent déclarer les ressources dont elles ont besoin en spécifiant les sous-systèmes avec lesquels elles interagissent. Le planificateur ne démarrera jamais en même temps plus d'une commande qui nécessite le même sous-système. Tenter de planifier une commande qui nécessite un sous-système qui est déjà utilisé entraînera sont l'interruption de la commande en cours d'exécution (si la commande a été planifiée comme étant interruptible), ou la commande nouvellement planifiée sera ignorée.
zh_cn: 子系统还充当“ CommandScheduler”资源管理系统的骨干。命令可以通过指定与哪些子系统交互来声明资源需求。调度程序永远不会同时调度多个需要给定子系统的命令。尝试调度需要已在使用中的子系统的命令时，将中断当前正在运行的命令（如果该命令已被安排为可中断），否则将被忽略。

source: Subsystems can be associated with "default commands" that will be automatically scheduled when no other command is currently using the subsystem. This is useful for continuous "background" actions such as controlling the robot drive, or keeping an arm held at a setpoint. Similar functionality can be achieved in the subsystem’s ``periodic()`` method, which is run once per run of the scheduler; teams should try to be consistent within their codebase about which functionality is achieved through either of these methods. There is also a ``simulationPeriodic()`` method that is similar to ``periodic()`` except that it is only run during :doc:`Simulation </docs/software/wpilib-tools/robot-simulation/introduction>` and can be used to update the state of the robot. Subsystems are represented in the command-based library by the Subsystem interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_subsystem.html>`__).
fr_ca: Les sous-systèmes peuvent être associés à des “commandes par défaut“ qui seront automatiquement planifiées lorsqu’aucune autre commande n’utilise actuellement le sous-système. Ceci est utile pour les actions continues de “fond” telles que le contrôle de l'entraînement du robot, ou le maintien d’un bras tenu à un point de consigne. Des fonctionnalités similaires peuvent être obtenues dans la méthode ``periodic()`` du sous-système, qui est exécutée une fois par itération du planificateur; les équipes devraient essayer d’être cohérentes dans leur code de base sur les fonctionnalités obtenues grâce à l’une ou l’autre de ces méthodes. Il existe également une méthode ``simulationPeriodic()`` qui est semblable à ``periodic()``, sauf qu’elle n’est pas exécutée pendant la :doc:`Simulation </docs/software/wpilib-tools/robot-simulation/introduction>` et peut être utilisée pour mettre à jour l’état du robot. Les sous-systèmes sont représentés dans la librairie orientée commande par l’interface Subsystem (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_subsystem.html>`__).

source: Creating a Subsystem
es_mx: Creando un subsistema
fr_ca: Créer un sous-système
zh_cn: 创建子系统

source: The recommended method to create a subsystem for most users is to subclass the abstract ``SubsystemBase`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SubsystemBase.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_subsystem_base.html>`__), as seen in the command-based template (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/subsystems/ExampleSubsystem.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/subsystems/ExampleSubsystem.h>`__):
fr_ca: La méthode recommandée pour créer un sous-système pour la plupart des utilisateurs est de dériver la classe abstraite ``SubsystemBase`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SubsystemBase.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_subsystem_base.html>`__), comme on le voit dans le modèle orienté commande (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/subsystems/ExampleSubsystem.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/subsystems/ExampleSubsystem.h>`__):

source: This class contains a few convenience features on top of the basic ``Subsystem`` interface: it automatically calls the ``register()`` method in its constructor to register the subsystem with the scheduler (this is necessary for the ``periodic()`` method to be called when the scheduler runs), and also implements the ``Sendable`` interface so that it can be sent to the dashboard to display/log relevant status information.
es_mx: Esta clase contiene algunas características de conveniencia además de la interfaz básica del ``Subsistema``: llama automáticamente al método ``register()`` en su constructor para registrar el subsistema con el planificador (esto es necesario para el método ``periodic()`` que se llamará cuando se ejecute el planificador), y también implementa la interfaz ``Sendable`` para que pueda enviarse al dashboard para mostrar/registrar información de estado relevante.
fr_ca: Cette classe contient quelques fonctionnalités pratiques en complément à l'interface ``Subsystem`` de base : elle appelle automatiquement la méthode ``register()`` dans son constructeur pour enregistrer le sous-système auprès du ``CommandScheduler`` (cela est nécessaire pour que la méthode ``periodic()`` soit exécutée par le ``CommandScheduler``), et elle implémente aussi l'interface ``Sendable`` afin que le sous-système puisse être envoyé au tableau de bord (SmartDashboard et/ou Shuffleboard) et ainsi afficher les informations pertinentes sur son état.
zh_cn: 此类在基本的“Subsystem”接口之上包含一些便利功能：它会在其构造函数中自动调用"register()”方法以向调度程序注册子系统（这对于在调度程序运行时调用“periodic()”方法是必须的），并实现“Sendable”接口，以便将其发送到仪表板以显示/记录相关状态信息。

source: Advanced users seeking more flexibility may simply create a class that implements the ``Subsystem`` interface.
es_mx: Los usuarios avanzados que buscan más flexibilidad pueden simplemente crear una clase que implemente la interfaz del ``Subsistema``.
fr_ca: Les utilisateurs avancés qui veulent plus de flexibilité peuvent simplement créer une classe qui implémente l'interface ``Subsystem``.
zh_cn: 寻求更高灵活性的高级用户可以简单地创建一个实现“Subsystem”接口的类。

source: Simple Subsystem Example
es_mx: Ejemplo de un subsistema simple
fr_ca: Exemple de sous-système simple
zh_cn: 简单子系统示例

source: What might a functional subsystem look like in practice? Below is a simple pneumatically-actuated hatch mechanism from the HatchBot example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):
es_mx: ¿Cómo sería un subsistema funcional en la práctica? A continuación se muestra un mecanismo de trama simple accionado neumáticamente del proyecto de ejemplo HatchBot (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):
fr_ca: À quoi pourrait ressembler un sous-système fonctionnel en pratique? Vous trouverez ci-dessous un mécanisme d'écoutille simple à actionnement pneumatique provenant du projet d'exemple *HatchBot* (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):
zh_cn: 在实践中，功能子系统会是什么样？以下是HatchBot示例项目中的一个简单的气动孵化机制（`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__）：

source: C++ (Header)
fr_ca: C++ (Header ou en-tête)

source: Notice that the subsystem hides the presence of the DoubleSolenoid from outside code (it is declared ``private``), and instead publicly exposes two higher-level, descriptive robot actions: ``grabHatch()`` and ``releaseHatch()``. It is extremely important that "implementation details" such as the double solenoid be "hidden" in this manner; this ensures that code outside the subsystem will never cause the solenoid to be in an unexpected state. It also allows the user to change the implementation (for instance, a motor could be used instead of a pneumatic) without any of the code outside of the subsystem having to change with it.
es_mx: Fíjese en que el subsistema oculta la presencia del DoubleSolenoid al código exterior (está declarado como ``privado``), y en su lugar expone públicamente dos acciones de robot de nivel superior y descriptivo: ``grabHatch()`` y ``releaseHatch()``. Es extremadamente importante que los "detalles de implementación" como el solenoide doble se "oculten" de esta manera; esto asegura que el código fuera del subsistema nunca causará que el solenoide esté en un estado inesperado. También permite al usuario cambiar la implementación (por ejemplo, se podría utilizar un motor en lugar de un neumático) sin que el código fuera del subsistema tenga que cambiar con él.
fr_ca: Remarquez que le sous-système cache au reste du code la présence du ``DoubleSolenoid`` (il est déclaré ``private``), et expose plutôt publiquement deux actions descriptives de plus haut niveau: ``grabHatch()`` et ``releaseHatch()``. C'est extrêmement important que les "détails d'implémentation" comme le solénoïde double soient "cachés" de cette manière : cela garantit que le code hors du sous-système ne mettra jamais le solénoïde dans un état inattendu. Cela permet également à l'utilisateur de changer l'implémentation (par exemple, un moteur pourrait être utilisé au lieu d'un système pneumatique) sans qu'aucun code à l'extérieur du sous-système ne soit obligé d'être modifié avec lui.
zh_cn: 请注意，子系统从外部代码隐藏了DoubleSolenoid的存在（被声明为``private''），而是公开公开了两个更高级别的描述性机器人动作：``grabHatch（）''和``releaseHatch（）'' ``。以这种方式“隐藏”双螺线管之类的“实现细节”是极为重要的；这样可以确保子系统外部的代码永远不会导致螺线管处于意外状态。它还允许用户更改实现方式（例如，可以使用电动机代替气动方式），而子系统外部的任何代码都不必随之更改。

source: Setting Default Commands
es_mx: Configuración de comandos predeterminados
fr_ca: Configurer les commandes par défaut
zh_cn: 设置默认命令

source: In the C++ command-based library, the CommandScheduler `owns` the default command objects - accordingly, the object passed to the ``SetDefaultCommand()`` method will be either moved or copied, depending on whether it is an rvalue or an lvalue (`rvalue/lvalue explanation <http://thbecker.net/articles/rvalue_references/section_01.html>`__). The examples here ensure that move semantics are used by casting to an rvalue with ``std::move()``.
es_mx: En la biblioteca basada en comandos de C ++, CommandScheduler `tiene` los objetos de comando predeterminados; en consecuencia, el objeto pasado al método ``SetDefaultCommand()`` se moverá o copiará, dependiendo de si es un rvalue o un lvalue (` explicación de rvalue/lvalue <http://thbecker.net/articles/rvalue_references/section_01.html>`__). Los ejemplos aquí aseguran que la semántica de movimiento se use al convertir a un rvalue con ``std::move()``.
fr_ca: Dans la bibliothèque orientée commande C++, le ``CommandScheduler`` `possède` les objets des commandes par défaut - par conséquent, l'objet passé à la méthode ``SetDefaultCommand()`` sera soit déplacé s'il s'agit d'une *rvalue*, ou bien copié s'il s'agit d'une *lvalue* (`explication sur les rvalues et les lvalues <http://thbecker.net/articles/rvalue_references/section_01.html>`__). Les exemples ci-dessous garantissent que la sémantique de déplacement est utilisée par conversion en *rvalue* avec ``std::move()``.
zh_cn: 在基于C ++命令的库中，CommandScheduler“拥有”默认命令对象——因此，传递给“SetDefaultCommand()”方法的对象将被移动或复制，具体取决于它是右值还是左值（`rvalue/lvalue explanation <http://thbecker.net/articles/rvalue_references/section_01.html>`__）。这里的示例通过使用“std::move()”强制转换为右值来确保使用移动语义。

source: "Default commands" are commands that run automatically whenever a subsystem is not being used by another command.
es_mx: Los "comandos predeterminados" son comandos que se ejecutan automáticamente siempre que un subsistema no está siendo utilizado por otro comando.
fr_ca: Les « commandes par défaut » sont des commandes exécutées automatiquement lorsqu'un sous-système n'est pas utilisé par une autre commande.
zh_cn: “默认命令”是每当子系统不被另一个命令使用时自动运行的命令。

source: Setting a default command for a subsystem is very easy; one simply calls ``CommandScheduler.getInstance().setDefaultCommand()``, or, more simply, the ``setDefaultCommand()`` method of the ``Subsystem`` interface:
es_mx: Establecer un comando predeterminado para un subsistema es muy fácil; uno simplemente llama ``CommandScheduler.getInstance().setDefaultCommand()``, o, más simplemente, el método ``setDefaultCommand()`` de la interfaz ``Subsystem``:
fr_ca: Configurer la commande par défaut d'un sous-système est très facile : il faut simplement appeler la méthode ``CommandScheduler.getInstance().setDefaultCommand(Subsystem, Command)`` ou, encore plus simple, appeler la méthode ``setDefaultCommand(Command)`` de l'interface ``Subsytem`` :
zh_cn: 为子系统设置默认命令非常容易：简单地调用“CommandScheduler.getInstance().setDefaultCommand()”，或调用“Subsystem”接口的“setDefaultCommand()”方法：

source: A command that is assigned as the default command for a subsystem must require that subsystem.
fr_ca: Une commande affectée comme commande par défaut pour un sous-système doit requérir ce sous-système.

source: Subsystems can be associated with "default commands" that will be automatically scheduled when no other command is currently using the subsystem. This is useful for continuous "background" actions such as controlling the robot drive, or keeping an arm held at a setpoint. Similar functionality can be achieved in the subsystem’s ``periodic()`` method, which is run once per run of the scheduler; teams should try to be consistent within their codebase about which functionality is achieved through either of these methods. There is also a ``simulationPeriodic()`` method that is similar to ``periodic()`` except that it is only run during :doc:`Simulation </docs/software/wpilib-tools/robot-simulation/introduction>` and can be used to update the state of the robot. Subsystems are represented in the command-based library by the Subsystem interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Subsystem.html>`__).
es_mx: Los subsistemas se pueden asociar con "comandos predeterminados" que se programarán automáticamente cuando ningún otro comando esté utilizando el subsistema. Esto es útil para acciones continuas "en segundo plano", como controlar el accionamiento del robot o mantener un brazo sujeto en un punto de ajuste. Se puede lograr una funcionalidad similar en el método ``periodic()`` del subsistema, que se ejecuta una vez por ejecución del programador; los equipos deben tratar de ser coherentes dentro de su base de código sobre qué funcionalidad se logra a través de cualquiera de estos métodos. También hay un método ``simulationPeriodic()`` que es similar a ``periodic()`` excepto que solo se ejecuta durante :doc:`Simulation </docs/software/wpilib-tools/robot-simulation/introduction>` y puede usarse para actualizar el estado del robot. Los subsistemas se representan en la biblioteca basada en comandos mediante la interfaz del subsistema (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Subsystem.html>` __).

source: The recommended method to create a subsystem for most users is to subclass the abstract ``SubsystemBase`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SubsystemBase.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SubsystemBase.html>`__), as seen in the command-based template (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/subsystems/ExampleSubsystem.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/subsystems/ExampleSubsystem.h>`__):
es_mx: El método recomendado para crear un subsistema para la mayoría de los usuarios es subclasificar la clase abstracta ``SubsystemBase`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SubsystemBase.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SubsystemBase.html>`__), como se ve en el modelo basado en comandos (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/subsystems/ExampleSubsystem.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/subsystems/ExampleSubsystem.h>`__):
