Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/what-*-command-based.po
Languages: es_mx, fr_ca, zh_cn

source: The command-based paradigm is also an example of what is known as `declarative <https://en.wikipedia.org/wiki/Declarative_programming>`__ programming. In declarative programming, the emphasis is placed on *what* the program ought to do, rather than *how* the program ought to do it. Thus, the command-based libraries allow users to define desired robot behaviors while minimizing the amount of iteration-by-iteration robot logic that they must write. For example, in a command-based program, a user can specify that “the robot should perform an action when a button is pressed” (note the use of a :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`):
es_mx: El paradigma basado en comandos también es un ejemplo de lo que se conoce como programación `declarative <https://en.wikipedia.org/wiki/Declarative_programming>`__. En la programación declarativa, el énfasis se pone en *qué* debería hacer el programa, en lugar de *cómo* debería hacerlo. Por lo tanto, las bibliotecas basadas en comandos permiten a los usuarios definir los comportamientos deseados del robot mientras minimizan la cantidad de lógica de robot iteración por iteración que deben escribir. Por ejemplo, en un programa basado en comandos, un usuario puede especificar que "el robot debe realizar una acción cuando se presiona un botón" (tenga en cuenta el uso de :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`):

source: **Subsystems** are the basic unit of robot organization in the design-based paradigm. Subsystems `encapsulate <https://en.wikipedia.org/wiki/Encapsulation_(computer_programming)>`__ lower-level robot hardware (such as motor controllers, sensors, and/or pneumatic actuators), and define the interfaces through which that hardware can be accessed by the rest of the robot code. Subsystems allow users to “hide” the internal complexity of their actual hardware from the rest of their code - this both simplifies the rest of the robot code, and allows changes to the internal details of a subsystem without also changing the rest of the robot code. Subsystems implement the ``Subsystem`` interface.
es_mx: Los **subsistemas** son la unidad básica de la organización del robot en el paradigma basado en el diseño. Los subsistemas `encapsulan <https://en.wikipedia.org/wiki/Encapsulation_(computer_programming)>` __ hardware de robot de nivel inferior (como controladores de motor, sensores y/o actuadores neumáticos) y definen las interfaces a través de las cuales el resto del código del robot puede acceder a ese hardware. Los subsistemas permiten a los usuarios "ocultar" la complejidad interna de su hardware real del resto de su código; esto simplifica el resto del código del robot y permite cambios en los detalles internos de un subsistema sin cambiar también el resto del código del robot. . Los subsistemas implementan la interfaz ``Subsistema``.

source: **Commands** define high-level robot actions or behaviors that utilize the methods defined by the subsystems. A command is a simple `state machine <https://en.wikipedia.org/wiki/Finite-state_machine>`__ that is either initializing, executing, ending, or idle. Users write code specifying which action should be taken in each state. Simple commands can be composed into “command groups” to accomplish more-complicated tasks. Commands, including command groups, implement the ``Command`` interface.
es_mx: Los **comandos** definen acciones o comportamientos de robots de alto nivel que utilizan los métodos definidos por los subsistemas. Un comando es una simple `máquina de estado <https://en.wikipedia.org/wiki/Finite-state_machine>` __ que se está inicializando, ejecutándose, finalizando o inactiva. Los usuarios escriben un código que especifica qué acción se debe tomar en cada estado. Los comandos simples se pueden componer en “grupos de comandos” para realizar tareas más complicadas. Los comandos, incluidos los grupos de comandos, implementan la interfaz de ``Comando``.

source: Subsystems also can be associated with “default commands” that will be automatically scheduled when no other command is currently using the subsystem. This is useful for continuous “background” actions such as controlling the robot drive, or keeping an arm held at a setpoint.
es_mx: Los subsistemas también se pueden asociar con “comandos predeterminados” que se programarán automáticamente cuando ningún otro comando esté utilizando el subsistema. Esto es útil para acciones continuas “en segundo plano”, como controlar el accionamiento del robot o mantener un brazo sujeto en un punto de ajuste.

source: It is often desirable to build complex commands from simple pieces. This is achievable by `composing <https://en.wikipedia.org/wiki/Object_composition>`__ commands into “command groups.” A :doc:`command group <command-groups>` is a command that contains multiple commands within it, which run either in parallel or in sequence. The command-based library provides several types of command groups for teams to use, and users are encouraged to write their own, if desired. As command groups themselves implement the ``Command`` interface, they are `recursively composable <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__ - one can include command groups *within* other command groups. This provides an extremely powerful way of building complex robot actions with a simple library.
es_mx: A menudo es deseable construir comandos complejos a partir de piezas simples. Esto se puede lograr componiendo comandos <https://en.wikipedia.org/wiki/Object_composition> `__ en “grupos de comandos”. Un :doc: `command group <command-groups>` es un comando que contiene varios comandos dentro de él, que se ejecutan en paralelo o en secuencia. La biblioteca basada en comandos proporciona varios tipos de grupos de comandos para que los usen los equipos, y se anima a los usuarios a que escriban los suyos propios, si lo desean. Como los propios grupos de comandos implementan la interfaz de ``Comando``, son `componibles recursivamente <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>` __ - se pueden incluir grupos de comandos *dentro* de otros grupos de comandos. Esto proporciona una forma extremadamente poderosa de crear acciones de robot complejas con una biblioteca simple.
