Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/what-*-command-based.po
Languages: es_mx, fr_ca, zh_cn

source: What Is "Command-Based" Programming?
es_mx: ¿Qué es la programación "basada en comandos"?
fr_ca: Qu’est-ce que la programmation « orientée commande » ?
zh_cn: 什么是 "Command-Based" 编程？

source: WPILib supports a robot programming methodology called "command-based" programming. In general, "command-based" can refer both the general programming paradigm, and to the set of WPILib library resources included to facilitate it.
fr_ca: WPILib supporte une méthodologie de programmation robot appelée programmation « orientée commande. » L'expression « orientée commande » peut faire référence à la fois au paradigme général de programmation et à l'ensemble des fonctionnalités incluses dans WPILib afin de faciliter l'utilisation de ce paradigme.
zh_cn: WPILib支持一种称为“基于命令”编程的机器人编程方法。通常，“基于命令的”既可以引用一般的编程范例，也可以引用为方便起见而包括的WPILib库资源集。

source: "Command-based" programming is an example of what is known as a `design pattern. <https://en.wikipedia.org/wiki/Design_pattern>`__ It is a general way of organizing one’s robot code that is well-suited to a particular problem-space. It is not the only way to write a robot program, but it is a very effective one; command-based robot code tends to be clean, extensible, and (with some tricks) easy to re-use from year to year.
fr_ca: La programmation "orientée commande " est un exemple de ce que l’on appelle un `patron de conception. <https://en.wikipedia.org/wiki/Design_pattern>`__. C’est une méthode générale d’organiser le code de son robot qui est bien adaptée à une problématique spécifique. Il ne s’agit pas de la seule façon d’écrire le programme d’un robot, mais c’est une méthode très efficace : un programme "orienté commande" a tendance à être plus clair, extensible et (avec quelques astuces) facile à réutiliser d’année en année.
zh_cn: “基于命令”编程是所谓的“设计模式”的一个示例。 <https://en.wikipedia.org/wiki/Design_pattern>`__这是一种组织机器人代码的通用方法，该代码非常适合特定的问题空间。这不是编写机器人程序的唯一方法，但它是一种非常有效的方法。基于命令的机器人代码趋向于干净，可扩展，并且（具有一些技巧）易于年复一年地重复使用。

source: The command-based paradigm is also an example of what is known as `declarative <https://en.wikipedia.org/wiki/Declarative_programming>`__ programming. In declarative programming, the emphasis is placed on *what* the program ought to do, rather than *how* the program ought to do it. Thus, the command-based libraries allow users to define desired robot behaviors while minimizing the amount of iteration-by-iteration robot logic that they must write. For example, in a command-based program, a user can specify that "the robot should perform an action when a button is pressed" (note the use of a :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`):
fr_ca: Le paradigme orienté commande est également un exemple de ce que l'on appelle la `programmation déclarative <https://fr.wikipedia.org/wiki/Programmation_d%C3%A9clarative>`__. En programmation déclarative, l'accent est mis sur ce que le programme doit faire, et non sur comment il doit le faire. Ainsi, les bibliothèques orientées commande permettent aux utilisateurs de définir les comportements du robot tout en minimisant la quantité de code à écrire pour gérer la logique d'itération en itération du programme. Par exemple, dans un programme orienté commande, l'utilisateur peut spécifier que "le robot doit effectuer une action lorsqu'un bouton est appuyé" (remarquez l'utilisation d'une :ref:`expression lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`):
zh_cn: 基于命令的范例也是所谓的“声明性<https://en.wikipedia.org/wiki/Declarative_programming>” __编程的示例。在声明式编程中，重点放在程序应该做什么，而不是程序应该如何做。因此，基于命令的库允许用户定义所需的机器人行为，同时将他们必须编写的逐次迭代的机器人逻辑的数量减至最少。例如，在基于命令的程序中，用户可以指定“按下按钮时机器人应执行操作”（请注意使用：ref：`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`）：

source: In contrast, in an ordinary `imperative <https://en.wikipedia.org/wiki/Imperative_programming>`__ program, the user would need to check the button state every iteration, and perform the appropriate action based on the state of the button.
es_mx: Por el contrario, en un programa ordinario `imperative <https://en.wikipedia.org/wiki/Imperative_programming>`__, el usuario tendría que comprobar el estado del botón en cada iteración y realizar la acción adecuada en función del estado del botón.
fr_ca: En revanche, dans un programme `impératif <https://fr.wikipedia.org/wiki/Programmation_imp%C3%A9rative>`__ classique, l'utilisateur devrait vérifier l'état du bouton à chaque itération, et effectuer l'action appropriée en fonction de l'état du bouton.
zh_cn: 相反，在普通的`imperative <https://en.wikipedia.org/wiki/Imperative_programming>`__程序中，用户将需要在每次迭代时检查按钮状态，并根据按钮的状态执行适当的操作。

source: Subsystems and Commands
es_mx: Subsistemas y comandos
fr_ca: Sous-systèmes et commandes
zh_cn: 子系统和指令

source: image of subsystems and commands
fr_ca: image des sous-systèmes et des commandes

source: The command-based pattern is based around two core abstractions: **commands**, and **subsystems.**
es_mx: El patrón basado en comandos se basa en dos abstracciones centrales: **comandos** y **subsistemas.**
fr_ca: Le patron orienté commande repose sur deux abstractions fondamentales : les **commandes** et les **sous-systèmes**.
zh_cn: 基于命令的编程模式基于两个核心抽象类：**指令**和**子系统。**

source: **Subsystems** are the basic unit of robot organization in the design-based paradigm. Subsystems `encapsulate <https://en.wikipedia.org/wiki/Encapsulation_(computer_programming)>`__ lower-level robot hardware (such as motor controllers, sensors, and/or pneumatic actuators), and define the interfaces through which that hardware can be accessed by the rest of the robot code. Subsystems allow users to "hide" the internal complexity of their actual hardware from the rest of their code - this both simplifies the rest of the robot code, and allows changes to the internal details of a subsystem without also changing the rest of the robot code. Subsystems implement the ``Subsystem`` interface.
fr_ca: Les **sous-systèmes** sont l'unité de base de l'organisation d'un robot dans le paradigme orienté commande. Les sous-systèmes `encapsulent <https://fr.wikipedia.org/wiki/Encapsulation_(programmation)>`__ les composantes de bas niveau du robot (comme les contrôleurs de moteur, les capteurs et/ou les actionneurs pneumatiques) et définissent les interfaces par lesquelles le reste du programme accèdera à ces composantes. Les sous-systèmes permettent aux utilisateurs de « cacher » au reste du programme la complexité interne de leurs composantes réelles : cela simplifie le reste du code du robot et permet de modifier les détails internes d'un sous-système sans devoir également modifier le reste du programme. Les sous-systèmes implémentent l'interface ``Subsystem``.
zh_cn: **子系统**是基于设计的范式中机器人组织的基本单元。子系统“封装<https://en.wikipedia.org/wiki/Encapsulation_(computer_programming)>” __下层机器人硬件（例如电机控制器，传感器和/或气动执行器），并定义接口，其余的机器人代码可通过该接口访问硬件。子系统允许用户从其余代码中“隐藏”其实际硬件的内部复杂性-这不仅简化了其余的机器人代码，而且允许更改子系统的内部细节，而无需同时更改其余的机器人代码。 。子系统实现``子系统''接口。

source: **Commands** define high-level robot actions or behaviors that utilize the methods defined by the subsystems. A command is a simple `state machine <https://en.wikipedia.org/wiki/Finite-state_machine>`__ that is either initializing, executing, ending, or idle. Users write code specifying which action should be taken in each state. Simple commands can be composed into "command groups" to accomplish more-complicated tasks. Commands, including command groups, implement the ``Command`` interface.
fr_ca: Les **commandes** définissent les actions ou les comportements de haut niveau du robot. Elles utilisent les méthodes déclarées par les sous-systèmes. Une commande est un simple `automate <https://fr.wikipedia.org/wiki/Automate_fini>`__ qui est soit en cours d'initialisation, en cours d'exécution, en cours de terminaison ou inactif. Les utilisateurs écrivent le code spécifiant quelle action doit être effectuée dans chaque état. Les commandes simples peuvent être combinées en des « groupes de commandes » pour accomplir des tâches plus élaborées. Les commandes, y compris les groupes de commandes, implémentent l'interface ``Command``.
zh_cn: **命令**定义利用子系统定义的方法的高级机器人动作或行为。命令是一个简单的“状态机<https://en.wikipedia.org/wiki/Finite-state_machine>” __，它正在初始化，执行，结束或空闲。用户编写代码，指定在每种状态下应采取的操作。简单的命令可以组成“命令组”以完成更复杂的任务。命令（包括命令组）实现“命令”界面。

source: How Commands Are Run
es_mx: Cómo se ejecutan los comandos
fr_ca: L'exécution des commandes
zh_cn: 指令如何运行

source: For a more detailed explanation, see :doc:`command-scheduler`.
es_mx: Para obtener una explicación más detallada, consulte: doc: `command-scheduler`.
fr_ca: Pour une explication plus détaillée, consultez :doc:`command-scheduler`.
zh_cn: 有关更详细的说明，请参考:doc:`command-scheduler`.。

source: Commands are run by the ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html>`__), a singleton class that is at the core of the command-based library. The ``CommandScheduler`` is in charge of polling buttons for new commands to schedule, checking the resources required by those commands to avoid conflicts, executing currently-scheduled commands, and removing commands that have finished or been interrupted. The scheduler’s ``run()`` method may be called from any place in the user’s code; it is generally recommended to call it from the ``robotPeriodic()`` method of the ``Robot`` class, which is run at a default frequency of 50Hz (once every 20ms).
es_mx: Los comandos son ejecutados por el ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html>`__), una clase singleton que está en el núcleo de la biblioteca basada en comandos. El ``CommandScheduler`` se encarga de sondear los botones en busca de nuevos comandos para programar, comprobando los recursos requeridos por esos comandos para evitar conflictos, ejecutando los comandos actualmente programados, y eliminando los comandos que han terminado o han sido interrumpidos. El método ``run()`` del programador puede ser llamado desde cualquier lugar del código del usuario; generalmente se recomienda llamarlo desde el método ``robotPeriodic()`` de la clase ``Robot``, que se ejecuta con una frecuencia por defecto de 50Hz (una vez cada 20ms).
fr_ca: Les commandes sont exécutées par le ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html>`__), une classe singleton qui est au cœur de la librairie orientée commande. Le ``CommandScheduler`` est responsable d'interroger périodiquement l'état des boutons dans le but de planifier les nouvelles commandes, vérifier les ressources requises par ces commandes pour éviter les conflits, exécuter les commandes actuellement planifiées et supprimer les commandes dont l'exécution est terminée ou a été interrompue. La méthode ``run()`` du planificateur peut être appelée de n’importe quel endroit du code de l’utilisateur ; il est généralement recommandé de l’appeler à partir de la méthode ``robotPeriodic()`` de la classe ``Robot``, qui est exécutée à une fréquence par défaut de 50Hz (une fois toutes les 20ms).

source: Multiple commands can run concurrently, as long as they do not require the same resources on the robot. Resource management is handled on a per-subsystem basis: commands may specify which subsystems they interact with, and the scheduler will never schedule more than one command requiring a given subsystem at a time. This ensures that, for example, users will not end up with two different pieces of code attempting to set the same motor controller to different output values. If a new command is scheduled that requires a subsystem that is already in use, it will either interrupt the currently-running command that requires that subsystem (if the command has been scheduled as interruptible), or else it will not be scheduled.
es_mx: Se pueden ejecutar varios comandos al mismo tiempo, siempre que no requieran los mismos recursos en el robot. La administración de recursos se maneja por subsistema: los comandos pueden especificar con qué subsistemas interactúan, y el programador nunca programará más de un comando que requiera un subsistema determinado a la vez. Esto asegura que, por ejemplo, los usuarios no terminarán con dos piezas de código diferentes que intenten configurar el mismo controlador de motor a diferentes valores de salida. Si se programa un nuevo comando que requiere un subsistema que ya está en uso, interrumpirá el comando actualmente en ejecución que requiere ese subsistema (si el comando se programó como interrumpible), o de lo contrario no se programará.
fr_ca: Plusieurs commandes peuvent être exécutées simultanément, à condition qu'elles ne nécessitent pas les mêmes ressources. La gestion de ces ressources se fait par sous-système : les commandes peuvent spécifier les sous-systèmes avec lesquels elles interagissent Ainsi, le ``CommandScheduler`` n'exécutera jamais en même temps plus d'une commande nécessitant le même sous-système. Cela permet d'éviter, par exemple, que les utilisateurs ne se retrouvent avec deux bouts de code différents essayant de modifier la valeur de sortie du même contrôleur de moteur. Si une nouvelle commande est démarrée et qu'elle a besoin d'un sous-système en cours d'utilisation, le ``CommandScheduler`` interrompra la commande en cours d'exécution qui utilise ce sous-système, si cette commande est interruptible. Si elle ne peut pas être interrompue, alors l'autre commande ne sera pas démarrée.
zh_cn: 只要这些指令不需要“Robot”类中的相同资源，就可以同时运行多个指令。资源管理是在每个子系统的基础上进行的：指令可以指定与之交互的子系统，并且调度程序每一次运行都只会调度一个需要一个特定子类的指令。这样可以确保一种情况，例如，用户不会以试图将同一电动机控制器设置为不同输出值的两个不同的代码结尾。如果调度了一个需要已在使用的子系统的新指令，则它将中断需要该子系统的当前正在运行的指令（如果该指令已被安排为可中断），否则前者将不会被调度。

source: Subsystems also can be associated with "default commands" that will be automatically scheduled when no other command is currently using the subsystem. This is useful for continuous "background" actions such as controlling the robot drive, or keeping an arm held at a setpoint.
fr_ca: Chaque sous-système peut également être associé à une "commande par défaut" qui est automatiquement démarrée lorsqu'aucune autre commande n'utilise ce sous-système. Cela est utile pour les actions qui s'exécutent continuellement en arrière-plan comme le contrôle de la base pilotable du robot ou le maintien d'un bras articulé à une position fixe.
zh_cn: 子系统还可以与“默认命令”相关联，当当前没有其他命令正在使用子系统时，将自动计划这些子系统。这对于连续的“后台”操作（例如控制机器人驱动器或将手臂保持在设定点）很有用。

source: When a command is scheduled, its ``initialize()`` method is called once. Its ``execute()`` method is then called once per call to ``CommandScheduler.getInstance().run()``. A command is un-scheduled and has its ``end(boolean interrupted)`` method called when either its ``isFinished()`` method returns true, or else it is interrupted (either by another command with which it shares a required subsystem, or by being canceled).
es_mx: Cuando se programa un comando, su método ``initialize()`` se llama una vez. Su método ``execute()`` se llama una vez por llamada a ``CommandScheduler.getInstance().run()``. Un comando no está programado y tiene su método ``end(boolean interrumpted)`` llamado cuando su método ``isFinished()`` devuelve verdadero, o es interrumpido (ya sea por otro comando con el que comparte un subsistema, o por ser cancelado).
fr_ca: Lorsqu'une commande est démarrée, sa méthode ``initialize()`` est appelée une fois. Ensuite, sa méthode ``execute()`` est appelée à chaque fois que la méthode ``CommandScheduler.getInstance().run()`` est appelée. Lorsque la commande arrête de s'exécuter, sa méthode ``end(boolean interrupted)`` est appelée une fois. Cela se produit lorsque sa méthode ``isFinished()`` retourne ``true`` ou lorsqu'elle est interrompue (soit par une commande qui requiert un sous-système qu'elle utilise, soit en étant annulée).
zh_cn: 调度一个指令后，其“initialize()”方法将被调用一次。然后，每次调用“CommandScheduler.getInstance.run()”时都会调用其“execute()”方法。当指令的“isFinished()”方法返回true或该指令被打断（被另一个使用相同子系统的指令打断或被取消）时，该指令将取消调度并调用其“end(boolean interrupted)”方法。

source: Command Groups
es_mx: Grupos de comandos
fr_ca: Groupes de commandes
zh_cn: 指令组

source: It is often desirable to build complex commands from simple pieces. This is achievable by `composing <https://en.wikipedia.org/wiki/Object_composition>`__ commands into "command groups." A :doc:`command group <command-groups>` is a command that contains multiple commands within it, which run either in parallel or in sequence. The command-based library provides several types of command groups for teams to use, and users are encouraged to write their own, if desired. As command groups themselves implement the ``Command`` interface, they are `recursively composable <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__ - one can include command groups *within* other command groups. This provides an extremely powerful way of building complex robot actions with a simple library.
fr_ca: Il est souvent souhaitable de concevoir des commandes complexes à partir d'éléments simples. Cela est possible par la `composition <https://fr.wikipedia.org/wiki/Composition_(programmation)>`__ de commandes en "groupes de commandes". Un <command-groups> est une commande qui contient plusieurs commandes, qui seront exécutées séquentiellement ou parallèlement. La bibliothèque orientée commande fournit plusieurs types de groupes de commandes à l'usage des équipes et les utilisateurs sont invités à écrire les leurs, s'ils le souhaitent. Comme les groupes de commandes implémentent également l'interface ``Command``, on peut les `composer récursivement <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__, c'est-à-dire qu'il est possible d'inclure un groupe de commandes dans d'autres groupes. Il s'agit donc d'un moyen extrêmement puissant de construire des actions complexes avec une bibliothèque relativement simple.
zh_cn: 通常需要从简单的片段构建复杂的命令。这可以通过将__命令组成“命令组”来实现。命令组<command-groups>是一个命令，其中包含多个命令，这些命令可以并行或顺序运行。基于命令的库提供了几种类型的命令组供团队使用，如果需要，鼓励用户编写自己的命令组。当命令组本身实现``Command''接口时，它们是可递归组合的<https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__-一个命令组可以*在*其他命令组中。这为使用简单的库构建复杂的机器人动作提供了一种非常强大的方法。

source: Creating a Robot Project
es_mx: Crear un proyecto de robot
fr_ca: Créer un projet robot
zh_cn: 创建一个机器人项目

source: Creating a project is detailed in :ref:`docs/software/vscode-overview/creating-robot-program:Creating a Robot Program`. Select "Template" then your programming language then "New Command Robot" to create a basic Command-Based Robot program.
es_mx: La creación de un proyecto se detalla en :ref:`docs/software/vscode-overview/creating-robot-program:Creating a Robot Program`. Seleccione "Template", luego su lenguaje de programación y luego "New Command Robot" para crear un programa básico de robot a base de comandos.
fr_ca: La création d'un projet est détaillée dans :ref:`docs/software/vscode-overview/creating-robot-program:Creating a Robot Program`. Sélectionnez "Template" puis votre langage de programmation puis "New Command Robot" pour créer un programme de base Command-Based Robot.
zh_cn: 在:ref:`docs/software/vscode-overview/creating-robot-program:Creating a Robot Program`中详细介绍了创建项目。选择“模板”，然后选择您的编程语言，然后选择“新指令机器人”，以创建一个基于命令的基本机器人程序。

source: When you create a New Command Robot project, the new command based vendor library is automatically imported. If you imported a 2019 project or created a different type of project, the old command library is imported, and it is necessary to import the new command based vendor library per :doc:`/docs/software/vscode-overview/3rd-party-libraries` and remove the old command library.
es_mx: Cuando usted creé un proyecto New Command Robot, la nueva biblioteca de proveedores basada en comandos se importa automáticamente. Si importó un proyecto de 2019 o creó un tipo de proyecto diferente, se importa la biblioteca de comandos anterior y es necesario importar la nueva biblioteca de proveedores basada en comandos por :doc:`/docs/software/vscode-overview/3rd-party-libraries` y elimine la antigua biblioteca de comandos.
fr_ca: Lorsque vous créez un nouveau projet Command Robot, la nouvelle librairie du fournisseur basée sur les commandes est automatiquement importée. Si vous avez importé un projet 2019 ou créé un autre type de projet, l'ancienne librairie de commandes est aussi importée et il est également nécessaire d'importer la nouvelle librairie de fournisseurs basée sur les commandes par :doc:`/docs/software/vscode-overview/3rd-party-libraries` et supprimer l'ancienne librairie de commandes.
zh_cn: 当使用 "New Command Robot" 创建新项目时，基于命令的新供应商库将被自动导入。如果您导入了 2019 年的项目或创建了其他类型的项目，则将导入旧的命令库，并且有必要根据 :doc:`/docs/software/vscode-overview/3rd-party-libraries` 导入基于命令的新供应商库并删除旧的指令库。

source: WPILib supports a robot programming methodology called “command-based” programming. In general, “command-based” can refer both the general programming paradigm, and to the set of WPILib library resources included to facilitate it.
es_mx: WPILib admite una metodología de programación de robots llamada programación “basada en comandos”. En general, “basado en comandos” puede referirse tanto al paradigma de programación general como al conjunto de recursos de la biblioteca WPILib incluidos para facilitarlo.

source: “Command-based” programming is an example of what is known as a `design pattern. <https://en.wikipedia.org/wiki/Design_pattern>`__ It is a general way of organizing one’s robot code that is well-suited to a particular problem-space. It is not the only way to write a robot program, but it is a very effective one; command-based robot code tends to be clean, extensible, and (with some tricks) easy to re-use from year to year.
es_mx: La programación "basada en comandos" es un ejemplo de lo que se conoce como `design pattern. <https://en.wikipedia.org/wiki/Design_pattern>`__ Es una forma general de organizar el código de un robot que se adapta bien a un problema-espacio en particular. No es la única forma de escribir un programa de robot, pero es muy eficaz; El código de robot basado en comandos tiende a ser limpio, extensible y (con algunos trucos) fácil de reutilizar año tras año.
