Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/build-instructions.po
Languages: es_mx, he_il, pt, zh_cn

source: Build Instructions
es_mx: Instrucciones de Construcción
he_il: הנחיות בנייה
pt: Instruções de Construção

source: This document contains information on how to build the HTML, PDF, and EPUB versions of the frc-docs site. frc-docs uses Sphinx as the documentation generator. This document also assumes you have basic knowledge of `Git <https://git-scm.com/>`__ and console commands.
es_mx: Este documento contiene información sobre cómo construir las versiones de HTML, PDF, y EPUB del sitio frc-docs. frc-docs usa Sphinx como generador de documentación. Éste documento también asume que usted tiene los conocimientos básicos de `Git <https://git-scm.com/>`__ y los comandos de consola.
he_il: מסמך זה מכיל מידע כיצד לבנות את גרסאות ה-HTML, PDF ו-EPUB של אתר frc-docs. frc-docs משתמש ב-Sphinx כמייצר התיעוד. מסמך זה מניח שיש לך ידע בסיסי בפקודות `Git <https://git-scm.com/>`__ ופקודות המסוף.
pt: Este documento contém informações sobre como construir as versões HTML, PDF e EPUB do site frc-docs. frc-docs usa Sphinx como gerador de documentação. Esse documento também assume que você tem conhecimento básico de `Git <https://git-scm.com/>`__ e comandos de console.
zh_cn: 本文档包含有关如何构建 frc-docs 网站的 HTML ，PDF 和 EPUB 版本的信息。 frc-docs 使用 Sphinx 作为文档生成器。本文档还假定您具有 `Git <https://git-scm.com/>`__ 和控制台命令的基本知识。

source: Prerequisites
es_mx: Prerrequisitos
he_il: דרישות מקדימות
pt: Pré-requisitos

source: Ensure that `Git <https://git-scm.com/>`__ is installed and that the frc-docs repository is cloned by using ``git clone https://github.com/wpilibsuite/frc-docs.git``.
es_mx: Asegúrese de que `Git <https://git-scm.com/>`__ esté instalado y que el repositorio de frc-docs se clone utilizando ``git clone https://github.com/wpilibsuite/frc-docs.git``.
pt: Certifique-se de que `Git <https://git-scm.com/>`__ está instalado e que o repositório frc-docs está clonado usando ``git clone https://github.com/wpilibsuite/frc-docs.git``.
zh_cn: 确保已安装 `Git <https://git-scm.com/>`__ ，并使用 ``git clone https://github.com/wpilibsuite/frc-docs.git``. 克隆了 frc-docs 存储库。

source: Text Editors / IDE
es_mx: Editores de texto / IDE

source: For development, we recommend that you use VS Code along with the `reStructuredText extension <https://marketplace.visualstudio.com/items?itemName=lextudio.restructuredtext>`_. However, any text editor will work.
es_mx: Para desarrollo, recomendamos que uses VS Code junto con la extensión `reStructuredText <https://marketplace.visualstudio.com/items?itemName=lextudio.restructuredtext>`_. Sin embargo, cualquier editor de texto funcionará.

source: By default, the reStructuredText extension enables linting with all doc8 features enabled. As frc-docs does not follow the line length lint, add the following to your VS Code ``settings.json`` to disable line length linting.
es_mx: Por defecto, la extensión reStructuredText habilita el linting con todas las características de doc8 habilitadas. Como frc-docs no sigue el lint de longitud de línea, agrega lo siguiente a tu archivo ``settings.json`` de VS Code para deshabilitar el linting de longitud de línea.

source: MikTeX and ``rsvg-convert`` are not required for building HTML, they are only required for Windows PDF builds.
es_mx: MikTeX y ``rsvg-convert`` no son necesarios para compilaciones de HTML, sólo son necesarios para PDF en Windows.
pt: MikTeX e ``rsvg-convert`` não são necessários para compilar HTML, eles são necessários apenas para compilações de PDF do Windows..

source: `MiKTeX <https://miktex.org/download>`__ (Only needed for PDF builds)
es_mx: `MiKTeX <https://miktex.org/download>` __ (Solo necesario para compilaciones PDF)
he_il: `MiKTeX <https://miktex.org/download>`__ (דרוש רק עבור בניית PDF)
pt: `MiKTeX <https://miktex.org/download>`__ (Necessário apenas para compilações de PDF)

source: `rsvg-convert <https://community.chocolatey.org/packages/rsvg-convert>`__ (Only needed for PDF builds)
es_mx: `rsvg-convert <https://community.chocolatey.org/packages/rsvg-convert>`__ (Solo necesario para generar PDF)

source: Ensure that Python is in your Path by selecting the **Add Python to PATH** toggle when installing Python.
es_mx: Asegúrese de que Python esté en su PATH, marcando la casilla **Agregar Python a PATH** al instalar Python.
he_il: ודאו כי Python נמצא ב-Path שלכם על ידי סימון **Add Python to PATH** בעת התקנת Python.
pt: Certifique-se de que o Python está em seu Path, selecionando a opção **Add Python to PATH** (Adicionar Python ao PATH) ao instalar o Python.
zh_cn: 通过在安装 Python 时选择开关 **Add Python to PATH** 确保 Python 在您的路径中。

source: Showing where to click the box to add Python to PATH.
es_mx: Mostrando dónde hacer clic en la casilla para añadir Python al PATH.
he_il: מראה איפה ללחוץ כדי להוסיף את פייטון אל ה PATH
pt: Mostrando onde clicar na caixa para adicionar Python para o PATH.

source: Once Python is installed, open up Powershell. Then navigate to the frc-docs directory. Run the following command: ``pip install -r source/requirements.txt``
es_mx: Una vez que Python esté instalado, abra Powershell. Luego navegue al directorio frc-docs. Ejecute el siguiente comando: ``pip install -r source/requirements.txt``
he_il: לאחר התקנת Python, פתחו את Powershell. לאחר מכן נווטו לתקיית frc-docs. הפעילו את הפקודה הבאה: ``pip install -r source/requirements.txt``
pt: Assim que o Python estiver instalado, abra o Powershell. Em seguida, navegue até o diretório frc-docs. Execute o seguinte comando: ``pip install -r source/requirements.txt``
zh_cn: 安装 Python 之后，打开 Powershell。然后导航到 frc-docs 目录。运行以指令： ``pip install -r source/requirements.txt``

source: Install the missing MikTex packages by navigating to the frc-docs directory, then running the following command from Powershell: ``miktex --verbose packages require --package-id-file miktex-packages.txt``
es_mx: Instala los paquetes faltantes de MikTex navegando al directorio frc-docs, luego ejecuta el siguiente comando desde Powershell: ``miktex --verbose packages require --package-id-file miktex-packages.txt``

source: Building
es_mx: Compilando
he_il: בנייה
pt: Compilando

source: Open up a Powershell Window or terminal and navigate to the frc-docs directory that was cloned.
es_mx: Abra una ventana o terminal de Powershell y navegue hasta el directorio frc-docs que fue clonado.
he_il: פתחו חלון Powershell או Terminal ונווטו לתקיית frc-docs.
pt: Abra uma janela Powershell ou terminal e navegue até o diretório frc-docs que foi clonado.
zh_cn: 打开 Powershell Window 或终端，然后直接导航到克隆的 frc-docs 目录。

source: Lint Check will not check line endings on Windows due to a bug with line endings. See `this issue <https://bugs.launchpad.net/doc8/+bug/1756704>`__ for more information.
es_mx: Lint Check no marcará los bordes en Windows debido al error de los bordes. Vea `este problema <https://bugs.launchpad.net/doc8/+bug/1756704>`__ para más información.
he_il: בדיקת Lint לא תבדוק סיומי השורות ב-Windows בגלל באג. ראו `Issue זה <https://bugs.launchpad.net/doc8/+bug/1756704>`__ למידע נוסף.
pt: A verificação do Linter não verificará terminações de linha no Windows devido a um bug com terminações de linha. Veja `este problema <https://bugs.launchpad.net/doc8/+bug/1756704>` __ para mais informações.
zh_cn: Lint Check 将不会检查 Windows上的行尾，因为存在行尾错误。有关更多信息，请参见 `this issue <https://bugs.launchpad.net/doc8/+bug/1756704>`__ for more information.

source: It's encouraged to check any changes you make with the linter. This **will** fail the buildbot if it does not pass. To check, run ``.\make lint``
es_mx: Se recomienda verificar cualquier cambio que realice con el linter. Esto **podría** fallar el buildbot si no pasa. Para verificar, ejecute ``.\make lint``
he_il: מומלץ לבדוק את כל השינויים שתבצע עם ה-linter. זה **יכשיל** את ה-buildbot אם הוא לא יעבור. כדי לבדוק, הרץ: ``.\make lint``
pt: Recomenda-se verificar todas as alterações feitas com o linter. Isso **irá** falhar o buildbot se não passar. Para verificar, execute ``.\make lint``
zh_cn: 鼓励您检查对 linter 所做的任何更改。如果编译器没有通过，这 **will** 使编译器失败。要检查，请运行 ``.\make lint``

source: Link Check
es_mx: Verificar el enlace
he_il: בדיקת קישורים
pt: Verificação de Link

source: The link checker makes sure that all links in the documentation resolve. This **will** fail the buildbot if it does not pass. To check, run ``.\make linkcheck``
es_mx: El verificador de enlace asegura que todos los enlaces/links en la documentación estén resueltos. Esto **podría** fallar el buildbot si no pasa. Para verificar, ejecute ``.\make linkcheck``
he_il: בדיקת הקישורים תוודא כי כל הקישורים שבתיעוד קיימים. ה-buildbot *יכשל* אם בדיקה זו לא תעבור. כדי לבדוק, הריצו ``.\make linkcheck``
pt: O verificador de link garante que todos os links na documentação sejam resolvidos. Isso **irá** falhar o buildbot se não passar. Para verificar, execute ``.\make linkcheck``
zh_cn: 链接检查器确保文档中的所有链接都能解析。如果编译器没有通过，这**will** 使编译器失败。要检查，请运行``。\ make linkcheck``

source: Image Size Check
es_mx: Verificar el tamaño de imagen
he_il: בדיקות גודל התמונות
pt: Verificação do Tamanho da Imagem

source: Please run ``.\make sizecheck`` to verify that all images are below 500KB. This check **will** fail CI if it fails. Exclusions are allowed on a case by case basis and are added to the ``IMAGE_SIZE_EXCLUSIONS`` list in the configuration file.
es_mx: Ejecute ``.\make sizecheck`` para verificar que todas las imágenes tengan menos de 500 KB. Esta verificación **fallará** CI si falla. Las exclusiones se permiten caso por caso y se agregan a la lista ``IMAGE_SIZE_EXCLUSIONS`` en el archivo de configuración.

source: Redirect Check
es_mx: Verificar redirección
he_il: בדיקת הפניות
pt: Verificação de Redirecionamento

source: Files that have been moved or renamed must have their new location (or replaced with 404) in the ``redirects.txt`` file in ``source``.
es_mx: Los archivos que se han movido o cambiado de nombre deben tener su nueva ubicación (o reemplazarse con 404) en el archivo ``redirects.txt`` en ``source``.
he_il: קבצים שהועברו או ששמם שונה חייב להיות מיקומם החדש (או הוחלף ב-404) בקובץ ``redirects.txt`` ב``source``.
pt: Os arquivos que foram movidos ou renomeados devem ter seu novo local (ou substituídos por 404) no arquivo ``redirects.txt`` em ``fonte``.
zh_cn: 已移动或重命名的文件必须在 ``source`` 中的 ``redirects.txt`` 文件中有新位置（或用 404 替换）。

source: The redirect writer will automatically add renamed/moved files to the redirects file. Run ``.\make rediraffewritediff``.
es_mx: El escritor de redireccionamiento agregará automáticamente archivos renombrados / movidos al archivo de redireccionamientos. Ejecute ``.\make rediraffewritediff``.
pt: O Redirect Writer adicionará automaticamente arquivos renomeados/movidos ao arquivo de redirecionamento. Execute ``.\make rediraffewritediff``.
zh_cn: 重定向编写器会自动将重命名/移动的文件添加到重定向文件中。运行 ``.\make rediraffewritediff``

source: if a file is both moved and substantially changed, the redirect writer will not add it to the ``redirects.txt`` file, and the ``redirects.txt`` file will need to be manually updated.
es_mx: Si un archivo se mueve y se modifica sustancialmente, el escritor de redirecciones no lo agregará al archivo ``redirects.txt`` y el archivo ``redirects.txt`` deberá actualizarse manualmente.
pt: Se um arquivo for movido e substancialmente alterado, o Redirect Writer não irá adicioná-lo ao arquivo ``redirects.txt``, e o arquivo ``redirects.txt`` precisará ser atualizado manualmente.
zh_cn: 如果移动了文件的同时并对其进行了实质性更改，则重定向编写器不会将其添加到 ``redirects.txt`` 文件中，并且需要手动更新 ``redirects.txt`` 文件。

source: The redirect checker makes sure that there are valid redirects for all files. This **will** fail the buildbot if it does not pass. To check, run ``.\make rediraffecheckdiff`` to verify all files are redirected. Additionally, an HTML build may need to be ran to ensure that all files redirect properly.
es_mx: El comprobador de redireccionamiento se asegura de que haya redireccionamientos válidos para todos los archivos. Esto **fallará** al buildbot si no pasa. Para comprobarlo, ejecute ``.\make rediraffecheckdiff`` para verificar que todos los archivos estén redirigidos. Además, es posible que sea necesario ejecutar una compilación HTML para garantizar que todos los archivos se redireccionen correctamente.
pt: O Redirect Writer garante que haja redirecionamentos válidos para todos os arquivos. Isso **irá** falhar o buildbot se não passar. Para verificar, execute ``.\make rediraffecheckdiff`` para verificar se todos os arquivos foram redirecionados. Além disso, pode ser necessário executar uma compilação em HTML para garantir que todos os arquivos sejam redirecionados corretamente.
zh_cn: 重定向检查器确保所有文件都有有效的重定向。如果编译器没有通过，这 **will** 使编译器失败。要进行检查，请运行 ``.\make rediraffecheckdiff``，以验证所有文件都已重定向。此外，可能需要运行一个 HTML 以确保所有文件正确重定向。

source: Building HTML
es_mx: Construyendo HTML
he_il: בניית HTML
pt: Compilando em HTML
zh_cn: 构建 HTML

source: Type the command ``.\make html`` to generate HTML content. The content is located in the ``build/html`` directory at the root of the repository.
es_mx: Escriba el comando ``.\make html`` para generar un contenido HTML. Éste contenido esta ubicado en el directorio ``build/html`` en la raíz del repositorio.
he_il: הריצו את הפקודה ``.\make html`` כדי ליצור תוכן HTML. התוכן בתקיית ``build/html`` בשורש ה-Repository.
pt: Digite o comando ``.\make html`` para gerar o conteúdo HTML. O conteúdo está localizado no diretório ``build/html`` na raiz do repositório.
zh_cn: 输入指令 ``.\make html`` 以生成 HTML 内容。该内容位于存储库根目录的 ``build/html`` 目录中。

source: Building PDF
es_mx: Construyendo un PDF
he_il: בניית PDF
pt: Compilando em PDF

source: Please note that PDF build on Windows may result in distorted images for SVG content. This is due to a lack of librsvg2-bin support on Windows.
es_mx: Por favor note que un PDF hecho en Windows puede resultar en imágenes distorsionadas por el contenido SVG. Esto se debe a la falta de soporte de librsvg2-bin en Windows.
pt: Observe que a compilação em PDF no Windows pode resultar em imagens distorcidas para conteúdo SVG. Isso ocorre devido à falta de suporte a librsvg2-bin no Windows.
zh_cn: 请注意，Windows 上的 PDF 程序可能会导致 SVG 内容的图像失真。这是因为 Windows 上缺少 librsvg2-bin 支持。

source: Type the command ``.\make latexpdf`` to generate PDF content. The PDF is located in the ``build/latex`` directory at the root of the repository.
es_mx: Escriba el comando ``.\make latexpdf`` para generar el contenido PDF. El PDF está localizado en el directorio ``build/latex`` en la raíz del repositorio.
pt: Digite o comando ``.\make latexpdf`` para gerar o conteúdo PDF. O PDF está localizado no diretório ``build/latex`` na raiz do repositório.
zh_cn: 输入指令 ``.\make latexpdf`` 以生成 PDF 内容。 PDF 位于存储库根目录的 ``build/latex`` 目录中。

source: Building EPUB
es_mx: Construyendo EPUB
he_il: בניית EPUB
pt: Compilando em EPUB

source: Type the command ``.\make epub`` to generate EPUB content. The EPUB is located in the ``build/epub`` directory at the root of the repository.
es_mx: Escriba el comando ``.\make epub`` para generar un contenido EPUB. El EPUB está ubicado en el directorio ``build/epub`` en la raíz del repositorio.
pt: Digite o comando ``.\make epub`` para gerar o conteúdo EPUB. O EPUB está localizado no diretório ``build/epub`` na raiz do repositório.
zh_cn: 输入指令 ``.\make epub`` 以生成 EPUB 内容。 EPUB 位于存储库根目录的 ``build/epub`` 目录中。

source: Adding Python Third-Party libraries
es_mx: Agregar bibliotecas de terceros de Python
pt: Adicionando Bibliotecas de Terceiros em Python
zh_cn: 添加Python第三方库

source: After modifying frc-docs dependencies in any way, ``requirements.txt`` must be regenerated by running ``poetry export -f requirements.txt --output source/requirements.txt --without-hashes`` from the root of the repo.
es_mx: Después de modificar las dependencias de frc-docs de cualquier manera, ``requirements.txt`` debe regenerarse ejecutando ``poetry export -f requirements.txt --output source/requirements.txt --without-hashes`` desde la raíz de el repositorio.
pt: Depois de fazer qualquer alteração as dependências de frc-docs, ``requirements.txt`` deve ser gerado novamente rodando ``poetry export -f requirements.txt --output source/requirements.txt --without-hashes`` a partir do diretório raiz.
zh_cn: 在以任何方式修改frc-docs依赖关系之后，必须通过从目录的根目录运行“ poetry export -f requirements.txt --output source / requirements.txt --with-hashhes”来重新生成“ requirements.txt”。回购。

source: frc-docs uses `Poetry <https://python-poetry.org/>`__ to manage its dependencies to make sure builds are reproducible.
es_mx: frc-docs usa `Poetry <https://python-poetry.org/>`__ para administrar sus dependencias para asegurarse que contrucciones sean reproducibles.
pt: Frc-docs usa `Poetry <https://python-poetry.org/>`__ para gerenciar suas dependências e garantir que as construções sejam reproduzíveis.
zh_cn: frc-docs使用Poetry <https://python-poetry.org/>`__来管理其依赖项，以确保构建可复制。

source: Poetry is **not** required to build and contribute to frc-docs content. It is *only* used for dependency management.
es_mx: Poetry **no** es necesaria para crear y contribuir al contenido de frc-docs. *Solo* se utiliza para la gestión de dependencias.
he_il: poetry **לא** נדרשת כדי לבנות ולתרום לתוכן frc-docs. הוא משמש *רק* לניהול תלויות.
pt: Poetry ***não*** é necessária para construir e contribuir no conteúdo de frc-docs. É usado *apenas* para o gerenciamento de dependências.
zh_cn: 诗不是构建和贡献于frc-docs内容所必需的。 *仅*用于依赖项管理。

source: Installing Poetry
es_mx: Instalar Poetry
he_il: התקנת Poetry
pt: Instalando Poetry
zh_cn: 安装诗歌

source: Ensure that Poetry is installed. Run the following command: ``pip install poetry``.
es_mx: Asegúrese de que Poetry esté instalado. Ejecute el siguiente comando: ``pip install poet``.

source: Adding a Dependency
es_mx: Agregar una dependencia
he_il: הוספת תלות
pt: Adicionando uma Dependência
zh_cn: 添加依赖

source: Add the dependency to the ``[tool.poetry.dependencies]`` section of ``pyproject.toml``. Make sure to specify an exact version. Then, run the following command: ``poetry lock --no-update``.
es_mx: Agregue la dependencia a la sección ``[tool.poetry.dependencies]`` de ``pyproject.toml``. Asegúrese de especificar una versión exacta. Luego, ejecute el siguiente comando: ``poetry lock --no-update``.

source: Updating a Top-Level Dependency
es_mx: Actualizar una dependencia de nivel superior
pt: Atualizando uma Dependência de Alto Nível
zh_cn: 更新顶级依赖关系

source: Update the dependency's version in the ``[tool.poetry.dependencies]`` section of ``pyproject.toml``. Then, run the following command: ``poetry lock --no-update``.
es_mx: Actualice la versión de la dependencia en la sección ``[tool.poetry.dependencies]`` de ``pyproject.toml``. Luego, ejecute el siguiente comando: ``poetry lock --no-update``.

source: Updating Hidden Dependencies
es_mx: Actualizar dependencias ocultas
he_il: עדכון תלות נסתרת
pt: Atualizando Dependências Ocultas
zh_cn: 更新隐藏的依赖项

source: Run the following command: ``poetry lock``.
es_mx: Ejecute el siguiente comando: ``poetry lock``.

source: Install the missing MikTex packages by navigating to the frc-docs directory, then running the following command from Powershell: ``mpm --verbose --require=@miktex-packages.txt``
he_il: התקן את חבילת ה MikTex בכך שתנווט לתיקיית frc-docs ואז תריץ את הפקודה הבאה בpowershell: ``mpm --verbose --require=@miktex-packages.txt``
pt: Instale os pacotes MikTex ausentes navegando até o diretório frc-docs e, em seguida, execute o seguinte comando no Powershell: ``mpm --verbose --require=@miktex-packages.txt``
zh_cn: 通过导航到 frc-docs 目录安装缺少的 MikTex 软件包，然后在 Powershell 运行以下指令： ``mpm --verbose --require=@miktex-packages.txt``

source: Lint Check
he_il: בדיקת Lint
pt: Verificação por Linter

source: Please run ``.\make sizecheck`` to verify that all images are below 500KB. This check *will* fail CI if it fails. Exclusions are allowed on a case by case basis and are added to the ``IMAGE_SIZE_EXCLUSIONS`` list in the configuration file.
zh_cn: 请运行 ``.\make sizecheck`` 以确认所有图像都在 500KB 以下。如果失败，此检查 *will* 使 CI 失败。根据具体情况允许排除，并将其添加到配置文件中的 ``IMAGE_SIZE_EXCLUSIONS`` 列表中。

source: Ensure that Poetry is installed. Run the following command: ``pip install poetry``
zh_cn: 确保已安装诗歌。运行以下指令：``pip install poetry''

source: Add the dependency to the ``[tool.poetry.dependencies]`` section of ``pyproject.toml``. Make sure to specify an exact version. Then, run the following command: ``poetry lock --no-update``
zh_cn: 将依赖项添加到pyproject.toml的[tool.poetry.dependencies]部分。确保指定一个确切的版本。然后，运行以下指令：``poetry lock --no-update''

source: Update the dependency's version in the ``[tool.poetry.dependencies]`` section of ``pyproject.toml``. Then, run the following command: ``poetry lock --no-update``
zh_cn: 在pyproject.toml的[tool.poetry.dependencies]部分中更新依赖项的版本。然后，运行以下指令：``poetry lock --no-update''

source: Run the following command: ``poetry lock``
zh_cn: 运行以下指令：``poetry lock``
