Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/contribution-guidelines.po
Languages: es_mx, fr_ca, he_il, ja, pt, tr_tr, zh_cn

source: Sections are quite tricky, as they contain a large amount of content. We advise the author to open an `issue <https://github.com/wpilibsuite/frc-docs/issues>`__ to gather discussion before opening up a PR.
es_mx: Las secciones son bastante complicadas, ya que contienen una gran cantidad de contenido. Aconsejamos al autor que abra un `issue <https://github.com/wpilibsuite/frc-docs/issues>`__ para entablar una discusión antes de abrir un PR.
fr_ca: Les sections sont assez délicates, car elles contiennent une grande quantité de contenu. Nous conseillons à l’auteur de signaler `le problème <https://github.com/wpilibsuite/frc-docs/issues>`__ afin de recueillir des opinions avant d’ouvrir une RP.
pt: Seções podem ser bem complicadas, pois elas contem grandes quantidade de conteúdo. Recomendamos que o autor abra um `issue <https://github.com/wpilibsuite/frc-docs/issues>`__ para gerar uma discussão antes da abertura da PR
tr_tr: Bölümler, büyük miktarda içerik barındırdıkları için oldukça zordur. Yazara, bir PR açmadan önce tartışma toplamak için `<https://github.com/wpilibsuite/frc-docs/issues>` __ sayısını açmasını tavsiye ederiz.
zh_cn: 章节是相当棘手的，因为它们包含大量的内容。我们建议作者在打开PR之前先打开以“issue <https://github.com/wpilibsuite/frc-docs/issues> ' __来聚集讨论。

source: Linking Other Articles
es_mx: Vincular Otros Artículos
fr_ca: Relier d’autres articles
ja: 他の記事へのリンク
pt: Referenciando Outros Artigos
tr_tr: Diğer Makaleleri Bağlamak
zh_cn: 链接其他文章

source: In the instance that the article references content that is described in another article, the author should make best effort to link to that article upon the first reference.
es_mx: En el caso de que el artículo haga referencia a contenido que se describe en otro artículo, el autor debe hacer todo lo posible por vincular a ese artículo en la primera referencia.
fr_ca: Dans le cas où l’article fait référence au contenu décrit dans un autre article, l’auteur doit faire de son mieux pour établir un lien vers cet article dans la première référence.
ja: 記事は他の記事の内容を言及する場合、寄稿者は可能な限り最初の言及に他の記事へのリンクを張るべきです。
pt: No caso do artigo referenciar conteúdo que é descrito em outro artigo, o autor deve se esforçar para referenciar aquele artigo logo na primeira ocorrência.
tr_tr: Makalenin başka bir makalede açıklanan içeriğe atıfta bulunması durumunda, yazar ilk referansta o makaleye bağlantı vermek için elinden geleni yapmalıdır.
zh_cn: 在该文章引用另一篇文章中描述的内容的情况下，作者应尽最大努力在第一次引用时链接到该文章。

source: Imagine we have the following content in a drivetrain tutorial:
es_mx: Imagina que tenemos el siguiente contenido en un tutorial de transmisión:
fr_ca: Imaginez que nous avons le contenu suivant dans un tutoriel relatif à la base pilotable:
ja: 以下のようなドライブトレインのチュートリアルを考えてみてください：
pt: Imagine que temos o seguinte conteúdo em um tutorial de drivetrain:
tr_tr: Bir aktarma organı rehberinde aşağıdaki içeriğe sahip olduğumuzu hayal edin:
zh_cn: 想象一下，在传动系统教程中我们具有以下内容：

source: Notice how only the first instance of Simulation is linked. This is the structure the author should follow. There are times where a linked article has different topics of content. If you reference the different types of content in the article, you should link to each new reference once (except in situations where the author has deemed it appropriate otherwise).
es_mx: Observe cómo solo está vinculada la primera instancia de Simulación. Esta es la estructura que debe seguir el autor. Hay ocasiones en las que un artículo vinculado tiene diferentes temas de contenido. Si hace referencia a los diferentes tipos de contenido en el artículo, debe vincular a cada nueva referencia una vez (excepto en situaciones en las que el autor haya considerado apropiado lo contrario).
fr_ca: Notez comment seule la première instance de Simulation est liée. C’est cette structure que l’auteur doit suivre. Il y a des moments où un article est lié a différents sujets dans son contenu. Si vous référez les différents types de contenu dans l’article, vous devez lier chaque nouvelle référence une fois (sauf dans les situations où l’auteur l’a jugé autrement approprié ).
ja: 「Simulation」の初言及しかリンクされていないことを注意してください。これが寄稿者の目指すべきパターンです。リンクされた記事に、複数のトピックのコンテンツがある場合があります。記事の中で異なるタイプのコンテンツを言及する場合、それぞれの新しい言及に一度だけリンクする必要があります（ただし、寄稿者がリンク不要と判断した場合は除きます）。
pt: Perceba como apenas a primeira ocorrência de simulação é referenciado. Essa é a estrutura que o autor deve seguir. Algumas vezes o artigo referenciado tem diferentes assuntos em seu conteúdo. Se você referenciar diferentes assuntos daquele artigo, você deve referenciar cada nova ocorrência apenas uma vez ( exceto em casos onde o autor considerar adequado o contrário).
tr_tr: Simulation'ın yalnızca ilk örneğinin nasıl bağlantılı olduğuna dikkat edin. Yazarın izlemesi gereken yapı budur. Bağlantılı bir makalenin farklı içerik konularına sahip olduğu durumlar vardır. Makalede farklı içerik türlerine atıfta bulunuyorsanız, her yeni referansa bir kez bağlantı vermelisiniz (yazarın aksini uygun gördüğü durumlar hariç).
zh_cn: 请注意如何只链接Simulation的第一个实例，这是作者应遵循的结构。有时链接文章的内容主题不同。如果您引用了本文中不同类型的内容，则应链接到每个新引用一次（除非作者认为其他情况适当）。

source: Welcome to the contribution guidelines for the frc\ |reg|-docs project. If you are unfamiliar to writing in the reStructuredText format, please read up on it `here <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`__.
es_mx: Bienvenido a las pautas de contribución para el proyecto frc\ |reg|-docs. Si no está familiarizado con la escritura en el formato reStructuredText, lea sobre él `aquí <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`__.
he_il: ברוכים הבאים להנחיות התרומה של פרוייקט frc-docs. אם אינכם מכירים את הכתיבה בפורמט reStructuredText, אנא קראו עליו `כאן <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`__.
pt: Bem Vindo(a) às instruções de contribuição do projeto frc\ |reg|-docs . Se você não tem familiaridade em escrever no formato reStructuredText, por favor leia sobre isso `aqui <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`__.
tr_tr: Frc\ |reg|-docs projesi için katkı sağlama yönergelerine hoş geldiniz. ReStructuredText biçiminde yazmaya aşina değilseniz, lütfen `buradan <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`__ gerekli bölümü okuyun.
zh_cn: 欢迎来到 frc\ |reg|-docs 项目的捐款指南。如果您不熟悉在 reStructuredText 版式上写，请仔细阅读 `here <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`__

source: During Season: - Commit made to ``main`` branch
zh_cn: 在赛季中：-提交到“主要”分支

source: End of Season: - Repository is tagged with year, for archival purposes
zh_cn: 赛季末: - Repository被标签上年份方便存储

source: Off-Season: - ``stable`` branch is locked to the last on-season commit - Commit made to ``main`` branch
zh_cn: 在季后赛中：-“稳定”分支被锁定到最后一个季节性提交-对“主要”分支进行的提交
