Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/contribution-guidelines.po
Languages: es_mx, fr_ca, he_il, ja, pt, tr_tr, zh_cn

source: Contribution Guidelines
es_mx: Guías de Contribución
fr_ca: Instructions concernant les contributions
he_il: הנחיות תרומה
ja: 寄稿要領
pt: Diretrizes de Contribuição
tr_tr: Katkı Yönergeleri
zh_cn: 文档贡献规则

source: Welcome to the contribution guidelines for the frc-docs project. If you are unfamiliar to writing in the reStructuredText format, please read up on it `here <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`__.
fr_ca: Bienvenue à la section Instructions concernant les contributions du projet frc-docs. Si vous ne connaissez pas le format d'écriture reStructuredText, informez-vous `ici (voa) <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`__.

source: *FIRST*\ |reg| retains all rights to documentation and images provided. Credit for articles/updates will be in the `GitHub commit history. <https://github.com/wpilibsuite/frc-docs/graphs/commit-activity>`_
es_mx: *FIRST*\ |reg| conserva todos los derechos sobre la documentación y las imágenes proporcionadas. El crédito por artículos / actualizaciones estará en `GitHub commit history. <https://github.com/wpilibsuite/frc-docs/graphs/commit-activity>`_
fr_ca: *FIRST*\ |reg| conserve tous les droits sur la documentation et les images fournies. Le crédit pour les articles/mises à jour sera accessible dans `GitHub commit history. <https://github.com/wpilibsuite/frc-docs/graphs/commit-activity>`_
he_il: *FIRST*\ |reg| שומרת לעצמה על כל הזכויות לתיעוד ולתמונות הניתנות. הקרדיט למאמרים/עדכונים יהיה `בהיסטורית ה-Commits ב-GitHub <https://github.com/wpilibsuite/frc-docs/graphs/commit-activity>`_.
ja: 提供された文書や画像に関するすべての権利は *FIRST*\ |reg| が保有します。記事やアップデートのクレジットは、 `GitHubのコミット履歴 <https://github.com/wpilibsuite/frc-docs/graphs/commit-activity>`__ で確認することができます。
pt: *FIRST*\ |reg| retém todos os direitos de documentação e imagens fornecidas. O crédito dos artigos/atualizações estará no `histórico de commits do GitHub. <https://github.com/wpilibsuite/frc-docs/graphs/commit-activity>`_
tr_tr: *FIRST*\ |reg| sağlanan belgelere ve görüntülere ilişkin tüm hakları saklı tutar. Makaleler/güncellemeler için kredi `GitHub commit history. <https://github.com/wpilibsuite/frc-docs/graphs/commit-activity>`_ de olacaktır.
zh_cn: *FIRST*\ |reg| 保留被提供文档和图像的所有的权利。文章 / 更新 的积分将记录在 `GitHub commit history. <https://github.com/wpilibsuite/frc-docs/graphs/commit-activity>`_

source: Mission Statement
es_mx: Misión
fr_ca: Mission
he_il: הצהרת משימה
ja: ミッション・ステートメント
pt: Declaração de Missão
tr_tr: Görev Tanımı
zh_cn: 使命宣言

source: The WPILib Mission is to enable *FIRST* Robotics teams to focus on writing game-specific software rather than focusing on hardware details - "raise the floor, don't lower the ceiling". We work to enable teams with limited programming knowledge and/or mentor experience to be as successful as possible, while not hampering the abilities of teams with more advanced programming capabilities. We support Kit of Parts control system components directly in the library. We also strive to keep parity between major features of each language (Java, C++, and NI's LabVIEW), so that teams aren't at a disadvantage for choosing a specific programming language.
es_mx: La misión de WPILib es hace posible a los equipos de *FIRST* Robotics concentrarse en el desarrollo de software específico para el juego en vez de centrar su atención en detalles de hardware. Trabajamos para ayudar a los equipos con conocimientos de programación limitados y/o experiencia de sus mentores a ser tan exitosos como sea posible, sin obstaculizar las habilidades de los equipos con capacidades mayores de programación. Tenemos soporte directo en nuestras librerías de los componentes del sistema de control del Kit of Parts. También nos esforzamos al máximo para mantener una paridad entre las características principales de cada lenguaje (Java, C++ y LabVIEW), para que los equipos no tengan desventaja alguna al escoger su lenguaje de programación.
fr_ca: La mission de WPILib est de permettre *aux équipes de la Compétition de robotique FIRST* de se concentrer à rédiger du code lié au jeu de la saison plutôt que de se buter à des détails techniques - "élever le plancher sans abaisser le plafond". Nous voulons permettre aux équipes avec peu de connaissances en programmation ou sans l'expertise de mentors de performer autant que possible, sans gêner les prouesses d'équipes avec plus de ressources avancées en matière de programmation. Les ressources concernant les composantes du système de contrôle du Kit de pièces se trouvent directement dans la bibliothèque. Nous tentons également de pourvoir équitablement les caractéristiques principales de chaque langage (Java, C++, et LabVIEW de NI), de telle sorte qu'il n'y ait pas de désavantage pour les équipes à choisir un langage plus qu'un autre.
he_il: המשימה של WPILib היא לאפשר לקבוצות *FIRST* להתמקד בכתיבת התוכנה הספציפית למשחק במקום להתמקד בפרטי החומרה - ״הרימו את הרצפה, אל תנמיכו את התקרה״. אנו פועלים כדי לאפשר לקבוצות בעלי ידע מוגבל בתכנות ו/או נסיון מנטורים מוגבל להצליח ככל האפשר, ללא פגיעה ביכולות של קבוצות בעלות יכולות תכנות מתקדמות יותר. אנו תומכים במרכיבי מערכת הבקרת של ה-Kit of Parts ישירות בספריה. אנו שואפים לשמור על שוויון בין התכונות העיקריות של כל שפה (Java, C++, ו-LabVIEW של NI), כך שלא יהיה חיסרון לקבוצות בבחירת שפת תכנות ספציפית.
ja: WPILibのミッションは、 *FIRST* のロボッティクスチームがハードウェアの細部にこだわるのではなく、ゲームに特化したソフトウェアの開発に集中できるようにすること、つまり「床を上げ、天井を下げない」ということです。プログラミングの知識や指導者の経験が少ないチームでも、可能な限り成功できるように、また、より高度なプログラミング能力を持つチームの能力を妨げないように取り組んでいます。Kit of Parts の制御系コンポーネントをライブラリで直接サポートしています。また、FRCでのサポートされている各言語（Java、C++、NI LabVIEW）の主要な機能が同等であるように努め、特定のプログラミング言語を選択したことでチームが不利にならないようにします。
pt: A Missão da WPILib é permitir que as equipes da *FIRST* Robotics se concentrem em escrever software específico para jogos ao invés de se concentrar em detalhes de hardware - "eleve o chão, não abaixe o teto". Trabalhamos para permitir que equipes com conhecimento de programação limitado e/ou com experiência de mentor tenham o maior sucesso possível, sem prejudicar as habilidades de equipes com capacidade de programação mais avançada. Oferecemos suporte aos componentes do sistema de controle do Kit of Parts diretamente na biblioteca. Nós também nos esforçamos para manter a paridade entre os principais recursos de cada linguagem (Java, C++ e LabVIEW da NI), para que as equipes não fiquem em desvantagem ao escolher uma linguagem de programação específica.
tr_tr: WPILib Misyonu, *FIRST* Robotik ekiplerinin donanım detaylarına odaklanmak yerine oyuna özel yazılım yazmaya odaklanmasını sağlamaktır - "tavanı alçaltmayın, zemini yükseltin". Sınırlı programlama bilgisine ve/veya mentor deneyimine sahip ekiplerin, daha gelişmiş programlama yeteneklerine sahip ekiplerin yeteneklerini engellemeden olabildiğince başarılı olmasını sağlamak için çalışıyoruz. Kit of Parts kontrol sistemi bileşenlerini doğrudan kütüphane ile destekliyoruz. Ekiplerin belirli bir programlama dili seçerken dezavantajlı durumda kalmaması için her dilin (Java, C ++ ve NI's LabVIEW) ana özellikleri arasında eşitlik sağlamaya da çalışıyoruz.
zh_cn: WPILib 的任务是让 *FIRST* 机器人团队专注于编写游戏专用软件，而不是专注于硬件细节—— "raise the floor, don't lower the ceiling" 。我们致力于使具有有限编程知识和/或指导经验的团队尽可能成功，同时不妨碍具有更高级编程能力的团队的能力。我们在库中直接支持零件控制系统组件套件。我们还努力保持每个语言（java，C++，和 NI 的 LabVIEW）的主要特征之间的奇偶性，这样团队就不会因为选择特定的编程语言而处于不利的地位。

source: These docs serve to provide a learning ground for all *FIRST* Robotics Competition teams. Contributions to the project must follow these core principles.
es_mx: Estos documentos sirven para proporcionar un campo de aprendizaje para todos los equipos de *FIRST* Robotics Competition. Las contribuciones al proyecto deben seguir estos principios básicos.
fr_ca: Ces documents constituent un apprentissage de base pour toutes les équipes en Compétition de robotique *FIRST*. Toute contribution au projet doit respecter les principes suivants.
he_il: מסמכים אלו משמשים כבסיס למידה לכל קבוצות *FIRST* Robotics Competition. על התרומות לפרויקט להיות בהתאם לעקרונות הליבה הללו.
ja: これらのドキュメントは、すべての *FIRST* Robotics Competition のチームに学びの場を提供しています。プロジェクトへの寄稿は、これらの基本原則に従わなければなりません。
pt: Esses documentos servem para fornecer um campo de aprendizagem para todas as equipes da *FIRST* Robotics Competition. As contribuições para o projeto devem seguir estes princípios básicos.
tr_tr: Bu belgeler, tüm *FIRST* Robotics Competition ekipleri için bir öğrenme alanı sağlamaya hizmet eder. Projeye yapılacak katkılar bu temel ilkeleri takip etmelidir.
zh_cn: 这些文档为所有 *FIRST* 机器人竞赛团队提供了一个学习场所。对该项目的捐赠必须遵循这些核心原则。

source: Community-led documentation. Documentation sources are hosted publicly and the community are able to make contributions
es_mx: Documentación dirigida por la comunidad. Las fuentes de la documentación se alojan públicamente y la comunidad puede hacer contribuciones.
fr_ca: Une documentation issue de la communauté. Les sources sont disponibles publiquement et la communauté peut y contribuer.
he_il: תיעוד מונחה קהילה. קוד המקור של התיעוד מתארח בפומבי והקהילה יכולה לבצע תרומות
ja: コミュニティー主導のドキュメント：ドキュメントの出所は公開でホストされ、コミュニティーが寄稿することができます。
pt: Documentação liderada pela comunidade. As fontes de documentação são hospedadas publicamente e a comunidade pode fazer contribuições
tr_tr: Topluluk liderliğindeki belgeler. Belge kaynakları halka açık olarak barındırılır ve topluluk katkı sağlayabilir
zh_cn: 社区主导的文档。文档来源是公开托管的，社区可以参与捐赠

source: Structured, well-formatted, clean documentation. Documentation should be clean and easy to read, from both a source and release standpoint
es_mx: Documentación estructurada, con buen formato, y limpia. La documentación debe ser limpia y fácil de leer, tanto desde el punto de vista de la fuente como de la versión.
fr_ca: Une documentation structurée, mise en page adéquatement et concise. La documentation doit être concise et facile à lire, tant du point de vue rédaction que diffusion.
he_il: תיעוד מאורגן, מעוצב ונקי. התיעוד צריך להיות נקי וקל לקריאה, הן מהמקור והן מצד התוצר
ja: 構造化された・整った・綺麗なドキュメント。ドキュメントはソースとリリースの両方でも、きれいで読みやすいものであるべきです。
pt: Documentação estruturada, bem formatada e limpa. A documentação deve ser limpa e fácil de ler, tanto do ponto de vista da fonte quanto o da versão lançada
tr_tr: Yapılandırılmış, iyi biçimlendirilmiş, temiz belgeler. Dokümantasyon hem kaynak hem de yayın açısından temiz ve okunması kolay olmalıdır.
zh_cn: 结构化、格式好、清晰的文档。从源代码和发布的角度来看，文档应该是干净且易于阅读的

source: Relevant. Documentation should be focused on the *FIRST* Robotics Competition.
es_mx: Relevante. La documentación debe centrarse en el *FIRST* Robotics Competition.
fr_ca: Pertinence. La documentation doit porter sur la Compétition de robotique *FIRST* .
he_il: רלוונטי. על התיעוד להתמקד ב-*FIRST* Robotics Competition
ja: 関連性を保つ：ドキュメントは *FIRST* Robotics Competition に注目すべきです。
pt: Relevante. A documentação deve ser focada na *FIRST* Robotics Competition.
tr_tr: İlgi. Belgeler, *FIRST* Robotics Competition'a odaklanmalıdır.
zh_cn: 息息相关。文档应该集中注意在* FIRST *机器人大赛上。

source: Please see the :ref:`docs/contributing/frc-docs/style-guide:Style Guide` for information on styling your documentation.
es_mx: Consulte :ref:`el Guía de Estilo <docs/contributing/frc-docs/style-guide:Style Guide>` para obtener información sobre cómo diseñar su documentación.
fr_ca: Consultez :ref:`docs/contributing/frc-docs/style-guide:Style Guide` concernant la mise en forme des documents.
he_il: אנא עיינו במסמך :ref:`docs/contributing/frc-docs/style-guide:Style Guide` למידע על עיצוב סגנון התיעוד.
ja: スタイルについては、 :ref:`docs/contributing/frc-docs/style-guide:Style Guide` をご覧ください。
pt: Por favor, veja o :ref:`docs/contributing/frc-docs/style-guide:Style Guide` para informações sobre como estilizar sua documentação.
tr_tr: Belgelerinizin stiliyle ilgili bilgi için lütfen :ref:`docs/contributing/frc-docs/style-guide:Style Guide`a bakın.
zh_cn: 查阅:ref:`docs/contributing/frc-docs/style-guide:Style Guide`了解如何规范化您的文档。

source: Release Process
es_mx: Proceso de liberación
fr_ca: Processus de révision
ja: リリースプロセス
pt: Processo de Lançamento
tr_tr: Yayınlama İşlemi
zh_cn: 发布过程

source: frc-docs uses a special release process for handling the main site ``/stable/`` and the development site ``/latest/``. This flow is detailed below.
es_mx: frc-docs utiliza un proceso de liberación especial para manejar el sitio principal ``/stable/`` y el sitio de desarrollo ``/latest/``. Este flujo se detalla a continuación.
fr_ca: frc-docs utilise un processus de révision spécial pour la gestion du site principal ``/stable/`` et du site de développement ``/latest/``. Ce flux est détaillé ci-dessous.
ja: frc-docsはメインサイト ``/stable/`` と開発サイト ``/latest/`` を別々に処理するための特化したリリースプロセスを使います。プロセスの詳しくは以下の通りです。
pt: frc-docs usa um processo de lançamento especial para lidar com o site principal ``/stable/`` e o site de desenvolvimento ``/latest/``. O fluxo desse processo é detalhado abaixo.
tr_tr: frc-docs, ana sayfa ``/stable/`` ve geliştirme sayfası ``/latest/`` nı yönetmek için özel bir yayınlama işlemi kullanır. Bu akış aşağıda detaylandırılmıştır.
zh_cn: frc-docs使用特殊的发行过程来处理主站点``/ stable /''和开发站点``/ latest /''。该流程将在下面详细说明。

source: During Season:
es_mx: Durante la temporada:
fr_ca: Pendant la saison:
ja: シーズン中：
pt: Durante a Temporada:

source: Commit made to ``main`` branch
es_mx: Commit hecho en la rama ``main``
fr_ca: Validation (commit) effectuée sur la branche ``main``
ja: ``main`` ブランチへのコミット
pt: Commit é feito para o branch ``main``

source: Updates ``/stable/`` and ``/latest/`` on the website
es_mx: Actualiza ``/stable/`` y ``/latest/`` en el sitio web
fr_ca: Mises à jour ``/stable/`` et ``/latest/`` sur le site web
ja: ウェブサイトで ``/stable/`` と ``/latest/`` が更新されます
pt: Atualiza ``/stable/`` e ``/latest/`` no site
tr_tr: ``/stable/`` ve ``/latest/`` websitesinde güncellendi
zh_cn: 更新网站上的 ``/stable/``和``/latest/``

source: End of Season:
es_mx: Fin de la temporada:
fr_ca: À la fin de la saison:
ja: シーズン終了：
pt: Fim da Temporada:

source: Repository is tagged with year, for archival purposes
es_mx: El repositorio está etiquetado con el año, para propósitos de archivo.
fr_ca: Le référentiel est étiqueté avec l'année, à des fins d'archivage
ja: レポジトリーは、アーカイブのため、ゲーム年でタグされます。
pt: Repositório é marcado com um ano, para propósitos de arquivamento

source: Off-Season:
fr_ca: Hors-saison:
ja: オフシーズン：
tr_tr: Sezon Dışı :

source: ``stable`` branch is locked to the last on-season commit
es_mx: La rama ``stable`` se bloquea con el ultimo commit hecho en temporada
fr_ca: La branche ``/stable/`` est verrouillée sur le dernier commit de la saison
ja: ``stable`` ブランチは、シーズンの最後のコミットで保持されます
pt: branch ``stable`` é bloqueado no último commit feito ainda na temporada

source: Only updates ``/latest/`` on the documentation site
es_mx: Sólo se actualiza ``/latest/`` en el sitio de documentación
fr_ca: Seules les mises à jour ``/latest/`` sur le site de documentation
ja: ドキュメントサイトの ``/latest/`` のみが更新されます。
pt: Apenas atualiza ``/latest/`` no site da documentação
tr_tr: Sadece dokümantasyon sitesinde ``/latest/`` güncellenir
zh_cn: 指更新文档站点中的``/latest/``

source: Creating a PR
es_mx: Creando un PR
fr_ca: Création d’un PR
ja: PRの作成方法
pt: Criando uma PR
tr_tr: PR yaratma
zh_cn: 创建一个PR

source: PRs should be made to the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repo on GitHub. They should point to the ``main`` branch and *not* ``stable``.
es_mx: Los PRs deben hacerse en el repositorio `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ en GitHub. Deben apuntar a la rama ``main`` y *no* a ``stable``.
fr_ca: Les PR doivent être envoyés au référentiel `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repo on GitHub. sur GitHub. Ils doivent pointer vers la branche ``principale`` et non celle ``stable``.
pt: PRs devem ser feitas em ao repositório `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ no GitHub. Elas devem ser feitas na branch ``main`` e *não* na ``stable``.
zh_cn: 应该在GitHub上的`frc-docs <https://github.com/wpilibsuite/frc-docs>`__仓库中进行PR。它们应指向“ main”分支，并指向“ not”“ stable”。

source: Creating New Content
es_mx: Crear Contenido Nuevo
fr_ca: Création de nouveaux contenus
ja: 新しいコンテンツの作成
pt: Criando Conteúdo Novo
tr_tr: Yeni İçerik Yaratma
zh_cn: 增加新内容

source: Thanks for contributing to the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ project! There are a couple things you should know before getting started!
es_mx: ¡Gracias por contribuir al proyecto `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ ! ¡Hay algunas cosas que debería saber antes de iniciar!
fr_ca: Merci d’avoir contribué au projet `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ Il y a deux ou trois choses que vous devriez savoir avant de commencer!
pt: Obrigado por contribuir para o projeto `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ ! Existem algumas coisas que você deve saber antes de começar!
tr_tr: `frc-docs <https://github.com/wpilibsuite/frc-docs>` __ projesine katkıda bulunduğunuz için teşekkür ederiz! Başlamadan önce bilmeniz gereken birkaç şey var!
zh_cn: 感谢您为`frc-docs <https://github.com/wpilibsuite/frc-docs>`__项目做出贡献！开始之前，希望您了解下几件事！

source: Where to place articles?
es_mx: ¿Dónde colocar los artículos?
fr_ca: Où placer les articles?
ja: 記事の配置は？
pt: Onde colocar os artigos?
tr_tr: Makaleler nereye yerleştirilir?
zh_cn: 文章放在哪呢?

source: The location for new articles can be a pretty opinionated subject. Standalone articles that fall well into an already subject category should be placed into mentioned subject category (documentation on something about simulation should be placed into the simulation section). However, things can get pretty complicated when an article combines or references two separate existing sections. In this situation, we advise the author to open an issue on the repository to get discussion going before opening the PR.
es_mx: La ubicación de los nuevos artículos puede ser un tema bastante obstinado. Los artículos independientes que caen bien en una categoría de tema ya deben colocarse en la categoría de tema mencionada (la documentación sobre algo sobre simulación debe colocarse en la sección de simulación). Sin embargo, las cosas pueden complicarse bastante cuando un artículo combina o hace referencia a dos secciones existentes separadas. En esta situación, recomendamos al autor que abra un número en el repositorio para iniciar la discusión antes de abrir el PR.
fr_ca: L’emplacement pour de nouveaux articles peut être un sujet très discutable. Les articles autonomes qui entrent bien dans une catégorie déjà soumise devraient être placés dans la catégorie des sujets mentionnés (la documentation sur un sujet relatif à la simulation devrait être placée dans la section simulation). Cependant, les choses peuvent devenir assez compliquées quand un article combine ou fait référence à deux sections existantes distinctes. Dans ce cas, nous conseillons à l’auteur d’ouvrir une question sur le dépôt pour faire en sorte que l'on puisse en discuter avant d’ouvrir le PR.
ja: 新しい記事の位置は、かなり議論になるところです。すでにある主題のカテゴリーにうまく当てはまる独立した記事は、言及された主題のカテゴリーに置かれるべきです（例：シミュレーションに関するドキュメントは、シミュレーションのセクションに置かれるべきです）。しかし、記事が別々のセクションを組み合わせたり、参照したりする場合は、かなり複雑になることがあります。このような場合、PRを作成する前に、寄稿者がレポジトリでIssueを作成し、議論を行うことをお勧めします。
pt: A localização de novos artigos pode ser um tema controverso. Artigos isolados que se encaixam bem em uma categoria devem ser colocados na respectiva categoria (documentação de algo sobre simulação deve ser colocado na seção de simulação). Porém, as coisas podem ficar complicadas quando um artigo combina ou faz referência a duas seções distintas. Nessa situação, recomendamos ao autor que abra um *issue* no repositório, para gerar uma discussão antes da abertura da PR.
tr_tr: Yeni makalelerin konumu oldukça tartışılabilir bir konu olabilir. Halihazırda bir konu kategorisine giren bağımsız makaleler, belirtilen konu kategorisine yerleştirilmelidir (simülasyonla ilgili belgeler simülasyon bölümüne yerleştirilmelidir). Bununla birlikte, bir makale mevcut iki ayrı bölümü birleştirdiğinde veya bunlara atıfta bulunduğunda işler oldukça karmaşık hale gelebilir. Bu durumda, PR'ı açmadan önce tartışmayı başlatmak için yazara havuzda bir konuyu tema seçmesini tavsiye ederiz.
zh_cn: 新文章的位置可能是一个很主观的问题。属于现存主题分类的独立文章应放在提及的主题类别中（有关模拟的文档应放在模拟部分中）。但是，当文章结合或引用两个单独的现有部分时，事情可能会变得非常复杂。在这种情况下，我们建议作者在打开PR之前先在存储库中打开一个repository，以进行讨论。

source: All new articles will undergo a review process before being merged into the repository. This review process will be done by members of the WPILib team. New Articles must be on official *FIRST* supported Software and Hardware. Documentation on unofficial libraries or sensors *will not* be accepted. This process may take some time to review, please be patient.
es_mx: Todos los artículos nuevos se someterán a un proceso de revisión antes de fusionarse en el repositorio. Este proceso de revisión será realizado por miembros del equipo de WPILib. Los nuevos artículos deben ser sobre software y hardware oficial compatible con *FIRST*. La documentación sobre bibliotecas o sensores no oficiales *no* será aceptada. Este proceso puede tomar tiempo de revisar, por favor sea paciente.
fr_ca: Toutes les nouvelles publications seront soumises à un processus de révision avant d'être intégrées. Le processus de révision est assuré par des membres de l'équipe WPILib. Les nouvelles publications doivent porter sur les équipements ou les logiciels officiellement reconnus par *FIRST*. De la documentation portant sur des bibliothèques ou des capteurs non officiels "ne sera pas" acceptée. Le processus peut prendre un certain temps; soyez patient.
he_il: כל המאמרים החדשים יעברו תהליך בדיקה לפני מיזוגם ל-Repository. תהליך הבדיקה ייעשה על ידי חברי צוות WPILib. מאמרים חדשים חייבים להיות נתמכים רשמית על ידי *FIRST* בתוכנה ובחומרה. תיעוד על ספריות או חיישנים לא רשמיים *לא יתקבל*. תהליך הבדיקה עשוי לקחת זמן מה, אנא התאזרו בסבלנות.
ja: 全ての新しい記事は、レポジトリにマージされる前に、WPILibのチームメンバーに審査が行われます。記事は、*FIRST* での公式サポートされているソフトウエアとハードウエアに集中する必要があります。非公式のセンサーやソフトウエアライブラリーについてのドキュメントは *受け取れません* 。審査には少し時間がかかりますので、お待ち下さい。
pt: Todos os novos artigos passarão por um processo de revisão antes de serem integrados ao repositório. Esse processo de revisão será feito por membros da equipe WPILib. Novos Artigos devem ser sobre software e hardware com suporte oficial *FIRST*. Documentação em bibliotecas ou sensores não oficiais *não* serão aceitos. Esse processo pode levar algum tempo para ser revisado, por favor seja paciente.
tr_tr: Tüm yeni makaleler arşivle birleştirilmeden önce bir inceleme sürecinden geçecektir. Bu inceleme süreci WPILib ekibinin üyeleri tarafından yapılacaktır. Yeni Makaleler resmi *FIRST* destekli Yazılım ve Donanım üzerinde olmalıdır. Resmi olmayan kitaplıklar veya sensörler ile ilgili belgeler *kabul edilmeyecektir*. Bu incelemenin tamamlanması biraz zaman alabilir, lütfen sabırlı olun.
zh_cn: 所有新文章在合并到repository之前都将经过审核过程。审核过程将由WPILib团队的成员来完成。新文章必须在受* FIRST *支持的官方软件和硬件上。 关于非官方图书馆或传感器的文件不会被接受。该过程可能需要一些时间进行审核，请耐心等待。

source: Where to place sections?
es_mx: ¿Dónde colocar las secciones?
fr_ca: Où placer les sections?
ja: セクションの配置は？
pt: Onde colocar seções?
tr_tr: Bölümler nereye yerleştirilir?
zh_cn: 在哪里放置章节?
