Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/style-guide.po
Languages: es_mx, fr_ca, he_il

source: Draw.io files follow almost the same naming scheme as normal images. To keep track of files that have the embedded ``.drawio`` metadata, append a ``.drawio`` to the end of the file name, before the extension, meaning the name of the file should be ``document-title-1.drawio.svg`` and so on. Additionally, diagrams should be stored in the document directory in a sub-folder named ``diagrams``.
es_mx: Los archivos Draw.io siguen casi el mismo esquema de nombres que las imágenes normales. Para llevar un registro de los archivos que tienen los metadatos ``.drawio`` incrustados, agrega un ``.drawio`` al final del nombre del archivo, antes de la extensión, lo que significa que el nombre del archivo debe ser ``document-title-1.drawio.svg`` y así sucesivamente. Además, los diagramas deben ser almacenados en el directorio de documentos en una subcarpeta llamada ``diagramas``.
fr_ca: Les fichiers Draw.io suivent presque le même schéma de nomenclature que les images normales. Pour garder la trace des fichiers contenant les métadonnées ``.drawio`` intégrées, ajoutez un ``.drawio`` à la fin du nom de fichier mais avant l'extension, ce qui signifie que le nom du fichier doit être ``document-title-1.drawio.svg`` etc. De plus, les croquis ou diagrammes doivent être stockés dans le répertoire du document, dans un sous-dossier nommé ``diagrams``.
he_il: קבצי Draw.io זהים לתבנית השמות של התמונות הרגילות. כדי לעקוב אחר קבצים עם מטא-דאטה ``.drawio``, הוסיפו ``.drawio`` לסוף שם הקובץ, לפני הסיומת, לדוגמא ``document-title-1.drawio.svg``. בנוסף, יש לאחסן דיאגרמות בספריית המסמכים בתיקיית משנה בשם ``diagrams``.

source: For the specifics of saving a diagram as a ``.svg`` with metadata, take a look at :ref:`docs/contributing/frc-docs/drawio-saving-instructions:Draw.io Saving Instructions`.
es_mx: Para los detalles de guardar un diagrama como un ``.svg`` con metadatos, echa un vistazo a :ref:`docs/contributing/frc-docs/drawio-saving-instructions:Draw.io Saving Instructions`.
fr_ca: Pour les détails concernant la sauvegarde d'un croquis ou diagramme en tant que ``.svg`` avec des métadonnées, consultez :ref:`docs/contributing/frc-docs/drawio-saving-instructions:Draw.io Saving Instructions`.
he_il: לקבלת הפרטים על שמירת דיאגרמה כ- ``.svg`` עם מטא-דאטה, עיינו במסמך :ref:`docs/contributing/frc-docs/drawio-saving-instructions:Draw.io Saving Instructions`.

source: Make sure you don't modify any file that is in a ``diagrams`` folder, or ends in ``.drawio.svg`` in any program other than draw.io, otherwise you might risk breaking the metadata of the file, making it uneditable.
es_mx: Asegúrate de que no modificas ningún archivo que esté en una carpeta ``diagramas``, o que termine en ``.drawio.svg`` en cualquier otro programa que no sea draw.io, de lo contrario podrías arriesgarte a romper los metadatos del archivo, haciéndolo ineditable.
fr_ca: Ne modifiez aucun fichier du dossier ``diagrams`` ou se terminant par ``.drawio.svg`` avec un programme autre que draw.io, sinon vous risquez d'endommager les métadonnées du fichier, ce qui le rendrait inutilisable.
he_il: הקפידו לא לערוך שום קובץ שנמצא בתיקיית ``diagrams`` או מסתיים ב-``.drawio.svg``, בכל תוכנית אחרת שאינה draw.io, אחרת אתם עלולים להסתכן בשבירת המטא-דאטה של הקובץ, מה שיהפוך אותו לבלתי ניתן לעריכה.

source: File Extensions
fr_ca: Extensions de fichiers
he_il: סיומות הקבצים

source: File extensions should use code formatting. For example, use:
fr_ca: Les extensions de fichiers doivent utiliser la mise en forme du code. Par exemple, utilisez :
he_il: סיומות קבצים צריכות להשתמש בעיצוב קוד. לדוגמה, השתמשו ב:

source: instead of:
fr_ca: Au lieu de:
he_il: במקום:

source: Table of Contents (TOC)
es_mx: Tablas de contenido (TDC)
fr_ca: Table des matières (TOC)
he_il: תוכן עניינים

source: Each category should contain an ``index.rst``. This index file should contain a ``maxdepth`` of ``1``. Sub-categories are acceptable, with a ``maxdepth`` of 1.
es_mx: Cada categoría debe contener un "índice.rst". Este archivo de índice debe contener una "profundidad máxima" de "1". Las subcategorías son aceptables, con una ``profundidad máxima`` de 1.
fr_ca: Chaque catégorie doit contenir un ``index.rst``. Ce fichier d'index doit avoir une profondeur ``maxdepth`` de ``1``. Les sous-catégories sont acceptables, avec une profondeur maximale ``maxdepth`` de 1.
he_il: כל קטגוריה צריכה להכיל ``index.rst``. קובץ index זה צריך להכיל ``maxdepth`` של ``1``. תתי קטגוריות מקובלים, עם ``maxdepth`` של 1.

source: The category ``index.rst`` file can then be added to the root index file located at ``source/index.rst``.
fr_ca: Le fichier ``index.rst`` de catégorie peut être ajouté au fichier index de la racine dans ``source/index.rst``.

source: Examples
es_mx: Ejemplos
fr_ca: Exemples
he_il: דוגמאות

source: Important Note!
es_mx: ¡Nota importante!
fr_ca: Notes importantes!
he_il: הערה חשובה!

source: This list is not exhaustive and administrators reserve the right to make changes. Changes will be reflected in this document.
es_mx: Esta lista no es exhaustiva y los administradores se reservan el derecho de hacer cambios. Los cambios se reflejarán en este documento.
fr_ca: Cette liste n'est pas exhaustive et les administrateurs se réservent le droit de la modifier. Les modifications seront identifiées dans ce document.
he_il: רשימה זו אינה ממצה והמנהלים שומרים לעצמם את הזכות לבצע שינויים. שינויים יבואו לידי ביטוי במסמך זה.

source: This document contains the various RST/Sphinx specific guidelines for the frc-docs project. For guidelines related to the various WPILib code projects, see `the WPILib GitHub <https://github.com/wpilibsuite/styleguide>`__
he_il: מסמך זה מכיל את ההנחיות הספציפיות של RST/Sphinx לפרויקט frc-docs. להנחיות הקשורות לפרויקטי קוד WPILib השונים, ראו את `ה-GitHub של WPILib <https://github.com/wpilibsuite/styleguide>`__

source: If you are having issues editing files with the ``.rst`` extension, the recommended text editor is `Notepad++ <https://notepad-plus-plus.org/>`__. Please make sure that `tabs are replaced with spaces <https://stackoverflow.com/questions/455037/convert-tabs-to-spaces-in-notepad>`__, and the space indentation is set to ``3``.
es_mx: Si tiene problemas para editar archivos con la extensión ``.rst``, el editor de texto recomendado es `Notepad++ <https://notepad-plus-plus.org/>` __. Asegúrese de que `las tabuladores se reemplacen con espacios <https://stackoverflow.com/questions/455037/convert-tabs-to-spaces-in-notepad>` __, y la sangría se establece en ``3`` espacios.
he_il: במידה ואתם נתקלדים בבעיות בעריכת קבצים עם הסיומת ``.rst``, עורך הטקסט המומלץ הוא `Notepad++ <https://notepad-plus-plus.org/>`__. אנא וודא כי אתם `מחליפים טאבים ברווחים <https://stackoverflow.com/questions/455037/convert-tabs-to-spaces-in-notepad>`__ ומשתמשים בהזחה של ``3`` רווחים.

source: Page References
es_mx: Referencias de Páginas
he_il: התייחסות לדפים

source: Pages references will be auto-generated based on the page filename and section title.
es_mx: Las referencias de página se generarán automáticamente según el nombre de archivo de la página y el título de la sección.
he_il: התייחסויות לדפים ייווצרו אוטומטית בהתבסס על שם קובץ הדף וכותרת הקטע.

source: For example, given the following file ``contributing.rst`` and a section called ``Page References``, you would reference this by doing ``:ref:`contributing:Page References```
es_mx: Por ejemplo, dado el siguiente archivo ``contributing.rst`` y una sección llamada ``Referencias de Página``, puede hacer una referencia a esto con ``: ref:`contributing:Page References```
he_il: לדוגמא, בהתחשב בקובץ הבא ``contributing.rst`` ובקטע שנקרא ``Page References``, ניתן להתייחס לכך על ידי: ``:ref:`contributing:Page References```.

source: All text content should be on the same line, if you need readability, use the word-wrap function of your editor.
es_mx: Todo el contenido de texto debe estar en la misma línea. Si necesita legibilidad, use la función de ajuste de línea de su editor.
he_il: כל תוכן הטקסט צריך להיות באותה שורה, אם אתם זקוקים לקריאות, השתמשו בפונקציית גלישת המילים של העורך שלך.

source: Use of the registered trademarks *FIRST*\ |reg| and FRC\ |reg| should follow the Policy from `this page <https://www.firstinspires.org/brand>`__. Specifically, where possible (i.e. not nested inside other markup or in a document title), the first use of the trademarks should have the |reg| symbol and all instances of *FIRST* should be italicized. The |reg| symbol can be added by using ``.. include:: <isonum.txt>`` at the top of the document and then using ``*FIRST*\ |reg|`` or ``FRC\ |reg|``.
es_mx: El uso de las marcas registradas *FIRST*\ |reg| y FRC\ |reg| debe seguir la Política de `esta página <https://www.firstinspires.org/brand>`__. Específicamente, cuando sea posible (es decir, no anidado dentro de otro marcado o en el título de un documento), el primer uso de las marcas registradas debe tener el |reg| símbolo y todas las instancias de *FIRST* deben estar en cursiva. El |reg| símbolo se puede agregar usando ``.. include:: <isonum.txt>`` al principio del documento y luego usando ``*FIRST* \ |reg|`` o ``FRC\ |reg|``.
he_il: שימוש בסימני המסחר הרשומים *FIRST*\ |reg| ו-FRC\ |reg| צריך להיות בהתאם למדיניות של `דף זה <https://www.firstinspires.org/brand>`__. באופן ספציפי, במידת האפשר (לדוגמא לא בכותרת מסמכים), השימוש הראשון בסימני המסחר צריך להיות הסימן |reg| וכל ההופעות של *FIRST* צריכות להיות נטוייות. ניתן להוסיף את הסימן |reg| באמצעות ``.. include:: <isonum.txt>`` בתחילת המסמך ואז באמצעות ``*FIRST*\ |reg|`` או ``FRC\ |reg|``.

source: Indentation
es_mx: Sangría
he_il: הזחה

source: There should be ``1`` blank lines separating basic text blocks and section titles. There *should* be ``1`` blank line separating text blocks *and* content directives.
es_mx: Debe haber ``1`` línea en blanco que separa los bloques de texto básicos y los títulos de las secciones. Debe haber ``1`` línea en blanco que separa los bloques de texto *y* las directivas de contenido.
he_il: צריכה להיות שורה ``1`` ריקה המפרידה בין בלוקי טקסט בסיסיים לבין כותרות קטע. צריכה להיות שורה ``1`` ריקה המפרידה בין בלוקי טקסט לבין הוראות תוכן.

source: Admonitions (list `here <https://docutils.sourceforge.io/docs/ref/rst/directives.html#admonitions>`__) should have their text on the same line as the admonition itself. There are exceptions to this rule however, when having multiple sections of content inside of admonition. Generally having multiple sections of content inside of an admonition is not recommended.
es_mx: Amonestaciones (lista `aquí <https://docutils.sourceforge.io/docs/ref/rst/directives.html#admonitions>`__) deberían tener su texto en la misma línea que la propia amonestación. Sin embargo, hay excepciones a esta regla cuando se tienen múltiples secciones de contenido dentro de la amonestación. Generalmente no se recomienda tener múltiples secciones de contenido dentro de una amonestación.
he_il: אזהרות (רשימה `כאן <https://docutils.sourceforge.io/docs/ref/rst/directives.html#admonitions>`__) צריכות להכיל את הטקסט באותה שורה כמו ההמלצה עצמה. ישנם יוצאים מן הכלל, עם זאת, כאשר ישנם חלקים מרובים של תוכן בתוך ההנחיה. בדרך כלל לא מומלץ להשתמש בחלקים מסוימים של תוכן בתוך אזהרה.

source: It is preferred to format links as anonymous hyperlinks. The important thing to note is the **two** underscores appending the text. In the situation that only one underscore is used, issues may arise when compiling the document.
es_mx: Se prefiere formatear los enlaces como hipervínculos anónimos. Lo importante es que los **dos** subrayados que acompañan al texto. En la situación en la que sólo se utiliza un guión bajo, pueden surgir problemas a la hora de compilar el documento.
he_il: עדיף לעצב קישורים כהיפר-קישורים אנונימיים. הדבר החשוב הוא הוספת **שני** הקווים התחתונים. במצב בו משתמשים רק בקו תחתון אחד, עלולות להיווצר בעיות בעת רינדור המסמך.

source: Images
es_mx: Imágenes
he_il: תמונות

source: Image files should be stored in the document directory, sub-directory of ``document-name/images``
he_il: קבצי תמונה צריכים להיות מאוחסנים בתיקיית המסמכים, בתת-התיקייה של ``document-name/images``.

source: Draw.io (also known as `diagrams.net <https://app.diagrams.net/>`__) diagrams are supported through ``svg`` files with embedded ``.drawio`` metadata, allowing the ``svg`` file to act as a source file of the diagrams, and to be rendered like a normal vector graphics file.
es_mx: Draw.io (también conocidos como `diagrams.net <https://app.diagrams.net/>`__) los diagramas son soportados a través de archivos ``svg`` con metadatos incrustados ``.drawio``, permitiendo que el archivo ``svg`` actúe como un archivo fuente de los diagramas, y que se renderice como un archivo normal de gráficos vectoriales.
he_il: תרשימי Draw.io (ידועים גם בשם `diagrams.net <https://app.diagrams.net/>`__) נתמכים באמצעות קבצי ``svg`` עם מטא-דאטה ``.drawio``, המאפשר לקובץ ה-``svg`` להוות את קובץ המקור של הדיאגרמות, וגם להיות מעובד כקובץ גרפיקה וקטורי רגיל.

source: This document contains the various RST/Sphinx specific guidelines for the frc-docs project. For guidelines related to the various WPILib code projects, see `the WPILib Github <https://github.com/wpilibsuite/styleguide>`__
es_mx: Este documento contiene las directrices especificas de RST/Sphinx para el proyecto frc-docs. Para las directrices relacionadas con los proyectos varios de código de WPILib, visite `el WPILib Github <https://github.com/wpilibsuite/styleguide>`__

source: Please note that document structure is preserved in references, with the root being the location of the ``conf.py`` file. To access documents in sub-folders, simply prepend the folder path before the filename. IE, ``:ref:`docs/software/sensors/ultrasonics-sensors:Ultrasonics - Sensors```
es_mx: Tenga en cuenta que la estructura del documento se conserva en referencias, siendo la raíz la ubicación del archivo ``conf.py``. Para acceder a los documentos de las subcarpetas, simplemente precede la ruta de la carpeta antes del nombre del archivo. IE, ``:ref:`docs/software/sensors/ultrasonics-sensors:Ultrasonics - Sensors```

source: Image files should be stored in the document directory, sub-directory of ``images``
es_mx: Los archivos de imagen deben ser almacenados en el directorio de documentos, subdirectorio de ``imágenes``.

source: They should follow the naming scheme of ``document-title-1.png`` so on and so forth.
es_mx: Deberían seguir el esquema de denominación de "documento-título-1.png" y así sucesivamente.

source: They should be of the ``.png`` or ``.jpg`` image extension. ``.gif`` is unacceptable due to lack of Sphinx support.
es_mx: Deben ser de la extensión de imagen ``.png`` o ``.jpg``. "gif" es inaceptable debido a la falta de soporte de Sphinx.

source: The category ``index.rst`` file can then be added added to the root index file located at ``source/index.rst``.
es_mx: El archivo de categoría ``index.rst`` puede entonces añadirse al archivo de índice raíz ubicado en ``source/index.rst``.
