Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/style-guide.po
Languages: es_mx, fr_ca, he_il

source: Style Guide
es_mx: Guía de Estilo
fr_ca: Conventions de style
he_il: הנחיות סגנון

source: Filenames
es_mx: Nombres de Archivo
fr_ca: Noms de fichier
he_il: שמות הקבצים

source: Use only lowercase alphanumeric characters and ``-`` (minus) symbol.
es_mx: Use solo caracteres alfanuméricos en minúsculas y el guion (signo "-").
fr_ca: N'utilisez que des caractères alphanumériques minuscules et le symbole de soustraction ``-`` (moins).
he_il: השתמשו רק באותיות קטנות באנגלית, במספרים, ובסימן ``-`` (מינוס).

source: For documents that will have an identical software/hardware name, append "Hardware" or "Software" to the end of the document name. IE, ``ultrasonics-hardware.rst``
es_mx: Para documentos que tendrán un nombre de software/hardware idéntico, agregue "hardware" o "software" al final del nombre del documento. p.ej. ``ultrasonics-hardware.rst``
fr_ca: Pour les documents qui porteront le même titre pour l'équipement et la programmation, ajoutez "Hardware" ou "Software" à la fin du nom du document. IE, ``ultrasonics-hardware.rst``
he_il: למסמכים בעלי שם תוכנה/חומרה זהה, הוסיפו "Hardware" או "Software" בסוף שם הקובץ. לדוגמא, ``ultrasonics-hardware.rst``.

source: Suffix filenames with the ``.rst`` extension.
es_mx: Añada la extensión ``.rst`` como sufijo a los nombres de archivo.
fr_ca: Utilisez l'extension ``.rst`` comme terminaison de nom de fichier.
he_il: תנו לקבצים את הסיומת ``.rst``.

source: Text
es_mx: Texto
fr_ca: Texte
he_il: טקסט

source: All text content should be on the same line. If you need readability, use the word-wrap function of your editor.
fr_ca: Tout le contenu textuel devrait apparaître sur une seule ligne. Pour faciliter la lecture, utilisez la fonction de retour à la ligne de votre éditeur de texte.

source: Use the following case for these terms:
es_mx: Use el siguiente caso para estos términos:
fr_ca: Utilisez ces dénominations pour ces termes:
he_il: השתמשו בהתאמות האותיות הגדולות והקטנות באנגלית הבאות למונחים אלו:

source: roboRIO (not RoboRIO, roboRio, or RoboRio)
es_mx: roboRIO (no RoboRIO, roboRio, o RoboRio)
fr_ca: roboRIO (pas RoboRIO, roboRio, ni RoboRio)
he_il: roboRIO (לא RoboRIO, roboRio, או RoboRio)

source: LabVIEW (not labview or LabView)
es_mx: LabVIEW (no labview o LabView)
fr_ca: LabVIEW (pas labview ni LabView)
he_il: LabVIEW (לא labview או LabView)

source: Visual Studio Code (VS Code) (not vscode, VScode, vs code, etc)
es_mx: Visual Studio Code (VS Code) (no vscode, VScode, vs code, etc)
fr_ca: Visual Studio Code (VS Code) (pas vscode, VScode, vs code, etc.)
he_il: Visual Studio Code (VS Code) (לא vscode, VScode, vs code, וכו׳)

source: macOS (not Mac OS, Mac OSX, Mac OS X, Mac, Mac OS, etc.)
es_mx: macOS (no Mac OS, Mac OSX, Mac OS X, Mac, Mac OS, etc.)
fr_ca: macOS (pas Mac OS, Mac OSX, Mac OS X, Mac, Mac OS, etc.)
he_il: macOS (לא Mac OS, Mac OSX, Mac OS X, Mac, Mac OS, וכו׳)

source: GitHub (not github, Github, etc)
fr_ca: GitHub (pas github, Github, etc.)
he_il: GitHub (לא github, Github, וכו׳)

source: PowerShell (not powershell, Powershell, etc)
fr_ca: PowerShell (pas powershell, Powershell, etc.)
he_il: PowerShell (לא powershell, Powershell, וכו׳)

source: Linux (not linux)
fr_ca: Linux (pas linux)
he_il: Linux (לא linux)

source: Java (not java)
fr_ca: Java (pas java)
he_il: Java (לא java)

source: Use the ASCII character set for English text. For special characters (e.g. Greek symbols) use the `standard character entity sets <https://docutils.sourceforge.io/docs/ref/rst/definitions.html#character-entity-sets>`_.
es_mx: Utilice el conjunto de caracteres ASCII para el texto en inglés. Para caracteres especiales (p.ej., Símbolos griegos) use los `conjuntos de entidades de caracteres estándar <https://docutils.sourceforge.io/docs/ref/rst/definitions.html#character-entity-sets>`_.
fr_ca: Utilisez le jeu de caractères ASCII pour l'anglais. Pour les caractères spéciaux (e.g. symboles grecs) utilisez les `jeux standards de caractères <https://docutils.sourceforge.io/docs/ref/rst/definitions.html#character-entity-sets>`_.
he_il: השתמש בתווי ASCII לטקסט באנגלית. עבור תווים מיוחדים (למשל סמלים יווניים) השתמשו `בערכות תווים סטנדרטיות <https://docutils.sourceforge.io/docs/ref/rst/definitions.html#character-entity-sets>`_

source: Use ``.. math::`` for standalone equations and ``:math:`` for inline equations. A useful LaTeX equation cheat sheet can be found `here <https://www.reed.edu/academic_support/pdfs/qskills/latexcheatsheet.pdf>`_.
es_mx: Use ``.. math::`` para ecuaciones independientes y ``:math:`` para ecuaciones en línea. Puede encontrar una útil hoja de referencia de ecuaciones de LaTeX `aquí <https://www.reed.edu/academic_support/pdfs/qskills/latexcheatsheet.pdf>`_.
fr_ca: Utilisez ``.. math::`` pour les équations et ``:math:`` pour les équations intégrées. Une liste d'astuces LaTeX pour les équations est disponible `ici <https://www.reed.edu/academic_support/pdfs/qskills/latexcheatsheet.pdf>`_
he_il: השתמשו ב-``.. math::` עבור משוואות עצמאיות ו-``:math:`` למשוואות בשורה. מסמך נוסחאות LaTeX שימושי ניתן למצוא `כאן <https://www.reed.edu/academic_support/pdfs/qskills/latexcheatsheet.pdf>`_.

source: Use literals for filenames, function, and variable names.
es_mx: Use literales para nombres de archivos, funciones y nombres de variables.
fr_ca: Utilisez des chaînes de caractères pour les noms de fichier, les fonctions et les noms de variable.
he_il: השתמשו במילים פשוטות עבור שמות הקבצים, פונקציות ושמות משתנים.

source: Commonly used terms should be added to the :ref:`docs/software/frc-glossary:FRC Glossary`. You can reference items in the glossary by using ``:term:`deprecated```.
fr_ca: Les termes couramment utilisés doivent être ajoutés au :ref:`docs/software/frc-glossary:FRC Glossary`. Vous pouvez référencer des éléments dans le glossaire en utilisant ``:term:`deprecated```.

source: Whitespace
es_mx: Espacios en Blanco
fr_ca: Espaces

source: Indentation should *always* match the previous level of indentation *unless* you are creating a new content block.
es_mx: La sangría debe *siempre* coincidir con el nivel anterior de sangría *a menos que* esté creando un nuevo bloque de contenido.
fr_ca: Une indentation doit *toujours* correspondre au niveau précédent d'indentation *sauf* si vous créez un nouveau bloc de contenu.
he_il: ההזחה *תמיד* צריכה להתאים לרמה הקודמת של ההזחה, *אלא אם כן* אתם יוצרים בלוק תוכן חדש.

source: Indentation of content directives as new line ``.. toctree::`` should be `3` spaces.
es_mx: La sangría de las directivas de contenido como nueva línea ``.. toctree::`` debe ser `3` espacios.
fr_ca: L'indentation d'instructions de contenu sur une nouvelle ligne ``.. toctree::`` doit être de `3` espacements.

source: Blank Lines
es_mx: Líneas En Blanco
fr_ca: Lignes vierges
he_il: שורות ריקות

source: There should be ``1`` blank line separating basic text blocks and section titles. There *should* be ``1`` blank line separating text blocks *and* content directives.
fr_ca: Il doit y avoir ``1`` ligne vierge séparant des blocs de texte simples et les titres de section. Il *doit* y avoir ``1`` ligne vierge séparant des blocs de texte *et* des directives de contenu.

source: Interior Whitespace
es_mx: Espacio blanco interior
fr_ca: Espacement intérieur
he_il: Whitespace פנימי

source: Use one space between sentences.
es_mx: Use solo uno espacio entre frases.
fr_ca: Utilisez un espacement entre les phrases.
he_il: השתמשו ברווח אחד בין משפטים.

source: Headings
es_mx: Títulos
fr_ca: Entêtes
he_il: כותרות

source: Headings should be in the following structure. Heading underlines should match the same number of characters as the heading itself.
es_mx: Los títulos deben estar en la siguiente estructura. Los subrayados de títulos deben coincidir con el mismo número de caracteres que hay en el título.
fr_ca: Les entêtes doivent présenter la structure suivante. Le soulignement d'entête doit correspondre au nombre de caractères de l'entête lui-même.
he_il: הכותרות צריכות להיות במבנה הבא. הקו התחתון צריך להתאים למספר התווים של הכותרת עצמה.

source: ``=`` for document titles. *Do not* use this more than *once* per article.
es_mx: `` = `` para títulos de documentos. *No* use esto más de *una vez* por artículo.
fr_ca: ``=`` pour les titres de document. À *ne pas* utiliser plus d'*une fois* par article.
he_il: ``=`` לכותרות מסמכים. *אל* תשתמשו בזה יותר מפעם אחת לכל מאמר.

source: ``-`` for document sections
es_mx: `` -`` para secciones de documentos
fr_ca: ``-`` pour les sections de document
he_il: ``-`` עבור קטעי מסמך

source: ``^`` for document sub-sections
es_mx: ``^`` para subsecciones de documentos
fr_ca: ``^`` pour des sous-sections de document
he_il: ``-`` עבור תתי-קטע מסמך

source: ``~`` for document sub-sub-sections
es_mx: ``~`` para sub-subsecciones de documentos
fr_ca: ``~`` pour des sous-sous-sections de document
he_il: ``~`` עבור תתי-תתי-קטע מסמך

source: If you need to use any lower levels of structure, you're doing things wrong.
es_mx: Si necesita usar niveles más inferiores para la estructura, está haciéndolo mal.
fr_ca: Si vous devez subdiviser la structure davantage, vous êtes mal engagé.
he_il: אם אתם צריכים להשתמש ברמות נמוכות יותר של מבנה, אתם עושים דברים לא נכונים.

source: Use title case for headings.
es_mx: Escriba las primeras letras de cada palabra en mayúsculas para los títulos.
fr_ca: Utilisez la casse de titre pour les entêtes.

source: Lists
es_mx: Listas
fr_ca: Listes
he_il: רשימות

source: Lists should have a new line in between each indent level. The highest indent should have ``0`` indentation, and subsequent sublists should have an indentation starting at the first character of the previous indentation.
es_mx: Las listas deben tener una nueva línea entre cada nivel de sangría. El mayor nivel de sangría debe tener una sangría de "0", y las subsiguientes sublistas deben tener una sangría que comience en el primer carácter de la sangría anterior.
fr_ca: Les listes doivent comporter une nouvelle ligne entre chaque niveau d'indentation. Le niveau supérieur doit avoir une indentation de ``0``, et les sous-listes subséquentes doivent avoir une indentation débutant au premier caractère de l'indentation précédente.
he_il: לרשימות צריך להיות קו חדש בכל רמת הזחה. על רשימה הגבוהה ביותר צריכה להיות בהזחה ``0``, ורשימות המשנה הבאות צריכות להיות בהזחה החל מהתו הראשון של ההזחה הקודמת.

source: Code blocks
es_mx: Bloques de código
fr_ca: Blocs de code
he_il: בלוקי קוד

source: All code blocks should have a language specified.
es_mx: Todos los bloques de código deben tener un lenguaje especificado.
fr_ca: Tous les blocs de code doivent être dans un langage spécifique.
he_il: יש לציין שפה לכל בלוקי הקוד.

source: Exception: Content where formatting must be preserved and has no language. Instead use ``text``.
es_mx: Excepción: Contenido donde el formato debe ser preservado y no tiene lenguaje. En lugar de eso, usa "texto".
fr_ca: Exception: Du contenu dont la mise en page doit être préservée et sans langage. Utilisez plutôt ``text``.
he_il: חריג: תוכן בו יש לשמור על עיצוב ואין לו שפה. במקום זאת השתמשו ב- ``text``.

source: Follow the `WPILib style guide <https://github.com/wpilibsuite/styleguide/>`_ for C++ and Java example code. For example, use two spaces for indentation in C++ and Java.
es_mx: Siga el `Guía de estilo de WPILib <https://github.com/wpilibsuite/styleguide/>`_ para el código de ejemplo de C++ y Java. Por ejemplo, usa dos espacios para la indentación en C++ y Java.
fr_ca: Respectez le `Guide de formatage WPILib <https://github.com/wpilibsuite/styleguide/>`_ pour des modèles de codage C++ et Java. Par exemple, utilisez deux espacements pour les indentations en C++ et Java.
he_il: עקבו אחר `הנחיות הסגנון של WPILib <https://github.com/wpilibsuite/styleguide/>`_ עבור דוגמאות קוד C ++ ו-Java. לדוגמה, יש להשתמש בשני רווחים להזחה ב-C++ וב-Java.

source: RLI (Remote Literal Include)
fr_ca: RLI (Inclusion Littéralle à distance)

source: When possible, instead of using code blocks, an RLI should be used. This pulls code lines directly from GitHub, most commonly using the example programs. This automatically keeps the code up to date with any changes that are made. The format of an RLI is:
fr_ca: Lorsque cela est possible, au lieu d'utiliser des blocs de code, un RLI doit être utilisé. Cela extrait les lignes de code directement de GitHub, le plus souvent en utilisant les exemples de programmes. Cela maintient automatiquement le code à jour avec toutes les modifications apportées. Le format d'un RLI est :

source: Make sure to link to the raw version of the file on GitHub. There is a handy ``Raw`` button in the top right corner of the page.
fr_ca: Assurez-vous de créer un lien vers la version brute du fichier sur GitHub, il y a un bouton ``Raw`` pratique dans le coin supérieur droit de la page.

source: Tabs
fr_ca: Onglets

source: To create code tabs in an article, you can use the ``.. tab-set-code::`` directive. You can use ``code-block`` and ``rli`` directives inside. The format is:
fr_ca: Pour créer des onglets de code dans un article, vous pouvez utiliser la directive ``.. tab-set-code::``. Vous pouvez utiliser les directives ``code-block`` et ``rli`` à l'intérieur. Le format est :

source: If you need to use more than one tab per language, multiple RLIs per language, or text tabs, you can use the ``.. tab-set::`` and ``.. tab-item::`` directive. The format is:
fr_ca: Si vous avez besoin d'utiliser plus d'un onglet par langue, plusieurs RLI par langue ou des onglets de texte, vous pouvez utiliser la directive ``.. tab-set::`` et ``.. tab-item::``. Le format est le suivant:

source: This example uses the sync argument to allow all of the tabs with the same key to be synced together. This means that when you click on a tab, all of the tabs with the same key will open.
fr_ca: Cet exemple utilise l'argument de synchronisation pour permettre à tous les onglets avec la même clé d'être synchronisés ensemble. Cela signifie que lorsque vous cliquez sur un onglet, tous les onglets avec la même clé s'ouvriront.

source: If you have a mix of ``tab-set`` and ``tab-set-code`` directives on a page, you can sync them by setting the sync id on the ``tab-item`` directives to ``tabcode-LANGUAGE``. For example, a java tab would have a sync id of ``tabcode-java``.
fr_ca: Si vous avez un mélange de directives "tab-set" et "tab-set-code" sur une page, vous pouvez les synchroniser en définissant l'identifiant de synchronisation sur les directives "tab-item" avec la valeur "tabcode-LANGUAGE". Par exemple, un onglet Java aurait un identifiant de synchronisation de "tabcode-java".

source: Admonitions
es_mx: Amonestaciones
fr_ca: Avertissements
he_il: אזהרות

source: Use
es_mx: Uso
fr_ca: Usage correcte
he_il: השתמשו ב:

source: NOT
es_mx: NO
fr_ca: Usage INCORRECTE
he_il: ולא ב:

source: Links
fr_ca: Liens
he_il: קישורים

source: Internal Links
fr_ca: Liens internes

source: Internal Links will be auto-generated based on the ReStructuredText filename and section title.
fr_ca: Les liens internes seront générés automatiquement en se basant sur le nom de fichier ReStructuredText et sur le titre de section.

source: For example, here are several ways to link to sections and documents.
fr_ca: Par exemple, il y a plusieurs manières de lier les sections et les documents.

source: Use this format to reference a document section. You must use the absolute path of the document. ``:ref:`docs/software/hardware-apis/sensors/ultrasonics-software:Analog ultrasonics``` renders to :ref:`docs/software/hardware-apis/sensors/ultrasonics-software:Analog ultrasonics`.
fr_ca: Utilisez ce format pour référencer une section de document. Vous devez utiliser le chemin absolu du document. ``:ref:`docs/software/hardware-apis/sensors/ultrasonics-software:Analog ultrasonics``` est rendu comme :ref:`docs/software/hardware-apis/sensors/ultrasonics-software:Analog ultrasonics`.

source: Use this format to reference a section of the same document. Note the single underscore. ```Images`_`` renders to `Images`_.
fr_ca: Utilisez ce format pour référencer une section du même document. Notez le trait de soulignement unique. ```Images`_`` est rendu comme `Images`_.

source: Use this format to reference the top-level of a document. You can use relative paths ``:doc:`build-instructions``` renders to :doc:`build-instructions` Or to use absolute paths, put a forward slash at the beginning of the path ``:doc:`/docs/software/hardware-apis/sensors/ultrasonics-software``` renders to :doc:`/docs/software/hardware-apis/sensors/ultrasonics-software`. Note that the text rendered is the main section title of the target page regardless of the target filename.
fr_ca: Utilisez ce format pour référencer le niveau supérieur d'un document. Vous pouvez utiliser des chemins relatifs ``:doc:`build-instructions``` est rendu comme :doc:`build-instructions` Ou pour utiliser des chemins absolus, mettez une barre oblique au début du chemin ``:doc:`/ docs/software/hardware-apis/sensors/ultrasonics-software``` est rendu comme :doc:`/docs/software/hardware-apis/sensors/ultrasonics-software`. Notez que le texte rendu est le titre de la section principale de la page cible, quel que soit le nom du fichier cible.

source: When using ``:ref:`` or ``:doc:`` you may customize the displayed text by surrounding the actual link with angle brackets ``<>`` and adding the custom text between the first backtick ````` and the first angle bracket ``<``. For example ``:ref:`custom text <docs/software/hardware-apis/sensors/ultrasonics-software:Analog ultrasonics>``` renders to :ref:`custom text <docs/software/hardware-apis/sensors/ultrasonics-software:Analog ultrasonics>`.
fr_ca: Lorsque vous utilisez ``:ref:`` ou ``:doc:``, vous pouvez personnaliser le texte affiché en entourant le lien réel avec des crochets angulaires ``<>`` et en ajoutant le texte personnalisé entre le premier accent grave (backtick) ```` ` et le premier crochet angulaire ``<``. Par exemple ``:ref:`texte personnalisé <docs/software/hardware-apis/sensors/ultrasonics-software:Ultrasoniques analogiques>``` est rendu en :ref:`texte personnalisé <docs/software/hardware-apis/sensors/ logiciel d'ultrasons : ultrasons analogiques>`.

source: External Links
fr_ca: Liens externes

source: However, in some cases where the same link must be referenced multiple times, the syntax below is accepted.
es_mx: Sin embargo, en algunos casos en que el mismo enlace debe ser referenciado varias veces, se acepta la sintaxis que figura a continuación.
fr_ca: Cependant, dans les cas où le même lien doit être référencé à plusieurs reprises, la syntaxe suivante est acceptée.
he_il: עם זאת, במקרים מסוימים בהם יש להפנות לאותו הקישור מספר פעמים, התחביר שלמטה מתקבל.

source: Images should be created with ``1`` new line separating content and directive.
es_mx: Las imágenes deben ser creadas con ``1`` línea que separe el contenido y la directiva.
fr_ca: Les images doivent être introduites avec ``1`` nouvelle ligne séparant le contenu et l'instruction.
he_il: תמונות צריכות להיות עם שורה ``1`` חדשה המפרידה בין התוכן וההנחיה.

source: All images (including vectors) should be less than ``500`` kilobytes in size. Please make use of a smaller resolution and more efficient compression algorithms.
es_mx: Todas las imágenes (incluyendo los vectores) deben tener un tamaño inferior a "500" kilobytes. Por favor, utilice una resolución más pequeña y algoritmos de compresión más eficientes.
fr_ca: La taille de chaque image (même au format vectoriel) ne doit pas dépasser ``500`` kilo-octets. Veuillez réduire la résolution d'image et utiliser un algorithme de compression efficace.
he_il: כל התמונות (כולל הווקטורים) צריכות להיות קטנות מ-``500`` קילובייט. אנא השתמשו ברזולוציה קטנה יותר ובאלגוריתמי דחיסה יעילים יותר.

source: Image Files
es_mx: Archivos de imágenes
fr_ca: Fichiers image
he_il: קבצי תמונה

source: Image files should be stored in the document directory, sub-directory of ``document-name/images``.
fr_ca: Les fichiers d’images doivent être stockés dans le répertoire du document, sous-répertoire ``document-name/images``.

source: They should follow the naming scheme of ``short-description.png``, where the name of the image is a short description of what the image shows. This should be less than ``24`` characters.
fr_ca: Ils doivent suivre le format de nommage ``courte-description.png``, où le nom de l’image est une courte description de ce que l’image montre. Cette description devrait être inférieure à ``24`` caractères.
he_il: עליהם להיות על פי תבנית השמות של ``short-description.png``, כאשר שם התמונה הוא תיאור קצר של מה שהתמונה מראה. זה צריך להיות פחות מ-``24`` תווים.

source: They should be of the ``.png`` or ``.jpg`` image extension. ``.gif`` is unacceptable due to storage and accessibility concerns.
fr_ca: Ils doivent être d'extension d’image ``.png`` ou ``.jpg``. L'extension ``.gif`` est inacceptable en raison des problèmes de stockage et d’accessibilité.
he_il: הם צריכות להיות עם הסיומות ``.png`` או ``.jpg``. הסיומת ``.gif`` אינה מקובלת בגלל חששות לאחסון ונגישות.

source: Accessibility is important! Images should be marked with a ``:alt:`` directive.
fr_ca: L’accessibilité est importante! Les images doivent être marquées par une directive ``:alt:``.
he_il: נגישות היא חשובה! כל התמנות חייבות להכיל ``:alt:``.

source: Vector Images
es_mx: Imágenes vectoriales
fr_ca: Images vectorielles
he_il: תמונות וקטוריות

source: SVG files are supported through the ``svg2pdfconverter`` Sphinx extension.
es_mx: Los archivos SVG son soportados a través de la extensión Sphinx de ``svg2pdfconverter``.
fr_ca: Les fichiers SVG sont supportés via l'extension Sphinx ``svg2pdfconverter``.
he_il: קבצי SVG נתמכים באמצעות הרחבת ``svg2pdfconverter`` של Sphinx.

source: Simply use them as you would with any other image.
es_mx: Simplemente úsalos como lo harías con cualquier otra imagen.
fr_ca: Utilisez-les comme vous le feriez de tout autre format d'image.
he_il: השתמשו בהם כמו בכל תמונה אחרת.

source: Ensure that any embedded images in the vector do not bloat the vector to exceed the 500KB limit.
es_mx: Asegúrate de que las imágenes incrustadas en el vector no inflen el vector hasta superar el límite de 500KB.
fr_ca: Assurez-vous que les images incorporées au document vecteur ne le gonflent pas pour dépasser la limite de 500 Ko.
he_il: ודאו כי תמונות פקסלים בווקטור אינן מנפחות את גודל הקובץ כדי לחרוג ממגבלת 500KB.

source: Draw.io Diagrams
es_mx: Diagramas Draw.io
fr_ca: Croquis Draw.io
he_il: תרשימי Draw.io

source: Simply use them like you would any other vector image, or any other image.
es_mx: Simplemente úsalos como lo harías con cualquier otra imagen vectorial, o cualquier otra imagen.
fr_ca: Utilisez-les simplement comme vous le feriez pour toute autre image vectorielle ou toute autre format d'image.
he_il: השתמשו בהם כמו בכל תמונה וקטורית אחרת, או בכל תמונה אחרת.

source: Draw.io Files
es_mx: Archivos de Draw.io
fr_ca: Fichiers Draw.io
he_il: קבצי Draw.io
