Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/translations.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Translations
es_mx: Traducciones
fr_ca: Traductions
tr_tr: Çeviriler
zh_cn: 翻译

source: frc-docs supports translations using the web-based `Transifex <https://www.transifex.com>`__ utility. frc-docs has been translated into Spanish - Mexico (es_MX), French - Canada (fr_CA) and Turkish - Turkey (tr_TR). Chinese - China (zh_CN), Hebrew - Israel (he_IL), and Portuguese - Brazil (pt_BR) have translations in progress. Translators that are fluent in *both* English and one of the specified languages would be greatly appreciated to contribute to the translations. Even once a translation is complete, it needs to be updated to keep up with changes in frc-docs.
es_mx: frc-docs admite traducciones mediante la utilidad basada en web `Transifex <https://www.transifex.com>`__. frc-docs ha sido traducido al español - México (es_MX), francés - Canadá (fr_CA) y turco - Turquía (tr_TR). Chino - China (zh_CN), hebreo - Israel (he_IL) y portugués - Brasil (pt_BR) tienen traducciones en curso. Los traductores que dominan *tanto* inglés como uno de los idiomas especificados serán muy apreciados para contribuir a las traducciones. Incluso una vez que se completa una traducción, debe actualizarse para mantenerse al día con los cambios en frc-docs.
tr_tr: frc-docs, web tabanlı `Transifex <https://www.transifex.com>`__ yardımcı programını kullanarak çevirileri destekler. frc-docs İspanyolca - Meksika (es_MX), Fransızca - Kanada (fr_CA) ve Türkçe - Türkiye'ye (tr_TR) çevrilmiştir. Çince - Çin (zh_CN), İbranice İsrail (he_IL) ve Portekizce - Brezilya (pt_BR) çevirileri devam etmektedir. *both-hem* İngilizce hem de belirtilen dillerden birini akıcı bir şekilde bilen çevirmenler, çevirilere katkıda bulunmaktan büyük memnuniyet duyacaktır. Bir çeviri tamamlandığında bile, frc-docs'daki değişikliklere ayak uydurmak için güncellenmesi gerekir.
zh_cn: frc-docs使用基于Web的`Transifex <https://www.transifex.com>`__程序来帮助翻译。 frc-docs已被翻译成西班牙语-墨西哥（es_MX），法语-加拿大（fr_CA）和土耳其语-土耳其（tr_TR）。中文-中国（zh_CN），希伯来语-以色列（he_IL）和葡萄牙语-巴西（pt_BR）的翻译正在进行中。会说流利的英语和指定语言之一的翻译者将为翻译做出贡献。即使翻译完成，也需要对其进行更新，以跟上frc-docs中的更改。

source: Workflow
es_mx: Flujo de Trabajo
fr_ca: Plan de travail
tr_tr: İşakışı
zh_cn: 工作流程

source: Here are some steps to follow for translating frc-docs.
es_mx: Aquí hay algunas instrucciones para traducir frc-docs.
fr_ca: Voici les étapes à suivre pour la traduction de frc-docs.
tr_tr: Frc-docs çevirmek için izlenecek bazı adımlar.
zh_cn: 以下是翻译frc-docs的一些步骤。

source: Sign up for `Transifex <https://www.transifex.com/>`__ and ask to join the `frc-docs project <https://www.transifex.com/wpilib/frc-docs>`__, and request access to the language you'd like to contribute to.
es_mx: Elabora una cuenta en `Transifex <https://www.transifex.com/>`__ y pide unirte a `proyecto frc-docs <https://www.transifex.com/wpilib/frc-docs>`__, y pide acceso a contribuir al idioma preferido.
fr_ca: Inscrivez-vous à `Transifex <https://www.transifex.com/>`__ et demandez à rejoindre le projet `frc-docs project <https://www.transifex.com/wpilib/frc-docs>`__, puis demandez l'accès spécifique à la langue sur laquelle vous souhaitez travailler.
tr_tr: `Transifex <https://www.transifex.com/>`__ için kaydolun ve `frc-docs projesine <https://www.transifex.com/wpilib/frc-docs>`__ katılmayı isteyin ve katkıda bulunmak istediğiniz dile erişim talep edin.
zh_cn: 注册`Transifex <https://www.transifex.com/>`__，并要求加入`frc-docs project <https://www.transifex.com/wpilib/frc-docs>`__，然后询问您愿意为之付出努力的语言。

source: Join GitHub `discussions <https://github.com/wpilibsuite/allwpilib/discussions>`__! This is a direct means of communication with the WPILib team. You can use this to ask us questions in a fast and streamlined fashion.
es_mx: Únase a GitHub `discusiones <https://github.com/wpilibsuite/allwpilib/discussions>` __! Este es un medio de comunicación directo con el equipo de WPILib. Puede usar esto para hacernos preguntas de una manera rápida y ágil.
fr_ca: Rejoignez les `discussions <https://github.com/wpilibsuite/allwpilib/discussions>`__ GitHub ! Il s’agit d’un moyen de communication direct avec l’équipe WPILib. Vous pouvez l’utiliser pour nous poser des questions d’une manière rapide et simplifiée.
tr_tr: GitHub'a katılın `tartışmalarına <https://github.com/wpilibsuite/allwpilib/discussions>` __! Bu, WPILib ekibi ile doğrudan bir iletişim aracıdır. Bunu bize hızlı ve modern bir şekilde soru sormak için kullanabilirsiniz.
zh_cn: 加入GitHub`discussions <https://github.com/wpilibsuite/allwpilib/discussions>`__！这是与WPILib团队进行直接沟通的方式。您可以使用它以快速，简化的方式向我们提问。

source: You may be contacted and asked questions involving contributing languages before being granted access to the frc-docs translation project.
es_mx: Es posible que te contactemos y te hagamos preguntas relacionadas con la contribución a las traducciones antes de obtener acceso al proyecto de traducción frc-docs.
fr_ca: Vous pourriez être contacté et questionné concernant le langage à traduire avant d'avoir accès au projet de traduction frc-docs.
tr_tr: Frc-docs çeviri projesine erişim izni verilmeden önce sizinle iletişime geçilebilir ve katkıda bulunan dillerle ilgili sorular sorulabilir.
zh_cn: 在被授予访问frc-docs翻译项目的权限之前，可能会与您联系并询问涉及贡献语言的问题。

source: Translate your language!
es_mx: ¡Traduce tu idioma!
fr_ca: Traduisez!
tr_tr: Dilinizi çevirin!
zh_cn: 化掉语言的隔阂!

source: Links
es_mx: Enlaces
fr_ca: Liens
tr_tr: Linkler
zh_cn: 链接

source: Links must be preserved in their original syntax. To translate a link, you can replace the TRANSLATE ME text (this will be replaced with the English title) with the appropriate translation.
es_mx: Los enlaces deben conservarse en su sintaxis original. Para traducir un enlace, puede reemplazar el texto TRANSLATE ME (este será reemplazado por el título en inglés) con la traducción apropiada.
fr_ca: Les liens doivent être conservés dans leur syntaxe d’origine. Pour traduire un lien, vous pouvez remplacer le texte TRANSLATE ME (celui-ci sera remplacé par le titre anglais) par la traduction appropriée.
tr_tr: Bağlantılar orijinal sözdizimlerinde korunmalıdır. Bir bağlantıyı çevirmek için, TRANSLATE ME metnini (bu, İngilizce başlıkla değiştirilecektir) uygun çeviriyle değiştirebilirsiniz.
zh_cn: 链接必须保留其原始语法。要翻译链接，您可以将TRANSLATE ME文本（将被英文标题替换）替换为适当的翻译。

source: An example of the original text may be
es_mx: Un ejemplo del texto original podría ser
fr_ca: Un exemple de texte à traduire:
tr_tr: Orijinal metnin bir örneği olabilir
zh_cn: 这是原始文本的示例

source: where the ``Wiring the FRC Control System Document`` then gets translated.
es_mx: en cuyo caso, "Wiring the FRC Control System Document" se traduce.
fr_ca: où l'expression ``Wiring the FRC Control System Document`` doit être traduite.
tr_tr: burada ``Wiring the FRC Control System Document`` tercüme edilir.
zh_cn: 当``Wiring the FRC Control System Document``被翻译。

source: Another example is below
es_mx: Otro ejemplo está a continuación
fr_ca: Un autre exemple:
tr_tr: Diger bir ornek aşağıda
zh_cn: 另外一个例子如下

source: Publishing Translations
es_mx: Publicar las Traducciones
fr_ca: Publier une traduction
tr_tr: Çevirileri Yayınlamak
zh_cn: 翻译内容上线

source: Translations are pulled from Transifex and published automatically each day.
es_mx: Las traducciones se extraen de Transifex y se publican automáticamente cada día.
fr_ca: Les traductions sont extraites de Transifex et publiées quotidiennement.
tr_tr: Çeviriler Transifex'ten alınır ve her gün otomatik olarak yayınlanır.
zh_cn: 每天都会从Transifex提取翻译并自动发布。

source: Accuracy
es_mx: Fidelidad
fr_ca: Exactitude
tr_tr: Doğruluk
zh_cn: 准确度

source: Translations should be accurate to the original text. If improvements to the English text can be made, open a PR or issue on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository. These can then get translated on merge.
es_mx: Las traducciones deben ser fieles al texto original. Si el texto original tiene áreas de oportunidad, abre un "Pull Request" o "Issue" en `frc-dics <https://github.com/wpilibsuite/frc-docs>`__. Puedes traducir el texto nuevo después de la actualización.
fr_ca: Les traductions doivent exactement respecter le texte original. Si le texte en anglais devrait être amélioré, rédigez un PR ou soulevez un problème sur `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ bibliothèque. Ces suggestions pourront être traduites et intégrées.
tr_tr: Çeviriler orijinal metne göre doğru olmalıdır. İngilizce metinde iyileştirmeler yapılabiliyorsa, `frc-docs<https://github.com/wpilibsuite/frc-docs>`__ deposunda bir PR veya sorun açın. Bunlar daha sonra birleştirilerek çevrilebilir.
zh_cn: 翻译内容应与原文准确无误。如果英文文本需要改善，请在 `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository中开始一个PR或issue。然后可以在合并时翻译它们。

source: frc-docs supports translations using the web-based `Transifex <https://www.transifex.com>`__ utility. frc-docs has been translated into Spanish - Mexico (es_MX), French - Canada (fr_CA) and Turkish - Turkey (tr_TR). Chinese - China (zh_CN), Hebrew Israel (he_IL), and Portuguese - Brazil (pt_BR) have translations in progress. Translators that are fluent in *both* English and one of the specified languages would be greatly appreciated to contribute to the translations. Even once a translation is complete, it needs to be updated to keep up with changes in frc-docs.
fr_ca: frc-docs prend en charge les traductions à l'aide de l'utilitaire Web `Transifex <https://www.transifex.com>` __. frc-docs a été traduit en espagnol (Mexique) (es_MX), en français - (Canada) (fr_CA) et en turc - (Turquie) (tr_TR). Les versions chinoise - (Chine) (zh_CN), hébreu (Israël) (he_IL) et portugaise - (Brésil) (pt_BR) sont en cours. Des traducteurs qui maîtrisent * deux langues *, soit l'anglais et l'une des langues spécifiées sont invités gracieusement à contribuer aux traductions. Lorsqu'une traduction est terminée, il ya des mises à jour régulières pour suivre les changements dans frc-docs.
