Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/advanced/robotbuilder-custom-components.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Adding Custom Components
es_mx: Agregar componentes personalizados
fr_ca: Ajout de composants personnalisés
tr_tr: Özel Bileşenler Ekleme
zh_cn: 添加自定义组件

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
zh_cn: RobotBuilder 已更新，以支持新的基于命令的框架！不幸的是，该文档已过时，仅适用于旧的基于命令的框架。有兴趣更新此文档的个人可以在 frc-docs https://github.com/wpilibsuite/frc-docs 存储库上打开请求请求。

source: RobotBuilder works very well for creating robot programs that just use WPILib for motors, controllers, and sensors. But for teams that use custom classes, RobotBuilder doesn't have any support for those classes, so a few steps need to be taken to use them in RobotBuilder
es_mx: RobotBuilder funciona muy bien para crear programas de robots que solo usan WPILib para motores, controladores y sensores. Pero para los equipos que usan clases personalizadas, RobotBuilder no tiene ningún soporte para esas clases, por lo que se deben seguir algunos pasos para usarlas en RobotBuilder.
fr_ca: RobotBuilder fonctionne très bien pour la création de programmes de robots qui utilisent uniquement la WPILib pour les moteurs, les contrôleurs et les capteurs. Mais pour les équipes qui utilisent des classes personnalisées, RobotBuilder n’a pas de support pour ces classes, donc quelques étapes doivent être prises pour les utiliser dans RobotBuilder
tr_tr: RobotBuilder, motorlar, kontrolörler ve sensörler için yalnızca WPILib kullanan robot programları oluşturmak için çok iyi çalışıyor. Ancak özel sınıfları kullanan ekipler için, RobotBuilder'ın bu sınıflar için herhangi bir desteği yoktur, bu nedenle bunları RobotBuilder'da kullanmak için birkaç adım atılması gerekir.
zh_cn: RobotBuilder在创建仅将WPILib用于电机，控制器和传感器的机器人程序时效果很好。但是对于使用自定义类的团队，RobotBuilder对这些类没有任何支持，因此需要采取一些步骤才能在RobotBuilder中使用它们

source: Custom Component Structure
es_mx: Estructura de componentes personalizada
fr_ca: Structure d'un composants personnalisé
tr_tr: Özel Bileşen Yapısı
zh_cn: 自定义组件结构

source: Custom components all go in ``~/wpilib/YYYY/Robotbuilder/extensions`` where ~ is ``C:\Users\Public`` on Windows and YYYY is the FRC\ |reg| year.
es_mx: Todos los componentes personalizados van en ``~/wpilib/YYYY/Robotbuilder/extensions`` donde ~ es ``C:\Users\Public`` en Windows y YYYY es el año de FRC\ |reg|.
fr_ca: Les composants personnalisés vont tous dans ``~/wpilib/YYYY/Robotbuilder/extensions`` où ~ est ``C:\Users\Public`` sous Windows et YYYY correspond à l'année de la saison FRC\ |reg|.
tr_tr: Özel bileşenlerin tümü yıl olarak burada bulunur. ``~/wpilib/YYYY/Robotbuilder/extensions`` where ~ is ``C:\Users\Public`` on Windows and YYYY is the FRC\ |reg| year.
zh_cn: 所有自定义组件都放在~/ wpilib / YYYY / Robotbuilder / extensions中，其中〜是Windows上的C：\ Users \ Public，而YYYY是FRC \ | reg |年。

source: There are seven files and one folder that are needed for a custom component. The folder contains the files describing the component and how to export it. It should have the same name as the component (e.g."Kiwi Drive" for a kiwi drive controller, "Robot Drive 6" for a six-motor drive controller, etc.). The files should have the same names and extensions as the ones shown here. Other files can be in the folder along with these seven, but the seven must be present for RobotBuilder to recognize the custom component.
es_mx: Hay siete archivos y una carpeta que se necesitan para un componente personalizado. La carpeta contiene los archivos que describen el componente y cómo exportarlo. Debe tener el mismo nombre que el componente (por ejemplo, "Kiwi Drive" para un controlador de unidad de kiwi, "Robot Drive 6" para un controlador de unidad de seis motores, etc.). Los archivos deben tener los mismos nombres y extensiones que los que se muestran aquí. Otros archivos pueden estar en la carpeta junto con estos siete, pero los siete deben estar presentes para que RobotBuilder reconozca el componente personalizado.
fr_ca: Il y a sept fichiers et un dossier qui sont nécessaires pour un composant personnalisé. Le dossier contient les fichiers décrivant le composant et comment l’exporter. Il doit avoir le même nom que le composant (p. ex."Kiwi Drive" pour une base pilotable de type kiwi, "Robot Drive 6" pour une base pilotable à six moteurs, etc.). Les fichiers doivent avoir les mêmes noms et extensions que ceux indiqués ici. D’autres fichiers peuvent être dans le dossier en plus de ces sept, mais les sept doivent être présents pour que RobotBuilder reconnaisse le composant personnalisé.
tr_tr: Özel bir bileşen için gereken yedi dosya ve bir klasör vardır. Klasör, bileşeni ve nasıl dışa aktarılacağını açıklayan dosyaları içerir. Bileşenle aynı ada sahip olmalıdır (örneğin, bir Kiwi sürücü denetleyicisi için "Kiwi Drive", altı motorlu sürücü denetleyicisi için "Robot Drive 6", vb.). Dosyalar, burada gösterilenlerle aynı adlara ve uzantılara sahip olmalıdır. Diğer dosyalar bu yedi ile birlikte klasörde olabilir, ancak yedi tanesi RobotBuilder'ın özel bileşeni tanıması için mevcut olmalıdır.
zh_cn: 自定义组件需要七个文件和一个文件夹。该文件夹包含描述组件及其导出方式的文件。该名称应与组件名称相同（例如，奇异果驱动器控制器Kiwi drive controller的名称应为“ Kiwi Drive”，六电动机驱动器控制器six-motor drive controller的名称应为“ Robot Drive 6”，等等)这些文件应具有与此处显示的名称和扩展名相同的名称和扩展名。其他文件可以与这七个文件一起放在文件夹中，但是七个文件必须存在，以便RobotBuilder识别自定义组件。

source: Line-by-line:
es_mx: Linea por linea:
fr_ca: Ligne par ligne :
tr_tr: Satır satır:
zh_cn: 逐行：

source: !Component: Declares the beginning of a new component
es_mx: !Component: declara el comienzo de un nuevo componente
fr_ca: !Component : déclare le début d’un nouveau composant
tr_tr: !Component-Bileşen: Yeni bir bileşenin başlangıcını bildirir
zh_cn: ！Component：表明新组件的开始

source: name: The name of the component. This is what will show up in the palette/tree -- this should also be the same as the name of the containing folder
es_mx: name: El nombre del componente. Esto es lo que se mostrará en la paleta/árbol; también debe ser el mismo que el nombre de la carpeta que lo contiene.
fr_ca: name: Nom du composant. C’est ce qui s’affichera dans la palette/arbre - cela devrait également être le même que le nom du dossier contenant
tr_tr: name: Bileşenin adı. Palette/ağaçta görünecek olan budur - bu aynı zamanda içeren klasörün adıyla aynı olmalıdır.
zh_cn: name：组件的名称。这就是调色板/树中将显示的内容-也应与包含文件夹的名称相同

source: type: the type of the component (these will be explained in depth later on)
es_mx: type: el tipo de componente (se explicarán en profundidad más adelante)
fr_ca: type: le type du composant (ceux-ci seront expliqués en profondeur plus tard)
tr_tr: type-tür: bileşenin türü (bunlar daha sonra ayrıntılı olarak açıklanacaktır)
zh_cn: type：组件的类型（稍后将对此进行深入说明）

source: supports: a map of the amount of each type of component this can support. Motor controllers in RobotBuilder are all PIDOutputs, so a kiwi drive can support three PIDOutputs. If a component doesn't support anything (such as sensors or motor controllers), just leave this line out
es_mx: supports: un mapa de la cantidad de cada tipo de componente que puede soportar. Los controladores de motor en RobotBuilder son todos PIDOutputs, por lo que una unidad de kiwi puede admitir tres PIDOutputs. Si un componente no admite nada (como sensores o controladores de motor), simplemente deje esta línea fuera
fr_ca: supports: une carte de la quantité de chaque type de composant qui peut prendre en charge. Les contrôleurs de moteurs de RobotBuilder sont tous des PIDOutputs, de sorte qu’une base kiwi peut prendre en charge trois PIDOutputs. Si un composant ne prend rien en charge (comme les capteurs ou les contrôleurs de moteurs), juste ignorer cette ligne
tr_tr: supports-destekler: destekleyebileceği her bileşen türünün miktarının bir haritası. RobotBuilder'daki motor kontrolörlerinin tümü PIDOutput'lardır, bu nedenle bir kivi sürücüsü üç PIDOutput'u destekleyebilir. Bir bileşen herhangi bir şeyi desteklemiyorsa (sensörler veya motor kontrol cihazları gibi), bu satırı dışarıda bırakın
zh_cn: supports：可以支持的每种类型的组件数量的图像。 RobotBuilder中的电动机控制器都是PID输出，因此kiwi驱动器可以支持三个PID输出。如果某个组件不支持任何东西（例如传感器或电机控制器），则请忽略此行

source: help: a short string that gives a helpful message when one of these components is hovered over
es_mx: help: una cadena corta que da un mensaje útil cuando se coloca el cursor sobre uno de estos componentes
fr_ca: help: une chaîne de caractères concise qui affiche un message utile lorsqu'on passe le curseur sur l’un de ces composants
tr_tr: help-yardım: bu bileşenlerden birinin üzerine geldiğinde faydalı bir mesaj veren kısa bir dize
zh_cn: help：短字符串，当这些组件之一被鼠标停留在之上时会给出有用的信息

source: properties: a list of the properties of this component. In this kiwi drive example, there are three very similar properties, one for each motor. A ChildSelectionProperty allows the user to choose a component of the given type from the subcomponents of the one being edited (so here, they would show a dropdown asking for a PIDOutput - i.e. a motor controller - that has been added to the kiwi drive)
es_mx: properties: una lista de las propiedades de este componente. En este ejemplo de unidad de kiwi, hay tres propiedades muy similares, una para cada motor. Una ChildSelectionProperty permite al usuario elegir un componente del tipo dado de los subcomponentes del que se está editando (por lo que aquí, mostrarían un menú desplegable solicitando una PIDOutput, es decir, un controlador de motor, que se ha agregado a la unidad de kiwi)
fr_ca: properties: liste des propriétés de ce composant. Dans cet exemple de base kiwi, il y a trois propriétés très similaires, une pour chaque moteur. Un ChildSelectionProperty permet à l’utilisateur de choisir un composant du type donné à partir des sous-composants de celui qui est en cours de modification (donc ici, s'afficherait une liste déroulante demandant un PIDOutput - c’est-à-dire un contrôleur de moteur - qui a été ajouté à la base kiwi)
tr_tr: properties: bu bileşenin özelliklerinin listesi. Bu kivi sürücü örneğinde, her motor için bir tane olmak üzere çok benzer üç özellik vardır. Bir ChildSelectionProperty, kullanıcının, düzenlenen bileşenin alt bileşenlerinden belirli türden bir bileşeni seçmesine olanak tanır (bu nedenle, burada, kiwi sürücüsüne eklenen bir PIDOutput - yani bir motor denetleyicisi - isteyen bir açılır menü gösterilir)
zh_cn: properties：此组件的属性列表。在此kiwi驱动器示例中，有三个非常相似的属性，每个电动机一个。 ChildSelectionProperty允许用户从正在编辑的子组件的子组件中选择给定类型的组件（因此，在这里，它们将显示一个下拉列表，要求输入已添加到Kiwi驱动器的PID输出-即电动机控制器）

source: The types of component RobotBuilder supports (these are case-sensitive):
es_mx: Los tipos de componentes que admite RobotBuilder (distinguen entre mayúsculas y minúsculas):
fr_ca: Les types de composants que RobotBuilder prend en charge (ceux-ci sont sensibles à la casse):
tr_tr: RobotBuilder'ın desteklediği bileşen türleri (bunlar büyük / küçük harfe duyarlıdır):
zh_cn: RobotBuilder支持的组件类型（区分大小写）：

source: Command
es_mx: Comando
tr_tr: Komut
zh_cn: 指令

source: Subsystem
es_mx: Subsistema
tr_tr: Alt sistem
zh_cn: 子系统

source: PIDOutput (motor controller)
es_mx: PIDOutput (controlador de motor)
fr_ca: PIDOutput (contrôleur de moteur)
tr_tr: PIDOutput (motor kontrolleri)
zh_cn: PID输出（电机控制器）

source: PIDSource (sensor that implements PIDSource e.g. analog potentiometer, encoder)
es_mx: PIDSource (sensor que implementa PIDSource, por ejemplo, potenciómetro analógico, encoder)
fr_ca: PIDSource (capteur qui implémente PIDSource, par exemple un potentiomètre analogique, un encodeur)
tr_tr: PIDSource (PIDSource uygulayan sensör, örneğin analog potansiyometre, kodlayıcı)
zh_cn: PIDSource（实现PIDSource的传感器，例如模拟电位器，编码器）

source: Sensor (sensor that does not implement PIDSource e.g. limit switch)
es_mx: Sensor (sensor que no implementa PIDSource, por ejemplo, interruptor de límite)
fr_ca: Sensor (capteur qui n’implémente pas PIDSource, par exemple un interrupteur de fin de course)
tr_tr: Sensör (PIDSource uygulamayan sensör, örneğin limit anahtarı)
zh_cn: 传感器（无法执行PIDSource的传感器，例如限位开关）

source: Controller (robot drive, PID controller, etc.)
es_mx: Controlador (unidad de robot, controlador PID, etc.)
fr_ca: Controller (déplacement du robot, contrôleur PID, etc.)
tr_tr: Kontrolör (robot sürücü, PID kontrolör vb.)
zh_cn: 控制器（机器人驱动器，PID控制器等）

source: Actuator (an output that is not a motor, e.g. solenoid, servo)
es_mx: Actuador (una salida que no es un motor, por ejemplo, solenoide, servo)
fr_ca: Actuator (une sortie qui n’est pas un moteur, par exemple un solenoïde, un servo)
tr_tr: Aktüatör (motor olmayan bir çıkış, örneğin solenoid, servo)
zh_cn: 执行器（不是电动机的输出，例如电磁阀，伺服）

source: Joystick
tr_tr: Joystick - Oyun kolu
zh_cn: 操作杆

source: Joystick Button
es_mx: Botón de joystick
tr_tr: Joystick Düğmesi
zh_cn: 操纵杆按钮

source: Properties
es_mx: Propiedades
fr_ca: Propriétés
tr_tr: Properties-Özellikleri
zh_cn: 属性

source: The properties relevant for a custom component:
es_mx: Las propiedades relevantes para un componente personalizado:
fr_ca: Propriétés pertinentes pour un composant personnalisé :
tr_tr: Özel bir bileşenle ilgili özellikler:
zh_cn: 与自定义组件相关的属性：

source: StringProperty: used when a component needs a string e.g. the name of the component
es_mx: StringProperty: se utiliza cuando un componente necesita una cadena, p. Ej. el nombre del componente
fr_ca: StringProperty: utilisé lorsqu’un composant a besoin d’une chaîne de caractères, par exemple le nom du composant
tr_tr: StringProperty: bir bileşen bir dizeye ihtiyaç duyduğunda kullanılır, ör. bileşenin adı
zh_cn: StringProperty：在组件需要字符串时使用，例如组件名称

source: BooleanProperty: used when a component needs a boolean value e.g. putting a button on the SmartDashboard
es_mx: BooleanProperty: se usa cuando un componente necesita un valor booleano, p. Ej. poner un botón en el SmartDashboard
fr_ca: BooleanProperty: utilisé lorsqu’un composant a besoin d’une valeur booléenne, par exemple en mettant un bouton sur le SmartDashboard
tr_tr: BooleanProperty: bir bileşen bir boole değerine ihtiyaç duyduğunda kullanılır, ör. SmartDashboard'a bir düğme koymak
zh_cn: BooleanProperty：当组件需要布尔值时使用在SmartDashboard上放置一个按钮

source: DoubleProperty: used when a component needs a number value e.g. PID constantsChoicesProperty
es_mx: DoubleProperty: se utiliza cuando un componente necesita un valor numérico, p. Ej. Constantes PIDChoicesProperty
fr_ca: DoubleProperty: utilisé lorsqu’un composant a besoin d’une valeur numérique, par exemple PID constantsChoicesProperty
tr_tr: DoubleProperty: bir bileşen bir sayı değerine ihtiyaç duyduğunda kullanılır, ör. PID sabitleriSeçimlerÖzellik
zh_cn: DoubleProperty：在组件需要数字值使用，例如， PID常数选择属性

source: ChildSelectionProperty: used when you need to choose a child component e.g. motor controllers in a RobotDrive
es_mx: ChildSelectionProperty: se usa cuando necesita elegir un componente secundario, p. ej. controladores de motor en un RobotDrive
fr_ca: ChildSelectionProperty: ce paramètre est utilisé lorsque vous devez choisir un composant enfant, par exemple des contrôleurs de moteurs dans un RobotDrive
tr_tr: ChildSelectionProperty: bir alt bileşen seçmeniz gerektiğinde kullanılır, ör. bir RobotDrive'daki motor kontrolörleri
zh_cn: ChildSelectionProperty：当您需要选择子组件时使用，例如RobotDrive中的电机控制器

source: TypeSelectionProperty: used when you need to choose any component of the given type from anywhere in the program e.g. input and output for a PID command
es_mx: TypeSelectionProperty: se usa cuando necesita elegir cualquier componente del tipo dado desde cualquier lugar del programa, p. entrada y salida para un comando PID
fr_ca: TypeSelectionProperty: utilisé lorsque vous devez choisir n’importe quel composant du type donné de n’importe où dans le programme, par exemple l’entrée et la sortie pour une commande PID
tr_tr: TypeSelectionProperty: programın herhangi bir yerinden verilen türdeki herhangi bir bileşeni seçmeniz gerektiğinde kullanılır, ör. PID komutu için giriş ve çıkış
zh_cn: TypeSelectionProperty：当您需要从程序中的任何位置选择给定类型的任何组件时使用，例如PID指令的输入和输出

source: The fields for each property are described below:
es_mx: Los campos de cada propiedad se describen a continuación:
fr_ca: Les champs de chaque propriété sont décrits ci-dessous :
tr_tr: Her mülkün alanları aşağıda açıklanmıştır:
zh_cn: 每个属性的字段所述：

source: You may have noticed "KiwiDriveValidator" in the validators entry of each of the motor properties in PaletteDescription.yaml. It's not a built-in validator, so it had to be defined in Validators.yaml. This example validator is very simple - it just makes sure that each of the named fields has a different value than the others.
es_mx: Es posible que haya notado "KiwiDriveValidator" en la entrada de los validadores de cada una de las propiedades del motor en PaletteDescription.yaml. No es un validador integrado, por lo que tuvo que definirse en Validators.yaml. Este validador de ejemplo es muy simple: solo se asegura de que cada uno de los campos nombrados tenga un valor diferente al de los demás.
fr_ca: Vous avez peut-être remarqué "KiwiDriveValidator" dans l’entrée validateurs de chacune des propriétés des moteurs dans PaletteDescription.yaml. Ce n’est pas un validateur intégré, il a donc dû être défini dans Validators.yaml. Cet exemple de validateur est très simple - il s’assure simplement que chacun des champs nommés a une valeur différente des autres.
tr_tr: PaletteDescription.yaml içindeki motor özelliklerinin her birinin doğrulayıcılar girişinde "KiwiDriveValidator" olduğunu fark etmiş olabilirsiniz. Yerleşik bir doğrulayıcı olmadığı için Validators.yaml'de tanımlanması gerekiyordu. Bu örnek doğrulayıcı çok basittir - sadece adlandırılmış alanların her birinin diğerlerinden farklı bir değere sahip olmasını sağlar.
zh_cn: 您可能已经在PaletteDescription.yaml中每个电动机属性的验证器条目中注意到“ KiwiDriveValidator”。它不是内置的验证器，因此必须在Validators.yaml中定义。这个示例验证器非常简单-只需确保每个命名字段的值都与其他字段的不同。

source: Built-in Validators and Validator Types
es_mx: Validadores integrados y tipos de validador
fr_ca: Validateurs intégrés et types de validateurs
tr_tr: Yerleşik Validator-doğrulayıcı ve ValidatorTürleri
zh_cn: 内置验证器和验证器类型

source: The built-in validators are very useful (especially the UniqueValidators for port/channel use), but sometimes a custom validator is needed, like in the previous step
es_mx: Los validadores integrados son muy útiles (especialmente los UniqueValidators para uso de puertos / canales), pero a veces se necesita un validador personalizado, como en el paso anterior
fr_ca: Les validateurs intégrés sont très utiles (en particulier les UniqueValidators pour l’utilisation port/canal), mais parfois un validateur personnalisé est nécessaire, comme dans l’étape précédente
tr_tr: Yerleşik doğrulayıcılar çok kullanışlıdır (özellikle bağlantı noktası / kanal kullanımı için UniqueValidators), ancak bazen önceki adımda olduğu gibi özel bir doğrulayıcıya ihtiyaç duyulur
zh_cn: 内置验证器非常有用（特别是用于端口/通道的UniqueValidators），但是有时需要自定义验证器，如上一步

source: DistinctValidator: Makes sure the values of each of the given fields are unique
es_mx: DistinctValidator: se asegura de que los valores de cada uno de los campos dados sean únicos
fr_ca: DistinctValidator: Garantit que les valeurs de chacun des champs donnés sont uniques
tr_tr: DistinctValidator: Verilen alanların her birinin değerlerinin benzersiz olduğundan emin olur
zh_cn: DistinctValidator：确保每个给定字段的值都是唯一的

source: ExistsValidator: Makes sure that a value has been set for the property using this validator
es_mx: ExistsValidator: se asegura de que se haya establecido un valor para la propiedad usando este validador
fr_ca: ExistsValidator: Garantit qu’une valeur a été définie pour la propriété à l’aide de ce validateur
tr_tr: ExistsValidator: Bu doğrulayıcı kullanılarak cihaz için bir değerin ayarlandığından emin olur
zh_cn: ExistsValidator：确保已使用此验证器为属性设置一个值

source: UniqueValidator: Makes sure that the value for the property is unique globally for the given fields
es_mx: UniqueValidator: se asegura de que el valor de la propiedad sea único globalmente para los campos dados
fr_ca: UniqueValidator: S’assure que la valeur de la propriété est unique globalement pour les champs donnés
tr_tr: UniqueValidator: Özelliğin değerinin verilen alanlar için genel olarak benzersiz olduğundan emin olur
zh_cn: UniqueValidator：确保该属性的值在给定字段中是全局唯一

source: ListValidator: Makes sure that all the values in a list property are valid
es_mx: ListValidator: se asegura de que todos los valores de una propiedad de lista sean válidos
fr_ca: ListValidator: S’assure que toutes les valeurs d’une liste propriété sont valides
tr_tr: ListValidator: Bir liste özelliğindeki tüm değerlerin geçerli olduğundan emin olur
zh_cn: ListValidator：确保列表属性中的所有值均有效

source: C++ Export.yaml
zh_cn: C ++ 输出.yaml

source: A line-by-line breakdown of the file:
es_mx: Un desglose línea por línea del archivo:
fr_ca: Analyse du fichier ligne par ligne
tr_tr: Dosyanın satır satır dökümü:
zh_cn: 文件的逐行细分：

source: Kiwi Drive: the name of the component being exported. This is the same as the name set in PaletteDescription.yaml, and the name of the folder containing this file
es_mx: Kiwi Drive: el nombre del componente que se exporta. Este es el mismo que el nombre establecido en PaletteDescription.yaml y el nombre de la carpeta que contiene este archivo
fr_ca: Kiwi Drive: Le nom du composant exporté. Il s’agit du même nom que le nom défini dans PaletteDescription.yaml, et le nom du dossier contenant ce fichier
tr_tr: Kiwi Drive: dışa aktarılan bileşenin adı. Bu, PaletteDescription.yaml'de ayarlanan ad ve bu dosyayı içeren klasörün adıyla aynıdır.
zh_cn: Kiwi驱动器：要导出的组件的名称。这与在PaletteDescription.yaml中设置的名称相同，也和包含此文件的文件夹的名称相同。

source: Defaults: provides some default values for includes needed by this component, the name of the class, a construction template, and more. The CustomComponent default adds an include for ``Custom/${ClassName}.h`` to every generated file that uses the component (e.g. ``RobotDrive.h`` would have ``#include "Custom/KiwiDrive.h`` the top of the file)
es_mx: Valores predeterminados: proporciona algunos valores predeterminados para las inclusiones que necesita este componente, el nombre de la clase, una plantilla de construcción y más. El CustomComponent predeterminado agrega una inclusión para``Custom/${ClassName}.h`` a cada archivo generado que usa el componente (por ejemplo, ``RobotDrive.h`` tendría ``#include "Custom/KiwiDrive.h`` la parte superior del archivo)
fr_ca: Defaults: fournit certaines valeurs par défaut pour les fichiers d'inclusion nécessaires à ce composant, le nom de la classe, un modèle de construction, et plus encore. Le CustomComponent par défaut ajoute une inclusion pour ``Custom/${ClassName}.h`` à chaque fichier généré qui utilise le composant (par exemple ``RobotDrive.h`` aurait ``#include Custom/KiwiDrive.h`` en haut du fichier)
tr_tr: Varsayılanlar: Bu bileşenin ihtiyaç duyduğu dahil etme, sınıfın adı, bir yapı şablonu ve daha fazlası için bazı varsayılan değerler sağlar. CustomComponent varsayılanı, bileşeni kullanan her oluşturulan dosyaya ``Custom/${ClassName}.h`` için bir include ekler (örneğin, ``RobotDrive.h``, ``#include "Custom/KiwiDrive.h`` içerir. dosyanın üst kısmı)
zh_cn: 默认值：提供一些默认值，包括该组件所需的包含值，类的名称，构造模板等。默认情况下，CustomComponent向使用该组件的每个生成的文件中添加“ Custom / $ {ClassName} .h”的包含项（例如“ RobotDrive.h”将具有“ #include“ Custom / KiwiDrive.h``文件的顶部）

source: ClassName: the name of the custom class you're adding.
es_mx: ClassName: el nombre de la clase personalizada que está agregando.
fr_ca: ClassName: nom de la classe personnalisée que vous ajoutez.
tr_tr: ClassName: eklediğiniz özel sınıfın adı.
zh_cn: ClassName：您要添加的自定义类的名称。
