Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/advanced/robotbuilder-setpoint-command.po
Languages: fr_ca

source: Setpoint Command
fr_ca: Commande de Point de consigne (Setpoint)

source: A Setpoint Command works in conjunction with a PIDSubsystem to drive an actuator to a particular angle or position that is measured using a potentiometer or encoder. This happens so often that there is a shortcut in RobotBuilder to do this task.
fr_ca: Une commande de point de consigne fonctionne en conjonction avec un sous-système PID pour entraîner un actionneur à un angle ou une position particulière qui est mesurée à l'aide d'un potentiomètre ou d'un encodeur. Cela arrive si souvent qu'il existe un raccourci dans RobotBuilder pour effectuer cette tâche.

source: Start with a PIDSubsystem
fr_ca: Commencer avec un PIDSubsystem

source: Suppose in a robot there is a wrist joint with a potentiometer that measures the angle. First :doc:`create a PIDSubsystem <robotbuilder-writing-pidsubsystem-code>` that include the motor that moves the wrist joint and the potentiometer that measures the angle. The PIDSubsystem should have all the PID constants filled in and working properly.
fr_ca: Supposons que dans un robot il y ait un bras articulé avec un potentiomètre qui mesure l'angle. En premier lieu :doc:`créer un PIDSubsystem <robotbuilder-writing-pidsubsystem-code>` qui inclut le moteur qui déplace l'articulation et le potentiomètre qui mesure l'angle. Le sous-système PIDS doit avoir toutes les constantes PID pré-définies et doit pouvoir fonctionner correctement.

source: It is important to set the **Tolerance** parameter. This controls how far off the current value can be from the setpoint and be considered on target. This is the criteria that the SetpointCommand uses to move onto the next command.
fr_ca: Il est important de définir le paramètre **Tolerance**. Celui-ci permet une distance admissible entre la valeur actuelle et le point de consigne et lorsque la valeur d'erreur est inférieure à "Tolerance", SetpointCommand passe alors à la commande suivante.

source: Creating the Setpoint Command
fr_ca: Création de la commande du Point de consigne

source: Right-click on the Commands folder in the palette and select "Add Setpoint command".
fr_ca: Cliquez avec le bouton droit sur le dossier Commandes dans la palette et sélectionnez "Add Setpoint command".

source: Setpoint Command Parameters
fr_ca: Paramètres de commande du point de consigne

source: Fill in the name of the new command. The Requires field is the PIDSubsystem that is being driven to a setpoint, in this case the Elevator subsystem.
fr_ca: Remplissez le nom de la nouvelle commande. Le champ Requires est le PIDSubsystem qui est conduit à un point de consigne, dans ce cas le sous-système Elevator.

source: Click on the Parameter Presets to set up the setpoints.
fr_ca: Cliquez sur Paramètres prédéfinis pour configurer les points de consigne.

source: Select :guilabel:`Add Preset`
fr_ca: Sélectionnez :guilabel:`Add Preset`

source: Enter a preset name (in this case 'bottom'
fr_ca: Entrez un nom prédéfini (dans ce cas 'bottom')

source: Click the dropdown next to the setpoint entry box
fr_ca: Cliquez sur la liste déroulante à côté de la zone de saisie du point de consigne

source: Select the Elevator.Bottom constant, that was created in the Elevator subystem previously
fr_ca: Sélectionnez la constante Elevator.Bottom, qui a été créée précédemment dans le sous-système Elevator

source: Repeat steps 2-5 for the other setpoints.
fr_ca: Répétez les étapes 2 à 5 pour les autres points de consigne.

source: Click :guilabel:`Save and close`
fr_ca: Cliquez sur :guilabel:`Save and close`

source: There is no need to fill in any code for this command, it is automatically created by RobotBuilder.
fr_ca: Il n'est pas nécessaire de remplir de code pour cette commande, elle est automatiquement créée par RobotBuilder.

source: Whenever this command is scheduled, it will automatically drive the subsystem to the specified setpoint. When the setpoint is reached within the tolerance specified in the PIDSubsystem, the command ends and the next command starts. It is important to specify a tolerance in the PIDSubsystem or this command might never end because the tolerance is not achieved.
fr_ca: Chaque fois que cette commande est planifiée, elle conduira automatiquement le sous-système au point de consigne spécifié. Lorsque le point de consigne est atteint dans la tolérance spécifiée dans le PIDSubsystem, la commande se termine et la commande suivante démarre. Il est important de spécifier une tolérance acceptable dans le PIDSubsystem sinon cette commande pourrait ne jamais se terminer, faute d'atteindre la tolérance.

source: For more information about PID Control, please see the :ref:`Advanced Controls Introduction <docs/software/advanced-controls/introduction/index:Advanced Controls Introduction>`.
fr_ca: Pour plus d'informations sur le contrôle PID, veuillez consulter :réf:`Introduction aux contrôles avancés <docs/software/advanced-controls/introduction/index:Advanced Controls Introduction>`.
