Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/advanced/robotbuilder-drive-tank.po
Languages: tr_tr

source: Driving the Robot with Tank Drive and Joysticks
tr_tr: Robotu Tank Sürüş methodu ve Joysticklerle Sürmek

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
tr_tr: RobotBuilder, yeni komut tabanlı çerçeveyi desteklemek için güncellendi! Ne yazık ki, bu dokümantasyon güncelliğini yitirmiştir ve yalnızca eski komut temelli çerçeve içindir. Bu dokümantasyonu güncellemekle ilgilenen kişiler, `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ deposuna bakabilirler.

source: A common use case is to have a joystick that should drive some actuators that are part of a subsystem. The problem is that the joystick is created in the OI class and the motors to be controlled are in the subsystem. The idea is to create a command that, when scheduled, reads input from the joystick and calls a method that is created on the subsystem that drives the motors.
tr_tr: Yaygın bir kullanım durumu, bir alt sistemin parçası olan bazı aktüatörleri çalıştırması gereken bir joystick'e sahip olmaktır. Sorun, joystick'in OI sınıfında oluşturulması ve kontrol edilecek motorların alt sistemde olmasıdır. Buradaki fikir, programlandığında, joystick'ten girdi okuyan ve motorları çalıştıran alt sistemde oluşturulan bir yöntemi çağıran bir komut oluşturmaktır.

source: In this example a drive base subsystem is shown that is operated in tank drive using a pair of joysticks.
tr_tr: Bu örnekte, bir çift kumanda kolu kullanılarak tank sürücüsünde çalıştırılan bir sürücü tabanı alt sistemi gösterilmektedir.

source: Create a Drive Train Subsystem
tr_tr: Drive Train Subsystem Oluşturun

source: Create a subsystem called Drive Train. Its responsibility will be to handle the driving for the robot base. Inside the Drive Train is a Robot Drive object for a two motor drive robot (in this case). There is a left motor and right motor as part of the Robot Drive 2 class.
tr_tr: Drive Train adlı bir alt sistem oluşturun. Sorumluluğu, robot tabanı için sürüşü idare etmek olacaktır. Aktarma Organının içinde iki motorlu bir robot için bir Robot Drive nesnesi bulunur (bu durumda). Robot Drive 2 sınıfının bir parçası olarak sol motor ve sağ motor bulunmaktadır.

source: Add the Joysticks to the Operator Interface
tr_tr: Joystickleri Operatör Arayüzüne Ekleyin

source: Add two joysticks to the Operator Interface, one is the left stick and the other is the right stick. The y-axis on the two joysticks are used to drive the robots left and right sides.
tr_tr: Operatör Arayüzüne iki kumanda çubuğu ekleyin, biri sol çubuk ve diğeri sağ çubuktur. İki kumanda kolundaki y ekseni, robotları sola ve sağa sürmek için kullanılır.

source: Be sure to export your program to C++ or Java before continuing to the next step.
tr_tr: Sonraki adıma geçmeden önce programınızı C ++ veya Java'ya aktardığınızdan emin olun.

source: Create a Method to Write the Motors on the Subsystem
tr_tr: Motorları Alt Sisteme Yazmak İçin Bir Yöntem Oluşturun

source: Create a method that takes the joystick inputs, in this case the the left and right driver joystick. The values are passed to the RobotDrive object that in turn does tank steering using the joystick values. Also create a method called stop() that stops the robot from driving, this might come in handy later.
tr_tr: Kumanda kolu girişlerini, bu durumda sol ve sağ sürücü kumanda çubuğunu alan bir yöntem oluşturun. Değerler, joystick değerlerini kullanarak tankı yönlendiren RobotDrive nesnesine aktarılır. Ayrıca robotun hareket etmesini engelleyen stop () adında bir yöntem oluşturun, bu daha sonra kullanışlı olabilir.

source: The extra RobotBuilder comments have been removed to format the example for the documentation.
tr_tr: Ek RobotBuilder yorumları, dokümantasyon örneğini biçimlendirmek için kaldırılmıştır.

source: Read Joystick Values and Call the Subsystem Methods
tr_tr: Kumanda Kolu Değerlerini Okuyun ve Alt Sistem Yöntemlerini Çağırın

source: Create a command, in this case called DriveWithJoysticks. Its purpose will be to read the joystick values and send them to the Drive Base subsystem. Notice that this command Requires the Drive Train subsystem. This will cause it to stop running whenever anything else tries to use the Drive Train.
tr_tr: Bu durumda DriveWithJoysticks adlı bir komut oluşturun. Amacı, joystick değerlerini okumak ve Drive Base alt sistemine göndermek olacaktır. Bu komutun Drive Train alt sistemini Gerektirdiğine dikkat edin. Bu, Drive Train'i başka bir şey kullanmaya çalıştığında çalışmasının durmasına neden olacaktır.

source: Add the Code to do the Driving
tr_tr: Sürüş yapmak için Kodu Ekleyin

source: Add code to the execute method to do the actual driving. All that is needed is to get the Joystick objects for the left and right drive joysticks and pass them to the Drive Train subsystem. The subsystem just uses them for the tank steering method on its RobotDrive object. And we get tank steering.
tr_tr: Gerçek sürüşü yapmak için yürütme yöntemine kod ekleyin. Tek gereken, sol ve sağ sürüş joystickleri için Joystick nesnelerini almak ve bunları Drive Train alt sistemine iletmektir. Alt sistem, bunları yalnızca RobotDrive nesnesinde tank yönlendirme yöntemi için kullanır. Ve tankı yönlendiriyoruz.

source: We also filled in the ``end()`` and ``interrupted()`` methods so that when this command is interrupted or stopped, the motors will be stopped as a safety precaution.
tr_tr: Ayrıca `` end ()`` ve `` interrupted ()`` yöntemlerini de doldurduk, böylece bu komut kesildiğinde veya durdurulduğunda, güvenlik önlemi olarak motorlar durdurulacaktır.

source: Make Default Command
tr_tr: Varsayılan Komutu Yap

source: The last step is to make the DriveWIthJoysticks command be the "Default Command" for the Drive Train subsystem. This means that whenever no other command is using the Drive Train, the Joysticks will be in control. This is probably the desirable behavior. When the autonomous code is running, it will also require the drive train and interrupt the "DriveWithJoystick" command. When the autonomous code is finished, the DriveWithJoysticks command will restart automatically (because it is the default command), and the operators will be back in control. If you write any code that does teleop automatic driving, those commands should also "require" the DriveTrain so that they too will interrupt the DriveWithJoysticks command and have full control.
tr_tr: Son adım, DriveWIthJoysticks komutunun Drive Train alt sistemi için "Default Command-Varsayılan Komut" olmasını sağlamaktır. Bu, Aktarma Sistemini başka bir komut kullanmadığında kumanda kollarının kontrol altında olacağı anlamına gelir. Muhtemelen arzu edilen davranış budur. Otonom kod çalışırken, aynı zamanda aktarma organını gerektirecek ve "DriveWithJoystick" komutunu kesecektir. Otonom kod bittiğinde, DriveWithJoysticks komutu otomatik olarak yeniden başlayacak (çünkü bu varsayılan komuttur) ve operatörler kontrolü geri alacak. Teleop otomatik sürüş yapan herhangi bir kod yazarsanız, bu komutlar da DriveTrain'i "require-gerektirmelidir", böylece onlar da DriveWithJoysticks komutunu kesecek ve tam kontrole sahip olacaktır.

source: Be sure to export your program to C++ or Java before continuing.
tr_tr: Devam etmeden önce programınızı C ++ veya Java'ya aktardığınızdan emin olun.
