Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/advanced/robotbuilder-pidsubsystem-actuators.po
Languages: es_mx, fr_ca, zh_cn

source: Using PIDSubsystem to Control Actuators
es_mx: Uso del subsistema PID para controlar actuadores
fr_ca: Utilisation du sous-système PIDS pour contrôler les dispositifs actionneurs
zh_cn: 使用PID子系统控制执行器

source: More advanced subsystems will use sensors for feedback to get guaranteed results for operations like setting elevator heights or wrist angles. PIDSubsystems use feedback to control the actuator and drive it to a particular position. In this example we use an elevator with a 10-turn potentiometer connected to it to give feedback on the height. The PIDSubsystem has a built-in PIDController to automatically control the mechanism to the correct setpoints.
fr_ca: Des sous-systèmes plus avancés utiliseront des capteurs avec rétroaction pour obtenir des résultats garantis pour des opérations telles que le réglage de la hauteur des ascenseurs ou des angles du poignet. Les sous-systèmes PID utilisent la rétroaction pour contrôler l'actionneur et l'amener à une position particulière. Dans cet exemple, nous utilisons un ascenseur avec un potentiomètre à 10 tours connecté pour donner un retour sur la hauteur. Le PIDSubsystem a un PIDController intégré pour contrôler automatiquement le mécanisme aux points de consigne corrects.

source: Create a PIDSubsystem
es_mx: Crear un subsistema PID
fr_ca: Créer un sous-système PIDS
zh_cn: 创建一个PID子系统

source: Creating a subsystem that uses feedback to control the position or speed of a mechanism is very easy.
es_mx: Crear un subsistema que use retroalimentación para controlar la posición o velocidad de un mecanismo es muy fácil.
fr_ca: La création d'un sous-système qui utilise la rétroaction pour contrôler la position ou la vitesse d'un mécanisme est très facile.
zh_cn: 创建一个使用反馈来控制机制的位置或速度的子系统非常容易。

source: Drag a PIDSubsystem from the palette to the Subsystems folder in the robot description
es_mx: Arrastre un subsistema PID desde la paleta a la carpeta Subsistemas en la descripción del robot.
fr_ca: Incorporer un sous-système PIDS dans la description du robot en faisant "glisser" (drag) son icône de la palette vers le dossier Sous-systèmes
zh_cn: 将PID子系统从面板拖到机械手描述中的子系统文件夹中

source: Rename the PID Subsystem to a more meaningful name for the subsystem, in this case Elevator
es_mx: Cambiar el nombre del subsistema PID por un nombre más significativo para el subsistema, en este caso Elevator
fr_ca: Renommez le sous-système PID en utilisant un nom plus significatif, et descriptif pour le sous-système, dans ce cas-ci, Elevator
zh_cn: 将 PID 子系统重命名为对子系统更有意义的名称，在本例中为升降机

source: Notice that some of the parts of the robot description have turned red. This indicates that these components (the PIDSubsystem) haven't been completed and need to be filled in. The properties that are either missing or incorrect are shown in red.
es_mx: Observe que algunas de las partes de la descripción del robot se han vuelto rojas. Esto indica que estos componentes (el subsistema PID) no se han completado y deben completarse. Las propiedades que faltan o son incorrectas se muestran en rojo.
fr_ca: Notez que certaines parties de la description du robot sont maintenant devenues rouges. Cela indique que ces composants (le sous-système PIDS) doivent être complétés et leurs champs doivent être remplis. Les propriétés manquantes ou incorrectes sont affichées en rouge.
zh_cn: 请注意，机械手说明的某些部分已变为红色。这表明这些组件（PIDSubsystem）尚未完成，需要填写。缺失或不正确的属性以红色显示。

source: Adding Sensors and Actuators to the PIDSubsystem
es_mx: Adición de sensores y actuadores al subsistema PID
fr_ca: Ajout de capteurs et de dispositifs actionneurs au sous-système PIDS
zh_cn: 将传感器和执行器添加到PID子系统

source: Add the missing components for the PIDSubsystem
es_mx: Agregue los componentes que faltan para el subsistema PID
fr_ca: Ajouter les composants manquants pour le PIDSubsystem
zh_cn: 为PID子系统添加缺少的组件

source: Drag in the actuator (a motor controller) to the particular subsystem - in this case the Elevator
es_mx: Arrastrar el actuador (un controlador de motor) al subsistema particular - en este caso el Elevador
fr_ca: Faites glisser l’actionneur (un contrôleur de moteur) vers le sous-système concerné - dans ce cas, l’élevateur
zh_cn: 将执行器（电机控制器）拖到特定的子系统中-在本例中为电梯

source: Drag the sensor that will be used for feedback to the subsystem, in this case the sensor is a potentiometer that might give elevator height feedback.
es_mx: Arrastre el sensor que se utilizará para la retroalimentación al subsistema, en este caso el sensor es un potenciómetro que podría dar retroalimentación de la altura del ascensor.
fr_ca: Faites glisser le capteur qui sera utilisé pour la rétroaction vers le sous-système, dans ce cas, le capteur est un potentiomètre qui pourrait donner une rétroaction de la hauteur de l'ascenseur.
zh_cn: 将将用于反馈的传感器拖动到子系统，在这种情况下，该传感器是一个电位计，可提供电梯高度反馈。

source: Fill in the PID Parameters
es_mx: Rellenar los parámetros PID
fr_ca: Remplissez les paramètres du PID
zh_cn: 填写PID参数

source: The P, I, and D values need to be filled in to get the desired sensitivity and stability of the component. In the case of our elevator we use a proportional constant of 6.0 and 0 for the I and D terms.
es_mx: Los valores P, I y D deben ser rellenados para obtener la sensibilidad y estabilidad deseada del componente. En el caso de nuestro ascensor utilizamos una constante proporcional de 6,0 y 0 para los términos I y D.
fr_ca: Les valeurs P, I et D doivent être définies pour obtenir la sensibilité et la stabilité souhaitées du mécanisme. Dans le cas de notre élevateur nous utilisons un gain proportionnel de 6.0 et 0 pour les termes I et D.
zh_cn: 需要填写 P、I 和 D 值以获得所需的组件灵敏度和稳定性。对于我们的升降机，我们使用 6.0 和 0 的比例常数来表示 I 和 D 项。

source: Create Setpoint Constants
es_mx: Crear Constantes de Setpoint
fr_ca: Création des constantes des points de consigne
zh_cn: 创建设定点常数

source: In order to make it easier to manage elevator setpoints, we will create constants to manage the setpoints. Click on the constants box to bring up the constants dialog.
es_mx: Para facilitar la gestión de los puntos de ajuste del ascensor, crearemos constantes para gestionar los puntos de ajuste. Haga clic en el cuadro de constantes para que aparezca el diálogo de constantes.
fr_ca: Afin de faciliter la gestion des points de consigne de l'élevateur, nous créerons des constantes pour précisément gérer ces points de consigne. Cliquez sur la boîte de constants pour la faire faire apparaitre.
zh_cn: 为了更轻松地管理升降机设定值，我们将创建常量来管理设定值。单击常量框以显示常量对话框。

source: Click on the :guilabel:`add constant` button
es_mx: Haga clic en el botón :guilabel:`add constant`
fr_ca: Cliquez sur le bouton :guilabel:`add constant`
zh_cn: 单击:guilabel:`添加常量` 按钮

source: Fill in a name for the constant, in this case: Bottom
es_mx: Ponga un nombre para la constante, en este caso: Bottom
fr_ca: Saisissez le nom de la constante, dans ce cas : Bottom
zh_cn: 填写常量的名称，在本例中：底部

source: Select a type for the constant from the drop-down menu, in this case: double
es_mx: Seleccione un tipo de constante en el menú desplegable, en este caso: double
fr_ca: Sélectionnez, à partir du menu déroulant, un type pour la constante, dans ce cas : double
zh_cn: 从下拉菜单中选择常量的类型，在本例中：双精度小数

source: Select a value for the constant, in this case: 4.65
es_mx: Seleccione un valor para la constante, en este caso: 4.65
fr_ca: Sélectionnez une valeur pour la constante, dans ce cas : 4.65
zh_cn: 为常量选择一个值，在本例中为：4.65

source: Click :guilabel:`add constant` to continue adding constants
es_mx: Haga clic en :guilabel:`add constant` para seguir agregando cosntantes
fr_ca: Cliquez sur :guilabel:`add constant` pour continuer à ajouter d'autres constantes
zh_cn: 点击:guilabel:`add constant` 继续添加常量

source: After entering all constants, Click :guilabel:`Save and close`
fr_ca: Après avoir entré toutes les constantes, cliquez sur :guilabel:`Save and close`

source: More advanced subsystems will use sensors for feedback to get guaranteed results for operations like setting elevator heights or wrist angles. The PIDSubsystem has a built-in PIDController to automatically control the mechanism to the correct setpoints.
zh_cn: 更高级的子系统将使用传感器进行反馈，以获得有保证的操作结果，例如设置升降机高度或手腕角度。 PIDSubsystem 有一个内置的 PIDController 来自动控制机制到正确的设定点。
