Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/advanced/robotbuilder-writing-pidsubsystem-code.po
Languages: fr_ca, tr_tr

source: Writing the Code for a PIDSubsystem
fr_ca: Écrire le code pour PIDSubsystem
tr_tr: PIDSubsystem için Kod Yazma

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
tr_tr: RobotBuilder, yeni komut tabanlı çerçeveyi desteklemek için güncellendi! Ne yazık ki, bu dokümantasyon güncelliğini yitirmiştir ve yalnızca eski komut tabanlı çerçeve içindir. Bu dokümantasyonu güncellemekle ilgilenen kişiler, `frc-docs <https://github.com/wpilibsuite/frc-docs>` __ havuzuna destekte bulunabilirler.

source: PIDSubsystems use feedback to control the actuator and drive it to a particular position. In this example we use an elevator with a 10-turn potentiometer connected to it to give feedback on the height. The skeleton of the PIDSubsystem is generated by the RobotBuilder and we have to fill in the rest of the code to provide the potentiometer value and drive the motor with the output of the embedded PIDController.
tr_tr: PIDS alt sistemleri, aktüatörü kontrol etmek ve onu belirli bir konuma sürmek için geri besleme kullanır. Bu örnekte, yükseklik hakkında geri bildirim vermek için 10 dönüşlü potansiyometreye bağlı bir asansör kullanıyoruz. PIDSubsystem'in iskeleti RobotBuilder tarafından oluşturulur ve potansiyometre değerini sağlamak ve motoru gömülü PIDController çıkışı ile çalıştırmak için kodun geri kalanını doldurmamız gerekir.

source: Setting the PID Constants
fr_ca: Définition des constantes PID
tr_tr: PID Constants-Sabitlerini Ayarlama

source: Make sure the Elevator PID subsystem has been created in the RobotBuilder. Once it's all set, generate Java/C++ code for the project using the Export menu or the Java/C++ toolbar menu.
fr_ca: Assurez-vous que le sous-système Elevator PID a été créé dans RobotBuilder. Une fois que tout est défini, générer le code Java/C ++ pour le projet à l'aide du menu Export ou du menu de la barre d'outils Java/C ++.
tr_tr: Elevator PID alt sisteminin RobotBuilder'da oluşturulduğundan emin olun. Tamamen ayarlandıktan sonra, Dışa Aktar menüsünü veya Java / C ++ araç çubuğu menüsünü kullanarak proje için Java / C ++ kodu oluşturun.

source: Add Constants for Elevator Preset Positions
tr_tr: Elevator Ön Ayar Konumları için Sabit Ekleme

source: To make it easier to drive the elevator to preset positions, we added preset positions for the bottom, stow, and table height. Then the elevator is set to the STOW position by setting the PID setpoint and the PID controller is enabled. This will cause the elevator to move to the stowed position when the robot is enabled.
tr_tr: Elevatorü önceden ayarlanmış konumlara sürmeyi kolaylaştırmak için, alt, istif ve masa yüksekliği için önceden ayarlanmış konumlar ekledik. Daha sonra asansör, PID ayar noktası ayarlanarak STOW konumuna ayarlanır ve PID kontrolörü etkinleştirilir. Bu, robot etkinleştirildiğinde asansörün istifleme konumuna hareket etmesine neden olacaktır.

source: Adding the Constants to the Header File (C++ Only)
tr_tr: Sabitleri Üstbilgi Dosyasına Ekleme (Yalnızca C++)

source: Return PID Input Values
tr_tr: Dönüş PID Giriş Değerleri

source: The ``returnPIDInput()`` method is used to set the value of the sensor that is providing the feedback for the PID controller. In this case, the code is automatically generated and returns the potentiometer raw analog input value (a number that ranges from 0-1023). In our case we would like the PID controller to be based on the average voltage read by the analog input for the potentiometer, not the raw value.
tr_tr: ``returnPIDInput()`` yöntemi, PID denetleyicisi için geri bildirim sağlayan sensörün değerini ayarlamak için kullanılır. Bu durumda, kod otomatik olarak oluşturulur ve potansiyometre ham analog giriş değerini (0-1023 arasında değişen bir sayı) döndürür. Bizim durumumuzda PID denetleyicisinin ham değere değil potansiyometre için analog giriş tarafından okunan ortalama gerilime dayanmasını istiyoruz.

source: If we just change the line:
tr_tr: Sadece satırı değiştirirsek:

source: ``return potentiometer.pidGet();`` for Java or ``return potentiometer->PIDGet();`` for C++
tr_tr: Java için ``return potentiometer.pidGet();`` veya C++ için ``return potentiometer->PIDGet();``

source: it will be overwritten by RobotBuilder next time we export to Java. You can tell which lines are automatically generated by looking at the "//BEGIN AUTOGENERATED CODE" and "//END AUTOGENERATED CODE" comments. Any code in-between those markers will be overwritten next time RobotBuilder is run. You're free to change anything outside of those blocks.
tr_tr: Java'ya bir sonraki aktarımımızda RobotBuilder tarafından üzerine yazılacaktır."//BEGIN AUTOGENERATED CODE" ve "//END AUTOGENERATED CODE" yorumlarına bakarak hangi satırların otomatik olarak oluşturulduğunu anlayabilirsiniz. Bu işaretçiler arasındaki herhangi bir kod, RobotBuilder'ın bir sonraki çalıştırılışında üzerine yazılacaktır. Bu blokların dışındaki her şeyi değiştirmekte özgürsünüz.

source: Return the Average Voltage
tr_tr: Ortalama Gerilimi Döndür

source: To get around the problem from the last step, the comment blocks can be removed. Then if the line is changed as shown, it will no longer be overwritten by RobotBuilder.
tr_tr: Son adımdaki sorunu aşmak için yorum blokları kaldırılabilir. Ardından, satır gösterildiği gibi değiştirilirse, artık RobotBuilder tarafından üzerine yazılmayacaktır.

source: Remember, if we just wanted to add code to a method it could be added safely outside of the comment blocks.
tr_tr: Unutmayın, sadece bir yönteme kod eklemek istersek, bu kod yorum bloklarının dışına güvenle eklenebilir.

source: That's all that is required to create the Elevator PIDSubsystem.
fr_ca: C'est tout ce qui est nécessaire pour créer le PIDSubsystem Elevator.
tr_tr: Elevator PIDSubsystem oluşturmak için gereken tek şey bu.

source: The skeleton of the PIDSubsystem is generated by the RobotBuilder and we have to fill in the rest of the code to provide the potentiometer value and drive the motor with the output of the embedded PIDController.
fr_ca: Le squelette du PIDSubsystem est généré par le RobotBuilder et nous devons remplir le reste du code pour fournir la valeur du potentiomètre et piloter le moteur avec la sortie du PIDController intégré.

source: RobotBuilder generates the PIDSubsystem methods such that no additional code is needed for basic operation.
fr_ca: RobotBuilder génère les méthodes PIDSubsystem de sorte qu'aucun code supplémentaire n'est nécessaire pour le fonctionnement de base.

source: The height constants and PID constants are automatically generated.
fr_ca: Les constantes de hauteur et les constantes PID sont générées automatiquement.

source: Get Potentiometer Measurement
fr_ca: Obtenir la mesure du potentiomètre

source: The ``getMeasurement()`` method is used to set the value of the sensor that is providing the feedback for the PID controller. In this case, the code is automatically generated and returns the potentiometer voltage as returned by the ``get()`` method.
fr_ca: La méthode ``getMeasurement()`` est utilisée pour définir la valeur du capteur qui fournit la rétroaction pour le contrôleur PID. Dans ce cas, le code est généré automatiquement et renvoie la tension du potentiomètre telle que renvoyée par la méthode ``get()``.

source: Calculate PID Output
fr_ca: Calculer la sortie PID

source: The ``useOutput`` method writes the calculated PID output directly to the motor.
fr_ca: La méthode ``useOutput`` écrit la sortie PID calculée directement dans le moteur.
