Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/advanced/robotbuilder-custom-components.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Construction: an instruction for how the component should be constructed. Variables will be replaced with their values ("${ClassName}" will be replaced with "KiwiDrive"), then macros will be evaluated (for example, ``#variable($Name)`` may be replaced with ``drivebaseKiwiDrive``).
es_mx: Construcción: una instrucción sobre cómo se debe construir el componente. Las variables se reemplazarán con sus valores ("${ClassName}" se reemplazará con "KiwiDrive"), luego se evaluarán las macros (por ejemplo, ``#variable($Name)`` se puede reemplazar con ``drivebaseKiwiDrive``).
fr_ca: Construction: une instruction sur la façon dont le composant doit être construit. Les variables seront remplacées par leurs valeurs ("${ClassName}" sera remplacé par "KiwiDrive"), puis les macros seront évaluées (par exemple, ``#variable($Name)`` pourrait être remplacée par ``drivebaseKiwiDrive``).
tr_tr: Construction : bileşenin nasıl inşa edilmesi gerektiğine dair bir talimat. Değişkenler değerleri ile değiştirilecek ("$ {ClassName}", "KiwiDrive" ile değiştirilecektir), ardından makrolar değerlendirilecektir (örneğin,``#variable($Name)``, ``drivebaseKiwiDrive`` ile değiştirilebilir `).
zh_cn: 构造：有关如何构造组件的说明。变量将被其值替换（“ $ {ClassName}”将被替换为“ Kiwi驱动器”），然后将对宏进行求值（例如，“＃变量（$ Name）”可能会替换为“ drivebaseKiwiDrive”）。

source: This example expects a KiwiDrive class with the constructor
es_mx: Este ejemplo espera una clase KiwiDrive con el constructor
fr_ca: Cet exemple s’attend à une classe KiwiDrive avec le constructeur
tr_tr: Bu örnek, constructor-yapıcıyla bir KiwiDrive sınıfı beklemektedir.
zh_cn: 这个例子要求一个带有构造函数的Kiwi驱动器类型

source: If your team uses Java, this file can be empty.
es_mx: Si su equipo usa Java, este archivo puede estar vacío.
fr_ca: Si votre équipe utilise Java, ce fichier peut être laissé vide.
tr_tr: Ekibiniz Java kullanıyorsa, bu dosya boş olabilir.
zh_cn: 如果您的团队使用Java，则此文件可以为空。

source: Java Export.yaml
zh_cn: Java 导出.yaml

source: Very similar to the C++ export file; the only difference should be the Construction line. This example expects a KiwiDrive class with the constructor
es_mx: Muy similar al archivo de exportación de C++; la única diferencia debería ser la línea de Construcción. Este ejemplo espera una clase KiwiDrive con el constructor
fr_ca: Très similaire au fichier d’exportation C++; la seule différence devrait être la ligne de construction. Cet exemple s’attend à une classe KiwiDrive avec le constructeur
tr_tr: C ++ dışa aktarma dosyasına çok benzer; tek fark İnşaat hattı olmalıdır. Bu örnek, yapıcıyla bir KiwiDrive sınıfı beklemektedir.
zh_cn: 与C ++导出文件非常相似；唯一的区别应该是施工线。施工线要求一个带有构造函数的KiwiDrive类型

source: If your team uses C++, this file can be empty.
es_mx: Si su equipo usa C++, este archivo puede estar vacío.
fr_ca: Si votre équipe utilise C++, ce fichier peut être laissé vide.
tr_tr: Ekibiniz C ++ kullanıyorsa, bu dosya boş olabilir.
zh_cn: 如果您的团队使用C ++，则此文件可以为空。

source: Using Macros and Variables
es_mx: Usar macros y variables
fr_ca: Utilisation de macros et de variables
tr_tr: Makroları ve Değişkenleri Kullanma
zh_cn: 使用宏和变量

source: Macros are simple functions that RobotBuilder uses to turn variables into text that will be inserted into generated code. They always start with the "#" symbol, and have a syntax similar to functions: ``<macro_name>( arg0, arg1, arg2, ...)``. The only macro you'll probably need to use is ``#variable( component_name )``
es_mx: Las macros son funciones simples que utiliza RobotBuilder para convertir variables en texto que se insertará en el código generado. Siempre comienzan con el símbolo "#" y tienen una sintaxis similar a las funciones: ``<macro_name>( arg0, arg1, arg2, ...)``. La única macro que probablemente necesitará usar es ``#variable( component_name )``
fr_ca: Les macros sont des fonctions simples que RobotBuilder utilise pour transformer des variables en texte qui seront insérées dans le code généré. Ils commencent toujours par le Symbole "#", et ont une syntaxe similaire aux fonctions : ``<macro_name>( arg0, arg1, arg2, ...)``. La seule macro que vous aurez probablement besoin d’utiliser est ``#variable( component_name )``
tr_tr: Makrolar, RobotBuilder'ın değişkenleri oluşturulan koda eklenecek metne dönüştürmek için kullandığı basit işlevlerdir. Her zaman "#" simgesiyle başlarlar ve işlevlere benzer bir sözdizimine sahiptirler: ``<macro_name> (arg0, arg1, arg2, ...) `` Muhtemelen kullanmanız gerekecek tek makro ``#variable (bileşen_adı)``dır.
zh_cn: 宏是RobotBuilder用来将变量转换为文本的简单函数，这些文本将插入生成的代码中。它们始终以“＃”符号开头，并且语法类似于函数：``<macro_name>（arg0，arg1，arg2，...）”。您可能需要使用的唯一宏是``#variable（component_name）``

source: ``#variable`` takes a string, usually the a variable defined somewhere (i.e. "Name" is the name given to the component in RobotBuilder, such as "Arm Motor"), and turns it into the name of a variable defined in the generated code. For example, ``#variable("Arm Motor")`` results in the string ``ArmMotor``
es_mx: ``#variable`` toma una cadena, generalmente una variable definida en algún lugar (es decir, "Name" es el nombre que se le da al componente en RobotBuilder, como "Arm Motor"), y lo convierte en el nombre de una variable definida en el código generado. Por ejemplo, ``#variable("Arm Motor")`` da como resultado la cadena ``ArmMotor``
fr_ca: ``#variable`` accepte une chaîne de caractères, généralement la variable définie quelque part (c.-à-d. "Name" est le nom donné au composant dans RobotBuilder, tel que "Arm Motor"), et le transforme en nom d’une variable définie dans le code généré. Par exemple,``#variable("Arm Motor")`` se traduit par la chaîne de caractères ``ArmMotor``
tr_tr: ``#variable`` bir string alır, genellikle bir yerde tanımlanmış bir değişkendir (yani "Name", RobotBuilder'daki bileşene verilen addır, "Kol Motoru" gibi) ve onu içinde tanımlanan bir değişkenin adına dönüştürür. üretilen kod. Örneğin, ``#variable("Arm Motor")``, ``ArmMotor`` dizesiyle sonuçlanır
zh_cn: “ #variable”接受一个字符串，通常是在某个地方定义的变量（即“名称”是给RobotBuilder中的组件命名的名称，例如“手臂电机”），然后将其转换为在中定义的变量的名称。生成的代码。例如，``#variable（“ Arm Motor”）``产生字符串“ ArmMotor``

source: Variables are referenced by placing a dollar sign ("$") in front of the variable name, which an optionally be placed inside curly braces to easily distinguish the variable from other text in the file. When the file is parsed, the dollar sign, variable name, and curly braces are replaced with the value of the variable (e.g. ``${ClassName}`` is replaced with ``KiwiDrive``).
es_mx: Se hace referencia a las variables colocando un signo de dólar ("$") delante del nombre de la variable, que opcionalmente se coloca entre llaves para distinguir fácilmente la variable de otro texto en el archivo. Cuando se analiza el archivo, el signo de dólar, el nombre de la variable y las llaves se reemplazan por el valor de la variable (por ejemplo, ``${ClassName}`` is replaced with ``KiwiDrive``).
fr_ca: Les variables sont référencées en plaçant un signe dollar ("$") devant le nom de la variable, qui peut optionnellement être placé à l’intérieur des accolades pour distinguer facilement la variable d'un autre texte dans le fichier. Lorsque le fichier est analysé, le signe dollar, le nom de la variable et les accolades sont remplacés par la valeur de la variable (p. ex. ``${ClassName}`` est remplacé par ``KiwiDrive``).
tr_tr: Değişkenlere, değişken adının önüne bir dolar işareti ("$") yerleştirilerek başvurulur; bu, değişkeni dosyadaki diğer metinden kolayca ayırt etmek için isteğe bağlı olarak güzel parantez içine yerleştirilebilir. Dosya ayrıştırıldığında dolar işareti, değişken adı ve küme parantezleri değişkenin değeriyle değiştirilir (örneğin, ``${ClassName}``, ``KiwiDrive`` '' ile değiştirilir).
zh_cn: 通过在变量名称前放置一个美元符号（“ $”）来引用变量，可以将其可选地放在花括号内，以方便地将变量与文件中的其他文本区分开。解析文件后，将美元符号，变量名和花括号替换为变量的值（例如，将“ $ {ClassName}”替换为“ KiwiDrive”）。

source: Variables are either component properties (e.g. "Motor 1", "Motor 2", "Motor 3" in the kiwi drive example), or one of the following:
es_mx: Las variables son propiedades de los componentes (por ejemplo, "Motor 1", "Motor 2", "Motor 3" en el ejemplo de la unidad de kiwi) o una de las siguientes:
fr_ca: Les variables sont soit des propriétés de composants (p. ex. "Motor 1", "Motor 2", "Motor 3" dans l’exemple de l'entraînement kiwi), soit l’un des suivants :
tr_tr: Değişkenler, bileşen özellikleridir (örn. Kiwi sürücü örneğinde "Motor 1", "Motor 2", "Motor 3") veya aşağıdakilerden biridir:
zh_cn: 变量可以是组件属性（例如，在kiwi驱动器示例中为“ Motor 1”，“ Motor 2”，“ Motor 3”）或以下之一：

source: Short_Name: the name given to the component in the editor panel in RobotBuilder
es_mx: Short_Name: el nombre que se le da al componente en el panel del editor en RobotBuilder
fr_ca: Short_Name: le nom donné au composant dans le panneau d’édition de RobotBuilder
tr_tr: Short_Name: RobotBuilder'daki editör panelinde bileşene verilen ad
zh_cn: Short_Name：在RobotBuilder的编辑器面板中为组件指定的名称

source: Name: the full name of the component. If the component is in a subsystem, this will be the short name appended to the name of the subsystem
es_mx: Name: el nombre completo del componente. Si el componente está en un subsistema, este será el nombre corto adjunto al nombre del subsistema
fr_ca: Name: le nom complet du composant. Si le composant se trouve dans un sous-système, il s’agit d'un version écourtée du nom ajoutée au nom du sous-système
tr_tr: Ad: bileşenin tam adı. Bileşen bir alt sistemdeyse, bu, alt sistemin adına eklenen kısa ad olacaktır.
zh_cn: Name：组件的全名。如果组件在子系统中，则这是在子系统名称后附加的简称

source: Export: The name of the file this component should be created in, if any. This should be "RobotMap" for components like actuators, controllers, and sensors; or "OI" for things like gamepads or other custom OI components. Note that the "CustomComponent" default will export to the RobotMap.
es_mx: Export: el nombre del archivo en el que se debe crear este componente, si lo hubiera. Debe ser "RobotMap" para componentes como actuadores, controladores y sensores; o "OI" para cosas como gamepads u otros componentes personalizados de OI. Tenga en cuenta que el valor predeterminado "CustomComponent" se exportará a RobotMap.
fr_ca: Export: Le nom du fichier dans lequel ce composant doit être créé, le cas échéant. Cela doit être "RobotMap" pour les composants comme les actionneurs, les contrôleurs et les capteurs; ou "OI" pour des composants comme les gamepads ou d’autres composants OI personnalisés. Notez que le défaut "CustomComponent" s’exportera vers le RobotMap.
tr_tr: Export-Dışa Aktar: Varsa, bu bileşenin içinde oluşturulacağı dosyanın adı. Bu, aktüatörler, kontrolörler ve sensörler gibi bileşenler için "RobotMap" olmalıdır; veya oyun kumandaları veya diğer özel OI bileşenleri gibi şeyler için "OI". "CustomComponent" varsayılanının RobotMap'e aktarılacağını unutmayın.
zh_cn: Export：应在其中创建该组件的文件名。对于执行器，控制器和传感器等组件，应为“ RobotMap”；或对于如操作手柄及其他自定义OI组件时，应为“OI”。请注意，“ CustomComponent”默认值将导出到RobotMap。

source: Import: Files that need to be included or imported for this component to be able to be used.
es_mx: Import: archivos que deben incluirse o importarse para que este componente pueda utilizarse.
fr_ca: Import: Les fichiers qui doivent être inclus ou importés pour que ce composant puisse être utilisé.
tr_tr: Import : Bu bileşenin kullanılabilmesi için dahil edilmesi veya içe aktarılması gereken dosyalar.
zh_cn: Import：要使用此组件需要包含或导入的文件。

source: Declaration: an instruction, similar to Construction, for how to declare a variable of this component type. This is taken care of by the default "None"
es_mx: Declaration: instrucción, similar a Construction, sobre cómo declarar una variable de este tipo de componente. Esto se soluciona con el valor predeterminado "None"
fr_ca: Declaration: une instruction, similaire à Construction, pour savoir comment déclarer une variable de ce type de composant. Ceci est pris en charge par la valeur par défaut "None"
tr_tr: Declaration: Bu bileşen türünde bir değişkenin nasıl beyan edileceğine dair Construction'a benzer bir talimat. Bu, varsayılan "None" olarak alınır.
zh_cn: Declaration：类似于构造的指令，用于声明此组件类型的变量。默认情况下，此设置为“无”

source: Construction: an instruction for how to create a new instance of this component
es_mx: Construction: una instrucción sobre cómo crear una nueva instancia de este componente
fr_ca: Construction: une instruction montrant comment créer une nouvelle instance de ce composant
tr_tr: Construction: bu bileşenin yeni bir örneğinin nasıl oluşturulacağına ilişkin talimat
zh_cn: Construction：有关如何创建此组件的新实例的说明

source: LiveWindow: an instruction for how to add this component to the LiveWindow
es_mx: LiveWindow: una instrucción sobre cómo agregar este componente a LiveWindow
fr_ca: LiveWindow: une instruction montrant comment ajouter ce composant au LiveWindow
tr_tr: LiveWindow: bu bileşenin LiveWindow'a nasıl ekleneceğine dair bir talimat
zh_cn: LiveWindow：有关如何将此组件添加到LiveWindow的说明

source: Extra: instructions for any extra functions or method calls for this component to behave correctly, such as encoders needing to set the encoding type.
es_mx: Extra: instrucciones para cualquier función adicional o llamadas a métodos para que este componente se comporte correctamente, como los codificadores que necesitan establecer el tipo de codificación.
fr_ca: Extra: les instructions relatives à toutes les fonctions ou méthodes exigent que ce composant se fonctionne correctement, tels que les encodeurs qui doivent définir le type d’encodage.
tr_tr: Extra: kodlama türünü ayarlaması gereken kodlayıcılar gibi bu bileşenin doğru davranması için herhangi bir ekstra işlev veya yöntem çağrısı için talimatlar.
zh_cn: Extra：有关任何其他功能或方法的指令，要求此组件正常运行，例如需要设置编码类型的编码器。

source: Prototype (C++ only): The prototype for a function to be created in the file the component is declared in, typically a getter in the OI class
es_mx: Prototype (solo C++): el prototipo de una función que se creará en el archivo en el que se declara el componente, generalmente un captador en la clase OI
fr_ca: Prototype (C++ uniquement) : Le prototype pour la création d’une fonction dans le fichier dans lequel le composant est déclaré, généralement un getter de la classe OI
tr_tr: Prototip (yalnızca C ++): Bileşenin bildirildiği dosyada oluşturulacak bir işlevin prototipi, tipik olarak OI sınıfında bir alıcı
zh_cn: Prototype（仅针对C ++）：在声明组件的文件中创建的函数的原型，通常是OI类中的吸气剂

source: Function: A function to be created in the file the component is declared in, typically a getter in the OI class
es_mx: Function: una función que se creará en el archivo en el que se declara el componente, normalmente un captador en la clase OI
fr_ca: Function : Une fonction à créer dans le fichier dans lequel le composant est déclaré, généralement un getter dans la classe OI
tr_tr: Function: Bileşenin bildirildiği dosyada oluşturulacak bir işlev, genellikle OI sınıfındaki bir alıcı
zh_cn: Function：要在声明组件的文件中创建的函数，通常是OI类中的吸气剂

source: PID: An instruction for how to get the PID output of the component, if it has one (e.g. ``#variable($Short_Name)->PIDGet()``)
es_mx: PID: Una instrucción sobre cómo obtener la salida PID del componente, si tiene una (por ejemplo, ``#variable($Short_Name)->PIDGet()``)
fr_ca: PID : Une instruction montrant la façon d’obtenir la sortie PID du composant, si elle en a une (p. ex. ``#variable($Short_Name)->PIDGet()``)
tr_tr: PID: Eğer varsa, bileşenin PID çıktısının nasıl alınacağına dair bir talimat (örneğin, ``#variable($Short_Name)->PIDGet()``)
zh_cn: PID：如果有组件，则是一个获取组件的PID输出的指令（例如“#variable（$ Short_Name）-> PIDGet（）”）

source: ClassName: The name of the class that the component represents (e.g. ``KiwiDrive`` or ``Joystick``)
es_mx: ClassName: el nombre de la clase que representa el componente (por ejemplo, ``KiwiDrive`` o ``Joystick``)
fr_ca: ClassName: Le nom de la classe que représente le composant (p. ex. ''KiwiDrive'' ou ''Joystick'')
tr_tr: ClassName: Bileşenin temsil ettiği sınıfın adı (örneğin, ``KiwiDrive`` veya ``Joystick``)
zh_cn: ClassName：组件代表的类的名称（例如“ Kiwi驱动器”或“ 操作杆”）

source: If you have variables with spaces in the name (such as "Motor 1", "Right Front Motor", etc.), the spaces need to be replaced with underscores when using them in the export files.
es_mx: Si tiene variables con espacios en el nombre (como "Motor 1", "Right Front Motor", etc.), los espacios deben reemplazarse por guiones bajos cuando los use en los archivos de exportación.
fr_ca: Si vous avez des variables avec des espaces dans le nom (tels que"Motor 1", "Right Front Motor", etc.), les espaces doivent être remplacés par des soulignements lors de leur utilisation dans les fichiers d’exportation.
tr_tr: Adında boşluklar olan değişkenleriniz varsa ("Motor 1", "Sağ Ön Motor" vb.), Dışa aktarma dosyalarında bunları kullanırken boşlukların alt çizgi ile değiştirilmesi gerekir.
zh_cn: 如果您的变量名称中带有空格（例如“ Motor 1”，“ Right Front Motor”等），则在导出文件中使用空格时，需要用下划线替换空格。

source: A HTML file giving information on the component. It is better to have this be as detailed as possible, though it certainly isn't necessary if the programmer(s) are familiar enough with the component, or if it's so simple that there's little point in a detailed description.
es_mx: Un archivo HTML que proporciona información sobre el componente. Es mejor que esto sea lo más detallado posible, aunque ciertamente no es necesario si los programadore(s) están lo suficientemente familiarizados con el componente, o si es tan simple que no tiene mucho sentido una descripción detallada.
fr_ca: Un fichier HTML donnant des informations sur le composant. Il est préférable qu'il soit aussi détaillé que possible, mais il n’est certainement pas nécessaire si le programmeur (s) est ou sont assez familier.s avec le composant, ou si c’est si simple qu’il inutile d'avoir une description détaillée.
tr_tr: Bileşen hakkında bilgi veren bir HTML dosyası. Bunun olabildiğince ayrıntılı olması daha iyidir, ancak programcı (lar) bileşene yeterince aşina ise veya o kadar basitse, ayrıntılı bir açıklamada çok az nokta varsa kesinlikle gerekli değildir.
zh_cn: 一个HTML文件，提供有关组件的信息。最好使它尽可能详细，尽管如果这一个（或多个）程序员对组件足够熟悉，或者它很简单以至于在详细描述中没什么用处时，这个是肯定没有必要的。

source: A configuration file to hold miscellaneous information about the component. Currently, this only has the section of the palette to put the component in.
es_mx: Un archivo de configuración para contener información diversa sobre el componente. Actualmente, esto solo tiene la sección de la paleta para colocar el componente.
fr_ca: Un fichier de configuration pour contenir diverses informations sur le composant. Actuellement, il y a que la section de la palette pour contenir le composant
tr_tr: Bileşen hakkında çeşitli bilgileri tutan bir yapılandırma dosyası. Şu anda, bu yalnızca bileşeni yerleştirmek için palet bölümüne sahiptir.
zh_cn: 一个配置文件，用于保存有关组件的其他信息。当前，只有调色板的该部分可以放入组件。

source: The sections of the palette (these are case sensitive):
es_mx: Las secciones de la paleta (distinguen entre mayúsculas y minúsculas):
fr_ca: Les sections de la palette (celles-ci sont sensibles à la casse) :
tr_tr: Paletin bölümleri (bunlar büyük / küçük harfe duyarlıdır):
zh_cn: 面板的各部分（区分大小写）：

source: Subsystems
es_mx: Subsistemas
tr_tr: Alt sistemler
zh_cn: Subsystems 子系统

source: Controllers
es_mx: Controladores
tr_tr: Kontrolörler
zh_cn: Controllers 控制器

source: Sensors
es_mx: Sensores
tr_tr: Sensörler
zh_cn: Sensors 感测器

source: Actuators
es_mx: Actuadores
tr_tr: Aktüatörler
zh_cn: Actuators 执行器

source: Pneumatics
es_mx: Neumática
tr_tr: Pnömatik
zh_cn: Pneumatics 气动式

source: Commands
es_mx: Comandos
tr_tr: Komutlar
zh_cn: Commands 指令

source: The icon that shows up in the palette and the help page. This should be a 64x64 ``.png`` file.
es_mx: El icono que aparece en la paleta y la página de ayuda. Debe ser un archivo``.png`` de 64x64.
fr_ca: L'Icône qui apparaît dans la palette et la page d’aide. Il devrait être un fichier 64x64 ``.png``.
tr_tr: Palette ve yardım sayfasında görünen simge. Bu 64x64 ``.png`` dosyası olmalıdır.
zh_cn: 显示在选用板和帮助页面中的图标。这应该是64x64的.png文件。

source: It should use the color scheme and general style of the section it's in to avoid visual clutter, but this is entirely optional. Photoshop ``.psd`` files of the icons and backgrounds are in `src/main/icons/icons <https://github.com/wpilibsuite/RobotBuilder/tree/main/src/main/icons/icons>`_ and png files of the icons and backgrounds are in `src/main/resources/icons <https://github.com/wpilibsuite/RobotBuilder/tree/main/src/main/resources/icons>`_.
es_mx: Debe usar la combinación de colores y el estilo general de la sección en la que se encuentra para evitar el desorden visual, pero esto es completamente opcional. Los archivos `` .psd '' de Photoshop de los iconos y fondos están en `src/main/icons/icons <https://github.com/wpilibsuite/RobotBuilder/tree/main/src/main/icons/icons>`_ y los archivos png de los iconos y fondos están en `src/main/resources/icons <https://github.com/wpilibsuite/RobotBuilder/tree/main/src/main/resources/icons>`_.
fr_ca: Il devrait utiliser le schéma de couleurs et le style général de la section dans laquelle il se trouve pour éviter l’encombrement visuel, mais ceci est absolument facultatif. Les fichiers Photoshop d'extension ``.psd`` des icônes et des arrière-plans sont situés dans `src/main/icons/icons <https://github.com/wpilibsuite/RobotBuilder/tree/main/src/main/icons/icons>`_ et les fichiers png des icônes et des arrière-plans sont situés dans `src/main/resources/icons <https://github.com/wpilibsuite/RobotBuilder/tree/main/src/main/resources/icons>`_.
tr_tr: Görsel dağınıklığı önlemek için içinde bulunduğu bölümün renk şemasını ve genel stilini kullanmalıdır, ancak bu tamamen isteğe bağlıdır. Simgelerin ve arka planların Photoshop ``.psd`` dosyaları `src / main / icons / icons <https://github.com/wpilibsuite/RobotBuilder/tree/main/src/main/icons/icons>`_ ve simgelerin ve arka planların png dosyaları `src / main / resources / icons <https://github.com/wpilibsuite/RobotBuilder/tree/main/src/main/resources/icons>`_ içinde yer alır.
zh_cn: 它应该使用该部分的配色方案和常规样式，以避免视觉混乱，但这是完全可选的。图标和背景的Photoshop``.psd''文件位于``src / main / icons / icons <https://github.com/wpilibsuite/RobotBuilder/tree/master/src/main/icons/icons>`_中，图标和背景的png文件位于``src / main / resources / icons <https://github.com/wpilibsuite/RobotBuilder/tree/master/src/main/resources/icons>`_中。
