Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/preemptive-troubleshooting.po
Languages: es_mx, fr_ca, ja, pt, tr_tr, zh_cn

source: Robot Preemptive Troubleshooting
es_mx: Soluciones para prevenir problemas del robot
fr_ca: Dépannage du robot
ja: ロボットの先取りトラブルシューティング
pt: Solução preventiva de problemas do robô
tr_tr: Robot Önleyici Sorun Giderme
zh_cn: 机器人的预防式故障排除

source: In *FIRST*\ |reg| Robotics Competition, robots take a lot of stress while driving around the field. It is important to make sure that connections are tight, parts are bolted securely in place and that everything is mounted so that a robot bouncing around the field does not break.
es_mx: En *FIRST*\ |reg| Robotics Competition, los robots soportan mucha presión mientras son conducidos en el campo. Es importante asegurarse de que las conexiones estén bien sujetadas, las piezas estén atornilladas de forma segura en su lugar y que todo está sujetado para que un robot que este en constante movimiento no se rompa.
fr_ca: Pendant la Compétition de robotique FIRST, les robots subissent plusieurs chocs lorsqu’ils sont conduits sur le terrain de jeu. Il est donc important de s’assurer que les connexions soient bien ajustées, que les pièces soient boulonnées de manière sécuritaire et que le tout soit assemblé de sorte que le robot ne se brise pas en se déplaçant sur le terrain.
ja: FIRSTロボット競技会では、ロボットがフィールドを走り回る際に大きなストレスがかかります...フィールドで跳ね回ったロボットが壊れないように、接続をしっかりと行い、部品をボルトでしっかりと固定し、すべてを取り付けることが重要です！
pt: Na *FIRST*\ |reg| Robotics Competition, os robôs sofrem múltiplos esforços enquanto manobram pelo campo. É importante certificar-se de que as conexões sejam firmes, as partes estejam aparafusadas seguramente em seu lugar e que tudo está montado para que o robô não quebre enquanto saltita pelo campo.
tr_tr: *FIRST*\ |reg| Robotik Yarışması'nda, robotlar sahada dolaşırken çok fazla baskıya mağruz kalır. Bağlantıların sıkı olduğundan, parçaların yerine iyice sabitlendiğinden ve her şeyin monte edildiğinden emin olmak önemlidir, böylece sahada gezinen bir robot kırılmaz.
zh_cn: 在 *FIRST*\ |reg| 机器人竞赛中，机器人在场地行驶时承受很大的压力。确保连接的牢固、零件稳妥的固定在合适的地方上以及一切都已安装好是非常重要的，好让机器人在场上活蹦乱跳时不会散架。

source: Check Battery Connections
es_mx: Revise las conexiones de la batería
fr_ca: Vérifier les bornes de la batterie et les connexions
pt: Verifique as conexões da bateria
tr_tr: Akü Bağlantılarını Kontrol Edin
zh_cn: 检查电池连接

source: Trying to wiggle the battery terminal by hand.
es_mx: Tratando de mover el terminal de la batería con la mano.
fr_ca: Essayer de remuer le terminal de la batterie à la main.
pt: Tentando mexer o terminal da bateria com as mãos.
tr_tr: Batarya terminalini el yordamıyla kımıldatmaya çalışmak

source: The tape that should be covering the battery connection in these examples has been removed to illustrate what is going on. On your robots, the connections should be covered.
es_mx: La cinta que debería cubrir la conexión de la batería en estos ejemplos se ha retirado para ilustrar lo que ocurre. En sus robots, las conexiones deberían estar cubiertas.
fr_ca: Le ruban qui devrait couvrir la connexion de la batterie dans ces exemples a été retirée pour illustrer ce qui se passe. Sur vos robots, les connexions doivent être couvertes.
pt: A fita que deveria cobrir a conexão da bateria nesses exemplos foi removida para ilustrar o que está acontecendo. Em seus robôs, as conexões devem estar cobertas.
tr_tr: Bu örneklerde batarya bağlantısını örtmesi gereken bant, neler olup bittiğini göstermek için çıkarılmıştır. Robotlarınızda bağlantılar örtülü olmalıdır.
zh_cn: 在这些示例中，应该覆盖电池连接的胶带已被移除，以说明发生了什么情况。在您的机器人上，连接应该被遮盖。

source: Wiggle battery harness connector. Often these are loose because the screws loosen, or sometimes the crimp is not completely closed. You will only catch the really bad ones though because often the electrical tape stiffens the connection to a point where it feels stiff. Using a voltmeter or Battery Beak will help with this.
es_mx: Mueva el conector del arnés de la batería. A menudo están sueltos porque los tornillos se aflojan, o a veces no está completamente atornillado. Sin embargo, sólo atraparás a los realmente malos porque a menudo la cinta eléctrica endurece la conexión hasta un punto en el que se siente rígida. Usar un voltímetro o un pico de batería ayudará con esto.
fr_ca: Faire bouger les connecteurs allant à la batterie dans un mouvement de va-et-vient. Souvent, ceux-ci ce sont desserrés parce que les vis qui les retiennent sont mal vissées, ou parfois le sertissage n'est pas complètement sécure. Cependant, vous ne pouvez que déceler les très mauvais cas de cette manière, car souvent le ruban électrique qui entoure la connexion rigidifie cette dernière, et vous donne un résultat qui semble correct. L'utilisation d'un voltmètre pour déceler les chutes de tension, ou encore du petit gadget appelé Battery Beak, vous aidera à identifier ce problème.
ja: バッテリーハーネスコネクターを曲げてみてください。ネジが緩んだり、圧着が完全に閉じていないために緩んでいることがよくあります。 しかし、電気テープで接続が硬くなり、硬いと感じるようになることが多いので、本当に悪いものだけを見分けることができます。電圧計やバッテリービークを使用すると、このような場合に役立ちます。
pt: Chacoalhe o conector do cabo da bateria. Frequentemente eles se soltam porque os parafusos se afrouxaram ou, às vezes, a crimpagem não foi completamente fechada. Você só encontrará os realmente ruins assim, porque muitas vezes a fita isolante reforça a conexão a um ponto em que parece rígida. Usar um voltímetro ou Battery Beak ajudará nisso.
tr_tr: Akü kablolarını sallayarak kontrol edin. Bazen vidalar gevşer veya bazen bağlantı tamamen kapanmaz. Yine de yalnızca çok kötü durumda olanları fark edeceksiniz çünkü çoğu zaman elektrik bandı bağlantıyı sağlam hissettirecek şekilde sertleştirir. Bir voltmetre veya Battery Beak kullanmak bu konuda yardımcı olacaktır.
zh_cn: 摆动电池线束插头。感到松动通常是因为螺丝松动，或者有时压接没有完全闭合。您只能以此发现非常严重的问题，因为通常电工胶带会使连接变硬，觉得连接仍然结实。使用电压表或电池喙将有助于解决此问题。

source: Apply considerable force onto the battery cable at 90 degrees to try to move the direction of the cable leaving the battery, if successful the connection was not tight enough to begin with and it should be redone. This :ref:`article <docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>` has more detailed battery information.
es_mx: Aplique una fuerza considerable sobre el cable de la batería a 90 grados para tratar de mover la dirección del cable que sale de la batería, si tiene éxito la conexión no estaba lo suficientemente apretada para empezar y debe ser rehecha. Este :ref:`article <docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>` has more detailed battery information.
fr_ca: Appliquez une force considérable sur le câble de la batterie à 90 degrés pour essayer de déplacer la direction du câble quittant la batterie, en cas de succès, la connexion n'était pas assez serrée pour commencer et elle devrait être refaite. Cet :ref:`article <docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>` contient des informations plus détaillées sur la batterie.
pt: Aplique uma força considerável no cabo da bateria a 90 graus para tentar mover a direção do cabo deixando a bateria, se bem-sucedido, a conexão não estava firme o suficiente de começo e deve ser refeita. Este :ref:`article <docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>` tem informações mais detalhadas sobre a bateria.
tr_tr: Kablonun bataryadan çıkış yönünü hareket ettirmeye çalışmak için batarya kablosuna 90 derece kuvvet uygulayın, eğer başarılı olursa bağlantı başlangıçta yeterince sıkı değildir ve yeniden yapılmalıdır. Bu :ref:`makale <docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>` daha detaylı batarya bilgisine sahiptir.
zh_cn: 以90度的力向电池电缆施加相当大的力，以尝试移动电缆离开电池的方向，如果成功，则连接不够紧，应重新进行连接。该文章<docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>具有更多详细的电池信息。

source: Securing the Battery to the Robot
es_mx: Asegurar la batería del robot
fr_ca: Fixation de la batterie au robot
pt: Fixando a Bateria no Robô
tr_tr: Aküyü Robota Sabitlemek
zh_cn: 将电池固定到机器人上

source: Disconnected battery of a robot mid match.
es_mx: Batería desconectada de un robot a mitad de partido.
fr_ca: Batterie déconnectée d’un robot à mi-match.
pt: Bateria desconectada de um robô no meio da partida.
tr_tr: Maç ortasında bağlantısı kesilmiş robotun bataryası

source: In almost every event we see at least one robot where a not properly secured battery connector (the large Anderson) comes apart and disconnects power from the robot. This has happened in championship matches on the Einstein and everywhere else. Its an easy to ensure that this doesn't happen to you by securing the two connectors by wrapping a tie wrap around the connection. 10 or 12 tie wraps for the piece of mind during an event is not a high price to pay to guarantee that you will not have the problem of this robot from an actual event after a bumpy ride over a defense. Also, secure your battery to the chassis with hook and loop tape or another method, especially in games with rough defense, obstacles or climbing.
es_mx: En casi todos los eventos vemos al menos un robot donde un conector de batería incorrectamente asegurado (the large Anderson) se separa y desconecta la energía del robot. Esto ha sucedido en partidos de campeonato en la división Einstein y en las demás. Es fácil asegurarse de que esto no suceda de que esto no le suceda asegurando los dos conectores envolviendo con una cinta alrededor de la conexión. 10 o 12 envolturas para la tranquilidad durante el evento no es un precio alto para garantizar que usted no tenga un problema en un evento después de un choque sobre una defensa. Además fija tu batería al chasis con cinta adhesiva y de bucle u otro método, especialmente en juegos con defensa áspera, obstáculos o escalada.
fr_ca: Dans presque tous les tournois, nous pouvons observer un robot dont le connecteur de batterie est mal sécurisé (celui de type Anderson, grand format). Il se sépare et déconnecte l'alimentation du robot. Cela s'est produit lors des matches de championnat sur Einstein et partout ailleurs. Il est facile de s'assurer que cela ne vous arrive pas en reliant les deux connecteurs à l'aide d'une attache de type Ty-rap ou Zip-tie. Utiliser 10 ou 12 attaches comme celles-ci durant un tournoi est un petit prix à payer pour avoir la tranquillité d'esprit que vous n'aurez pas le problème ci-haut mentioné. Ce robot lui l'a eu réelement après une balade cahoteuse. Fixez également votre batterie au châssis avec du ruban auto-agrippant ou une autre méthode, en particulier dans les jeux avec une défensive intense, des obstacles ou de l'escalade.
pt: Em quase todas competições, vemos pelo menos um robô em que um conector de bateria não devidamente fixado (o Anderson grande) se separa e desconecta a energia do robô. Isso aconteceu em partidas do Championship na Einstein e em vários outros lugares. É fácil garantir que isso não aconteça com você prendendo os dois conectores com um Tie Wrap envolvendo a conexão. 10 ou 12 Tie Wraps para não ter que se preocupar durante um evento não é um preço alto a pagar para garantir que você não terá o problema desse robô em um evento oficial após uma passada desajeitada sobre uma defesa. Além disso, prenda sua bateria ao chassi com velcro ou outro método, especialmente em jogos com defesa pesada, obstáculos ou escalada.
zh_cn: 几乎所有赛事中，我们都会看到至少一个机器人未正确固定的电池连接器（大的Anderson）散开并断掉了机器人的电源。这在Einstein和其他地方的冠军赛中曾发生过。用轧带绑住连接处来固定两个连接器就可以轻松保证这种事情不会发生。在比赛期间，为了担保跨越颠簸不平的道路后不会在实际攻防中发生这种问题，10到12个轧带并不是高昂的代价。另外，尤其在攻防战、障碍赛或需要攀爬的赛事中，请使用魔术贴胶带或其他方法将电池固定在机箱上。

source: Securing the Battery Connector & Main Power Leads
es_mx: Cómo asegurar el conector de la batería y los cables de alimentación principales
fr_ca: Sécuriser le connecteur de batterie et les câbles d'alimentation principaux
pt: Fixando o conector da bateria e os cabos de alimentação principais
tr_tr: Pil konektörünü ve ana güç kablolarının güvenliğini sağlamak
zh_cn: 固定电池连接器和主电源线

source: A loose robot-side battery connector (the large Anderson SB) can allow the main power leads to be tugged when the battery is replaced. If the main power leads are loose, that "tug" can get all the way back to the crimp lugs attached to the 120 Amp Circuit Breaker or Power Distribution Panel (PDP), bend the lug, and over time cause the lug end to break from fatigue. Putting a couple tie wraps attaching the main power leads to the chassis and bolting down the robot-side battery connector can prevent this, as well as make it easier to connect the battery.
es_mx: Un conector de la batería del lado del robot que esté suelto (el Anderson SB grande) puede permitir que los cables de alimentación principal sean tirados cuando se reemplaza la batería. Si los cables de alimentación principal están sueltos, ese "tirón" puede llegar hasta los terminales de engarce conectados al disyuntor de 120 amperios o al panel de distribución de energía (PDP), doblar el terminal y, con el tiempo, hacer que el extremo del terminal se rompa por la fatiga. Colocar un par de cintas de sujeción que unan los cables de alimentación principal al chasis y atornillar el conector de la batería del lado del robot puede evitar esto, así como facilitar la conexión de la batería.
fr_ca: Un connecteur de batterie desserré (côté robot: le grand Anderson SB) peut tirer les câbles d'alimentation principaux lorsque la batterie est remplacée. Si les fils d'alimentation principaux sont desserrés, cette traction peut se rendre jusqu'aux cosses à sertir attachées au disjoncteur de 120 A ou au panneau de distribution d'alimentation (PDP), plier la cosse et, avec le temps et la fatigue du métal, provoquer la rupture de l'extrémité de la cosse. La mise en place de quelques attaches sur les câbles d'alimentation principaux en les fixant au châssis et le boulonnage du connecteur de batterie côté robot peut empêcher cela et faciliter la connexion de la batterie.
pt: Um conector de bateria solto da parte do robô (o Anderson SB grande) pode permitir que os cabos de alimentação principais sejam puxados quando a bateria for substituída. Se os cabos de alimentação principais estiverem soltos, esse "puxão" pode chegar até os terminais crimpados no disjuntor de 120 A ou no Power Distribuition Panel (PDP), entortar o terminal e, com o tempo, fazer com que a extremidade do terminal se quebre de fadiga. Colocar algumas abraçadeiras plásticas prendendo os cabos de alimentação principais ao chassi e aparafusando o conector da bateria do lado do robô pode evitar isso, além de facilitar a conexão da bateria.
tr_tr: Gevşek bir robot tarafı akü konektörü (büyük Anderson SB), akü değiştirildiğinde ana güç kablolarının çekilmesine neden olabilir. Ana güç kabloları gevşekse, bu “çekme” 120 Amp Devre Kesiciye veya Güç Dağıtım Paneline (PDP) bağlı kıvrımlı pabuçlara kadar geri gidebilir, pabucu bükebilir ve zamanla pabuç ucunun yorgunluktan kırılmasına neden olabilir. Ana güç kablolarını şasiye bağlayan ve robot tarafı akü konektörünü sabitleyen bir çift bağ sargısı koymak bunu önleyebilir ve aküyü bağlamayı kolaylaştırabilir.
zh_cn: 松开的机器人侧电池连接器（较大的Anderson SB）可以在更换电池时拉紧主电源线。如果主电源线松动，则该“拉力”可以完全回到连接到120安培断路器或配电面板（PDP）的压接突耳，弯曲该突耳，随着时间的推移，会导致突耳端部断裂从疲劳。放置一对将主电源线连接到机箱的绑带，并用螺栓固定机器人侧的电池连接器可以防止这种情况，并且可以更轻松地连接电池。

source: Main Breaker (120 Amp Circuit Breaker)
es_mx: Interruptor principal (disyuntor de 120 amperios)
fr_ca: Disjoncteur principal 120A
pt: Disjuntor principal (disjuntor de 120 A)
tr_tr: Ana sigorta (120 Amper devre kesicisi)
zh_cn: 主断路器（120安培断路器）

source: Ensure nuts are tightened firmly and the breaker is attached to a rigid element.
es_mx: Asegúrese de que las tuercas estén firmemente apretadas y que el interruptor esté unido a un elemento rígido.
fr_ca: Assurez-vous que les écrous sont serrés fermement et que le disjoncteur est fixé à un élément rigide.
pt: Certifique-se de que as porcas estejam apertadas firmemente e o disjuntor esteja preso a um elemento rígido.
tr_tr: Somunların iyice sıkıldığından ve devre kesici anahtarın sert bir elemana bağlandığından emin olun.
zh_cn: 确保将螺母牢固拧紧，并且将断路器安装在刚性元件上。

source: Applying a twisting force to the first cable on the breaker.
es_mx: Aplicando una fuerza de torsión al primer cable del interruptor.
fr_ca: Application d’une force de torsion au premier câble du disjoncteur.
pt: Aplicando uma força de torção ao primeiro cabo do disjuntor.
tr_tr: Sigortanın ilk kablosuna bükme kuvveti uygulamak.

source: Applying a twisting force to the second cable on the breaker.
es_mx: Aplicando una fuerza de torsión al segundo cable del interruptor.
fr_ca: Application d’une force de torsion au deuxième câble du disjoncteur.
pt: Aplicando uma força de torção ao segundo cabo do disjuntor.
tr_tr: Sigortanın ikinci kablosuna bükme kuvveti uygulamak.

source: Apply a strong twisting force to try to rotate the crimped lug. If the lug rotates then the nut is not tight enough. After tightening the nut, retest by once again trying to rotate the lug.
es_mx: Aplique una fuerte fuerza de torsión para intentar girar la orejeta engarzada. Si el terminal gira, la tuerca no está suficientemente apretada. Después de apretar la tuerca, vuelva a probar intentando girar el terminal.
fr_ca: Appliquez une forte force de torsion pour essayer de faire tourner la portion sertie. Si elle tourne, l'écrou n'est pas assez serré. Après avoir serré l'écrou, recommencez le test en essayant à nouveau de faire tourner la partie sertie.
pt: Aplique uma forte força de torção para tentar girar o terminal crimpado. Se o terminal girar, a porca não está apertada o suficiente. Depois de apertar a porca, teste novamente tentando girar o terminal.
tr_tr: Kıvrılmış pabucu döndürmeye çalışmak için güçlü bir bükme kuvveti uygulayın. Pabuç dönerse, somun yeterince sıkı değildir. Somunu sıktıktan sonra, pabucu bir kez daha döndürmeye çalışarak tekrar test edin.
zh_cn: 施加较大的扭曲力以尝试旋转压接的接线片。如果凸耳旋转，则螺母不够紧。拧紧螺母后，再次尝试旋转凸耳，以进行重新测试。

source: The original nut has a star locking feature, which can wear out over time: these may require checking every few matches, especially if your robot-side battery connector is not attached to the chassis.
es_mx: La tuerca original tiene un cierre en estrella, que puede desgastarse con el tiempo: es posible que haya que revisarla cada cierto tiempo, especialmente si el conector de la batería del lado del robot no está unido al chasis.
fr_ca: L'écrou d'origine a une rondelle en étoile, qui peut s'user avec le temps: il peut être nécessaire de vérifier celles-ci après quelques matches, en particulier si le connecteur de batterie côté robot n'est pas fixé au châssis.
pt: A porca original tem um recurso de travamento em estrela, que pode se desgastar com o tempo: pode ser necessário verificar de vez em quando após partidas, especialmente se o conector da bateria do lado do robô não estiver conectado ao chassi.
tr_tr: Orijinal somun zamanla yıpranabilen yıldız kilitleme özelliğine sahiptir, bu durum özellikle batarya konektörü şasiye bağlı değilse bütün eşleştirmeleri kontrol etmeyi gerektirebilir.
zh_cn: 原始螺母具有星形锁定功能，该功能会随着时间的流逝而磨损：尤其是如果您的机器人侧电池连接器未安装在机箱上，则可能需要每隔几下匹配项进行检查。

source: The nut is normally a relatively uncommon 1/4-28 thread: ensure this is correct if the nut is replaced.
es_mx: La tuerca suele tener una rosca relativamente poco común de 1/4-28: asegúrese de que es correcta si se sustituye la tuerca.
fr_ca: L'écrou a un filetage 1/4-28, ce qui est relativement rare: assurez-vous que vous avez le bon pas si l'écrou est remplacé.
pt: A porca é normalmente uma rosca 1/4-28 relativamente incomum: certifique-se de que isso esteja correto se a porca for substituída.
tr_tr: Somun normalde diğerlerine kıyasla nadir bir 1/4-28 diştir: somun değiştirilirse bunun doğru olduğundan emin olmak gerekir.
zh_cn: 螺母通常是不常见的1 / 4-28螺纹：如果更换螺母，请确保这是正确的。

source: Because the metal stud is just molded into the case, every once in awhile you may break off the stud. Don't stress, just replace the assembly.
es_mx: Debido a que el perno metálico sólo está moldeado en la caja, de vez en cuando se puede romper el perno. No se estrese, simplemente sustituya el conjunto.
fr_ca: Parce que le goujon métallique est juste moulé dans le boîtier, de temps en temps, vous pouvez casser le goujon. Ne vous inquiétez pas, remplacez simplement l'assemblage.
pt: Como o pino de metal é apenas moldado na carcaça, de vez em quando você pode quebrar o pino. Não se espante, apenas substitua o conjunto.
tr_tr: Metal saplama kasanın içine yeni kalıplanmış olduğundan, arada bir saplamayı kırabilirsiniz. Paniklenmeyin, sadece montajı değiştirin.
zh_cn: 由于金属螺柱只是模制在外壳中，因此有时您可能会折断螺柱。不要强调，只需更换组件即可。

source: When subjected to multiple competition seasons, the Main Breaker is susceptible to fatigue damage from vibration and use, and can start opening under impact. Each time the thermal fuse function is triggered, it can become progressively easier to trip. Many veteran teams start each season with a fresh main breaker, and carry spares.
es_mx: Cuando se somete a varias temporadas de competencia, el disyuntor principal es susceptible de sufrir daños por fatiga a causa de las vibraciones y el uso, y puede empezar a abrirse con el impacto. Cada vez que se dispara la función de fusible térmico, puede ser progresivamente más fácil que se dispare. Muchos equipos veteranos comienzan cada temporada con un disyuntor principal nuevo y llevan repuestos.
fr_ca: Lorsqu'il est soumis à plusieurs saisons de compétition, le disjoncteur principal est sensible aux dommages de fatigue dus aux vibrations et à l'utilisation, et peut commencer à s'ouvrir sous l'impact. Chaque fois que la fonction de fusible thermique est déclenchée, il peut devenir progressivement plus facile de déclencher. De nombreuses équipes de vétérans commencent chaque saison avec un nouveau disjoncteur principal et apportent avec eux des disjoncteurs de rechange.
pt: Quando sujeito a várias temporadas de competição, o disjuntor principal é suscetível a danos por fadiga por vibração e uso e pode começar a abrir sob impacto. Cada vez que a função de fusível térmico é acionada, pode se tornar progressivamente mais fácil de desarmar. Muitas equipes veteranas começam cada temporada com um disjuntor principal novo e carregam sobressalentes.
tr_tr: Ana Sigorta, birden fazla yarışma sezonuna maruz kaldığında, titreşim ve kullanımdan kaynaklanan zedelenme hasarına karşı hassastır ve darbe altında açılmaya başlayabilir. Her termal sigorta fonksiyonu tetiklendiğinde hareket etmesi gittikçe kolaylaşabilir. Bir sürü veteran takım her sezon yeni bir ana sigorta ile başlarlar ve yedek parça taşırlar.
zh_cn: 当经受多个比赛季节时，主断路器容易受到振动和使用引起的疲劳损坏，并且在受到冲击时会开始打开。每次触发热熔断器功能时，它会逐渐变得更容易跳闸。每个赛季，许多老队伍都会更换一个新的主断路器进行比赛，并随身携带备件。

source: Power Distribution Panel (PDP)
es_mx: Panel de distribución de energía (PDP)
fr_ca: Panneau de Distribution de Puissance (PDP)
tr_tr: Power Distribution Panel (PDP) - Güç Dağıtım Paneli
zh_cn: 配电板（PDP）

source: Battery terminals on the PDP.
es_mx: Terminales de la batería en el PDP.
fr_ca: Bornes de batterie sur le PDP.
pt: Terminais de bateria no PDP.
tr_tr: PDP üzerindeki batarya terminalleri.
