Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/preemptive-troubleshooting.po
Languages: es_mx, fr_ca, ja, pt, tr_tr, zh_cn

source: Robot inspectors do this, but you should do it as well, it helps robot inspectors out and they appreciate it. And it guarantees that you are running with the most recent, bug fixed code. You wouldn't want to lose a match because of an out of date piece of control system software on your robot.
es_mx: Los inspectores de robot hacen esto, pero usted también debería hacerlo, ayude a los inspectores de robot y ellos lo apreciarán. Y garantiza que está corriendo con el código más reciente, corregido de errores. No querrá perder una partida por un software de sistema de control anticuado en su robot.
fr_ca: Les inspecteurs de robots font cela, mais vous devriez le faire aussi, cela aide les inspecteurs de robots et ils l'apprécient. Et cela garantit que vous utilisez le code le plus récent, avec un minimum de bogues. Vous ne voulez pas perdre une partie à cause d'un logiciel de système de contrôle obsolète sur votre robot!
ja: ロボット検査官はこのようにしていますが、あなたもそうしてください。 また、最新のバグフィックスされたコードで動作していることが保証されます。ロボットの制御システムソフトウェアが古かったために試合に負けるなんてことはないでしょう。
pt: Os inspetores de Robô fazem isso, mas você também deve fazer isso, pois ajuda os inspetores e eles apreciam isso. E garante que você está executando o código mais recente corrigido de bugs. Você não gostaria de perder uma partida por causa de um software do sistema de controle desatualizado em seu robô.
tr_tr: Robot inspectorları bunu kontrol edeceklerdir, ancak siz de yapmalısınız, robot inspectorlarına yardımcı olur ve bu onları mutlu edecektir. Ayrıca bu işlem en son, düzeltilmiş kodla çalıştığınızı garanti eder. Robotunuzdaki eski bir kontrol sistemi yazılımı nedeniyle bir maçı kaybetmek istemezsiniz.
zh_cn: 机器人检查员会做这些检查，但是您也应该进行检查，这可以帮助机器人检查员找到问题，他们也会对此对您欣赏有加。并且它能保证您使用的是最新的、已修正错误的代码。您不会希望因为机器人上的控制系统软件过期而输掉比赛。

source: Driver Station Checks
es_mx: Revisión del Driver Station
fr_ca: Vérification de la station de pilotage
pt: Verificações da Estação do Piloto
tr_tr: Driver Station Kontrolleri
zh_cn: Drivers Station检查

source: We often see problems with the Drivers Station. You should:
es_mx: A menudo se observan problemas con la Driver Station. Usted debe:
fr_ca: Nous observons souvent des problèmes avec la station de pilotage. Vous devez:
ja: ドライバーステーション - Drivers.Station の不具合をよく見かけます... 確認してください：
pt: Frequentemente vemos problemas com a Estação do Piloto. Você deve:
tr_tr: Drivers Stationda sık sık sorunlar görüyoruz. Şunları yapmalısın:
zh_cn: 我们经常看到Drivers Station出现问题。你应该：

source: ALWAYS bring the laptop power cable to the field, it doesn’t matter how good the battery is, you are allowed to plug in at the field.
es_mx: SIEMPRE llevar el cargador de la laptop al campo, no importa lo buena que sea la batería, puede enchufarlo en el campo.
fr_ca: Apporter TOUJOURS le câble d'alimentation de l'ordinateur portable sur le terrain, peu importe l'état de sa batterie, vous êtes toujours autorisé à le brancher sur le terrain.
ja: 「必ず」ノートパソコンの電源ケーブルをフィールドに持参すること、バッテリーがどんなに良くても、フィールドで充電することは許されています。
pt: SEMPRE traga o cabo de alimentação do laptop para o campo, não importa o quão boa seja a bateria, você pode ligá-lo na tomada no campo.
tr_tr: HER ZAMAN dizüstü bilgisayarınızın şarj kablosunu sahaya getirin, bataryanızın ne kadar iyi olduğu önemli değildir, sahada fişe takmanıza izin verilir.
zh_cn: 始终将笔记本电脑的电源线带到现场，无论电池的电池质量如何，保障您可以在场地内充电。

source: Check the power and sleep settings, turn off sleep and hibernate, screen savers, etc.
es_mx: Revise los ajustes de encendido y suspensión, apague el modo de suspensión e hibernación, protectores de pantalla, etc.
fr_ca: Vérifier les paramètres d'alimentation et de veille, désactivez la veille et la mise en veille prolongée, les économiseurs d'écran, etc.
ja: 電源やスリープの設定を確認し、スリープやハイバネート、スクリーンセーバーなどをオフにする。
pt: Verifique as configurações de energia e suspensão, desligue a suspensão e hibernação, protetores de tela, etc.
tr_tr: Güç ve uyku ayarlarını kontrol edin, uyku ve hazırda bekletme, ekran koruyucuları vb. kapatın.
zh_cn: 检查电源和睡眠设置，关闭睡眠和休眠模式、屏幕保护程序等。

source: Turn off power management for USB devices (dev manager)
es_mx: Apagar la distribución de energía para los dispositivos USB (dev manager).
fr_ca: Désactiver l'alimentation des ports USB (dev manager)
ja: USBデバイスの電源管理をオフにする（デベロッパーマネージャー）
pt: Desligue o gerenciamento de energia para dispositivos USB (gerenciador de desenvolvimento)
tr_tr: USB cihazları için güç yönetimini kapatın (aygıt yöneticisi)
zh_cn: 关闭USB设备的电源管理（设备管理器）

source: Turn off power management for ethernet ports (dev manager)
es_mx: Apagar la distribución de energía para los puertos Ethernet (dev manager).
fr_ca: Désactiver l'alimentation des ports Ethernet (dev manager)
ja: イーサネットポートのパワーマネージメントをオフにする（デベロッパーマネージャー）
pt: Desligue o gerenciamento de energia para portas Ethernet (gerenciador de desenvolvimento)
tr_tr: Ethernet bağlantı noktaları için güç yönetimini kapatın (aygıt yöneticisi)
zh_cn: 关闭以太网端口的电源管理（设备管理器）

source: Turn off windows defender
es_mx: Apagar Windows defender.
fr_ca: Désactiver l'antivirus Windows Defender
ja: windows defenderをオフにする
pt: Desligue o Windows Defender
tr_tr: Windows Defender'ı kapatın
zh_cn: 关闭Windows Defender

source: Turn off firewall
es_mx: Apagar el firewall
fr_ca: Désactiver le pare-feu
ja: ファイアーウォール - forewallをオフにする
pt: Desligue o firewall
tr_tr: Güvenlik duvarını kapatın
zh_cn: 关闭防火墙

source: Close all apps except for DS/Dashboard when out on the field.
es_mx: Cerrar todas las aplicaciones excepto DS/Dashboard cuando se esté en el campo.
fr_ca: Fermez toutes les applications à l'exception de DS/Dashboard lorsque vous êtes sur le terrain.
ja: 外出時はDS/Dashboard以外のアプリをすべて閉じる。
pt: Feche todos os aplicativos, exceto DS/Dashboard quando estiver em campo.
tr_tr: Sahadayken DS/Dashboard dışındaki tüm uygulamaları kapatın.
zh_cn: 在场地外，请关闭除DS /仪表板以外的所有应用程序。

source: Verify that there is nothing unnecessary running in the application tray in the start menu (bottom right side)
es_mx: Verifique que no haya nada innecesario corriendo en la bandeja de aplicaciones en el menú de inicio (abajo a la derecha).
fr_ca: Vérifiez qu'il n'y a rien d'inutile en cours d'exécution dans la barre d'applications dans le menu Démarrer (en bas à droite)
ja: スタートメニューのアプリケーショントレイ（右下）に、不要なものが起動していないことを確認する。
pt: Verifique se não há nada desnecessário em execução na bandeja do sistema no menu iniciar (canto inferior direito)
tr_tr: Başlat menüsünde (sağ alt taraf) uygulama menüsünde gereksiz hiçbir şeyin çalışmadığını doğrulayın.
zh_cn: 确认开始菜单（右下角）中的应用程序托盘中没有多余的东西在运行

source: Handy Tools
es_mx: Herramientas útiles
fr_ca: Outils pratiques
pt: Ferramentas Úteis
tr_tr: Kullanışlı Araçlar
zh_cn: 方便的工具

source: A Wago screwdriver and flashlight.
es_mx: Un destornillador Wago y una linterna.
fr_ca: Un tournevis Wago et une lampe de poche.
pt: Uma chave de fenda Wago e uma lanterna.

source: There never seems to be enough light inside robots, at least not enough to scrutinize the critical connection points, so consider using a handheld LED flashlight to inspect the connections on your robot. They're available from home depot or any hardware/automotive store.
es_mx: Parece que nunca hay suficiente luz dentro de los robots, al menos no la suficiente para inspeccionar los puntos de conexión críticos, así que considere usar una linterna LED de mano para inspeccionar las conexiones de su robot. Están disponibles en Home Depot o en cualquier ferretería o tienda de autoservicio.
fr_ca: Il ne semble jamais y avoir assez de lumière à l'intérieur des robots, du moins pas assez pour scruter les points de connexion critiques, alors pensez à utiliser une lampe de poche LED pour inspecter les connexions de votre robot. Ils sont disponibles chez Home Depot ou dans tout magasin de quincaillerie/automobile.
ja: ロボットの内部には十分な明るさがなく、重要な接続箇所を点検するためには、携帯型のLED懐中電灯を使用してください。懐中電灯は、ホームセンターや自動車用品店で購入できます。
pt: Parece nunca haver luz suficiente dentro dos robôs, pelo menos não o suficiente para examinar os pontos críticos de conexão, então considere o uso de uma lanterna LED portátil para inspecionar as conexões em seu robô. Elas estão disponíveis em qualquer loja de ferragens/automotiva.
tr_tr: Robotların içinde hiçbir zaman görmek için yeterli ışık yokmuş gibi duruyor, en azından kritik bağlantı noktalarını incelemek için yeterli değil, bu nedenle robotunuzdaki bağlantıları incelemek için elde tutulan bir LED el feneri kullanmayı düşünebilirsiniz. Herhangi bir hırdavat/otomotiv mağazasından temin edilebilirler.
zh_cn: 机器人内部不见得有足够的光线、至少没有足够的光线来检查关键连接点，因此请考虑使用手持式LED手电筒检查机器人上的连接。可从家里的车库或任何硬件/汽车商店购买。

source: A WAGO tool is nice tool for redoing Weidmuller connections with stranded wires. Often I’ll do one to show the team, and then have them do the rest using the WAGO tool to press down the white-plunger while they insert the stranded wire. The angle of the WAGO tool makes this particularly helpful.
es_mx: Una herramienta de WAGO es una buena herramienta para rehacer las conexiones de Weidmuller con cables trenzados. A menudo hago una para mostrar al equipo, y luego hago que hagan el resto con la herramienta de WAGO para presionar el botón blanco mientras insertan el cable trenzado. El ángulo de la herramienta WAGO hace que esto sea particularmente útil.
fr_ca: Un outil WAGO est un bel outil pour refaire les connexions Weidmuller avec des fils multibrins. Souvent, je vais faire une démonstration d'un raccord pour montrer à l’équipe, puis leur faire faire le reste en utilisant l’outil WAGO pour appuyer sur le piston blanc pendant qu’ils insèrent le fil multibrins. L’angle de l’outil WAGO rend cela particulièrement utile.
ja: WAGOツールは、撚り線によるワイドミュラー接続をやり直すのに便利なツールです。 一般には、チームに見せるために1つだけ行い、あとはWAGOツールでホワイトプランジャーを押しながら撚り線を挿入してもらうことがあります。 WAGOツールの角度は特に便利です。
pt: Uma ferramenta WAGO é uma boa ferramenta para refazer conexões Weidmuller com fios trançados. Frequentemente, farei uma para mostrar à equipe e, em seguida, farei o resto usando a ferramenta WAGO para pressionar o êmbolo branco enquanto inserem o fio trançado. O ângulo da ferramenta WAGO torna isso particularmente útil.
tr_tr: WAGO aleti, çok telli kablolarla Weidmuller bağlantılarını yeniden yapmak için güzel bir araçtır. Genellikle takıma göstermek için bir örnek yaparım ve ardından onlar çok telli kabloyu yerleştirirken beyaz pistonu aşağı bastırmak için WAGO aracını kullanarak gerisini onlara yaptırırım. WAGO aracının açısı onu özellikle faydalı kılar.
zh_cn: WAGO工具是用于重做Weidmuller绞线连接的好工具。通常我会给队伍展示一次，然后在插入绞合线时让他们使用WAGO工具压下白色柱塞来完成剩下的工作。 WAGO工具的角度在这种事情上有优秀的发挥。
