Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/preemptive-troubleshooting.po
Languages: es_mx, fr_ca, ja, pt, tr_tr, zh_cn

source: Make sure that split washers were placed under the PDP screws, but it is not easy to visually confirm, and sometimes you can’t. You can check by removing the case. Also if you squeeze the red and black wires together, sometimes you can catch the really lose connections.
es_mx: Asegúrate de que las arandelas de separación se colocaron bajo los tornillos del PDP, pero no es fácil de confirmar visualmente, y a veces no se puede. Puede comprobarlo quitando el estuche. También si aprietas los cables rojos y negros juntos, a veces puedes atrapar las conexiones perdidas.
fr_ca: Assurez-vous que des rondelles fendues ont été placées sous les vis du PDP, mais ce n'est pas facile à confirmer visuellement, et parfois vous ne pouvez pas voir. Vous pouvez alors vérifier en retirant le capot sur le boîtier du PDP. De plus, si vous appliquez une pression entre les fils rouge et noir, l'un vers l'autre, vous pouvez parfois déceler les connexions vraiment mal fixées.
pt: Certifique-se de que arruelas de pressão foram colocadas sob os parafusos PDP, mas não é fácil de confirmar visualmente e às vezes você não consegue. Você pode verificar removendo a carcaça. Além disso, se você apertar os fios vermelho e preto juntos, às vezes você pode pegar as conexões realmente soltas.
tr_tr: PDP vidalarına yaylı rondela taktığınızdan emin olun, ancak bakarak anlamak kolay değildir ve bazen bunu yapamazsınız. Kapağını kaldırarak kontrol edebilirsiniz. Ayrıca kırmızı ve siyah kabloları birlikte tutup sıkıştırırsanız, bazen gerçekten gevşek bağlantıları yakalayabilirsiniz.
zh_cn: 确保将弹簧垫圈放在PDP螺钉的下面，但肉眼很难确认，有时甚至根本看不到。您可以拿开外壳进行检查。也可以将红色和黑色电线抓成一把，有时会帮助您会发现真正失去连接的地方。

source: Tug Testing
es_mx: Prueba de tirón
fr_ca: Test de robustesse des branchements
pt: Teste de Puxão
tr_tr: Çekme Testi
zh_cn: 拖拽测试

source: Tug test on the roboRIO power.
es_mx: Prueba de tirón en la potencia de la roboRIO.
fr_ca: Test de tiraillement sur l'alimentation du roboRIO.
pt: Teste de puxão na alimentação do roboRIO.
tr_tr: RoboRIO gücü üzerinde çekme testi.

source: Tug test on the connectors at the bottom of the PDP.
es_mx: Prueba de tirón en los conectores de la parte inferior del PDP.
fr_ca: Test de tiraillement sur les connecteurs au bas du PDP.
pt: Teste de puxão nos conectores na parte inferior do PDP.
tr_tr: PDP’nin tabanı üzerinde çekme testi.

source: The Weidmuller contacts for power, compressor output, roboRIO power connector, and radio power are important to verify by tugging on the connections as shown. Make sure that none of the connections pull out.
es_mx: Los contactos de Weidmuller para la energía, la salida del compresor, el conector de energía del roboRIO y la energía de radio son importantes, para verificar estire las conexiones como se muestra. Asegúrese de que ninguna de las conexiones se separe.
fr_ca: Il est important de vérifier les connecteurs de type Weidmuller pour la puissance, la sortie du compresseur, le connecteur d’alimentation roboRIO et l'alimentation de la radio. On a qu'a tirer sur les connexions, comme indiqué. Assurez-vous qu’aucun fil se retire du connecteur.
ja: 電源、コンプレッサー出力、roboRIO電源コネクタ、無線電源のWeidmullerコンタクトは、図のように接続部を引っ張って確認することが重要です。 どの接続部も引き抜かれないことを確認してください。
pt: Os conectores Weidmuller para alimentação, saída do compressor, conector de alimentação do roboRIO e alimentação do rádio são importantes de verificar puxando as conexões conforme mostrado. Certifique-se de que nenhuma das conexões seja desconectada.
tr_tr: Güç, kompresör çıkışı, roboRIO güç komnektörü ve radyo gücü için Weidmuller bağlantılarını gösterildiği gibi kabloları çekerek doğrulamak önemlidir. Bağlantılardan hiçbirinin çıkmadığından emin olun.
zh_cn: 如图拖拽Weidmuller触点和电源、压缩机输出、roboRIO电源连接器及路由器电源的连接处是至关重要的。确保没有任何连接断开。

source: Look for possible or impending shorts with Weidmuller connections that are close to each other, and have too-long wire-lead lengths (wires that are stripped extra long).
es_mx: Busque los posibles o inminentes cortos con conexiones Weidmuller que estén cerca una de la otra, y que tengan longitudes de cable demasiado largas (cables que se pelan extra largos).
fr_ca: Recherchez des courts-circuits possibles ou imminents avec des connexions de type Weidmuller qui sont proches les unes des autres et dont la partie dénudée du fil est exposée. Toujours réduire au maximum l'exposition de fils dénudées.
ja: ワイドミュラー接続が互いに近接し、ワイヤリードの長さが長すぎる場合、ショート（短絡）の可能性があるか、またはショートの恐れがあるかどうかを確認する（余分な長さのワイヤを剥いたもの）。
pt: Procure por curtos possíveis ou iminentes nos conectores Weidmuller próximos um dos outros e com comprimentos de fio desencapados muito longos (fios descascados extra longos).
tr_tr: Birbirine yakın ve çok uzun kablo ucu uzunluklarına (ekstra uzun sıyrılmış kablolar) sahip Weidmuller bağlantılarını olası veya yaklaşan kısa devreler için kontrol edin.
zh_cn: 在相近和导线过长（剥开了额外长度的导线）的Weidmuller连接处寻找可能或即将发生的短路。

source: Spade connectors can also fail due to improper crimps, so tug-test those as well.
es_mx: Los conectores de pala también pueden fallar debido a ajustes inadecuados, así que también hay que probarlos.
fr_ca: Les connecteurs à fourche peuvent également échouer en raison de sertissages inappropriés, alors testez-les également.
ja: また、スペードコネクタも圧着不良で故障することがありますので、そのような場合はタグテストを行ってください。
pt: Os conectores de espadilha também podem falhar devido a crimpagens inadequadas, portanto, teste-os também.
tr_tr: Takıp çıkarılabilen kablo pabuçları da yanlış sıkıştırma nedeniyle bağlanamayabilir, bu yüzden bunları da çekerek test edin.
zh_cn: 铲形接头也可能由于不适当的压接而失效，因此也应进行拖拽测试。

source: Blade Fuses
es_mx: Fusibles de cuchilla
fr_ca: Fusible à lamelles
pt: Fusíveis de lâmina
tr_tr: Bıçak Sigortalar
zh_cn: 插片保险丝

source: Be sure to place the 20A fuse (yellow) on the left and the 10A fuse (red) on the right.
es_mx: Asegúrate de colocar el fusible 20 A (amarillo) a la izquierda y el fusible 10 A (rojo) a la derecha.
fr_ca: Assurez-vous de placer le fusible 20A (jaune) à gauche et le fusible 10A (rouge) à droite.
pt: Certifique-se de colocar o fusível de 20A (amarelo) à esquerda e o fusível de 10A (vermelho) à direita.
tr_tr: 20A sigortayı (sarı) sola ve 10A sigortayı (kırmızı) sağa yerleştirdiğinizden emin olun.
zh_cn: 确保将20A保险丝（黄色）放在左侧，将10A保险丝（红色）放在右侧。

source: PDP diagram showing the bottom connections and fuses.
es_mx: Diagrama del PDP que muestra las conexiones inferiores y los fusibles.
fr_ca: Diagramme du PDP montrant les connexions inférieures et les fusibles.
pt: Diagrama do PDP mostrando as conexões e fusíveis inferiores.
tr_tr: Alt bağlantıları ve sigortaları gösteren PDP diyagramı.

source: Bottom of the PDP focusing on the 20A and 10A fuses.
es_mx: Parte inferior del PDP centrada en los fusibles de 20A y 10A.
fr_ca: Bas du PDP en se concentrant sur les fusibles 20A et 10A.
pt: Parte inferior do PDP com foco nos fusíveis 20A e 10A.
tr_tr: 20A ve 10A sigortalarına odaklanan PDP altı.

source: Take care to ensure fuses are fully seated into the fuse holders. The fuses should descend at least as far as the figure below (different brand fuses have different lead lengths). It should be nearly impossible to remove the fuse with bare hands (without the use of pliers). If this is not properly done, the robot/radio may exhibit intermittent connectivity issues.
es_mx: Asegúrese de que los fusibles estén completamente colocados en los portafusibles. Los fusibles deben llegar al menos hasta la figura que se muestra a continuación (diferentes marcas de fusibles tienen diferentes longitudes de plomo). Debería ser casi imposible quitar el fusible con las manos (sin el uso de pinzas). Sí no se hace correctamente, el robot / radio puede presentar intermitentes problemas de conectividad.
fr_ca: Veillez à ce que les fusibles soient bien insérés dans les porte-fusibles. Les fusibles doivent pénétrer au moins aussi loin que la figure ci-dessous (les fusibles de différentes marques ont des longueurs de lames différentes). Il devrait être presque impossible de retirer le fusible à mains nues (sans utiliser une pince à long bec). Si cela n'est pas fait correctement, le robot et/ou la radio peuvent présenter des problèmes de connectivité intermittents.
pt: Tome cuidado para garantir que os fusíveis estejam totalmente encaixados nos porta-fusíveis. Os fusíveis devem descer tanto quanto na figura abaixo (fusíveis de marcas diferentes têm conexões de comprimentos diferentes). Deve ser quase impossível remover o fusível manualmente (sem o uso de um alicate). Se isso não for feito corretamente, o robô/rádio pode apresentar problemas de conectividade intermitentes.
tr_tr: Sigortaların sigorta yuvalarına tam olarak oturduğundan emin olun. Sigortalar en azından aşağıdaki şekil kadar yuvanın içine girmelidir (farklı marka sigortaların farklı bıçak uzunlukları vardır). Sigortayı çıplak elle çıkarmak neredeyse imkansız olmalıdır (pense kullanmadan). Bu doğru şekilde yapılmazsa, robot / radyo bağlantısı kesinti sorunları gösterebilir.
zh_cn: 注意确保保险丝完全插入保险丝插座中。保险丝应至少插至下图所示深度（不同品牌的保险丝具有不同的引线长度）。几乎不可能徒手卸下保险丝（不使用钳子）。如果这一步出错，机械人/路由器可能会出现间歇性的连接问题。

source: If you can remove the blade fuses by hand then they are not in completely. Make sure that they are completely seated in the PDP so that they don't pop out during robot operation.
es_mx: Si usted puede quitar los fusibles a mano, entonces no están completamente dentro. Asegúrese de que estén completamente colocados en el PDP para que no se salgan durante la operación del robot.
fr_ca: Si vous pouvez retirer les fusibles à lame à la main, ils ne sont pas complètement insérés. Assurez-vous qu'ils sont complètement insérés dans le PDP afin qu'ils ne ressortent pas pendant le fonctionnement du robot.
ja: ブレードヒューズを手で取り外すことができる場合は、ヒューズが完全に挿入されていません。ロボット操作中に飛び出さないように、PDPに完全に収まっていることを確認してください。
pt: Se você puder remover os fusíveis da lâmina manualmente, eles não estão completamente encaixados. Certifique-se de que eles estejam completamente encaixados no PDP para que não se soltem durante a operação do robô.
tr_tr: Bıçak sigortalarını elle çıkarabiliyorsanız, o zaman tamamen içeride değillerdir. Robot çalışması sırasında dışarı çıkmamaları için PDP'ye tamamen oturduklarından emin olun.
zh_cn: 如果您可以用手卸下插片保险丝，则说明它们没有完全插入。确保将它们完全固定在PDP中，以免它们在机器人操作过程中弹出。

source: roboRIO swarf
es_mx: Viruta de la roboRIO
fr_ca: Limaille de fer dans le roboRIO
pt: roboRIO e limalha
tr_tr: roboRIO üzerinde metal talaş
zh_cn: roboRIO的碎屑

source: Swarf is fine chips or filings of stone, metal, or other material produced by a machining operation. Often modifications must be made to a robot while the control system parts are in place. The circuit board for the roboRIO is conformally coated, but that doesn't absolutely guarantee that metal chips won't short out traces or components inside the case. In this case, you must exercise care in making sure that none of the chips end up in the roboRIO or any of the other components. In particular, the exposed 3 pin headers are a place where chips can enter the case. A quick sweep through each of the four sides with a flashlight is usually sufficient to find the really bad areas of infiltration.
es_mx: La viruta son chips finos o limadura fina de piedra, metal u otro material producido por una operación de mecanizado. A menudo se deben realizar modificaciones en un robot mientras las piezas del sistema de control están en su lugar. La placa de circuito para el roboRIO está recubierta de forma conforme, pero eso no garantiza absolutamente que las virutas de metal no provoquen un cortocircuito en los rastros o componentes dentro de la caja. En este caso debe tener cuidado de que ninguno de los chips termine en el roboRIO o en cualquiera de los otros componentes. En particular, los 3 cabezales de alfiler expuestos son un lugar donde los chips pueden entrar en la caja. Un rápido vistazo a cada uno de los cuatro lados con una linterna suele ser suficiente para encontrar las áreas realmente malas de infiltración.
fr_ca: La limaille est formée de copeaux fins de métal, d'abrasifs ou d'autres matériaux produits par une opération d'usinage. Souvent, des modifications doivent être apportées à un robot après que toute la partie électronique a été installée. Le circuit imprimé du roboRIO est recouvert d'un vernis protecteur, mais cela ne garantit pas de façon absolue que la présence de limaille puisse court-circuiter les traces ou les composants à l'intérieur du boîtier du roboRIO. Dans tous les cas, vous devez veiller à ce qu'aucun copeau de métal, limaille ou autre ne se retrouve dans le roboRIO ou dans l'un des autres composants electronique. En particulier, les connecteurs à 3 broches qui sont exposés en périphérie du roboRIO sont un endroit où les copeaux peuvent entrer dans le boîtier. Un examen approfondi des quatre côtés du boîtier avec une lampe de poche est généralement suffisant pour trouver les très mauvaises cas.
pt: As limalhas são cavacos finos ou fragmentos de pedra, metal ou outro material produzido por uma operação de usinagem. Frequentemente, modificações devem ser feitas em um robô enquanto as peças do sistema de controle estão em seu lugar. A placa de circuito do roboRIO tem revestimento isolante, mas isso não garante absolutamente que os cavacos de metal não causem curto-circuito em trilhas ou componentes dentro da carcaça. Neste caso, você deve ter cuidado para garantir que nenhum dos cavacos vá para o roboRIO ou qualquer um dos outros componentes. Em particular, os cabeçotes de 3 pinos expostos são um lugar onde os cavacos podem entrar na carcaça. Uma rápida varredura em cada um dos quatro lados com uma lanterna geralmente é suficiente para encontrar as áreas realmente propícias a infiltração.
tr_tr: Metal talaş, bir parça işlenirken üretilen taş, metal veya diğer malzemelerin ince parçalarıdır. Bazen bütün kontrol sistemi parçaları üzerindeyken robotta değişiklikler yapmanız gerekir. RoboRIO'nun devre kartı uygun bir şekilde kaplanmıştır, ancak bu, metal talaşların kasa içindeki devre yolları veya bileşenlerine temas edip kısa devre yapmayacağını garanti etmez. Bu durumda, talaşların hiçbirinin roboRIO'ya veya diğer bileşenlerden herhangi birinin içine kaçmamasına özen göstermelisiniz. Özellikle, açıkta kalan 3 pinli başlık talaşların kasaya girebileceği yerlerdir. Bir el feneri ile dört bir tarafı hızlıca taramak, gerçekten kötü sızma alanlarını bulmak için genellikle yeterlidir.
zh_cn: 碎屑是指由机械加工产生的石材、金属或其他材料的屑屑。通常机器人在控制系统部件安装到位后仍需修改。 roboRIO的电路板涂有涂层，但这并不能保证金属碎屑绝不会让内部的走线或组件短路。在这种情况下，必须格外小心检查roboRIO或其他任何组件不会出现任何碎屑。特别是裸露的3针接口，这可以让碎屑内部。用手电筒大约扫过四个面通常足以发现非常糟糕的问题区域。

source: Radio Barrel Jack
fr_ca: Connecteur à barillet de la radio
pt: Conector de Energia do Rádio
zh_cn: 路由器公头

source: Make sure the correct barrel jack is used, not one that is too small and falls out for no reason. This isn’t common, but ask an FTA and every once in awhile a team will use some random barrel jack that is not sized correctly, and it falls out in a match on first contact.
es_mx: Asegúrese de usar el barrel jack correcto, no uno que sea demasiado pequeño y se caiga sin motivo. Esto no es común, pero pregunte a un FTA y de vez en cuando un equipo usará algún barrel jack que no tenga el tamaño correcto, y que se caiga en un partido con el primer contacto.
fr_ca: Assurez-vous que le bon connecteur a barillet est utilisée, pas celui dont le trou au centre est trop gros, ou le corps est trop petit, et tombe sans raison. Ceci arrive quelquefois, demandez à un inspecteur et il pourra sans doute vous raconter une anecdote au sujet d'une équipe qui a utilisé un connecteur non adéquat (non dimensionné correctement), et qui s'est débranché lors d'un match au premier choc mécanique.
pt: Certifique-se de que o conector de energia correto seja usado, não um que seja muito pequeno e caia sem motivo. Isso não é comum, mas pergunte a um FTA e, de vez em quando, uma equipe usará algum conector de energia aleatório que não é do tamanho correto e cai em uma partida na primeira batida.
zh_cn: 确保使用正确的公头，而不是一个太小会无缘无故脱落的。这种情况并不常见，可问问FTA就会发现每隔一段时间，就会有一个团队使用了一些尺寸不正确的公头，导致比赛中进行第一次联络时发现脱落了。

source: Ethernet Cable
es_mx: Cable Ethernet
fr_ca: Câble Ethernet
pt: Cabo Ethernet
tr_tr: Ethernet kablosu
zh_cn: 以太网电缆

source: If the RIO to radio ethernet cable is missing the clip that locks the connector in, get another cable. This is a common problem that will happen several times in every competition. Make sure that your cables are secure. The clip often breaks off, especially when pulling it through a tight path, it snags on something then breaks.
es_mx: Si al cable RIO que va al cable de radio Ethernet le falta el clip que bloquea al conector, consiga otro cable. Este es un problema común que ocurrirá varias veces en cada competencia. Asegúrese de que los cables estén seguros. El clip a menudo se rompe, especialmente cuando se tira de el a través de un camino estrecho, se engancha en algo y luego se rompe.
fr_ca: Si le câble Ethernet RIO vers radio ne contient pas le clip qui verrouille le connecteur, procurez-vous un autre câble. C'est un problème courant qui se produit plusieurs fois dans chaque compétition. Assurez-vous que vos câbles sont sécurisés. Le clip se rompt souvent, en particulier lorsque le câble reste accroché lors de l'assemblage électrique.
ja: RIO-無線イーサネットケーブルのコネクタをロックするクリップが欠けている場合は、別のケーブルを入手してください。 これは、どの大会でも何度か起こる問題です。ケーブルがしっかり固定されていることを確認してください。クリップは、特に狭い経路を引っ張るときに、何かに引っかかって壊れることがよくあります。
pt: Se o cabo Ethernet do roboRIO para o rádio não tiver o clipe que trava o conector, pegue outro cabo. Este é um problema comum que acontecerá várias vezes em todas as competições. Certifique-se de que seus cabos estejam bem presos. O clipe frequentemente quebra, especialmente quando puxado por um caminho estreito, ele se agarra em algo e quebra.
tr_tr: RIO'yu radyoya bağlayan ethernet kablosunun konnektörü kilitleyen klipsi yoksa, başka bir kablo alın. Bu, her yarışmada birkaç kez meydana gelen yaygın bir sorundur. Kablolarınızın sağlam olduğundan emin olun. Klips, özellikle de dar bir yerden geçirirken, bir şeye takılır ve kopar,
zh_cn: 如果RIO接路由器的以太网电缆缺少将连接器锁定的固定夹，请换一根电缆。这是一个每次比赛中都会发生几次的普遍问题。确保电缆连接牢固。夹子很容易会断掉，特别是在通过狭窄路径时会钩住某些东西然后折断。

source: Loose Cables
es_mx: Cables sueltos
fr_ca: Câbles relâchés
pt: Cabos Soltos
tr_tr: Gevşek Kablolar
zh_cn: 电缆松动

source: Cables must be tightened down, particularly the radio power and ethernet cable. The radio power cables don’t have a lot of friction force and will fall out (even if it is the correct barrel) if the weight of the cable-slack is allowed to swing freely.
es_mx: Los cables deben apretarse, en particular el radio power y el cable Ethernet. Los cables radio power no tienen mucha fuerza de fricción y se caerán (incluso si es el barrel correcto) si se permite que el peso del cable flojo oscile libremente.
fr_ca: Les câbles doivent être serrés, en particulier le câble d'alimentation radio et Ethernet. Les câbles d’alimentation radio ne sont pas retenus avec beaucoup de force de frottement, et tomberont facilement sous un choc (même s’il s’agit du bon conncecteur), ou si le câble est lâche et peut se déplacer facilement.
ja: ケーブル類は、特にラジオ電源とイーサネットケーブルをしっかり締め付ける必要があります。 無線電源ケーブルは摩擦力が弱いので、ケーブルスラックの重さで自由に振られると（正しいバレルであっても）脱落してしまいます。
pt: Os cabos devem ser apoiados e travados, principalmente o cabo de energia do rádio e Ethernet. Os cabos de alimentação do rádio não têm muita força de atrito e cairão (mesmo se for o conector correto) se a folga do cabo puder se mover livremente.
zh_cn: 必须拧紧电缆，尤其是路由器电源和以太网电缆。路由器电源线并没有很大的摩擦力（即使使用正确的插头），如果松弛电缆自由摆动，电线就会掉落。

source: Ethernet cable is also pretty heavy, if it’s allowed to swing freely, the plastic clip may not be enough to hold the ethernet pin connectors in circuit.
es_mx: El cable de Ethernet también es bastante pesado, si se permite que oscile libremente, el clip de plástico pude no ser suficiente para sostener los conectores de pines Ethernet en el circuito.
fr_ca: Le câble Ethernet est également assez lourd, s'il est autorisé à pivoter librement, le clip en plastique peut ne pas être suffisant pour maintenir les connecteurs à broches Ethernet en circuit.
ja: また、イーサネットケーブルはかなり重いので、自由に振れるようにしておくと、プラスチッククリップだけではイーサネットピンコネクタを回路に固定できない場合があります。
pt: O cabo Ethernet também é bem pesado, se puder balançar livremente, o clipe de plástico pode não ser suficiente para segurar os conectores Ethernet conectados.
tr_tr: Ethernet kablosu da oldukça ağırdır, serbestçe sallanmasına izin verilirse, plastik klips ethernet pin konnektörlerini yuvada tutmak için yeterli olmayabilir.
zh_cn: 以太网电缆也很重，如果可以自由摆动，则塑料夹可能不足以将以太网针连接器固定在电路中。

source: Reproducing Problems in the Pit
es_mx: Problemas de transmisión en el Pit
fr_ca: Reproduire un problème dans le puits.
pt: Reproduzindo Problemas no Pit
tr_tr: Sorunları Pitte Simüle Etmek
zh_cn: 重现Pit区中的问题

source: Beyond the normal shaking of cables whilst the robot is powered and tethered, it is suggested that one side of the robot be picked up and dropped. Driving on the field, especially against defenders, will often be very violent, and this helps makes sure nothing falls out. It is better for the robot to fail in the pits rather than in the middle of a match.
es_mx: Más allá de la sacudida normal mientras que el robot está encendido y atado, se sugiere que se levante y se deje caer un lado del robot. Conducir en el campo, especialmente contra los defensores, será a menudo muy violento, y esto ayuda a asegurar que nada se caiga. Es mejor que el robot falle en los pits que en medio de un partido.
fr_ca: Au-delà des secousses normales des câbles pendant que le robot est alimenté et attaché, il est suggéré qu'un côté du robot soit levé de quelques centimètres, puis de le laisser retomber afin de lui infliger une secousse. La conduite sur le terrain, en particulier contre les défenseurs, sera souvent très violente, ce qui permet de s'assurer que rien ne tombe ou se brise. Il vaut mieux que le robot échoue dans le puits plutôt qu'au milieu d'un match.
pt: Além da agitação normal dos cabos enquanto o robô está ligado e conectado, é sugerido que um lado do robô seja levantado e solto. Dirigir em campo, especialmente contra os defensores, costuma ser muito violento e isso ajuda a garantir que nada caia. É melhor que o robô falhe nos Pits do que no meio de uma partida.
tr_tr: Robot çalıştırılırken ve bağlıyken kabloların normal sallanmasının ötesinde, robotun bir tarafının kaldırılıp düşürülmesi önerilir. Sahada, özellikle de defans yapan takımlara karşı robot kullanmak, genellikle çok şiddetli olacaktır ve bu önlem, hiçbir şeyin düşmemesine yardımcı olur. Robotun maçın ortasındansa pitte sorun çıkarması daha iyidir.
zh_cn: 除了在给机器人充电和连接时正常地晃动电线外，建议拿起机器人的一侧拿起并放手。在场地中驾驶，特别是对抗防守方，通常会非常暴力，这有助于确保没有东西会脱落。机器人在Pit区失败总比在比赛中失败好。

source: When doing this test it’s important to be ethernet tethered and not USB tethered, otherwise you are not testing all of the critical paths.
es_mx: Cuando se hace esta prueba es importante estar conectado a un Ethernet y no a un USB, de lo contrario no se están probando todas las trayectorias.
fr_ca: Lorsque vous effectuez ce test, il est important d’être connecté via Ethernet et non par USB, sinon vous ne testez pas tous les chemins critiques.
pt: Ao fazer este teste, é importante estar conectado por Ethernet e não por USB, caso contrário, você não está testando todos os caminhos críticos.
tr_tr: Bu testi yaparken, USB bağlantılı değil, ethernet bağlantılı olmak önemlidir, aksi takdirde tüm kritik yolları test etmemiş olursunuz.
zh_cn: 进行此测试时，请务必使用以太网进行网络连接，而不要使用USB连接，否则无法测试所有的关键路径。

source: Check Firmware and Versions
es_mx: Revise el Firmware y las versiones
fr_ca: Vérification des logiciels embarqués (Firmware) et des versions
pt: Verifique o Firmware e Versões
tr_tr: Fabrika Yazılım ve Sürümleri Kontrol Edin
zh_cn: 检查固件和版本
