Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/robot-battery.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Robot Battery Basics
es_mx: Conceptos básicos de la batería del robot
fr_ca: Batterie de Robot
tr_tr: Robot Aküsünün Temelleri
zh_cn: 机器人电池基础

source: The power supply for an FRC\ |reg| robot is a single 12V 18Ah SLA (Sealed Lead Acid) non-spillable battery, capable of briefly supplying over 180A and arcing over 500A when fully charged. The Robot Battery assembly includes the COTS battery, lead cables with contacts, and Anderson SB connector. Teams are encouraged to have multiple Robot Batteries.
es_mx: La fuente de alimentación de un robot FRC |reg| es una única batería SLA (Sealed Lead Acid) de 12V y 18Ah no derramable, capaz de suministrar brevemente más de 180A y arquear más de 500A cuando está completamente cargada. El conjunto de la batería del robot incluye la batería COTS, los cables de plomo con contactos y el conector Anderson SB. Se anima a los equipos a tener varias baterías de robot.
fr_ca: L'alimentation électrique pour un robot FRC est une batterie anti-déversement (plomb-acide scellé) 12V 18Ah, capable de fournir brièvement plus que 180A et un arc de plus de 500A lorsqu'elle est complètement chargée. L'assemblée de la Batterie de Robot inclus la batterie prémontée d'un manufacturier, les câbles avec contacts, et un connecteur Anderson SB. Les équipes sont encouragées d'avoir plusieurs Batteries de Robot.
zh_cn: FRC的电源\ | reg |机器人是单个12V 18Ah SLA（密封铅酸）防溢漏电池，充满电后能够短暂提供超过180A的电流和超过500A的电弧。机械手电池组件包括COTS电池，带触点的引线电缆和Anderson SB连接器。团队使用多个机器人电池是被鼓励的。

source: COTS Battery
es_mx: Batería COTS
fr_ca: Batterie COTS
tr_tr: COTS Aküsü
zh_cn: COTS电池

source: The Robot Rules in the Game Manual specify a Commercial Off The Shelf [COTS] non-spillable sealed lead acid battery meeting specific criteria, and gives examples of legal part numbers from a variety of vendors.
es_mx: Las Reglas del Robot en el Manual del Juego especifican una batería de plomo-ácido sellada no derramable comercialmente [COTS] que cumple con criterios específicos, y da ejemplos de números de piezas legales de una variedad de proveedores.
fr_ca: Les Règles de Robot dans le Manuel du Jeu spécifie une batterie anti-déversement plomb-acide scellé prémonté d'un manufacturier [COTS] qui répond à des critères spécifiques, et fournit des exemples des numéros de pièce légaux de plusieurs manufacturiers.
zh_cn: 《游戏手册》中的机器人规则指定了符合特定标准的商用现货[COTS]不可泄漏密封铅酸电池，并举例说明了许多供应商提供的合法零件编号。

source: Battery Safety & Handling
es_mx: Seguridad y manejo de la batería
fr_ca: Sécurité et Manipulation de la Batterie
tr_tr: Akü Güvenliği & Kullanımı
zh_cn: 电池安全与处理

source: A healthy battery is **always** "On" and the terminals are **always** energized. If the polarities short together - for example, a wrench or aerosol can falls and bridges the gap between two bare terminals - all the stored energy will be released in a dangerous arc. This risk drives a wide range of best practices, such as covering terminals in storage, only uncovering and working on one terminal or polarity at a time, keeping SB contacts fully inserted in connectors, etc.
es_mx: Una batería sana está **siempre** "encendida" y los terminales están **siempre** energizados. Si las polaridades se cortocircuitan -por ejemplo, si una llave inglesa o una lata de aerosol se caen y puentean el espacio entre dos terminales desnudos- toda la energía almacenada se liberará en un arco peligroso. Este riesgo impulsa una amplia gama de buenas prácticas, como cubrir los terminales en el almacenamiento, sólo descubrir y trabajar en un terminal o polaridad a la vez, mantener los contactos SB completamente insertados en los conectores, etc.
fr_ca: Une batterie saine est **toujours** "en marche" et les terminaux sont **toujours** actifs. Si les bornes de la batterie sont court-circuitées - par exemple, une clé ou autre objet metallique touche les deux terminaux - toute l'énergie stockée sera libérée dans un arc dangereux. Ce risque est à l'origine d'un large éventail de bonnes pratiques, comme couvrir les terminaux lorsque la batterie est en stockage, seulement les découvrir et travailler sur un terminal ou une polarité à la fois. Aussi, garder les contacts SB entièrement inséré dans les connecteurs.
tr_tr: Sağlıklı bir akü **daima** "Açık" durumdadır ve terminallere **daima** enerji verilmektedir. Kutuplar arasında kısa devre yaşanırsa - örneğin, bir İngiliz anahtarı veya alüminyum sprey tüpü iki çıplak terminal arasındaki boşluğu doldurursa - depolanan tüm enerji tehlikeli bir şekilde ark yaparak boşalacaktır. Bu risk, depolamadaki terminalleri kapatmak, aynı anda yalnızca bir terminali veya polariteyi açıp terminalin üzerinde çalışmak, SB kontaklarını konektörlere tam olarak takılı tutmak vb. gibi çeşitli örnek davranışlara yön vermektedir.
zh_cn: 健康的电池始终“打开”，并且终端始终“通电”。如果极性短接（例如，扳手或气雾剂可能掉落并桥接两个裸端子之间的间隙），则所有存储的能量将以危险的电弧释放。这种风险带来了广泛的最佳实践，例如覆盖存储中的端子，一次仅露出一个端子或在其中一个极性上进行揭露和工作，保持SB触点完全插入连接器等。

source: **Do *NOT* carry a battery assembly by the cables**, and always avoid pulling by them. Pulling on batteries by the cables will begin to damage the lugs, tabs, and the internal connection of the tab. Over time, fatigue damage can add up until the the entire tab tears out of the housing! Even if it isn't clearly broken, internal fatigue damage can increase the battery internal resistance, prematurely wearing out the battery. The battery will not be able to provide the same amount of current with increased internal resistance or if the :ref:`connectors are loose <docs/hardware/hardware-basics/preemptive-troubleshooting:Check Battery Connections>`.
es_mx: **NO lleve el conjunto de la batería por los cables**, y evite siempre tirar de ellos. Tirar de las baterías por los cables empezará a dañar las lengüetas y la conexión interna de la lengüeta. Con el tiempo, el daño por fatiga puede acumularse hasta que toda la lengüeta se desprenda de la carcasa. Incluso si no está claramente rota, el daño por fatiga interna puede aumentar la resistencia interna de la batería, desgastándola prematuramente. La batería no podrá proporcionar la misma cantidad de corriente con una resistencia interna aumentada o si los conectores :ref:`están sueltos <docs/hardware/hardware-basics/preemptive-troubleshooting:Check Battery Connections>`.
fr_ca: **Ne *JAMAIS* transporter une batterie par les câbles**, et évitez toujours de les tirer. La traction dans les câbles commencera à endommager les connexions et les terminaux (cosses). Au fil du temps, les dommages dus à la fatigue peuvent s'additionner jusqu'à ce que la borne entière de la batterie se déchire du boîtier! Même si elle n'est pas clairement brisée, les dommages de fatigue internes peuvent augmenter la résistance interne de la batterie, usant prématurément la batterie. La batterie ne sera pas en mesure de fournier la même quantité de courant avec une résistance interne augmentée, ou si les :ref:`connecteurs sont non-serrés <docs/hardware/hardware-basics/preemptive-troubleshooting:Check Battery Connections>`.
zh_cn: 不要用电缆携带电池组件，并始终避免拉扯它们。用电缆拉电池会损坏接线片，也会损害接线片和接线片的内部连接。长时间这样，疲劳损坏的后果可能叠加起来，直到整个拉环从外壳上脱落为止！即使未明显损坏，内部疲劳损伤也会增加电池的内阻，从而使电池过早磨损。如果内部电阻增加，或者连接器松动，电池将无法提供相同数量的电流。

source: One terminal of an FRC battery fully detached from the battery.
es_mx: Una terminal de una batería FRC totalmente separada de la batería.
fr_ca: Une borne d’une batterie FRC complètement détachée de la batterie.
tr_tr: Terminali aküden tamamen ayrılmış bir FRC aküsü.

source: Dropping the batteries can bend the internal plates and cause performance issues, create bulges, or even crack the battery case open. While most FRC batteries use Absorbent Glass Mat [AGM] or Gel technology for safety and performance, when a cell is punctured it may still leak a small amount of battery acid. This is one of the reasons FIRST recommends teams have a battery spill kit available.
es_mx: La caída de las baterías puede doblar las placas internas y causar problemas de rendimiento, crear abultamientos o incluso romper la carcasa de la batería. Mientras que la mayoría de las baterías FRC utilizan tecnología de vidrio absorbente [AGM] o gel para la seguridad y el rendimiento, cuando una célula se perfora todavía puede perder una pequeña cantidad de ácido de la batería. Esta es una de las razones por las que FIRST recomienda a los equipos tener un kit de derrame de baterías disponible.
fr_ca: La chute des batteries peut plier les plaques internes et entraîner des problèmes de performances, créer des renflements ou même fissurer le boîtier de la batterie. Alors que la plupart des batteries FRC utilisent la technologie Absorbent Glass Mat [AGM] ou Gel pour des raisons de sécurité et de performance, lorsqu'une cellule est perforée, une petite quantité d'acide de batterie peut encore s'échapper. C'est l'une des raisons pour lesquelles FIRST recommande aux équipes de disposer d'un kit de déversement de batterie.
tr_tr: Akülerin düşürülmesi, dahili plakaları bükülmesiyle performans sorunlarına neden olabilmekte, aküde şişkinlik yapabilmekte ve hatta akü kutusunda çatlamalara neden olabilmektedir. Çoğu FRC aküsü, güvenlik ve performans için Emici Cam Matı [AGM] veya Jel teknolojisi kullanıyor olsa da bir hücrenin delinmesi yine de az miktarda akü asidinin sızmasına sebep olabilmektedir. FIRST'ün takımlara akü sızıntısı kiti bulundurmaları önermesinde bulunmasının sebeplerinden biri de budur.
zh_cn: 跌落电池可能会使内板弯曲并导致性能问题，产生凸起，甚至使电池盒打开裂开。尽管大多数FRC电池使用吸收性玻璃毡[AGM]或凝胶技术来提高安全性和性能，但当电池被刺穿时，仍可能泄漏少量电池酸。这是FIRST建议团队使用电池溢出套件的原因之一。

source: Finally, certain older battery chargers without "maintenance mode" features can *overcharge* the battery, resulting in boiling off some of the battery acid.
es_mx: Por último, algunos cargadores de baterías más antiguos sin funciones de "modo de mantenimiento" pueden *sobrecargar* la batería, lo que provoca la ebullición de parte del ácido de la misma.
fr_ca: Enfin, certains chargeurs de batterie plus anciens sans fonctions de «mode de maintenance» peuvent * surcharger * la batterie, entraînant l'ébullition d'une partie de l'acide de la batterie.
tr_tr: Son olarak, "bakım modu" özelliği olmayan bazı eski akü şarj cihazları aküyü *aşırı şarj edebilmekte* ve bu da akü asidinin bir kısmının kaynamasına neden olabilmektedir.
zh_cn: 最后，某些没有“维护模式”功能的较旧的电池充电器可能会“过度充电”电池，从而使部分电池酸沸腾。

source: An FRC battery that was boiled by a high current dumb charger.
es_mx: Una batería FRC que fue quemada por un cargador defectuoso de alta corriente.
fr_ca: Une batterie FRC qui a été échauffée par un chargeur passif à courant élevé.
tr_tr: Yüksek akımlı bir şarj cihazıyla şarj edilmesi sonucu içi erimiş bir FRC pili

source: Damaged batteries should be safely disposed of as soon as possible. All retailers that sell large SLA batteries, like car batteries, should be able to dispose of it for you. They may charge a small fee, or provide a small "core charge refund", depending on your state law.
es_mx: Las baterías dañadas deben eliminarse de forma segura lo antes posible. Todas las tiendas que venden baterías SLA grandes, como las de los coches, deberían poder deshacerse de ellas por usted. Es posible que le cobren una pequeña cuota, o que le ofrezcan un pequeño "reembolso de la carga del núcleo", dependiendo de la ley de su estado.
fr_ca: Les batteries endommagées doivent être mises au rebut en toute sécurité dès que possible. Tous les détaillants qui vendent de grosses batteries SLA, comme des batteries de voiture, devraient pouvoir s'en débarrasser pour vous. Ils peuvent facturer une somme modique ou fournir un petit «remboursement des frais de base», selon la législation de votre état.
tr_tr: Hasarlı piller mümkün olan en kısa sürede güvenli bir şekilde atılmalıdır. Araba aküleri gibi büyük SLA aküleri satan tüm satıcılar, aküleri sizin için atabilmektedir. Bu satıcılar, bulunduğunuz bölgenin yasalarına bağlı olarak küçük bir ücret talep edebilmekte veya küçük bir "temel ücret iadesi" sağlayabilmektedir.
zh_cn: 损坏的电池应尽快被安全处置。所有销售大型SLA电池（如汽车电池）的零售商都应能够为您处理。他们可能会收取少量费用，或提供少量“核心费用退款”，具体取决于您所在州的法律。

source: **DO NOT** attempt to "repair" damaged or non-functional batteries.
es_mx: **NO** intente "reparar" las baterías dañadas o que no funcionen.
fr_ca: ** N'ESSAYEZ PAS ** de «réparer» des batteries endommagées ou non fonctionnelles.
tr_tr: Hasarlı veya çalışmayan pilleri "onarmaya" **ÇALIŞMAYIN**.
zh_cn: 请勿尝试“修复”损坏的或无法正常工作的电池。

source: Battery Construction & Tools
es_mx: Construcción de la batería y herramientas
fr_ca: Construction de batterie et outils
tr_tr: Akü Yapısı ve Araçları
zh_cn: 电池构造与工具

source: Battery Leads
es_mx: Cables de la batería
fr_ca: Fils de batterie
tr_tr: Akü Kabloları
zh_cn: 电池引线

source: Battery leads must be copper, minimum size (cross section) 6 AWG (16mm2, 7 SWG) and maximum length 12", color coded for polarity, with an Anderson SB connector. Standard 6AWG copper leads with Pink/Red SB50 battery leads often come in the Kit of Parts and are sold by FRC vendors.
es_mx: Los cables de la batería deben ser de cobre, con un tamaño mínimo (sección transversal) de 6 AWG (16mm2, 7 SWG) y una longitud máxima de 12", con código de colores para la polaridad, con un conector Anderson SB. Los cables de cobre estándar de 6AWG con cables de batería SB50 rosa/rojo suelen venir en el kit de piezas y los ofrecen los vendedores de FRC.
fr_ca: Les fils de batterie doivent être en cuivre, de taille minimale (section transversale) 6 AWG (16 mm2, 7 SWG) et de longueur maximale 12 ", codés par couleur pour la polarité, avec un connecteur Anderson SB. dans le kit de pièces et sont vendus par les fournisseurs FRC.
tr_tr: Akü kablolarının bakırdan, minimum boyutu (enine kesit) 6 AWG (16 mm2, 7 SWG) ve maksimum uzunluğu 12 inç - 30,48 cm, renk kodlu kutuplara ve Anderson SB konektörüne sahip olması gerekmektedir. Standart 6AWG bakır kablo kullanılan Pembe/Kırmızı SB50 model akü kabloları Parça Kitinde ve FRC satıcıları tarafından satılmaktadır.
zh_cn: 电池引线必须为铜，最小尺寸（横截面）为6 AWG（16mm2，7 SWG），最大长度为12，颜色标记为极性并要带有Anderson SB连接器。标准6AWG铜引线带有粉红色/红色SB50电池引线在零件套件中，由FRC供应商出售。

source: Lead Cables
es_mx: Cables conductores
fr_ca: Cäbles de branchement
tr_tr: Kurşun Kablolar
zh_cn: 引线电缆

source: Tinned, annealed, or coated copper is allowed. Do not use CCA (copper clad aluminum), aluminum, or other non-copper base metal. The conductor metal is normally printed on the outside of the insulation with the other cable ratings.
es_mx: Se permite el uso de cobre estañado, recocido o recubierto. No utilice CCA (aluminio revestido de cobre), aluminio u otro metal base que no sea cobre. El metal del conductor está normalmente impreso en el exterior del aislamiento con las otras clasificaciones del cable.
fr_ca: Le cuivre étamé, recuit ou revêtu est autorisé. N'utilisez pas de CCA (aluminium revêtu de cuivre), d'aluminium ou de tout autre métal de base autre que le cuivre. Le métal conducteur est normalement imprimé à l'extérieur de l'isolation avec les autres calibres de câble.
tr_tr: Kalaylı, tavlanmış veya kaplanmış bakır kullanımına izin verilmektedir. Bakır kaplı alüminyum (CCA), alüminyum veya diğer bakır olmayan adi metalleri kullanmayınız. İletken metalin türü diğer kablo değerleriyle birlikte genellikle yalıtımın dış kısmında basılı bulunmaktadır.
zh_cn: 允许镀锡，退火或涂层的铜。请勿使用CCA（覆铜铝），铝或其他非铜基金属。导体金属通常与其他电缆额定值一起印在绝缘层的外部。

source: Wire size 6AWG is sufficient for almost all robots and fits standard SB50 contacts. A small number of teams adopt larger wire sizes for marginal performance benefits.
es_mx: El tamaño del cable 6AWG es suficiente para casi todos los robots y se ajusta a los contactos estándar SB50. Un pequeño número de equipos adoptan tamaños de cable más grandes para obtener beneficios marginales de rendimiento.
fr_ca: La taille de fil 6AWG est suffisante pour presque tous les robots et convient aux contacts SB50 standard. Un petit nombre d'équipes adoptent des tailles de fil plus grandes pour des avantages de performance marginaux.
tr_tr: 6AWG kablo boyutu neredeyse tüm robotlar için yeterlidir ve bu boyut standart SB50 kontaklarla uyumludur. Bazı takımlar, göz ardı edilebilir performans kazançları için daha büyük kablo boyutları kullanmaktadır.
zh_cn: 几乎所有机器人都可以使用6AWG的线径，并适合标准SB50触点。少数团队采用较大的线径以获得边际性能优势。

source: Higher strand count wire (sometimes sold as "Flex" or "welding wire") has a smaller bend radius, which makes it easier to route, and a higher fatigue limit. There is no strand count requirement, but 84/25 (84 strand "flex" hookup wire) and 259/30 (259 strand "welding wire") will both be *much* easier to work with than 19/0.0372 (19 strand hookup wire).
es_mx: Los cables de mayor número de hebras (que a veces se venden como "flexibles" o "para soldar") tienen un radio de curvatura más pequeño, lo que hace que sean más fáciles de enrutar, y un límite de fatiga más alto. No hay ningún requisito de número de hebras, pero tanto el 84/25 (cable de enganche "flexible" de 84 hebras) como el 259/30 (cable de "soldadura" de 259 hebras) serán *mucho* más fáciles de trabajar que el 19/0,0372 (cable de enganche de 19 hebras).
fr_ca: Un fil de plus grand nombre de torons (parfois vendu comme «Flex» ou «fil de soudage») a un rayon de courbure plus petit, ce qui le rend plus facile à acheminer, et une limite de fatigue plus élevée. Il n'y a pas d'exigence de nombre de brins, mais 84/25 (fil de raccordement 84 brins "flex") et 259/30 (259 brins "fil de soudage") seront tous deux * beaucoup * plus faciles à travailler que 19 / 0,0372 (raccordement 19 brins fil).
tr_tr: (bazen "Flex" veya "kaynak teli" olarak da satılan) daha yüksek sayıda tele sahip kablolar; daha küçük bir kıvrılma yarıçapına sahiptir, yani kablolar daha kolay yönlendirilmekte ve daha yüksek bir yorulma eşiğine sahiptirler. Tel sayısına dair belli bir kriter bulunmasa da 84/25 (84 telli "esnek" bağlantı teli) ve 259/30 (259 telli "kaynak teli") kablolar ile çalışmak, 19/0.0372 (19 telli bağlantı teli) kablolara göre çok daha kolay olacaktır.
zh_cn: 股数较高的线材（有时以“ Flex”或“ weld wire”出售）具有较小的弯曲半径，这使布线更容易，并且疲劳极限更高。没有股数要求，但与19 / 0.0372（19股连接）相比，84/25（84股“柔性”连接线）和259/30（259股“焊接线”）都更*容易*金属丝）。

source: The insulation must be color-coded per the Game Manual: as of 2021, the +12Vdc wire must be red, white, brown, yellow, or black w/stripe and the ground wire (return wire) must be black or blue. There is no explicit insulation temperature rating requirement, but any blackened or damaged insulation means the wire needs to be replaced: off hand, 105C is plenty and lower will work for almost all robots. There is no insulation voltage rating requirement, lower is better for thinner insulation.
es_mx: El aislamiento debe estar codificado por colores según el Manual del Juego: a partir de 2021, el cable de +12Vdc debe ser rojo, blanco, marrón, amarillo o negro con raya y el cable de tierra (cable de retorno) debe ser negro o azul. No hay ningún requisito explícito de temperatura de aislamiento, pero cualquier aislamiento ennegrecido o dañado significa que el cable debe ser reemplazado: a mano, 105C es suficiente y más bajo funcionará para casi todos los robots. No hay ningún requisito de tensión de aislamiento, pero si el aislamiento es más fino, es mejor.
fr_ca: L'isolation doit être codée par couleur selon le manuel du jeu: à partir de 2021, le fil + 12Vdc doit être rouge, blanc, marron, jaune ou noir avec bande et le fil de terre (fil de retour) doit être noir ou bleu. Il n'y a pas d'exigence de température d'isolement explicite, mais toute isolation noircie ou endommagée signifie que le fil doit être remplacé: La valeur de 105 ° C est suffisante et même des valeurs plus basses sont acceptables. Il n'y a pas d'exigence de tension d'isolement, une valeur inférieure est signifie une isolation plus mince.
zh_cn: 绝缘必须按照游戏手册进行颜色编码：自2021年起，+ 12Vdc电线必须为带条纹的红色，白色，棕色，黄色或黑色，接地线（回线）必须为黑色或蓝色。没有明确的绝缘温度额定值要求，但是绝缘变黑或损坏意味着需要更换电线：即插即用，105°C足够，更低的温度适用于几乎所有机器人。没有绝缘额定电压的要求，越低越好，绝缘越薄越好。

source: SB Connector
es_mx: Conector SB
fr_ca: Connecteur SB
tr_tr: SB Konektörü
zh_cn: SB连接器

source: The Anderson SB Connector may be the standard Pink/Red SB50, or another Anderson SB connector. Teams are *STRONGLY* recommended to use the Pink/Red SB50 for interoperability: the other colors and sizes of housings will not intermate, and you will be unable to borrow batteries or chargers.
es_mx: El conector Anderson SB puede ser el estándar SB50 Rosa/Rojo, u otro conector Anderson SB. Se recomienda encarecidamente a los equipos que utilicen el SB50 rosa/rojo para la interoperabilidad: los otros colores y tamaños de carcasas no se interpondrán, y no podrá tomar prestadas las baterías ni los cargadores.
fr_ca: Le connecteur Anderson SB peut être le SB50 rose / rouge standard ou un autre connecteur Anderson SB. Il est * FORTEMENT * recommandé aux équipes d'utiliser le SB50 rose / rouge pour l'interopérabilité: les autres couleurs et tailles de boîtiers ne sont pas compatibles, et ainsi, vous ne pourrez pas emprunter de batteries ou de chargeurs d'autres équipes, si vous en avez besoin.
tr_tr: Anderson SB Konektörü, standart Pembe/Kırmızı SB50 veya herhangi başka bir Anderson SB konektör modeli olabilmektedir. Birlikte çalışabilirlik adına takımların Pink/Red SB50 modelini kullanmaları *ŞİDDETLE* tavsiye edilmektedir, diğer renk ve boyuttaki yuvalar birbirleriyle eşleşmeyecek ve bunun sonucu akü veya şarj aleti ödünç almanız imkansız hale gelecektir.
zh_cn: Anderson SB连接器可以是标准的粉红色/红色SB50，也可以是其他Anderson SB连接器。 *强烈建议*团队使用粉红色/红色SB50，以实现互操作性：其他颜色和尺寸的外壳将无法相互配合，并且您将无法借用电池或充电器。

source: Follow manufacturer's instructions to crimp contacts and assemble the leads into Anderson SB connectors. A small flathead screwdriver can help to insert the contacts (push on the contact, not on the wire insulation), or it can help to disengage the internal latch if the contact is in the wrong slot or upside down.
es_mx: Siga las instrucciones del fabricante para engarzar los contactos y montar los cables en los conectores Anderson SB. Un pequeño destornillador de cabeza plana puede ayudar a insertar los contactos (empuje sobre el contacto, no sobre el aislamiento del cable), o puede ayudar a desenganchar el pestillo interno si el contacto está en la ranura equivocada o al revés.
fr_ca: Suivez les instructions du fabricant pour sertir les contacts et assembler les fils dans les connecteurs Anderson SB. Un petit tournevis à tête plate peut aider à insérer les contacts (appuyez sur le contact, pas sur l'isolation du fil), ou il peut aider à désengager le loquet interne si le contact est dans la mauvaise fente ou à l'envers.
tr_tr: Kontakları sıkıştırmak ve kabloları Anderson SB konektörlerine monte etmek için üreticinin talimatlarını takip ediniz. Küçük düz uçlu bir tornavida, kontakları yerleştirmeye (kablo yalıtımına değil, kontağa baskı uygulayınız) veya kontak yanlış yuvada ya da baş aşağı ise dahili mandalın çıkarılmasına yardımcı olabilmektedir.
zh_cn: 请按照制造商的说明压接触点，然后将导线组装到Anderson SB连接器中。小型平头螺丝刀可以帮助插入触点（按在触点上，而不是插在电线绝缘上），或者如果触点插入错误的插槽或朝上，则可以帮助松开内部闩锁。

source: Battery Lugs
es_mx: Tapones de la batería
fr_ca: Cosses de batterie
tr_tr: Akü Pabuçları
zh_cn: 电池接线片
