Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/robot-battery.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Compression lugs ("crimp lugs") for #10 bolt (or M5) battery tabs (~0.2" or ~5mm hole diameter) are available online and through electrical supply houses, sold by the accepted wire sizes in AWG (or mm2) and post diameter ("bolt size", "hole diameter"). Higher end vendors will also distinguish between Standard (~19) and Flex (>80) strand counts in their lug catalogs. Some vendors also offer right angle lugs, in addition to more common straight styles. Follow manufacturer's instructions to crimp the lugs.
es_mx: Los terminales de compresión ("crimp lugs") para lengüetas de batería de perno #10 (o M5) (~0,2" o ~5mm de diámetro de orificio) están disponibles en línea y a través de casas de suministros eléctricos, vendidos por los tamaños de cable aceptados en AWG (o mm2) y el diámetro del poste ("tamaño del perno", "diámetro del orificio"). Los proveedores de gama alta también distinguen en sus catálogos de terminales entre el número de hilos estándar (~19) y el número de hilos flexibles (>80). Algunos proveedores también ofrecen terminales en ángulo recto, además de los estilos rectos más comunes. Siga las instrucciones del fabricante para engarzar los terminales.
fr_ca: Les cosses de compression («cosses à sertir») pour les languettes de batterie à boulon n ° 10 (ou M5) (diamètre du trou ~ 0,2 "ou ~ 5 mm) sont disponibles en ligne et chez les fournisseurs de composants électriques, et sont vendues selon les tailles de fil acceptées en AWG (ou mm2) et diamètre du plot ("taille du boulon", "diamètre du trou"). Les fournisseurs haut de gamme feront également la distinction entre le nombre de brins Standard (~ 19) et Flex (> 80) dans leurs catalogues de cosses. Certains fournisseurs proposent également des cosses à angle droit, en plus de styles droits plus courants. Suivez les instructions du fabricant pour sertir les cosses.
zh_cn: 可通过在线商店和通过电气供应商获得＃10螺栓（或M5）电池接线片的压缩接线片（“压接接线片”）（约0.2英寸或约5mm的孔直径），按AWG（或mm2）和可接受的电线尺寸出售。接线柱直径（“螺栓尺寸”，“孔直径”）。高端供应商还将在其接线片目录中区分标准（〜19）和Flex（> 80）股数。一些供应商除提供直角接线片外，还提供更常见的直式样式，请按照制造商的说明压接凸耳。

source: Screw terminal lugs are legal, but not recommended. If using screw terminal lugs, use the correct tip size screwdriver to tighten the terminal. Check the terminal tightness frequently because they may loosen over time.
es_mx: Los terminales de tornillo son legales, pero no se recomiendan. Si utiliza terminales de tornillo, utilice un destornillador del tamaño adecuado para apretar el terminal. Compruebe con frecuencia el apriete de los terminales porque pueden aflojarse con el tiempo.
fr_ca: Les cosses à vis sont légales, mais non recommandées. Si vous utilisez des cosses de borne à vis, utilisez le tournevis de taille de pointe appropriée pour serrer la borne. Vérifiez fréquemment le serrage des bornes car elles peuvent se desserrer avec le temps.
zh_cn: 螺丝接线端子是合法的，但我们不建议这样做。如果使用螺钉式接线端子，请使用正确的尖端尺寸螺丝刀拧紧端子。经常检查端子的密封性，因为它们可能会随着时间的流逝而松动。

source: Battery Lead Lug To Post Connection
es_mx: Conexión de los bornes de la batería al poste
fr_ca: Cosse du terminal de la batterie à la connexion postérieure
zh_cn: 电池引线接线柱连接

source: A #10 or M5 nut & bolt connect the battery lead lug to the battery tab.
es_mx: Una tuerca y un tornillo #10 o M5 conectan el terminal del cable de la batería a la lengüeta de la batería.
fr_ca: Un écrou et un boulon n ° 10 ou M5 relient la cosse du câble de la batterie à la languette de la batterie.
zh_cn: ＃10或M5螺母和螺栓将电池引线接线片连接到电池凸耳。

source: The lug and tab must directly contact, copper to copper: do not put a washer of any kind separating them.
es_mx: La oreja y la lengüeta deben estar en contacto directo, cobre con cobre: no ponga ningún tipo de arandela que los separe.
fr_ca: La patte et la languette doivent être en contact direct, cuivre sur cuivre: ne pas mettre de rondelle d'aucune sorte les séparant.
tr_tr: Pabuç ve uç, bakırdan bakıra, doğrudan temas halinde olmalıdır: bu iki parçayı birbirinden ayıran herhangi bir pul kullanmayanız.
zh_cn: 接线片和接线片必须直接铜与铜得接触：请勿放置任何类型的垫圈将它们分开。

source: One terminal of an FRC battery with socket head bolt and nylon locking (nylock) nut.
es_mx: Un terminal de una batería FRC con un tornillo de cabeza hueca y una tuerca de nylon (nylock).
fr_ca: Une borne d’une batterie FRC avec boulon à tête creuse et écrou de verrouillage en nylon (nylock).
tr_tr: Soket başlı cıvata ve naylon kilitleme (nylock) somunlu bir FRC aküsünün terminali.

source: Some batteries come with tab bolts in the package: they may be used, or replaced with stronger alloy steel bolts. It is a good idea to add a functional lock washer, such as a #10 star washer or a nordlock washer system, in addition to a nylon locking ("nylock") nut. Only use one style of lock washer in each connection. Even if the manufacturer provides split ring lock washers in the package, you are not required to use them.
es_mx: Algunas baterías vienen con pernos de lengüeta en el paquete: pueden utilizarse, o sustituirse por pernos de aleación de acero más resistentes. Es una buena idea añadir una arandela de seguridad funcional, como una arandela de estrella #10 o un sistema de arandela nordlock, además de una tuerca de bloqueo de nylon ("nylock"). Utilice sólo un tipo de arandela de seguridad en cada conexión. Aunque el fabricante proporcione arandelas de seguridad de anillo dividido en el paquete, no está obligado a utilizarlas.
fr_ca: Certaines batteries sont livrées avec des boulons à languette dans l'emballage: ils peuvent être utilisées ou préférablement remplacées par des boulons en acier plus solides. C'est une bonne idée d'ajouter une rondelle de blocage fonctionnelle, comme une rondelle en étoile # 10 ou un système de rondelle nordlock, en plus d'un écrou de blocage en nylon («nylock»). N'utilisez qu'un seul style de rondelle de blocage pour chaque connexion. Même si le fabricant fournit des rondelles de blocage à anneau fendu dans l'emballage, vous n'êtes pas obligé de les utiliser.
zh_cn: 某些电池的包装中带有凸耳螺栓：他们是可以使用的，也可以用强度更高的合金钢螺栓代替。除了尼龙锁紧（“ nylock”）螺母外，最好添加一个功能性锁紧垫圈，例如＃10星型垫圈或nordlock垫圈系统。每个连接中只能使用一种样式的锁紧垫圈。即使制造商在包装中提供了开口环锁紧垫圈，您也无需使用它们。

source: One terminal of an FRC battery with socket head bolt, nordlock locking nuts, and nylon locking (nylock) nut.
es_mx: Un terminal de una batería FRC con tornillo de cabeza hueca, tuercas de bloqueo nordlock y tuerca de bloqueo de nylon (nylock).
fr_ca: Une borne d’une batterie FRC avec boulon à tête creuse, écrous de verrouillage nordlock et écrou de verrouillage en nylon (nylock).
tr_tr: Imbus cıvata, nordlock kilitli somun ve naylon kilitli (nylock) somunlu bir FRC akü terminali.

source: These connections must be very tight for reliability. Any movement of the lug while in operation may interrupt robot power, resulting in robot reboots and field disconnections lasting 30 seconds or more.
es_mx: Estas conexiones deben estar muy apretadas para que sean fiables. Cualquier movimiento de la lengüeta mientras está en funcionamiento puede interrumpir la alimentación del robot, lo que provoca reinicios del mismo y desconexiones de campo que duran 30 segundos o más.
fr_ca: Ces connexions doivent être très serrées pour la fiabilité. Tout mouvement de l'ergot pendant le fonctionnement peut interrompre l'alimentation du robot, entraînant des redémarrages du robot et des déconnexions sur le terrain pendant 30 secondes ou plus.
tr_tr: Bu bağlantıların, güvenilebilirlik adına, çok sıkı olması gerekmektedir. Robot çalışırken pabuçlarda yaşanabilecek herhangi bir hareket robota giden gücünün kesilmesiyle robotun 30 saniye ve üzeri, yeniden başlamalar ve saha içi bağlantı kopuklukları yaşamasına sebep olabilmektedir.
zh_cn: 这些连接必须非常紧密，以确保可靠性。接线片在运行过程中的任何移动都可能会中断机器人的电源，从而导致机器人重新启动以及持续30秒或更长时间的现场断开连接。

source: This connection must also be completely covered for electrical safety; electrical tape will work, but heatshrink that fits over the entire connection is recommended. High shrink ratios (minimum 3:1, recommend 4:1) will make it easier to apply the heatshrink. Adhesive lined heat shrink is allowed. Be sure *all* the copper is covered! Heat shrink must be "touched up" with electrical tape if some copper shows.
es_mx: Esta conexión también debe estar completamente cubierta para la seguridad eléctrica; la cinta eléctrica funcionará, pero se recomienda un termorretráctil que se ajuste a toda la conexión. Unas relaciones de contracción elevadas (mínimo 3:1, se recomienda 4:1) facilitarán la aplicación del termorretráctil. Se permite el uso de termorretráctiles con adhesivo. Asegúrese de cubrir *todo* el cobre. El termorretráctil debe ser "retocado" con cinta aislante si se ve algo de cobre.
fr_ca: Cette connexion doit également être entièrement couverte pour la sécurité électrique; du ruban isolant fonctionnera, mais une gaine thermorétractable qui s'adapte sur toute la connexion est recommandée. Des taux de rétrécissement élevés (minimum 3:1, recommandé 4:1) faciliteront l'application de la gaine thermorétractable. La thermorétraction doublée d'adhésif est autorisée. Assurez-vous que *tout* le cuivre est couvert! La gaine thermorétractable doit être «réparée» avec du ruban isolant si du cuivre apparaît.
tr_tr: Bu bağlantı da elektrik güvenliği için tamamen kaplanmalıdır, elektrik bandı kullanılabilse de tüm bağlantıya uyan ısıyla büzüşen tüpün kullanılması önerilmektedir. Yüksek büzülme oranları (minimum 3:1, önerilen 4:1), tüpün uygulanmasını kolaylaştıracaktır. Yapışkan astarlı ısıyla büzüşen tüp kullanılabilmektedir. Bakırın *tamamının* kaplandığından emin olunuz! Bakırın görülebilir olması durumunda, ısıyla büzüşen tüpe elektrik bandı ile "rötuş" yapılmalıdır.
zh_cn: 为了安全起见，此连接也必须被完全覆盖。可以使用电工胶带，但建议在整个连接过程中使用热收缩。高收缩率（最低3：1，建议4：1）将使热收缩更容易进行。内衬热收缩胶是允许的。确保*所有*铜被覆盖！如果显示出一些铜，则必须用电工胶带“修补”热收缩。

source: One terminal of an FRC battery fully covered in heatshrink.
es_mx: Un terminal de una batería FRC completamente cubierto de termo contraíble.
fr_ca: Une borne d’une batterie FRC entièrement recouverte d'une gaine thermorétractable.
tr_tr: Tamamen ısıyla büzüşen tüple kaplı bir FRC aküsü terminali.

source: Battery Chargers
es_mx: Cargadores de baterías
fr_ca: Chargeurs de batterie
tr_tr: Akü Şarjları
zh_cn: 电池充电器

source: There are many good COTS "smart" battery chargers designed for 12V SLA batteries, rated for 6A or less per battery, with 'maintenance mode' features. Chargers rated over 6A are not allowed in FRC pits.
es_mx: Hay muchos buenos cargadores de baterías COTS "inteligentes" diseñados para baterías SLA de 12V, con una capacidad de 6A o menos por batería, con características de "modo de mantenimiento". Los cargadores de más de 6A no están permitidos en los pits de FRC.
fr_ca: Il existe de nombreux bons chargeurs de batterie «intelligents» COTS conçus pour des batteries SLA 12 V, d'une capacité nominale de 6 A ou moins par batterie, avec des fonctionnalités de «mode maintenance». Les chargeurs de plus de 6 A ne sont pas autorisés dans les fosses FRC.
tr_tr: 12V SLA aküleri için tasarlanmış, akü başı 6A ve altı için derecelendirilmiş, 'bakım modu' özelliklerine sahip birçok COTS "akıllı" akü şarj aleti mevcuttur. 6A üstü için derecelendirilmiş şarj aletlerine FRC pitlerinde izin verilmemektedir.
zh_cn: 有许多适用于12V SLA电池的优质COTS“智能”电池充电器，每个电池的额定电流为6A或更小，具有“维护模式”功能。额定电压超过6A的充电器不允许进入FRC维修区。

source: Chargers used at competition are required to use Anderson SB connectors. Attaching a COTS SB connector battery lead to the charger leads using appropriately sized wire nuts or screw terminals is fast and simple (be sure to cover any exposed copper with heat shrink or electrical tape). SB Connector Contacts are also available for smaller wire sizes, if the team has crimping capability.
es_mx: Los cargadores utilizados en la competencia deben utilizar conectores Anderson SB. Conectar un cable de batería con conector SB COTS a los cables del cargador utilizando tuercas de cable de tamaño adecuado o terminales de tornillo es rápido y sencillo (asegúrese de cubrir cualquier cobre expuesto con termorretracción o cinta eléctrica). Los contactos del conector SB también están disponibles para tamaños de cable más pequeños, si el equipo tiene capacidad de engarce.
fr_ca: Les chargeurs utilisés en compétition doivent utiliser des connecteurs Anderson SB. La fixation d'un câble de batterie de connecteur COTS SB aux câbles du chargeur à l'aide de serre-fils ou de bornes à vis de taille appropriée est rapide et simple (assurez-vous de couvrir tout cuivre exposé avec une gaine thermorétractable ou du ruban isolant). Les contacts de connecteur SB sont également disponibles pour les fils de plus petite taille, si l'équipe dispose d'une capacité de sertissage.
zh_cn: 比赛中使用的充电器必须是Anderson SB连接器。使用合适尺寸的接线螺母或螺钉端子将COTS SB连接器电池引线连接到充电器引线上，既快速又简单（请确保用热收缩或胶带覆盖任何裸露的铜）。如果小组具有压接功能，则SB连接器触头也可用于较小的电线尺寸。

source: After attaching the SB, double check the charger polarities with a multimeter before plugging in the first battery.
es_mx: Después de conectar el SB, compruebe dos veces las polaridades del cargador con un multímetro antes de enchufar la primera batería.
fr_ca: Après avoir fixé le SB, vérifiez les polarités du chargeur avec un multimètre avant de brancher la première batterie.
zh_cn: 安装SB后，请先用万用表仔细检查充电器的极性，然后再插入第一个电池。

source: Some FRC vendors sell chargers with red SB50 connectors pre-attached.
es_mx: Algunos vendedores de FRC venden cargadores con conectores rojos SB50 preinstalados.
fr_ca: Certains fournisseurs de FRC vendent des chargeurs avec des connecteurs SB50 rouges pré-connectés.
zh_cn: 一些FRC供应商出售的充电器带有预先连接的红色SB50连接器。

source: Battery Evaluation Tools
es_mx: Herramientas de evaluación de baterías
fr_ca: Outils d'évaluation de la batterie
zh_cn: 电池评估工具

source: **Battery Charger**
es_mx: **Cargador de baterías**
fr_ca: **Chargeur de batterie**
zh_cn: **充电器**

source: If your battery charger has Maintenance Mode indicator, such as a GREEN LED, you can use that indicator to tell you whether you are READY. Some chargers will cycle between "CHARGING" and "READY" periodically. This is a "maintenance" behavior, sometimes associated with the battery cooling off and being able to accept more charge.
es_mx: Si su cargador de baterías tiene un indicador de modo de mantenimiento, como un LED VERDE, puede utilizar ese indicador para saber si está LISTO. Algunos cargadores alternan periódicamente entre "CHARGING" y "READY". Este es un comportamiento de "mantenimiento", a veces asociado a que la batería se enfría y puede aceptar más carga.
fr_ca: Si votre chargeur de batterie est doté d'un indicateur de mode de maintenance, tel qu'une LED VERTE, vous pouvez utiliser cet indicateur pour vous dire si vous êtes PRÊT. Certains chargeurs alterneront périodiquement entre «CHARGING» et «READY». Il s'agit d'un comportement de «maintenance», parfois associé au refroidissement de la batterie et à la capacité d'accepter plus de charge.
zh_cn: 如果您的电池充电器具有维护模式指示灯，例如绿色LED，则可以使用该指示灯来告诉您是否准备就绪。某些充电器会定期在“充电”和“就绪”之间循环。这是一种“维护”行为，这有时与电池明明冷却并能够接受更多电荷有关。

source: **Driver Station Display and Log**
es_mx: **Pantalla y registro de la Driver Station**
fr_ca: **Affichage et journal du poste de conduite**
zh_cn: **驾驶室显示和记录**

source: When the robot is plugged in and connected to the driver station laptop, the battery voltage is displayed on the NI Driver Station software.
es_mx: Cuando el robot está enchufado y conectado a la Driver Station, el voltaje de la batería se muestra en el software de la NI Driver Station.
fr_ca: Lorsque le robot est branché et connecté à l'ordinateur portable de la station de pilotage, la tension de la batterie est affichée sur le logiciel NI Driver Station.
zh_cn: 插入机器人并连接至驱动程序工作站便携式计算机后，电池电压将显示在NI Driver Station软件上。

source: After you finish a driving session, you can :ref:`review the battery voltage in the Log Viewer. <docs/software/driverstation/driver-station-log-viewer:Using the Graph Display>`
es_mx: Después de terminar una sesión de conducción, puedes :ref:`revisar el voltaje de la batería en el Visor de Registros. <docs/software/driverstation/driver-station-log-viewer:Using the Graph Display>`.
fr_ca: Après avoir terminé une session de conduite, vous pouvez réviser le :ref:`journal de capture des tensions de batterie <docs/software/driverstation/driver-station-log-viewer:Using the Graph Display>`
zh_cn: 完成驾驶会话后，您可以在Log Viewer中查看电池电压。 <docs/software/driverstation/driver-station-log-viewer:Using the Graph Display>`

source: Hand-held **Voltmeter** or **Multimeter**
es_mx: **Voltímetro** o **Multímetro** de mano
fr_ca: **Voltmètre** ou **Multimètre** portatif
zh_cn: 手持式**电压表**或**万用表**

source: A voltage reading from probes on the SB connector of a disconnected battery will give you a snapshot of what the Voc (Voltage open circuit, or "float voltage") is in the "Unloaded" state. In general the Voc is not a recommended method for understanding battery health: the open circuit voltage is not as useful as the combination of internal resistance and voltages at specific loads provided by a Load Tester (or Battery Analyzer).
es_mx: Una lectura de voltaje de las sondas en el conector SB de una batería desconectada le dará una instantánea de lo que es el Voc (voltaje en circuito abierto, o "voltaje de flotación") en el estado "sin carga". En general, el Voc no es un método recomendado para entender la salud de la batería: el voltaje en circuito abierto no es tan útil como la combinación de la resistencia interna y los voltajes en cargas específicas que proporciona un Probador de Carga (o Analizador de Baterías).
fr_ca: Une lecture de tension sur le connecteur SB d'une batterie déconnectée vous donnera un aperçu de ce que le Voc (tension circuit ouvert, ou «tension flottante») est dans l'état «déchargé». En général, le Voc n'est pas une méthode recommandée pour comprendre l'état de la batterie: la tension en circuit ouvert n'est pas aussi utile que la combinaison de la résistance interne et des tensions à des charges spécifiques fournies par un testeur de charge (ou analyseur de batterie).
zh_cn: 从断开连接的电池的SB连接器上的探针读取的电压读数将为您提供Voc（电压开路或“浮动电压”）处于“未加载”状态的快照。通常，不建议使用Voc来了解电池的健康状况：开路电压不如内部电阻和负载测试仪（或电池分析仪）提供的特定负载下的电压组合有用。

source: **Load Tester**
es_mx: **Prueba de carga**
fr_ca: **Testeur de charge**
zh_cn: **负载测试器**

source: A battery load tester can be used as a quick way to determine the detailed readiness of a battery. It may provide information like: open-load voltage, voltage under load, internal resistance, and state of charge. These metrics can be used to quickly confirm that a battery is ready for a match and even help to identify some long term problems with the battery.
es_mx: Un comprobador de carga de baterías puede utilizarse como una forma rápida de determinar el estado detallado de una batería. Puede proporcionar información como: tensión en carga abierta, tensión bajo carga, resistencia interna y estado de carga. Estas métricas pueden utilizarse para confirmar rápidamente que una batería está lista para un partido e incluso ayudar a identificar algunos problemas a largo plazo con la batería.
fr_ca: Un testeur de charge de batterie peut être utilisé comme un moyen rapide de déterminer l'état de fonctionnement d'une batterie. Il peut fournir des informations telles que: tension de charge ouverte, tension sous charge, résistance interne et état de charge. Ces mesures peuvent être utilisées pour confirmer rapidement qu'une batterie est prête pour un match et même aider à identifier certains problèmes à long terme avec la batterie.
zh_cn: 电池负载测试仪可以用作确定电池详细准备情况的快速方法。它可能提供以下信息：开负载电压，负载电压，内部电阻和充电状态。这些指标可用于快速确认电池已准备就绪，甚至可以帮助确定电池的某些长期问题。

source: Output screen of a common load tester showing properties of the battery.
es_mx: Pantalla de salida de un comprobador de carga común que muestra las propiedades de la batería.
fr_ca: Écran de sortie d’un testeur de charge commune montrant les propriétés de la batterie.

source: Ideal internal resistance should be less than 0.015 Ohms. The manufacturer specification for most batteries is 0.011 Ohms. If a battery gets higher than 0.020 Ohms it is a good idea to consider not using that battery for competition matches.
es_mx: La resistencia interna ideal debe ser inferior a 0.015 Ohms. La especificación del fabricante para la mayoría de las baterías es de 0.011 Ohms. Si una batería supera los 0.020 Ohms, es una buena idea considerar la posibilidad de no utilizar esa batería para los partidos de competencia.
fr_ca: La résistance interne idéale doit être inférieure à 0,015 Ohms. La spécification du fabricant pour la plupart des batteries est de 0,011 Ohms. Si une batterie dépasse 0,020 Ohms, il est judicieux d'envisager de ne pas utiliser cette batterie pour les matchs de compétition.
zh_cn: 理想的内部电阻应小于0.015欧姆。大多数电池的制造商规格为0.011欧姆。如果电池电量高于0.020欧姆，则最好考虑不要在比赛中使用该电池。

source: If a battery shows significantly lower voltages at the higher test current loads, it may not be done charging, or it may need to be retired.
es_mx: Si una batería muestra voltajes significativamente más bajos en las cargas de corriente de prueba más altas, es posible que no termine de cargarse o que deba retirarse.
fr_ca: Si une batterie présente des tensions significativement plus basses aux charges de courant de test les plus élevées, il se peut qu'elle ne se recharge pas ou doive être retirée.
zh_cn: 如果电池在较高的测试电流负载下显示出明显较低的电压，则可能无法完成充电，或者可能需要停用。

source: Understanding Battery Voltages
es_mx: Entendiendo los voltajes de las baterías
fr_ca: Comprendre les tensions de batterie
zh_cn: 了解电池电压

source: A "12V battery" is anything but 12.0V.
es_mx: Una "batería de 12V" es cualquier cosa menos 12.0V.
fr_ca: Une «batterie 12 V» est tout sauf 12,0 V.
zh_cn: “ 12V电池”不是12.0V。

source: Fully charged, a battery can be anywhere from 12.7 to 13.5 volts open circuit (Voc). Open circuit voltage is measured with *nothing* connected.
es_mx: Completamente cargada, una batería puede tener entre 12,7 y 13,5 voltios en circuito abierto (Voc). La tensión en circuito abierto se mide con *nada* conectado.
fr_ca: Complètement chargée, une batterie peut être de 12,7 à 13,5 volts en circuit ouvert (Voc). La tension en circuit ouvert est mesurée avec *aucune charge* connectée.
zh_cn: 充满电后，电池的开路电压（Voc）可以在12.7至13.5伏之间。开路电压是在“未连接*的情况下测量的。
