Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/robot-battery.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Once a load (like a robot) is connected, and any amount of current is flowing, the battery voltage will drop. So if you check a battery with a Voltmeter, and it reads 13.2, and then connect it to your robot and power on, it will read lower, maybe 12.9 on the Driver Station display. Those numbers will vary with every battery and specific robot, see Characterization below. Once your robot starts running, it will pull more current, and the voltage will drop further.
es_mx: Una vez que se conecta una carga (como un robot), y fluye cualquier cantidad de corriente, el voltaje de la batería caerá. Por lo tanto, si comprueba una batería con un voltímetro y marca 13,2, y luego la conecta a su robot y la enciende, marcará un valor inferior, quizás 12,9 en la pantalla de la Driver Station. Estos números variarán con cada batería y robot específico, véase la caracterización más adelante. Una vez que el robot empiece a funcionar, tomará más corriente y el voltaje bajará más.
fr_ca: Une fois qu'une charge (comme un robot) est connectée et qu'une quantité de courant circule, la tension de la batterie chutera. Donc, si vous vérifiez une batterie avec un voltmètre, et qu'il lit 13,2, puis connectez-le à votre robot et allumez-le, il affichera une valeur inférieure, peut-être 12,9 sur l'écran de la station de conduite. Ces chiffres varient avec chaque batterie et chaque robot , voir Caractérisation ci-dessous. Une fois que votre robot commence à fonctionner, il consommera plus de courant et la tension diminuera davantage.
zh_cn: 一旦连接了负载（例如机器人），并且有大量电流流过，电池电压就会下降。因此，如果您用电压表检查电池，并且其读数为13.2，然后将其连接至机器人并打开电源，则其读数会更低，在Driver Station显示屏上可能为12.9。这些数字将随每个电池和特定的机器人而有所不同，请参见下面的特性描述。一旦您的机器人开始运行，它将拉动更多的电流，并且电压将进一步下降。

source: Batteries reading 12.5V on an idle robot should be swapped and charged before a match. Always swap the batteries before the robot starts reaching brownout safety thresholds (dwelling at low voltages on the Driver Station display), as frequently entering low voltage ranges risks permanent battery damage; this behavior can happen at a variety of Voc states depending on battery health, battery manufacturer, and robot design. The battery State of Charge should be kept over 50% for battery longevity.
es_mx: Las baterías que indican 12,5 V en un robot inactivo deben cambiarse y cargarse antes de un partido. Cambie siempre las baterías antes de que el robot empiece a alcanzar los umbrales de seguridad de caída de tensión (que aparecen en la pantalla de la Driver Station), ya que al entrar frecuentemente en rangos de baja tensión se corre el riesgo de dañar la batería de forma permanente; este comportamiento puede producirse en una variedad de estados de la voz dependiendo de la salud de la batería, del fabricante de la misma y del diseño del robot. El estado de carga de la batería debe mantenerse por encima del 50% para su longevidad.
fr_ca: Les batteries lisant 12,5 V sur un robot inactif doivent être échangées et chargées avant un match. Remplacez toujours les batteries avant que le robot ne commence à atteindre les seuils de sécurité contre les baisses de tension (demeurant à basse tension sur l'écran de la station de conduite), car le fonctionnement dans des plages de basse tension risque d'endommager la batterie de manière permanente; ce comportement peut se produire à divers états Voc en fonction de l'état de la batterie, du fabricant de la batterie et de la conception du robot. L'état de charge de la batterie doit être maintenu à plus de 50% pour la longévité de la batterie.
zh_cn: 比赛前，应在闲置的机器人上读取12.5V的电池并进行充电。务必在机器人开始达到节电安全阈值之前将电池更换（在驾驶员站显示屏上停留在低电压下），因为频繁进入低电压范围可能会造成电池永久损坏；这种行为可能会在各种Voc状态下发生，具体取决于电池的运行状况，电池制造商和机器人的设计。电池充电状态应保持50％以上，以延长电池寿命。

source: Battery voltage and current also depends on temperature: cool batteries are happy batteries.
es_mx: El voltaje y la corriente de la batería también dependen de la temperatura: las baterías frías son baterías felices.
fr_ca: La tension et le courant de la batterie dépendent également de la température: les batteries froides sont des batteries heureuses.
zh_cn: 电池电压和电流还取决于温度：凉爽的电池就是快乐的电池。

source: Battery Characterization
es_mx: Caracterización de la batería
fr_ca: Caractérisation de la batterie
zh_cn: 电池特性

source: A battery analyzer can be used to give a detailed inspection and comparison of battery performance.
es_mx: Se puede utilizar un analizador de baterías para realizar una inspección detallada y una comparación del rendimiento de la batería.
fr_ca: Un analyseur de batterie peut être utilisé pour effectuer une inspection détaillée et une comparaison des performances de la batterie.
zh_cn: 电池分析仪可用于详细检查和比较电池性能。

source: Graph from a common battery analyzer plotting volts and AmpHrs for many different batteries.
es_mx: Grafica de un analizador de baterías común que traza voltios y amperios para muchas baterías diferentes.
fr_ca: Graphique d’un analyseur de batterie commun traçant les volts et les AmpHrs pour un ensemble de batteries différentes.

source: It will provide graphs of battery performance over time. This test takes significant time (roughly two hours) so it is less suited to testing during competition. It is recommended to run this test on each battery every year to monitor and track its performance. This will determine how it should be used: matches, practice, testing, or disposed of.
es_mx: Proporcionará gráficos del rendimiento de la batería a lo largo del tiempo. Esta prueba requiere un tiempo considerable (aproximadamente dos horas), por lo que es menos adecuada para realizar pruebas durante la competición. Se recomienda realizar esta prueba en cada batería cada año para controlar y seguir su rendimiento. Esto determinará cómo debe utilizarse: en los partidos, en los entrenamientos, en las pruebas o en la eliminación.
fr_ca: Il fournira des graphiques des performances de la batterie au fil du temps. Ce test prend beaucoup de temps (environ deux heures), il est donc moins adapté aux tests en compétition. Il est recommandé d'exécuter ce test sur chaque batterie chaque année pour surveiller et suivre ses performances. Cela déterminera comment il doit être utilisé: matchs, entraînement, test ou élimination.
zh_cn: 它将提供一段时间内电池性能的图表。该测试需要花费大量时间（大约两个小时），因此不太适合在比赛中进行测试。建议每年对每个电池进行此测试，以监视和跟踪其性能。这将决定应如何使用它：比赛，练习，测试或处置。

source: At the standard 7.5 amps test load, competition batteries should have at least a 11.5 amp hour rating. Anything less than that should only be used for practice or other less demanding use cases.
es_mx: Con la carga de prueba estándar de 7,5 amperios, las baterías de competencia deberían tener una capacidad de 11,5 amperios hora como mínimo. Todo lo que sea menos que eso solo debería usarse para prácticas u otros casos de uso menos exigentes.
fr_ca: À la charge d'essai standard de 7,5 ampères, les batteries de compétition doivent avoir une valeur nominale d'au moins 11,5 ampères-heure. Tout ce qui est inférieur à cela ne doit être utilisé que pour la pratique ou d'autres cas d'utilisation moins exigeants.
zh_cn: 在标准7.5安培的测试负载下，竞赛电池应至少具有11.5安培的小时额定值。少于该限制的任何内容仅应用于实践或其他要求不高的用例。

source: Battery Longevity
es_mx: Longevidad de la batería
fr_ca: Longévité de la batterie
zh_cn: 电池寿命

source: A battery is rated for about 1200 normal charge/recharge cycles. The high currents required for an FRC match reduce that lifespan to about 400 cycles. These cycles are intended to be relatively low discharge, from around 13.5 down to 12 or 12.5 volts. Deep cycling the battery (running it all the way down) will damage it.
es_mx: Una batería tiene una vida útil de unos 1200 ciclos de carga/recarga normales. Las altas corrientes necesarias para un partido de FRC reducen esa vida útil a unos 400 ciclos. Estos ciclos están pensados para una descarga relativamente baja, de unos 13,5 a 12 o 12,5 voltios. Los ciclos profundos de la batería (que se descargue por completo) la dañarán.
fr_ca: Une batterie est conçue pour environ 1200 cycles de charge/recharge normaux. Les courants élevés requis pour un match FRC réduisent cette durée de vie à environ 400 cycles. Ces cycles sont destinés à être à décharge relativement faible, d'environ 13,5 à 12 ou 12,5 volts. Un cycle profond de la batterie (la faire fonctionner complètement avec une grosse charge) l'endommagera.
zh_cn: 电池的额定正常充电/充电周期约为1200次。 FRC匹配所需的高电流将使用寿命缩短到约400个周期。这些循环旨在实现相对较低的放电，从大约13.5伏降至12伏或12.5伏。深度循环使用电池（将其完全耗尽）会损坏电池。

source: Batteries last the longest if they are kept fully charged when not it use, either by charging regularly or by use of a maintenance charger. Batteries drop roughly 0.1V every month of non-use.
fr_ca: Les batteries durent le plus longtemps si elles sont maintenues complètement chargées lorsqu'elles ne sont pas utilisées, soit en les chargeant régulièrement, soit en utilisant un chargeur de maintenance. Les batteries chutent d'environ 0,1 V chaque mois de non-utilisation.

source: Batteries need to be kept away from both extreme heat and cold. This generally means storing the batteries in a climate controlled area: a classroom closet is usually fine, a parking lot shipping container is more risky.
es_mx: Las pilas deben mantenerse alejadas del calor y el frío extremos. Por lo general, esto significa almacenar las baterías en un área con clima controlado: un armario de clase suele estar bien, un contenedor de transporte en un aparcamiento es más arriesgado.
fr_ca: Les batteries doivent être tenues à l'écart de la chaleur et du froid extrêmes. Cela signifie généralement stocker les batteries dans une zone à température contrôlée: un placard de classe est généralement bien, une remise externe exposée aux éléments est plus risqué.
zh_cn: 电池应远离极热和极冷的地方。这通常意味着将电池存放在恒温区域：教室壁橱通常很好，停车场运输容器的危险性更大。

source: Battery Best Practices
es_mx: Mejores prácticas para las baterías
fr_ca: Meilleures pratiques en matière de batterie
zh_cn: 电池最佳使用方法

source: Only use a charged battery for competition matches. If you are in a situation where you have run out of charged batteries, please ask a veteran team for help! Nobody wants to see a robot dead on the field (:ref:`brownout <docs/software/roborio-info/roborio-brownouts:roboRIO Brownout and Understanding Current Draw>`) due to a bad or uncharged battery.
es_mx: Utilice sólo una batería cargada para los partidos de competencia. Si se encuentra en una situación en la que se ha quedado sin baterías cargadas, ¡pide ayuda a un equipo veterano! Nadie quiere ver un robot muerto en el campo (:ref:`brownout <docs/software/roborio-info/roborio-brownouts:roboRIO Brownout and Understanding Current Draw>`) debido a una batería mala o sin cargar.
fr_ca: Utilisez uniquement une batterie chargée pour les matchs de compétition. Si vous êtes dans une situation où vous êtes à court de batteries chargées, veuillez demander de l'aide à une équipe expérimentée! Personne ne veut voir un robot mort sur le terrain (:ref: `brownout <docs / software / roborio-info / roborio-brownouts: roboRIO Brownout and Understanding Current Draw>`) en raison d'une batterie défectueuse ou non chargée.
zh_cn: 比赛时只能使用充电的电池。如果您的电池电量耗尽，请向经验丰富的团队寻求帮助！没有人希望看到由于电池损坏或未充电而使机器人在场上死亡。

source: Teams are strongly recommended to use properly rated tools and stringent quality control practices for crimping processes (ask local veteran teams or a commercial electrician for help), or use vendor-made Battery Leads.
es_mx: Se recomienda encarecidamente a los equipos que utilicen herramientas adecuadas y prácticas estrictas de control de calidad para los procesos de engaste (pida ayuda a los equipos veteranos locales o a un electricista comercial), o que utilicen cables de batería fabricados por el proveedor.
fr_ca: Il est fortement recommandé aux équipes d'utiliser des outils correctement évalués et des pratiques de contrôle qualité strictes pour les processus de sertissage (demandez l'aide des équipes locales de vétérans ou d'un électricien commercial), ou d'utiliser des câbles de batterie fabriqués par le fournisseur.
zh_cn: 强烈建议团队在压接过程中使用具有适当额定值的工具和严格的质量控制做法（向当地资深团队或商业电工寻求帮助），或使用供应商制造的电池引线。

source: Wait for batteries to cool after the match before recharging: the case should not be warm to the touch, fifteen minutes is usually plenty.
es_mx: Espere a que las baterías se enfríen después del partido antes de recargarlas: la carcasa no debe estar caliente al tacto, quince minutos suelen ser suficientes.
fr_ca: Attendez que les batteries refroidissent après le match avant de les recharger: le boîtier ne doit pas être chaud au toucher, quinze minutes suffisent généralement.
zh_cn: 比赛结束后，请等待电池冷却后再充电：机壳不应摸起来很热，通常十五分钟就可以了。

source: Teams should consider purchasing several new batteries each year to help keep their batteries fresh. Elimination matches can require many batteries and there may not be enough time to recharge.
es_mx: Los equipos deberían considerar la posibilidad de comprar varias pilas nuevas cada año para ayudar a mantener sus baterías frescas. Los partidos de eliminación pueden requerir muchas pilas y puede que no haya tiempo suficiente para recargarlas.
fr_ca: Les équipes devraient envisager d'acheter plusieurs nouvelles batteries chaque année pour avoir des batteries fraîches pour les match plus compétitifs. Les matchs d'élimination peuvent nécessiter de nombreuses batteries et il se peut que le temps de recharge ne soit pas suffisant.
zh_cn: 团队应考虑每年购买几节新电池以帮助保持其电池新鲜。淘汰赛可能需要很多电池，并且可能没有足够的时间来充电。

source: A wooden bookcase like cart for storing and charging batteries.
es_mx: Una estantería de madera como un carrito para almacenar y cargar baterías.
fr_ca: Un chariot en forme de bibliothèque en bois pour stocker et charger les batteries.

source: A multi bank battery charger allows you to charge more than one battery at a time. Many teams build a robot cart for their batteries and chargers allowing for easy transport and storage.
es_mx: Un cargador de baterías de varios bancos permite cargar más de una batería a la vez. Muchos equipos construyen un carro de robot para sus baterías y cargadores, lo que permite un fácil transporte y almacenamiento.
fr_ca: Un chargeur de batterie multi-banque vous permet de charger plus d'une batterie à la fois. De nombreuses équipes construisent un chariot robot pour leurs batteries et chargeurs, ce qui facilite le transport et le stockage.
zh_cn: 多库电池充电器可让您一次为多个电池充电。许多团队会为其电池和充电器建立一个机器人手推车，以便于运输和存放。

source: It is a good idea to permanently identify each battery with at least: team number, year, and a unique identifier.
es_mx: Es una buena idea identificar permanentemente cada batería con al menos: número de equipo, año y un identificador único.
fr_ca: C'est une bonne idée d'identifier en permanence chaque batterie avec au moins: le numéro d'équipe, l'année et un identifiant unique.
zh_cn: 最好永久性地至少标识每个电池：团队编号，年份和唯一标识符。

source: Teams may also want to use something removeable (stickers, labeling machine etc.) to identify what that battery should be used for based on its performance data and when the last analyzer test was run.
es_mx: Los equipos también pueden utilizar algo extraíble (pegatinas, máquina de etiquetado, etc.) para identificar para qué debe usarse esa batería en función de sus datos de rendimiento y de cuándo se realizó la última prueba del analizador.
fr_ca: Les équipes peuvent également vouloir utiliser un truc amovible (autocollants, étiqueteuse, etc.) pour identifier l'usage de cette batterie en fonction de ses données de performance et de la date du dernier test de l'analyseur.
zh_cn: 团队可能还希望使用一些可拆卸的物品（贴纸，贴标机等），根据其性能数据以及上次分析仪测试的运行时间来确定该电池的用途。

source: A battery flag is just a small piece of plastic that fits in the battery connector.
es_mx: Una bandera de la batería es sólo una pequeña pieza de plástico que encaja en el conector de la batería.
fr_ca: Un indicateur de batterie est juste un petit morceau de plastique qui tient dans le connecteur de la batterie.

source: Using battery flags (a piece of plastic placed in the battery connector) is a common way to indicate that a battery has been charged. Battery flags can also be easily 3D printed.
es_mx: El uso de banderas de batería (un trozo de plástico colocado en el conector de la batería) es una forma habitual de indicar que una batería se ha cargado. Las banderas para baterías también pueden imprimirse fácilmente en 3D.
fr_ca: L'utilisation de témoins de batterie (un morceau de plastique placé dans le connecteur de batterie) est un moyen courant d'indiquer qu'une batterie a été chargée. Les témoins de batterie peuvent également être facilement imprimés en 3D.
zh_cn: 使用电池标志（电池连接器中放有一块塑料）是指示电池已充电的常用方法。电池标志也可以轻松地被3D打印出。

source: Handles for SB50 contacts can be purchased or 3D printed to help avoid pulling on the leads while connecting or disconnecting batteries. Do not use these handles to carry the weight of the battery.
es_mx: Se pueden adquirir asas para los contactos del SB50 o imprimirlas en 3D para evitar que se tire de los cables al conectar o desconectar las baterías. No utilice estas asas para soportar el peso de la batería.
fr_ca: Des poignées pour contacts SB50 peuvent être achetées ou imprimées en 3D pour éviter de tirer sur les fils lors de la connexion ou de la déconnexion des batteries. N'utilisez pas ces poignées pour supporter le poids de la batterie.
zh_cn: 可以购买SB3触点的手柄或进行3D打印，以帮助避免在连接或断开电池连接时拉扯引线。请勿使用这些手柄搬运电池。

source: A plastic handle bolted on to an assembled SB50 connector.
es_mx: Un mango de plástico atornillado a un conector SB50 montado.
fr_ca: Une poignée en plastique vissée sur un connecteur SB50 assemblé.

source: Some teams sew battery carrying straps from old seatbelts or other flat nylon that fit around the battery to help prevent carrying by leads.
es_mx: Algunos equipos cosen correas para el transporte de la batería a partir de viejos cinturones de seguridad u otro tipo de nylon plano que se ajusta alrededor de la batería para ayudar a evitar el transporte por los cables.
fr_ca: Certaines équipes cousent des sangles de transport de batterie à partir d'anciennes ceintures de sécurité ou d'un autre nylon plat qui s'ajustent autour de la batterie pour éviter d'être transporté par des fils.
zh_cn: 一些团队用旧的安全带或其他扁平尼龙缝制电池携带带，以固定在电池周围来防止导线携带。

source: An example showing a 2" wide nylon strap, wrapped around the battery and sewn into a loop.
es_mx: Un ejemplo que muestra una correa de nylon de 2" de ancho, envuelta alrededor de la batería y cosida en un bucle.
fr_ca: Un exemple montrant une sangle en nylon de 2" de large, enroulée autour de la batterie et cousue en boucle.

source: Cable tie edge clips can be used with 90 degree crimp lugs to strain relieve battery leads.
es_mx: Las abrazaderas de borde de las bridas se pueden utilizar con terminales de engarce de 90 grados para aliviar la tensión de los cables de la batería.
fr_ca: Les clips de bord d'attache de câble (cable tie edge clips) peuvent être utilisés avec des cosses à sertir à 90 degrés pour réduire la tension sur les câbles de batterie.
zh_cn: 扎带边缘夹可与90度压接凸耳一起使用，以减轻电池引线的应力。

source: An example showing edge clips with zipties holding leads on a battery.
es_mx: Un ejemplo que muestra clips de borde con bridas que sujetan los cables de una batería.
fr_ca: Exemple montrant des clips de bord avec des fermetures à glissière tenant des fils sur une batterie.

source: The power supply for an FRC\ |reg| robot is a single 12V 18Ah SLA (Sealed Lead Acid) non-spillable battery, capable of briefly supplying over 180A and arcing over 500A when fully charged. The Robot Battery assembly includes the :term:`COTS` battery, lead cables with contacts, and Anderson SB connector. Teams are encouraged to have multiple Robot Batteries.
tr_tr: FRC\ |reg| robotunun güç kaynağı; kısa süreliğine 180A üzeri akım sağlayabilen ve tamamıyla şarj edildiğinde 500A üzerinde ark oluşturabilen, bir adet sızıntı yapmayan 12V 18Ah SLA (Sealed Lead Acid - Mühürlü Kurşun Asit) aküdür. Robot Aküsünün kurulumu; :term:`COTS` aküsü, kontaktlı kurşun kablolar ve Anderson SB konektörü içermektedir. Takımların birden fazla Robot Aküsüne sahip olması teşvik edilmektedir.

source: The Robot Rules in the Game Manual specify a COTS non-spillable sealed lead acid battery meeting specific criteria, and gives examples of legal part numbers from a variety of vendors.
tr_tr: Oyun Rehberinin Robot Kuralları bölümünde spesifik kriterlere uygun sızdırmaz COTS mühürlü kurşun asit aküleri ve çeşitli satıcılara ait yasal parça numaralarına dair örnekleri belirtilmektedir.

source: **Do *NOT* carry a battery assembly by the cables**, and always avoid pulling by them. Pulling on batteries by the cables will begin to damage the lugs, tabs, and the internal connection of the tab. Over time, fatigue damage can add up until the entire tab tears out of the housing! Even if it isn't clearly broken, internal fatigue damage can increase the battery internal resistance, prematurely wearing out the battery. The battery will not be able to provide the same amount of current with increased internal resistance or if the :ref:`connectors are loose <docs/hardware/hardware-basics/preemptive-troubleshooting:Check Battery Connections>`.
tr_tr: **Pil takımlarını kablolarından tutarak *TAŞIMAYINIZ*** ve herhangi bir durumda kablları çekiştirmeyiniz. Pillerin kablolarından çekilmeleri kabloların pabuçlarına, uçlarına ve uçların dahili bağlantılarına zarar verecektir. Zamanla oluşan yorulma hasarı kablo uçlarının yuvalarından kopmasına sebep olacak kadar ciddi bir hale gelebilmektedir! Görünüşte hasarlı olmasa bile, aldığı iç hasar, akü içi direnci arttırarak akünün erkenden yıpranmasına yol açabilmektedir. Akü, artan iç direnç veya :ref:`gevşek konektörler <docs/hardware/hardware-basics/preemptive-troubleshooting:Check Battery Connections>` yüzünden eskisiyle aynı miktarda akımı sağlayamayacaktır.

source: The insulation must be color-coded per the Game Manual: the +12Vdc wire must be red, white, brown, yellow, or black w/stripe and the ground wire (return wire) must be black or blue. There is no explicit insulation temperature rating requirement, but any blackened or damaged insulation means the wire needs to be replaced: off hand, 105C is plenty and lower will work for almost all robots. There is no insulation voltage rating requirement, lower is better for thinner insulation.
tr_tr: Yalıtım, Oyun Kılavuzu uyarınca renklere göre kodlandırılmış olmalıdır: +12Vdc kablo şeritli kırmızı, beyaz, kahverengi, sarı veya siyah olmalı ve topraklama kablosu (dönüş kablosu) siyah veya mavi olmalıdır. Açık herhangi bir yalıtım sıcaklığı derecelendirme gerekliliği bulunmamaktadır, ancak kararmış ya da hasar görmüş herhangi bir yalıtım kablonun değiştirilmesi gerektiği anlamına gelmektedir: bir başlangıç noktası verilmesi gerekirse, 105C gayet yeterli olacaktır ve bu değerin altı neredeyse hiçbir robotta sorun teşkil etmeyecektir. Herhangi bir yalıtım voltaj derecelendirmesi gerekliliği yoktur, ancak düşük değerler daha ince bir yalıtım için daha iyi olacaktır.
