Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/status-lights-ref.po
Languages: es_mx, fr_ca, he_il, tr_tr

source: No power is being applied to Talon SRX
es_mx: No hay voltaje aplicado al Talon SRX
fr_ca: Aucune alimentation n'est connectée au Talon SRX
tr_tr: Talon SRX'e güç uygulanmıyor

source: LEDs Alternate
es_mx: LEDs alternando
fr_ca: En alternance
tr_tr: LED'ler değişiyor

source: Off/Orange
es_mx: Apagado/Naranja
fr_ca: Éteint/orange
tr_tr: Kapalı/Turuncu

source: CAN bus detected, robot disabled
es_mx: Bus CAN detectado, robot desactivado
fr_ca: Bus CAN détecté, robot désactivé
tr_tr: CAN bus algılandı, robot devre dışı

source: Off/Slow Red
es_mx: Apagado/Rojo lento
fr_ca: Éteint/rouge lent
tr_tr: Kapalı/Yavaş Kırmızı

source: CAN bus/PWM is not detected
es_mx: Bus CAN/PWM no es detectado
fr_ca: Bus CAN/PWM non-détecté
tr_tr: CAN veriyolu/PWM algılanmadı

source: Off/Fast Red
es_mx: Apagado/Rojo rápido
fr_ca: Éteint/rouge rapide
tr_tr: Kapalı/Hızlı Kırmızı

source: Fault Detected
es_mx: Falla detectada
fr_ca: Erreur détectée
tr_tr: Arıza Tespit Edildi

source: LEDs Strobe towards (M-)
es_mx: LEDs estroboscopio hacia (M-)
fr_ca: Témoins clignotant vers (M-)
tr_tr: LED'ler (M-) yönünde yanar

source: Off/Red
es_mx: Apagado/Rojo
fr_ca: Éteint/rouge
he_il: כבוי/אדום
tr_tr: Kapalı/Kırmızı

source: Forward Limit Switch or Forward Soft Limit
es_mx: Interruptor de límite de avance o límite suave de avance
fr_ca: Interrupteur de fin de course avant ou limite logicielle avant
tr_tr: İleri Limit Anahtarı veya İleri Yumuşak Limit

source: LEDs Strobe towards (M+)
es_mx: LEDs estroboscopio hacia (M+)
fr_ca: Témoins clignotant vers (M+)
tr_tr: LED'ler (M +) yönünde yanar

source: Reverse Limit Switch or Reverse Soft Limit
es_mx: Interruptor de límite inverso o límite suave inverso
fr_ca: Interrupteur de fin de course arrière ou limite logicielle arrière
tr_tr: Ters Limit Anahtarı veya Ters Yumuşak Limit

source: LED1 Only (closest to M+/V+)
es_mx: Solo LED1 (el más cercano a M+/V+)
fr_ca: Témoin 1 seulement (plus près de M+/V+)
tr_tr: Yalnızca LED1 (M+/V+'ya en yakın)

source: In Boot-loader
fr_ca: En démarrage
tr_tr: Önyükleyicide

source: Thermal Fault / Shutoff (Talon FX Only)
es_mx: Falla térmica / apagado (solo Talon FX)
fr_ca: Défaut thermique / Arrêt (Talon FX Seulement)
tr_tr: Termal Hata / Kapatma (Yalnızca Talon FX)

source: Status LEDs During Calibration
es_mx: Estado de los LEDs durante la calibración
fr_ca: Témoins durant la calibration
tr_tr: Kalibrasyon Sırasında Durum LED'leri

source: Status LEDs Blink Code
fr_ca: Témoins
tr_tr: Durum LED'leri Yanıp Sönme Kodu

source: Flashing Red/Green
es_mx: Rojo/Verde intermitente
fr_ca: Rouge et vert clignotant
tr_tr: Yanıp Sönen Kırmızı/Yeşil

source: Calibration Mode
es_mx: Modo de calibración
fr_ca: Mode de calibration
tr_tr: Kalibrasyon Modu

source: Successful Calibration
es_mx: Calibración exitosa
fr_ca: Calibration effectuée avec succès
tr_tr: Başarılı Kalibrasyon

source: Failed Calibration
es_mx: Calibración fallida
fr_ca: Calibration échouée
tr_tr: Başarısız Kalibrasyon

source: B/C CAL Blink Codes
es_mx: B/C CAL Códigos de parpadeo
fr_ca: Témoin B/C CAL
tr_tr: B/C CAL Yanıp Sönme Kodları

source: B/C CAL Button Color
es_mx: B/C CAL Color del botón
fr_ca: Couleur du témoin B/C CAL
tr_tr: B/C CAL Düğme Rengi

source: Solid Red
es_mx: Rojo
fr_ca: Rouge
he_il: אדום דולק
tr_tr: Sabit Kırmızı

source: Brake Mode
es_mx: Modo Brake
fr_ca: Mode frein
tr_tr: Fren Modu

source: Coast Mode
es_mx: Modo Coast
fr_ca: Mode roue libre
tr_tr: Boşta Modu

source: SPARK-MAX Motor Controller
es_mx: Controlador de Motor SPARK-MAX
fr_ca: Contrôleur de moteur SPARK-MAX
tr_tr: SPARK-MAX Motor Sürücüsü

source: Table listing the SPARKMAX blink codes.
fr_ca: Tableau répertoriant les codes clignotants du SPARKMAX.

source: REV Robotics SPARK
fr_ca: SPARK (REV Robotics)

source: Table of the SPARK blink codes.
fr_ca: Table des codes clignotants du SPARK.

source: Victor-SP Motor Controller
es_mx: Controlador de Motor Victor-SP
fr_ca: Contrôleur de moteur Victor-SP
tr_tr: Victor-SP Motor Sürücüsü

source: Status LEDs on either side of the center of the Victor-SP.
fr_ca: DELs d’état de chaque côté du centre du Victor-SP.

source: Brake/Coast/Cal Button/LED - Red if the controller is in brake mode, off if the controller is in coast mode
es_mx: Brake/Coast/Cal Button/LED – Rojo sí el controlador está en modo brake, apagado sí el controlador está en modo coast.
fr_ca: Bouton/témoin frein/roue libre/cal - rouge si le contrôleur est en mode frein, éteint si le contrôleur est en mode roue libre
tr_tr: Brake/Coast/Cal Düğmesi/LED - Denetleyici fren-brake modundaysa kırmızı, denetleyici boşta-coast modundaysa söner

source: Solid
es_mx: Sólido
fr_ca: Solide
tr_tr: Sabit

source: Full forward output
es_mx: Salida hacia adelante completa
fr_ca: Avant (pleine puissance)
tr_tr: Tam ileri çıkış

source: Proportional to forward output voltage
es_mx: Hacia adelante proporcional al voltaje de salida
fr_ca: Proportionnel au voltage de sortie (avant)
tr_tr: İleri çıkış voltajı ile orantılı

source: Full reverse output
es_mx: Salida en reversa completa
fr_ca: Arrière (pleine puissance)
tr_tr: Tam ters çıkış

source: FRC robot disabled, PWM signal lost, or signal in deadband range (+/- 4% output)
es_mx: Estado desactivado, señal PWM perdida, robot FRC desactivado, o señal en rango muerto (+/- 4% de salida)
fr_ca: Robot FRC désactivé, signal PWM perdu ou signal dans la zone morte (+/- 4%)
tr_tr: FRC robotu devre dışı, PWM sinyali kayboldu veya sinyal ölü bant aralığında (+/-% 4 çıkış)

source: Red/Green
es_mx: Rojo/Verde
fr_ca: Rouge/vert
he_il: אדום/ירוק
tr_tr: Kırmızı/yeşil

source: Ready for calibration. Several green flashes indicates successful calibration, and red several times indicates unsuccessful calibration.
es_mx: Listo para la calibración. Varios parpadeos verdes indican una calibración exitosa, y rojo varias veces indica una calibración fallida.
fr_ca: Prêt pour la calibration. Plusieurs clignotements verts indiquent que la calibration s'est effectuée avec succès et plusieurs clignotements rouges indiquent que la calibration a échoué.
tr_tr: Kalibrasyona hazır. Birkaç yeşil yanıp sönme, başarılı kalibrasyonu gösterir ve birkaç kez kırmızı, başarısız kalibrasyonu gösterir.

source: Talon Motor Controller
es_mx: Controlador de Motor Talon
fr_ca: Contrôleur de moteur Talon
tr_tr: Talon Motor Sürücüsü

source: Talon motor controller with a single multicolor LED in the bottom right corner.
fr_ca: Contrôleur de moteur Talon avec une seule DEL multicolore dans le coin inférieur droit.

source: Proportional to reverse output voltage
es_mx: En reversa proporcional al voltaje de salida
fr_ca: Proportionnel au voltage de sortie (arrière)
tr_tr: Geri çıkış voltajı ile orantılı

source: No CAN devices are connected
es_mx: No hay dispositivos CAN conectados
fr_ca: Aucun appareil CAN n'est connecté
tr_tr: CAN cihazı bağlı değil

source: Disabled state, PWM signal lost, FRC robot disabled, or signal in deadband range (+/- 4% output)
es_mx: Estado desactivado, señal PWM perdida, robot FRC desactivado, o señal en rango muerto (+/- 4% de salida)
fr_ca: Désactivé, signal PWM perdu, robot FRC désactivé ou signal dans la zone morte (+/- 4%)
tr_tr: Devre dışı durumu, PWM sinyali kayboldu, FRC robotu devre dışı bırakıldı veya ölübant aralığında sinyal (+/-% 4 çıkış)

source: No input power to Talon
es_mx: No hay energía de entrada al Talon
fr_ca: Aucune alimentation au Talon
tr_tr: Talon'a giriş gücü yok

source: Flashing
es_mx: Parpadeando
fr_ca: Clignotant
tr_tr: Yanıp sönüyor

source: Victor888 Motor Controller
es_mx: Controlador de Motor Victor888
fr_ca: Contrôleur de moteur Victor888
tr_tr: Victor888 Motor Sürücüsü

source: Victor888 motor controller with a single multicolor LED in the bottom right corner.
fr_ca: Contrôleur de moteur Victor888 avec une seule DEL multicolore dans le coin inférieur droit.

source: Successful calibration
es_mx: Calibración exitosa
fr_ca: Calibration effectuée avec succès
tr_tr: Başarılı kalibrasyon

source: Unsuccessful calibration
es_mx: Calibración no exitosa
fr_ca: Calibration échouée
tr_tr: Başarısız kalibrasyon

source: Neutral/brake
fr_ca: Neutre/frein
tr_tr: Nötr/fren

source: Calibration mode
es_mx: Modo de calibración
fr_ca: Mode de calibration
tr_tr: Kalibrasyon modu

source: Jaguar Motor Controller
es_mx: Controlador de Motor Jaguar
fr_ca: Contrôleur de moteur Jaguar
tr_tr: Jaguar Motor Sürücüsü

source: Jaguar motor controller with a single multicolor LED in the bottom center.
fr_ca: Contrôleur de moteur Jaguar avec une seule DEL multicolore en bas au centre.

source: LED State
es_mx: Estado del LED
fr_ca: État des témoins
tr_tr: LED Durumu

source: Module Status
es_mx: Estado del módulo
fr_ca: Statut du module
tr_tr: Modül Durumu

source: Normal Operating Conditions
es_mx: Condiciones normales de operación
fr_ca: Conditions de fonctionnement normales
tr_tr: Normal Çalışma Koşulları

source: Solid Yellow
es_mx: Amarillo
fr_ca: Jaune
tr_tr: Sabit Sarı

source: Neutral (speed set to 0)
es_mx: Neutral (velocidad fijada en 0)
fr_ca: Neutre (vitesse à 0)
tr_tr: Nötr (hız 0'a ayarlı)

source: Fast Flashing Green
es_mx: Verde intermitente rápido
fr_ca: Vert clignotant rapidement
tr_tr: Hızlı Yanıp Sönen Yeşil

source: Forward
es_mx: Adelante
fr_ca: Avant
tr_tr: İleri

source: Fast Flashing Red
es_mx: Rojo intermitente rápido
fr_ca: Rouge clignotant rapidement
he_il: אדום מהבהב מהר
tr_tr: Hızlı Yanıp Sönen Kırmızı

source: Reverse
es_mx: Reversa
fr_ca: Arrière
tr_tr: Geri

source: Solid Green
es_mx: Verde
fr_ca: Vert
tr_tr: Sabit yeşil

source: Full-speed forward
es_mx: A toda velocidad
fr_ca: Avant (pleine vitesse)
tr_tr: Tam hızda ileri

source: Full-speed reverse
es_mx: Reversa a toda velocidad
fr_ca: Arrière (pleine vitesse)
tr_tr: Tam hızlı geri

source: Fault Conditions
es_mx: Condiciones de falla
fr_ca: États d'erreur
tr_tr: Arıza Durumları

source: Slow Flashing Yellow
es_mx: Amarillo intermitente lento
fr_ca: Jaune clignotant lentement
tr_tr: Yavaş Yanıp Sönen Sarı

source: Loss of servo or Network link
es_mx: Pérdida del servo o del enlace de la red
fr_ca: Perte du signal PWM ou réseau
tr_tr: Servo veya Ağ bağlantısı kaybı

source: Fast Flashing Yellow
es_mx: Amarillo intermitente rápido
fr_ca: Jaune clignotant rapidement
tr_tr: Hızlı Yanıp Sönen Sarı

source: Invalid CAN ID
es_mx: ID del CAN inválido
fr_ca: ID CAN invalide
tr_tr: Geçersiz CAN ID'si

source: Slow Flashing Red
es_mx: Rojo intermitente lento
fr_ca: Rouge clignotant lentement
he_il: אדום מהבהב לאט
tr_tr: Yavaş Yanıp Sönen Kırmızı

source: Voltage, Temperature, or Limit Switch fault condition
es_mx: Voltaje, temperatura o condición de falla del interruptor de límite
fr_ca: Erreur de voltage, température ou d'interrupteur de fin de course
tr_tr: Voltaj, Sıcaklık veya Limit Anahtarı arızası durumu

source: Slow Flashing Red and Yellow
es_mx: Rojo y Amarillo intermitente lento
fr_ca: Rouge et jaune clignotant lentement
tr_tr: Yavaş Yanıp Sönen Kırmızı ve Sarı

source: Current fault condition
es_mx: Condición de falla de corriente
fr_ca: État d'erreur
tr_tr: Akım arıza durumu

source: Calibration or CAN Conditions
es_mx: Calibración o condiciones CAN
fr_ca: Calibration ou état CAN
tr_tr: Kalibrasyon veya CAN Durumları

source: Flashing Red and Green
es_mx: Rojo y Verde intermitente
fr_ca: Rouge et vert clignotant
tr_tr: Yanıp Sönen Kırmızı ve Yeşil

source: Calibration mode active
es_mx: Modo de calibración activo
fr_ca: Mode de calibration activé
tr_tr: Kalibrasyon modu etkin

source: Flashing Red and Yellow
es_mx: Rojo y Amarillo intermitente
fr_ca: Rouge et jaune clignotant
tr_tr: Yanıp Sönen Kırmızı ve Sarı

source: Calibration mode failure
es_mx: Fallo en el modo de calibración
fr_ca: Échec de la calibration
tr_tr: Kalibrasyon modu hatası

source: Flashing Green and Yellow
es_mx: Verde y Amarillo intermitente
fr_ca: Vert et jaune clignotant
tr_tr: Yanıp Sönen Yeşil ve Sarı

source: Calibration mode success
es_mx: Éxito en el modo de calibración
fr_ca: Succès de la calibration
tr_tr: Kalibrasyon modu başarılı

source: Slow Flashing Green
es_mx: Verde intermitente lento
fr_ca: Vert clignotant lentement
tr_tr: Yavaş Yanıp Sönen Yeşil

source: CAN ID assignment mode
es_mx: Modo de asignación del ID del CAN
fr_ca: Mode d'assignation de l'ID CAN
tr_tr: CAN ID atama modu

source: Current CAN ID (count flashes to determine ID)
es_mx: ID de CAN actual (cuenta parpadeos para determinar el ID)
fr_ca: ID CAN (compter le nombre de clignotements pour déterminer l'ID CAN)
tr_tr: Mevcut CAN ID (ID'yi belirlemek için yanıp sönmeleri sayın)

source: Flashing Yellow
es_mx: Amarillo intermitente
fr_ca: Jaune clignotant
tr_tr: Yanıp Sönen Sarı

source: CAN ID invalid (that is, Set to 0) awaiting valid ID assignment
es_mx: ID de CAN inválido (es decir, puesto a 0) en espera de una asignación de ID válida
fr_ca: ID CAN invalide (programmée à 0) en attente d'une ID valide
tr_tr: CAN ID geçersiz (yani 0'a ayarlı) geçerli bir kimlik atamasını bekliyor

source: The 5 LEDs in each of the corners plus the center.
fr_ca: Les 5 DEL dans chacun des coins plus le centre.

source: The DMC60C contains four RGB (Red, Green, and Blue) LEDs and one Brake/Coast CAL LED. The four RGB LEDs are located in the corners and are used to indicate status during normal operation, as well as when a fault occurs. The Brake/Coast CAL LED is located in the center of the triangle, which is located at the center of the housing, and is used to indicate the current Brake/Coast setting. When the center LED is off, the device is operating in coast mode. When the center LED is illuminated, the device is operating in brake mode. The Brake/Coast mode can be toggled by pressing down on the center of the triangle, and then releasing the button.
es_mx: El DMC60C contiene cuatro LEDs RGB (Rojo, Verde y Azul) y un Brake/Coast CAL LED. Los cuatro RGB LEDs están localizados en las esquinas y se usan para indicar el estado durante la fase normal de operación, así como cuando se produce un fallo. El Brake/Coast CAL LED está localizado en el centro del triángulo, que se encuentra en el centro de la cubierta, y es usado para indicar la configuración actual del Brake/Coast. Cuando el LED central está apagado, el dispositivo está operando en el modo coast. Cuando el LED central está iluminado, el dispositivo está operando en el modo brake. El modo Brake/Coast se puede cambiar presionando el centro del triángulo y después soltando el botón.
fr_ca: Le DMC60C contient quatre témoins RVB et un témoin Brake/Coast CAL. Les quatre témoins RVB sont situés dans les coins et sont utilisés pour indiquer le statut pendant l'opération normale ainsi que lorsqu'une erreur se produit. Le témoin Brake/Coast CAL est positionné au centre du triangle et est utilisé pour indiquer le paramètre frein/roue libre actuel. Lorsque le témoin central est éteint, le contrôleur opère en mode roue libre. Lorsque le témoin est allumé, le contrôleur opère en mode frein. Il est possible d'alterner entre ces deux modes en pressant puis relâchant le centre du triangle.
tr_tr: DMC60C, dört RGB (Kırmızı, Yeşil ve Mavi) LED ve bir Fren/Boşta- Brake/Coast CAL LED'i içerir. Dört RGB LED köşelerde bulunur ve normal çalışma sırasında, ayrıca bir arıza meydana geldiğinde durumu belirtmek için kullanılır. Fren/Boşta CAL LED'i, gövdenin ortasında bulunan üçgenin ortasında bulunur ve mevcut Fren/Boşta ayarını göstermek için kullanılır. Ortadaki LED söndüğünde, cihaz boşta modunda çalışmaktadır. Ortadaki LED yandığında, cihaz fren modunda çalışmaktadır. Fren/Boşta modu, üçgenin ortasına aşağıya doğru basılarak ve ardından düğme bırakılarak değiştirilebilir.

source: At power-on, the RGB LEDs illuminate Blue, continually getting brighter. This lasts for approximately five seconds. During this time, the motor controller will not respond to an input signal, nor will the output drivers be enabled. After the initial power-on has completed, the device begins normal operation and what gets displayed on the RGB LEDs is a function of the input signal being applied, as well as the current fault state. Assuming that no faults have occurred, the RGB LEDs function as follows:
es_mx: Al encenderse, los LEDs RGB se iluminan de color de azul, cada vez más brillantes. Esto dura aproximadamente 5 segundos. Durante este tiempo, el controlador del motor no responderá a una entrada, ni se activarán los controladores de salida. Después de que se haya completado el encendido inicial, el dispositivo comienza a funcionar de manera normal y lo que se muestra en los LEDs RGB es una función de la señal de entrada que se aplica, así como el estado actual de la falla. Asumiendo que no se han producido fallos, los LEDs funcionan de la siguiente manera:
fr_ca: Lors de l'alimentation, les témoins affichent du bleu, devenant continuellement plus lumineux. Cette séquence dure approximativement cinq secondes. Pendant ce démarrage, le contrôleur ne répondra pas à aucun signal d'entrée et les sorties seront désactivées. Après que le démarrage soit complété, le contrôleur est prêt à être utilisé normalement et ce qui est affiché sur les témoins est une fonction du signal d'entrée appliqué ainsi que des erreurs présentes. Assumant qu'aucune erreur ne s'est produite, les témoins afficheront ceci:
tr_tr: Açıldığında, RGB LED'ler Mavi renkte yanarak sürekli daha parlak hale gelir. Bu yaklaşık beş saniye sürer. Bu süre boyunca, motor sürücü bir giriş sinyaline yanıt vermeyecek ve çıkış sürücüleri etkinleştirilmeyecektir. İlk açılış tamamlandıktan sonra, cihaz normal çalışmaya başlar ve RGB LED'lerinde görüntülenen şey, uygulanan giriş sinyalinin yanı sıra mevcut arıza durumunun bir fonksiyonudur. Hata oluşmadığını varsayarsak, RGB LED'leri aşağıdaki gibi çalışır:

source: PWM Signal Applied
es_mx: Señal PWM aplicada
fr_ca: Signal PWM appliqué
tr_tr: PWM Sinyali Uygulandı

source: No Input Signal or Invalid Input Pulse Width
es_mx: No hay señal de entrada o el ancho del pulso de entrada es inválido
fr_ca: Aucun signal en entrée ou signal PWM invalide
tr_tr: Giriş Sinyali Yok veya Geçersiz Giriş Sinyali Genişliği

source: Alternate between top (LED1 and LED2) and bottom (LED3 and LED4) LEDs being illuminated Red and Off.
es_mx: Alternar entre los LEDs superiores (LED1 y LED2) y los inferiores (LED3 y LED4) se iluminan en rojo y apagados.
fr_ca: Les témoins du haut (1 et 2) et ceux du bas (3 et 4) sont illuminés rouge ou éteints en alternance.
tr_tr: Kırmızı ve Kapalı olarak yanan üst (LED1 ve LED2) ve alt (LED3 ve LED4) LED'ler arasında geçiş.

source: Neutral Input Pulse Width
es_mx: Ancho del pulso de entrada neutral
fr_ca: Signal PWM neutre
tr_tr: Nötr Giriş Sinyali Genişliği

source: All 4 LEDs illuminated Orange.
es_mx: Los 4 LEDs iluminados de naranja.
fr_ca: Les 4 témoins sont illuminés orange.
tr_tr: 4 LED'in tümü Turuncu renkte yanar.

source: Positive Input Pulse Width
es_mx: Ancho del pulso de entrada positivo
fr_ca: Signal PWM positif
tr_tr: Pozitif Giriş Sinyali Genişliği

source: LEDs blink Green in a clockwise circular pattern (LED1 → LED2 → LED3 → LED4 → LED1). The LED update rate is proportional to the duty cycle of the output and increases with increased duty cycle. At 100% duty cycle, all 4 LEDs are illuminated Green.
es_mx: Los LEDs parpadean verde en un patrón circular en el sentido de las manecillas del reloj (LED1 → LED2 → LED3 → LED4 → LED1). La frecuencia de actualización del LED es proporcional al ciclo de trabajo de la salida y aumenta con el crecimiento del ciclo de trabajo. Al 100% del ciclo de trabajo, los 4 LEDs se iluminan en verde.
fr_ca: Les témoins clignotent en vert de manière horaire (témoins 1 → 2 → 3 → 4 → 1). La vitesse à laquelle ce cycle se produit est proportionnel au rapport cyclique de la sortie et devient plus rapide lorsque le rapport cyclique augmente. À un rapport cyclique de 100%, les 4 témoins sont illuminés en vert.
tr_tr: LED'ler saat yönünde dairesel bir şekilde Yeşil renkte yanıp söner (LED1 → LED2 → LED3 → LED4 → LED1). LED güncelleme hızı, çıkışın görev döngüsü ile orantılıdır ve artan görev döngüsü ile artar. % 100 görev döngüsünde 4 LED'in tümü Yeşil yanar.

source: Negative Input Pulse Width
es_mx: Ancho del pulso de entrada negativo
fr_ca: Signal PWM négatif
tr_tr: Negatif Giriş Sinyali Genişliği

source: LEDs blink Red in a counter-clockwise circular pattern (LED1 → LED4 → LED3 → LED2 → LED1). The LED update rate is proportional to the duty cycle of the output and increases with increased duty cycle. At 100% duty cycle, all 4 LEDs are illuminated Red.
es_mx: Los LEDs parpadean rojo en un patrón circular en sentido contrario a las manecillas del reloj (LED1 → LED4 → LED3 → LED2 → LED1). La frecuencia de actualización del LED es proporcional al ciclo de trabajo de la salida y aumenta con el crecimiento del ciclo de trabajo. Al 100% del ciclo de trabajo, los 4 LEDs se iluminan rojo.
fr_ca: Les témoins clignotent en rouge de manière anti-horaire (témoins 1 → 4 → 3 → 2 → 1). La vitesse à laquelle ce cycle se produit est proportionnel au rapport cyclique de la sortie et devient plus rapide lorsque le rapport cyclique augmente. À un rapport cyclique de 100%, les 4 témoins sont illuminés en rouge.
tr_tr: LED'ler saat yönünün tersine dairesel bir düzende Kırmızı yanıp söner (LED1 → LED4 → LED3 → LED2 → LED1). LED güncelleme hızı, çıkışın görev döngüsü ile orantılıdır ve artan görev döngüsü ile artar. % 100 görev döngüsünde 4 LED'in tümü Kırmızı renkte yanar.

source: CAN Bus Control State
es_mx: Estado de Control del Bus CAN
fr_ca: État du contrôle par bus CAN
tr_tr: CAN Bus Kontrol Durumu

source: No Input Signal or CAN bus error detected
es_mx: No se ha detectado ninguna señal de entrada o error en el Bus CAN
fr_ca: Aucun signal en entrée ou erreur du bus CAN détectée
tr_tr: Giriş Sinyali Yok veya CAN bus hatası tespit edildi

source: No CAN Control Frame received within the last 100ms or the last control frame specified modeNoDrive (Output Disabled)
es_mx: No se ha recibido ningún cuadro de control CAN en los últimos 100 ms o el último cuadro de control especificado modeNoDrive (Salida Desactivada)
fr_ca: Aucune trame de données CAN reçue dans les dernières 100ms ou la dernière trame de données spécifiait modeNoDrive (sortie désactivée)
tr_tr: Son 100 ms içinde hiçbir CAN Kontrol Frame'i alınması veya son kontrol çerçevesi modeNoDrive (Çıkış Devre Dışı) gönderdi.

source: Alternate between top (LED1 and LED2) and bottom (LED3 and LED4) LEDs being illuminated Orange and Off.
es_mx: Alternan entre la parte superior (LED1 y LED2) y la parte inferior (LED3 y LED4) los LEDs se iluminan en naranja y apagados.
fr_ca: Les témoins du haut (1 et 2) et ceux du bas (3 et 4) sont illuminés orange ou éteints en alternance.
tr_tr: Turuncu ve sönük olarak yanan üst (LED1 ve LED2) ve alt (LED3 ve LED4) LED'ler arasında geçiş.

source: Valid CAN Control Frame received within the last 100ms. The specified control mode resulted in a Neutral Duty Cycle being applied to Motor Output
es_mx: Cuadro de control CAN válido recibido en los últimos 100 ms. El modo de control especificado dio como resultado a que se aplicara un ciclo de trabajo neutro a la salida del motor.
fr_ca: Trame de données CAN valide reçue dans les dernières 100ms. Le mode de contrôle spécifié a résulté en l'application d'un rapport cyclique neutre à la sortie
tr_tr: Son 100 ms içinde geçerli CAN Control Frame alındı. Belirtilen kontrol modu, Motor Çıkışına bir Neutral Duty Cycle uygulanmasına neden oldu

source: All 4 LEDs illuminated solid Orange.
es_mx: Los 4 LEDs se iluminan de naranja
fr_ca: Les 4 témoins sont illuminés orange.
tr_tr: 4 LED'in tümü sürekli Turuncu renkte yanar.
