Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/status-lights-ref.po
Languages: es_mx, fr_ca, he_il, tr_tr

source: Valid CAN Control Frame received within the last 100ms. The specified control mode resulted in a Positive Duty Cycle being Motor Output
es_mx: Cuadro de control CAN válido recibido en los últimos 100 ms. El modo de control especificado dio como resultado un ciclo de trabajo positivo en la salida del motor.
fr_ca: Trame de données CAN valide reçue dans les dernières 100ms. Le mode de contrôle spécifié a résulté en l'application d'un rapport cyclique positif à la sortie
tr_tr: Son 100 ms içinde geçerli CAN Control Frame alındı. Belirtilen kontrol modu, Positive Duty Cycle'ın Motor Çıkışı olmasına neden oldu

source: Valid CAN Control Frame received within the last 100ms. The specified control mode resulted in a Negative Duty Cycle being Motor Output
es_mx: Cuadro de control CAN válido recibido en los últimos 100 ms. El modo de control especificado dio como resultado un ciclo de trabajo negativo en la salida del motor.
fr_ca: Trame de données CAN valide reçue dans les dernières 100ms. Le mode de contrôle spécifié a résulté en l'application d'un rapport cyclique négatif à la sortie
tr_tr: Son 100 ms içinde geçerli CAN Control Frame alındı. CAN Kontrol Çerçevesi. Belirtilen kontrol modu, Negative Duty Cycle'ın Motor Çıkışı olmasına neden oldu

source: Fault Color Indicators
es_mx: Indicadores de color de la falla
fr_ca: Codes couleur d'erreur
tr_tr: Arıza Renk Göstergeleri

source: When a fault condition is detected, the output duty cycle is reduced to 0% and a fault is signaled. The output then remains disabled for 3 seconds. During this time the onboard LEDs (LED1-4) are used to indicate the fault condition. The fault condition is indicated by toggling between the top (LED1 and LED2) and bottom (LED3 and LED4) LEDs being illuminated Red and off. The color of the bottom LEDs depends on which faults are presently active. The table below describes how the color of the bottom LEDs maps to the presently active faults.
es_mx: Cuando se detecta una condición de fallo, el ciclo de trabajo de salida se reduce al 0% y una falla es señalada. La salida entonces permanece desactivada durante 3 segundos. Durante este tiempo los LEDs (LED1-4) a bordo se usan para indicar la condición de fallo. La condición de fallo se indica alternando entre los LEDs superiores (LED1 y LED2) e inferiores (LED3 y LED4) que se iluminan en rojo y se apagan. El color de los LEDs inferiores depende de qué fallas están actualmente activas. La siguiente tabla describe cómo el color de los LEDs inferiores corresponde con las fallas actualmente activas.
fr_ca: Lorsqu'une erreur est détectée, le rapport cyclique en sortie est réduit à 0% et l'erreur est signalée. La sortie reste ensuite désactivée pour 3 secondes. Les témoins 1 à 4 sont utilisés pour indiquer l'état d'erreur. L'état d'erreur est indiqué en alternant entre les témoins du haut (1 et 2) et ceux du bas (3 et 4) étant illuminés rouge ou éteints. La couleur des témoins du bas dépend de l'erreur détectée. Le tableau ci-dessous décris à quelle erreur correspondent les différentes couleurs des témoins du bas.
tr_tr: Bir arıza durumu tespit edildiğinde, çıkış görev döngüsü %0'a düşürülür ve arıza sinyali bildirilir. Çıkış daha sonra 3 saniye devre dışı kalır. Bu süre zarfında yerleşik LED'ler (LED1-4) arıza durumunu göstermek için kullanılır. Arıza durumu, kırmızı renkte yanan ve sönen üst (LED1 ve LED2) ve alt (LED3 ve LED4) LED'ler arasında geçiş yapılarak gösterilir. Alttaki LED'lerin rengi o anda hangi arızaların aktif olduğuna bağlıdır. Aşağıdaki tablo, alttaki LED'lerin renginin halihazırda aktif olan arızalarla nasıl eşleştiğini açıklamaktadır.

source: Color
fr_ca: Couleur
he_il: צבע
tr_tr: Renk

source: Over Temperature
es_mx: Sobre Temperatura
fr_ca: Surchauffe
tr_tr: Aşırı ısınma

source: Under Voltage
es_mx: Bajo voltaje
fr_ca: Sous-tension
tr_tr: Düşük Gerilim

source: On
es_mx: Encendido
fr_ca: Allumé

source: Break/Coast Mode
es_mx: Modo Break/Coast
fr_ca: Mode frein/roue libre
tr_tr: Fren/Boşta Modu

source: When the center LED is off the device is operating in coast mode. When the center LED is illuminated the device is operating in brake mode. The Brake/Coast mode can be toggled by pressing down on the center of the triangle and then releasing the button.
es_mx: Cuando el LED central está apagado el dispositivo está operando en el modo coast. Cuando el LED central está iluminado el dispositivo está operando en el modo brake. El modo Brake / Coast se puede cambiar presionando el centro del triángulo y después soltando el botón.
fr_ca: Lorsque le témoin du centre est éteint, le contrôleur opère en mode roue libre. Lorsque le témoin du centre est illuminé, le contrôleur opère en mode frein. Le mode peut être changé en pressant le centre du triangle puis en le relâchant.
tr_tr: Ortadaki LED söndüğünde, cihaz boşta modunda çalışmaktadır. Ortadaki LED yandığında, cihaz fren modunda çalışmaktadır. Fren/Boşta modu, üçgenin ortasına basılarak ve ardından düğme bırakılarak değiştirilebilir.

source: Venom Motor Controller
es_mx: Controlador de motor de veneno
fr_ca: Contrôleur de moteur Venom
tr_tr: Venom Motor Sürücüsü

source: The LED blink codes for the Venom.
fr_ca: Les codes du clignotement des DELs pour le Venom.

source: The two LEDs on the top one at each end and the LED on the side next to the connector.
fr_ca: Les deux DELs situés en haut à chaque extrémité et la DEL située sur le côté à proximité du connecteur.

source: Power LED
fr_ca: Témoin d'alimentation

source: Power is not supplied
es_mx: Energía no suministrada
fr_ca: Aucune alimentation en entrée
tr_tr: Güç uygulanmadı

source: Power is supplied
es_mx: Energía suministrada
fr_ca: Alimentation présente en entrée
tr_tr: Güç uygulandı

source: Motor LED
fr_ca: Témoin moteur

source: Forward direction
es_mx: Dirección hacia adelante
fr_ca: Avant
tr_tr: İleri yönde

source: Reverse direction
es_mx: Dirección en reversa
fr_ca: Arrière
tr_tr: Geri yön

source: PWM Signal LED
es_mx: PWM Señal LED
fr_ca: Témoin de signal PWM
tr_tr: PWM Sinyal LED

source: No valid PWM signal is detected
es_mx: No se detecta señal PWM válida
fr_ca: Aucun signal PWM valide n'es détecté
tr_tr: Geçerli bir PWM sinyali algılanmadı

source: Valid PWM signal is detected
es_mx: Se detecta una señal PWM válida
fr_ca: Un signal PWM valide est détecté
tr_tr: Geçerli PWM sinyali algılandı

source: CAN Signal LED
es_mx: LED Señal CAN
fr_ca: Témoin de signal CAN
tr_tr: CAN Sinyal LED

source: Blinking quickly
es_mx: Parpadea rápidamente
fr_ca: Clignotant rapidement
he_il: מהבהב במהירות
tr_tr: Hızla yanıp sönüyor

source: Connected to the roboRIO and the driver station is open
es_mx: Conectado a la roboRIO y la driver station está abierta.
fr_ca: Connecté au roboRIO et le Driver Station est ouvert
tr_tr: RoboRIO'ya bağlı ve sürücü istasyonu açık

source: One power LED and a status LED for each channel all down the center.
fr_ca: Un voyant lumineux pour l’alimentation et un voyant lumineux d’état pour chaque canal situé au centre.

source: Status LEDs
fr_ca: Témoins d'état
tr_tr: Durum LED'leri

source: Each channel has a corresponding status LED that will indicate the sensed state of the connected PWM signal. The table below describes each state’s corresponding LED pattern.
fr_ca: Chaque canal a un témoin correspondant indiquant l'état du signal PWM connecté. Le tableau ci-dessous indique à quel état correspond chaque indication du témoin.
tr_tr: Her kanalın, bağlı PWM sinyalinin durumuna karşılık gelen bir durum LED'i vardır. Aşağıdaki tablo her bir duruma karşılık gelen LED paternini açıklamaktadır.

source: State
es_mx: Estado
fr_ca: État
tr_tr: Durum

source: Pattern
es_mx: Patrón
fr_ca: Témoin
tr_tr: Desen

source: No Signal
es_mx: No hay señal
fr_ca: Aucun signal
tr_tr: Sinyal yok

source: Blinking Amber
es_mx: Ámbar parpadeante
fr_ca: Ambre clignotant
he_il: כתום מהבהב
tr_tr: Yanıp Sönen Koyu sarı

source: Left/Reverse Signal
es_mx: Señal de Izquierda/Reversa
fr_ca: Signal négatif
tr_tr: Sol/Geri Sinyal

source: Center/Neutral Signal
es_mx: Señal Central/Neutral
fr_ca: Signal neutre
tr_tr: Merkez/Nötr Sinyal

source: Solid Amber
es_mx: Ámbar
fr_ca: Ambre
he_il: כתום דולק
tr_tr: Sabit Koyu Sarı

source: Right/Forward Signal
es_mx: Señal de Derecha/Adelante
fr_ca: Signal positif
tr_tr: Sağ/İleri Sinyal

source: 6V Power LED off, dim or flickering with power applied = Over-current shutdown
es_mx: 6 V Power LED apagado, tenue o parpadeando con la energía aplicada = Apagado por sobrecorriente
fr_ca: Témoin d'alimentation 6V éteint, faible out clignotant avec une alimentation appliquée = excès de courant
tr_tr: 6V Güç LED'i kapalı, güç uygulandığında kararıyor veya titriyor = Aşırı akım koruma/kapatma

source: Spike relay configured as a motor, light, or solenoid switch
es_mx: Revelador Spike configurado como motor, luz o interruptor solenoide.
fr_ca: Relais Spike configuré en tant que moteur, lumière ou interrupteur solénoïde
tr_tr: Motor, ışık veya solenoid anahtarı olarak yapılandırılmış Spike rölesi

source: Single LED in the corner.
fr_ca: DEL unique dans le coin.

source: **Inputs**
fr_ca: **Entrées**
tr_tr: **Girişler**

source: **Outputs**
fr_ca: **Sorties**
tr_tr: **Çıkışlar**

source: **Indicator**
fr_ca: **Témoin**
tr_tr: **Gösterge**

source: **Motor Function**
fr_ca: **Fonction**
tr_tr: **Motor fonksiyon**

source: **Forward (White)**
fr_ca: **Avant (blanc)**
tr_tr: **İleri (Beyaz)**

source: **Reverse (Red)**
fr_ca: **Arrière (rouge)**
tr_tr: **Geri (Kırmızı)**

source: Off/Brake Condition (default)
es_mx: Condición de apagado/frenado (por defecto)
fr_ca: Éteint/frein (défaut)
tr_tr: Kapalı/Fren Durumu (varsayılan)

source: Motor rotates in one direction
es_mx: El motor gira en una dirección
fr_ca: Moteur tournant dans une direction
tr_tr: Motor tek yönde dönüyor

source: Motor rotates in opposite direction
es_mx: El motor gira en dirección opuesta
fr_ca: Moteur tournant dans la direction opposée
tr_tr: Motor ters yönde dönüyor

source: Off/Brake Condition
es_mx: Condición de apagado/frenado
fr_ca: Éteint/frein
tr_tr: Kapalı/Fren Durumu

source: 'Brake Condition' refers to the dynamic stopping of the motor due to the shorting of the motor inputs. This condition is not optional when going to an off state.
es_mx: “Condición de frenado” Se refiere a la parada dinámica del motor debido al cortocircuito de las entradas del motor. Esta condición no es opcional cuando se va a un estado desactivado.
fr_ca: Le frein se réfère à l'arrêt dynamique du moteur par le court-circuitage des terminaux du moteur. Ceci n'est pas optionnel lorsque le relais est désactivé.
tr_tr: 'Fren Durumu', motor girişlerindeki kısa devre nedeniyle motorun dinamik olarak durdurulmasını ifade eder. Bu koşul kapalı duruma geçerken isteğe bağlı değildir.

source: Spike relay configured as for one or two solenoids
es_mx: Relevador Spike configurado para uno o dos solenoides.
fr_ca: Relais Spike configuré pour un ou deux solénoïdes
tr_tr: Bir veya iki solenoid için yapılandırılmış Spike rölesi

source: Both Solenoids Off (default)
es_mx: Ambos solenoides apagados (por defecto)
fr_ca: Les deux solénoïdes sont éteints (défaut)
tr_tr: Her İki Solenoid Kapalı (varsayılan)

source: Solenoid connected to M+ is ON
es_mx: El solenoide conectado a M+ está encendido
fr_ca: Solénoïde connecté à M+ est alimenté
tr_tr: M+'ya bağlı solenoid AÇIK

source: Solenoid connected to M- is ON
es_mx: El solenoide conectado a M- está encendido
fr_ca: Solénoïde connecté à M- est alimenté
tr_tr: M-'ye bağlı solenoid AÇIK

source: Both Solenoids ON
es_mx: Ambos solenoides encendidos
fr_ca: Les deux solénoïdes sont alimentés
tr_tr: Her iki Solenoid AÇIK

source: Orange
es_mx: Naranja
he_il: כתום
tr_tr: Turuncu

source: Power
es_mx: Energía
tr_tr: Güç

source: Eth Link
tr_tr: Eth Bağlantısı

source: WiFi
tr_tr: Kablosuz internet - WiFi

source: Long
es_mx: Largo
he_il: ארוך
tr_tr: Uzun

source: Cyan / Aqua
tr_tr: Mavi / Açık Mavi

source: REV Robotics Servo Power Module
es_mx: REV Robotics Módulo de Energía de Servo
tr_tr: REV Robotics Servo Güç Modülü

source: Fail Safe
es_mx: A prueba de fallos

source: Mindsensors SD540C (CAN Bus)
es_mx: Mindsensors SD540C (Bus CAN)
