Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/status-lights-ref.po
Languages: es_mx, fr_ca, he_il, tr_tr

source: Status Light Quick Reference
es_mx: Referencia rápida del estado de la luz
fr_ca: Signification des témoins lumineux
he_il: הסבר קצר על Status Light
tr_tr: Durum Işığı için Hızlı Referans

source: Many of the components of the FRC\ |reg| Control System have indicator lights that can be used to quickly diagnose problems with your robot. This guide shows each of the hardware components and describes the meaning of the indicators. Photos and information from Innovation FIRST and Cross the Road Electronics.
es_mx: Muchos de los componentes del sistema de control de FRC\ |reg| tienen luces indicadoras que se pueden usar para diagnosticar rápidamente los problemas con su robot. Esta guía muestra cada uno de los componentes de hardware y describe el significado de los indicadores. Fotos e información de Innovation FIRST y Cross the Road Electronics.
fr_ca: De nombreux composants du FRC\ |reg| Le système de contrôle dispose de voyants lumineux qui peuvent être utilisés pour diagnostiquer rapidement les problèmes avec votre robot. Ce guide présente chacun des composants matériels et décrit la signification des voyants. Photos et informations d'Innovation FIRST et Cross the Road Electronics.
tr_tr: FRC\ |reg| Kontrol Systemi'nin birçok bileşeninde, robotunuzla ilgili sorunları hızlı bir şekilde teşhis etmek için kullanılabilecek gösterge ışıkları bulunur. Bu kılavuz, her bir donanım bileşenini gösterir ve göstergelerin anlamını açıklar. Fotoğraf ve bilgiler Innovation FIRST ve Cross the Road Electronics'ten alınmıştır.

source: Robot Signal Light (RSL)
es_mx: Luz de señal de robot (RSL)
fr_ca: Témoin diagnostique (RSL)
tr_tr: Robot Sinyal Işığı - Robot Signal Light (RSL)

source: Robot Signal Light with wiring.
es_mx: Luz de Señalización para Robots con cableado.
fr_ca: Signal lumineux du robot avec câblage.

source: Solid ON
es_mx: Encendido fijo
fr_ca: Allumé
he_il: דולק
tr_tr: Sabit ON - AÇIK

source: Robot On and Disabled
es_mx: Robot encendido y deshabilitado
fr_ca: Robot alimenté et désactivé
he_il: הרובוט דולק ומושבת
tr_tr: Robot On - Açık ve Disabled - Devre Dışı

source: Blinking
es_mx: Parpadeando
fr_ca: Allumé clignotant
he_il: מהבהב
tr_tr: Yanıp Sönüyor

source: Robot On and Enabled
es_mx: Robot encendido y habilitado
fr_ca: Robot alimenté et activé
he_il: הרובוט דולק ופועל
tr_tr: Robot On - Açık ve Enabled - Etkin

source: Off
es_mx: Apagado
fr_ca: Éteint
he_il: כבוי
tr_tr: Off - Kapalı

source: Robot Off, roboRIO not powered or RSL not wired properly
es_mx: Robot apagado, roboRIO no encendido o RSL no cableado correctamente
fr_ca: Robot non alimenté, roboRIO non alimenté ou RSL mal câblée
he_il: הרובוט כבוי, ה-roboRIO לא מופעל או ה-RSL אינו מחובר כראוי
tr_tr: Robot Off - Kapalı, roboRIO'ya güç verilmedi veya RSL uygun şekilde bağlanmadı

source: roboRIO status lights highlighted.
es_mx: Luces de estado de roboRIO resaltadas.
fr_ca: Indicateurs d’état du roboRIO mis en surbrillance.

source: Green
es_mx: Verde
fr_ca: Vert
he_il: ירוק
tr_tr: Yeşil

source: Power is good
es_mx: La energía está bien
fr_ca: Alimentation OK
he_il: המתח בסדר
tr_tr: Güç iyi durumda

source: Amber
es_mx: Ámbar
fr_ca: Ambre
he_il: כתום
tr_tr: Kehribar - Sarımsı Turuncu

source: Brownout protection tripped, outputs disabled
es_mx: Protección contra apagones activada, salidas desactivadas
fr_ca: Protection contre les sous-tensions déclenchée, sorties désactivées
tr_tr: Kısa devre-yanma koruması tetiklendi, çıkışlar devre dışı

source: Red
es_mx: Rojo
fr_ca: Rouge
he_il: אדום
tr_tr: Kırmızı

source: Power fault, check user rails for short circuit
es_mx: Fallo de energía, revise los rieles del usuario para ver si hay cortocircuitos
fr_ca: Faute d'alimentation, vérifier les connexions pour un court-circuit
tr_tr: Güç hatası, kısa devre için kullanıcı hatlarını kontrol edin

source: On while the controller is booting, then should turn off
es_mx: Encendido mientras el controlador se está iniciando, luego debería apagarse
fr_ca: Allumée pendant que le contrôleur démarre, devrait s'éteindre ensuite
tr_tr: Denetleyici başlatılırken açıktır, sonrasında sönmelidir

source: 2 blinks
es_mx: 2 parpadeos
fr_ca: 2 clignotements
he_il: 2 הבהובים
tr_tr: 2 kere yanıp sönme

source: Software error, reimage roboRIO
es_mx: Error de software, reimagen de roboRIO
fr_ca: Erreur logicielle, ré-imager le roboRIO
tr_tr: Yazılım hatası, roboRIO'ya yeniden imaj atın

source: 3 blinks
es_mx: 3 parpadeos
fr_ca: 3 clignotements
he_il: 3 הבהובים
tr_tr: 3 kez yanıp sönme

source: Safe Mode, restart roboRIO, reimage if not resolved
es_mx: Modo seguro, reinicie roboRIO, vuelva a crear una imagen si no se resuelve
fr_ca: Mode sans échec, redémarrer le roboRIO, ré-imager si ce n'est pas résolu
tr_tr: Safe mode - Güvenli Mod, roboRIO'yu yeniden başlatın, çözülmediyse yeniden imaj atın.

source: 4 blinks
es_mx: 4 parpadeos
fr_ca: 4 clignotements
he_il: 4 הבהובים
tr_tr: 4 kez yanıp sönme

source: Software crashed twice without rebooting, reboot roboRIO, reimage if not resolved
es_mx: El software se bloqueó dos veces sin reiniciar, reinicie roboRIO, vuelva a crear una imagen si no se resuelve
fr_ca: Le logiciel a planté deux fois sans redémarrer, redémarrer le roboRIO, ré-imager si ce n'est pas résolu
tr_tr: Yazılım yeniden başlatılmadan iki kez çöktü, roboRIO'yu yeniden başlatın, çözülmediyse yeniden imaj atın

source: Constant flash or stays solid on
es_mx: Parpadeo constante o fijo
fr_ca: Clignotement constant ou reste allumée
tr_tr: Sürekli yanıp sönüyor veya sabit kalıyor

source: Unrecoverable error
es_mx: Error irrecuperable
fr_ca: Erreur irrécupérable
he_il: שגיאה בלתי ניתנת לשחזור
tr_tr: Kurtarılamaz hata

source: Not currently implemented
es_mx: No implementado actualmente
fr_ca: N'est pas implémenté pour le moment
he_il: לא מומש כרגע
tr_tr: Şu anda uygulanmıyor

source: No Communication
es_mx: Sin comunicacion
fr_ca: Aucune communication
he_il: אין תקשורת
tr_tr: İletişim yok

source: Red Solid
es_mx: Rojo sólido
fr_ca: Rouge
he_il: אדום דולק
tr_tr: Sabit Kırmızı

source: Communication with DS, but no user code running
es_mx: Comunicación con DS, pero sin código de usuario en ejecución
fr_ca: Communication avec le Driver Station, mais pas de code utilisateur en cours d'exécution
he_il: מתקשר עם ה-DS, אך קוד המשתמש אינו פועל
tr_tr: DS ile iletişim var ancak çalışan kullanıcı kodu yok

source: Red Blinking
es_mx: Parpadeando rojo
fr_ca: Rouge clignotant
he_il: אדום מהבהב
tr_tr: Kırmızı Yanıp Sönüyor

source: E-stop triggered
es_mx: Paro de emergencia activado
fr_ca: Arrêt d'urgence déclenché
he_il: E-stop הופעל
tr_tr: E-stop tetiklendi

source: Green Solid
es_mx: Verde sólido
fr_ca: Vert
he_il: ירוק דולק
tr_tr: Yeşil Sabit

source: Good communications with DS
es_mx: Buena comunicación con DS
fr_ca: Bonne communication avec le Driver Station
he_il: מתקשר עם ה-DS
tr_tr: DS ile iletişim iyi

source: Outputs disabled (robot in Disabled, brown-out, etc.)
es_mx: Salidas deshabilitadas (robot deshabilitado, apagón, etc.)
fr_ca: Sorties désactivées (robot désactivé, sous-tension, etc.)
tr_tr: Çıkışlar devre dışı (robot devre dışı modda, kesinti, vb.)

source: Autonomous Enabled
es_mx: Autónomo Habilitado
fr_ca: Autonome activé
he_il: אוטונומי פועל
tr_tr: Otonom Etkin

source: Teleop Enabled
es_mx: Teleoperado Habilitado
fr_ca: Téléopération activée
he_il: טלאופ פועל
tr_tr: Teleop Etkin

source: Test Enabled
es_mx: Test Habilitado
fr_ca: Test activé
he_il: בדיקה פועלת
tr_tr: Test Etkin

source: `See above <#robot-signal-light-rsl>`_
es_mx: `Ver arriba <#robot-signal-light-rsl>` _
fr_ca: `Voir plus haut <#robot-signal-light-rsl>`_
he_il: `ראו מעלה <#robot-signal-light-rsl>`_
tr_tr: `Yukarıya bakın <#robot-signal-light-rsl>`_

source: OpenMesh Radio
fr_ca: Radio OpenMesh
tr_tr: OpenMesh Radyo

source: Radio with the Wifi, Eth Link (2), and Power ports labeled.
fr_ca: Radio avec les ports Wifi, Eth Link (2) et alimentation étiquetés.

source: Blue
es_mx: Azul
fr_ca: Bleu
he_il: כחול
tr_tr: Mavi

source: On or Powering up
es_mx: Encendido o encendiendo
fr_ca: Allumée ou en démarrage
he_il: דולק או נדלק
tr_tr: On - Açık veya Açılıyor

source: Blue Blinking
fr_ca: Bleu clignotant
he_il: כחול מהבהב
tr_tr: Mavi Yanıp Sönüyor

source: Powering Up
fr_ca: En démarrage
he_il: נדלק
tr_tr: Açılıyor

source: Link up
fr_ca: Lien effectué
he_il: מחובר
tr_tr: Bağlantı mevcut

source: Traffic Present
fr_ca: Trafic présent
he_il: קיימת תעבורה
tr_tr: Trafik Mevcut

source: Bridge mode, Unlinked or non-FRC firmware
fr_ca: Mode passerelle, non-lié ou firmware non-FRC
tr_tr: Bridge - Köprü modu, Bağlantısız veya FRC olmayan ürün yazılımı

source: AP, Unlinked
fr_ca: Point d'accès, non-lié
tr_tr: AP, Bağlantısız

source: Yellow/Orange
fr_ca: Jaune/orange
he_il: צהוב/כתום
tr_tr: Sarı/Turuncu

source: AP, Linked
fr_ca: Point d'accès, lié
tr_tr: AP, Bağlantılı

source: Bridge mode, Linked
fr_ca: Mode passerelle, lié
tr_tr: Bridge - Köprü modu, Bağlantılı

source: Power Distribution Panel
es_mx: Panel de distribución de energía
fr_ca: Panneau de distribution de puissance (PDP)

source: The location of the "STAT" and "COMM" lights on the PDP.
es_mx: La ubicación de las luces "STAT" y "COMM" en el PDP.
fr_ca: L’emplacement des voyants "STAT" et "STAT" sur le PDP.

source: PDP Status/Comm LEDs
es_mx: Estatus PDP/Comm LEDs
fr_ca: Témoins Status/Comm du PDP
tr_tr: PDP Status/Comm - İletişim LED'leri

source: LED
fr_ca: Témoin

source: Strobe
es_mx: Estroboscópico
fr_ca: Clignotant
tr_tr: Flaş

source: Slow
es_mx: Lento
fr_ca: Lent
tr_tr: Yavaş

source: No Fault - Robot Enabled
es_mx: Sin fallas: robot habilitado
fr_ca: Aucune erreur - robot activé
tr_tr: Hata Yok - Robot Etkin

source: No Fault - Robot Disabled
es_mx: Sin fallas: robot deshabilitado
fr_ca: Aucune erreur - robot désactivé
tr_tr: Hata Yok - Robot Devre Dışı

source: Sticky Fault
es_mx: Falla pegajosa
fr_ca: Erreur
tr_tr: Yapışkan Hata

source: No CAN Comm
es_mx: Sin comunicación CAN
fr_ca: Aucune communication CAN
tr_tr: CAN İletişimi yok

source: If a PDP LED is showing more than one color, see the PDP LED special states table below. For more information on resolving PDP faults see the PDP User Manual.
es_mx: Si un LED del PDP muestra más de un color, consulte la tabla de estados especiales de LED del PDP a continuación. Para obtener más información sobre la resolución de fallas del PDP, consulte el Manual de usuario del PDP.
fr_ca: Si un indicateur du PDP affiche plus d'une couleur, voir le tableau des états particuliers des témoins du PDP ci-dessous. Pour plus d'informations sur la résolution des problèmes avec le PDP, consulter le manuel utilisateur du PDP.
tr_tr: Bir PDP LED'i birden fazla renk gösteriyorsa, aşağıdaki PDP LED özel durum tablosuna bakın. PDP hatalarının çözümü hakkında daha fazla bilgi için PDP Kullanıcı Kılavuzuna bakın.

source: Note that the No CAN Comm fault will occur if the PDP cannot communicate with the roboRIO via CAN Bus.
fr_ca: Noter que le témoin Comm n'affichera aucune communication CAN si le PDP ne peut communiquer avec le roboRIO via le bus CAN.
tr_tr: PDP, CAN bus üzerinden roboRIO ile iletişim kuramazsa CAN İletişimi Yok hatasının ortaya çıkacağını unutmayın.

source: PDP Special States
es_mx: Estados especiales del PDP
fr_ca: États particuliers des témoins du PDP
tr_tr: PDP Özel Durumları

source: LED Colors
es_mx: Colores LED
fr_ca: Couleurs des témoins
tr_tr: LED Renkleri

source: Problem
es_mx: Problema
fr_ca: Problème
tr_tr: Sorun

source: Red/Orange
es_mx: Rojo/Naranja
fr_ca: Rouge/orange
he_il: אדום/כתום
tr_tr: Kırmızı/Turuncu

source: Damaged Hardware
es_mx: Hardware dañado
fr_ca: Matériel endommagé
tr_tr: Hasarlı Donanım

source: Green/Orange
es_mx: Verde/Naranja
fr_ca: Vert/orange
he_il: ירוק/כתום
tr_tr: Yeşil/Turuncu

source: In Bootloader
es_mx: En el cargador de arranque
fr_ca: En démarrage
tr_tr: Bootloader'da

source: No LED
es_mx: Sin LED
fr_ca: Aucun témoin
tr_tr: LED yok

source: No Power/ Incorrect Polarity
es_mx: Sin energía / Polaridad incorrecta
fr_ca: Aucune alimentation/polarité incorrecte
tr_tr: Güç Yok/Yanlış Kutup bağlantısı

source: Power Distribution Hub
fr_ca: Concentrateur de distribution d'alimentation

source: REV Power Distribution Hub with Status LED, and Channel LEDs Highlighted
es_mx: Centro de distribución de energía REV con LED de estado y LEDs de canal resaltados
fr_ca: Concentrateur de distribution d'alimentation REV avec voyant d'état et voyants de canal mis en surbrillance

source: These led patterns only apply to firmware version 21.1.7 and later
es_mx: Esos patrones de led solo aplican a la versión de firmware 21.1.7 y superiores
fr_ca: Ces modèles de voyants ne s'appliquent qu'à la version 21.1.7 et ultérieure du micrologiciel

source: PDH Status LED
es_mx: LED del estado de PDH
fr_ca: Voyant d'état PDH

source: LED Color
es_mx: Color de LED
fr_ca: Couleur de la DEL

source: Status
es_mx: Estado
fr_ca: Statut
tr_tr: Status - durum

source: Blue Solid
es_mx: Azul sólido
fr_ca: Bleu

source: Device on but no communication established
es_mx: Dispositivo encendido pero comunicación no establecida
fr_ca: Appareil allumé mais aucune communication établie

source: Main Communication with roboRIO established
es_mx: Comunicacion Principal con roboRIO establecida
fr_ca: Communication principale avec roboRIO établie

source: Magenta Blinking
es_mx: Magenta Parpadeando
fr_ca: Magenta clignotant

source: Keep Alive Timeout
es_mx: Mantener con vida el tiempo de espera
fr_ca: Délai d'attente de maintien en vie

source: Solid Cyan
fr_ca: Turquoise

source: Secondary Heartbeat (Connected to REV Hardware Client)
fr_ca: Heartbeat secondaire (connecté au client matériel REV)

source: Orange/Blue Blinking
es_mx: Naranja/Azul parpadeando
fr_ca: Clignotant Orange/Bleu

source: Low Battery
es_mx: Bateria baja
fr_ca: Faible batterie

source: Orange/Yellow Blinking
es_mx: Naranja/Amarillo parpadeando
fr_ca: Clignotant Orange/Jaune

source: CAN Fault
es_mx: falla en CAN
fr_ca: Erreur sur le bus CAN

source: Orange/Cyan Blinking
es_mx: Naranja/Cian parpadeando
fr_ca: Clignotant Orange/Turquoise

source: Hardware Fault
es_mx: falla del Hardware
fr_ca: Faute du Matériel

source: Orange/Red Blinking
es_mx: Naranja/Rojo parpadeando
fr_ca: Clignotant Orange/Rouge

source: Orange/Magenta Blinking
es_mx: Naranja/Magenta parpadeando
fr_ca: Clignotant Orange/Magenta

source: Device Over Current
es_mx: Dispositivo sobre corriente
fr_ca: Erreur de surintensité de courant

source: Channel LEDs
fr_ca: DELs pour canaux

source: Channel has voltage and is operating as expected
es_mx: El canal tiene voltaje y está operando como se esperaba
fr_ca: Le canal est sous tension et fonctionne comme prévu

source: Channel has NO voltage and there is an active fault. Check for tripped or missing circuit breaker / fuse
fr_ca: Le canal n'a PAS de tension et il y a un défaut actif. Vérifiez s'il y a un disjoncteur/fusible déclenché ou manquant

source: Sticky fault on the channel. Check for tripped circuit breaker / fuse.
fr_ca: Défaut persistant sur le canal. Vérifiez s'il y a un disjoncteur/fusible déclenché.

source: Voltage Regulator Module
es_mx: Módulo regulador de voltaje
fr_ca: Régulateur de tension (VRM)
tr_tr: Voltage Regulator Module - Voltaj Regülatör Modülü

source: Highlights the position of the 12V and 5V status lights.
fr_ca: Met en évidence la position des voyants d’état 12V et 5V.

source: The status LEDs on the VRM indicate the state of the two power supplies. If the supply is functioning properly the LED should be lit bright green. If the LED is not lit or is dim, the output may be shorted or drawing too much current.
es_mx: Los LED de estado del VRM indican el estado de las dos fuentes de alimentación. Si el suministro funciona correctamente, el LED debe iluminarse en verde brillante. Si el LED no está encendido o está apagado, la salida puede estar en cortocircuito o consumir demasiada corriente.
fr_ca: Les témoins sur le VRM indiquent l'état des deux alimentations électriques. Si les alimentations fonctionnent de manière adéquate, les deux témoins devraient être allumés en vert. Si les témoins sont faibles ou éteints, la sortie pourrait avoir un court-circuit ou tirer trop de courant.
tr_tr: VRM üzerindeki durum LED'leri iki güç kaynağının durumunu gösterir. Besleme düzgün çalışıyorsa, LED parlak yeşil yanmalıdır. LED yanmıyorsa veya soluksa, çıkış kısa devre olabilir veya çok fazla akım çekebilir.

source: Pneumatics Control Module (PCM)
es_mx: Módulo de control neumático (PCM)
fr_ca: Module de contrôle pneumatique (PCM)
tr_tr: Pneumatics Control Module (PCM) - Pnömatik Kontrol Modülü

source: Highlights both the "Status" and "Comp" lights in the middle and the individual channel lights on the sides.
fr_ca: Met en surbrillance les voyants lumineux "Status" et "Comp" au milieu et les voyants lumineux de canal individuels sur les côtés.

source: PCM Status LED
es_mx: PCM Estado del LED
fr_ca: Témoin du PCM
tr_tr: PCM Durum LED'i

source: No Fault Robot Enabled
es_mx: No se ha activado ningún fallo en el robot
fr_ca: Aucune erreur - robot activé
tr_tr: Hata Yok - Robot Etkin

source: No CAN Comm or Solenoid Fault (Blinks Solenoid Index)
es_mx: No hay comunicación con el CAN o hay fallo del solenoide (parpadea índice de solenoides)
fr_ca: Aucune communication CAN ou erreur d'un solénoïde (la lumière propre au solénoïde clignotera)
tr_tr: CAN İletişimi veya Solenoid Hatası Yok (Solenoid İndeksi Yanıp Sönüyor)

source: Compressor Fault
es_mx: Fallo del Compresor
fr_ca: Erreur du compresseur
tr_tr: Kompresör Arızası

source: If a PCM LED is showing more than one color, see the PCM LED special states table below. For more information on resolving PCM faults see the PCM User Manual.
es_mx: Sí un LED en el PCM muestra más de un color, vea la tabla de los diferentes estados especiales del LED del PCM la cual se encuentra abajo. Para más información sobre cómo resolver errores del PCM, consulte el manual de usuario del PCM.
fr_ca: Si un indicateur du PCM affiche plus d'une couleur, voir le tableau des états particuliers des témoins du PCM ci-dessous. Pour plus d'informations sur la résolution des problèmes avec le PCM, consulter le manuel utilisateur du PCM.
tr_tr: Bir PCM LED'i birden fazla renk gösteriyorsa, aşağıdaki PCM LED özel durum tablosuna bakın. PCM hatalarının çözümü hakkında daha fazla bilgi için PCM Kullanıcı Kılavuzuna bakın.

source: Note that the No CAN Comm fault will not occur only if the device cannot communicate with any other device, if the PCM and PDP can communicate with each other, but not the roboRIO.
es_mx: Tome en cuenta que el fallo de la comunicación del CAN no se producirá solo sí el dispositivo no puede comunicarse con cualquier otro dispositivo, si el PCM y la PDP pueden comunicarse entre sí, pero no con la roboRIO.
fr_ca: Noter que l'erreur No CAN Comm ou Aucune communication CAN ne s'affichera pas si le PCM ne peut communiquer avec aucune autre composante, si le PCM et le PDP peuvent communiquer entre eux, mais pas le roboRIO
tr_tr: CAN İletişimi Yok arızasının sadece cihaz başka bir cihazla iletişim kuramazsa değil, PCM ve PDP birbirleriyle iletişim kurup roboRIO ile iletişim kuramazsa da ortaya çıkacağına dikkat edin.

source: PCM LED Special States Table
es_mx: Tabla de estados especiales LED del PCM
fr_ca: États particuliers des témoins du PCM
tr_tr: PCM LED Özel Durum Tablosu

source: Problems
es_mx: Problemas
fr_ca: Problèmes
tr_tr: Sorunlar

source: No Power/Incorrect Polarity
es_mx: No hay energía / Polaridad incorrecta
fr_ca: Pas d'alimentation/polarité incorecte
tr_tr: Güç Yok/Yanlış Kutup Bağlantısı

source: PCM Comp LED
es_mx: PCM LED del compresor
fr_ca: Témoin Comp du PCM
tr_tr: PCM Comp LED'i

source: This is the Compressor LED. This LED is green when the compressor output is active (compressor is currently on) and off when the compressor output is not active.
es_mx: Este es el LED del compresor. Este LED es verde cuando la salida del compresor está activa (actualmente el compresor se encuentra encendido) y se apaga cuando la salida del compresor no está activa.
fr_ca: Ce témoin est le témoin du compresseur. Celui-ci sera vert lorsque la sortie du compresseur est active (compresseur alimenté) et éteint lorsque la sortie du compresseur n'est pas active
tr_tr: Bu, Kompresör LED'idir. Bu LED, kompresör çıkışı aktif olduğunda yeşildir (kompresör şu anda açık) ve kompresör çıkışı aktif olmadığında kapalıdır.

source: PCM Solenoid Channel LEDs
es_mx: LEDs del canal de solenoide PCM
fr_ca: Témoins des canaux solénoïdes du PCM
tr_tr: PCM Solenoid Kanal LED'leri

source: These LEDs are lit red if the Solenoid channel is enabled and not lit if it is disabled.
es_mx: Estos LEDs se encienden en rojo si el canal del solenoide está activado y no se encienden si está desactivado.
fr_ca: Ces témoins sont allumés rouge si le canal du solénoïde est alimenté et éteints s'il n'est pas alimenté.
tr_tr: Solenoid kanalı etkinse bu LED'ler kırmızı yanar ve devre dışı bırakılırsa yanmaz.

source: Pneumatic Hub
fr_ca: Concentrateur pneumatique

source: REV Pneumatic Hub with Status LED, Compressor LED, and Solenoid LEDs highlighted
fr_ca: Concentrateur pneumatique REV avec DEL d'état, DEL de compresseur et DEL de solénoïde en surbrillance

source: PH Status LED
fr_ca: Voyant de statut PH

source: Main Communication established
fr_ca: Communication principale établie

source: Secondary Heartbeat (connected to REV HW Client)
fr_ca: Heartbeat secondaire (connecté au client REV HW)

source: Orange/Green Blinking
fr_ca: Clignotant Orange/Vert

source: Compressor LED
fr_ca: DEL du compresseur

source: Compressor On
fr_ca: Compresseur activé

source: Black Solid
fr_ca: Noire

source: Compressor Off
fr_ca: Compresseur arrêté

source: Solenoid LEDs
fr_ca: DEL du solénoïde

source: Solenoid On
fr_ca: Solénoïde activé

source: Solenoid Off
fr_ca: Solénoïde désactivé

source: Talon SRX & Victor SPX & Talon FX Motor Controllers
es_mx: Controladores de motor Talon SRX, Victor SPX y Talon FX
fr_ca: Contrôleurs de moteurs Talon SRX , Victor SPX & Talon FX
tr_tr: Talon SRX & Victor SPX & Talon FX Motor Sürücüleri

source: Status LEDs on either side of the center of the Talon SRX.
fr_ca: DELs d’état de chaque côté du centre du Talon SRX.

source: Status LEDs During Normal Operation
es_mx: Estado de LEDs durante la operación normal
fr_ca: Témoins en opération normale
tr_tr: Normal Çalışma Sırasında Status-Durum LED'leri

source: LEDs
fr_ca: Témoins
tr_tr: LED'ler

source: Colors
es_mx: Colores
fr_ca: Couleurs
tr_tr: Renkler

source: Talon SRX State
es_mx: Estado del Talon SRX
fr_ca: État du Talon SRX
tr_tr: Talon SRX Durumu

source: Both
es_mx: Ambos
fr_ca: Les deux
tr_tr: Her ikisi de

source: Blinking Green
es_mx: Parpadeando verde
fr_ca: Vert clignotant
tr_tr: Yanıp Sönen Yeşil

source: Forward throttle is applied. Blink rate is proportional to Duty Cycle.
es_mx: Se aplica el acelerador de avance. La tasa de parpadeo es proporcional al ciclo de trabajo.
fr_ca: Signal positif appliqué. Vitesse du clignotement proportionnelle au rapport cyclique.
tr_tr: İleri yönlü güç uygulandı. Yanıp sönme oranı, Görev Döngüsü-duty cycle ile orantılıdır.

source: Blinking Red
es_mx: Parpadeando rojo
fr_ca: Rouge clignotant
tr_tr: Yanıp Sönen Kırmızı

source: Reverse throttle is applied. Blink rate is proportional to Duty Cycle.
es_mx: Se aplica el acelerador en reversa. La tasa de parpadeo es proporcional al ciclo de trabajo.
fr_ca: Signal négatif appliqué. Vitesse du clignotement proportionnelle au rapport cyclique.
tr_tr: Ters yönlü güç uygulandı. Yanıp sönme oranı, Görev Döngüsü-duty cycle ile orantılıdır.

source: None
es_mx: Ninguno
fr_ca: Aucun
tr_tr: Yok
