Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/wiring-pneumatics.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Wiring Pneumatics
es_mx: Cableando la neumática
fr_ca: Raccordements du système pneumatique
tr_tr: Pnömatik Kablolaması
zh_cn: 气动系统的连接

source: For pneumatics safety & mechanical requirements, consult this year's Robot Construction rules. For mechanical design guidelines, the FIRST Pneumatics Manual is located `here (last updated 2017) <https://firstfrc.blob.core.windows.net/frc2017/pneumatics-manual.pdf>`__
es_mx: Para la seguridad neumática y los requisitos mecánicos, consulte las reglas de construcción de robots de este año. Para obtener pautas de diseño mecánico, el manual de Neumatica de FIRST se encuentra `aquí (última actualización en 2017) <https://firstfrc.blob.core.windows.net/frc2017/pneumatics-manual.pdf>`__
fr_ca: Pour tout ce qui concerne la sécurité pneumatique et les exigences mécaniques, consultez les règles de construction du robot de cette année. Pour les lignes directrices en matière de conception mécanique, le manuel pneumatique de FIRST est situé `ici (dernière mise à jour 2017) <https://firstfrc.blob.core.windows.net/frc2017/pneumatics-manual.pdf>`__
tr_tr: Pnömatik güvenliği ve mekanik gereksinimler için bu yılın Robot Yapım kurallarına bakın. Mekanik tasarım yönergeleri için, FIRST Pnömatik Kılavuzu `burada bulunmaktadır (son güncelleme 2017) <https://firstfrc.blob.core.windows.net/frc2017/pneumatics-manual.pdf>`__
zh_cn: 有关气动系统的安全性与机械要求，请参阅本年度的《机器人搭建指南》。有关机器人的设计指南，您可以在`此处找到 (最新更新于 2017) <https://firstfrc.blob.core.windows.net/frc2017/pneumatics-manual.pdf>`__

source: Wiring Overview
es_mx: Descripción general del cableado
fr_ca: Survol des raccordements
tr_tr: Kablolamaya Genel Bakış
zh_cn: 连接概述

source: A single PCM will support most pneumatics applications, providing an output for the compressor, input for the pressure switch, and outputs for up to 8 solenoid channels (12V or 24V selectable). The module is connected to the roboRIO over the CAN bus and powered via 12V from the PDP.
es_mx: Un solo PCM soportará la mayoría de las aplicaciones neumáticas, proporcionando una salida para el compresor, entrada para el interruptor de presión y salidas de hasta 8 canales del solenoide (12 o 24 V seleccionables). El módulo está conectado al roboRIO a través del bus CAN y se alimenta a través de 12V desde el PDP.
fr_ca: Un seul module PCM est capable de prendre en charge la plupart des applications pneumatiques, fournissant la sortie électrique pour l'alimentation du compresseur, l'entrée pour le commutateur de pression pneumatique ainsi que les 8 canaux de sorties pour le contrôle des électrovalves solénoïdes (12V ou 24V sélectionnable). Le module est connecté au roboRIO sur le bus CAN et alimenté via 12V à partir du PDP
tr_tr: Tek bir PCM, kompresör için bir çıkış, basınç anahtarı için giriş ve 8 adede kadar selenoid kanal (12V veya 24V seçilebilir) için çıkış sağlayarak çoğu pnömatik uygulamasını destekleyecektir. Modül, CAN veriyolu üzerinden roboRIO'ya bağlanır ve PDP'den 12V ile beslenir.
zh_cn: 只用一个PCM模块就可以支撑起大多数气动应用，比如为压缩机提供输出，为压力传感器提供输入，还可以为多达8个电磁阀通道（可选择12V或24V）提供输出。这个模块通过CAN总线与roboRIO连接，并通过PDP的12v供电口进行供电。

source: For complicated robot designs requiring more channels or multiple solenoid voltages, additional PCMs can be added to the control system.
es_mx: Para diseños de robots complicados que requieren más canales o múltiples voltajes de solenoide, se pueden agregar PCM adicionales al sistema de control.
fr_ca: Pour les conceptions plus complexe de système pneumatique de robot nécessitant plus de canaux ou de multiples tensions solénoïdes, des modules PCM supplémentaires peuvent être ajoutés au système de contrôle initial.
tr_tr: Daha fazla kanal veya çoklu selenoid voltajı gerektiren karmaşık robot tasarımları için, kontrol sistemine ek PCM'ler eklenebilir.
zh_cn: 而为了设计那些需要更多的通道，或需要更高的电压给多个电磁阀的更复杂的机器人，您可以在控制系统中增加额外的PCM模块来解决问题。

source: PCM Power and Control Wiring
es_mx: Energía para PCM y control del cableado
fr_ca: Raccordements de l’alimentation et de contrôle du module PCM
tr_tr: PCM Güç ve Kontrol Kablolaması
zh_cn: PCM模块的供电与控制的接线

source: Pneumatics wiring diagram showing all of the connections to the PCM.
es_mx: El esquema de cableado de la neumática que muestra todas las conexiones con el PCM.
fr_ca: Schéma du câblage de la pneumatique montrant toutes les connexions au PCM.

source: The first PCM on your robot can be wired from the PDP VRM/PCM connectors on the end of the PDP. The PCM is connected to the roboRIO via CAN and can be placed anywhere in the middle of the CAN chain (or on the end with a custom terminator). For more details on wiring a single PCM, see :ref:`docs/zero-to-robot/step-1/how-to-wire-a-robot:Pneumatics Control Module Power (Optional)`
es_mx: El primer PCM de su robot puede conectarse desde los conectores PDP VRM / PCM en el extremo del PDP. El PCM está conectado al roboRIO a través de CAN y se puede colocar en cualquier lugar en el medio de la cadena CAN (o en el extremo con un terminador personalizado). Para obtener más detalles sobre el cableado de un solo PCM, consulte :ref:`docs/zero-to-robot/step-1/how-to-wire-a-robot:Pneumatics Control Module Power (Optional)`
fr_ca: Le premier PCM de votre robot peut être câblé à partir des connecteurs PDP VRM/PCM à l’extrémité du PDP. Le PCM est connecté au roboRIO via CAN et peut être placé n’importe où au milieu de la chaîne CAN (ou à la fin avec un connecteur personnalisé). Pour plus de détails sur le câblage d’un seul PCM, veuillez consulter :ref:`docs/zero-to-robot/step-1/how-to-wire-a-robot:Pneumatics Control Module Power (Optional)`
tr_tr: Robotunuzdaki ilk PCM, PDP'nin ucundaki PDP VRM / PCM konektörlerinden bağlanabilir. PCM, CAN aracılığıyla roboRIO'ya bağlanır ve CAN zincirinin ortasında herhangi bir yere (veya özel bir sonlandırıcı ile ucuna) yerleştirilebilir. Tek bir PCM'nin kablolanması hakkında daha fazla ayrıntı için bkz .:ref:`docs/zero-to-robot/step-1/how-to-wire-a-robot:Pneumatics Control Module Power (Optional)`
zh_cn: 可以通过PDP末端的PDP VRM / PCM连接器连接机器人上的第一个PCM。 PCM通过CAN连接到roboRIO，可以放置在CAN链中间的任何位置（或使用自定义终端的一端）。有关接线单个PCM的更多详细信息，请参见： :ref:`docs/zero-to-robot/step-1/how-to-wire-a-robot:Pneumatics Control Module Power (Optional)`

source: Additional PCMs can be wired to a standard WAGO connector on the side of the PDP and protected with a 20A or smaller circuit breaker. Additional PCMs should also be placed anywhere in the middle of the CAN chain.
es_mx: Se pueden conectar PCM adicionales a un conector WAGO estándar en el costado del PDP y proteger con un disyuntor de 20A o menos. También se deben colocar PCM adicionales en cualquier lugar en el medio de la cadena CAN.
fr_ca: Les modules PCM supplémentaires peuvent être câblés à un connecteur WAGO standard sur le côté du PDP et protégés par un disjoncteur 20A ou plus petit. Des modules PCM supplémentaires doivent également être placés n’importe où au milieu de la chaîne du réseau bus CAN
tr_tr: Ek PCM'ler, PDP'nin yan tarafındaki standart bir WAGO konektörüne bağlanabilir ve 20A veya daha küçük bir devre kesici ile korunabilir. Ek PCM'ler de CAN zincirinin ortasında herhangi bir yere yerleştirilmelidir.
zh_cn: 额外的PCM模块也可以连接到PDP侧面的标准WAGO接口，并且由一个20A的或者更小电流的断路器来保护。额外的PCM模块也应当可以放置在CAN链路中间的任意一处。

source: The Compressor
es_mx: El compresor
fr_ca: Le compresseur d'air
tr_tr: Kompresör
zh_cn: 压缩机

source: The compressor can be wired directly to the Compressor Out connectors on the PCM. If additional length is required, make sure to use 18 AWG wire or larger for the extension.
es_mx: El compresor se puede conectar directamente a los conectores Compressor Out en el PCM. Si se requiere una longitud adicional, asegúrese de utilizar un cable de 18 AWG o más grande para la extensión.
fr_ca: Le compresseur d'air peut être relié directement aux connecteurs 'Compressor Out' sur le module PCM. Si une longueur supplémentaire est requise, assurez-vous d’utiliser du fil de calibre 18 AWG ou supérieur pour l'extension supplémentaire.
tr_tr: Kompresör, doğrudan PCM'deki Kompresör Çıkış konektörlerine bağlanabilir. Ek uzunluk gerekirse, uzatma için 18 AWG veya daha büyük kablo kullandığınızdan emin olun.
zh_cn: 压缩机可以直接连接到PCM模块上的Compressor OUT接口。如果您需要对接线进行延长，请保证您使用的是18 AWG或者更粗的电线。

source: The Pressure Switch
es_mx: El interruptor de presión
fr_ca: Le pressostat (commutateur de pression)
tr_tr: Basınç Anahtarı
zh_cn: 压力开关

source: The pressure switch should be connected directly to the pressure switch input terminals on the PCM. There is no polarity on the input terminals or on the pressure switch itself, either terminal on the PCM can be connected to either terminal on the switch. Ring or spade terminals are recommended for the connection to the switch screws (note that the screws are slightly larger than #6, but can be threaded through a ring terminal with a hole for a #6 screw such as the terminals shown in the image).
es_mx: El interruptor de presión debe conectarse directamente a los terminales de entrada del interruptor de presión en la PCM. No hay polaridad en los terminales de entrada o en el interruptor de presión en sí, cualquiera de los terminales del PCM se puede conectar a cualquiera de los terminales del interruptor. Se recomiendan terminales de anillo o de horquilla para la conexión a los tornillos del interruptor (tenga en cuenta que los tornillos son un poco más grandes que el n.° 6, pero se pueden enroscar a través de un terminal de anillo con un orificio para un tornillo n.° 6, como los terminales que se muestran en la imagen) .
fr_ca: Le pressostat doit être connecté directement aux terminaux d’entrée du commutateur de pression sur le module PCM. Il n’y a pas de polarité sur les terminaux d’entrée ou sur le pressostat lui-même. Les terminaux sur le module PCM peuvent être connecté à l’un ou l’autre des terminaux sur le pressostat. Il est recommandé d'utiliser des bornes en forme d'anneau ou de fourche pour la connexion aux bornes vissées du pressostat. (notez que les vis sont légèrement plus grandes que #6, mais peuvent être enfilées à travers un terminal avec un trou pour une vis #6 telles que les bornes indiquées dans l’image).
tr_tr: Basınç anahtarı, doğrudan PCM üzerindeki basınç anahtarı giriş terminallerine bağlanmalıdır. Giriş terminallerinde veya basınç anahtarının kendisinde kutuplaşma yoktur, PCM'deki her iki terminal de anahtar üzerindeki terminallerden birine bağlanabilir. Anahtar vidalarına bağlantı için halka veya yassı terminaller önerilir (vidaların #6'dan biraz daha büyük olduğunu, ancak resimde gösterilen terminaller gibi #6 vida için bir delik bulunan bir halka terminalden geçirilebileceğini unutmayın) .
zh_cn: 压力开关应当直接连接到PCM模块上的压力开关输入端口处。输入端口和压力开关本身没有极性，您可以任意链接PCM模块上任意端口之开关上的任意端子。建议使用环形或叉形端口来连接到开关螺钉（请注意，螺钉尺寸比#6稍大，但可以穿过带有#6螺钉孔的的环形端子，如图所示）

source: Solenoids
es_mx: Solenoides
fr_ca: Électrovalves solénoïdes
tr_tr: Solenoidler
zh_cn: 电磁阀

source: Each solenoid channel should be wired directly to a numbered pair of terminals on the PCM. A single acting solenoid will use one numbered terminal pair. A double acting solenoid will use two pairs. If your solenoid does not come with color coded wiring, check the datasheet to make sure to wire with the proper polarity.
es_mx: Cada canal de solenoide debe conectarse directamente a un par de terminales numerados en el PCM. Un solenoide de acción simple utilizará un par de terminales numerados. Un solenoide de doble acción utilizará dos pares. Si su solenoide no viene con cableado codificado por colores, verifique la hoja de datos para asegurarse de cablear con la polaridad adecuada.
fr_ca: Chaque canal servant a activer une électrovalve solénoïde doit être câblé directement vers une paire numérotée de terminaux sur le module PCM. Une électrovalve solénoïde à action unique utilisera une seule paire terminale numérotée. Un électrovalve solénoïde à double action utilisera deux paires. Si votre électrovalve solénoïde n’est pas fournie avec le câblage codé en couleur, vérifiez la feuille de spécifications techniques pour vous assurer de la brancher avec la polarité appropriée
tr_tr: Her solenoid kanal, doğrudan PCM üzerindeki numaralı bir çift terminale bağlanmalıdır. Tek etkili bir solenoid, bir numaralı terminal çifti kullanacaktır. Çift etkili bir solenoid iki çift kullanacaktır. Solenoidiniz renk kodlu kablolarla gelmiyorsa, doğru kutuplara bağladığınızdan emin olmak için veri sayfasını kontrol edin.
zh_cn: 每个电磁阀通道应该直接连接至PCM模块上带有编号的一对端口上，一个单作用电磁阀会使用一个带编号的端口对，而一个双作用电磁阀会使用两对。如果您使用的电磁阀没有带颜色标注的接线，请检查数据表以保证连接的极性正确。

source: Solenoid Voltage Jumper
es_mx: Puente de voltaje de solenoide
fr_ca: Cavalier de sélection de tension des électrovalves solénoïdes
tr_tr: Solenoid Voltaj Bağlantı Köprüsü
zh_cn: 电磁阀电压跳线

source: The "VSOL" jumper in the center of the PCM with the 12V and 24V showing the left and right positions of the jumper respectively.
fr_ca: Le cavalier "VSOL" au centre du PCM avec le 12V et le 24V montrant respectivement les positions gauche et droite du cavalier.

source: The PCM is capable of powering either 12V or 24V solenoids, but all solenoids connected to a single PCM must be the same voltage. The PCM ships with the jumper in the 12V position as shown in the image. To use 24V solenoids move the jumper from the left two pins (as shown in the image) to the right two pins. The overlay on the PCM also indicates which position corresponds to which voltage. You may need to use a tool such as a small screwdriver, small pair of pliers, or a pair of tweezers to remove the jumper.
es_mx: El PCM es capaz de alimentar solenoides de 12V o 24V, pero todos los solenoides conectados a un solo PCM deben tener el mismo voltaje. El PCM se envía con el puente en la posición de 12V como se muestra en la imagen. Para usar solenoides de 24 V, mueva el puente de los dos pines de la izquierda (como se muestra en la imagen) a los dos pines de la derecha. La superposición del PCM también indica qué posición corresponde a qué voltaje. Es posible que deba usar una herramienta como un destornillador pequeño, un par de alicates pequeños o un par de pinzas para quitar el puente.
fr_ca: Le module PCM est capable d’alimenter les électrovalves solénoïdes à une tension soit de 12V ou de 24V. Par contre toutes les solénoïdes connectés à un seul et même module PCM doivent être alimentés à la même tension. Le module PCM est livré avec le cavalier en position 12V comme le montre l’image. Pour utiliser des solénoïdes en mode 24V, il suffit de déplacer le cavalier de sélection de tension de la gauche vers la droite de deux broches (comme indiqué dans l’image) . L'indication sur le module PCM indique également quelle position correspond à quelle tension. Vous devrez peut-être utiliser un outil tel qu’un petit tournevis, une petite paire de pinces ou une pincette pour retirer le cavalier.
tr_tr: PCM, 12V veya 24V solenoidleri çalıştırabilir, ancak tek bir PCM'ye bağlı tüm solenoidler aynı voltajda olmalıdır. PCM, resimde gösterildiği gibi 12V konumunda bağlantı köprüsü ile birlikte gönderilir. 24V solenoidleri kullanmak için bağlantı köprüsünü soldaki iki pinden (resimde gösterildiği gibi) sağdaki iki pime hareket ettirin. PCM üzerindeki katman ayrıca hangi pozisyonun hangi voltaja karşılık geldiğini gösterir. Bağlantı köprüsünü çıkarmak için küçük bir tornavida, küçük bir çift pense veya bir cımbız gibi bir alet kullanmanız gerekebilir.
zh_cn: PCM模块可以为12V或24V电磁阀进行供电，但是应保证所有连接至同一个PCM模块上的电磁阀电压相同。如图所示，PCM模块所附带的跳线位于12V位置。若要使用24V电磁阀，请提前将跳线从左侧的两针（如图所示）移至右侧两针，PCM模块上的图片指示了哪个位置对应哪个电压。您可能需要使用类似小螺丝刀，小钳子或小镊子的工具来卸下跳线帽。
