Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/wiring-best-practices.po
Languages: es_mx, fr_ca, ja, pt, tr_tr, zh_cn

source: Wiring Best Practices
es_mx: Mejores prácticas de cableado
fr_ca: Les meilleures techniques de câblage
ja: 配線のベストプラクティス
pt: Boas Práticas para Fiação
tr_tr: En İyi Kablolama Uygulamaları
zh_cn: 连接线路的最佳实践

source: The article :ref:`Wiring the FRC Control System <docs/zero-to-robot/step-1/how-to-wire-a-robot:How to Wire an FRC Robot>` walks through the details of what connects where to wire up the FRC Control System and this article provides some additional "Best Practices" that may increase reliability and make maintenance easier. Take a look at :doc:`Preemptive Troubleshooting <preemptive-troubleshooting>` for more tips and tricks.
es_mx: El artículo :ref:`Wiring the FRC Control System <docs/zero-to-robot/step-1/how-to-wire-a-robot:How to Wire an FRC Robot>` describe los detalles sobre qué y dónde cablear el sistema de control FRC y este artículo proporciona algunas "Mejores prácticas" adicionales que pueden aumentar la confiabilidad y facilitar el mantenimiento. Eche un vistazo a :doc:`Preemptive Troubleshooting <preemptive-troubleshooting>` para obtener más consejos y trucos.
fr_ca: L'article :ref:`Câblage du système de contrôle FRC <docs/zero-to-robot/step-1/how-to-wire-a-robot:How to Wire an FRC Robot>` passe à travers les détails relatifs au câblage des différents composants du système de contrôle FRC et cet article fournit quelques conseils additionnels sur les "Meilleures Pratiques" qui peuvent augmenter la fiabilité et faciliter la maintenance. Consultez la section :doc:`Dépannage préventif <preemptive-troubleshooting>` pour plus de conseils utiles et astuces.
pt: O artigo :ref:`Wiring the FRC Control System <docs/zero-to-robot/step-1/how-to-wire-a-robot:How to Wire an FRC Robot>` descreve os detalhes de o que conecta onde na fiação do Sistema de Controle FRC e este artigo fornece algumas "Boas Práticas" adicionais que podem aumentar a confiabilidade e facilitar a manutenção. Dê uma olhada em :doc:`Preemptive Troubleshooting <preemptive-troubleshooting>` para mais dicas.
tr_tr: Makale :ref:`FRC Control Sistemi Kablolaması <docs/zero-to-robot/step-1/how-to-wire-a-robot:How to Wire an FRC Robot>` FRC Kontrol Sistemi'nde neyin nereye bağlanacağının ayrıntılarını açıklar ve bu makale, güvenilirliği artırabilecek ve bakımı kolaylaştırabilecek bazı ek "En İyi Uygulama" örnekleri sağlar. Yardımcı ipuçları için bir göz atın :doc:`Preemptive Troubleshooting <preemptive-troubleshooting>`.
zh_cn: :ref:`Wiring the FRC Control System <docs/zero-to-robot/step-1/how-to-wire-a-robot:How to Wire an FRC Robot>` 这篇文章遍历了连接FRC控制系统的连线的细节，并且本文提供了一些其他的“最佳实践”，这些最佳实践可能会提高可靠性并简化维护。请参阅:doc:`Preemptive Troubleshooting <preemptive-troubleshooting>`以获取更多提示和技巧。

source: Vibration/Shock
es_mx: Vibración / Choque
fr_ca: Vibration et choc
ja: 振動/衝撃
pt: Vibração/Choque
tr_tr: Titreşim/Şok
zh_cn: 振动/冲击

source: An FRC\ |reg| Robot is an incredibly rough environment when it comes to vibrations and shock loads. While many of the FRC specific electronics are extensively tested for mechanical robustness in these conditions, a few components, such as the radio, are not specifically designed for use on a mobile platform. Taking steps to reduce the shock and vibration these components are exposed to may help reduce failures. Some suggestions that may reduce mechanical failures:
es_mx: Un robot FRC\ |reg| es un entorno increíblemente peligroso cuando se trata de vibraciones y cargas de impacto. Si bien muchos de los componentes electrónicos específicos de FRC se prueban exhaustivamente para determinar la robustez mecánica en estas condiciones, algunos componentes, como la radio, no están diseñados específicamente para su uso en una plataforma móvil. Tomar medidas para reducir los golpes y las vibraciones a los que están expuestos estos componentes puede ayudar a reducir las fallas. Algunas sugerencias que pueden reducir las fallas mecánicas:
fr_ca: Un robot FRC\ |reg| est un environnement incroyablement brutal quand il s’agit de vibrations et de charges de choc. Bien que de nombreux appareils électroniques spécifiques à FRC soient largement testés pour la robustesse mécanique dans ces conditions, quelques composants, comme la radio, ne sont pas spécifiquement conçus pour une utilisation sur une plate-forme mobile. Prendre des mesures pour réduire le choc et les vibrations auxquelles ces composants sont exposés peut aider à réduire les défaillances. Quelques suggestions qui peuvent réduire les défaillances mécaniques
ja: FRC\ |reg| のロボットは、振動や衝撃荷重に関して、非常に過酷な環境です。FRCに特化した電子機器の多くは、このような状況下での機械的堅牢性について広範囲にテストされていますが、ルーターなど一部のコンポーネントは、移動するロボットでの使用に特化して設計されていません。これらのコンポーネントがさらされる衝撃や振動を軽減する手段を講じることは、故障を減らすのに役立つ可能性があります。機械的な故障を減らすためのいくつかの提案：
pt: Um Robô FRC\ |reg| é um ambiente incrivelmente brutal quando se trata de vibrações e impactos. Embora muitos dos componentes eletrônicos específicos da FRC sejam exaustivamente testados quanto à robustez mecânica nessas condições, alguns componentes, como o rádio, não são projetados especificamente para uso em uma plataforma móvel. Tomar medidas para reduzir o impacto e a vibração aos quais esses componentes estão expostos pode ajudar a reduzir as falhas. Algumas sugestões que podem reduzir as falhas mecânicas:
tr_tr: Bir FRC\ |reg| Robotu, titreşim ve şok yükleri söz konusu olduğunda inanılmaz derecede zorlu bir ortamdır. FRC'ye özgü elektroniklerin çoğu, bu koşullarda mekanik sağlamlık açısından kapsamlı bir şekilde test edilirken, radyo gibi birkaç bileşen, bir mobil platformda kullanılmak üzere özel olarak tasarlanmamıştır. Bu bileşenlerin maruz kaldığı şok ve titreşimi azaltmak için adımlar atmak arızaları azaltmaya yardımcı olabilir. Mekanik arızaları azaltabilecek bazı öneriler:
zh_cn: FRC\ |reg| 机器人在振动和冲击负荷方面的环境异常恶劣。尽管许多FRC专用电子设备已在这些条件下进行了机械坚固性的广泛测试，但某些组件如无线电设备，并不是专门为在移动平台上使用而设计的。采取措施减少这些组件受到的冲击和振动，可能有助于减少故障。一些可以减少机械故障的建议：

source: Vibration Isolation - Make sure to isolate any components which create excessive vibration, such as compressors, using "vibration isolators". This will help reduce vibration on the robot which can loosen fasteners and cause premature fatigue failure on some electronic components.
es_mx: Aislamiento de vibraciones - Asegúrese de aislar cualquier componente que genere vibraciones excesivas, como los compresores, utilizando "aisladores de vibración". Esto ayudará a reducir la vibración en el robot, que puede aflojar los sujetadores y causar fallas por fatiga prematura en algunos componentes electrónicos.
fr_ca: Isolation des vibrations - Assurez-vous d’isoler tous les composants qui créent des vibrations excessives, telles que les compresseurs, à l’aide des "isolateurs de vibration". Cela aidera à réduire les vibrations sur le robot qui peuvent desserrer les attaches et causer une défaillance de fatigue prématurée sur certains composants électroniques.
ja: 防振 - コンプレッサーなど過度の振動を発生させる部品は、必ず「防振装置」を使って隔離してください。これにより、ファスナーを緩めたり、電子部品の早期疲労故障の原因となるロボットの振動を低減することができます。
pt: Isolamento de vibração - certifique-se de isolar todos os componentes que criam vibrações excessivas, como compressores, usando "coxins". Isso ajudará a reduzir a vibração no robô, que pode afrouxar os fixadores e causar falha prematura por fadiga em alguns componentes eletrônicos.
tr_tr: Titreşim Yalıtımı - Kompresörler gibi aşırı titreşim yaratan tüm bileşenleri "titreşim yalıtıcıları" kullanarak izole ettiğinizden emin olun. Bu, robot üzerindeki titreşimi azaltmaya yardımcı olur, bu da bağlantı elemanlarını gevşetebilir ve bazı elektronik bileşenlerde erken yorulmaya neden olabilir.
zh_cn: 隔振 - 确保使用隔振器来隔离任何产生过度振动的组件，比如压缩机。这会有助于减少机器整体上的振动，否则，振动会使紧固件松动，并导致某些电子组件过早失效。

source: Bumpers - Use Bumpers to cover as much of the robot as possible for your design. While the rules require specific bumper coverage around the corners of your robot, maximizing the use of bumpers increases the likelihood that all collisions will be damped by your bumpers. Bumpers significantly reduce the g-forces experienced in a collision compared to hitting directly on a hard robot surface, reducing the shock experienced by the electronics and decreasing the chance of a shock related failure.
es_mx: Bumpers - Utilice bumpers para cubrir la mayor parte del robot posible para su diseño. Si bien las reglas requieren una cobertura de bumpers específica alrededor de las esquinas de su robot, maximizar el uso de bumpers aumenta la probabilidad de que sus bumpers amortigüen todas las colisiones. Los bumpers reducen significativamente las fuerzas G experimentadas en una colisión en comparación con golpear directamente sobre la superficie dura de un robot, reduciendo el impacto experimentado por los componentes electrónicos y disminuyendo la posibilidad de una falla relacionada con el impacto.
fr_ca: Pare-chocs - Utilisez des pare-chocs pour couvrir autant que possible votre robot lors votre conception. Bien que les règles exigent une couverture spécifique des pare-chocs autour des coins de votre robot, maximiser l’utilisation de pare-chocs augmente la probabilité que toutes les collisions soient amorties par vos pare-chocs. Les pare-chocs réduisent considérablement les 'forces g' subies lors d’une collision par rapport à une collision directe sur une surface non protégée du robot, réduisant le choc subi par l’électronique et diminuant le risque d’une défaillance liée au choc.
ja: バンパー - バンパーは、あなたのデザインでロボットの可能な限り多くをカバーするために使用してください。ルールでは、ロボットのコーナーに特定のバンパーのカバーが必要ですが、バンパーを最大限に使用することで、すべての衝突がバンパーによって減衰される可能性が高くなります。バンパーは、硬いロボットの表面に直接ぶつかるよりも、衝突時に受けるGフォースを大幅に減少させ、電子機器が受ける衝撃を軽減し、衝撃に関連した故障の可能性を減少させます。
pt: Bumpers - Use Bumpers para cobrir o máximo possível do robô em seu projeto. Embora as regras exijam cobertura de Bumpers específica em torno dos cantos do seu robô, maximizar o uso de Bumpers aumenta a probabilidade de que todas as colisões sejam amortecidas por eles. Os Bumpers reduzem significativamente as acelerações sofridas em uma colisão em comparação com o impacto direto em uma superfície rígida do robô, reduzindo o choque sofrido pela eletrônica e diminuindo a chance de uma falha relacionada ao choque.
tr_tr: Bumpers - Tasarımınız için robotun mümkün olduğunca çoğunu örtmek için bumperları kullanın. Kurallar, robotunuzun köşelerinde özel bumper kapsamı gerektirse de, bumperların kullanımını en üst düzeye çıkarmak, tüm çarpışmaların bumperlarınız tarafından sönümlenme olasılığını artırır. Bumperlar, doğrudan sert bir robot yüzeyine çarpmaya kıyasla çarpışmada yaşanan kuvvetlerini önemli ölçüde azaltır, elektronik aksamın maruz kaldığı şoku azaltır ve şokla ilgili arıza olasılığını azaltır.
zh_cn: 保险杠 - 使用保险杠来尽量多的覆盖您所设计的机器人。虽然规则上要求在机器人的各个边角处覆盖特定的保险杠，但是最大程度的使用保险杠会大大提高所有碰撞被保险杠缓冲的概率。与直接撞击机器人坚硬的表面相比，保险杠大大的降低了在冲撞时所承受的力量，进而减少了电子设备所受到的冲击，进而降低了相关故障发生的可能性。

source: Shock Mounting - You may choose to shock mount some or all of your electronic components to further reduce the forces they see in robot collisions. This is especially helpful for the robot radio and other electronics such as co-processors, which may not be designed for use on mobile platforms. Vibration isolators, springs, foams, or mounting to flexible materials all may reduce the shock forces seen by these components.
es_mx: Montaje con amortiguación - puede optar por montar con amortiguación algunos o todos sus componentes electrónicos para reducir aún más las fuerzas que ven en las colisiones de robots. Esto es especialmente útil para la radio del robot y otros componentes electrónicos, como los coprocesadores, que pueden no estar diseñados para su uso en plataformas móviles. Los aisladores de vibración, resortes, espumas o el montaje en materiales flexibles pueden reducir las fuerzas de impacto que perciben estos componentes.
fr_ca: Montage d'amortisseur de choc - Vous pouvez choisir d'installer des amortisseurs de choc sur une partie ou la totalité de vos composants électroniques pour réduire davantage les forces qu’ils subissent dans les collisions de robots. Ceci est particulièrement utile pour la radio du robot et d’autres appareils électroniques tels que les co-processeurs, qui peuvent ne pas être conçus pour une utilisation sur les plates-formes mobiles. Isolateurs de vibrations, ressorts, mousses ou montage à matériaux flexibles tous peuvent réduire les forces de choc observées par ces composants
ja: ショックマウント - 電子部品の一部または全部をショックマウントして、ロボットの衝突で受ける力をさらに軽減することができます。特に、ロボット無線やコプロセッサなど、移動するプラットフォームでの使用を想定していない電子部品には有効です。防振材、バネ、発泡材、柔軟な素材への取り付けなどは、これらの部品が受ける衝撃を軽減することができます。
pt: Montagem contra choque - você pode escolher montar para reduzir choque alguns ou todos os seus componentes eletrônicos para reduzir ainda mais as forças que eles sofrem em colisões de robôs. Isso é especialmente útil para o rádio do robô e outros componentes eletrônicos, como coprocessadores, que podem não ser projetados para uso em plataformas móveis. Isoladores de vibração, molas, espumas ou montagem em materiais flexíveis podem reduzir as forças de choque sofridas por esses componentes.
tr_tr: Şok Montajı - Robot çarpışmalarında gördükleri kuvvetleri daha da azaltmak için elektronik bileşenlerinizin bir kısmını veya tamamını şokla monte etmeyi seçebilirsiniz. Bu, özellikle robot telsizi ve yardımcı işlemciler gibi, mobil platformlarda kullanılmak üzere tasarlanmamış olabilecek diğer elektronik cihazlar için yararlıdır. Titreşim izolatörleri, yaylar, köpükler veya esnek malzemelere montajın tümü, bu bileşenlerin gördüğü şok kuvvetlerini azaltabilir.
zh_cn: 避震安装 - 您可以选择对某些或全部电子组件进行避震安装，以进一步减小他们在机器人冲撞过程中受到的力量。这对于机器人的无线电以及其他电子组件，例如协处理器尤其有用，因为它们也许并不是专门为了适用于移动的平台而设计的，将这些组件安装到隔振器，弹簧，泡沫或其他柔性材料上都可以减少这些组件所受到的冲击力。

source: Redundancy
es_mx: Redundacía
fr_ca: Redondance
ja: 冗長性
pt: Redundância
tr_tr: Yedeklilik
zh_cn: 冗余

source: Unfortunately there are few places in the FRC Control System where redundancy is feasible. Taking advantage of opportunities for redundancy can increase reliability. The primary example of this is wiring the barrel connector to the radio in addition to the provided PoE connection. This ensures that if one of the cables becomes damaged or dislodged, the other will maintain power to the radio. Keep an eye out for other potential areas to provide redundancy when wiring and programming your robot.
es_mx: Desafortunadamente, hay pocos lugares en el sistema de control FRC donde la redundancia es factible. Aprovechar las oportunidades de redundancia puede aumentar la confiabilidad. El ejemplo principal de esto es el cableado del conector cilíndrico a la radio además de la conexión PoE provista. Esto asegura que si uno de los cables se daña o se desprende, el otro mantendrá la alimentación de la radio. Esté atento a otras áreas potenciales para proporcionar redundancia al cablear y programar su robot.
fr_ca: Malheureusement, il y a peu d’endroits dans le système de contrôle FRC où la redondance est possible. Tirer parti des possibilités de redondance peut accroître la fiabilité. Un exemple est le raccordement de la prise a barillet d'alimentation de la radio en plus de la connexion de PoE fournie. Cela garantit que si l’un des câbles est endommagé ou délogé, l’autre maintiendra l’alimentation de la radio. Gardez un œil sur d’autres zones potentielles pour fournir la redondance lors du câblage et la programmation de votre robot.
pt: Infelizmente, existem poucos lugares no Sistema de Controle FRC onde redundância é viável. Aproveitar as oportunidades para redundância pode aumentar a confiabilidade. O principal exemplo disso é a fiação do conector cilíndrico ao rádio, além da conexão PoE fornecida. Isso garante que, se um dos cabos for danificado ou deslocado, o outro manterá a alimentação do rádio. Fique de olho em outras áreas potenciais para fornecer redundância ao conectar e programar seu robô.
tr_tr: Ne yazık ki, FRC Kontrol Sisteminde yedeklilik için mümkün olduğu çok az yer vardır. Yedeklilik fırsatlarından yararlanmak, güvenilirliği artırabilir. Bunun birincil örneği, sağlanan PoE bağlantısına ek olarak güç adaptör konektörünün robot radiosuna bağlanmasıdır. Bu, kablolardan birinin hasar görmesi veya yerinden çıkması durumunda diğerinin radyoya giden gücü sürdürmesini sağlar. Robotunuzun kablolamasını yaparken ve programlarken yedeklilik sağlamak için diğer potansiyel alanlara dikkat edin.
zh_cn: 不幸的是，在FRC控制系统中，很少有冗余是有用的。有时候，利用冗余可能提高可靠性。一个主要示例是将桶型连接器连接到无线电，还有提供PoE连接。这样就可以确保如果其中有一根电缆损坏或者脱落，另一根电缆将保持无线电的供电。留意其他有机会使用冗余的区域，以确保在您连接和编写机器人代码的时候使用它。

source: Port Savers
es_mx: Ahorradores de puertos
fr_ca: Économiseur de ports
ja: ポートセーバー
tr_tr: Port Koruyucular
zh_cn: 端口保护

source: For any connections on the Robot or Driver station that may be frequently plugged and unplugged (such as DS joysticks, DS Ethernet, roboRIO USB tether, and Ethernet tether) using a "Port Saver" or "pigtail" can substantially reduce the potential for damaging the port. This type of device can serve double duty, both reducing the number of cycles that the port on the electronic device sees, as well as relocating the connection to a more convenient location. Make sure to secure the port saver (see the next item) to avoid port damage.
es_mx: Para cualquier conexión en el robot o la driver station que se puedan enchufar y desenchufar con frecuencia (como joysticks DS, DS Ethernet, anclaje USB roboRIO y anclaje Ethernet), el uso de un "Port Saver" o "pigtail" puede reducir sustancialmente el potencial de daños el puerto. Este tipo de dispositivo puede cumplir una doble función, tanto para reducir el número de ciclos que ve el puerto del dispositivo electrónico como para reubicar la conexión a una ubicación más conveniente. Asegúrese de asegurar el protector de puertos (consulte el siguiente elemento) para evitar daños en el puerto.
fr_ca: Pour toutes les connexions sur le Robot ou sur la station de pilotage qui peuvent être fréquemment branchées et débranchées (telles que les joysticks DS, DS Ethernet, attache USB au roboRIO et attache Ethernet) il est possible d'utiliser un "Économiseur de ports'' ce qui peut réduire considérablement le risque d’endommager le port des appareils. Ce type de dispositif peut servir à une double fonction, à la fois en réduisant le nombre de cycles que le port sur l’appareil électronique subit ainsi qu'en relocalisant la connexion à un endroit plus pratique. Assurez-vous de sécuriser l’Économiseur de port (voir l’élément suivant) pour éviter les dommages au port.
ja: ロボットや Driver stationの接続で、頻繁に抜き差しされる可能性のあるもの（ DS joysticks, DS Ethernet, roboRIO USB tetherなど）には、「ポートセーバー」や「ピッグテール」を使用すると、ポートにダメージを与える可能性を大幅に低減できます。このタイプのデバイスは、電子デバイスのポートが見るサイクルの数を減らすだけでなく、接続をより便利な場所に移動させるという2つの役割を果たします。ポートの破損を防ぐため、ポートセーバーを必ず固定してください。（次の項目を参照）
pt: Para quaisquer conexões na estação do piloto ou robô que possam ser frequentemente conectadas e desconectadas (como joysticks DS, DS Ethernet, roboRIO USB tether e Ethernet tether), o uso de "Port Saver" ou "pigtail" pode reduzir substancialmente o potencial de danos a porta. Esse tipo de dispositivo pode ter uma função dupla, tanto reduzindo o número de ciclos que a porta no dispositivo eletrônico vê, como realocando a conexão para um local mais conveniente. Certifique-se de fixar bem o Port Saver (consulte o próximo item) para evitar danos à porta.
tr_tr: Robot veya Sürücü istasyonunda sıkça takılıp çıkarılabilen herhangi bir bağlantı için (DS oyun çubukları, DS Ethernet, roboRIO USB ve Ethernet bağlantısı gibi) bir "Port Koruyucu" veya "pigtail" kullanarak hasar verme potansiyelini önemli ölçüde azaltabilirsiniz. Bu tür bir cihaz, hem elektronik cihaz üzerindeki bağlantı noktasının gördüğü döngü sayısını azaltarak hem de bağlantıyı daha uygun bir konuma yeniden konumlandırarak çifte göreve hizmet edebilir. Bağlantı noktasının hasar görmesini önlemek için bağlantı noktası koruyucusunu sabitlediğinizden emin olun (sonraki maddeye bakın).
zh_cn: 使用“端口保护程序”或“尾纤”可以大大减少机器人或 Driver station上经常插拔的任何连接（例如DS操作杆，DS以太网，roboRIO USB线和以太网线）端口损坏的可能性。这种类型的设备可以起到双重作用，既可以减少电子设备上看到的端口周期数，又可以将连接重新定位到更方便的位置。确保安装好端口保护程序（请参阅下一项）以避免端口损坏。

source: Wire Management and Strain Relief
es_mx: Gestión de cables y alivio de tensión
fr_ca: Gestion des câbles et attaches mécaniques
ja: ワイヤーマネージメントとストレインリリーフ
pt: Gerenciamento de Fiação e Alívio de Tensão
tr_tr: Kablo Yönetimi ve Gerilim Giderme
zh_cn: 电线管理和应力消除

source: One of the most critical components to robot reliability and maintenance is good wire management and strain relief. Good wire management is comprised of a few components:
es_mx: Uno de los componentes más críticos para la confiabilidad y el mantenimiento del robot es una buena administración de cables y alivio de tensión. Una buena gestión de cables consta de algunos componentes:
fr_ca: L’un des composants les plus essentiels à la fiabilité et à l’entretien des robots est une bonne gestion du câblage ainsi que des attaches mécaniques de ceux-ci . Une bonne gestion des fils est composée de quelques composants :
ja: ロボットの信頼性とメンテナンスに最も重要な要素の1つは、優れたワイヤーマネジメントとストレインリリーフです。優れたワイヤーマネジメントは、いくつかの要素で構成されています：
pt: Um dos componentes mais críticos para a confiabilidade e manutenção do robô é um bom gerenciamento da fiação e alívio de tensão. Um bom gerenciamento de fiação é composta por alguns componentes:
tr_tr: Robot güvenilirliği ve bakımı için en kritik bileşenlerden biri, iyi kablo yönetimi ve gerilim azaltmadır. İyi kablo yönetimi birkaç bileşenden oluşur:
zh_cn: 机器人的可靠性和维护性最关键的要素之一是良好的导线管理和应力消除。好的电线管理包括以下几个部分：

source: Make sure cables are the correct length. Any excess wire length is just more to manage. If you must have extra wire due to additional length on COTS cabling, secure the extra into a small bundle using separate cable ties before securing the rest of the wire.
es_mx: Asegúrese de que los cables tengan la longitud correcta. Cualquier exceso de longitud de cable es más fácil de manejar. Si debe tener un cable adicional debido a la longitud adicional del cableado COTS, asegure el cable adicional en un paquete pequeño con bridas para cables separados antes de asegurar el resto del cable.
fr_ca: Assurez-vous que les câbles sont de la bonne longueur. Toute longueur de câble excédentaire est plus difficile à gérer. Si vous utilisez un câble très long provenant d'un câblage prémonté d'un manufacturier, fixer le supplément dans un petit paquet à l’aide d'attaches de câble séparées avant de fixer le reste du câble.
ja: ケーブルの長さが合っているか確認してください。余分なワイヤーは、管理の手間が増えるだけです。COTSケーブルの長さが足りないため、どうしても余分なワイヤーを用意しなければならない場合は、残りのワイヤーを固定する前に、別の結束バンドを使って余分なワイヤーを小さな束に固定してください。
pt: Certifique-se de que os cabos tenham o comprimento correto. Qualquer comprimento de fio em excesso é apenas mais para gerenciar. Se você precisar de fio extra devido ao comprimento adicional do cabeamento de COTS, prenda o excesso em um pequeno pacote usando abraçadeiras separadas antes de prender o resto do fio.
tr_tr: Kabloların doğru uzunlukta olduğundan emin olun. Herhangi bir fazla kablo uzunluğu sadece yönetilmesi gereken daha fazladır. COTS kablolamasında ek uzunluk nedeniyle fazladan kablonuz olması gerekiyorsa, telin geri kalanını sabitlemeden önce fazladan olanı ayrı kablo bağları kullanarak küçük bir demet halinde sabitleyin.
zh_cn: 确保电缆长度正确。任何多余的导线长度都需要多加思考。如果由于COTS电缆上的额外长度而必须有多余的电线，请在固定其余电线之前，使用单独的电缆扎带将多余的电线固定在小捆中。
