Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/wiring-best-practices.po
Languages: es_mx, fr_ca, ja, pt, tr_tr, zh_cn

source: Ensure that cables are secured close to connection points, with enough slack to avoid putting strain on connectors. This is called strain relief, and is critical to minimizing the likelihood that a cable comes unplugged or a wire breaks off at a connection point (these are generally stress concentrators).
es_mx: Asegúrese de que los cables estén asegurados cerca de los puntos de conexión, con suficiente holgura para evitar tensar los conectores. Esto se llama alivio de tensión y es fundamental para minimizar la probabilidad de que un cable se desconecte o se rompa en un punto de conexión (generalmente son concentradores de tensión).
fr_ca: Assurez-vous que les câbles sont fixés à proximité des points de connexion, avec suffisamment de mou pour éviter de mettre la pression sur les connecteurs. C’est ce qu’on appelle le soulagement des forces de traction de câble et il est essentiel de minimiser la probabilité qu’un câble soit débranché ou qu’un fil se détache à un point de connexion (il s’agit généralement de concentrateurs de contrainte mécanique).
ja: ケーブルは、コネクタに負担がかからないよう、十分な余裕をもって接続部の近くで固定する。これはストレインリリーフと呼ばれ、ケーブルが抜けたり、接続部（一般的にこれらはストレスの集中源となります）でワイヤーが切れたりする可能性を最小限に抑えるために重要です。
pt: Certifique-se de que os cabos estejam presos perto dos pontos de conexão, com folga suficiente para evitar colocar tensão nos conectores. Isso é chamado de alívio de tensão e é fundamental para minimizar a probabilidade de um cabo se desconectar ou de um fio se romper em um ponto de conexão (geralmente são concentradores de tensão).
tr_tr: Kabloların bağlantı noktalarına yakın bir yere sabitlendiğinden ve konektörleri zorlamamak için yeterince gevşek olduğundan emin olun. Buna gerilim azaltma denir ve bir kablonun fişten çekilmesi veya bir bağlantı noktasında bir telin kopması olasılığını en aza indirmek için kritiktir (bunlar genellikle gerilim yoğunlaştırıcılardır).
zh_cn: 确保将电缆固定在连接点附近，并留有足够的松弛空间，以免对连接器造成压力。这称为应力消除，可以最大程度地减小电缆在连接点（这是常见的应力集中地）拔出或导线断开的可能性。

source: Secure cables near any moving components. Make sure that all wire runs are secure and protected from moving components, even if the moving components were to bend or over-travel.
es_mx: Asegure los cables cerca de cualquier componente móvil. Asegúrese de que todos los tendidos de cables sean seguros y estén protegidos de los componentes móviles, incluso si los componentes móviles se doblaran o se desplazaran demasiado.
fr_ca: Sécurisez les câbles à proximité de tous les composants en mouvement. Assurez-vous que tous les fils sont sécurisés et protégés contre les composants en mouvement, même si les composants en mouvement devaient se plier ou se déplacer sur une grande distance.
ja: 可動部品の近くでケーブルを固定する。万が一、可動部品が曲がったり、飛び出した場合でも、すべての配線が確実に固定され、可動部品から保護されていることを確認する。
pt: Prenda os cabos perto de quaisquer componentes móveis. Certifique-se de que todos os fios estão seguros e protegidos de componentes móveis, mesmo se os componentes móveis fossem se deformar ou extrapolar seu curso.
tr_tr: Kabloları hareketli bileşenlerin yakınında sabitleyin. Hareketli bileşenler bükülecek veya aşırı hareket edecek olsa bile tüm kabloların güvenli ve hareketli bileşenlerden korunduğundan emin olun.
zh_cn: 在任何可动部件附近固定电缆。确保所有的电线可以稳妥运作且不受移动组件的影响，即使移动组件弯曲或出轨。

source: Secure cables at additional points as necessary to keep wiring neat and clean. Take care to not over secure wires; if wires are secured in too many locations, it may actually make troubleshooting and maintenance more difficult.
es_mx: Asegure los cables en puntos adicionales según sea necesario para mantener el cableado ordenado y limpio. Tenga cuidado de no asegurar demasiado los cables; si los cables están asegurados en demasiados lugares, puede dificultar la resolución de problemas y el mantenimiento.
fr_ca: Sécurisez les câbles à des points supplémentaires au besoin pour garder le câblage propre et en ordre. Prenez soin de ne pas trop attacher les fils; si les fils sont fixés dans trop d’endroits, ceci peut rendre le dépannage et la maintenance plus difficile.
ja: 配線をすっきりさせるために、必要に応じてケーブルを追加で固定します。配線を固定しすぎると、トラブルシューティングやメンテナンスがしにくくなることがあります。
pt: Prenda os cabos em pontos adicionais conforme necessário para manter a fiação organizada e limpa. Tome cuidado para não prender demais os cabos; se estiverem presos em muitos locais, isso pode realmente dificultar a solução de problemas e a manutenção.
tr_tr: Kabloları düzgün ve temiz tutmak için kabloları ek noktalarda gerektiği gibi sabitleyin. Kabloları çok fazla yerde sabitlememeye dikkat edin; kablolar çok fazla yerde sabitlenirse, aslında sorun giderme ve bakımı daha zor hale getirebilir.
zh_cn: 如有必要，可以额外找几个点固定电缆以保持布线整洁。注意不要固定点太多；如果电线固定的位置太多，可能会使故障排除和维护更加困难。

source: Documentation
es_mx: Documentación
ja: ドキュメント作成
pt: Documentação
tr_tr: Belgeleme
zh_cn: 文档

source: A great way to make maintenance easier is to create documentation describing what is connected where on the robot. There are a number of ways of creating this type of documentation which range from complete wiring diagrams to excel charts to a quick list of what functions are attached to which channels. Many teams also integrate these lists with labeling (see the next bullet).
es_mx: Una excelente manera de facilitar el mantenimiento es crear documentación que describa qué está conectado en qué parte del robot. Hay varias formas de crear este tipo de documentación que van desde diagramas de cableado completos hasta gráficos de Excel y una lista rápida de las funciones que se adjuntan a qué canales. Muchos equipos también integran estas listas con etiquetado (consulte la siguiente viñeta).
fr_ca: Une excellente façon de faciliter l'entretien et le dépannage est de rédiger la documentation décrivant ce qui est connecté au robot et la localisation de chaque connexion. Il existe un certain nombre de façons de créer ce type de documentation pouvant consister en des diagrammes de câblage complets, à des tableaux excel ou une liste rapide des fonctions qui sont attachées à quels canaux. De nombreuses équipes intègrent également ces listes à l’étiquetage (voir la prochaine section).
ja: ロボットのどこに何が接続されているかを説明するドキュメントを作成することは、メンテナンスを容易にするための大きな方法です。この種のドキュメントの作成方法は、完全な配線図からエクセルチャート、どのチャンネルにどのような機能が接続されているかの簡単なリストまで、さまざまなものがあります。また、多くのチームは、これらのリストをラベリングと統合しています。（次の箇所を参照）
pt: Uma boa maneira de tornar a manutenção mais fácil é criar uma documentação que descreva o que está conectado e onde no robô. Existem várias maneiras de criar esse tipo de documentação, que vão desde diagramas de fiação completos até gráficos do Excel e uma lista rápida de quais funções estão associadas a quais canais. Muitas equipes também integram essas listas com etiquetas (consulte o próximo item).
tr_tr: Bakımı kolaylaştırmanın harika bir yolu, robotun neresine bağlı olduğunu açıklayan belgeler oluşturmaktır. Bu tür bir dokümantasyon oluşturmanın, eksiksiz bağlantı şemalarından excel tablolarına, hangi kanallara hangi fonksiyonların eklendiğini gösteren hızlı bir listeye kadar çeşitli yolları vardır. Birçok ekip de bu listeleri etiketlemeyle bütünleştirir (bir sonraki maddeye bakın).
zh_cn: 创建描述机器人连接处的文档是简化维护的一种好方法。创建此类文档的方法有很多种，从完整的接线图到excel图表，再到将哪些功能附加到哪些通道的快捷清单，不一而足。许多团队还将这些列表与标签集成在一起（请参阅下一项）。

source: When a wire is accidentally cut, or a mechanism is malfunctioning, or a component burns out, it will be much easier to repair if you have some documentation to tell you what is connected where without having to trace the wiring all the way through (even if your wiring is neat!)
es_mx: Cuando un cable se corta accidentalmente, o un mecanismo no funciona correctamente o un componente se quema, será mucho más fácil de reparar si tiene alguna documentación que le indique qué está conectado y dónde sin tener que rastrear el cableado hasta el final (incluso si su cableado está ordenado)
fr_ca: Quand un fil est accidentellement coupé, qu'un mécanisme devient défectueux ou qu'un composant brûle, il sera beaucoup plus facile à effectuer la réparation si vous avez une certaine documentation pour vous indiquer ce qui est connecté où sans avoir à tracer le câblage tout au long (même si votre câblage est propre!)
ja: 配線が誤って切れたり、機構が誤作動したり、部品が焼けたりしたとき、わざわざ配線を辿らなくても、何がどこにつながっているかがわかる資料があれば、修理はずっと楽になります。（たとえ配線がきれいでも！）
pt: Quando um fio é cortado acidentalmente, ou um mecanismo está com defeito, ou um componente queima, será muito mais fácil de consertar se você tiver alguma documentação que diga o que está conectado e onde sem ter que seguir a fiação até o fim (mesmo se sua fiação estiver organizada!)
tr_tr: Bir tel yanlışlıkla kesildiğinde veya bir mekanizma arızalandığında veya bir bileşen yandığında, kabloları baştan sona takip etmek zorunda kalmadan neyin nereye bağlı olduğunu size söyleyecek bazı belgeleriniz varsa onarmak çok daha kolay olacaktır (kablo tesisatınız düzgün olsa bile!)
zh_cn: 如果不小心电线意外切断了，或者机械出现了故障，或者组件烧坏了，如果您有一些文档告诉您所连接的地方，维修起来会容易得多，而不必从头梳理电线（即使您的接线整齐！）。

source: Labeling
es_mx: Etiquetado
fr_ca: Étiquetage
ja: ラベリング
pt: Identificação
tr_tr: Etiketleme
zh_cn: 标签

source: Labeling is a great way to supplement the wiring documentation described above. There are many different strategies to labeling wiring and electronics, all with their own pros and cons. Labels for electronics and flags for wires can be made by hand, or using a label maker (some can also do heat-shrink labels), or you can use different colors of electrical tape or labeling flags to indicate different things. Whatever system you choose, make sure you understand how it complements your documentation and make sure everyone on your team is familiar with it.
es_mx: El etiquetado es una excelente manera de complementar la documentación de cableado descrita anteriormente. Existen muchas estrategias diferentes para etiquetar el cableado y la electrónica, todas con sus pros y sus contras. Las etiquetas para dispositivos electrónicos y las banderas para los cables se pueden hacer a mano o con una rotuladora (algunas también pueden hacer etiquetas termocontraíbles), o puede usar diferentes colores de cinta aislante o banderas de etiquetado para indicar diferentes cosas. Sea cual sea el sistema que elija, asegúrese de comprender cómo complementa su documentación y de que todos los miembros de su equipo estén familiarizados con él.
fr_ca: L’étiquetage est un excellent moyen de compléter la documentation de câblage décrite ci-dessus. Il existe de nombreuses stratégies différentes pour étiqueter le câblage et l’électronique, le tout avec leurs propres avantages et inconvénients. Les étiquettes pour l’électronique et les drapeaux pour les fils peuvent être faits à la main, ou en utilisant un appareil qui imprime les étiquettes (certains peuvent également utiliser des étiquettes thermo rétractable sur les câbles). Vous pouvez aussi utiliser différentes couleurs de ruban électrique ou des drapeaux d’étiquetage pour indiquer différentes choses. Quel que soit le système que vous choisissez, assurez-vous de comprendre comment il complète votre documentation et assurez-vous que tous les membres de votre équipe le connaisse.
ja: ラベリングは、上記の配線ドキュメントを補完する素晴らしい方法です。配線や電子機器にラベルを貼るには、さまざまな戦略があり、それぞれに長所と短所があります。電子機器用のラベルや配線用の旗は、手作業やラベルメーカー（熱収縮ラベルも可能なものもある）を使って作ることもできますし、電気テープやラベル用旗の色を変えて、異なるものを示すことも可能です。どのようなシステムを選択するにしても、それがどのようにドキュメントを補完するのかを理解し、チームの全員がそのシステムに精通していることを確認する必要があります。
pt: A Identificação é uma ótima maneira de complementar a documentação de fiação descrita acima. Existem muitas estratégias diferentes para rotular cabos e eletrônicos, todas com seus prós e contras. Os rótulos para eletrônicos e etiquetas para fios podem ser feitos à mão ou usando um etiquetador (alguns também podem fazer etiquetas termo retráteis), ou você pode usar cores diferentes de fita isolante ou sinalizadores de etiquetagem para indicar coisas diferentes. Seja qual for o sistema que você escolher, certifique-se de entender como ele complementa sua documentação e certifique-se de que todos em sua equipe estejam familiarizados com ele.
tr_tr: Etiketleme, yukarıda açıklanan kablolama belgelerini tamamlamanın harika bir yoludur. Kablolama ve elektroniği etiketlemek için hepsi kendi artıları ve eksileri olan birçok farklı strateji vardır. Elektronikler için etiketler ve kablolar için bayraklar elle veya bir etiketleme makinesi kullanılarak yapılabilir (bazıları ısıyla daralan etiketlerle de yapabilir) veya farklı şeyleri belirtmek için farklı renklerde elektrik bandı veya etiketleme bayrakları kullanabilirsiniz. Hangi sistemi seçerseniz seçin, dokümantasyonunuzu nasıl tamamladığını anladığınızdan ve ekibinizdeki herkesin buna aşina olduğundan emin olun.
zh_cn: 标签是补充上述接线文档的好方法。标记电线和电子产品有许多不同的策略，各有其优缺点。电子产品的标签和电线的标志可以手工制作，也可以使用标签制造商（有些也可以制作热缩标签）制成，或者可以使用不同颜色的电工胶带或标记来表示不同的东西。无论选择哪种方法，请确保您了解如何使用它帮助完善您的文档，并确保团队中的每个人都熟悉它。

source: Check all wiring and connections
es_mx: Verifique todo el cableado y las conexiones
fr_ca: Vérification des câbles et des branchements
ja: 全ての配線と接続を確認する
pt: Verifique toda a fiação e conexões
tr_tr: Tüm kabloları ve bağlantıları kontrol edin
zh_cn: 检查所有接线和连接

source: After all wiring on the robot is complete, make sure to check each connection, pulling on each, to ensure that everything is secure. Additionally, ensure that no stray wire "whiskers" are sticking out of any connection point and that no uninsulated connections are exposed. If any connections come loose while testing, or any "whiskers" are discovered, re-make the connection and make sure to have a second person check it when complete.
es_mx: Una vez que se haya completado todo el cableado del robot, asegúrese de verificar cada conexión, tirando de cada una, para asegurarse de que todo esté seguro. Además, asegúrese de que ningún "bigote" de cables sueltos sobresalga de ningún punto de conexión y de que no queden al descubierto conexiones sin aislamiento. Si alguna conexión se afloja durante la prueba, o se descubre algún "bigote", vuelva a hacer la conexión y asegúrese de que una segunda persona la revise cuando termine.
fr_ca: Une fois que tout le câblage sur le robot est complet, assurez-vous de vérifier chaque connexion, en tirant sur chacune, pour s’assurer que tout est sécurisé. En outre, assurez-vous qu’aucun brin de fil errant "en cuivre nu" ne sorte d’un point de connexion et qu’aucune connexion non isolée soit exposée. Si des connexions se détachent lors des tests, ou tout brin de fil en cuivre nu soient découverts, refaites la connexion à nouveau et assurez-vous qu’une deuxième personne la vérifie une fois terminée.
ja: ロボットへの配線が完了したら、各接続部を引っ張りながら確認し、すべてが確実に接続されていることを確認します。さらに、どの接続点からも「ヒゲ」が出ていないか、絶縁されていない接続部が露出していないかを確認します。テスト中に接続が緩んだり、「ヒゲ 」が発見された場合は、接続をやり直し、完了したら必ず2人目の人にチェックしてもらいましょう。
pt: Depois que toda a fiação do robô estiver concluída, certifique-se de verificar cada conexão, puxando uma por uma, para garantir que tudo está bem preso. Além disso, certifique-se de que nenhum filamento do fio esteja saindo de qualquer ponto de conexão e que nenhuma conexão não isolada seja exposta. Se alguma conexão se soltar durante o teste ou se algum filamento solto for descoberto, refaça a conexão e peça a outra pessoa para verificar quando terminar.
tr_tr: Robot üzerindeki tüm kablolama tamamlandıktan sonra, her şeyin sağlam olduğundan emin olmak için her bir bağlantıyı çekerek kontrol ettiğinizden emin olun. Ek olarak, herhangi bir bağlantı noktasından dışarıya kaçan tel "bıyıkları" çıkmadığından ve açıkta yalıtılmamış bağlantı olmadığından emin olun. Test sırasında herhangi bir bağlantı gevşerse veya herhangi bir "bıyık" fark edilirse, bağlantıyı yeniden yapın ve tamamlandığında ikinci bir kişinin kontrol etmesini sağlayın.
zh_cn: 机器人上的所有接线完成后，请仔细检查每个连接并拉动以确保一切牢固。此外，请确保没有散线“须”从任何连接点伸出或未绝缘的连接裸露在外。如果在测试过程中任何连接松动，或发现任何“须”，请重新接线并确保完成后请第二个人检查。

source: A common source of poor connections is screw-type or nut-and-bolt fasteners. For any connections of this type on the robot (e.g. battery connections, main breaker, PDP, roboRIO), make sure the fasteners are tight. For nut-and-bolt style connections, ensure that the wire/terminal cannot be rotate by hand; if you can rotate your battery wire or main breaker connection by grasping the terminal and twisting, the connection is not tight enough.
es_mx: Una fuente común de malas conexiones son los sujetadores de tornillo o de tuerca y perno. Para cualquier conexión de este tipo en el robot (por ejemplo, conexiones de batería, interruptor principal, PDP, roboRIO), asegúrese de que los sujetadores estén apretados. Para conexiones tipo tuerca y perno, asegúrese de que el cable / terminal no se pueda girar con la mano; Si puede girar el cable de la batería o la conexión del disyuntor principal agarrando el terminal y girando, la conexión no está lo suficientemente apretada.
fr_ca: Une cause commune qui crée de mauvaises connexions est le mauvais raccordement aux connecteurs à vis ou aux attaches à écrous et boulons. Pour tous ces types de connexion sur le robot (par exemple, les connexions de batterie, le disjoncteur principal, PDP, roboRIO), assurez-vous que les attaches soient bien serrées. Pour les connexions de style écrou et boulon, assurez-vous que le fil/terminal ne bouge pas lorsqu'on le tire; si vous pouvez faire pivoter votre câble de batterie ou votre connexion de disjoncteur principal en saisissant le terminal et en le tirant, la connexion n’est pas assez serrée.
ja: 接続不良の原因として、ネジ式やナット・ボルト式の固定がよく挙げられます。ロボット上のこのタイプの接続（バッテリー接続、メインブレーカー、PDP、roboRIOなど）については、ネジがしっかり締まっていることを確認してください。ナット・アンド・ボルト式の接続の場合、ワイヤーや端子が手で回せないことを確認してください。バッテリーワイヤーやメインブレーカーの接続を、端子をつかんでひねることで回せる場合は、ネジが十分に締まっていないことを示します。
pt: Uma fonte comum de conexões ruins são os fixadores do tipo parafuso ou porca e parafuso. Para quaisquer conexões deste tipo no robô (por exemplo, conexões de bateria, disjuntor principal, PDP, roboRIO), certifique-se de que os fixadores estejam apertados. Para conexões do tipo porca e parafuso, certifique-se de que o fio / terminal não possa ser girado manualmente; se você puder girar o fio da bateria ou a conexão do disjuntor principal segurando o terminal e torcendo, a conexão não está firme o suficiente.
tr_tr: Kötü bağlantıların yaygın bir kaynağı vidalı veya somun ve cıvata bağlantı elemanlarıdır. Robot üzerinde bu türden herhangi bir bağlantı için (örneğin, pil bağlantıları, ana kesici, PDP, roboRIO), bağlantı elemanlarının sıkı olduğundan emin olun. Somun ve cıvata tarzı bağlantılar için, telin/terminalin elle döndürülemeyeceğinden emin olun; Akü telinizi veya ana kesici bağlantınızı terminali kavrayarak ve bükerek döndürebiliyorsanız, bağlantı yeterince sıkı değildir.
zh_cn: 不良连接多数来自螺钉或螺母螺栓一类。对于机器人上的任何此类连接（例如电池连接，主断路器，PDP，roboRIO），请确保紧固件已拧紧。对于螺母型连接，请确保电线/端子用手转不动；如果您可以通过抓住端子并扭绞来旋转电池导线或主断路器连接，则连接不够牢固。

source: Another common source of failures is the fuses at the end of the PDP. Ensure these fuses are completely seated; you may need to apply more force than you expect to seat them completely. If the fuses are seated properly they will likely be difficult or impossible to remove by hand.
es_mx: Otra fuente común de fallas son los fusibles al final del PDP. Asegúrese de que estos fusibles estén completamente asentados; es posible que deba aplicar más fuerza de la que espera para asentarlos por completo. Si los fusibles están colocados correctamente, probablemente será difícil o imposible quitarlos a mano.
fr_ca: Une autre source commune de défaillances sont les fusibles sur le côté du PDP. Assurez-vous que ces fusibles sont complètement insérés; vous devrez peut-être appliquer plus de force que vous le pensez pour les insérer complètement. Si les fusibles sont bien insérés, ils seront probablement difficiles ou impossibles à enlever à la main.
ja: また、PDPの末端にあるヒューズも故障の原因としてよく知られています。このヒューズが完全に装着されていることを確認してください。完全に装着するためには、予想以上の力が必要な場合があります。ヒューズが正しく装着されていれば、手で取り外しづらくなります。
pt: Outra fonte comum de falhas são os fusíveis no final da PDP. Certifique-se de que esses fusíveis estejam completamente encaixados; você pode precisar aplicar mais força do que o esperado para prendê-los completamente. Se os fusíveis estiverem colocados corretamente, provavelmente será difícil ou impossível removê-los manualmente.
tr_tr: Diğer bir yaygın arıza kaynağı, PDP'nin sonundaki sigortalardır. Bu sigortaların tam olarak oturduğundan emin olun; onları tamamen oturtmak için beklediğinizden daha fazla kuvvet uygulamanız gerekebilir. Sigortalar düzgün bir şekilde yerleştirilirse, elle çıkarılması muhtemelen zor veya imkansız olacaktır.
zh_cn: 另一个常见的故障源是PDP末端的保险丝。确保这些保险丝完全固定好；您需要施加的力量比您认为足够完全入座要更多。如果保险丝正确安装，则可能很难或无法用手将其卸下。

source: Snap-in connections such as the SB-50 connector should be secured using clips or cable ties to ensure they do not pop loose during impacts.
es_mx: Las conexiones a presión, como el conector SB-50, deben asegurarse con clips o bridas para asegurar que no se suelten durante los impactos.
fr_ca: Les connexions enfichable Snap-in telles que le connecteur SB-50 doivent être sécurisées à l’aide de clips ou de attaches de câble pour s’assurer qu’elles ne se détachent pas pendant les impacts.
ja: SB-50コネクタのようなスナップイン接続は、衝撃で飛び出さないように、クリップや結束バンドで固定する必要があります。
pt: As conexões de encaixe, como o conector SB-50, devem ser presas com clipes ou abraçadeiras para garantir que não se soltem durante os impactos.
tr_tr: SB-50 konektörü gibi geçmeli bağlantılar, darbeler sırasında gevşememelerini sağlamak için klipsler veya kablo bağları kullanılarak sabitlenmelidir.
zh_cn: 诸如SB-50连接器之类的卡扣式连接应使用线夹或电缆扎带固定，以确保它们在撞击过程中不会松动。

source: Re-Check Early and Often
es_mx: Vuelva a verificar antes y con frecuencia
fr_ca: Revérifiez tôt et souvent
ja: 早め早めの再確認を
pt: Verifique Novamente com Antecedência e com Frequência
tr_tr: Erken ve Sık Sık Kontrol Edin
zh_cn: 尽早并经常地重新检查

source: Re-check the entire electrical system as thoroughly as possible after playing the first match or two (or doing very vigorous testing). The first few impacts the robot sees may loosen fasteners or expose issues.
es_mx: Vuelva a comprobar todo el sistema eléctrico lo más a fondo posible después de jugar el primer partido o dos (o realizar pruebas muy rigurosas). Los primeros impactos que ve el robot pueden aflojar los sujetadores o exponer problemas.
fr_ca: Revérifiez l’ensemble du système électrique aussi soigneusement que possible après avoir joué le premier match ou deux (ou faire des tests très vigoureux). Les premiers impacts que le robot subit peuvent desserrer les attaches ou exposer des problèmes.
ja: 最初の1、2試合（または非常に激しいテスト）を行った後、電気システム全体を可能な限り徹底的に再チェックしてください。ロボットが最初に受けた数回の衝撃で、固定が緩んだり、問題が露呈したりすることがあります。
pt: Verifique novamente todo o sistema elétrico o mais completamente possível depois de jogar a primeira ou segunda partida (ou fazer testes muito rigorosos). Os primeiros impactos que o robô sofre podem afrouxar os fixadores ou expor problemas.
tr_tr: İlk bir veya iki maçı oynadıktan (veya çok güçlü testler yaptıktan) sonra tüm elektrik sistemini mümkün olduğunca iyice kontrol edin. Robotun gördüğü ilk birkaç darbe, bağlantı elemanlarını gevşetebilir veya sorunları ortaya çıkarabilir.
zh_cn: 在打完一两场比赛（或进行非常激烈的测试）之后，请尽可能彻底地重新检查整个电气系统。机器人遇到的前几个冲击可能会松开紧固件或暴露出问题所在。
