Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/hardware-basics/wiring-best-practices.po
Languages: es_mx, fr_ca, ja, pt, tr_tr, zh_cn

source: Create a checklist for re-checking electrical connections on a regular basis. As a very rough starting point, rotational fasteners such as battery and PDP connections should be checked every 1-3 matches. Spring type connections such as the WAGO and Weidmuller connectors likely only need to be checked once per event. Ensure that the team knows who is responsible for completing the checklist and how they will document that it has been done.
es_mx: Cree una lista de verificación para volver a verificar las conexiones eléctricas con regularidad. Como un punto de partida muy aproximado, los sujetadores giratorios, como las conexiones de la batería y del PDP, deben revisarse cada 1-3 coincidencias. Las conexiones de tipo resorte, como los conectores WAGO y Weidmuller, probablemente solo deban verificarse una vez por evento. Asegúrese de que el equipo sepa quién es responsable de completar la lista de verificación y cómo documentarán que se ha hecho.
fr_ca: Créez une liste de contrôle pour la vérification régulière des connexions électriques. Ä titre d'exemple, les fixations de rotation telles que les connexions de batterie et de PDP doivent être vérifiées tous les 1-3 matchs. Les connexions de type ressort tels que les connecteurs WAGO et Weidmuller n’ont probablement besoin d’être vérifiées qu’une fois par événement. Assurez-vous que l’équipe sait qui est responsable de remplir la liste de vérification et comment elle documentera ce qui est fait, ou à faire.
ja: 電気系統の接続を定期的に再確認するためのチェックリストを作成しましょう。大まかな目安としては、バッテリーやPDPの接続部などの回転式固定は、1～3試合ごとにチェックする必要があります。WAGOやWeidmullerコネクタのようなスプリングタイプの接続は、おそらくイベントごとに1回だけチェックする必要があります。チェックリストを完成させる責任者と、それが行われたことをどのように記録するかについて、チームが知っていることを確認しましょう。
pt: Crie uma checklist para verificar regularmente as conexões elétricas. Como um ponto de partida muito aproximado, as fixações por parafuso, como bateria e conexões PDP, devem ser verificados a cada 1-3 partidas. Conexões do tipo Spring, como os conectores WAGO e Weidmuller, provavelmente só precisam ser verificadas uma vez por evento. Certifique-se de que a equipe saiba quem é responsável por preencher a checklist e como será registrado que isso foi feito.
tr_tr: Elektrik bağlantılarını düzenli olarak yeniden kontrol etmek için bir kontrol listesi oluşturun. Çok kaba bir başlangıç ​​noktası olarak, pil ve PDP bağlantıları gibi rotasyonel bağlantı elemanları her 1-3 maçta bir kontrol edilmelidir. WAGO ve Weidmuller konektörleri gibi yay tipi bağlantıların muhtemelen olay başına yalnızca bir kez kontrol edilmesi gerekir. Ekibin kontrol listesini tamamlamaktan kimin sorumlu olduğunu ve bunun yapıldığını nasıl belgeleyeceğini bildiğinden emin olun.
zh_cn: 创建一个检查表以定期重新检查电气连接。作为一个非常初步地开始，应每1-3场比赛检查一次旋转紧固件，例如电池和PDP连接。例如WAGO和Weidmuller连接器，弹簧型连接每个赛事可能只需要检查一次。确保团队知道谁负责填写清单，以及他们将如何记录该清单。

source: Battery Maintenance
es_mx: Mantenimiento de la batería
fr_ca: Entretien et manipulation de la batterie
ja: バッテリーメンテナンス
pt: Manutenção da Bateria
tr_tr: Akü Bakımı
zh_cn: 电池维护

source: Take good care of your batteries! A bad battery can easily cause a robot to functional poorly, or not at all, during a match. Label all of your batteries to help keep track of usage during the event. Many teams also include information such as the age of the battery on this label.
es_mx: ¡Cuida bien tus baterías! Una batería defectuosa puede hacer que un robot funcione mal o no funcione en absoluto durante un partido. Etiquete todas sus baterías para ayudar a realizar un seguimiento del uso durante el evento. Muchos equipos también incluyen información como la edad de la batería en esta etiqueta.
fr_ca: Prenez bien soin de vos batteries! Une mauvaise batterie peut facilement causer une défaillance majeure sur le robot pendant un match. Étiquetez toutes vos batteries pour vous aider à suivre l’utilisation pendant l’événement. De nombreuses équipes inscrivent également des informations telles que l’âge de la batterie sur cette étiquette.
ja: バッテリーの手入れをしっかりしましょう！バッテリーが悪いと、試合中にロボットの機能が低下したり、まったく動かなくなったりすることがあります。イベント中の使用状況を把握するために、すべてのバッテリーにラベルを貼ってください。多くのチームは、このラベルに電池の年数などの情報も記載しています。
pt: Cuide bem das suas baterias! Uma bateria ruim pode facilmente fazer com que um robô funcione mal, ou nem funcione, durante uma partida. Identifique todas as baterias para ajudar a manter registro do uso durante um evento. Muitas equipes também incluem informações como a idade da bateria neste rótulo.
tr_tr: Akülerinize iyi bakın! Kötü bir akü, bir robotun bir maç sırasında kolayca kötü çalışmasına veya hiç çalışmamasına neden olabilir. Etkinlik sırasında kullanımınızı takip etmenize yardımcı olması için tüm akülerinizi etiketleyin. Birçok ekip bu etikete pilin yaşı gibi bilgileri ekler.
zh_cn: 小心保管好电池！电池电量不足会很容易导致机器人在比赛中无法正常工作或根本无法工作。给所有电池贴上标签，以帮助跟踪活动期间的使用情况。许多团队还在此标签上包含诸如电池寿命之类的信息。

source: Never lift or carry batteries by the wires! Carrying batteries by the wires has the potential to damage the internal connection between the terminals and the plates, dramatically increasing internal resistance and degrading performance.
es_mx: ¡Nunca levante ni transporte las baterías por los cables! Llevar las baterías por los cables tiene el potencial de dañar la conexión interna entre los terminales y las placas, aumentando dramáticamente la resistencia interna y degradando el rendimiento.
fr_ca: Ne soulevez jamais ou ne transportez jamais la batterie par ses fils! Le transport des batteries par les fils a le potentiel d’endommager la connexion interne entre les terminaux et les plaques, tout en augmentant considérablement la résistance interne et en va causer une dégradation de la performance du robot.
ja: バッテリーを配線で持ち上げたり、運んだりはしないでください！配線でバッテリーを持ち運ぶと、端子とプレート間の内部接続が損傷し、内部抵抗が非常に増加し、性能が低下する可能性があります。
pt: Nunca levante ou carregue as baterias pelos cabos! Carregar baterias pelos cabos pode danificar a conexão interna entre os terminais e as placas, aumentando drasticamente a resistência interna e degradando o desempenho.
tr_tr: Aküleri asla kablolarından kaldırmayın veya taşımayın! Pilleri tellerle taşımak, terminaller ve plakalar arasındaki iç bağlantıya zarar verme potansiyeline sahiptir, bu da iç direnci önemli ölçüde artırır ve performansı düşürür.
zh_cn: 切勿用电线提起或搬运电池！电线扯着电池有可能损坏端子和极板之间的内部连接，从而大大增加内部电阻并降低性能。

source: Mark any dropped battery bad until a complete test can be conducted. In addition to the mentioned terminal connections, dropping a battery also has the potential to damage individual cells. This damage may not register on a simple voltage test, instead hiding until the battery is placed under load.
es_mx: Marque cualquier batería caída como defectuosa hasta que se pueda realizar una prueba completa. Además de las conexiones terminales mencionadas, dejar caer una batería también tiene el potencial de dañar celdas individuales. Es posible que este daño no se registre en una prueba de voltaje simple, sino que se esconda hasta que la batería se coloque bajo carga.
fr_ca: Identifiez toute batterie qui a été échappée sur le sol jusqu’à ce qu’un test complet puisse être effectué. En plus des connexions terminales mentionnées, une batterie qui a été échappée au sol peut aussi contenir des cellules individuelles endommagées à l'interne. Ces dommages ne peuvent pas être décelé à l'aide d'un simple test de tension, mais seront vite détectés lorsque la batterie sera placée sous la charge.
ja: 落下したバッテリーには、徹底的なテストが行われるまで不良マークを付けます。前述の端子接続に加え、バッテリーを落とすと個々のセルを損傷する可能性があります。この損傷は単純な電圧テストでは認識されず、バッテリーに負荷がかかるまで隠れていることがあります。
pt: Marque qualquer bateria que caiu como ruim até que um teste completo possa ser realizado. Além das conexões de terminais mencionadas, a queda de uma bateria também pode danificar células individuais. Este dano pode não ser registrado em um simples teste de tensão, pode passar despercebido até que a bateria seja usada sob carga.
tr_tr: Tam bir test yapılıncaya kadar düşen aküyü kötü olarak işaretleyin. Bahsedilen terminal bağlantılarına ek olarak, bir akünün düşürülmesi de hücrelere zarar verme potansiyeline sahiptir. Bu hasar basit bir voltaj testinde anlaşılmayabilir, bunun yerine akü yük altına alınana kadar saklanabilir.
zh_cn: 把所有摔过的电池标记成损坏，直到进行完整的测试为止。除上述地端子连接外，掉落的电池可能损坏单个蓄电池单元。这种损坏可能无法通过简单的电压测试记录下来，而是隐藏起来直到将电池置于负载下为止。

source: Rotate batteries evenly. This helps ensure that batteries have the most time to charge and rest and that they wear evenly (equal number of charge/discharge cycles)
es_mx: Gire las baterías de manera uniforme. Esto ayuda a garantizar que las baterías tengan más tiempo para cargarse y descansar y que se desgasten de manera uniforme (igual número de ciclos de carga / descarga)
fr_ca: Faire la rotation de l'utilisation des batteries uniformément. Cela permet de s’assurer que les batteries ont le plus de temps pour se charger et se reposer et qu’elles se dégradent uniformément (nombre égal de cycles de charge/décharge)
ja: バッテリーのローテーションを均等に行います。これにより、バッテリーの充電・休む時間を最大限に確保し、均等に消耗することができます（充電・放電サイクルの回数が均等になります）。
pt: Alterne entre as baterias uniformemente. Isso ajuda a garantir que as baterias tenham mais tempo para carregar e descansar e que se desgastem uniformemente (número igual de ciclos de carga/descarga)
tr_tr: Aküleri eşit şekilde değiştirin. Bu, pillerin şarj ve dinlenme için en fazla zamana sahip olmalarını ve eşit şekilde aşınmalarını sağlamaya yardımcı olur (eşit sayıda şarj/deşarj döngüsü)
zh_cn: 均匀循环电池。这有助于确保电池有最大的充电和休息时间，并确保它们被均匀使用（相等的充电/放电循环次数）

source: Load test batteries if possible to monitor health. There are a number of commercially available products teams use to load test batteries, including at least one designed specifically for FRC. A load test can provide an indicator of battery health by measuring internal resistance. This measurement is much more meaningful when it comes to match performance than a simple no-load voltage number provided by a multimeter.
es_mx: Cargue las baterías de prueba si es posible para monitorear la salud. Hay una serie de productos disponibles comercialmente que los equipos utilizan para cargar baterías de prueba, incluido al menos uno diseñado específicamente para FRC. Una prueba de carga puede proporcionar un indicador del estado de la batería midiendo la resistencia interna. Esta medida es mucho más significativa cuando se trata de igualar el rendimiento que un simple número de voltaje sin carga proporcionado por un multímetro.
fr_ca: Charger les batteries uniformément et faites un essai de charge si possible pour surveiller l’état de santé. Il existe un certain nombre de produits disponibles dans le commerce que les équipes utilisent pour tester la charge des batteries, dont au moins une conçue spécifiquement pour FRC. Un test de charge peut fournir un indicateur de la santé de la batterie en mesurant la résistance interne. Cette mesure est beaucoup plus significative quand il s’agit de correspondre aux performances qu’un simple mesure de tension sans charge fourni par un multimètre.
ja: バッテリーの状態をチェックするために、可能であれば負荷テストを行います。チームがバッテリーの負荷テストに使用できる市販の製品は数多くあり、その中にはFRC専用に設計されたものもあります。負荷テストは、内部抵抗を測定することによってバッテリーの状態の指標を提供することができます。この測定は、マルチメーターが提供する単純な無負荷電圧の数値よりも、試合での性能に関して役立ちます。
pt: Faça teste sob carga, se possível, para monitorar a saúde. Há uma série de produtos disponíveis comercialmente que as equipes utilizam para testar baterias sob carga, incluindo pelo menos uma projetada especificamente para FRC. Um teste sob carga pode fornecer um indicador da integridade da bateria medindo a resistência interna. Essa medida é muito mais significativa quando se trata de corresponder ao desempenho do que um simples número de tensão sem carga fornecido por um multímetro.
tr_tr: Mümkünse akülerin sağlamlığını test için yüke bağlayın. En az bir tanesi FRC için özel olarak tasarlanmış olmak üzere, takımların bataryalarını yüklemek için kullandığı ticari olarak temin edilebilen bir dizi ürün vardır. Bir yük testi, iç direnci ölçerek pil sağlığının bir göstergesi olabilir. Bu ölçüm, performans eşleşmesi söz konusu olduğunda, bir multimetre tarafından sağlanan basit bir yüksüz voltaj ölçümünden çok daha anlamlıdır.
zh_cn: 尽可能装入测试电池来监控健康状况。有许多商业产品可供队伍用作测试电池，包括至少一种专门为FRC设计的产品。负载测试可以通过测量内部电阻来指示电池的运行状况。这种测试方法远比万用表提供的简单空载电压值相比更接近实际表现、更有意义。

source: Check DS Logs
es_mx: Comprobar registros de DS
fr_ca: Vérification des journaux DS (DS logs)
ja: DS Logsを確認する
pt: Verifique os registros do DS
tr_tr: DS Günlüklerini Kontrol Edin
zh_cn: 检查DS日志

source: After each match, review the DS logs to see what the battery voltage and current usage looks like. Once you have established what the normal range of these items is for your robot, you may be able to spot potential issues (bad batteries, failing motors, mechanical binding) before they become critical failures.
es_mx: Después de cada partido, revise los registros de DS para ver cómo se ve el voltaje de la batería y el uso actual. Una vez que haya establecido cuál es el rango normal de estos elementos para su robot, es posible que pueda detectar problemas potenciales (baterías defectuosas, motores defectuosos, atascos mecánicos) antes de que se conviertan en fallas críticas.
fr_ca: Après chaque match, passez en revue les journaux DS pour voir à quoi ressemble la tension de la batterie et l’utilisation du courant. Une fois que vous avez établi la consommation normale de ces éléments pour votre robot, vous pouvez être en mesure de repérer les problèmes potentiels (mauvaises batteries, moteurs défaillants, liaison mécanique) avant qu’ils ne deviennent des défaillances critiques.
ja: 各試合の後、DS logsを見て、バッテリーの電圧と電流の使用状況を確認します。これらの項目がロボットの正常な範囲であるかを確認すれば、潜在的な問題（バッテリーの不良、モーターの故障、機械的な結合）が重大な故障になる前に発見することができるようになるかもしれません。
pt: Após cada partida, revise os registros da DS para ver o uso de corrente e tensão da bateria. Depois de estabelecer qual é o intervalo normal desses itens para o seu robô, você poderá detectar problemas potenciais (baterias ruins, motores com falha, travamento mecânico) antes que se tornem falhas críticas.
tr_tr: Her maçtan sonra, pil voltajı ve akım kullanımının neye benzediğini görmek için DS günlüklerini inceleyin. Robotunuz için bu öğelerin normal aralığının ne olduğunu belirledikten sonra, potansiyel sorunları (bozuk piller, arızalı motorlar, mekanik tıkanmalar) kritik arızalara dönüşmeden önce tespit edebilirsiniz.
zh_cn: 每次比赛后，查看DS日志以查看电池电压和电流使用情况。透过建立机器人在这些项目上的正常范围，您就可以在潜在问题（严重的电池，电动机故障，机械冲突）变为严重故障之前发现它们。

source: The article :doc:`Intro to FRC Robot Wiring </docs/zero-to-robot/step-1/intro-to-frc-robot-wiring>` walks through the details of what connects where to wire up the FRC Control System and this article provides some additional "Best Practices" that may increase reliability and make maintenance easier. Take a look at :doc:`Preemptive Troubleshooting <preemptive-troubleshooting>` for more tips and tricks.
ja: :doc:`Intro to FRC Robot Wiring </docs/zero-to-robot/step-1/intro-to-frc-robot-wiring>` の記事では、FRC制御システムのどこにどの配線を接続するかについて詳しく説明し、信頼性を高め、メンテナンスを容易にするための「ベストプラクティス」をいくつか紹介します。より多くのヒントとコツについては､ :doc:`Preemptive Troubleshooting <preemptive-troubleshooting>` をご覧ください。
