Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/basic-programming/cpp-units.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: The C++ Units Library
es_mx: Biblioteca de unidades de C++
fr_ca: La librairie d'unités C++
tr_tr: C ++ Ünite Kitaplığı
zh_cn: C++ 单位库

source: The 2020 release of WPILib is coupled with a `Units <https://github.com/nholthaus/units>`_ library for C++ teams. This library leverages the C++ `type system <https://docs.microsoft.com/en-us/cpp/cpp/cpp-type-system-modern-cpp?view=vs-2019>`__ to enforce proper dimensionality for method parameters, automatically perform unit conversions, and even allow users to define arbitrary defined unit types. Since the C++ type system is enforced at compile-time, the library has essentially no runtime cost.
es_mx: El lanzamiento de WPILib en 2020 está acoplado con una biblioteca de `unidades <https://github.com/nholthaus/units>`_ para equipos C++. Esta biblioteca apalanca el `sistema de escritura <https://docs.microsoft.com/en-us/cpp/cpp/cpp-type-system-modern-cpp?view=vs-2019>`__ de C++ para imponer la dimensionalidad correcta de los parámetros de los métodos, que lleve a cabo automáticamente las conversiones de unidades, y que incluso permita a los usuarios definir tipos de unidades arbitrarias. Ya que el sistema de escritura de C++ es aplicado a la hora de compilar, la librería no tiene costo a la hora de ejecutarse.
fr_ca: La version 2020 de WPILib est associée à une librairie `Units <https://github.com/nholthaus/units>`_ pour les équipes C++. Cette librairie exploite le `C++ type system <https://docs.microsoft.com/en-us/cpp/cpp/cpp-type-system-modern-cpp?view=vs-2019>`__ pour appliquer la dimensionnalité appropriée pour les paramètres des méthodes, effectuer automatiquement des conversions d'unités et même permettre aux utilisateurs de définir arbitrairement un type d'unités. Étant donné que le "C++ type system" est appliqué au moment de la compilation, la libraire n'affecte pas le temps d'exécution du programme final.
tr_tr: WPILib'in 2020 sürümü, C ++ ekipleri için bir `Units <https://github.com/nholthaus/units>`_ _ kitaplığı ile birleştirilmiştir. Bu kitaplık, C ++ `tip sisteminden <https://docs.microsoft.com/en-us/cpp/cpp/cpp-type-system-modern-cpp?view=vs-2019>` __ yararlanarak yöntem parametreleri, otomatik olarak birim dönüştürmeleri gerçekleştirir ve hatta kullanıcıların rastgele tanımlanmış birim türlerini tanımlamasına izin verir. C ++ tipi sistem derleme zamanında zorlandığından, kitaplığın esasen çalışma zamanı maliyeti yoktur.

source: Using the Units Library
es_mx: Usar la Biblioteca de Unidades
fr_ca: Utilisation de la librairie d'unités
tr_tr: Ünite Kitaplığını Kullanma
zh_cn: 使用单位库

source: The units library is a header-only library. You must include the ``units.h`` header in your code files.
es_mx: La librería de unidades es solo una librería de título. Usted debe incluir el título de ``units.h`` en sus archivos de código.

source: Unit Types and Container Types
es_mx: Tipos de Unidades y Tipos de Contenedores
fr_ca: Types d'unités et types de conteneurs
tr_tr: Ünite Tipleri ve Taşıyıcı Sınıf Tipleri
zh_cn: 单位类型和容器类型

source: The C++ units library is based around two sorts of type definitions: unit types and container types.
es_mx: Las librerías de unidades de C++ están basadas en dos clases de definiciones: tipos de unidades y tipos de contenedores.
fr_ca: La librairie d'unités C++ est basée sur deux sortes de définitions de types: les types d'unités et les types de conteneurs.
tr_tr: C ++ ünite kitaplığı iki tür tür tanımına dayanır: birim türleri ve kapsayıcı türleri.
zh_cn: C ++ 单位库基于两种类型定义 : 单位类型和容器类型。

source: Unit Types
es_mx: Tipos de Unidades
fr_ca: Types d'unités
tr_tr: Ünite Tipleri
zh_cn: 单位类型

source: Unit types correspond to the abstract concept of a unit, without any actual stored value. Unit types are the fundamental "building block" of the units library - all unit types are defined constructively (using the ``compound_unit`` template) from a small number of "basic" unit types (such as ``meters``, ``seconds``, etc).
es_mx: Los tipos de unidades corresponden al concepto abstracto de una unidad, sin que tenga un valor actual guardado. Unit types son el “bloque de construcción” fundamental de las librerías de unidad - todos los tipos de unidades son definidos constructivamente (usando la plantilla ``compound_unit``) de un número pequeño de unit types "básicas" (como ``meters``, ``seconds``, etc).
fr_ca: Les types d'unités correspondent au concept abstrait d'une unité, sans aucune valeur stockée réelle. Les types d'unités sont le "bloc de construction" fondamental de la librairie d'unités - tous les types d'unités sont définis de manière constructive (en utilisant le modèle ``compound_unit``) à partir d'un petit nombre de types d'unités "de base" (tels que ``mètres``, ``secondes``, etc.).
tr_tr: Birim türleri, herhangi bir gerçek depolanmış değer olmaksızın soyut bir birim kavramına karşılık gelir. Birim türleri, birimler kitaplığının temel "building block-yapı taşı" dır , az sayıda "basic-temel" birim türünden (örneğin `` metre `` , `` saniye `` vb.) yapıcı bir şekilde (`` compound_unit-birleşik_birim`` şablonu kullanılarak) tanımlanır.
zh_cn: 单元类型对应于单元的抽象概念，没有任何实际的存储值。单元类型是单元库的基本“构建块”-所有单元类型都通过少量“基本”单元类型 (例如“ meters”，“ `seconds'等) 在被构造时定义 (通过 "compound_unit" 模版) 。

source: While unit types cannot contain numerical values, their use in building other unit types means that when a type or method uses a `template parameter <http://www.cplusplus.com/doc/oldtutorial/templates/>`__ to specify its dimensionality, that parameter will be a unit type.
es_mx: Mientras los Tipos de Unidades no pueden contener valores numéricos, su uso en construir otro sistema de Unidad significa que cuando otro sistema o método utiliza un `parámetro de plantilla <http://www.cplusplus.com/doc/oldtutorial/templates/>`__ para especificar su dimensionalidad, ese parámetro será un tipo de unidad.
fr_ca: Bien que les types d'unités ne puissent pas contenir de valeurs numériques, leur utilisation dans la création d'autres types d'unités signifie que lorsqu'un type ou une méthode utilise un `paramètre de modèle <http://www.cplusplus.com/doc/oldtutorial/templates/>`__ pour spécifier sa dimensionnalité, ce paramètre sera alors un type d'unité.
tr_tr: Birim türleri sayısal değerler içeremezken, diğer birim türlerini oluşturmadaki kullanımları, bir tür veya yöntem bir `şablon parametresi <http://www.cplusplus.com/doc/oldtutorial/templates/>` __ kullandığında, boyutsallık, bu parametre bir birim türü olacaktır.

source: Container Types
es_mx: Tipos de contenedores
fr_ca: Types de conteneurs
tr_tr: Container-Taşıyıcı Sınıf Türleri
zh_cn: 容器类型

source: Container types correspond to an actual quantity dimensioned according to some unit - that is, they are what actually hold the numerical value. Container types are constructed from unit types with the ``unit_t`` template. Most unit types have a corresponding container type that has the same name suffixed by ``_t`` - for example, the unit type ``units::meter`` corresponds to the container type ``units::meter_t``.
es_mx: Los tipos de contenedores corresponden a una cantidad actual dimensionada de acuerdo con cierta unidad – que es, ellos son los que contienen realmente el valor numérico. Container types son hechos de unit types con el modelo ``unit_t``. La mayoría de los unit types tienen un container type que les correponde que tiene el mismo sufijo de nombre por ``_t`` - por ejemplo, el unit type ``units::meter`` corresponde al container type ``units::meter_t``.
fr_ca: Les types de conteneurs correspondent à une quantité réelle dimensionnée en fonction d'une unité, c'est-à-dire qu'ils détiennent réellement la valeur numérique. Les types de conteneurs sont construits à partir de types d'unités avec le modèle ``unit_t``. La plupart des types d'unités ont un type de conteneur correspondant qui porte le même nom suffixé par ``_t`` - par exemple, le type d'unité ``units :: meter`` correspond au type de conteneur ``units :: meter_t``.
tr_tr: Container-Taşıyıcı Sınıf türleri, bir birime göre boyutlandırılmış gerçek bir miktara karşılık gelir - yani, bunlar gerçekte sayısal değeri tutan şeydir. Container-Taşıyıcı Sınıf türleri, ``unit_t`` şablonuna sahip birim türlerinden oluşturulur. Çoğu birim türünün son eki ``_t`` ile aynı adı taşıyan karşılık gelen bir kap türü vardır - örneğin, birim türü ``units::meter``, konteyner türü ``units::meter_t`` ye karşılık gelir.
zh_cn: 容器类型对应于根据某个单位确定尺寸的实际数量。也就是说，它们是实际包含数值的内容。容器类型是使用具有 "unit_t" 模板的单元类型构造的。大多数单位类型都有一个对应的容器类型，其名称后缀有 "_t" -例如，单元类型 "units :: meter" 对应于容器类型 "units :: meter_t"。

source: Whenever a specific quantity of a unit is used (as a variable or a method parameter), it will be an instance of the container type. By default, container types will store the actual value as a ``double`` - advanced users may change this by calling the ``unit_t`` template manually.
es_mx: Cuando una cantidad específica de unidad es utilizada (como variable o un parámetro de método), va a ser una instancia del tipo contenedor/container type. Por defecto, los tipos contenedores pueden almacenar el valor actual como ``double`` - usuarios avanzados pueden cambiar esto llamando al modelo ``unit_t`` manualmente.
fr_ca: Chaque fois qu'une quantité spécifique d'une unité est utilisée (en tant que variable ou paramètre de méthode), ce sera une instance du type de conteneur. Par défaut, les types de conteneurs stockent la valeur réelle sous forme de ``double`` - les utilisateurs plus avancés peuvent changer cela en appelant le modèle ``unit_t`` manuellement.
tr_tr: Bir birimin belirli bir miktarı kullanıldığında (değişken veya yöntem parametresi olarak), bu, Container-Taşıyıcı Sınıf türünün bir örneği olacaktır. Varsayılan olarak, Container-Taşıyıcı Sınıf türleri gerçek değeri `` double`-çift`` olarak depolar - ileri düzey kullanıcılar bunu manuel olarak ``unit_t`` şablonunu çağırarak değiştirebilir.
zh_cn: 每当使用特定数量的单位 (作为变量或方法参数) 时，它将是容器类型的实例。默认情况下，容器类型会将实际值存储为 "double" -高级用户可以通过手动调用 "unit_t" 模板来更改此值。

source: A full list of unit and container types can be found in the `documentation <https://nholthaus.github.io/units/namespaces.html>`__.
es_mx: Una lista completa de tipos unitarios y contenedores puede ser encontrada en el `documento <https://nholthaus.github.io/units/namespaces.html>`__.

source: Creating Instances of Units
es_mx: Creando instancias de unidades
fr_ca: Création d'instances d'unités
tr_tr: Ünite Örnekleri Oluşturma
zh_cn: 创建单位的实例

source: To create an instance of a specific unit, we create an instance of its container type:
es_mx: Para crear una instancia de una unidad específica, creamos una instancia con su tipo contenedor:
fr_ca: Pour créer une instance d'une unité spécifique, nous créons une instance de son type de conteneur:
tr_tr: Belirli bir ünitenin örneğini oluşturmak için, container türünün bir örneğini oluşturuyoruz:
zh_cn: 为了创建特定单元的实例，我们需要创建其容器类型的实例：

source: Alternatively, the units library has `type literals <https://en.cppreference.com/w/cpp/language/user_literal>`__ defined for some of the more common container types. These can be used in conjunction with type inference via ``auto`` to define a unit more succinctly:
es_mx: Una alternativa es que la librería de unidades tiene `tipos literales <https://en.cppreference.com/w/cpp/language/user_literal>`__ definidos por algunos de los tipos contenedores más comunes. Éstos pueden ser usados en conjunción con tipo de inferencia vía ``auto`` para definir una unidad más sucintamente:
fr_ca: Alternativement, la librairie d'unités a des `types de littéraux <https://en.cppreference.com/w/cpp/language/user_literal>`__ définis pour certains des types de conteneurs les plus courants. Ceux-ci peuvent être utilisés en conjonction avec l'inférence de type via ``auto`` pour définir une unité plus succinctement:
tr_tr: Alternatif olarak, ünite kitaplığı, daha yaygın kap türlerinden bazıları için tanımlanmış `type literals <https://en.cppreference.com/w/cpp/language/user_literal>`__ sahiptir. Bunlar, bir birimi daha kısa ve öz bir şekilde tanımlamak için tür çıkarımı ile birlikte kullanılabilir:
zh_cn: 另外，单位库还为一些较常见的容器类型定义了 "类型文字<https://en.cppreference.com/w/cpp/language/user_literal>" __ 。这些可以与通过 "auto" 进行的类型推断结合使用，以更简洁地定义一个单元:

source: Units can also be initialized using a value of an another container type, as long as the types can be converted between one another. For example, a ``meter_t`` value can be created from a ``foot_t`` value.
es_mx: Las unidades también se pueden inicializar usando un valor de otro tipo contenedor, mientras que los tipos puedan ser convertidos en medio de los otros. Por ejemplo, un valor ``meter_t`` puede ser creado desde un valor ``foot_t``.
fr_ca: Les unités peuvent également être initialisées à l'aide d'une valeur d'un autre type de conteneur, en autant que les types peuvent être convertis entre eux. Par exemple, une valeur ``mètre_t`` peut être créée à partir d'une valeur ``pied_t``.
tr_tr: Türler birbirleri arasında dönüştürülebildiği sürece, birimler başka bir container türünün değeri kullanılarak da başlatılabilir. Örneğin, bir ``foot_t`` değerinden bir ``meter_t`` değeri oluşturulabilir.
zh_cn: 只要可以在另一个容器类型之间进行转换，单元也可以使用另一个容器类型的值来初始化。例如，可以从 "foot_t" 值创建 "meter_t" 值。

source: In fact, all container types representing convertible unit types are *implicitly convertible*. Thus, the following is perfectly legal:
es_mx: DE hecho, todos los tipos contenedor representando tipo unidad convertibles son *implícitamente convertibles*. Así, lo siguiente es perfectamente legal:
fr_ca: En fait, tous les types de conteneurs représentant des types d'unités convertibles sont *implicitement convertibles*. Ainsi, ce qui suit est parfaitement légal:
tr_tr: Aslında, dönüştürülebilir birim türlerini temsil eden tüm kap türleri *implicitly convertible*. Bu nedenle, aşağıdakiler tamamen doğrudur:
zh_cn: 实际上，代表可转换单位类型的所有容器类型都是 "隐式可转换的" 。因此，以下内容完全合法：

source: In short, we can use *any* unit of length in place of *any other* unit of length, anywhere in our code; the units library will automatically perform the correct conversion for us.
es_mx: En breve, usamos *ninguna* unidad de medida en lugar de *otra* unidad de medida, en ningun lugar del codigo; las librerias de unidades pueden automáticamente realizar la conversión por nosotros.
fr_ca: En bref, nous pouvons utiliser *n'importe quelle* unité de longueur à la place de *toute autre* unité de longueur, n'importe où dans notre code; la librairie d'unités effectuera automatiquement la conversion correcte pour nous.
tr_tr: Kısacası, kodumuzun herhangi bir yerinde * herhangi bir -any other* uzunluk birimi * yerine * herhangi-any * uzunluk birimini kullanabiliriz; birimler kitaplığı bizim için otomatik olarak doğru dönüşümü gerçekleştirecektir.
zh_cn: 简而言之，我们可以在代码中的任何位置使用 *任意* 长度单位代替 *任何其他* 长度单位；单位库将自动为我们执行正确的转换。

source: Performing Arithmetic with Units
es_mx: Realizando aritmética con unidades
fr_ca: Exécution de l'arithmétique avec des unités
tr_tr: Hesap Yapma Ünitesi
zh_cn: 执行含有单位的算术

source: Container types support all of the ordinary arithmetic operations of their underlying data type, with the added condition that the operation must be *dimensionally* sound. Thus, addition must always be performed on two compatible container types:
es_mx: Los tipo contenedores soportan todas las operaciones aritméticas ordinarias de su tipo de datos subyacente, con la condición añadida que la operación debe estar *dimensionalmente* sólido. Así, las adiciones siempre tienen que estar realizadas en dos tipos de contenedores compatibles:
fr_ca: Les types de conteneurs prennent en charge toutes les opérations arithmétiques ordinaires de leur type de données sous-jacent, avec la condition supplémentaire que l'opération doit être *dimensionnellement* valide. Ainsi, l'addition doit toujours être effectuée sur deux types de conteneurs compatibles:
tr_tr: Container-Taşıyıcı türleri, işlemin * boyutsal olarak * sağlam olması gerektiği ek koşuluyla, temel alınan veri türlerinin tüm sıradan aritmetik işlemlerini destekler. Bu nedenle, ekleme her zaman iki uyumlu container türünde yapılmalıdır:
zh_cn: 容器类型支持其基础数据类型的所有普通算术运算，其附加条件是该运算必须是 *维* 的。因此，必须始终对两种兼容的容器类型执行添加：

source: Multiplication may be performed on any pair of container types, and yields the container type of a compound unit:
es_mx: La multiplicación debe de ser realizada en cualquier par de tipo contenedor, y dar al tipo contenedor de una unidad compuesta:
fr_ca: La multiplication peut être effectuée sur n'importe quelle paire de types de conteneurs et donne le type de conteneur d'une unité composée:
tr_tr: Çarpma, herhangi bir kap türü çiftinde gerçekleştirilebilir ve bir bileşik birimin kap türünü verir:
zh_cn: 乘法可以对任何一对容器类型执行，并得出复合单元的容器类型：

source: When a calculation yields a compound unit type, this type will only be checked for validity at the point of operation if the result type is specified explicitly. If ``auto`` is used, this check will not occur. For example, when we divide distance by time, we may want to ensure the result is, indeed, a velocity (i.e. ``units::meter_per_second_t``). If the return type is declared as ``auto``, this check will not be made.
es_mx: Cuando un calculo da un tipo de unidad compuesta, éste tipo será solo revisado para validar en el punto de operación si el tipo resultado es especificado explícitamente. Si ``auto`` es utilizado, esta verificación no ocurrirá. Por ejemplo, cuando nosotros dividimos distancia sobre tiempo, deberíamos querer asegurar que el resultado, en efecto, es velocidad (por ejemplo, ``units::meter_per_second_t``). Si el tipo resultante es declarado como ``auto``, esta verificación no se hará.
fr_ca: Lorsqu'un calcul donne un type d'unité composé, ce type ne sera vérifié pour la validité au point d'opération que si le type de résultat est spécifié explicitement. Si ``auto`` est utilisé, cette vérification n'aura pas lieu. Par exemple, lorsque nous divisons la distance par le temps, nous pouvons vouloir nous assurer que le résultat est bien une vitesse (c'est-à-dire ``units :: meter_per_second_t``). Si le type de retour est déclaré ``auto``, cette vérification ne sera pas effectuée.
tr_tr: Bir hesaplama bir bileşik birim türü verdiğinde, bu tür yalnızca sonuç türü açıkça belirtilmişse işlem noktasında geçerlilik açısından kontrol edilecektir. `` auto-otomatik`` kullanılırsa, bu kontrol yapılmayacaktır. Örneğin, mesafeyi zamana böldüğümüzde, sonucun gerçekten bir hız olmasını sağlamak isteyebiliriz (yani, `` units :: meter_per_second_t ``). İade türünün `` auto-otomatik `` olarak bildirilmesi durumunda bu kontrol yapılmayacaktır.
zh_cn: 当计算产生复合单位类型时，如果明确指定结果类型，则仅在操作时检查此类型的有效性。如果使用 "auto" , 则不会进行此检查。例如, 当我们将距离除以时间时, 我们希望确保结果确实是速度即 ( "units :: meter_per_second_t" )。如果返回类型声明为 "auto" ，则不会进行此检查。

source: ``<cmath>`` Functions
es_mx: ``<cmath>`` Funciones
fr_ca: Les fonctions ``<cmath>``
tr_tr: Fonksiyonlar
zh_cn: ``<cmath>''函数

source: Some ``std`` functions (such as ``clamp``) are templated to accept any type on which the arithmetic operations can be performed. Quantities stored as container types will work with these functions without issue.
es_mx: Algunas funciones ``std`` (como ``clamp``) son plantillas que aceptan cualquier tipo que realice las operaciones aritméticas. Las cantidades almacenadas como tipo contenedores pueden funcionar con estas funciones sin ningún problema.
fr_ca: Certaines fonctions ``std`` (telles que ``clamp``) sont conçues pour accepter tout type sur lequel les opérations arithmétiques peuvent être effectuées. Les quantités stockées en tant que types de conteneurs fonctionneront sans problème avec ces fonctions.
tr_tr: Bazı standart işlevler (`` kelepçe-clamp`` gibi), aritmetik işlemlerin gerçekleştirilebileceği herhangi bir türü kabul edecek şekilde şablonlanmıştır. container-konteyner türleri olarak depolanan miktarlar bu işlevlerle sorunsuz çalışacaktır.
zh_cn: 一些 "std" 函数 (例如 ``clamp`` ) 被模板化以接受可以在其上执行算术运算的任何类型。以容器类型存储的数量可以使用这些功能而不会出现问题。

source: However, other ``std`` functions work only on ordinary numerical types (e.g. ``double``). The units library's ``units::math`` namespace contains wrappers for several of these functions that accept units. Examples of such functions include ``sqrt``, ``pow``, etc.
es_mx: De cualquier manera, otras funciones ``std`` funcionan solo con tipos numéricos ordinarios (por ejemplo, ``double``). Los espacios para el nombre de las librerías unitarias ``units::math``contienen envolvedores para algunas de estas funciones que aceptan unidades. Ejemplos de estas funciones incluyen ``sqrt``, ``pow``, etc.
fr_ca: Cependant, d'autres fonctions ``std`` ne fonctionnent que sur les types numériques ordinaires (par exemple ``double``). L'espace de noms ``units :: math`` de la librairie d'unités contient des "wrappers" pour plusieurs de ces fonctions qui acceptent les unités. Des exemples de telles fonctions incluent ``sqrt``, ``pow``, etc.
tr_tr: Bununla birlikte, diğer standart işlevleri yalnızca sıradan sayısal türlerde çalışır (örneğin, ``double``). Birim kitaplığının `` units :: math`` ad alanı, birimleri kabul eden bu işlevlerin birçoğu için sarmalayıcılar içerir. Bu tür işlevlere örnek olarak `` sqrt ``, `` pow ``,vb. verilebilir.
zh_cn: 但是，其他``std`` 函数仅适用于普通数字类型 (例如 ``double`` )。单元库的 ``units :: math`` 命名空间包含一些接受单元的函数的包装。此类功能的示例包括 ``sqrt``, ``pow`` 等。

source: Removing the Unit Wrapper
es_mx: Quitar el envoltorio de la unidad
fr_ca: Retrait du "Unit Wrapper"
tr_tr: Ünite/Birim Sargısının Çıkarılması
zh_cn: 去除 ``Unit Wrapper``

source: To convert a container type to a raw numeric value, the ``to<..>()`` method can be used, where the template argument is the underlying type.
es_mx: Para convertir un tipo contenedor a un valor numérico crudo, el método ``to<..>()`` puede ser utilizado, donde el argumento de plantilla es de tipo subyacente.
fr_ca: Pour convertir un type de conteneur en une valeur numérique brute, la méthode ``to <..> ()`` peut être utilisée, où l'argument modèle est le type sous-jacent.
tr_tr: Bir kap türünü ham sayısal değere dönüştürmek için, şablon bağımsız değişkeninin temel tür olduğu "to <..> ()" yöntemi kullanılabilir.

source: Example of the Units Library in WPILib Code
es_mx: Ejemplo de librería de unidades en el código WPILib
fr_ca: Exemple de la librairie d'unités dans le code WPILib
tr_tr: WPILib Kodundaki Ünite Kitaplığı Örneği
zh_cn: WPILib 代码中的单位库示例
