Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/basic-programming/cpp-units.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Several arguments for methods in new features of WPILib (ex. :ref:`kinematics <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is kinematics?>`) use the units library. Here is an example of :ref:`sampling a trajectory <docs/software/advanced-controls/trajectories/manipulating-trajectories:Sampling the trajectory>`.
es_mx: Algunos argumentos de métodos en nuevas funciones de WPILib (ex. :ref:`cinemáticas <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is kinematics?>`) usan las librerías de unidad. Aquí hay un ejemplo de :ref:`probando una trayectoria <docs/software/advanced-controls/trajectories/manipulating-trajectories:Sampling the trajectory>`.
fr_ca: Plusieurs arguments pour des méthodes dans les nouvelles fonctionnalités de WPILib (ex. :ref:`kinematics <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is kinematics?>`) utilisent la librairie d'unités. Voici un exemple d\' :ref:`échantillonnage d'une trajectoire <docs/software/advanced-controls/trajectories/manipulating-trajectories:Sampling the trajectory>`.
tr_tr: WPILib'in yeni özelliklerindeki yöntemler için çeşitli argümanlar (ör.: Ref: "kinematik <docs / yazılım / kinematik-ve-odometri / intro-ve-şasi-hızları: kinematik nedir?>") Birimler kitaplığını kullanır. İşte bir örnek: ref: `bir yörünge örnekleme <docs / software / advanced-controls / yörüngeler / manipüle-yörüngeler: yörüngeyi örnekleme>".
zh_cn: WPILib 新功能中的函数的几个参数 (例如: kinematics <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is kinematics?>) 使用单位库。这是对轨迹 <docs/software/advanced-controls/trajectories/manipulating-trajectories:Sampling the trajectory> 进行采样的示例。

source: Some WPILib classes represent objects that could naturally work with multiple choices of unit types - for example, a motion profile might operate on either linear distance (e.g. meters) or angular distance (e.g. radians). For such classes, the unit type is required as a template parameter:
es_mx: Algunas clases de WPILib representan objetos que pueden trabajar naturalmente con múltiples opciones de tipos de unidades - por ejemplo, un perfil de movimiento puede operar en cualquier distancia lineal (por ejemplo, metros) o distancia angular (por ejemplo, radianes). Para esas clases, el tipo unitario es requerido como un parámetro modelo:
fr_ca: Certaines classes WPILib représentent des objets qui pourraient naturellement fonctionner avec plusieurs choix de types d'unités - par exemple, un profil de mouvement peut fonctionner sur une distance linéaire (par exemple mètres) ou angulaire (par exemple radians). Pour ces classes, le type d'unité est requis comme paramètre de modèle:
tr_tr: Bazı WPILib sınıfları, birden çok birim türü seçeneğiyle doğal olarak çalışabilen nesneleri temsil eder - örneğin, bir hareket profili doğrusal mesafede (ör. Metre) veya açısal mesafede (ör. Radyan) çalışabilir. Bu tür sınıflar için, birim türü şablon parametresi olarak gereklidir:
zh_cn: 某些 WPILib 类表示可以自然地与多种单位类型一起使用的对象 -例如，运动曲线可能会在线性距离 (例如米) 或角距离 (例如弧度) 上运行。对于这种类，必须将单位类型作为模板参数：

source: For more detailed documentation, please visit the official `GitHub page <https://github.com/nholthaus/units>`_ for the units library.
es_mx: Para documentación más detallada, por favor visite laágina oficial de `GitHub <https://github.com/nholthaus/units>`_ para las librerías de unidad.
fr_ca: Pour une documentation plus détaillée, veuillez visiter la page officielle `GitHub <https://github.com/nholthaus/units>`_ pour la librairie des unités.
tr_tr: Daha ayrıntılı belgeler için lütfen birim kitaplığı için resmi `GitHub sayfasını <https://github.com/nholthaus/units>" _ ziyaret edin.
zh_cn: 有关更多详细文档，请访问官方 `GitHub 页面 <https://github.com/nholthaus/units>`_ 获取单位库。

source: The ``units/math.h`` header provides unit-aware functions like ``units::math::abs()``.
tr_tr: ``units/math.h`` başlığı, ``units::math::abs()`` gibi birime duyarlı işlevler sağlar.
zh_cn: "units/math.h" 标头提供了单位感知功能，例如 "units::math::abs()"。

source: A full list of unit and container types can be found in the `documentation <https://github.com/nholthaus/units#namespaces>`__.
fr_ca: Vous trouverez une liste complète des types d’unités et de conteneurs dans la `documentation <https://github.com/nholthaus/units#namespaces>`__.
tr_tr: Birim ve Container-Taşıyıcı Sınıf türler türlerinin tam listesi `documentation <https://github.com/nholthaus/units#namespaces>` __ belgelerinde bulunabilir.
zh_cn: 单位和容器类型的完整列表可以在文档 "<https://github.com/nholthaus/units#namespaces>" __ 中找到。

source: The units library is a header-only library. You must include the relevant header in your source files for the units you want to use. Here's a list of available units.
zh_cn: 单位库是仅有标头的库。您必须在源文件中包含要使用的单位的相关标头。下面是可用单位的列表。
