Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/basic-programming/functions-*-data.po
Languages: fr_ca

source: ``runOnce`` expects us to give it a ``std::function<void()>`` parameter (named ``action``). A ``std::function<void()>`` is the C++ type for a ``std::function`` that takes no parameters and returns no value (the template parameter, ``void()``, is a function type with no parameters and no return value). When we call ``runOnce``, we need to give it a function with no parameters and no return value. C++ lacks a clean way to refer to existing class methods in a way that can automatically be converted to a ``std::function``, so the typical way to do this is to define a new function inline with a "lambda expression".
fr_ca: ``runOnce`` attend que nous lui donnions un paramètre ``std::function<void()>`` (nommé ``action``). Un ``std::function<void()>`` est le type C++ pour une ``std::function`` qui ne prend aucun paramètre et ne renvoie aucune valeur (le paramètre du modèle, ``void()`` est un type de fonction sans paramètres ni valeur de retour). Lorsque nous appelons ``runOnce``, nous devons lui donner une fonction sans paramètres ni valeur de retour. C++ ne dispose pas d'un moyen simple de faire référence aux méthodes de classe existantes d'une manière qui puisse être automatiquement convertie en ``std::function``, donc la manière typique de le faire est de définir une nouvelle fonction en ligne avec une "expression lambda".

source: Lambda Expressions in C++
fr_ca: Expressions lambda en C++

source: To pass a function to ``runOnce``, we need to write a short inline function expression using a special syntax that resembles ordinary C++ function declarations, but varies in a few important ways:
fr_ca: Pour passer une fonction à ``runOnce``, nous devons écrire une courte expression de fonction en ligne en utilisant une syntaxe spéciale qui ressemble aux déclarations de fonctions C++ ordinaires, mais qui varie de plusieurs manières importantes:

source: C++ calls ``[captures] (params) { body; }`` a "lambda expression". It has three parts: a *capture list* (square brackets), an optional *parameter list* (parentheses), and a *function body* (curly brackets). It may look a little strange, but the only real difference between a lambda expression and an ordinary function (apart from the lack of a function name) is the addition of the capture list.
fr_ca: C++ appelle ``[captures] (params) { body; }`` une "expression lambda". Elle comporte trois parties : une *liste de capture* (crochets), une *liste de paramètres* facultative (parenthèses) et un *corps de fonction* (accolades). Cela peut paraître un peu étrange, mais la seule vraie différence entre une expression lambda et une fonction ordinaire (mis à part l'absence de nom de fonction) est l'ajout de la liste de capture.

source: Since ``RunOnce`` wants a function with no parameters and no return value, our lambda expression has no parameter list and no return statement. The "lambda expression" here represents a function that calls ``drivetrain.ArcadeDrive`` with a specific set of parameters - note again that the above code does not *call* the function, but merely defines it and passes it to the ``Command`` to be run later when the ``Command`` is scheduled.
fr_ca: Puisque ``RunOnce`` veut une fonction sans paramètres ni valeur de retour, notre expression lambda n'a pas de liste de paramètres ni d'instruction de retour. L'expression "lambda" représente ici une fonction qui appelle ``drivetrain.ArcadeDrive`` avec un ensemble spécifique de paramètres - notez encore que le code ci-dessus n'*appelle pas* la fonction, mais la définit simplement et la transmet à la `` Command`` à exécuter plus tard lorsque la ``Command`` est planifiée.

source: Capturing State in C++ Lambda Expressions
fr_ca: Capture de l'état dans les expressions lambda en C++

source: C++ has somewhat more-powerful semantics than Java. One cost of this is that we generally need to give the C++ compiler some help to figure out *how exactly* we want it to capture state from the enclosing scope. This is the purpose of the *capture list*. For the purposes of using the WPILibC Command-based framework, it is usually sufficient to use a capture list of ``[this]``, which gives access to members of the enclosing class by capturing the enclosing class's ``this`` pointer by value.
fr_ca: C++ a une sémantique un peu plus puissante que Java. L'un des coûts de cela est que nous devons généralement aider le compilateur C++ pour déterminer *comment exactement* nous voulons qu'il capture l'état de la portée englobante. C'est le but de la *liste de capture*. Pour utiliser le framework basé sur les commandes WPILibC, il suffit généralement d'utiliser une liste de capture de ``[this]``, qui donne accès aux membres de la classe englobante en capturant le pointeur ``this`` de la classe englobante par valeur.
