Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/basic-programming/joystick.po
Languages: fr_ca, tr_tr

source: Joysticks
fr_ca: Manettes (Joysticks)
tr_tr: Kumanda kolları

source: A joystick can be used with the Driver Station program to control the robot. Almost any "controller" that can be recognized by Windows can be used as a joystick. Joysticks are accessed using the ``GenericHID`` class. This class has three relevant subclasses for preconfigured joysticks. You may also implement your own for other controllers by extending ``GenericHID``. The first is ``Joystick`` which is useful for standard flight joysticks. The second is ``XboxController`` which works for the Xbox 360, Xbox One, or Logitech F310 (in XInput mode). Finally, the ``PS4Controller`` class is ideal for using that controller. Each axis of the controller ranges from -1 to 1.
fr_ca: Un joystick peut être utilisé avec le programme Driver Station pour contrôler le robot. Presque tous les "contrôleurs" reconnus par Windows peuvent être utilisés comme joystick. Les manettes sont accessibles en utilisant la classe ``GenericHID``. Cette classe a trois sous-classes pertinentes pour les joysticks préconfigurés. Vous pouvez également implémenter le vôtre pour d'autres contrôleurs en étendant ``GenericHID``. Le premier est ``Joystick`` qui est utile pour les joysticks de pilotage aérien standard. Le second est ``XboxController`` qui fonctionne pour la Xbox 360, Xbox One ou Logitech F310 (en mode XInput). Enfin, la classe ``PS4Controller`` est idéale pour utiliser ce contrôleur. Chaque axe du contrôleur va de -1 à 1.
tr_tr: Oyun konsolları Driver Station - Sürücü İstasyonu programları ile birlikte robotu kontrol etmek için kullanılabilmektedir. Windows tarafından ttanınan neredeyse tüm "kumandalar" kumanda kolu olarak kullanılabilmektedir. Kumanda kollarına ``GenericHID`` sınıfı kullanılarak erişilebilmektedir. Bu sınıf, önceden yapılandırılmış kumandalar ilgili üç alt sınıfa sahiptir. ``GenericHID``'nin etki alanını genişleterek farklı kumandalar için kendi sınıflarınızı da ekleyebilirsiniz. İlk alt sınıf, standart uçuş kolları için kullanışlı ``Joystick`` sınıfıdır. İkincisi Xbox 360, Xbox One veya (XInput modundaki) Logitech F310 kumandaları için çalışan ``XboxController`` sınıfıdır. Sonuncusuysa DualShock4 kumandaları için ideal ``PS4Controller`` sınıfıdır. Kumandaların her ekseni -1 ile 1 değerleri arasındadır.

source: The command based way to use the these classes is detailed in the section: :ref:`docs/software/commandbased/binding-commands-to-triggers:Binding Commands to Triggers`.
tr_tr: Bu sınıfları komut temelli kullanma şekli :ref:`docs/software/commandbased/binding-commands-to-triggers:Binding Commands to Triggers` bölümünde daha detaylı bir şekilde belirtilmektedir.

source: Driver Station Joysticks
fr_ca: Joysticks du poste de conduite
tr_tr: Driver Station Kumanda Kolları

source: The 4th tab down on the left hand side is the USB devices tab.
fr_ca: Le 4e onglet en bas à gauche est l'onglet Périphériques USB.
tr_tr: Sol taraftaki 4. sekme USB cihazları sekmesidir.

source: The :ref:`USB Devices Tab <docs/software/driverstation/driver-station:USB Devices Tab>` of the Driver Station is used to setup and configure the joystick for use with the robot. Pressing a button on a joystick will cause its entry in the table to light up green. Selecting the joystick will show the values of axes, buttons, and the POV that can be used to determine the mapping between physical joystick features and axis or button numbers.
tr_tr: Driver Station'un :ref:`USB Cihazları Sekmesi <docs/software/driverstation/driver-station:USB Devices Tab>` kumanda kolunun robotta kullanımı için kurulumu ve yapılandırması için kullanılmaktadır. Kumandada bir tuşa basılması ekrandaki girişinin yeşil yanmasını sağlayacaktır. Kumandanın seçilmesi eksenlerin, tuşların ve fiziksel kumandanın özellikleri ile eksen veya tuş numaraları arasındaki eşleştirmeyi belirlemek için kullanılacak POV değerlerini gösterecektir.

source: On the USB tab the indicators light up to show what is currently being pressed.
fr_ca: Sur l'onglet USB, les indicateurs s'allument pour indiquer ce qui est actuellement enfoncé.
tr_tr: USB sekmesinde, o anda neye basıldığını gösteren göstergeler yanıyor.

source: The USB Devices Tab also assigns a joystick index to each joystick. To reorder the joysticks simply click and drag. The Driver Station software will try to preserve the ordering of devices between runs. It is a good idea to note what order your devices should be in and check each time you start the Driver Station software that they are correct.
fr_ca: L'onglet Périphériques USB attribue également un index de joystick à chaque joystick. Pour réorganiser les joysticks, cliquez simplement et faites glisser. Le logiciel Driver Station essaiera de préserver l'ordre des périphériques entre les exécutions. C'est une bonne idée de noter dans quel ordre vos appareils doivent être et de vérifier chaque fois que vous démarrez le logiciel Driver Station qu'ils sont corrects.
tr_tr: USB Cihazları Sekmesi ayrıca her kumandaya bir kumanda kolu indeksi atamaktadır. Kumandaları yeniden sıralamak için sadece kumandaya tıklayıp kaydırınız. Driver Station yazılımı, çalıştığı anlar dışında cihazların sırasını korumaya çalışacaktır. Cihazlarınızın ne sırada olması gerektiğini belirlemek ve Driver Station yazılımını her çalıştırdığınızda sıralamanın doğru olduğunu kontrol etmeniz iyi bir fikir olacaktır.

source: When the Driver Station is in disabled mode, it is routinely looking for status changes on the joystick devices. Unplugged devices are removed from the list and new devices are opened and added. When not connected to the FMS, unplugging a joystick will force the Driver Station into disabled mode. To start using the joystick again: plug the joystick in, check that it shows up in the right spot, then re-enable the robot. While the Driver Station is in enabled mode, it will not scan for new devices. This is a time consuming operation and timely update of signals from attached devices takes priority.
fr_ca: Lorsque la Driver Station est en mode désactivé, elle recherche régulièrement les changements d'état sur les dispositifs joysticks. Les appareils débranchés sont supprimés de la liste et de nouveaux appareils sont ouverts et ajoutés. Lorsqu'il n'est pas connecté au FMS, le fait de débrancher un joystick forcera la Driver Station en mode désactivé. Pour recommencer à utiliser le joystick : branchez le joystick, vérifiez qu'il s'affiche au bon endroit, puis réactivez le robot. Tant que la Driver Station est en mode activé, elle ne recherchera pas de nouveaux périphériques. Il s'agit d'une opération qui prend du temps et la mise à jour rapide des signaux des appareils connectés est prioritaire.
tr_tr: Driver Station kapalı konumdayken düzenli aralıklarla kumanda kolu cihazlarındaki durum değişikliklerini aramaktadır. Fişlerinden çıkarılmış cihazlar listeden kaldırılmakta ve yeni cihazlar onların yerine açılmakta ve eklenmektedir. FMS'e bağlı değilken bir kumanda kolunun fişinden çıkarılması Driver Station'ı kapalı konuma getirecektir. Kumandayı. tekrar kullanmak için, kumandanın fişini takınız, olması gerektiği yerde göründüğünü kontrol ediniz ve sonrasında robotu tekrardan etkinleştiriniz. Driver Station etkin konumdayken yeni bir cihaz aramayacaktır. Bu zaman alıcı bir süreçtir ve bağlı cihazlardan gelen sinyallerin zamanlı güncellemeleri önceliklidir.

source: For some joysticks the startup routine will read whatever position the joysticks are in as the center position, therefore, when the computer is turned on (or when the joystick is plugged in) the joysticks should be at their center position.
fr_ca: Pour certains joysticks, la routine de démarrage lira quelle que soit la position des joysticks comme position centrale, par conséquent, lorsque l'ordinateur est allumé (ou lorsque le joystick est branché), les joysticks doivent être à leur position centrale.
tr_tr: Bazı kumandalar için başlangıç rutini kumandanın o anki durumunu varsayılan orta konum şeklinde okuyacaktır, bu sebeple bilgisayar açıkken (veya kumandalar bilgisayara bağlanmışken) kumanda kolunun istediğiniz orta konumda olması gerekmektedir.

source: When the robot is connected to the Field Management System at competition, the Driver Station mode is dictated by the :term:`FMS`. This means that you cannot disable your robot and the DS cannot disable itself in order to detect joystick changes. A manual complete refresh of the joysticks can be initiated by pressing the F1 key on the keyboard. Note that this will close and re-open all devices, so all devices should be in their center position as noted above.
fr_ca: Lorsque le robot est connecté au Field Management System en compétition, le mode Driver Station est dicté par le :term:`FMS`. Cela signifie que vous ne pouvez pas désactiver votre robot et que le DS ne peut pas se désactiver lui-même afin de détecter les changements de joystick. Un rafraîchissement manuel complet des joysticks peut être initié en appuyant sur la touche F1 du clavier. Notez que cela fermera et rouvrira tous les manettes, donc celles-ci doivent être dans leur position centrale comme indiqué ci-dessus.
tr_tr: Robot, müsabaka sırasında Sha Yönetimi Sistemine bağlıyken Driver Station modu :term:`FMS` tarafından yönetilmektedir. Diğer bir deyişle ne siz robotunuzu devre dışı bırakabilirsiniz ne de Driver Station kumandadaki değişiklikleri algılamak için kendisini devre dışı bırakabilir. Elle yapılacak tam bir kumanda yenilemesi, klavyedeki F1 tuşuna basarak gerçekleştirilebilmektedir. Bu işlemin tüm cihazları kapatıp yeniden açacağını, bu yüzden tüm cihazların yukarıda bahsi geçen orta konumda olması gerektiğiniz unutmayınız.

source: ``Joystick`` Class
fr_ca: Classe ``Joystick``
tr_tr: ``Joystick`` Sınıfı

source: A Logitech flight stick with an explanation of the axis values and buttons.
fr_ca: Une manette Logitech utilisé pour le pilotage aérien avec une explication des valeurs des axes et des boutons.
tr_tr: Eksen değerleri ve tuşları açıklanan bir Logitech uçuş kolu.

source: The ``Joystick`` class is designed to make using a flight joystick to operate the robot significantly easier. Depending on the flight joystick, the user may need to set the specific X, Y, Z, and Throttle channels that your flight joystick uses. This class offers special methods for accessing the angle and magnitude of the flight joystick.
fr_ca: La classe ``Joystick`` est conçue pour faciliter considérablement l'utilisation d'un joystick de pilotage aérien pour faire fonctionner le robot. Selon le joystick, l'utilisateur peut avoir besoin de définir les canaux X, Y, Z et Throttle spécifiques que votre joystick de pilotage aérien utilise. Cette classe propose des méthodes spéciales pour accéder à l'angle et à la magnitude du joystick.
tr_tr: ``Joystick`` sınıfı, uçuş kolunun kullanımını ve robotun yönetimini kayda değer bir şekilde kolaylaştırmak için tasarlanmıştır. Uçuş koluna göre kullanıcının uçuş kolunuzun kullandığı özel X, Y, Z ve Throttle - Gaz kanalları belirlemesi gerekebilmektedir. Bu sınıf uçuş kanalının açısı ve şiddetine erişimi sağlayan özel metodlar sunmaktadır

source: Due to differences in coordinate systems, teams usually negate the values when reading joystick axes. See the :ref:`docs/software/basic-programming/coordinate-system:Joystick and controller coordinate system` section for more detail.
tr_tr: Koordinat sistemindeki farklar sebebiyle takımlar kumanda kolu eksenlerini okurken genellikle değerlerin olumsuzlarını almaktadır. Daha fazla bilgi için bkz. :ref:`docs/software/basic-programming/coordinate-system:Joystick and controller coordinate system`.

source: ``XboxController`` Class
fr_ca: Classe ``XboxController``
tr_tr: ``XboxController`` Sınıfı

source: Original Xbox Controller.
fr_ca: Manette Xbox d'origine.
tr_tr: Orijinal Xbox Kumandası

source: The ``XboxController`` class provides named methods (e.g. ``getXButton``, ``getXButtonPressed``, ``getXButtonReleased``) for each of the buttons, and the indices can be accessed with ``XboxController.Button.kX.value``. The rumble feature of the controller can be controlled by using ``XboxController.setRumble(GenericHID.RumbleType.kRightRumble, value)``. Many users do a split stick arcade drive that uses the left stick for just forwards / backwards and the right stick for left / right turning.
tr_tr: ``XboxController`` sınıfı, her bir tuş için ( ``getXButton``, ``getXButtonPressed``, ``getXButtonReleased`` gibi) isimli metodlar sunmakta ve indekslere ``XboxController.Button.kX.value`` ile erişilebilmektedir. Kumandanın titreşim özelliği ``XboxController.setRumble(GenericHID.RumbleType.kRightRumble, value)`` kullanılarak ayarlanabilmektedir. Birçok kullanıcı sol kolun adece ileri / geri, sağ kolunsa sadece sağ / sol dönüşlerin için kullanıldığı "split stick arcade drive"ı tercih etmektedir.

source: ``PS4Controller`` Class
fr_ca: Classe ``PS4Controller``
tr_tr: ``PS4Controller`` Sınıfı

source: PlayStation 4 controller.
fr_ca: Manette PlayStation 4.
tr_tr: PlayStation 4, DualShock 4, kumandası.

source: The ``PS4Controller`` class provides named methods (e.g. ``getSquareButton``, ``getSquareButtonPressed``, ``getSquareButtonReleased``) for each of the buttons, and the indices can be accessed with ``PS4Controller.Button.kSquare.value``. The rumble feature of the controller can be controlled by using ``PS4Controller.setRumble(GenericHID.RumbleType.kRightRumble, value)``.
tr_tr: ``PS4Controller`` sınıfı, her bir tuş için ( ``getSquareButton``, ``getSquareButtonPressed``, ``getSquareButtonReleased`` gibi) isimli metodlar sunmakta ve indekslere ``PS4Controller.Button.kSquare.value`` ile erişilebilmektedir. Kumandanın titreşim özelliği ``PS4Controller.setRumble(GenericHID.RumbleType.kRightRumble, value)`` kullanılarak ayarlanabilmektedir.

source: The angles used by the code of the POV/D-pad with 0 at the top and continuing clockwise.
fr_ca: Les angles utilisés par le code du POV/D-pad avec 0 en haut et en continuant dans le sens des aiguilles d'une montre.
tr_tr: 0 en yukarda ve diğer açıların saat yönünde devam ettiği, POV/D-pad'in kodu tarafından kullanılan açılar.

source: ``GenericHID`` Usage
fr_ca: Utilisation de ``GenericHID``
tr_tr: ``GenericHID`` Kullanımı

source: An axis can be used with ``.getRawAxis(int index)`` (if not using any of the classes above) that returns the current value. Zero and one in this example are each the index of an axis as found in the Driver Station mentioned above.
tr_tr: Bir eksen (yukardaki sınıflardan herhangi biri kullanılmıyorsa) anlık değeri tekrarlayan ``.getRawAxis(int index)`` ile kullanılabilmektedir. Bu örnekte sıfır ve bir yukarıda bahsi geçen Driver Station'da bulunan eksenlerden her birinin bir indeksidir.

source: Button Usage
fr_ca: Utilisation des boutons
tr_tr: Tuş Kullanımı

source: Usage such as the following is for code not using the command-based framework. For button usage in the command-based framework, see :ref:`docs/software/commandbased/binding-commands-to-triggers:Binding Commands to Triggers`.
tr_tr: Aşağıdaki gibi bir kullanım komut temelli bir çerçeve kullanmayan kodlar içindir. Komut temelli çerçeve içerisinde tuş kullanımı için bkz. :ref:`docs/software/commandbased/binding-commands-to-triggers:Binding Commands to Triggers`.

source: A common request is to toggle something on and off with the press of a button. Toggles should be used with caution, as they require the user to keep track of the robot state.
fr_ca: Une demande courante consiste à activer et désactiver quelque chose en appuyant sur un bouton. Les bascules doivent être utilisées avec prudence, car elles obligent l'utilisateur à suivre l'état du robot.
tr_tr: Yaygın bir iste bir tuşa basıldığında bir şeyin açılması veya kapatılmasıdır. Açma/kapamalar, kullanıcının robotun durumunu takip etmesini gerektirdiği için, dikkatli bir şekilde kullanılmalıdır.

source: The :ref:`USB Devices Tab <docs/software/driverstation/driver-station:USB Devices Tab>` of the Driver Station is used to setup and configure the joystick for use with the robot. Pressing a button on a joystick will cause its entry in the table to light up green. Selecting the joystick will show the values of axes, buttons and the POV that can be used to determine the mapping between physical joystick features and axis or button numbers.
fr_ca: L'onglet :ref:`USB Devices <docs/software/driverstation/driver-station:USB Devices Tab>` de Driver Station est utilisé pour installer et configurer le joystick à utiliser avec le robot. En appuyant sur un bouton d'un joystick, son entrée dans le tableau s'allumera en vert. La sélection du joystick affichera les valeurs des axes, des boutons et le PDV qui peuvent être utilisés pour déterminer le mappage entre les caractéristiques physiques du joystick et les numéros d'axe ou de bouton.

source: An example of how to use buttons on the ``XboxController``.
fr_ca: Un exemple d'utilisation des boutons sur le ``XboxController``.

source: On joysticks, the POV is a directional hat that can select one of 8 different angles or read -1 for unpressed. The XboxController D-pad works the same as a POV. Be careful when using a POV with exact angle requirements as it is hard for the user to ensure they select exactly the angle desired.
fr_ca: Sur les joysticks, le POV est un élément directionnel qui peut sélectionner l'un des 8 angles différents ou lire -1 pour non enfoncé. Le D-pad XboxController fonctionne de la même manière qu'un POV. Soyez prudent lorsque vous utilisez un POV avec des exigences d'angle exactes car il est difficile pour l'utilisateur de s'assurer qu'il sélectionne exactement l'angle souhaité.

source: An axis can be used with ``.getRawAxis(0)`` (if not using any of the classes above) that returns the current value. Zero and one in this example are each the index of an axis as found in the Driver Station mentioned above.
fr_ca: Un axe peut être utilisé avec ``.getRawAxis(0)`` (si vous n'utilisez aucune des classes ci-dessus) qui renvoie la valeur actuelle. Zéro et un dans cet exemple sont chacun l'indice d'un axe tel qu'il se trouve dans la Driver Station mentionnée ci-dessus.

source: Unlike an axis, you will usually want to use the ``pressed`` and ``released`` methods to respond to button input. These will return true if the button has been activated since the last check. This is helpful for taking an action once when the event occurs but not having to continuously do it while the button is held down.
fr_ca: Contrairement à un axe, vous souhaiterez généralement utiliser les méthodes ``pressed`` et ``released`` pour répondre à l'entrée du bouton. Ceux-ci retourneront vrai si le bouton a été activé depuis la dernière vérification. Ceci est utile pour entreprendre une action une seule fois lorsque l'événement se produit, mais sans avoir à le faire continuellement pendant que le bouton est maintenu enfoncé.
