Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/basic-programming/reading-stacktraces.po
Languages: es_mx, fr_ca

source: Reading Stacktraces
es_mx: Leyendo Stacktraces
fr_ca: Lecture des traces de pile (StackTraces)

source: ``An unexpected error has occurred.``
es_mx: ``Ha ocurrido un error inesperado.``
fr_ca: ``Une erreur inattendue s'est produite.``

source: When your robot code hits an unexpected error, you will see this message show up in some console output (Driver Station or RioLog). You'll probably also notice your robot abruptly stop, or possibly never move. These unexpected errors are called *unhandled exceptions*.
es_mx: Cuando el código de su robot encuentra un error inesperado, verá este mensaje aparecer en alguna salida de la consola (Driver Station o RioLog). Probablemente también notará que su robot se detiene abruptamente, o posiblemente nunca se mueva. Estos errores inesperados se denominan *unhandled exceptions*.
fr_ca: Lorsque le code de votre robot rencontre une erreur inattendue, vous verrez ce message s'afficher dans certaines sorties de la console (Driver Station ou RioLog). Vous remarquerez probablement aussi que votre robot s'arrête brusquement, ou ne bouge peut-être jamais. Ces erreurs inattendues sont appelées *exceptions non gérées*.

source: When an unhandled exception occurs, it means that your code has one or more bugs which need to be fixed.
es_mx: Cuando se produce una excepción no controlada, significa que su código tiene uno o más errores que deben corregirse.
fr_ca: Lorsqu'une exception non gérée se produit, cela signifie que votre code contient un ou plusieurs bogues qui doivent être corrigés.

source: This article will explore some of the tools and techniques involved in finding and fixing those bugs.
es_mx: Este artículo explorará algunas de las herramientas y técnicas involucradas en encontrar y corregir esos errores.
fr_ca: Cet article explorera certains des outils et techniques impliqués dans la recherche et la correction de ces bogues.

source: What's a "Stack Trace"?
es_mx: ¿Qué es un "Stack Trace"?
fr_ca: Qu'est-ce qu'une «trace de pile»?

source: The ``unexpected error has occurred`` message is a signal that a *stack trace* has been printed out.
es_mx: El mensaje ``unexpected error has occurred`` es una señal de que se ha impreso un *stack trace*.
fr_ca: Le message ``une erreur inattendue s'est produite`` est un signal qu'une *trace de pile* a été imprimée.

source: In Java and C++, a `stack <https://en.wikipedia.org/wiki/Call_stack>`_ data structure is used to store information about which function or method is currently being executed.
es_mx: En Java y C ++, una estructura de datos `stack <https://en.wikipedia.org/wiki/Call_stack>`_ se utiliza para almacenar información sobre qué función o método se está ejecutando actualmente.
fr_ca: En Java et C++, une structure de données `stack <https://en.wikipedia.org/wiki/Call_stack>`_ est utilisée pour stocker des informations sur la fonction ou la méthode en cours d'exécution.

source: A *stack trace* prints information about what was on this stack when the unhandled exception occurred. This points you to the lines of code which were running just before the problem happened. While it doesn't always point you to the exact *root cause* of your issue, it's usually the best place to start looking.
es_mx: Un *stack trace* imprime información acerca de lo que estaba sucediendo en el programa cuando la excepción sin manejar ocurrió. Esto apunto a las lineas de código que estaban ejecutándose justo antes de que el problema pasara. Mientras que no siempre apunta a los puntos exactos que son la *causa principal* de su problema, normalmente es el mejor lugar para empezar a buscar.
fr_ca: Une *trace de pile* imprime des informations sur ce qui se trouvait sur cette pile lorsque l'exception non gérée s'est produite. Cela vous indique les lignes de code qui s'exécutaient juste avant que le problème ne se produise. Bien que cela ne vous indique pas toujours la *cause principale* exacte de votre problème, c'est généralement le meilleur endroit pour commencer à chercher.

source: What's an "Unhandled Exception"?
es_mx: ¿Qué es una "Unhandled Exception"?
fr_ca: Qu'est-ce qu'une «exception non gérée»?

source: An unrecoverable error is any condition which arises where the processor cannot continue executing code. It almost always implies that, even though the code compiled and started running, it no longer makes sense for execution to continue.
es_mx: Un error irrecuperable es cualquier condición que se manifieste donde el procesador no puede continuar ejecutando código. Casi siempre implica que, a pesar de que el código haya sido compilado y se está ejecutando, no hace sentido que la ejecución continúe.
fr_ca: Une erreur irrécupérable est une condition qui survient dans laquelle le processeur ne peut pas continuer à exécuter du code. Cela implique presque toujours que, même si le code a été compilé et a commencé à s'exécuter, il n'est plus logique que l'exécution se poursuive.

source: In almost all cases, the root cause of an unhandled exception is code that isn't correctly implemented. It almost never implies that any hardware has malfunctioned.
es_mx: En casi todos los casos, la raíz de la excepción no manejada es que el código no está correctamente implementado. Casi nunca implica que cualquier parte del hardware no esté funcionando.
fr_ca: Dans presque tous les cas, la cause première d'une exception non gérée est un code qui n'est pas correctement implémenté. Cela n'implique presque jamais qu'un matériel a mal fonctionné.

source: So How Do I Fix My Issue?
es_mx: ¿Cómo resuelvo mi problema?
fr_ca: Alors, comment puis-je résoudre mon problème ?

source: Read the Stack Trace
es_mx: Leyendo el Stack Trace
fr_ca: Lire la trace de la pile

source: To start, search above the ``unexpected error has occurred`` for the stack trace.
es_mx: Para empezar, busque arriba de ``unexpected error has occurred`` para el stack trace.
fr_ca: Pour commencer, recherchez au-dessus de ``unexpected error has occurred`` la trace de la pile.

source: In Java, it should look something like this:
es_mx: En Java, debería verse como algo así:
fr_ca: En Java, cela devrait ressembler à ceci :

source: There's a few important things to pick out of here:
es_mx: Hay algunas cosas importantes que entender de aquí:
fr_ca: Il y a quelques éléments importants à retenir ici :

source: There was an ``Error``
es_mx: Hubo un ``Error``
fr_ca: Il y a eu une ``Erreur``

source: The error was due to an ``Unhandled exception``
es_mx: El error se provocó por una ``Excepción no manejada``
fr_ca: L'erreur était due à une ``Exception non gérée`` (Unhandled Exception)

source: The exception was a ``java.lang.NullPointerException``
es_mx: La excepción fue un ``java.lang.NullPointerException``
fr_ca: L'exception était une ``java.lang.NullPointerException``

source: The error happened while running line ``24`` inside of ``Robot.java``
es_mx: El error ocurrió mientras se ejecutaba la línea ``24`` adentro de ``Robot.java``
fr_ca: L'erreur s'est produite lors de l'exécution de la ligne ``24`` à l'intérieur de ``Robot.java``

source: ``robotInit`` was the name of the method executing when the error happened.
es_mx: ``robotInit`` era el nombre de el método que se estaba ejecutando cuando el error sucedió.
fr_ca: ``robotInit`` était le nom de la méthode en cours d'exécution lorsque l'erreur s'est produite.

source: ``robotInit`` is a function in the ``frc.robot.Robot`` package (AKA, your team's code)
es_mx: ``robotInit`` es una función en el paquete de ``frc.robot.Robot`` (AKA, el código de su equipo)
fr_ca: ``robotInit`` est une fonction du package ``frc.robot.Robot`` (AKA, le code de votre équipe)

source: ``robotInit`` was called from a number of functions from the ``edu.wpi.first.wpilibj`` package (AKA, the WPILib libraries)
fr_ca: ``robotInit`` a été appelé à partir d'un certain nombre de fonctions du package ``edu.wpi.first.wpilibj`` (AKA, les bibliothèques WPILib)

source: The list of indented lines starting with the word ``at`` represent the state of the *stack* at the time the error happened. Each line represents one method, which was *called by* the method right below it.
fr_ca: La liste des lignes en retrait commençant par le mot ``at`` représente l'état de la *pile* au moment où l'erreur s'est produite. Chaque ligne représente une méthode, qui a été *appelée par* la méthode juste en dessous.

source: For example, If the error happened deep inside your codebase, you might see more entries on the stack:
fr_ca: Par exemple, si l'erreur s'est produite profondément dans votre base de code, vous pourriez voir plus d'entrées sur la pile:

source: In this case: ``robotInit`` called ``fooInit``, which in turn called ``barInit``, which in turn called ``buggyMethod``. Then, during the execution of ``buggyMethod``, the ``NullPointerException`` occurred.
fr_ca: Dans ce cas : ``robotInit`` appelé ``fooInit``, qui à son tour appelé ``barInit``, qui à son tour appelé ``buggyMethod``. Ensuite, lors de l'exécution de ``buggyMethod``, l'``NullPointerException`` s'est produite.

source: Java will usually produce stack traces automatically when programs run into issues. C++ will require more digging to extract the same info. Usually, a single-step debugger will need to be hooked up to the executing robot program.
fr_ca: Java produira généralement des traces de pile automatiquement lorsque les programmes rencontrent des problèmes. C++ nécessitera plus de fouilles pour extraire les mêmes informations. Habituellement, un débogueur en une seule étape devra être connecté au programme du robot en cours d'exécution.

source: Stack traces can be found in the debugger tab of VS Code:
fr_ca: Les traces de pile peuvent être trouvées dans l'onglet du débogueur de VS Code:

source: VS Code Stack Trace location
fr_ca: Emplacement de trace de la pile VS Code

source: Stack traces in C++ will generally look similar to this:
fr_ca: Les traces de pile en C++ ressembleront généralement à ceci:

source: Stack Trace associated with a null-related error
fr_ca: Trace de pile associée à une erreur liée à la valeur NULL

source: The code execution is currently paused.
fr_ca: L'exécution du code est actuellement en pause.

source: The reason it paused was one thread having an ``exception``
fr_ca: La raison pour laquelle il s'est arrêté était un thread ayant une ``exception``

source: The error happened while running line ``20`` inside of ``Robot.cpp``
fr_ca: L'erreur s'est produite lors de l'exécution de la ligne ``20`` à l'intérieur de ``Robot.cpp``

source: ``RobotInit`` was the name of the method executing when the error happened.
fr_ca: ``RobotInit`` était le nom de la méthode en cours d'exécution lorsque l'erreur s'est produite.

source: ``RobotInit`` is a function in the ``Robot::`` namespace (AKA, your team's code)
fr_ca: ``RobotInit`` est une fonction dans l'espace de noms ``Robot ::`` (AKA, le code de votre équipe)

source: ``RobotInit`` was called from a number of functions from the ``frc::`` namespace (AKA, the WPILib libraries)
fr_ca: ``RobotInit`` a été appelé à partir d'un certain nombre de fonctions de l'espace de noms ``frc::`` (AKA, les bibliothèques WPILib)

source: This "call stack" window represents the state of the *stack* at the time the error happened. Each line represents one method, which was *called by* the method right below it.
fr_ca: Cette fenêtre "call stack" représente l'état de la *pile* au moment où l'erreur s'est produite. Chaque ligne représente une méthode, qui a été *appelée par* la méthode juste en dessous.

source: The examples in this page assume you are running code examples in simulation, with the debugger connected and watching for unexpected errors. Similar techniques should apply while running on a real robot.
fr_ca: Les exemples de cette page supposent que vous exécutez des exemples de code en simulation, avec le débogueur connecté et surveillant les erreurs inattendues. Des techniques similaires devraient s'appliquer lors de l'exécution sur un vrai robot.

source: Perform Code Analysis
fr_ca: Effectuer une analyse de code

source: Once you've found the stack trace, and found the lines of code which are triggering the unhandled exception, you can start the process of determining root cause.
fr_ca: Une fois que vous avez trouvé la trace de la pile et trouvé les lignes de code qui déclenchent l'exception non gérée, vous pouvez commencer le processus de détermination de la cause première.

source: Often, just looking in (or near) the problematic location in code will be fruitful. You may notice things you forgot, or lines which don't match an example you're referencing.
fr_ca: Souvent, le simple fait de regarder dans (ou à proximité) l'emplacement problématique dans le code sera fructueux. Vous remarquerez peut-être des choses que vous avez oubliées ou des lignes qui ne correspondent pas à un exemple auquel vous faites référence.

source: Developers who have lots of experience working with code will often have more luck looking at code than newer folks. That's ok, don't be discouraged! The experience will come with time.
fr_ca: Les développeurs qui ont beaucoup d'expérience avec le code auront souvent plus de chance d'examiner le code que les nouveaux. C'est bon, ne vous découragez pas ! L'expérience viendra avec le temps.

source: A key strategy for analyzing code is to ask the following questions:
fr_ca: Une stratégie clé pour analyser le code consiste à poser les questions suivantes :

source: What has changed in the code between the last working version, and now?
fr_ca: Qu'est-ce qui a changé dans le code entre la dernière version de travail et maintenant?

source: Frequent testing and careful code changes help make this particular strategy more effective.
fr_ca: Des tests fréquents et des modifications minutieuses du code contribuent à rendre cette stratégie particulière plus efficace.

source: Run the Single Step Debugger
fr_ca: Exécuter le débogueur en une seule étape

source: Sometimes, just looking at code isn't enough to spot the issue. The :ref:`single-step debugger <docs/software/vscode-overview/debugging-robot-program:Debugging a Robot Program>` is a great option in this case - it allows you to inspect the series of events leading up to the unhandled exception.
fr_ca: Parfois, il ne suffit pas de regarder le code pour détecter le problème. Le :ref:`débogueur en une seule étape <docs/software/vscode-overview/debugging-robot-program:Debugging a Robot Program>` est une excellente option dans ce cas - il vous permet d'inspecter la série d'événements menant à l'exception non gérée.

source: Search for More Information
fr_ca: Rechercher plus d'informations

source: Seeking Outside Help
fr_ca: Chercher de l'aide extérieure

source: If all else fails, you can seek out advice and help from others (both in-person and online). When working with folks who aren't familiar with your codebase, it's very important to provide the following information:
fr_ca: Si tout le reste échoue, vous pouvez demander des conseils et de l'aide aux autres (en personne et en ligne). Lorsque vous travaillez avec des personnes qui ne connaissent pas votre base de code, il est très important de fournir les informations suivantes:

source: Access to your source code, (EX: :ref:`on github.com <docs/software/basic-programming/git-getting-started:Git Version Control Introduction>`)
fr_ca: Accès à votre code source, (Ex: :ref:`on github.com <docs/software/basic-programming/git-getting-started:Git Version Control Introduction>`)

source: The **full text** of the error, including the full stack trace.
fr_ca: Le **texte complet** de l'erreur, y compris la trace de la pile complète.

source: Common Examples & Patterns
fr_ca: Exemples et modèles courants

source: There are a number of common issues which result in runtime exceptions.
fr_ca: Il existe un certain nombre de problèmes courants qui entraînent des exceptions d'exécution.

source: Null Pointers and References
fr_ca: Pointeurs nuls et références

source: Both C++ and Java have the concept of "null" - they use it to indicate something which has not yet been initialized, and does not refer to anything meaningful.
fr_ca: C++ et Java ont tous deux le concept de "null" - ils l'utilisent pour indiquer quelque chose qui n'a pas encore été initialisé, et ne fait référence à rien de significatif.

source: Manipulating a "null" reference will produce a runtime error.
fr_ca: La manipulation d'une référence "null" produira une erreur d'exécution.

source: For example, consider the following code:
fr_ca: Par exemple, considérons le code suivant:

source: When run, you'll see output that looks like this:
fr_ca: Lors de l'exécution, vous verrez une sortie qui ressemble à ceci:

source: Reading the stack trace, you can see that the issue happened inside of the ``robotInit()`` function, on line 23, and the exception involved "Null Pointer".
fr_ca: En lisant la trace de la pile, vous pouvez voir que le problème s'est produit à l'intérieur de la fonction ``robotInit()``, à la ligne 23, et que l'exception impliquait "Null Pointer".

source: By going to line 23, you can see there is only one thing which could be null - ``armMotorCtrl``. Looking further up, you can see that the ``armMotorCtrl`` object is declared, but never instantiated.
fr_ca: En allant à la ligne 23, vous pouvez voir qu'il n'y a qu'une seule chose qui pourrait être nulle - ``armMotorCtrl``. En regardant plus haut, vous pouvez voir que l'objet ``armMotorCtrl`` est déclaré, mais jamais instancié.

source: Alternatively, you can step through lines of code with the single step debugger, and stop when you hit line 23. Inspecting the ``armMotorCtrl`` object at that point would show that it is null.
fr_ca: Alternativement, vous pouvez parcourir les lignes de code avec le débogueur en une seule étape et vous arrêter lorsque vous atteignez la ligne 23. L'inspection de l'objet ``armMotorCtrl`` à ce stade montrerait qu'il est nul.

source: In Simulation, this will show up in a debugger window that points to line 20 in the above buggy code.
fr_ca: Dans Simulation, cela apparaîtra dans une fenêtre de débogueur qui pointe vers la ligne 20 dans le code bogué ci-dessus.

source: You can view the full stack trace by clicking the debugger tab in VS Code:
fr_ca: Vous pouvez afficher la trace complète de la pile en cliquant sur l'onglet du débogueur dans VS Code:

source: The error is specific - our member variable ``motorRef`` was declared, but never assigned a value. Therefore, when we attempt to use it to call a method using the ``->`` operator, the exception occurs.
fr_ca: L'erreur est spécifique - notre variable membre ``motorRef`` a été déclarée, mais n'a jamais été affectée à une valeur. Par conséquent, lorsque nous essayons de l'utiliser pour appeler une méthode à l'aide de l'opérateur ``->``, l'exception se produit.

source: The exception states its type was ``nullptr``.
fr_ca: L'exception indique que son type était ``nullptr``.

source: Fixing Null Object Issues
fr_ca: Résoudre les problèmes d'objets nuls

source: Generally, you will want to ensure each reference has been initialized before using it. In this case, there is a missing line of code to instantiate the ``armMotorCtrl`` before calling the ``setInverted()`` method.
fr_ca: En règle générale, vous voudrez vous assurer que chaque référence a été initialisée avant de l'utiliser. Dans ce cas, il manque une ligne de code pour instancier le ``armMotorCtrl`` avant d'appeler la méthode ``setInverted()``.

source: A functional implementation could look like this:
fr_ca: Une implémentation fonctionnelle pourrait ressembler à ceci:

source: Divide by Zero
fr_ca: Division par zéro

source: It is not generally possible to divide an integer by zero, and expect reasonable results. Most processors (including the roboRIO) will raise an Unhandled Exception.
fr_ca: Il n'est généralement pas possible de diviser un nombre entier par zéro et d'attendre des résultats raisonnables. La plupart des processeurs (y compris le roboRIO) lèveront une exception non gérée.

source: Looking at the stack trace, we can see a ``java.lang.ArithmeticException: / by zero`` exception has occurred on line 24. If you look at the two variables which are used on the right-hand side of the ``=`` operator, you might notice one of them has been initialized to zero. Looks like someone forgot to update it! Furthermore, the zero-value variable is used in the denominator of a division operation. Hence, the divide by zero error happens.
fr_ca: En regardant la trace de la pile, nous pouvons voir une exception ``java.lang.ArithmeticException: / by zero`` s'est produite à la ligne 24. Si vous regardez les deux variables qui sont utilisées à droite du `` =``, vous remarquerez peut-être que l'un d'entre eux a été initialisé à zéro. On dirait que quelqu'un a oublié de le mettre à jour ! De plus, la variable de valeur nulle est utilisée dans le dénominateur d'une opération de division. Par conséquent, l'erreur de division par zéro se produit.

source: Alternatively, by running the single-step debugger and stopping on line 24, you could inspect the value of all variables to discover ``shoulderToElbow_in`` has a value of ``0``.
fr_ca: Alternativement, en exécutant le débogueur en une seule étape et en vous arrêtant à la ligne 24, vous pouvez inspecter la valeur de toutes les variables pour découvrir que ``shoulderToElbow_in`` a une valeur de ``0``.

source: Stack Trace associated with a divide by zero error
fr_ca: Trace de pile associée à une erreur de division par zéro

source: Looking at the message, we see the error is described as ``Integer division by zero``. If you look at the two variables which are used on the right-hand side of the ``=`` operator on line 20, you might notice one of them has been initialized to zero. Looks like someone forgot to update it! Furthermore, the zero-value variable is used in the denominator of a division operation. Hence, the divide by zero error happens.
fr_ca: En regardant le message, nous voyons que l'erreur est décrite comme ``Integer division by zero``. Si vous regardez les deux variables qui sont utilisées à droite de l'opérateur ``=`` à la ligne 20, vous remarquerez peut-être que l'une d'entre elles a été initialisée à zéro. On dirait que quelqu'un a oublié de la mettre à jour! De plus, la variable de valeur nulle est utilisée dans le dénominateur d'une opération de division. Par conséquent, l'erreur de division par zéro se produit.

source: Note that the error messages might look slightly different on the roboRIO, or on an operating system other than windows.
fr_ca: Notez que les messages d'erreur peuvent être légèrement différents sur le roboRIO ou sur un système d'exploitation autre que Windows.

source: Fixing Divide By Zero Issues
fr_ca: Résoudre les problèmes de division par zéro

source: Sometimes, you just need to use a different number other than 0.
fr_ca: Parfois, il vous suffit d'utiliser un nombre différent de 0.

source: Alternatively, if zero *is* a valid value, adding ``if/else`` statements around the calculation can help you define alternate behavior to avoid making the processor perform a division by zero.
fr_ca: Alternativement, si zéro *est* une valeur valide, l'ajout d'instructions ``if/else`` autour du calcul peut vous aider à définir un comportement alternatif pour éviter que le processeur effectue une division par zéro.
