Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/basic-programming/reading-stacktraces.po
Languages: es_mx, fr_ca

source: Finally, changing variable types to be ``float`` or ``double`` can help you get around the issue - floating-point numbers have special values like ``NaN`` to represent the results of a divide-by-zero operation. However, you may still have to handle this in code which consumes that calculation's value.
fr_ca: Enfin, changer les types de variables en ``float`` ou ``double`` peut vous aider à contourner le problème - les nombres à virgule flottante ont des valeurs spéciales comme ``NaN`` pour représenter les résultats d'une division par zéro opération. Cependant, vous devrez peut-être toujours gérer cela dans le code qui utilise la valeur de ce calcul.

source: HAL Resource Already Allocated
fr_ca: Ressource HAL déjà allouée

source: This stack trace shows that a ``edu.wpi.first.hal.util.AllocationException`` has occurred. It also gives the helpful message: ``PWM or DIO 0 previously allocated.``.
fr_ca: Cette trace de pile montre qu’une ``edu.wpi.first.hal.util.AllocationException`` s’est produite. Il donne également le message utile: ``PWM or DIO 0 previously allocated.`` ou ``PWM ou DIO préalablement alloué``.

source: In C++, you won't specifically see a stacktrace from this issue. Instead, you'll get messages which look like the following:
fr_ca: En C++, vous ne verrez pas spécifiquement de trace de pile de ce problème. Au lieu de cela, vous recevrez des messages qui ressemblent à ce qui suit :

source: The key thing to notice here is the string, ``PWM or DIO 0 previously allocated.``. That string is your primary clue that something in code has incorrectly "doubled up" on pin 0 usage.
fr_ca: La chose clé à noter ici est la chaîne de caractères,``PWM or DIO 0 previously allocated.``. Cette chaîne est votre principal indice que quelque chose dans le code a incorrectement "doublement assigné" l’utilisation de la broche 0.

source: The message example above was generated on a roboRIO. If you are running in simulation, it might look different.
fr_ca: L’exemple de message ci-dessus a été généré sur un roboRIO. Si vous l'exécutez en simulation, cela peut sembler différent.

source: Fixing HAL Resource Already Allocated Issues
fr_ca: Résoudre les problèmes de ressources HAL déjà allouées

source: ``HAL: Resource already allocated`` are some of the most straightforward errors to fix. Just spend a bit of time looking at the electrical wiring on the robot, and compare that to what's in code.
fr_ca: ``HAL : Resource already allocated`` sont quelques-unes des erreurs les plus simples à corriger. Passez juste un peu de temps à regarder le câblage électrique du robot et comparez-le à ce qui est dans le code.

source: In the example, the left motor controllers are plugged into PWM ports ``0`` and ``1``. Therefore, corrected code would look like this:
fr_ca: Dans l'exemple, les contrôleurs de moteur gauche sont branchés sur les ports PWM ``0`` et ``1``. Par conséquent, le code corrigé ressemblerait à ceci :

source: gradlew is not recognized...
fr_ca: gradlew n'est pas reconnu...

source: ``gradlew is not recognized as an internal or external command`` is a common error that can occur when the project or directory that you are currently in does not contain a ``gradlew`` file. This usually occurs when you open the wrong directory.
fr_ca: ``gradlew n'est pas reconnu comme une commande interne ou externe`` est une erreur courante qui peut se produire lorsque le projet ou le répertoire dans lequel vous vous trouvez actuellement ne contient pas de fichier ``gradlew``. Cela se produit généralement lorsque vous ouvrez le mauvais répertoire.

source: Image containing that the left-hand VS Code sidebar does not contain gradlew
fr_ca: Image indiquant que la barre latérale gauche de VS Code ne contient pas gradlew

source: In the above screenshot, you can see that the left-hand sidebar does not contain many files. At a minimum, VS Code needs a couple of files to properly build and deploy your project.
fr_ca: Dans la capture d'écran ci-dessus, vous pouvez voir que la barre latérale de gauche ne contient pas beaucoup de fichiers. Au minimum, VS Code a besoin de quelques fichiers pour créer et déployer correctement votre projet.

source: If you do not see any one of the above files in your project directory, then you have two possible causes.
fr_ca: Si vous ne voyez aucun des fichiers ci-dessus dans votre répertoire de projet, alors vous avez deux causes possibles.

source: A corrupt or bad project.
fr_ca: Un projet corrompu ou mauvais.

source: You are in the wrong directory.
fr_ca: Vous êtes dans le mauvais répertoire.

source: Fixing gradlew is not recognized...
fr_ca: La correction de gradlew n'est pas reconnue...

source: ``gradlew is not recognized...`` is a fairly easy problem to fix. First identify the problem source:
fr_ca: ``gradlew n'est pas reconnu...`` est un problème assez facile à résoudre. Identifiez d'abord la source du problème :

source: **Are you in the wrong directory?** - Verify that the project directory is the correct directory and open this.
fr_ca: **Êtes-vous dans le mauvais répertoire ?** - Vérifiez que le répertoire du projet est le bon répertoire et ouvrez-le.

source: **Is your project missing essential files?** - This issue is more complex to solve. The recommended solution is to :ref:`recreate your project <docs/software/vscode-overview/creating-robot-program:Creating a Robot Program>` and manually copy necessary code in.
fr_ca: **Votre projet manque-t-il des fichiers essentiels ?** - Ce problème est plus complexe à résoudre. La solution recommandée est de :ref:`recréer votre projet <docs/software/vscode-overview/creating-robot-program:Creating a Robot Program>` et de copier manuellement le code nécessaire.
