Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/basic-programming/robot-preferences.po
Languages: fr_ca, ja

source: Setting Robot Preferences
fr_ca: Définition des préférences du robot
ja: ロボットのプリファレンスを設定する

source: The Robot Preferences (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Preferences.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_preferences.html>`__) class is used to store values in the flash memory on the roboRIO. The values might be for remembering preferences on the robot such as calibration settings for potentiometers, PID values, setpoints, etc. that you would like to change without having to rebuild the program. The values can be viewed on SmartDashboard or Shuffleboard and read and written by the robot program.
fr_ca: La classe Robot Preferences (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Preferences.html>`__, `C++ <https://first .wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_preferences.html>`__) est utilisée pour stocker des valeurs dans la mémoire flash du roboRIO. Les valeurs peuvent servir à mémoriser les préférences sur le robot telles que les paramètres d'étalonnage des potentiomètres, les valeurs PID, les points de consigne, etc. que vous souhaitez modifier sans avoir à reconstruire le programme. Les valeurs peuvent être visualisées sur SmartDashboard ou Shuffleboard et lues et écrites par le programme du robot.

source: This example shows how to utilize Preferences to change the setpoint of a PID controller and the P constant. The code examples are adapted from the Arm Simulation example (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation/Robot.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/ArmSimulation/cpp/Robot.cpp>`__). You can run the Arm Simulation example in the Robot Simulator to see how to use the preference class and interact with it using the dashboards without needing a robot.
fr_ca: Cet exemple montre comment utiliser les Préférences pour modifier le point de consigne d'un régulateur PID et la constante P. Les exemples de code sont adaptés de l'exemple Arm Simulation (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation/ Robot.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/ArmSimulation/cpp/Robot.cpp>`__). Vous pouvez exécuter l'exemple de simulation de bras dans le simulateur de robot pour voir comment utiliser la classe de préférences et interagir avec elle à l'aide des tableaux de bord sans avoir besoin d'un robot.
ja: この例では、PIDコントローラの設定値とP定数を変更するために「Preferences」を利用する方法を示します。コード例は、Arm Simulation の例 (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation/Robot.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/ArmSimulation/cpp/Robot.cpp>`__) から引用しています。ロボットシミュレータで Arm Simulation のサンプルを実行すると、ロボットがなくても「Preferences」クラスの使い方や、ダッシュボードを使ったインタラクションを確認することができます。

source: Initializing Preferences
fr_ca: Initialisation des préférences
ja: プリファレンスを初期化する

source: Preferences are stored using a name, the key. It's helpful to store the key in a constant, like ``kArmPositionKey`` and ``kArmPKey`` in the code above to avoid typing it multiple times and avoid typos. We also declare variables, ``kArmKp`` and ``armPositionDeg`` to hold the data retrieved from preferences.
fr_ca: Les préférences sont stockées sous un nom, la clé. Il est utile de stocker la clé dans une constante, comme ``kArmPositionKey`` et ``kArmPKey`` dans le code ci-dessus pour éviter de la taper plusieurs fois et d'éviter les fautes de frappe. Nous déclarons également des variables, ``kArmKp`` et ``armPositionDeg`` pour contenir les données récupérées à partir des préférences.
ja: プリファレンス (Preferences) は名前をキーとして保存されます。キーを複数回入力することやタイプミスを避けるために、定数である ``kArmPositionKey`` と ``kArmPKey`` のようなキーを保存することが役立ちます。変数 ``kArmKp`` と ``armPositionDeg`` も宣言し、設定から取得したデータを保持します。

source: In ``robotInit``, each key is checked to see if it already exists in the Preferences database. The ``containsKey`` method takes one parameter, the key to check if data for that key already exists in the preferences database. If it doesn't exist, a default value is written. The ``setDouble`` method takes two parameters, the key to write and the data to write. There are similar methods for other data types like booleans, ints, and strings.
fr_ca: Dans ``robotInit``, chaque clé est vérifiée pour voir si elle existe déjà dans la base de données des Préférences. La méthode ``containsKey`` prend un paramètre, la clé pour vérifier si les données pour cette clé existent déjà dans la base de données des préférences. S'il n'existe pas, une valeur par défaut est écrite. La méthode ``setDouble`` prend deux paramètres, la clé à écrire et les données à écrire. Il existe des méthodes similaires pour d'autres types de données comme les booléens, les entiers et les chaînes.
ja: ``robotInit`` 内では、各キーがPreferencesデータベースに既に存在するかどうかをチェックします。 ``containsKey`` メソッドは、そのキーのデータがPreferencesデータベースに既に存在するかどうかを確認するための1つのパラメータ、つまりキーを取ります。存在しない場合、デフォルト値が書き込まれます。 ``setDouble`` メソッドは、書き込むキーとデータの2つのパラメータを取ります。ブール値、整数、文字列などの他のデータ型に対する類似のメソッドもあります。

source: If using the Command Framework, this type of code could be placed in the constructor of a Subsystem or Command.
fr_ca: Si vous utilisez Command Framework, ce type de code peut être placé dans le constructeur d'un sous-système ou d'une commande.
ja: Command Frameworkを使用する場合、このタイプのコードはSubsystemまたはCommandのコンストラクタに配置することができます。

source: Reading Preferences
fr_ca: Préférences de lecture
ja: プリファレンスからの読み込み

source: Reading a preference is easy. The ``GetDouble`` method takes two parameters, the key to read, and a default value to use in case the preference doesn't exist. There are similar methods for other data types like booleans, ints, and strings.
fr_ca: Lire une préférence est facile. La méthode ``GetDouble`` prend deux paramètres, la clé à lire et une valeur par défaut à utiliser au cas où la préférence n'existerait pas. Il existe des méthodes similaires pour d'autres types de données comme les booléens, les entiers et les chaînes de caractères.

source: Depending on the data that is stored in preferences, you can use it when you read it, such as the proportional constant above. Or you can store it in a variable and use it later, such as the setpoint, which is used in ``telopPeriodic`` below.
fr_ca: Selon les données stockées dans les préférences, vous pouvez les utiliser lorsque vous les lisez, comme la constante proportionnelle ci-dessus. Ou vous pouvez le stocker dans une variable et l'utiliser plus tard, comme le point de consigne, qui est utilisé dans ``telopPeriodic`` ci-dessous.
ja: データが設定されている場合、プリファレンスに保存されたデータを読み取る際に使用できます。例えば、上記の比例定数 (P値) のように使用することができます。また、変数に保存して後で使用することもできます。例えば、下記の ``telopPeriodic`` で使用されるセットポイントのように使用することができます。

source: Using Preferences in SmartDashboard
fr_ca: Utilisation des préférences dans SmartDashboard
ja: SmartDashboardでプリファレンスを使用する

source: Displaying Preferences in SmartDashboard
fr_ca: Affichage des préférences dans SmartDashboard
ja: SmartDashboardでプリファレンスを表示する

source: Adding preferences from the Smartdashboard menu
fr_ca: Ajout de préférences depuis le menu Smartdashboard
ja: Smartdashboardメニューでプリファレンスを追加する

source: In the SmartDashboard, the Preferences display can be added to the display by selecting :guilabel:`View` then :guilabel:`Add...` then :guilabel:`Robot Preferences`. This reveals the contents of the preferences file stored in the roboRIO flash memory.
fr_ca: Dans le SmartDashboard, l'affichage des Préférences peut être ajouté à l'affichage en sélectionnant :guilabel:`View` puis :guilabel:`Add...` puis :guilabel:`Robot Preferences`. Cela révèle le contenu du fichier de préférences stocké dans la mémoire flash du roboRIO.
ja: SmartDashboardでは、 :guilabel:`View` を選択し、 :guilabel:`Add...` を選択し、 :guilabel:`Robot Preferences` を選択することで、Preferencesディスプレイを画面に追加することができます。これにより、roboRIOフラッシュメモリに保存されているプリファレンスファイルの内容が表示されます。

source: Editing Preferences in SmartDashboard
fr_ca: Modification des préférences dans SmartDashboard
ja: SmartDashboardでプリファレンスを編集する

source: Editing the robot preferences via the SmartDashboard widget.
fr_ca: Modification des préférences du robot via le widget SmartDashboard.
ja: SmartDashboardウィジェットを介してロボットのプリファレンスを編集する。

source: The values are shown here with the default values from the code. If the values need to be adjusted they can be edited here and saved.
fr_ca: Les valeurs sont affichées ici avec les valeurs par défaut du code. Si les valeurs doivent être ajustées, elles peuvent être modifiées ici et enregistrées.
ja: 値はここにコードからのデフォルト値と共に表示されます。値を調整する必要がある場合は、ここで編集して保存することができます。

source: Using Preferences in Shuffleboard
fr_ca: Utilisation des préférences dans Shuffleboard
ja: Shuffleboardでプリファレンスを利用する

source: Displaying Preferences in Shuffleboard
fr_ca: Affichage des préférences dans Shuffleboard
ja: Shuffleboardでプリファレンスを表示する

source: Adding preferences from the sources window in Shuffleboard
fr_ca: Ajout de préférences à partir de la fenêtre des sources dans Shuffleboard
ja: ソースウィンドウでプリファレンスをShuffleboardに追加する

source: In Shuffleboard, the Preferences display can be added to the display by dragging the preferences field from the sources window. This reveals the contents of the preferences file stored in the roboRIO flash memory.
fr_ca: Dans Shuffleboard, l'affichage des Préférences peut être ajouté à l'affichage en faisant glisser le champ des préférences depuis la fenêtre des sources. Cela révèle le contenu du fichier de préférences stocké dans la mémoire flash du roboRIO.
ja: Shuffleboardで、Preferencesディスプレイは、ソースウィンドウからPreferencesフィールドをドラッグして画面に追加することができます。これにより、roboRIOフラッシュメモリに保存されているプリファレンスファイルの内容が表示されます。

source: Editing Preferences in Shuffleboard
fr_ca: Modification des préférences dans Shuffleboard
ja: Shuffleboardでプリファレンスを編集する

source: Editing the robot preferences via the Shuffleboard widget.
fr_ca: Modification des préférences du robot via le widget Shuffleboard.
ja: Shuffleboardウィジェットを介してロボットのプリファレンスを編集する。

source: The values are shown here with the default values from the code. If the values need to be adjusted they can be edited here.
fr_ca: Les valeurs sont affichées ici avec les valeurs par défaut du code. Si les valeurs doivent être ajustées, elles peuvent être modifiées ici.
ja: 値はここにコードからのデフォルト値と共に表示されます。値を調整する必要がある場合は、ここで編集することができます。

source: The Robot Preferences (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Preferences.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_preferences.html>`__) class is used to store values in the flash memory on the roboRIO. The values might be for remembering preferences on the robot such as calibration settings for potentiometers, PID values, setpoints, etc. that you would like to change without having to rebuild the program. The values can be viewed on SmartDashboard or Shuffleboard and read and written by the robot program.
ja: ロボットの「Preferences」 (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Preferences.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_preferences.html>`__) クラスは、roboRIOのフラッシュメモリにデータを保存するために使用されます。これらのデータは、ポテンショメーターのキャリブレーション設定、PID値、セットポイントなど、プログラムを再ビルドせずに変更したいロボットの設定を記憶するために使用されます。これらのデータはSmartDashboardやShuffleboardで表示し、ロボットプログラムによって読み書きすることができます。

source: Reading a preference is easy. The ``getDouble`` method takes two parameters, the key to read, and a default value to use in case the preference doesn't exist. There are similar methods for other data types like booleans, ints, and strings.
ja: プリファレンスを読み込むことは簡単です。 ``getDouble`` メソッドは2つのパラメータを取ります。読み取るキーと、プリファレンスが存在しない場合に使用するデフォルト値です。ブール値、整数、文字列などの他のデータ型に対する類似したメソッドもあります。
