Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/basic-programming/using-test-mode.po
Languages: tr_tr

source: Using Test Mode
tr_tr: Test Modununun Kullanımı

source: Test mode is designed to enable programmers to have a place to put code to verify that all systems on the robot are functioning. In each of the robot program templates there is a place to add test code to the robot.
tr_tr: Test modu, programcıların kodlarını koyarak robottaki tüm sistemlerin çalıştığını doğrulayabilecekleri bir yer olmasına olanak tanımak için tasarlanmıştır. Robot program şablonlarının her birinde robota test kodu eklemek için bir yer vardır.

source: Enabling Test Mode
tr_tr: Test Modunun Etkinleştirilmesi

source: Selecting the "Test" button on the Driver Station and then "Enable".
tr_tr: Driver Station'daki "Test" seçeneğini ve ardından "Enable"ın seçilmesi.

source: Test mode on the robot can be enabled from the Driver Station just like autonomous or teleop. To enable test mode in the Driver Station, select the "Test" button and enable the robot. The test mode code will then run.
tr_tr: Robot'un test modu, tıpkı otonom veya teleop modlarında olduğu gibi Driver Station - Sürücü İstasyonundan etkinleştirilebilmektedir. Driver Station'da test modunu etkinleştirmek için "Test" seçeneğini seçip robotu etkinleştiriniz. Test modu kodu bu işlemleri takiben çalışacaktır.

source: Adding Test mode code to your robot code
tr_tr: Robot kodunuza Test modu kodu ekleme

source: When in test mode, the ``testInit`` method is run once, and the ``testPeriodic`` method is run once per tick, in addition to ``robotPeriodic``, similar to teleop and autonomous control modes.
tr_tr: Test modundayken, teleop ve otonom kontrol mdelerine benzer bir şekilde, ``testInit`` metodu bir kez çalıştırılmakta ve ``testPeriodic`` metodu, ``robotPeriodic``'in yanı sıra, tık başına bir kez çalıştırılmaktadır.

source: Adding test mode can be as painless as calling your already written Teleop methods from Test. Or you can write special code to try out a new feature that is only run in Test mode, before integrating it into your teleop or autonomous code. You could even write code to move all motors and check all sensors to help the pit crew!
tr_tr: Test modu eklemek, önceden yazılmış Teleop yöntemlerinizi Test'den çağırmak kadar zahmetsiz olabilir ya da teleop veya otonom kodunuza entegre etmeden önce yalnızca Test modunda çalışan yeni bir özelliği denemek için özel bir kod yazabilirsiniz. Hatta pit ekibine yardım etmek için tüm motorları hareket ettiren ve tüm sensörleri kontrol eden bir kod bile yazabilirsiniz!

source: LiveWindow in Test Mode
tr_tr: Test Modunda LiveWindow

source: Since 2024, LiveWindow in Test Mode is disabled by default! See :ref:`docs/software/dashboards/smartdashboard/test-mode-and-live-window/enabling-test-mode:Enabling LiveWindow in Test Mode` to enable it.
tr_tr: 20242den itibaren Test Modunda LiveWindow varsayılan olarak devre dışıdır! LiveWindow'u etkinleştirmek için bkz. :ref:`docs/software/dashboards/smartdashboard/test-mode-and-live-window/enabling-test-mode:Enabling LiveWindow in Test Mode`.

source: With LiveWindow, all actuator outputs can be controlled on the Dashboard and all sensor values can be seen. PID Controllers can also be tuned. The sensors and actuators are added automatically, no code is necessary. See :doc:`/docs/software/dashboards/smartdashboard/test-mode-and-live-window/index` for more details.
tr_tr: LiveWindow ile birlikte tüm aktüatör çıktıları Gösterge paneli üzerinden kontrol edilebilmekte ve tüm sensör değerleri görüntülenebilmektedir. PID Kontrolörleri de LiveWindow ile ayarlanabilmektedir. Sensörler ve aktüatörler kendi kendilerine eklenmekte, herhangi bir koda gerek olmamaktadır. Daha fazla bilgi için bkz. :doc:`/docs/software/dashboards/smartdashboard/test-mode-and-live-window/index`
