Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/layouts-with-code/configuring-widgets.po
Languages: es_mx, zh_cn

source: Configuring widgets
es_mx: Configurar widgets
zh_cn: 配置小部件

source: Robot programs can specify exactly which widget to use to display a data point, as well as how that widget should be configured. As there are too many widgets to be listed here, consult the docs for details.
es_mx: Los programas de robot pueden especificar exactamente qué widget usar para mostrar un punto de datos, así como debe configurarse ese widget. Como hay demasiados widgets para enumerarlos aquí, consulte los documentos para obtener más detalles.
zh_cn: 机器人程序可以准确指定要用于显示数据点的窗口小部件，以及应如何配置该窗口小部件。由于此处列出的小部件太多，请查阅文档以获取详细信息。

source: Specifying a widget
es_mx: Especificando un widget
zh_cn: 指定小部件

source: Call `withWidget` after `add` in the call chain:
es_mx: Llame a `withWidget` después de` add` en la cadena de llamadas:
zh_cn: 在调用链中的“添加”之后调用“ withWidget”：

source: In this example, we configure the "Max Speed" widget to use a slider to modify the values instead of a basic text field.
es_mx: En este ejemplo, configuramos el widget "Velocidad máxima" para usar un control deslizante para modificar los valores en lugar de un campo de texto básico.
zh_cn: 在此示例中，我们将“最大速度”窗口小部件配置为使用滑块而不是基本文本字段来修改值。

source: The max speed widget is placed but it correctly goes from -1 to 1.
zh_cn: 放置了最大速度小部件，但它正确地从 -1 变为 1。

source: Setting widget properties
es_mx: Configurar las propiedades del widget
zh_cn: 设置小部件属性

source: Since the maximum speed only makes sense to be a value from 0 to 1 (full stop to full speed), a slider from -1 to 1 can cause problems if the value drops below zero. Fortunately, we can modify that using the ``withProperties`` method
es_mx: Dado que la velocidad máxima solo tiene sentido ser un valor de 0 a 1 (punto a punto a velocidad máxima), un control deslizante de -1 a 1 puede causar problemas si el valor cae por debajo de cero. Afortunadamente, podemos modificar eso usando el método "withProperties ''
zh_cn: 由于最大速度只有在0到1（全停到全速）的一个值才有意义，因此如果值降至零以下，则从-1到1的滑块可能会引起问题。幸运的是，我们可以使用withProperties方法修改它

source: The max speed widget limited from 0 to 1.
zh_cn: 最大速度小部件限制为 0 到 1。

source: Notes
es_mx: Notas
zh_cn: 笔记

source: Widgets can be specified by name; however, names are case- and whitespace-sensitive ("Number Slider" is different from "Number slider" and "NumberSlider"). For this reason, it is recommended to use the built in widgets class to specify the widget instead of by raw name. However, a custom widget can only be specified by name or by creating a custom ``WidgetType`` for that widget.
es_mx: Los widgets se pueden especificar por nombre; sin embargo, los nombres distinguen entre mayúsculas y minúsculas y espacios en blanco ("Number Slider" es diferente de "Number Slider" y "NumberSlider"). Por esta razón, se recomienda utilizar la clase de widgets incorporada para especificar el widget en lugar de por nombre sin formato. Sin embargo, un widget personalizado solo se puede especificar por nombre o creando un "WidgetType '' personalizado para ese widget.
zh_cn: 小部件可以通过名称指定；但是，名称区分大小写和空格（“"Number Slider”与“Number slider”和NumberSlider”不同）。为此，建议使用构建在widget类中的小部件来指定小部件，而不是使用原始名称。但是，只能通过名称或通过为该小部件创建自定义``WidgetType''来指定自定义小部件。

source: Widget property names are neither case-sensitive nor whitespace-sensitive ("Max" and "max" are the same). Consult the documentation on the widget in the BuiltInWidgets class for details on the properties of that widget.
es_mx: Los nombres de las propiedades de los widgets no distinguen entre mayúsculas y minúsculas ni espacios en blanco ("Max" y "max" son lo mismo). Consulte la documentación sobre el widget en la clase BuiltInWidgets para obtener detalles sobre las propiedades de ese widget.
zh_cn: 窗口小部件属性名称既不区分大小写也不区分空格（“ Max”和“ max”相同）。有关该窗口小部件属性的详细信息，请参阅BuiltInWidgets类中的窗口小部件文档。
