Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/layouts-with-code/using-tabs.po
Languages: es_mx, fr_ca, zh_cn

source: Using tabs
es_mx: Usar pestañas
fr_ca: Utilisation des onglets
zh_cn: 使用标签

source: Shuffleboard is a tabbed interface. Each tab organizes widgets in a logical grouping. By default, Shuffleboard has tabs for the legacy SmartDashboard and LiveWindow - but new tabs can now be created in Shuffleboard directly from a robot program for better organization.
es_mx: La Shuffleboard es una interfaz con pestañas. Cada pestaña organiza los widgets agrupándolos de manera lógica. De manera predeterminada la Shuffleboard tiene pestañas por herencia de SmartDashboard y LiveWindows, pero nuevas pestañas pueden crearse directamente en la Shuffleboard desde el programa del robot para una mejor organización.
fr_ca: Shuffleboard est une interface à onglets. Chaque onglet organise les widgets par regroupement logique. Par défaut, Shuffleboard a des onglets pour SmartDashboard et LiveWindow hérités - mais de nouveaux onglets peuvent maintenant être créés dans Shuffleboard directement à partir d'un programme de robot pour une meilleure organisation.
zh_cn: 沙狐球,推移板游戏是一个选项卡式界面。每个选项卡将小部件按逻辑分组进行组织。默认情况下，Shuffleboard具有用于旧版SmartDashboard和LiveWindow的选项卡-但是现在可以直接从机器人程序中在Shuffleboard中创建新的选项卡，以实现更好的组织。

source: Creating a new tab
es_mx: Crear una nueva pestaña
fr_ca: Création d'un nouvel onglet
zh_cn: 创建一个新标签

source: Creating a new tab is as simple as calling a single method on the Shuffleboard class, which will create a new tab on Shuffleboard and return a handle for adding your data to the tab. Calling getTab multiple times with the same tab title will return the same handle each time.
es_mx: Crear una nueva pestaña es tan fácil como llamar un solo método en la clase Shuffleboard, lo cual creará una nueva pestaña en la Shuffleboard y devolverá una herramienta para añadir sus datos a la pestaña. Llamar al método getTab varias veces con el mismo título de pestaña devolverá la misma herramienta cada vez.
fr_ca: La création d'un nouvel onglet est aussi simple que d'appeler une seule méthode sur la classe Shuffleboard, ce qui créera un nouvel onglet sur Shuffleboard et retournera une poignée-référence abstraite à une ressource utilisée- pour ajouter vos données à l'onglet. Invoquer plusieurs fois getTab avec le même titre d'onglet retournera la même poignée à chaque fois.
zh_cn: 创建新选项卡就像在Shuffleboard类上调用单个方法一样简单，它将在Shuffleboard上创建一个新的选项卡，并返回一个将数据添加到选项卡中的句柄。多次调用具有相同标签标题的getTab将每次返回相同的句柄。

source: Selecting a tab
es_mx: Seleccionar una pestaña
fr_ca: Sélection d'un onglet
zh_cn: 选择一个标签

source: This method lets a tab be selected by title. This is case-sensitive (so "Tab Title" and "Tab title" are two individual tabs), and only works if a tab with that title exists at the time the method is called, so calling ``selectTab("Example")``\ will only have an effect if a tab named "Example" has previously been defined.
es_mx: Este método permite seleccionar pestañas por su título. Este método distingue entre mayúsculas y minúsculas (entonces “Tab Title” y “Tab title” son dos diferentes pestañas), y solamente funciona si una pestaña con ese título existe cuando el método es invocado, entonces al invocar ``selectTab("Example")``\ solamente funcionará si una pestaña llamada “Example” ha sido definida previamente.
fr_ca: Cette méthode permet de sélectionner un onglet par titre. Ceci est sensible à la casse (donc "Tab Title" et "Tab title" sont deux onglets distincts), et ne fonctionne que si un onglet avec ce titre existe au moment où la méthode est appelée; donc invoquer ``selectTab("Exemple")``\ n'aura d'effet que si un onglet nommé "Exemple" a déjà été défini.
zh_cn: 此方法允许按标题选择选项卡。这是区分大小写的 (so "Tab Title" and "Tab title" are two individual tabs)，并且仅当在调用该方法时存在具有该标题的选项卡时才起作用，因此调用“ selectTab（“ Example”） ``\仅在先前定义了名为“ Example”的选项卡时才有效。

source: This method can be used to select any tab in Shuffleboard, not just ones created by the robot program.
es_mx: Este método puede usarse para seleccionar cualquier pestaña en la Shuffleboard, no solamente las que fueron creadas por el programa del robot.
fr_ca: Cette méthode peut être utilisée pour sélectionner n'importe quel onglet dans Shuffleboard, pas seulement ceux créés par le programme du robot.
zh_cn: 此方法可用于选择Shuffleboard中的任何选项卡，而不仅仅是由机器人程序创建的选项卡。

source: Caveats
fr_ca: Avertissements
zh_cn: 注意事项

source: Tabs created from a robot program differ in a few important ways from normal tabs created from the dashboard:
es_mx: Las pestañas creadas por el robot difieren en algunas maneras importantes de las pestañas creadas desde la dashboard:
fr_ca: Les onglets créés à partir d'un programme de robot diffèrent de plusieurs manières importantes des onglets normaux créés à partir du tableau de bord:
zh_cn: 从机器人程序中创建的选项卡与从仪表板中创建的正常选项卡有几个重要的区别：

source: Not saved in the Shuffleboard save file
es_mx: Sin guardar en el archivo de guardar de la Shuffleboard.
fr_ca: Non enregistrés dans le fichier de sauvegarde Shuffleboard
zh_cn: 未保存在Shuffleboard保存文件中

source: No support for autopopulation
es_mx: No contiene la función de auto completar.
fr_ca: Pas de support pour l'autopopulation
zh_cn: 不支持自动填充

source: Users are expected to specify the tab contents in their robot program
es_mx: Los usuarios deben especificar el contenido de las pestañas en su programa.
fr_ca: Les utilisateurs doivent spécifier le contenu de l'onglet dans leur programme de robot
zh_cn: 用户需要在他们的机器人程序中指定标签内容

source: Have a special color to differentiate from normal tabs
es_mx: Tener un color especial para diferenciarlas de pestañas normales.
fr_ca: Ils sont d'une couleur spéciale pour les différencier des onglets normaux
zh_cn: 具有特殊的颜色以区别于普通标签
