Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/index.po
Languages: fr, he, pt, tr

source: Zero to Robot
fr: De Zéro à Robot
he: מאפס לרובוט
pt: Do Zero a um Robô
tr: Sıfırdan Robota

source: Control System Overviews
fr: Aperçu du système de contrôle
he: סקירות על מערכת הבקרה
pt: Visão Geral do Sistema de Controle
tr: Kontrol Sistemine Genel Bakış

source: Programming Basics
fr: Programmation de base
he: יסודות התכנות
pt: Noções Básicas de Programação
tr: Programlama Temelleri

source: WPILib Java API Docs
fr: Documents d’API Java WPILib
he: תיעוד WPILib API ל-Java
pt: Documentos da WPILib para a API de Java
tr: WPILib Java API Dokümanları

source: WPILib C++ API Docs
fr: Documents d'API C++ WPILib
he: תיעוד WPILib API ל-C++
pt: Documentos da WPILib para a API de C++
tr: WPILib C++ API Dokümanları

source: WPILib Python API Docs
fr: Documentation de l'API Python WPILib
he: תיעוד WPILib Python API
tr: WPILib Python API Dokümanları

source: API Docs
fr: Documents d'API
he: תיעוד ה-API
pt: Documentos de API
tr: API Dokümanları

source: Software Tools
fr: Outils logiciels
he: כלי תכנות
pt: Ferramentas de Software
tr: Yazılım araçları

source: Advanced Programming
fr: Programmation avancée
he: תכנות מתקדם
pt: Programação Avançada
tr: Gelişmiş Programlama

source: Examples and Tutorials
fr: Exemples et didacticiels
he: דוגמאות ומדריכים
pt: Exemplos e Tutoriais
tr: Örnekler ve Eğitimler

source: Hardware
fr: Matériel
he: חומרה
tr: Donanım

source: Romi and XRP Support
fr: Support Romi et XRP
he: תמיכה ב-Romi וב-XRP
tr: Romi ve XRP Desteği

source: Robot Networking
fr: Mise en réseau du Robot
he: רשתות רובוט
pt: Rede do Robô
tr: Robot Ağ Bağlantıları

source: Contributing
fr: Contribution
he: תרומה
pt: Contribuindo
tr: Katkıda Bulunma

source: Issues
fr: Problèmes
he: בעיות
pt: Problemas
tr: Sorunlar

source: FIRST Robotics Competition Control System
fr: Système de Contrôle de la Compétition de Robotique FIRST
he: מערכת הבקרה של FIRST Robotics Competition
pt: Sistema de Controle da FIRST Robotics Competition
tr: FIRST Robotics Competition Control System - Kontrol Sistemi

source: Welcome to the *FIRST*\ |reg| Robotics Competition Control System Documentation! This site contains everything you need to know for programming a competition robot!
fr: Bienvenue dans la Documentation du système de contrôle de la *FIRST*\ |reg| compétition robotique! Ce site contient tout ce qu’il faut savoir pour programmer un robot de compétition!
he: ברוכים הבאים לתיעוד מערכות הבקרה של *FIRST*\ |reg| Robotics Competition. אתר זה מכיל את כל מה שצריך לדעת כדי לתכנת רובוט!
pt: Bem vindo(a) à Documentação do Sistema de Controle da *FIRST*\ |reg| Robotics Competition! Esse site têm tudo que você precisa saber para programar um robô da competição!
tr: *FIRST*\ |reg| Robotics Competition Kontrol Sistemi Dokümantasyonu'na hoşgeldiniz! Bu site yarışma robotunuzu kodlamanız için gereken her şeyi barındırıyor!

source: Community translations can be found in a variety of languages in the bottom-left menu.
he: ניתן למצוא תרגומים במגוון שפות בתפריט הימני, בחלק התחתון.
pt: Traduções feitas pela comunidade em vários idiomas podem ser encontradas no menu no canto inferior esquerdo.
tr: Sol-alt menüde çeşitli dillere yapılan gönüllü çevirilere ulaşabilirsiniz.

source: **Returning Teams**
fr: **Équipes vétéranes**
he: **קבוצות ותיקות**
tr: **Geri Dönen Takımlar**

source: Changelog
tr: Değişiklik Günlüğü

source: Known Issues
he: בעיות ידעות
tr: Bilinen Sorunlar

source: Quick Start
he: התחלה מהירה
tr: Hızlı Başlangıç

source: **New Teams**
fr: **Nouvelles équipes**
he: **קבוצות חדשות**
tr: **Yeni Takımlar**

source: The Zero-to-Robot tutorial will guide you through preparation, wiring and programming a basic robot!
he: המדריך ״מאפס לרובוט״ ידריך אתכם בהכנה, חיווט ותכנות רובוט בסיסי!
pt: O tutorial do Zero a um Robô, vai te guiar através da preparação, fiação e programação de um robô básico
tr: Sıfırdan Robot'a eğitimi size temel bir robotu hazırlama, kablolama ve programlama konusunda rehberlik edecek!

source: Go to Zero-to-Robot
fr: Aller à Zéro-à-Robot
he: מעבר אל מאפס-לרובוט
tr: Zero-to-Robot'a gidin.

source: **Hardware Overview**
he: **סקירת החומרה**
tr: **Donanım Genel Bakışı**

source: An overview of the hardware components available to teams.
fr: Survol des composants matériels disponibles pour les équipes.
he: סקירה כללית של רכיבי החומרה הזמינים לקבוצות.
pt: Uma visão geral dos componentes de hardware disponíveis para os times
tr: Takımların kullanabileceği donanım bileşenlerine genel bakış.

source: Go to Hardware Overview
he: מעבר לסקירת החומרה
tr: Donanım Genel Bakışına gidin

source: **Software Overview**
he: **סקירת התוכנה**
tr: **Yazılıma Genel Bakış**

source: An overview of the software components and tools available to teams.
fr: Un survol des composants logiciels et des outils mis à la disposition des équipes.
he: סקירה כללית של רכיבי התוכנה והכלים העומדים לרשות הקבוצות.
pt: Uma visão geral dos componentes e ferramentas de software disponíveis para os times
tr: Takımların kullanabileceği yazılım bileşenlerine ve araçlarına genel bakış.

source: Go to Software Overview
he: מעבר לסקירת התוכנה
tr: Yazılım Genel Bakışına gidin

source: **Programming Basics**
fr: **Programmation de base**
he: **תכנות בסיסי**
tr: **Programlama Temelleri**

source: Documentation that is useful throughout a team's programming process.
fr: Documentation utile tout au long du processus de programmation pour une équipe.
he: תיעוד שימושי עבור תהליך התכנות של הקבוצה.
pt: Documentação que é útil ao longo do processo de programação
tr: Takıma programlama süreci boyunca faydalı olacak dokümanlar.

source: View articles
fr: Voir les articles
tr: Makaleleri görüntüle

source: **Advanced Programming**
fr: **Programmation avancée**
he: **תכנות מתקדם**
tr: **Gelişmiş Programlama**

source: Documentation that is suited toward veteran teams. This includes content such as Path Planning and Kinematics.
fr: Documentation adaptée aux équipes vétéranes. Cela inclut du contenu tel que la planification des trajectoires et la cinématique.
he: תיעוד המתאים לקבוצות ותיקות, כולל תוכן כמו תכנון מסלולים וקינמטיקה.
pt: Documentação voltada para times veteranos. Isso inclui coisas como Planejamento de Rota e Cinemática
tr: Veteran takımlara hitabeden belgeler. Bu belgelerde Yol Planlama ve Kinematik gibi içerikler bulunuyor.

source: **Hardware**
fr: **Matériel**
he: **חומרה**
tr: **Donanım**

source: Hardware tutorials and content available for teams.
fr: Didacticiels des outils matériels et contenu disponibles pour les équipes.
he: מדריכים ותוכן חומרה לקבוצות.
pt: Tutoriais de Hardware e conteúdo disponível para os times.
tr: Takımlar için donanım eğitimleri ve içerik mevcuttur.

source: **Romi and XRP Robots**
fr: **Robots Romi et XRP**
he: **רובוטי Romi ו-XRP**
tr: **Romi ve XRP Robotları**

source: The Romi and XRP robots are low-cost platforms for practicing WPILib programming.
fr: Les robots Romi et XRP sont des plateformes à faible coût pratiquer la programmation WPILib.
he: הרובוטים Romi ו-XRP הם פלטפורמות זולות לתרגול תכנות WPILib.
tr: Romi ve XRP robotları, WPILib programlamasını denemek için düşük maliyetli platformlardır.

source: View Romi articles
fr: Voir les articles Romi
tr: Romi makalelerini görüntüle

source: View XRP articles
fr: Voir les articles XRP
tr: XRP makalelerini görüntüle

source: **API Documentation**
fr: **Documentation de l'API**
he: **תיעוד API**
tr: **API Belgesi**

source: Java, C++, and Python class documentation.
fr: Documentation des classes Java, C++ et Python.
tr: Java, C++, ve Python class belgeleri.

source: **Software Tools**
fr: **Outils logiciels**
he: **כלי תוכנה**
tr: **Yazılım Araçları**

source: Essential tooling such as FRC Driver Station, Dashboards, roboRIO Imaging Tool and more.
fr: Des outils essentiels tels que l'application FRC Driver Station, Dashboards, roboRIO Imaging Tool et plus encore.
he: כלי עבודה שימושיים כמו FRC Driver Station, Dashboards, roboRIO Imaging Tool ועוד.
pt: Ferramentas Essenciais, como o FRC Driver Station, os Dashboards, a roboRIO Imaging Tool entre outros.
tr: FRC Driver Station, Dashboards, roboRIO Görüntüleme Aracı ve daha fazlası gibi temel araçlar.

source: **Example Projects**
fr: **Exemples de projets**
he: **פרויקטים לדוגמה**
tr: **Örnek Projeler**

source: This section showcases the available example projects that teams can reference in VS Code.
fr: Cette section présente les exemples de projets disponibles que les équipes peuvent utiliser sous VS Code.
he: חלק זה מציג פרויקטים לדוגמה שקבוצות יכולות להתבסס עליהם ב-VS Code.
pt: Esta seção mostra os projetos de exemplo disponíveis que as equipes podem fazer referência no VS Code.
tr: Bu kısım, takımların VS kodunu referans alarak mevcut projelere örnek gösterir.

source: **Status Light Quick Reference**
tr: **Durum Işığı için Hızlı Referans**

source: Quick reference guide for the status lights on a variety of FRC hardware.
fr: Guide de référence rapide pour les voyants lumineux indiquant l'état de fonctionnement pour une variété de matériel FRC.
he: מדריך הסבר על נורות המצב במגוון חומרות FRC.
pt: Um guia rápido de referência para as luzes de status em vários Hardwares de FRC
tr: Çeşitli FRC donanımlarındaki durum ışıkları için hızlı başvuru kılavuzu.

source: View article
fr: Voir l'article
tr: Makaleleri görüntüle

source: **3rd Party libraries**
fr: **Libraires tierces**
he: **ספריות צד שלישי**
tr: **3. Parti kütüphaneler**

source: Tutorial on adding 3rd party libraries such as CTRE and REV to your robot project.
fr: Tutoriel relatif à l'ajout des librairies tierces à votre projet de robot telles que CTRE et REV.
he: מדריך הוספת ספריות צד שלישי כגון CTRE ו-REV לפרויקט הרובוט שלכם.
pt: Tutorial de como adicionar bibliotecas de terceiros, como as da CTRE e da REV, ao seu projeto.
tr: Robot projenize CTRE ve REV gibi 3. taraf kitaplıkları ekleme eğitimi.

source: If you are a returning team, please check out the overview of changes from 2023 to 2024, known issues, and quick start guide for updating.
he: אם אתם קבוצה ותיקה, אנא קראו את סקירת השינויים מ-2023 ל-2024, הבעיות הידועות ומדריך ההתחלה המהירה לעדכון.

source: Legal
fr: Légal

source: Report a Documentation Issue
fr: Rapporter un problème de documentation

source: If you are a returning team, please check out the overview of changes from 2024 to 2025, known issues, and quick start guide for updating.
fr: Si vous êtes une équipe vétérane, veuillez consulter l’aperçu des changements de 2024 à 2025, les problèmes connus ainsi que le guide de démarrage rapide pour la mise à jour.

source: Report an Issue
pt: Reportar um Problema

source: Returning Teams
pt: Times que Retornam

source: New Teams
pt: Times Novatos

source: Hardware Overview
pt: Visão Geral do Hardware

source: Software Overview
pt: Visão geral do Software

source: The Romi Robot is a low-cost Raspberry Pi based platform for practicing WPILib programming.
pt: O Romi Robot é uma plataforma Raspberry Pi de baixo custo para praticar a programação com a WPILib.

source: API Documentation
pt: Documentação da API

source: Java and C++ class documentation.
pt: Documentação das Classe em Java e C++.

source: Example Projects
pt: Exemplos de Projetos

source: Status Light Quick Reference
pt: Referência Rápida da Luz de Status

source: 3rd Party Libraries
pt: Bibliotecas de Terceiros
