Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/ip-configurations.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: IP Configurations
es_mx: Configuraciones IP
tr_tr: IP Yapılandırmaları
zh_cn: IP配置

source: This document describes the IP configuration used at events, both on the fields and in the pits, potential issues and workaround configurations.
es_mx: Este documento describe la configuración de IP utilizada en los eventos, tanto en los campos como en las fosas, los problemas potenciales y las configuraciones de solución.
fr_ca: Ce document décrit la configuration d'adresses IP utilisées lors d’événements, tant sur les terrains que dans les puits, les problèmes potentiels et les solutions de rechange.
tr_tr: Bu belge, hem sahalarda hem de pitlerde etkinliklerde kullanılan IP yapılandırmasını, olası sorunları ve geçici çözüm yapılandırmalarını açıklamaktadır.
zh_cn: 本文档描述了场地和Pits区在事件中使用的IP配置，潜在问题和解决方法配置。

source: TE.AM IP Notation
es_mx: Notación TE.AM IP
fr_ca: Notation IP TE.AM
tr_tr: TE.AM IP Gösterimi
zh_cn: TE.AM IP 表示法

source: The notation TE.AM is used as part of IPs in numerous places in this document. This notation refers to splitting your four digit team number into two digit pairs for the IP address octets.
es_mx: La notación TE.AM se utiliza como parte de los IP en numerosos lugares de este documento. Esta notación se refiere a la división de su número de equipo de cuatro dígitos en pares de dos dígitos para los octetos de direcciones IP.
fr_ca: La notation TE.AM est utilisée dans le cadre des IP à de nombreux endroits dans ce document. Cette notation fait référence à la séparation de votre numéro d’équipe à quatre chiffres en paire à deux chiffres pour les octets d’adresses IP.
tr_tr: TE.AM gösterimi, bu belgedeki birçok yerde IP'lerin bir parçası olarak kullanılmıştır. Bu gösterim, dört basamaklı takım numaranızı IP adresi için iki basamaklı çifte bölmeyi ifade eder.
zh_cn: 在本文档的许多地方，符号TE.AM用作IP的一部分。此表示法是指将您的四位数团队号码分成两对数字，用于IP地址八位位组。

source: Example: ``10.TE.AM.2``
es_mx: Ejemplo: ``10.TE.AM.2``
fr_ca: Exemple: ``10.TE.AM.2``
tr_tr: Örnek: ``10.TE.AM.2``
zh_cn: 举例: ``10.TE.AM.2``

source: Team 12 - ``10.0.12.2``
es_mx: Equipo 12 - ``10.0.12.2``
tr_tr: Takım 12 - ``10.0.12.2``

source: Team 122 - ``10.1.22.2``
es_mx: Equipo 122 - ``10.1.22.2``
tr_tr: Takım 122 - ``10.1.22.2``

source: Team 1212 - ``10.12.12.2``
es_mx: Equipo 1212 - ``10.12.12.2``
tr_tr: Takım 1212 - ``10.12.12.2``

source: Team 3456 - ``10.34.56.2``
es_mx: Equipo 3456 - ``10.34.56.2``
tr_tr: Takım 3456 - ``10.34.56.2``

source: On the Field
es_mx: En el campo
fr_ca: Sur le terrain
tr_tr: Sahada
zh_cn: 场地内

source: This section describes networking when connected to the Field Network for match play
es_mx: Esta sección describe el trabajo en red cuando se conecta a la Red de Campo para los partidos
fr_ca: Cette section décrit la réseautique lorsqu'on est connecté au réseau du terrain pour un match
tr_tr: Bu bölümde maç oynamak için Saha Ağına bağlanıldığında ağ bağlantısı açıklanmaktadır.
zh_cn: 本节介绍了连接到Field Network进行比赛时的联网

source: On the Field DHCP Configuration
es_mx: En el campo Configuración DHCP
fr_ca: Configuration DHCP pour usage sur le terrain
tr_tr: Sahada DHCP Yapılandırması
zh_cn: 场地内的DHCP配置

source: The Field Network runs a DHCP server with pools for each team that will hand our addresses in the range of 10.TE.AM.20 and up with subnet masks
tr_tr: Saha Ağı her takım için, 10.TE.AM.20 üzeri ve alt ağ maskeleri ile atayacak şekilde IP adresi havuzları barındıran bir DHCP sunucusu çalıştırır.
zh_cn: Field Network为每个团队运行一个带有库的DHCP服务器，该库将为我们的地址分配10.TE.AM.20及更高范围并带有子网掩码的地址

source: OpenMesh OM5P-AN or OM5P-AC radio - Static ``10.TE.AM.1`` programmed by Kiosk
es_mx: Radio OM5P-AN u OM5P-AC de malla abierta - Estática "10.TE.AM.1" programada por Kiosk.
fr_ca: OpenMesh OM5P-AN ou OM5P-AC radio - Statique ``10.TE.AM.1`` programmée par le Kiosk
tr_tr: OpenMesh OM5P-AN veya OM5P-AC radyo - Kiosk tarafından programlanmış Statik ``10.TE.AM.1``

source: roboRIO - DHCP ``10.TE.AM.2`` assigned by the Robot Radio
es_mx: roboRIO - DHCP ``10.TE.AM.2`` asignado por la Radio Robot
fr_ca: roboRIO - DHCP ``10.TE.AM.2`` attribuée par la radio du robot
tr_tr: roboRIO - Robot Radio tarafından atanan DHCP adresi ``10.TE.AM.2``

source: Driver Station - DHCP (“Obtain an IP address automatically”) 10.TE.AM.X assigned by field
tr_tr: Driver Station - DHCP (“Obtain an IP address automatically”) 10.TE.AM.X saha tarafından atanır

source: IP camera (if used) - DHCP ``10.TE.AM.Y`` assigned by Robot Radio
es_mx: Cámara IP (si se usa) - DHCP ``10.TE.AM.Y`` asignada por Radio Robot
fr_ca: Caméra IP (si elle est utilisée) - DHCP ``10.TE.AM.Y`` attribuée par la radio du robot
tr_tr: IP kamera (kullanılıyorsa) - Robot Radio tarafından atanan DHCP ``10.TE.AM.Y``

source: Other devices (if used) - DHCP ``10.TE.AM.Z`` assigned by Robot Radio
es_mx: Otros dispositivos (si se usan) - DHCP ``10.TE.AM.Z`` asignado por Radio Robot
fr_ca: Autres appareils (s’ils sont utilisés) - DHCP ``10.TE.AM.Z`` attribuée par la radio du robot
tr_tr: Diğer cihazlar (kullanılıyorsa) - Robot Radio tarafından atanan DHCP ``10.TE.AM.Z``

source: On the Field Static Configuration
es_mx: En la configuración estática del campo
fr_ca: Configuration statique pour usage sur le terrain
tr_tr: Sahada Statik Yapılandırma
zh_cn: 场地内静态配置

source: It is also possible to configure static IPs on your devices to accommodate devices or software which do not support mDNS. When doing so you want to make sure to avoid addresses that will be in use when the robot is on the field network. These addresses are ``10.TE.AM.1`` and ``10.TE.AM.4`` for the OpenMesh radio and the field access point and anything ``10.TE.AM.20`` and up which may be assigned to a device still configured for DHCP. The roboRIO network configuration can be set from the webdashboard.
tr_tr: Ayrıca, mDNS'yi desteklemeyen aygıtları veya yazılımları barındırmak için aygıtlarınızda statik IP'leri yapılandırmanız da mümkündür. Bunu yaparken, robot saha ağındayken kullanımda olacak adreslerden kaçınmak istersiniz. Bu adresler, OpenMesh radyo ve saha erişim noktası için ``10.TE.AM.1``, ``10.TE.AM.4``, ``10.TE.AM.20`` ve üstü DHCP için yapılandırımış herhangi bir IP adresleridir. RoboRIO ağ yapılandırması webdashboard üzerinden ayarlanabilir.
zh_cn: 也可以在设备上配置静态IP，以容纳不支持mDNS的设备或软件。这样做时，您要确保避免机器人在现场网络上使用的地址。这些地址分别是OpenMesh无线电和现场访问点的``10.TE.AM.1''和``10.TE.AM.4''以及任何``10.TE.AM.20''及更高版本。可以分配给仍配置为DHCP的设备。 roboRIO网络配置可以从网络仪表板上进行设置。

source: OpenMesh radio - Static ``10.TE.AM.1`` programmed by Kiosk
es_mx: Radio OpenMesh - Estática "10.TE.AM.1" programada por Kiosk
fr_ca: OpenMesh radio - Statique ``10.TE.AM.1`` programmée par le Kiosk
tr_tr: OpenMesh radyo - Kiosk tarafından programlanmış Statik ` ``10.TE.AM.1``
zh_cn: OpenMesh路由器-静态``10.TE.AM.1''由Kiosk编程。

source: roboRIO - Static ``10.TE.AM.2`` would be a reasonable choice, subnet mask of ``255.255.255.0`` (default)
es_mx: roboRIO - Estática ``10.TE.AM.2`` sería una elección razonable, máscara de subred de ``255.255.255.0`` (por defecto)
fr_ca: roboRIO - Statique ``10.TE.AM.2`` serait un choix raisonnable, masque sous-réseau de ''255.255.255.0'' (par défaut)
tr_tr: roboRIO - Statik ``10.TE.AM.2`` makul bir seçim olacaktır, ``255.255.255.0`` alt ağ maskesi (varsayılan)
zh_cn: roboRIO-静态``10.TE.AM.2''是一个合理的选择，子网掩码为``255.255.255.0''（默认）

source: Driver Station - Static ``10.TE.AM.5`` would be a reasonable choice, subnet mask **must** be ``255.0.0.0``
tr_tr: Driver Sration - Statik ``10.TE.AM.5`` makul bir seçim olacaktır, alt ağ maskesi ``255.0.0.0`` **olmalıdır**
zh_cn: 机器操控台-静态``10.TE.AM.5''是一个合理的选择，子网掩码**必须**是``255.0.0.0''

source: IP Camera (if used) - Static ``10.TE.AM.11`` would be a reasonable choice, subnet ``255.255.255.0`` should be fine
es_mx: Cámara IP (si se usa) - Estática "10.TE.AM.11" sería una elección razonable, la subred "255.255.255.0" estaría bien.
fr_ca: Caméra IP (si elle est utilisée) - Statique ``10.TE.AM.11`` serait un choix raisonnable, sous-réseau ``255.255.255.0`` devrait parfaitement convenir
tr_tr: IP Kamera (kullanılıyorsa) - Statik ``10.TE.AM.11`` makul bir seçim olacaktır, ``255.255.255.0`` alt ağı uygun olacaktır
zh_cn: IP摄像头（如果使用）-静态``10.TE.AM.11''将是一个合理的选择，子网``255.255.255.0''应该可以

source: Other devices - Static ``10.TE.AM.6-.10`` or ``.12-.19`` (.11 if camera not present) subnet ``255.255.255.0``
es_mx: Otros dispositivos - Estática ``10.TE.AM.6-.10`` o ``.12-.19`` (.11 si la cámara no está presente) subred ``255.255.255.0``
fr_ca: Autres appareils - Statique ``10.TE.AM.6-.10`` ou ``.12-.19`` (.11 si la caméra n’est pas présente) sous-réseau ``255.255.255.0``
tr_tr: Diğer cihazlar - Statik ``10.TE.AM.6-.10`` veya ``.12-.19`` (.11 kamera yoksa) alt ağı ``255.255.255.0``
zh_cn: 其他设备-静态``10.TE.AM.6-.10''或``.12-.19''（如果没有摄像头，则为.11）子网``255.255.255.0''

source: In the Pits
es_mx: En los pits
fr_ca: Dans le puits
tr_tr: Pit Alanlarında
zh_cn: Pits区内

source: **New for 2018:** There is now a DHCP server running on the wired side of the Robot Radio in the event configuration.
es_mx: **Nuevo para 2018:** Ahora hay un servidor DHCP funcionando en el lado cableado de la Radio del Robot en la configuración de eventos.
fr_ca: **Nouveau pour 2018:** Il y a maintenant un serveur DHCP qui fonctionne du côté câblé de la radio du robot dans la configuration de l’événement.
tr_tr: **2018'deki yenilikler:** Artık etkinlik yapılandırmasında Robot Radio' nun kablolu tarafında çalışan bir DHCP sunucusu var.
zh_cn: ** 2018年新增功能：**赛事配置中，机器人无线电的有线端现在运行着一个DHCP服务器。

source: In the Pits DHCP Configuration
es_mx: En los pits configuración de DCHP
fr_ca: Configuration DHCP pour usage dans le puits
tr_tr: Pitlerde DHCP Yapılandırması
zh_cn: Pits区内DHCP配置

source: OpenMesh radio - Static ``10.TE.AM.1`` programmed by Kiosk.
es_mx: Radio OpenMesh - Estática "10.TE.AM.1" programada por Kiosk.
fr_ca: OpenMesh radio - Statique ``10.TE.AM.1`` programmée par le Kiosk.
tr_tr: OpenMesh radyo - Kiosk tarafından programlanan Statik ``10.TE.AM.1`` .

source: roboRIO - ``10.TE.AM.2``, assigned by Robot Radio
es_mx: roboRIO - ``10.TE.AM.2``, asignado por Radio Robot
fr_ca: roboRIO - ``10.TE.AM.2``, attribuée par la radio du robot
tr_tr: roboRIO - Robot Radio tarafından atanan ``10.TE.AM.2``

source: Driver Station - DHCP (“Obtain an IP address automatically”), ``10.TE.AM.X``, assigned by Robot Radio
tr_tr: Driver Station - Robot Radio tarafından atanan DHCP (“Obtain an IP address automatically”), ``10.TE.AM.X``.

source: IP camera (if used) - DHCP, ``10.TE.AM.Y``, assigned by Robot Radio
es_mx: Cámara IP (si se usa) - DHCP, ``10.TE.AM.Y``, asignada por Radio Robot
fr_ca: Caméra IP (si elle est utilisée) - DHCP, ``10.TE.AM.Y``, attribuée par la radio du robot
tr_tr: IP kamera (kullanılıyorsa) - Robot Radio tarafından atanan DHCP, ``10.TE.AM.Y``

source: Other devices (if used) - DHCP, ``10.TE.AM.Z``, assigned by Robot Radio
es_mx: Otros dispositivos (si se usan) - DHCP, ``10.TE.AM.Z``, asignado por Radio Robot
fr_ca: Autres appareils (s’ils sont utilisés) - DHCP, ``10.TE.AM.Z``, attribuée par la radio du robot
tr_tr: Diğer cihazlar (kullanılıyorsa) - Robot Radio tarafından atanan DHCP, ``10.TE.AM.Z``

source: In the Pits Static Configuration
es_mx: En los pits configuración estática
fr_ca: Configuration statique pour usage dans le puits
tr_tr: Pitlerde Statik Yapılandırma
zh_cn: Pits区内静态配置

source: It is also possible to configure static IPs on your devices to accommodate devices or software which do not support mDNS. When doing so you want to make sure to avoid addresses that will be in use when the robot is on the field network. These addresses are ``10.TE.AM.1`` and ``10.TE.AM.4`` for the OpenMesh radio
tr_tr: Ayrıca, mDNS'yi desteklemeyen aygıtları veya yazılımları barındırmak için aygıtlarınızda statik IP'leri yapılandırmanız da mümkündür. Bunu yaparken, robot saha ağındayken kullanımda olacak adreslerden kaçınmak istersiniz. Bu adresler OpenMesh radyo için ``10.TE.AM.1`` ve ``10.TE.AM.4`` şeklindedir.
zh_cn: 也可以在设备上配置静态IP，以容纳不支持mDNS的设备或软件。这样做时，您要确保避免机器人在现场网络上使用的地址。对于OpenMesh路由器，这些地址是``10.TE.AM.1''和``10.TE.AM.4''

source: Driver Station - DHCP ("Obtain an IP address automatically") 10.TE.AM.X assigned by field
es_mx: Driver Station - DHCP ("Obtener una dirección IP automáticamente") 10.TE.AM.X asignado por campo
fr_ca: Driver Station - DHCP ("Obtain an IP address automatically") 10.TE.AM.X assignée par le terrain

source: Driver Station - DHCP ("Obtain an IP address automatically"), ``10.TE.AM.X``, assigned by Robot Radio
es_mx: Driver Station - DHCP ("Obtener una dirección IP automáticamente"), ``10.TE.AM.X``, asignado por Robot Radio
fr_ca: Driver Station - DHCP ("Obtain an IP address automatically"), ``10.TE.AM.X``, attribuée par la radio du robot

source: The Field Network runs a DHCP server with pools for each team that will hand out addresses in the range of ``10.TE.AM.20`` to ``10.TE.AM.199`` with a subnet mask of ``255.255.255.0``, and a default gateway of ``10.TE.AM.4``. When configured for an event, the Team Radio runs a DHCP server with a pool for devices onboard the robot that will hand out addresses in the range of 10.TE.AM.200 to 10.TE.AM.219 with a subnet mask of 255.255.255.0, and a gateway of 10.TE.AM.1.
fr_ca: Le réseau de terrain de jeu utilise un serveur DHCP avec des pools pour chaque équipe qui distribuera des adresses dans la plage allant de ``10.TE.AM.20`` à ``10.TE.AM.199``' avec un masque de sous-réseau ``255.255.255.0`` et une passerelle par défaut de ``10.TE.AM.4``. Lorsqu’elle est configurée pour un événement, la radio associée à chaque équipe utilise un serveur DHCP avec un pool de périphériques à bord du robot qui distribuera des adresses dans la plage allant de 10.TE.AM.200 à 10.TE.AM.219 avec un masque de sous-réseau de 255.255.255.0 et une passerelle de 10.TE.AM.1.

source: It is also possible to configure static IPs on your devices to accommodate devices or software which do not support mDNS. When doing so you want to make sure to avoid addresses that will be in use when the robot is on the field network. These addresses are ``10.TE.AM.1`` for the OpenMesh radio, ``10.TE.AM.4`` for the field router, and anything greater than ``10.TE.AM.20`` which may be assigned to a device configured for DHCP or else reserved. The roboRIO network configuration can be set from the webdashboard.
fr_ca: Il est également possible de configurer des adresses IP statiques sur vos appareils pour prendre en charge les périphériques ou les logiciels qui ne prennent pas en charge mDNS. Ce faisant, vous devez vous assurer d’éviter les adresses qui seront utilisées lorsque le robot sera sur le réseau du terrain de jeu. Ces adresses sont ``10.TE.AM.1`` pour la radio OpenMesh, ``10.TE.AM.4`` pour le routeur du terrain, et tout ce qui est supérieur à ``10.TE.AM.20`` qui peut être affecté à un périphérique configuré pour DHCP ou réservé. La configuration du réseau du roboRIO peut être définie à partir du webdashboard.

source: Driver Station - Static ``10.TE.AM.5`` would be a reasonable choice, subnet mask **must** be ``255.0.0.0`` to enable the DS to reach both the robot and FMS Server, without additionally configuring the default gateway. If a static address is assigned and the subnet mask is set to ``255.255.255.0``, then the default gateway must be configured to ``10.TE.AM.4``.
fr_ca: Driver Station - Static ``10.TE.AM.5`` serait un choix raisonnable, le masque de sous-réseau **doit** être ``255.0.0.0`` pour permettre au DS d’atteindre à la fois le robot et le serveur FMS, sans configurer additionnellement la passerelle par défaut. Si une adresse statique est attribuée et que le masque de sous-réseau est défini sur ``255.255.255.0``, la passerelle par défaut doit être configurée sur ``10.TE.AM.4``.

source: It is also possible to configure static IPs on your devices to accommodate devices or software which do not support mDNS. When doing so you want to make sure to avoid addresses that will be in use when the robot is on the field network. These addresses are ``10.TE.AM.1`` for the OpenMesh radio and ``10.TE.AM.4`` for the field router.
fr_ca: Il est également possible de configurer des adresses IP statiques sur vos appareils pour accomoder des périphériques ou des logiciels qui ne prennent pas en charge le mDNS. Ce faisant, vous devez vous assurer d’éviter les adresses qui seront utilisées lorsque le robot est sur le réseau du terrain de jeu. Ces adresses sont ``10.TE.AM.1`` pour la radio OpenMesh et ``10.TE.AM.4`` pour le routeur du terrain de jeu.
