Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/measuring-bandwidth-usage.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Measuring Bandwidth Usage
es_mx: Medición del uso de banda ancha
fr_ca: Mesure de l'utilisation de la bande passante
tr_tr: Bant Genişliği Kullanımını Ölçme
zh_cn: 测量带宽使用

source: On the FRC\ |reg| Field each team is allocated limited network bandwidth (see R704 in the 2022 manual). The `FMS Whitepaper <https://fms-manual.readthedocs.io/en/latest/fms-whitepaper/fms-whitepaper.html>`__ provides more information on determining the bandwidth usage of the Axis camera, but some teams may wish to measure their overall bandwidth consumption. This document details how to make that measurement.
fr_ca: Sur le terrain de jeu FRC\ |reg| , chaque équipe se voit attribuer une bande passante à largeur limitée (voir R704 dans le manuel de 2022). Le `livre blanc FMS <https://fms-manual.readthedocs.io/en/latest/fms-whitepaper/fms-whitepaper.html>`__ fournit plus d'informations sur la détermination de l'utilisation de la bande passante de la caméra Axis, mais certaines équipes pourraient vouloir mesurer leur consommation globale de bande passante. Ce document explique comment effectuer cette mesure.

source: Teams can simulate the bandwidth throttling at home using the FRC Bridge Configuration Utility with the bandwidth checkbox checked.
fr_ca: Les équipes peuvent simuler la limitation de la bande passante à la maison à l'aide de l'utilitaire de configuration de pont FRC avec la case à cocher de bande passante cochée.

source: Measuring Bandwidth Using the Performance Monitor (Win 7 only)
es_mx: Medición de banda ancha usando el monitor de rendimiento (sólo Win 7)
fr_ca: Mesure de la bande passante à l'aide de l'Analyseur de performances (Windows 7 uniquement)
tr_tr: Performance Monitor Kullanarak Bant Genişliğini Ölçme (yalnızca Win 7)
zh_cn: 使用性能监视器测量带宽（仅适用于Win 7）

source: Windows contains a built-in tool called the Performance Monitor that can be used to monitor the bandwidth usage over a network interface.
fr_ca: Windows contient un outil intégré appelé Performance Monitor qui peut être utilisé pour évaluer l'utilisation de la bande passante sur une interface réseau.

source: Launching the Performance Monitor
es_mx: Lanzamiento del Monitor de Rendimiento
fr_ca: Démarrer *Performance Monitor*
tr_tr: Performance Monitor'ü Başlatma
zh_cn: 运行性能监视器

source: Using the start menu to type "perfmon.msc".
fr_ca: En utilisant le menu Démarrer saisissez "perfmon.msc".

source: Click ``Start`` and in the search box, type ``perfmon.msc`` and press Enter.
es_mx: Haz clic en ``Start`` y en el cuadro de búsqueda, escribe ``perfmon.msc`` y presiona Enter.
fr_ca: Cliquez sur ``Start`` et, dans la zone de recherche, tapez ``perfmon.msc``, puis Entrée.
tr_tr: ``Start`` ı tıklayın ve arama kutusuna ``perfmon.msc`` yazın ve Enter tuşuna basın.
zh_cn: 点击“开始”并在搜索栏中输入“perfmon.msc”后按下回车键。

source: Open Real-Time Monitor
es_mx: Abrir el monitor en tiempo real
fr_ca: Ouvrir le moniteur en temps réel *Real-Time Monitor*
tr_tr: Real-Time- Gerçek Zamanlı Monitörü Aç
zh_cn: 打开实时监控器

source: Click "Performance Monitor" under "Monitoring Tools" in the tree view.
fr_ca: Cliquez sur "Performance Monitor" sous "Monitoring Tools" dans l’arborescence.

source: In the left pane, click ``Performance Monitor`` to display the real-time monitor.
es_mx: En el panel izquierdo, haz clic en "Monitor de rendimiento" para mostrar el monitor en tiempo real.
fr_ca: Dans le volet gauche, cliquez sur ``Performance Monitor`` pour afficher le moniteur en temps réel.
tr_tr: Sol bölmede, Real-Time monitörü görüntülemek için ``Performance Monitor`` tıklayın.
zh_cn: 在左窗格中，单击``性能监视器''以显示实时监视器。

source: Add Network Counter
es_mx: Agregar contador de red
fr_ca: Ajouter un compteur réseau
tr_tr: Network Counter Ekle
zh_cn: 添加网络计数器

source: The "Add Counters" screen showinging the steps below.
fr_ca: L’écran "Add Counters" montrant les étapes ci-dessous.

source: Click the green plus near the top of the screen to add a counter
es_mx: Haga clic en el plus verde cerca de la parte superior de la pantalla para añadir un contador
fr_ca: Cliquez sur le signe plus vert en haut de l'écran pour ajouter un compteur.
tr_tr: Sayaç eklemek için ekranın üst tarafındaki yeşil artı işaretini tıklayın
zh_cn: 点击屏幕顶部附近的绿色加号以添加一个计数器

source: In the top left pane, locate and click on ``Network Interface`` to select it
es_mx: En el panel superior izquierdo, localice y haga clic en "Interfaz de red" para seleccionarlo.
fr_ca: Dans le volet supérieur gauche, recherchez et cliquez sur ``Network Interface`` pour le sélectionner.
tr_tr: Sol üst bölmede, seçmek için ``Network Interface`` nü bulun ve tıklayın.
zh_cn: 在左上窗格中，找到并单击“Network Interface”（网络接口）以选中它

source: In the bottom left pane, locate the desired network interface (or use All instances to monitor all interfaces)
es_mx: En el panel inferior izquierdo, localice la interfaz de red deseada (o utilice Todas las instancias para supervisar todas las interfaces)
fr_ca: Dans le volet inférieur gauche, recherchez l'interface réseau souhaitée (ou *All instances* pour surveiller toutes les interfaces).
tr_tr: Sol alt bölmede, istenen ağ arayüzünü bulun (veya tüm arayüzleri izlemek için All instances kullanın)
zh_cn: 在左下方窗格中，找到所需的网络接口（或使用“所有实例”监视所有接口）

source: Click ``Add>>`` to add the counter to the right pane.
es_mx: Haz clic en ``Add>>`` para añadir el contador al panel de la derecha.
fr_ca: Cliquez ``Add>>`` pour ajouter un compteur au volet droit.
tr_tr: Sayacı sağ bölmeye eklemek için ``Add>>`` ye tıklayın.
zh_cn: 单击``添加>>''将计数器添加到右侧窗格中。

source: Click ``OK`` to add the counters to the graph.
es_mx: Haz clic en "OK" para añadir los contadores al gráfico.
fr_ca: Cliquez ``OK`` pour ajouter les compteurs au graphique.
tr_tr: Sayaçları grafiğe eklemek için ``OK`` a tıklayın.
zh_cn: 单击``确定''以将计数器添加到图形中。

source: Remove Extra Counters
es_mx: Eliminar los contadores adicionales
fr_ca: Retirer des compteurs
tr_tr: Ekstra Sayaçları Kaldırın
zh_cn: 删除额外计数器

source: Removing the counter at the bottom of the graph screen.
fr_ca: Suppression du compteur en bas de l’écran du graphique.

source: In the bottom pane, select each counter other than ``Bytes Total/sec`` and press the ``Delete`` key. The ``Bytes Total/sec`` entry should be the only entry remaining in the pane.
es_mx: En el panel inferior, seleccione cada contador que no sea "Bytes Total/sec" y presione la tecla "Borrar". La entrada "Bytes Total/sec" debe ser la única que quede en el panel.
fr_ca: Dans le volet inférieur, sélectionnez chaque compteur autre que ``Bytes Total/sec`` et appuyez sur ``Delete``. L'entrée ``Bytes Total/sec`` doit être la seule entrée restante au volet.
tr_tr: Alt bölmede, ``Bytes Total/sec`` dışındaki her bir sayacı seçin ve ``Delete`` tuşuna basın. Bölmede kalan tek girdi, ``Bytes Total/sec`` girişi olmalıdır.
zh_cn: 在底部窗格中，选择除“ 字节总数/秒（Bytes Total / sec）”以外的每个计数器，然后按“ Delete”键。 ``字节总数/秒''条目应是窗格中剩余的唯一条目。

source: Configure Data Properties
es_mx: Configurar las propiedades de los datos
fr_ca: Configurer les propriétés des données
tr_tr: Data Properties-Veri Özelliklerini Yapılandırın
zh_cn: 配置数据属性

source: Scale dropdown highlighted on the Performance Monitor Properties page.
fr_ca: Liste déroulante d’échelle mise en surbrillance sur la page Performance Monitor Properties.

source: Press :kbd:`Ctrl+Q` to bring up the Properties window. Click on the dropdown next to ``Scale`` and select ``1.0``. Then click on the ``Graph`` tab.
fr_ca: Appuyez sur :kbd:`Ctrl + Q` pour afficher la fenêtre Propriétés. Cliquez sur le menu déroulant à côté de ``Scale`` et sélectionnez ``1.0``. Cliquez ensuite sur l'onglet ``Graph``.
zh_cn: 按:kbd:`Ctrl+Q` 以打开“属性”窗口。单击``比例''旁边的下拉菜单，然后选择``1.0''。然后单击``图形''选项卡。

source: Configure Graph Properties
es_mx: Configurar las propiedades de los gráficos
fr_ca: Configurer le graphique
tr_tr: Grafik Özelliklerini Yapılandırın
zh_cn: 配置图形特征

source: Moving to the Graph tab the Maximum field under Vertical Scale is highlighted.
fr_ca: En vous déplaçant vers l’onglet Graph, le champ Maximum sous Vertical Scale est mis en surbrillance.

source: In the ``Maximum Box`` under ``Vertical Scale`` enter 917504 (this is 7 Megabits converted to Bytes). If desired, turn on the horizontal grid by checking the box. Then click ``OK`` to close the dialog.
es_mx: En la "Caja Máxima" bajo la "Escala Vertical" introduzca 917504 (esto es 7 Megabits convertidos en Bytes). Si lo desea, active la cuadrícula horizontal marcando la casilla. Luego haz clic en ``OK`` para cerrar el diálogo.
fr_ca: Au paramètre ``Maximum Box`` sous ``Vertical Scale`` tapez 917504 (7 mégabits convertis en octets). Si vous le souhaitez, activez la grille horizontale en cochant la case. Cliquez ensuite sur ``OK`` pour fermer la boîte de dialogue.
tr_tr: ``Vertical Scale`` altındaki ``Maximum Box`` alanına 917504 girin (bu Byte'a dönüştürülmüş 7 Megabittir). İsterseniz, kutuyu işaretleyerek yatay ızgarayı açın. Ardından iletişim kutusunu kapatmak için ``OK`` a tıklayın.
zh_cn: 在``垂直比例''下的``最大框''中，输入917504（这是7兆字节转换为字节）。如果需要，请选中该框以打开水平网格。然后单击``确定''关闭对话框。

source: Viewing Bandwidth Usage
es_mx: Ver el uso del ancho de banda
fr_ca: Observer l'usage de la bande passante
tr_tr: Bant Genişliği Kullanımını Görüntüleme
zh_cn: 查看带宽使用情况

source: Observing the bandwidth usage on the chart screen.
fr_ca: Observation de l’utilisation de la bande passante sur l’écran du graphique.

source: You may now connect to your robot as normal over the selected interface (if you haven't done so already). The graph will show the total bandwidth usage of the connection, with the bandwidth cap at the top of the graph. The Last, Average, Min and Max values are also displayed at the bottom of the graph. Note that these values are in Bytes/Second meaning the cap is 917,504. With just the Driver Station open you should see a flat line at ~100000 Bytes/Second.
es_mx: Ahora puedes conectarte a tu robot de forma normal a través de la interfaz seleccionada (si no lo has hecho ya). El gráfico mostrará el uso total del ancho de banda de la conexión, con el tope de ancho de banda en la parte superior del gráfico. Los valores Último, Promedio, Mínimo y Máximo también se muestran en la parte inferior del gráfico. Ten en cuenta que estos valores están en Bytes/Segundo, lo que significa que el tope es de 917.504. Con sólo la Estación del Conductor abierta deberías ver una línea plana a ~100000 Bytes/Segundo.
fr_ca: Vous pouvez maintenant vous connecter normalement au robot sur l'interface sélectionnée (si vous ne l'avez pas déjà fait). Le graphique affiche l'utilisation totale de la bande passante de la connexion, avec le plafond de bande passante en haut du graphique. Les valeurs Last, Average, Min et Max sont également affichées en bas du graphique. Notez que ces valeurs sont en octets/seconde, ce qui signifie que le plafond est de 917 504. Avec juste Driver Station ouvert, vous devriez voir une ligne plate à ~ 100000 octets/seconde.
tr_tr: Artık robotunuza seçilen arayüz üzerinden normal şekilde bağlanabilirsiniz (henüz yapmadıysanız). Grafik, grafiğin üst kısmındaki bant genişliği sınırı ile bağlantının toplam bant genişliği kullanımını gösterecektir. Last, Average, Min ve Max değerleri de grafiğin altında görüntülenir. Bu değerlerin Bayt/Saniye cinsinden olduğunu, yani sınırın 917.504 olduğunu unutmayın. Driver Station açıkken ~100000 Byte/Saniye'de düz bir çizgi görmelisiniz.
zh_cn: 现在，您可以通过所选接口正常连接机器人（如果尚未连接）。该图将显示该连接的总带宽使用情况，带宽上限位于该图的顶部。最后，平均值，最小值和最大值也显示在图形的底部。请注意，这些值以字节/秒为单位，表示上限为917,504。在仅打开Driver Station的情况下，您应该会看到一条〜100000 Bytes / Second的扁平线。

source: Measuring Bandwidth Usage using Wireshark
es_mx: Medición del uso de banda ancha usando Wireshark
fr_ca: Mesurer l'usage de la bande passante avec Wireshark
tr_tr: Wireshark kullanarak Bant Genişliği Kullanımını Ölçme
zh_cn: 使用Wireshark测量带宽使用情况

source: If you are not using Windows 7, you will need to install a 3rd party program to monitor bandwidth usage. One program that can be used for this purpose is Wireshark. Download and install the latest version of Wireshark for your version of Windows. After installation is complete, locate and open Wireshark. Connect your computer to your robot, open the Driver Station and any Dashboard or custom programs you may be using.
es_mx: Si no utiliza Windows 7, deberá instalar un programa de 3ros para supervisar el uso del ancho de banda. Un programa que puede ser usado para este propósito es Wireshark. Descargue e instale la última versión de Wireshark para su versión de Windows. Una vez completada la instalación, localice y abra Wireshark. Conecte el ordenador al robot, abra la Driver Station y cualquier Dashboard o programa personalizado que pueda estar utilizando.
fr_ca: Si vous n'utilisez pas Windows 7, vous devrez installer un programme tiers pour surveiller l'utilisation de la bande passante. Un programme qui peut être utilisé à cette fin est Wireshark. Téléchargez et installez la dernière version de Wireshark pour votre version de Windows. Une fois l'installation terminée, recherchez et ouvrez Wireshark. Connectez votre ordinateur à votre robot, ouvrez Driver Station et Dashboard ou des programmes personnalisés que vous utilisez.
tr_tr: Windows 7 kullanmıyorsanız, bant genişliği kullanımını izlemek için bir 3. parti bir programı yüklemeniz gerekecektir. Bu amaçla kullanılabilecek programlardan biri Wireshark'tır. Windows sürümünüz için Wireshark'ın en son sürümünü indirin ve yükleyin. Kurulum tamamlandıktan sonra, Wireshark'ı bulun ve açın. Bilgisayarınızı robotunuza bağlayın, Driver Station'ı ve kullandığınız herhangi bir Kontrol Panelini veya özel programları açın.
zh_cn: 如果您未使用Windows 7，则需要安装第三方程序来监视带宽使用情况。 Wireshark是可用于此目的的一个程序。下载并为您的Windows版本安装最新版本的Wireshark。安装完成后，找到并打开Wireshark。将计算机连接到机器人，打开Driver Station以及您可能正在使用的任何仪表板或自定义程序。

source: Select the interface and Start capture
es_mx: Seleccione la interfaz e inicie la captura
fr_ca: Sélectionner l'interface et lancer la capture
tr_tr: Arayüzü seçin ve yakalamayı başlatın
zh_cn: 选择界面并开始捕获

source: Selecting the Start button and choosing the NIC in Wireshark.
fr_ca: Sélectionnez le bouton Démarrer et choisissez la carte réseau dans Wireshark.

source: In the Wireshark program on the left side, select the interface you are using to connect to the robot and click ``Start``.
es_mx: En el programa Wireshark, a la izquierda, selecciona la interfaz que estás usando para conectarte al robot y haz clic en ``Start``.
fr_ca: Dans le programme Wireshark sur le côté gauche, sélectionnez l'interface que vous utilisez pour vous connecter au robot et cliquez sur ``Start``.
tr_tr: Sol taraftaki Wireshark programında, robota bağlanmak için kullandığınız arayüzü seçin ve ``Start`` a tıklayın.
zh_cn: 在左侧的Wireshark程序中，选择用于连接到机器人的接口，然后单击``开始''。

source: Open Statistics Summary
es_mx: Resumen de estadísticas abiertas
fr_ca: Résumé statistique
tr_tr: Statistics Summary Açın
zh_cn: 打开统计摘要

source: In the menu bar at the top choosing "Statistics" then "Summary"
fr_ca: Dans la barre de menu en haut, choisissez "Statistics" puis "Summary"

source: Let the capture run for at least 1 minute, then click ``Statistics`` then ``Summary``.
es_mx: Deje que la captura se ejecute durante al menos 1 minuto, luego haga clic en "Estadísticas" y luego en "Resumen".
fr_ca: Laissez la capture s'exécuter pendant au moins 1 minute, puis cliquez sur ``Statistics``, puis ``Summary``.
tr_tr: Yakalamanın en az 1 dakika çalışmasına izin verin, ardından ``Statistics`` ve ardından ``Summary`` i tıklayın.
zh_cn: 让捕获运行至少1分钟，然后单击“统计”，然后单击“摘要”。

source: View Bandwidth Usage
es_mx: Ver el uso de la banda ancha
fr_ca: Utilisation de la bande passante
tr_tr: Bant Genişliği Kullanımını Görüntüleyin
zh_cn: 查看带宽使用情况

source: Looking at the "Avg. MBit/sec" field of the Wireshark summary.
fr_ca: En regardant le champ "Avg. MBit/sec" du résumé Wireshark.

source: Average bandwidth usage, in Megabits/Second is displayed near the bottom of the summary window.
es_mx: El uso promedio de ancho de banda, en Megabits/Segundo se muestra cerca de la parte inferior de la ventana de resumen.
fr_ca: L'utilisation moyenne de la bande passante, en mégabits/seconde, s'affiche en bas de la fenêtre du résumé.
tr_tr: Megabit/Saniye cinsinden ortalama bant genişliği kullanımı özet penceresinin altına yakın bir yerde görüntülenir.
zh_cn: 摘要窗口底部附近显示以兆位/秒为单位的平均带宽使用量。

source: On the FRC Field (and at home when the radio is configured using the FRC Bridge Configuration Utility) each team is limited to 4Mb/s of network traffic (see the `FMS Whitepaper <https://wpilib.screenstepslive.com/s/fms/m/whitepaper/l/608744-fms-whitepaper>`__ for more details). The FMS Whitepaper provides information on determining the bandwidth usage of the Axis camera, but some teams may wish to measure their overall bandwidth consumption. This document details how to make that measurement.
es_mx: En el campo FRC (y en casa cuando la radio está configurada usando la Utilidad de Configuración de Puentes FRC) cada equipo está limitado a 4Mb/s de tráfico de red (ver el `FMS Whitepaper <https://wpilib.screenstepslive.com/s/fms/m/whitepaper/l/608744-fms-whitepaper>`__ para más detalles). El Informe técnico de FMS proporciona información para determinar el uso del ancho de banda de la cámara Axis, pero algunos equipos pueden querer medir su consumo de ancho de banda total. Este documento detalla cómo hacer esa medición.
tr_tr: FRC Alanında (ve radyo, FRC Bridge Configuration Utility Programı kullanılarak yapılandırıldığında evde) her ekip 4Mb/s ağ trafiği ile sınırlıdır ( daha fazla detay için`FMS Whitepaper <https://wpilib.screenstepslive.com/s/fms/m/whitepaper/l/608744-fms-whitepaper>`__ ). FMS White Paper, Axis kameranın bant genişliği kullanımının belirlenmesi hakkında bilgi sağlar, ancak bazı ekipler genel bant genişliği tüketimini ölçmek isteyebilir. Bu belge, bu ölçümün nasıl yapılacağını açıklamaktadır.

source: Windows 7 contains a built-in tool called the Performance Monitor that can be used to monitor the bandwidth usage over a network interface.
es_mx: Windows 7 contiene una herramienta incorporada llamada Monitor de Rendimiento que puede ser usada para monitorear el uso del ancho de banda a través de una interfaz de red.
tr_tr: Windows 7, bir ağ arabirimi üzerinden bant genişliği kullanımını izlemek için kullanılabilen Performance Monitor adı verilen yerleşik bir araç içerir.
