Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/networking-basics.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Networking Basics
es_mx: Conceptos Básicos de Redes
fr_ca: Bases de la réseautique
tr_tr: Ağ Temelleri
zh_cn: 网络基础

source: What is an IP Address?
es_mx: ¿Qué es una Dirección IP?
fr_ca: Qu’est-ce qu’une adresse IP ?
tr_tr: IP Adresi nedir?
zh_cn: 什么是IP地址？

source: An IP address is a unique string of numbers, separated by periods that identifies each device on a network. Each IP address is divided up into 4 sections (octets) ranging from 0-255.
es_mx: Una dirección IP es una cadena única de números, separados por periodos que identifican cada dispositivo en la red. Cada dirección IP está dividida en 4 secciones (octetos) desde 0-255.
fr_ca: Une adresse IP est une série unique de nombres, séparés par des points qui identifie chaque périphérique sur un réseau. Chaque adresse IP est divisée en 4 sections (octets) allant de 0 à 255.
tr_tr: IP adresi, bir ağdaki her bir cihazı tanımlayan, noktalarla ayrılmış kendine has bir sayı dizisidir. Her IP adresi 0-255 arasında değişen 4 bölüme (oktetlere) bölünmüştür.
zh_cn: IP地址是一串唯一的数字字符串，由英文句点分隔标识网络上的每个设备。每个IP地址分为4个部分（八位字节），范围从0-255。

source: The octet breakdown of an IP address and how it totals 4 bytes.
fr_ca: La répartition des octets d’une adresse IP et comment il totalise 4 octets.

source: As shown above, this means that each IP address is a 32-bit address meaning there are 2\ :sup:`32` addresses, or nearly 4,300,000,000 addresses possible. However, most of these are used publicly for things like web servers.
es_mx: Como se muestra anteriormente, esto significa que cada dirección IP es una dirección de 32-bits, esto quiere decir que hay 2\ :sup:`32` direcciones, o cerca de 4,300,000,000 direcciones posibles. Como sea, la mayoría de éstas son usadas públicamente para cosas como servidores web.
fr_ca: Comme indiqué ci-dessus, cela signifie que chaque adresse IP est une adresse de 32 bits ce qui signifie qu’il y a 2\ :sup:`32` adresses, ou près de 4.300.000.000 adresses possibles. Cependant, la plupart d’entre elles sont utilisées publiquement dans des applications telles que les serveurs Web.
tr_tr: Yukarıda gösterildiği gibi, bu, her IP adresinin 32 bitlik bir adres olduğu anlamına gelir, yani 2\ :sup:`32` adres veya yaklaşık 4.300.000.000 adres olasıdır. Ancak bunların çoğu, web sunucuları gibi şeyler için halka açık olarak kullanılmaktadır.
zh_cn: 如上所示，这意味着每个IP地址都是32位地址，这意味着有2\ :sup:`32`个地址，或者可能有近4300000000个地址。然而，其中大多数都公开用于web服务器之类的东西。

source: This brings up our **first key point** of IP Addressing: Each device on the network must have a unique IP address. No two devices can have the same IP address, otherwise collisions will occur.
es_mx: Esto trae nuestro **primer punto clave** de direccionamiento de IP: Cada dispositivo en la red tiene que tener una dirección IP única. Dos dispositivos no pueden tener la misma dirección IP, de otra manera pueden ocurrir colisiones.
fr_ca: Cela soulève notre **premier élément clé** de l’adressage IP: Chaque appareille sur le réseau doit avoir une adresse IP unique. Il n'est pas possible pour deux appareils d'avoir la même adresse IP, sinon des collisions se produiront.
tr_tr: Bu, IP Adreslemenin **ilk anahtar noktasını** ortaya çıkarır: Ağdaki her cihazın benzersiz bir IP adresi olmalıdır. İki cihaz aynı IP adresine sahip olamaz, aksi takdirde çakışmalar meydana gelir.
zh_cn: 这带来了我们IP寻址的“第一个关键点”：网络上的每个设备都必须具有唯一的IP地址。两个设备不能具有相同的IP地址，否则会发生冲突。

source: Since there are only 4-billion addresses, and there are more than 4-billion computers connected to the internet, we need to be as efficient as possible with giving out IP addresses. This brings us to public vs. private addresses.
es_mx: Desde que hay solo 4-mil millones de direcciones, y más de 4-mil millones de computadoras conectadas al internet, tenemos que ser lo más eficientes posible dando direcciones IP. Esto nos trae direcciones públicas vs. privadas.
fr_ca: Comme il n’y a que 4 milliards d’adresses, et qu’il y a plus de 4 milliards d’ordinateurs connectés à Internet, nous devons être aussi efficaces que possible dans l'attribution des adresses IP. Ce qui nous conduit sur le sujet des adresses publiques par rapport à des adresses privées.
tr_tr: Yalnızca 4 milyar adres olduğu ve internete bağlı 4 milyardan fazla bilgisayar olduğu için, IP adreslerini vermek konusunda olabildiğince verimli olmalıyız. Bu bizi genel ve özel adreslere götürür.
zh_cn: 由于只有40亿个地址，并且有超过40亿台计算机连接到互联网，因此我们需要在提供IP地址的同时尽可能地提高效率。这将我们带到了公共地址与私有地址之间。

source: Public vs Private IP Addresses
es_mx: Direcciones Públicas vs Privadas
fr_ca: Adresses IP publiques vs privées
tr_tr: Genel ve Özel IP Adresleri
zh_cn: 公有IP地址与私有IP地址

source: To be efficient with using IP Addresses, the idea of "Reserved IP Ranges" was implemented. In short, this means that there are ranges of IP Addresses that will never be assigned to web servers, and will only be used for local networks, such as those in your house.
es_mx: Para ser eficientes con el uso de las direcciones IP, la idea de "Rangos de IP reservados" fue implementada. En resumen, esto significa que hay rangos de direcciones IP que no serán asignados a servidores web, y serán solamente usados por redes locales, como las de su casa.
fr_ca: Pour être efficace avec l’utilisation des adresses IP, l’idée de "plages d'adresses IP réservées" a été implémentée. En bref, cela signifie qu’il existe des plages d’adresses IP qui ne seront jamais attribuées à des serveurs Web, et ne seront utilisées que pour les réseaux locaux, tels que ceux de votre maison.
zh_cn: 为了有效使用IP地址，实施了“保留IP范围”的想法。简而言之，这意味着有些IP地址范围永远不会分配给Web服务器，而只会用于本地网络，例如您家中的那些。

source: **Key point #2**: Unless you a directly connecting to your internet provider’s basic modem (no router function), your device will have an IP Address in one of these ranges. This means that at any local network, such as: your school, work office, home, etc., your device will 99% of the time have an IP address in a range listed below:
es_mx: **Punto clave #2**: A menos que se esté conectando directamente al módem de tu proveedor de internet básico (sin función de enrutador), su dispositivo va a tener una Dirección IP en uno de estos rangos. Esto significa que en cualquier red local, como: la de su escuela, oficina de trabajo, casa, etc., el dispositivo el 99% de las veces va a tener una dirección IP en un rango enumerado como el siguiente:
fr_ca: **Élément clé #2**: À moins que vous ne vous connectiez directement au modem de base de votre fournisseur d’accès Internet (pas de fonction de routeur), votre appareil aura une adresse IP dans l’une de ces plages. Cela signifie que dans n’importe quel réseau local, comme : votre école, votre bureau au travail, votre domicile, etc., votre appareil aura 99 % du temps une adresse IP dans l'une des plages énumérées ci-dessous :
tr_tr: **Anahtar nokta #2**: İnternet sağlayıcınızın temel modemine doğrudan bağlanmadığınız sürece (yönlendirici işlevi yok), cihazınız bu aralıklardan birinde bir IP Adresine sahip olacaktır. Bu; okulunuz, iş ofisiniz, eviniz vb. herhangi bir yerel ağda cihazınızın %99'unda aşağıda listelenen aralıkta bir IP adresine sahip olacağı anlamına gelir:
zh_cn: **关键点2 **：除非您直接连接到互联网提供商的基本调制解调器（没有路由器功能），否则您的设备将具有以下范围之一的IP地址。这意味着在任何本地网络（例如您的学校，办公室，家庭等）中，您的设备将有99％的时间拥有以下所列范围内的IP地址：

source: These reserved ranges let us assign one "unreserved IP Address" to an entire house, and then use multiple addresses in a reserved range to connect more than one computer to the internet. A process on the home’s internet router known as **NAT** (Network Address Translation), handles the process of keeping track which private IP is requesting data, using the public IP to request that data from the internet, and then passing the returned data back to the private IP that requested it. This allows us to use the same reserved IP addresses for many local networks, without causing any conflicts. An image of this process is presented below.
es_mx: Estos rangos reservados nos permiten asignar una "dirección IP no reservada" a toda una casa, y luego utilizar múltiples direcciones en un rango reservado para conectar más de un ordenador a Internet. Un proceso en el router de internet de la casa conocido como **NAT** (Network Address Translation), maneja el proceso de mantener un registro de qué IP privada está solicitando datos, usando la IP pública para solicitar esos datos desde internet, y luego pasando los datos devueltos a la IP privada que los solicitó. Esto nos permite utilizar las mismas direcciones IP reservadas para muchas redes locales, sin causar ningún conflicto. A continuación se presenta una imagen de este proceso.
fr_ca: Ces plages réservées nous permettent d’attribuer une "adresse IP sans réserve" à une maison entière, puis d’utiliser plusieurs adresses dans une plage réservée pour connecter plus d’un ordinateur à Internet. Un processus sur le routeur Internet de la maison connu sous le nom de **NAT** (Traduction d’adresses réseau), gère le processus de suivi de l’IP privée qui demande des données, en utilisant l’IP publique pour demander ces données à partir d’Internet, puis en transmettant les données retournées à l’IP privée qui les a demandés. Ce qui nous permet d’utiliser les mêmes adresses IP réservées pour de nombreux réseaux locaux, sans provoquer de conflits. Une image de ce processus est présentée ci-dessous.
zh_cn: 这些保留范围使我们可以为整个房屋分配一个“未保留的IP地址”，然后使用保留范围内的多个地址将多台计算机连接到Internet。家庭互联网路由器上的一个称为NAT（网络地址转换）的过程负责处理以下过程：跟踪哪个私有IP正在请求数据，使用公共IP从Internet请求该数据，然后传递返回的数据。数据返回到请求它的专用IP。这使我们可以为许多本地网络使用相同的保留IP地址，而不会引起任何冲突。下面显示了此过程的图像。

source: Devices on the private network send their traffic through the NAT device to communicate to the outside network and vice versa.
fr_ca: Les périphériques sur le réseau privé envoient leur trafic via le périphérique NAT pour communiquer avec le réseau externe et vice versa.

source: For the FRC\ |reg| networks, we will use the ``10.0.0.0`` range. This range allows us to use the ``10.TE.AM.xx`` format for IP addresses, whereas using the Class B or C networks would only allow a subset of teams to follow the format. An example of this formatting would be ``10.17.50.1`` for FRC Team 1750.
es_mx: Para las redes FRC \ |reg| , usaremos el rango ``10.0.0.0``. Este rango nos permite usar el formato ``10.TE.AM.xx`` para direcciones IP, mientras que usar las redes Clase B o C solo permitiría que un subconjunto de equipos siguiera el formato. Un ejemplo de este formato sería ``10.17.50.1`` para el equipo FRC 1750.
fr_ca: Pour les réseaux FRC\ |reg|, nous utiliserons la plage ``10.0.0.0``. Cette plage nous permet d’utiliser le format ``10.TE.AM.xx`` pour les adresses IP, alors que l’utilisation des réseaux de classe B ou C ne permettrait qu’à un sous-ensemble d’équipes de suivre le format. Un exemple d'utilisation de ce format serait ``10.17.50.1`` pour FRC Team 1750.
tr_tr: FRC için \| reg| networks, ``10.0.0.0``aralığını kullanacağız. Bu aralık, IP adresleri için ``10.TE.AM.xx`` formatını kullanmamıza izin verirken, Sınıf B veya C ağları kullanmak, yalnızca bir takım alt kümesinin formatı takip etmesine izin verir. Bu biçimlendirmenin bir örneği, FRC Team 1750 için ``10.17.50.1`` olabilir.
zh_cn: 对于FRC \ | reg |网络，我们将使用“ 10.0.0.0”范围。此范围允许我们对IP地址使用“ 10.TE.AM.xx”格式，而使用B级或C级网络将仅允许一部分团队遵循该格式。对于FRC Team 1750，这种格式的示例为``10.17.50.1''。

source: How are these addresses assigned?
es_mx: ¿Cómo se asignan éstas direcciones?
fr_ca: Comment ces adresses sont-elles attribuées ?
tr_tr: Bu adresler nasıl atanır?
zh_cn: 这些地址如何分配？

source: We’ve covered the basics of what IP addresses are, and which IP addresses we will use for the FRC competition,so now we need to discuss how these addresses will get assigned to the devices on our network. We already stated above that we can’t have two devices on the same network with the same IP Address, so we need a way to be sure that every device receives an address without overlapping. This can be done Dynamically (automatic), or Statically (manual).
es_mx: Nosotros hemos cubierto lo básico de lo que es una dirección IP, y cual dirección IP usaremos para la competencia FRC, entonces ahora tenemos que discutir como éstas direcciones van a ser asignadas a los dispositivos de nuestra red. Ya establecimos que no podemos tener dos dispositivos en la misma red con la misma dirección IP, entonces necesitamos una manera de estar seguros que todos los dispositivos reciben una dirección sin superponerse. Esto puede ser hecho Dinámicamente (automático), o Estáticamente (manual).
fr_ca: Nous avons couvert les bases de ce que sont les adresses IP, et quelles adresses IP nous allons utiliser pour la compétition FRC, aussi allons-nous maintenant discuter de la façon dont ces adresses seront attribuées aux appareils sur notre réseau. Nous avons déjà mentionné plus haut que nous ne pouvons pas avoir deux appareils sur le même réseau avec la même adresse IP, nous avons donc besoin d’un moyen de s’assurer que chaque appareil reçoit une adresse sans se chevaucher. Cette opération peut être faite dynamiquement (automatique), ou statiquement (manuel).
tr_tr: IP adreslerinin ne olduğu ve FRC yarışması için hangi IP adreslerini kullanacağımızın temellerini ele aldık, bu yüzden şimdi bu adreslerin ağımızdaki cihazlara nasıl atanacağını tartışmamız gerekiyor. Yukarıda, aynı ağ üzerinde aynı IP Adresine sahip iki cihazımız olamayacağını belirtmiştik, bu nedenle her cihazın çakışmadan bir adres aldığından emin olmak için bir yola ihtiyacımız var. Bu, Dinamik (otomatik) veya Statik (manuel) olarak yapılabilir.
zh_cn: 我们已经介绍了什么是IP地址，以及我们将在FRC竞赛中使用的IP地址的基础知识，因此现在我们需要讨论如何将这些地址分配给我们网络上的设备。上面我们已经说过，我们不能在同一网络上的两个设备具有相同的IP地址，因此我们需要一种方法来确保每个设备都收到一个不重叠的地址。这可以动态（自动）或静态（手动）完成。

source: Dynamically
es_mx: Dinámicamente
fr_ca: Dynamiquement
tr_tr: Dinamik Atama
zh_cn: 动态地

source: Dynamically assigning IP addresses means that we are letting a device on the network manage the IP address assignments. This is done through the Dynamic Host Configuration Protocol (DHCP). DHCP has many components to it, but for the scope of this document, we will think of it as a service that automatically manages the network. Whenever you plug in a new device to the network, the DHCP service sees the new device, then provides it with an available IP address and the other network settings required for the device to communicate. This can mean that there are times we do not know the exact IP address of each device.
es_mx: Asignar una dirección IP dinámicamente quiere decir que estamos dejando un dispositivo en la red manejar las asignaciones de la dirección IP. Esto se hace mediante el Protocolo de Configuración de Huésped Dinámico (DHCP, por sus siglas en inglés). DHCP tiene muchos componentes a el, pero para el alcance de éste documento, vamos a pensar en el como un servicio que automáticamente maneja la red. Cuando se conecta a un nuevo dispositivo a la red, el servicio DCHP ve el nuevo dispositivo, después le proporciona con una dirección IP disponible y la otra configuración de red necesaria para que se comunique el dispositivo. Esto puede significar que hay veces que no sabemos la IP exacta de cada dispositivo.
fr_ca: L’attribution dynamique d’adresses IP signifie que nous laissons un périphérique sur le réseau gérer les attributions d’adresses IP. Cela se fait par l’intermédiaire du protocole de configuration dynamique des hôtes (DHCP). DHCP contient de nombreux composants, mais pour la portée de ce document, nous allons le considérer comme un service qui gère automatiquement le réseau. Chaque fois que vous branchez un nouvel appareil au réseau, le service DHCP voit le nouvel appareil, puis lui fournit une adresse IP disponible ainsi que les autres paramètres réseau requis pour que l’appareil communique. Cela peut signifier qu’il y a des moments où nous ne connaissons pas l’adresse IP exacte de chaque appareil.
tr_tr: IP adreslerini dinamik olarak atamak, ağdaki bir cihazın IP adresi atamalarını yönetmesine izin verdiğimiz anlamına gelir. Bu, Dinamik Ana Bilgisayar Yapılandırma Protokolü (DHCP) aracılığıyla yapılır. DHCP'nin birçok bileşeni vardır, ancak bu belgenin kapsamı için, bunu ağı otomatik olarak yöneten bir hizmet olarak düşüneceğiz. Ağa yeni bir aygıt bağladığınızda, DHCP hizmeti yeni aygıtı görür, ardından ona kullanılabilir bir IP adresi ve aygıtın iletişim kurması için gereken diğer ağ ayarlarını sağlar. Bu, her cihazın tam IP adresini bilmediğimiz zamanlar olduğu anlamına gelebilir.
zh_cn: 动态分配IP地址意味着我们让网络上的设备管理IP地址分配。这是通过动态主机配置协议（DHCP）完成的。 DHCP具有许多组件，但是在本文档的范围内，我们会将其视为自动管理网络的服务。每当您将新设备插入网络时，DHCP服务都会看到该新设备，然后为其提供可用的IP地址以及该设备进行通信所需的其他网络设置。这可能意味着有时我们不知道每个设备的确切IP地址。

source: What is a DHCP server?
es_mx: ¿Qué es un servidor DHCP?
fr_ca: Qu’est-ce qu’un serveur DHCP ?
tr_tr: DHCP sunucusu nedir?
zh_cn: 啥是DHCP服务器?

source: A DHCP server is a device that runs the DHCP service to monitor the network for new devices to configure. In larger businesses, this could be a dedicated computer running the DHCP service and that computer would be the DHCP server. For home networks, FRC networks, and other smaller networks, the DHCP service is usually running on the router; in this case, the router is the DHCP server.
es_mx: Un servidor DHCP es un dispositivo que ejecuta el servicio DHCP para supervisar la red para nuevos dispositivos que configurar. En negocios más grandes, esto puede ser una computadora dedicada a correr el servicio DHCP y esa computadora puede ser el servidor DHCP. Para redes en casa, para FRC y otras redes pequeñas, el servidor DHCP usualmente corre en un enrutador; en este caso, el enrutador es el servidor DHCP.
fr_ca: Un serveur DHCP est un périphérique qui exécute le service DHCP pour surveiller le réseau et détecter les nouveaux périphériques à configurer. Dans les grandes entreprises, il pourrait s’agir d’un ordinateur dédié qui exécute le service DHCP et cet ordinateur serait le serveur DHCP. Pour les réseaux domestiques, les réseaux FRC et d’autres réseaux plus petits, le service DHCP s’exécute généralement sur le routeur ; dans ce cas, le routeur est le serveur DHCP.
tr_tr: Bir DHCP sunucusu, yapılandırılacak yeni cihazlar için ağı izlemek üzere DHCP hizmetini çalıştıran bir cihazdır. Daha büyük işletmelerde, bu DHCP hizmetini çalıştıran özel bir bilgisayar olabilir ve bu bilgisayar DHCP sunucusu olabilir. Ev ağları, FRC ağları ve diğer küçük ağlar için, DHCP hizmeti genellikle yönlendirici üzerinde çalışır; bu durumda, yönlendirici DHCP sunucusudur.
zh_cn: DHCP服务器是运行DHCP服务以监视网络中要配置的新设备的设备。在大型企业中，这可能是运行DHCP服务的专用计算机，而该计算机将是DHCP服务器。对于家庭网络，FRC网络和其他较小的网络，DHCP服务通常在路由器上运行。在这种情况下，路由器就是DHCP服务器。

source: This means that if you ever run into a situation where you need to have a DHCP server assigning IP addresses to your network devices, it’s as simple as finding the closest home router, and plugging it in.
es_mx: Esto significa que si alguna vez está en una situación donde necesita tener un servidor DHCP asignando direcciones IP a sus dispositivos de red, es simple como encontrar el enrutador doméstico más cercano, y conectarlo.
fr_ca: Cela signifie que si jamais vous vous retrouvez dans une situation où vous devez avoir un serveur DHCP assignant des adresses IP à vos périphériques réseau, il est aussi simple que de trouver le routeur domestique le plus proche, et de le brancher.
tr_tr: Bu, ağ cihazlarınıza IP adresleri atayan bir DHCP sunucusuna sahip olmanız gereken bir durumla karşılaşırsanız, en yakın ev yönlendiricisini bulup fişe takmak kadar basit olduğu anlamına gelir.
zh_cn: 这意味着，如果遇到需要DHCP服务器为网络设备分配IP地址的情况，这就像找到最近的家用路由器并将其插入一样简单。

source: Statically
es_mx: Estáticamente
fr_ca: Statiquement
tr_tr: Statik Atama
zh_cn: 静态

source: Statically assigning IP addresses means that we are manually telling each device on the network which IP address we want it to have. This configuration happens through a setting on each device. By disabling DHCP on the network and assigning the addresses manually, we get the benefit of knowing the exact IP address of each device on the network, but because we set each one manually and there is no service keeping track of the used IP addresses, we have to keep track of this ourselves. While statically setting IP addresses, we must be careful not to assign duplicate addresses, and must be sure we are setting the other network settings (such as subnet mask and default gateway) correctly on each device.
es_mx: Asignar direcciones IP estáticamente quiere decir que hay que decir manualmente a cada dispositivo en la red cual es la dirección IP que queremos que tenga. Esta configuración ocurre por un ajuste en cada dispositivo. Deshabilitando DHCP en la red y asignando las direcciones manualmente, tenemos el beneficio de saber la dirección IP de cada dispositivo en la red, pero porque nosotros establecemos cada uno manualmente y no hay servicio dando seguimiento de la dirección IP utilizada, nosotros tenemos que dar seguimiento de esto nosotros mismos. Mientras establecemos direcciones IP estáticamente, tenemos que ser cuidadosos con no asignar direcciones duplicadas, y debemos estar seguros que estamos estableciendo otro ajuste de red (como mascara de subconjunto y puerta de enlace predeterminada) correctamente en cada dispositivo.
fr_ca: L’attribution statique d’adresses IP signifie que nous disons manuellement à chaque appareil du réseau quelle adresse IP nous voulons qu’il ait. Cette configuration se produit à travers un paramètre sur chaque appareil. En désactivant DHCP sur le réseau et en assignant les adresses manuellement, nous avons l’avantage de connaître l’adresse IP exacte de chaque appareil sur le réseau, mais parce que nous avons attribué chacune manuellement et il n’y a pas de service de suivi des adresses IP utilisées, nous devons nous-mêmes garder une trace de cette information . Tout en définissant statiquement les adresses IP, nous devons faire attention à ne pas attribuer d’adresses en double, et nous devons être sûrs que nous configurons correctement les autres paramètres du réseau (tels que le masque de sous-réseau et la passerelle par défaut) sur chaque appareil.
tr_tr: Statik olarak IP adresleri atamak, ağdaki her cihaza sahip olmasını istediğimiz IP adresini manuel olarak söylediğimiz anlamına gelir. Bu yapılandırma, her cihazdaki bir ayar aracılığıyla gerçekleşir. Ağda DHCP'yi devre dışı bırakarak ve adresleri manuel olarak atayarak, ağdaki her bir cihazın tam IP adresini bilmenin avantajını elde ederiz, ancak her birini manuel olarak ayarladığımız ve kullanılan IP adreslerini takip eden bir hizmet olmadığından, bunu kendimiz takip etmeliyiz. IP adreslerini statik olarak ayarlarken, yinelenen adresler atamamaya dikkat etmeliyiz ve diğer ağ ayarlarını (alt ağ maskesi ve varsayılan ağ geçidi gibi) her cihazda doğru şekilde yaptığımızdan emin olmalıyız.
zh_cn: 静态分配IP地址意味着我们正在手动告诉网络上的每个设备我们希望它拥有哪个IP地址。通过每个设备上的设置进行此配置。通过禁用网络上的DHCP并手动分配地址，我们的好处是可以知道网络上每个设备的确切IP地址，但是由于我们手动设置了每个设备，并且没有服务跟踪使用的IP地址，因此必须自己对此进行跟踪。在静态设置IP地址时，我们必须注意不要分配重复的地址，并且必须确保我们在每个设备上正确设置了其他网络设置（例如子网掩码和默认网关）。

source: What is link-local?
es_mx: ¿Qué es un enlace local?
fr_ca: Qu’est-ce qu'un lien-local?
tr_tr: Yerel bağlantı nedir?
zh_cn: 什么是本地链接？
