Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/networking-basics.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: mDNS provides us the same benefits as traditional DNS, but is just implemented in a way that does not require a server. Whenever a user asks to connect to a device using a friendly name, mDNS sends out a message asking the device with that name to identify itself. The device with the name then sends a return message including its IP address so all devices on the network can update their information. mDNS is what allows us to refer to our roboRIO as ``roboRIO-TEAM-FRC.local`` and have it connect on a DHCP network.
es_mx: mDNS nos da los mismos beneficios que una DNS tradicional, pero ha implementado una manera que no requiere de servidor. Cuando el usuario quiere conectarse a un dispositivo usando un nombre amigable, mDNS manda un mensaje preguntando el dispositivo con ese nombre para poder identificarse. El dispositivo con el nombre después manda un mensaje de regreso incluyendo su dirección IP para que todos los dispositivos en la red puedan tener la nueva información. mDNS es lo que nos permite atribuir a nuestra roboRIO como ``roboRIO-TEAM-FRC.local`` y tenerla conectada en una red DHCP.
fr_ca: Le mDNS nous offre les mêmes avantages que le DNS traditionnel, mais est juste implémenté d’une manière qui ne nécessite pas un serveur. Chaque fois qu’un utilisateur demande à se connecter à un appareil à l’aide d’un nom convivial, le mDNS envoie un message demandant à l’appareil portant ce nom de s’identifier. L’appareil portant ce nom envoie alors un message de retour, y compris son adresse IP afin que tous les appareils du réseau puissent mettre à jour leurs informations. Le mDNS est ce qui nous permet de nous référer à notre roboRIO comme ``roboRIO-TEAM-FRC.local`` et de le faire connecter sur un réseau DHCP.
tr_tr: mDNS bize geleneksel DNS ile aynı avantajları sağlar, ancak bir sunucu gerektirmeyen bir şekilde uygulanır. Bir kullanıcı bir cihaza kolay bir ad kullanarak bağlanmak istediğinde, mDNS bu adı taşıyan cihazdan kendisini tanıtmasını isteyen bir mesaj gönderir. İsme sahip cihaz daha sonra IP adresini içeren bir geri dönüş mesajı gönderir, böylece ağdaki tüm cihazlar bilgilerini güncelleyebilir. mDNS, roboRIO'muza ``roboRIO-TEAM-FRC.local`` olarak atıfta bulunmamızı ve bir DHCP ağına bağlanmasını sağlayan şeydir.
zh_cn: mDNS为我们提供了与传统DNS相同的优势，但是仅以不需要服务器的方式实现。每当用户要求使用友好名称连接到设备时，mDNS都会发出一条消息，要求具有该名称的设备标识自己。然后，具有该名称的设备将发送包括其IP地址的返回消息，以便网络上的所有设备都可以更新其信息。 mDNS使我们可以将roboRIO称为``roboRIO-TEAM-FRC.local''并将其连接到DHCP网络上。

source: If a device used for FRC does not support mDNS, then it will be assigned an IP Address in the 10.TE.AM.20 - 10.TE.AM.255 range, but we won’t know the exact address to connect and we won’t be able to use the friendly name like before. In this case, the device would need to have a static IP Address.
es_mx: Si el dispositivo utilizado para FRC no soporta mDNS, entonces se le asignará una Dirección IP en el rango 10.TE.AM.20 - 10.TE.AM.255, pero no sabrá la dirección exacta a conectar y no seremos capaces de usar un nombre amigable como antes. En este caso, el dispositivo tendrá que tener ins dirección IP estática.
fr_ca: Si un périphérique utilisé pour la FRC ne prend pas en charge le mDNS, il lui sera attribué une adresse IP dans la plage 10.TE.AM.20 - 10.TE.AM.255, mais nous ne saurons pas l’adresse IP exacte pour nous connecter et nous ne serons pas, non plus, en mesure d’utiliser un nom convivial comme auparavant. Dans ce cas, ce périphérique devrait disposer d’une adresse IP statique.
tr_tr: FRC için kullanılan bir cihaz mDNS'yi desteklemiyorsa, ona 10.TE.AM.20 - 10.TE.AM.255 aralığında bir IP Adresi atanacaktır, ancak bağlanmak için tam adresi bilmeyeceğiz ve eskisi gibi kolay adını kullanamayacağız. Bu durumda, cihazın statik bir IP Adresine sahip olması gerekir.
zh_cn: 如果用于FRC的设备不支持mDNS，则会为该设备分配10.TE.AM.20-10.TE.AM.255范围内的IP地址，但我们不知道要连接的确切地址，我们将无法像以前一样使用友好名称。在这种情况下，设备将需要具有静态IP地址。

source: mDNS - Principles
es_mx: mDNS - Principios
fr_ca: mDNS - Principes
tr_tr: mDNS - İlkeleri
zh_cn: mDNS-原理

source: Multicast Domain Name System (mDNS) is a system which allows for resolution of host names to IP addresses on small networks with no dedicated name server. To resolve a host name a device sends out a multicast message to the network querying for the device. The device then responds with a multicast message containing it's IP. Devices on the network can store this information in a cache so subsequent requests for this address can be resolved from the cache without repeating the network query.
es_mx: Sistema de Nombres de Dominio de Multidifusión (mDNS) es un sistema que permite la resolución de nombres de usuario a direcciones IP en redes pequeñas sin servidor con nombre específico. Para resolver el nombre del usuario el dispositivo manda un mensaje de multidifusión a la red preguntando por el dispositivo. El dispositivo después responde con un mensaje de multidifusión con su dirección IP. Los dispositivos en la red pueden tener esta información en su caché para que las solicitudes posteriores para esta dirección se puedan resolver desde el caché sin repetir la consulta de red.
fr_ca: Multicast Domain Name System (mDNS) est un système qui permet de configurer les noms d’hôtes sur des adresses IP pour des petits réseaux sans serveur de noms dédié. Pour configurer un nom d’hôte, un périphérique envoie un message multidiffusion au réseau pour rechercher le périphérique. Le périphique répond ensuite par un message multidiffusion contenant son adresse IP. Les périphériques du réseau peuvent stocker ces informations dans un cache afin que les demandes ultérieures relatives à cette adresse puissent être résolues à partir du cache sans répéter la recherche du périphérique au réseau.
tr_tr: Multicast Domain Name System (mDNS), ana bilgisayar adlarının, özel ad sunucusu olmayan küçük ağlardaki IP adreslerine çözümlenmesine izin veren bir sistemdir. Bir ana bilgisayar adını çözmek için bir cihaz, cihazı sorgulayan ağa bir çok noktaya yayın mesajı gönderir. Cihaz daha sonra IP'sini içeren çok noktaya yayın mesajıyla yanıt verir. Ağdaki cihazlar bu bilgileri bir önbellekte saklayabilir, böylece bu adres için sonraki istekler ağ sorgusunu tekrarlamadan önbellekten çözümlenebilir.
zh_cn: 组播域名系统（mDNS）是一种在没有专用名称服务器的小型网络上允许将主机名解析为IP地址的系统。为了解析主机名，设备向网络发送多播消息以查询该设备。然后，设备以包含其IP的多播消息作为响应。网络上的设备可以将此信息存储在缓存中，因此可以从缓存中解决对该地址的后续请求，而无需重复网络查询。

source: mDNS - Providers
es_mx: mDNS - Proveedores
fr_ca: mDNS - Fournisseurs
tr_tr: mDNS - Sağlayıcılar
zh_cn: mDNS-提供者

source: To use mDNS, an mDNS implementation is required to be installed on your PC. Here are some common mDNS implementations for each major platform:
es_mx: Para usar mDNS, se necesita una implementación de mDNS para ser instalada en su PC. Aquí hay algunas implementaciones comunes de mDNS para cada plataforma:
fr_ca: Pour utiliser mDNS, une implémentation mDNS doit être installée sur votre PC. Voici quelques implémentations mDNS courantes pour chaque importante plate-forme:
tr_tr: mDNS'yi kullanmak için, PC'nize bir mDNS uygulamasının yüklenmesi gerekir. Her büyük platform için bazı yaygın mDNS uygulamaları şunlardır:
zh_cn: 要使用mDNS，必须在您的PC上安装mDNS工具。以下是每个主要平台的一些常见mDNS工具：

source: **NI mDNS Responder:** Installed with the NI FRC Game Tools
es_mx: **NI mDNS Responder:** Instalado con las herramientas de juego de NI FRC
fr_ca: **NI mDNS Responder:** Installé avec NI FRC Game Tools
tr_tr: **NI mDNS Responder:** NI FRC Game Tools ile Yüklenir
zh_cn: **NI mDNS Responder:** 用NI FRC Game Tools安装。

source: **Apple Bonjour:** Installed with iTunes
es_mx: **Apple Bonjour:** Instalado con iTunes
fr_ca: **Apple Bonjour:** Installé avec iTunes
tr_tr: **Apple Bonjour:** iTunes ile yüklenir
zh_cn: **Apple Bonjour:** iTunes内安装

source: **Apple Bonjour:** Installed by default
es_mx: **Apple Bonjour:** Instalado por defecto
fr_ca: **Apple Bonjour:** Installé par défaut
tr_tr: **Apple Bonjour:** Varsayılan olarak yüklenir
zh_cn: **Apple Bonjour:** 默认安装

source: **nss-mDNS/Avahi/Zeroconf:** Installed and enabled by default on some Linux variants (such as Ubuntu or Mint). May need to be installed or enabled on others (such as Arch)
es_mx: **nss-mDNS/Avahi/Zeroconf:** Instalado y habilitada por defecto en algunas variaciones de Linux (como Ubuntu o Mint). Puede necesitar que se instale o habilitada en otras (como Arch)
fr_ca: **nss-mDNS/Avahi/Zeroconf:** Installé et activé par défaut sur certaines variantes Linux (comme Ubuntu ou Mint). Peut avoir besoin d’être installé ou activé sur d’autres (comme Arch)
tr_tr: **nss-mDNS/Avahi/Zeroconf:** Bazı Linux varyantlarında (Ubuntu veya Mint gibi) varsayılan olarak yüklenir ve etkinleştirilir. Başkalarına yüklenmesi veya etkinleştirilmesi gerekebilir (Arch gibi)
zh_cn: **nss-mDNS/Avahi/Zeroconf:** 默认在某些Linux变体（例如Ubuntu或Mint）上安装并启用。可能需要在其他产品（例如Arch）上安装或启用

source: mDNS - Firewalls
fr_ca: mDNS - Pare-feu
tr_tr: mDNS - Güvenlik Duvarları
zh_cn: mDNS - 防火墙

source: Depending on your PC configuration, no changes may be required, this section is provided to assist with troubleshooting.
es_mx: Dependiendo en la configuración de la PC, no se requieren cambios, esta sección está para ayudar con la solución de problemas.
fr_ca: Selon la configuration de votre PC, aucun changement ne peut être nécessaire, cette section est fournie pour vous aider dans la résolution des problèmes.
tr_tr: Bilgisayar yapılandırmanıza bağlı olarak, herhangi bir değişiklik gerekmeyebilir, bu bölüm sorun gidermeye yardımcı olmak için sağlanmıştır.
zh_cn: 根据您的PC配置，可能不需要进行任何更改，此部分用于帮助进行故障排除。

source: To work properly mDNS must be allowed to pass through your firewall. Because the network traffic comes from the mDNS implementation and not directly from the Driver Station or IDE, allowing those applications through may not be sufficient. There are two main ways to resolve mDNS firewall issues:
es_mx: Para que mDNS trabaje bien debe dejar pasar a través de la firewall. Porque el tráfico de red viene de la implementación de mDNS y no directamente de la Driver Station o IDE, dejando esas aplicaciones pasar no puede ser suficiente. Hay dos maneras posibles de resolver los problemas de firewall de mDNS:
fr_ca: Pour fonctionner correctement, mDNS doit être autorisé à passer à travers votre pare-feu. Étant donné que le trafic réseau provient de l’implémentation mDNS et non directement de la Drive Station ou de l’IDE, l'autorisation de ces seules applications à passer à travers votre pare-feu pourrait ne pas suffire. Il existe deux façons principales de résoudre les problèmes de pare-feu mDNS :
tr_tr: Düzgün çalışması için mDNS'nin güvenlik duvarınızdan geçmesine izin verilmelidir. Ağ trafiği mDNS uygulamasından geldiğinden ve doğrudan Driver Station veya IDE'den gelmediğinden, bu uygulamalara izin vermek yeterli olmayabilir. mDNS güvenlik duvarı sorunlarını çözmenin iki ana yolu vardır:
zh_cn: 为了正常工作，必须允许mDNS穿过防火墙。因为网络流量来自mDNS实施，而不是直接来自Driver Station或IDE，所以仅允许那些应用程序通过是不够的。解决mDNS防火墙问题的主要方法有两种：

source: Add an application/service exception for the mDNS implementation (NI mDNS Responder is ``C:\Program Files\National Instruments\Shared\mDNS Responder\nimdnsResponder.exe``)
es_mx: Añadir una excepción de aplicación/servicio para la implementación de mDNS (NI mDNS Responder es ``C:\Program Files\National Instruments\Shared\mDNS Responder\nimdnsResponder.exe``)
fr_ca: Ajouter une exception d’application/service pour l’implémentation du mDNS (NI mDNS Responder est ``C:\Program Files\National Instruments\Shared\mDNS Responder\nimdnsResponder.exe``)
tr_tr: mDNS uygulaması için bir uygulama/hizmet istisnası ekleyin (NI mDNS Responder ``C:\Program Files\National Instruments\Shared\mDNS Responder\nimdnsResponder.exe``dir)
zh_cn: 为mDNS实施添加应用程序/服务例外（NI mDNS Responder为 ``C:\Program Files\National Instruments\Shared\mDNS Responder\nimdnsResponder.exe``）

source: Add a port exception for traffic to/from UDP 5353. IP Ranges:
es_mx: Añadir una excepción de puerto para tráfico de/para rangos IP UDP 5353.:
fr_ca: Ajoutez une exception de port pour le trafic vers/à partir de UDP 5353. Plages IP :
tr_tr: UDP 5353'e gelen/giden trafik için bir bağlantı noktası istisnası ekleyin. IP Aralıkları:
zh_cn: 为往返于UDP 5353的流量添加端口例外。IP范围：

source: mDNS - Browser support
es_mx: mDNS - Ayuda de Navegador
fr_ca: mDNS - Prise en charge des navigateurs
tr_tr: mDNS - Tarayıcı desteği
zh_cn: mDNS-浏览器支持

source: Most web-browsers should be able to utilize the mDNS address to access the roboRIO web server as long as an mDNS provider is installed. These browsers include Microsoft Edge, Firefox, and Google Chrome.
es_mx: La mayorpia de los navegadores deben de estar disponibles para usar la dirección mDNS para acceder al servidor we de la roboRIO mientras que el proveedor de mDNS esté instalado. Los navegadores incluyen Microsoft Edge, Firefox, y Google Chrome.
fr_ca: La plupart des navigateurs Web devraient être en mesure d’utiliser l’adresse mDNS pour accéder au serveur web du roboRIO tant qu’un fournisseur mDNS est installé. Ces navigateurs incluent Microsoft Edge, Firefox et Google Chrome.
tr_tr: Çoğu web tarayıcısı, bir mDNS sağlayıcısı kurulu olduğu sürece roboRIO web sunucusuna erişmek için mDNS adresini kullanabilmelidir. Bu tarayıcılar arasında Microsoft Edge, Firefox ve Google Chrome bulunur.
zh_cn: 只要安装了mDNS提供程序，大多数Web浏览器就应该能够使用mDNS地址访问roboRIO Web服务器。这些浏览器包括Microsoft Edge，Firefox和Google Chrome。

source: If using the USB interface, no network setup is required (you do need the :ref:`docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools` installed to provide the roboRIO USB Driver). The roboRIO driver will automatically configure the IP address of the host (your computer) and roboRIO and the software listed above should be able to locate and utilize your roboRIO.
es_mx: Si usa la interface USB, no se necesita ajustes de red (necesita :ref:`docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools` instalado para proporcionar el roboRIO USB Driver). El driver de la roboRIO va a configurar automáticamente la dirección IP del usuario (de la computadora) y la roboRIO y el software enumerado arriba deben de estar disponible para localizar y utilizar su roboRIO.
fr_ca: Si vous utilisez l’interface USB, aucune configuration réseau n’est requise (vous devez toutefois vous assurer d'avoir préalablement installé les outils de jeu :ref:`docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools` afin de fournir le pilote USB roboRIO). Le pilote roboRIO configurera automatiquement l’adresse IP de l’hôte (votre ordinateur) et du roboRIO et le logiciel mentionné ci-dessus devrait être en mesure de localiser et d’utiliser votre roboRIO.
tr_tr: USB arayüzünü kullanıyorsanız, ağ kurulumuna gerek yoktur (:ref:`docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools`'ye ihtiyacınız vardır). RoboRIO sürücüsü, ana bilgisayarın (bilgisayarınız) ve roboRIO'nun IP adresini otomatik olarak yapılandıracaktır ve yukarıda listelenen yazılım roboRIO'nuzu bulabilmeli ve kullanabilmelidir.
zh_cn: 如果使用USB接口，则无需进行网络设置（您将需要ref:`docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools`以提供roboRIO USB驱动）。 roboRIO驱动程序将自动配置主机（您的计算机）的IP地址，并且roboRIO和上面列出的软件应该能够找到并利用您的roboRIO。

source: Ethernet/Wireless
es_mx: Ethernet/Inalámbrica
fr_ca: Ethernet/Sans fil
zh_cn: 以太网/无线

source: The :ref:`docs/zero-to-robot/step-3/radio-programming:Programming your Radio` will enable the DHCP server on the OpenMesh radio in the home use case (AP mode), if you are putting the OpenMesh in bridge mode and using a router, you can enable DHCP addressing on the router. The bridge is set to the same team based IP address as before (``10.TE.AM.1``) and will hand out DHCP address from ``10.TE.AM.20`` to ``10.TE.AM.199``. When connected to the field, FMS will also hand out addresses in the same IP range.
es_mx: El :ref:`docs/zero-to-robot/step-3/radio-programming:Programming your Radio` habilitará el servidor DHCP en la radio OpenMesh en el caso de uso doméstico (modo AP), si está colocando OpenMesh en modo puente y utilizando un enrutador, puede habilitar el direccionamiento DHCP en el enrutador. El puente está configurado con la misma dirección IP basada en equipo que antes (``10.TE.AM.1``) y entregará la dirección DHCP de ``10.TE.AM.20`` a ``10.TE.AM.199`` Cuando esté conectado al campo, la FMS también entregará direcciones en el mismo rango de IP.
fr_ca: Le :ref:`docs/zero-to-robot/step-3/radio-programming:Programming your Radio` activera le serveur DHCP sur la radio OpenMesh dans le cas d'utilisation domestique (mode AP), si vous mettez l'OpenMesh en mode pont, ou "Bridge" et à l'aide d'un routeur, vous pouvez activer l'adressage DHCP sur le routeur. Le pont est défini sur la même adresse IP basée sur l'équipe qu'auparavant (`` 10.TE.AM.1 '') et attribuera l'adresse DHCP de ``10.TE.AM.20`` à ``10.TE.AM.199``. Lorsqu'il est connecté sur le terrain de jeu, FMS distribuera également des adresses dans la même plage IP.
tr_tr: :ref:`docs/zero-to-robot/step-3/radio-programming:Programming your Radio` OpenMesh'i koyuyorsanız, ev kullanım durumunda (AP modu) OpenMesh radyosundaki DHCP sunucusunu etkinleştirecektir. Köprü modunda ve bir yönlendirici kullanarak, yönlendiricide DHCP adreslemeyi etkinleştirebilirsiniz. Köprü, daha önce olduğu gibi aynı takım tabanlı IP adresine ayarlanmıştır (``10.TE.AM.1``) ve ``10.TE.AM.20`` ile ``10.TE.AM.199``arasındaki DHCP adresini verecektir. Alana bağlandığında, FMS aynı IP aralığındaki adresleri de dağıtacaktır.
zh_cn: :ref:`docs/zero-to-robot/step-3/radio-programming:Programming your Radio` 在家中使用的情况下（AP模式），将在OpenMesh路由器上启用DHCP服务器。如果将OpenMesh置于桥接模式并使用路由器，则可以在路由器上启用DHCP寻址。该网桥设置为与以前相同的基于团队的IP地址（``10.TE.AM.1''），并将DHCP地址从``10.TE.AM.20''分发给``10.TE .AM.199''。当连接到场地时，FMS还将分发相同IP范围内的地址。

source: Summary
es_mx: Resumen
fr_ca: Résumé
tr_tr: Özet
zh_cn: 总结

source: IP Addresses are what allow us to communicate with devices on a network. For FRC, these addresses are going to be in the 10.TE.AM.xx range if we are connected to a DHCP server or if they are assigned statically, or in the link-local ``169.254.xx.yy`` range if the devices are set to DHCP, but there is no server present. For more information on how IP Addresses work, see `this <https://support.microsoft.com/en-us/help/164015/understanding-tcp-ip-addressing-and-subnetting-basics>`__ article by Microsoft.
es_mx: Las Direcciones IP son las que nos permiten comunicarnos con dispositivos en la red. Para FRC, estas direcciones estarán en el rango 10.TE.AM.xx si estamos conectados a un servidor DHCP o si están asignadas estáticamente, o en el rango de enlace local ``169.254.xx.yy`` si los dispositivos están ajustados a DHCP, pero no hay servidor presente. Para más información de cómo funcionan las direcciones IP, vea éste artículo de Microsoft `aquí <https://support.microsoft.com/en-us/help/164015/understanding-tcp-ip-addressing-and-subnetting-basics>`__.
fr_ca: Les adresses IP sont ce qui nous permet de communiquer avec des appareils sur un réseau. En FRC, ces adresses seront dans la plage 10.TE.AM.xx si nous sommes connectés à un serveur DHCP ou ces adresses IP sont attribuées statiquement, ou dans la plage de lien local ``169.254.xx.yy`` si les périphériques sont configurés sur DHCP, mais il n’y a pas de serveur présent. Pour plus d’informations sur le fonctionnement des adresses IP, voir `cet article <https://support.microsoft.com/en-us/help/164015/understanding-tcp-ip-addressing-and-subnetting-basics>`__ de Microsoft.
tr_tr: IP Adresleri, bir ağdaki cihazlarla iletişim kurmamızı sağlayan şeydir. FRC için, bir DHCP sunucusuna bağlıysak veya statik olarak atanmışlarsa, bu adresler 10.TE.AM.xx aralığında veya cihazlar DHCP olarak ayarlanmışsa, ancak sunucu mevcut değilse``169.254.xx.yy`` aralığında olacaktır. IP Adreslerinin nasıl çalıştığı hakkında daha fazla bilgi için Microsoft'un `buradaki <https://support.microsoft.com/en-us/help/164015/understanding-tcp-ip-addressing-and-subnetting-basics>`__ makalesine bakın.
zh_cn: IP地址使我们能够与网络上的设备进行通信。对于FRC，如果我们连接到DHCP服务器或静态分配了这些地址，则这些地址将在10.TE.AM.xx范围内，或者在本地链接的``169.254.xx.yy''范围内如果设备设置为DHCP，但是不存在服务器。有关IP地址如何工作的更多信息，请参见微软的这篇文章 `this <https://support.microsoft.com/en-us/help/164015/understanding-tcp-ip-addressing-and-subnetting-basics>`__

source: If all devices on the network support mDNS, then all devices can be set to DHCP and referred to using their friendly names (ex. ``roboRIO-TEAM-FRC.local``). If some devices do not support mDNS, they will need to be set to use static addresses.
es_mx: Si todos los dispositivos en la red soportan mDNS, entonces todos los dispositivos pueden ser ajustados a DHCP y referidos a usar su nombre amigable (ejemplo, ``roboRIO-TEAM-FRC.local``). Si algún dispositivo no soporta mDNS, se necesitará ajustar a direcciones estáticas.
fr_ca: Si tous les appareils du réseau prennent en charge le mDNS, tous les appareils peuvent être configurés sur DHCP et invoqués à l’aide de leurs appellations conviviales (ex. ``roboRIO-TEAM-FRC.local``). Si certains périphériques ne prennent pas en charge le mDNS, ils devront être configurés pour utiliser des adresses IP statiques.
tr_tr: Ağdaki tüm cihazlar mDNS'yi destekliyorsa, tüm cihazlar DHCP'ye ayarlanabilir ve kolay adlarıyla anılabilir (örn.``roboRIO-TEAM-FRC.local``). Bazı cihazlar mDNS'yi desteklemiyorsa, bunların statik adresleri kullanacak şekilde ayarlanması gerekecektir.
zh_cn: 如果网络上的所有设备均支持mDNS，则可以将所有设备设置为DHCP并使用其友好名称进行引用（例如``roboRIO-TEAM-FRC.local''）。如果某些设备不支持mDNS，则需要将其设置为使用静态地址。

source: If all devices are set to use DHCP or Static IP assignments (with correct static settings), the communication should work in both the pit and on the field without any changes needed. If there are a mix of some Static and some DHCP devices, then the Static devices will connect on the field, but will not connect in the pit. This can be resolved by either setting all devices to static settings, or leaving the current settings and providing a DHCP server in the pit.
es_mx: Si todos los dispositivos están ajustados para utilizar DHCP o asignaciones estáticas de IP (con los ajustes correctos estáticos), la comunicación debe funcionar ya sea en el pit o en la cancha sin ningún cambio necesario. Si existe alguna mezcla de dispositivos estáticos y DHCP, entonces los dispositivos estáticos se conectarán en la cancha pero no en el pit. Ésto se puede resolver ya sea ajustando todos los dispositivos a ajuste estático, o dejando los actuales y proporcionando un servidor DHCP en el pit.
fr_ca: Si tous les périphériques sont configurés pour utiliser des attributions d'adresses IP DHCP ou statiques (avec des paramètres statiques corrects), la communication doit fonctionner à la fois dans le puits et sur le terrain sans que des modifications ne soient nécessaires. S’il existe un mélange de certains périphériques Statique et DHCP, les périphériques statiques se connecteront sur le terrain, mais ne se connecteront pas dans le puis. Cette situation peut être résolue soit en définissant tous les périphériques sur des paramètres statiques, soit en laissant les paramètres actuels et en fournissant un serveur DHCP dans le puits.
tr_tr: Tüm cihazlar DHCP veya Statik IP atamalarını (doğru statik ayarlarla) kullanacak şekilde ayarlanmışsa, iletişim herhangi bir değişiklik gerekmeden hem sahada hem de pit alnında çalışacaktır. Bazı Statik ve bazı DHCP cihazlarının bir karışımı varsa, Statik cihazlar sahaya bağlanacak, ancak pite alanında bağlanmayacaktır. Bu, tüm aygıtları statik ayarlara ayarlayarak veya mevcut ayarları bırakıp pit alanında bir DHCP sunucusu sağlayarak çözülebilir.
zh_cn: 如果将所有设备都设置为使用DHCP或静态IP分配（具有正确的静态设置），则通讯应在Pits区和场地内均可进行，而无需进行任何更改。如果混合使用某些静态设备和某些DHCP设备，则静态设备将在场地内进行连接，但不会在Pits区中进行连接。可以通过以下方式解决此问题：将所有设备设置为静态设置，或者保留当前设置并在Pits区中提供DHCP服务器。

source: Class
es_mx: Clase
tr_tr: Sınıf
zh_cn: 类
