Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/networking-basics.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: If a device does not have an IP address, then it cannot communicate on a network. This can become an issue if we have a device that is set to dynamically acquire its address from a DHCP server, but there is no DHCP server on the network. An example of this would be when you have a laptop directly connected to a roboRIO and both are set to dynamically acquire an IP address. Neither device is a DHCP server, and since they are the only two devices on the network, they will not be assigned IP addresses automatically.
es_mx: Si un dispositivo no tiene dirección IP, entonces no se puede comunicar a la red. Esto se puede convertir en un problema si tenemos un dispositivo que está ajustado de manera dinámica adquiere su dirección de un servidor DHCP, pero no hay algún servidor DHCP en la red. Un ejemplo de esto puede ser cuando se tiene una laptop directamente conectada a una roboRIO y ambas están ajustadas para adquirir una dirección IP dinámicamente. Ningún dispositivo es un servidor DHCP, y a pesar de ser los únicos dos dispositivos conectados en la red, no serán asignadas automáticamente las direcciones IP.
fr_ca: Si un périphérique n’a pas d’adresse IP, il ne peut pas communiquer sur un réseau. Cela peut devenir un problème si nous avons un périphérique qui est configuré pour acquérir dynamiquement son adresse à partir d’un serveur DHCP, mais qu'il n’y a pas de serveur DHCP sur le réseau. Par exemple, lorsque vous avez un ordinateur portable directement connecté à un roboRIO et les deux sont configurés pour acquérir dynamiquement une adresse IP. Aucun des deux appareils n’est un serveur DHCP, et comme ils sont les deux seuls appareils sur le réseau, des adresses IP ne leur seront donc pas attribuées automatiquement.
tr_tr: Bir cihazın IP adresi yoksa ağ üzerinden iletişim kuramaz. Adresini bir DHCP sunucusundan dinamik olarak alacak bir cihazımız varsa, ancak ağda DHCP sunucusu yoksa bu bir sorun haline gelebilir. Bunun bir örneği, doğrudan bir roboRIO'ya bağlı bir dizüstü bilgisayarınız olması ve her ikisinin de dinamik olarak bir IP adresi alacak şekilde ayarlanması olabilir. Hiçbir cihaz bir DHCP sunucusu değildir ve ağdaki tek iki cihaz oldukları için, IP adreslerine otomatik olarak atanmayacaktır.
zh_cn: 如果设备没有IP地址，则无法在网络上通信。如果我们拥有一台设置为从DHCP服务器动态获取其地址的设备，但是网络上没有DHCP服务器，这可能会成为一个问题。例如，当您将一台笔记本电脑直接连接到roboRIO且两者都设置为动态获取IP地址时。这两个设备都不是DHCP服务器，并且由于它们是网络上仅有的两个设备，因此不会自动为它们分配IP地址。

source: Link-local addresses give us a standard set of addresses that we can "fall-back" to if a device set to acquire dynamically is not able to acquire an address. If this happens, the device will assign itself an IP address in the ``169.254.xx.yy`` address range; this is a link-local address. In our roboRIO and computer example above, both devices will realize they haven’t been assigned an IP address and assign themselves a link-local address. Once they are both assigned addresses in the ``169.254.xx.yy`` range, they will be in the same network and will be able to communicate, even though they were set to dynamic and a DHCP server did not assign addresses.
es_mx: Las direcciones link-local nos dan un conjunto estándar de direcciones al que podemos recurrir si un dispositivo configurado para adquirir dinámicamente no es capaz de adquirir una dirección. Si esto ocurre, el dispositivo se asignará a sí mismo una dirección IP en el rango de direcciones ``169.254.xx.yy``; esto es una dirección link-local. En nuestro ejemplo del roboRIO y el ordenador, ambos dispositivos se darán cuenta de que no se les ha asignado una dirección IP y se asignarán una dirección link-local. Una vez que se les hayan asignado direcciones en el rango ``169.254.xx.yy``, estarán en la misma red y podrán comunicarse, aunque hayan sido configurados como dinámicos y un servidor DHCP no les haya asignado direcciones.
fr_ca: Les adresses de type lien-local nous donnent un ensemble standard d’adresses auxquelles nous pouvons "nous replier" si un périphérique configuré pour acquérir dynamiquement n’est pas en mesure d’acquérir une adresse. Si cela se produit, l’appareil s’attribuera une adresse IP dans la plage d’adresses ``169.254.xx.yy``; il s’agit d’une adresse lien-local. Dans notre roboRIO et l’exemple d’ordinateur ci-dessus, les deux appareils se rendront compte qu’il ne leur a pas été affecté d'adresse IP et s’assigneront eux-mêmes une adresse lien-local. Une fois que leur auront été attribuées deux adresses dans la plage ``169.254.xx.yy``, ils seront dans le même réseau et seront en mesure de communiquer, même s'ils ont été réglés sur dynamique et qu'un serveur DHCP n’a pas attribué d’adresses.
zh_cn: 本地链接地址为我们提供了一组标准地址，如果设置为动态获取的设备无法获取地址，则可以“回退”到这些地址。如果发生这种情况，设备将在“ 169.254.xx.yy”地址范围内为自己分配一个IP地址；这是本地链接地址。在上面的roboRIO和计算机示例中，两台设备都将意识到尚​​未为其分配IP地址，而是为自己分配了本地链接地址。一旦为它们都分配了“ 169.254.xx.yy”范围内的地址，即使它们设置为动态并且DHCP服务器未分配地址，它们也将位于同一网络中并且能够通信。

source: IP Addressing for FRC
es_mx: Direccionando IP para FRC
fr_ca: Adressage IP pour FRC
tr_tr: FRC için IP Adresleme
zh_cn: FRC的IP寻址

source: See the :doc:`IP Networking Article <ip-configurations>` for more information.
es_mx: Vea :doc:`IP Networking Article <ip-configurations>` para más información
fr_ca: Voir :doc:`IP Networking Article <ip-configurations>` pour plus d'informations.
tr_tr: Daha fazla bilgi için bu belgeye bakın: :doc:`IP Ağ İletişim Makalesi<ip-configurations>` .
zh_cn: 查阅:doc:`IP Networking Article <ip-configurations>`获取更多资讯。

source: Mixing Dynamic and Static Configurations
es_mx: Combinando Configuraciones Dinámicas y Estáticas
fr_ca: Mélange de configurations dynamique et statique
tr_tr: Dinamik ve Statik Yapılandırmaları Karıştırma
zh_cn: 混合动态配置和静态配置

source: While on the field, the team should not notice any issues with having devices set statically in the ``10.TE.AM.xx`` range, and having the field assign DHCP addresses as long as there are no IP address conflicts as referred to in the section above.
es_mx: Mientras se está en la cancha, el equipo no debe ver algún problema con tener los dispositivos en modo estático en el rango ``10.TE.AM.xx``, y la cancha tener que asignar direcciones IP mientras que no existan conflictos de direcciones IP referentes a la sección de arriba.
fr_ca: Sur le terrain, l’équipe ne doit pas déceler de problèmes avec le fait que les périphériques soient réglés statiquement dans la plage ``10.TE.AM.xx`` et de voir le terrain assigner des adresses DHCP tant qu’il n’y a pas de conflits d’adresses IP comme mentionné dans la section ci-dessus.
tr_tr: Ekip sahadayken, yukarıdaki bölümde belirtildiği gibi cihazların ``10.TE.AM.xx`` aralığında statik olarak ayarlanması ve belirtilen IP adresi çakışması olmadığı sürece sahanın DHCP adreslerini ataması ile ilgili herhangi bir sorun fark etmemelidir.
zh_cn: 在场上，只要设备没有静态设置在“ 10.TE.AM.xx”范围内，并且只要没有IP地址冲突，该字段就分配DHCP地址，团队就不会在以上部分中发现任何问题。

source: In the pits, a team may encounter issues with mixing Static and DHCP devices for the following reason. As mentioned above, DHCP devices will fall back to a link-local address (``169.254.xx.yy``) if a server isn’t present. For static devices, the IP address will always be the same. If the DHCP server is not present and the roboRIO, driver station, and laptop fall back to link-local addresses, the statically set devices in the 10.TE.AM.xx range will be in a different network and not visible to those with link-local addresses. A visual description of this is provided below:
es_mx: En los pits, el equipo puede encontrarse con problemas con mezclar dispositivos estáticos y DHCP por la siguiente razón. Como se mencionó arriba, los dispositivos DHCP pueden retroceder a una dirección de enlace local (``169.254.xx.yy``) si el servidor no está presente. Para dispositivos estáticos, la dirección IP va a ser siempre la misma. Si el servidor DHCP no está presente y la roboRIO, driver station y la laptop retroceden a una dirección de enlace local, los dispositivos ajustados estáticamente en el rango 10.TE.AM.xx van a estar en diferente red y no estarán visibles en esas direcciones de enlace local. Una explicación visual se muestra abajo:
fr_ca: Dans les puits, une équipe peut rencontrer des problèmes avec le mélange des appareils Statique et DHCP pour la raison suivante. Comme mentionné ci-dessus, les périphériques DHCP se rabattront sur une adresse lien-local (``169.254.xx.yy``) si un serveur n’est pas présent. Pour les périphériques statiques, l’adresse IP sera toujours la même. Si le serveur DHCP n’est pas présent et que le roboRIO, la station de pilotage et l’ordinateur portable se rabattent sur des adresses de type lien-local, les périphériques réglés statiquement dans la plage 10.TE.AM.xx seront dans un réseau différent et non visibles pour ceux qui ont des adresses de type lien-local. Une description visuelle de ceci est fournie ci-dessous :
tr_tr: Yarışma sırasında, bir ekip aşağıdaki nedenden dolayı Statik ve DHCP cihazlarını karıştırırsa sorunlarla karşılaşabilir. Yukarıda belirtildiği gibi, DHCP cihazları bir sunucu yoksa bağlantı yerel adresine (``169.254.xx.yy``) geri dönecektir. Statik cihazlar için IP adresi her zaman aynı olacaktır. DHCP sunucusu yoksa ve roboRIO, sürücü istasyonu ve dizüstü bilgisayar yerel bağlantı adreslerine geri dönerse, 10.TE.AM.xx aralığındaki statik olarak ayarlanmış cihazlar farklı bir ağda olacak ve yerel bağlantı adreslerine sahip olanlar tarafından görülmeyecektir. Bunun görsel bir açıklaması aşağıda verilmiştir:
zh_cn: 在Pits区中，出于以下原因，团队可能会遇到混合使用静态和DHCP设备的问题。如上所述，如果没有服务器，DHCP设备将回退到本地链接地址（``169.254.xx.yy''）。对于静态设备，IP地址将始终相同。如果不存在DHCP服务器，并且roboRIO，驱动程序站和便携式计算机回退到链接本地地址，则位于10.TE.AM.xx范围内的静态设置的设备将位于不同的网络中，并且对于使用链接本地地址。下面提供了对此的直观描述：

source: How you can't mix link-local and static IP configurations.
fr_ca: Comment vous ne pouvez pas mélanger les configurations IP lien-local et statiques.

source: When connected via USB to the roboRIO, a :ref:`docs/networking/networking-utilities/portforwarding:Port Forwarding` configuration is required to access devices connected to the OpenMesh radio (on the green network shown above).
es_mx: Cuando se esta conectado vía USB a la roboRio, una configuaración :ref:`docs/networking/networking-utilities/portforwarding:Port Forwarding` es requerida para entrar a los dispositivos conectados a la radio OpenMesh (en la red verde mostrada abajo).
fr_ca: Lorsqu’il est connecté via USB au roboRIO, une configuration :ref:`docs/networking/networking-utilities/portforwarding:Port Forwarding` est nécessaire pour accéder aux appareils connectés à la radio OpenMesh (sur le réseau vert indiqué ci-dessus).
tr_tr: USB aracılığıyla roboRIO'ya bağlandığında, OpenMesh radyoya bağlı cihazlara (yukarıda gösterilen yeşil ağda) erişmek için :ref:`docs/networking/networking-utilities/portforwarding:Port Forwarding` yapılandırması gereklidir.
zh_cn: 通过USB连接到roboRIO时，需要配置:ref:`docs/networking/networking-utilities/portforwarding:Port Forwarding` 来连接OpenMesh路由器设备（在上面显示的绿色网络上）。

source: Available Network Ports
fr_ca: Ports réseau disponibles

source: Please see R704 of the 2022 Game Manual for information regarding available network ports.
fr_ca: Veuillez consulter la règle R704 du manuel de jeu 2022 pour plus d’informations sur les ports réseau disponibles.

source: mDNS, or multicast Domain Name System is a protocol that allows us to benefit from the features of DNS, without having a DNS server on the network. To make this clearer, let’s take a step back and talk about what DNS is.
es_mx: mDNS, o Sistema de Nombres de Dominio de multidifusión es un protocolo que nos permite el beneficio de las características de un DNS, sin tener un servidor DNS en la red. Para hacer esto más claro, vamos a dar un paso para atrás y hablar que es un DNS.
fr_ca: mDNS, ou multicast Domain Name System est un protocole qui nous permet de bénéficier des fonctionnalités de DNS, sans avoir un serveur DNS sur le réseau. Pour que cela soit plus clair, prenons un peu de recul et parlons de ce qu’est le DNS.
tr_tr: mDNS veya multicast Domain Name System, ağda bir DNS sunucusu olmadan DNS'nin özelliklerinden yararlanmamızı sağlayan bir protokoldür. Bunu daha net hale getirmek için bir adım geri gidelim ve DNS'nin ne olduğu hakkında konuşalım.
zh_cn: mDNS或多播域名系统是一种协议，它使我们可以从DNS的功能中受益，而无需在网络上安装DNS服务器。为了更清楚地说明这一点，让我们退后一步，谈谈什么是DNS。

source: What is DNS?
es_mx: ¿Qué es un DNS?
fr_ca: DNS: qu'est-ce que c'est ?
tr_tr: DNS Nedir?
zh_cn: 什么是DNS？

source: DNS (Domain Name System) can become a complex topic, but for the scope of this paper, we are going to just look at the high level overview of DNS. In the most basic explanation, DNS is what allows us to relate human-friendly names for network devices to IP Addresses, and keep track of those IP addresses if they change.
es_mx: DNS (Sistema de Nombre de Dominio) puede convertirse en un tema complejo, pero para el propósito de este escrito, vamos a ver solamente una visión general del DNS. En las explicaciones más básicas, el DNS es lo que nos permite relacionar nombres conocidos para los humanos para los dispositivos de red a una Dirección IP, y da seguimiento a esas direcciones IP si cambian.
fr_ca: Le DNS (Domain Name System) peut devenir un sujet complexe, mais pour la portée de ce document, nous allons faire un survol au haut niveau du DNS. Dans l’explication la plus simple, le DNS est ce qui nous permet d'associer les noms conviviaux des périphériques réseaux aux adresses IP, et de garder une trace de ces adresses IP si elles changent.
tr_tr: DNS (Etki Alanı Adı Sunucusu) karmaşık bir konu haline gelebilir, ancak bu makalenin kapsamı için, DNS'e üst düzey bir genel bakış atacağız. En temel açıklamada, DNS, ağ aygıtları için insan dostu adları IP Adresleriyle ilişkilendirmemize ve değiştikleri takdirde bu IP adreslerini izlememize izin veren şeydir.
zh_cn: DNS（域名系统）可能会成为一个复杂的话题，但是在本文的范围内，我们将仅对DNS进行简要介绍。在最基本的解释中，DNS使我们能够将网络设备的人性化名称与IP地址相关联，并在这些IP地址发生更改时对其进行跟踪。

source: Example 1: Let’s look at the site ``www.google.com``. The IP address for this site is ``172.217.164.132``, however that is not very user friendly to remember!
es_mx: Ejemplo 1: veamos el sitio ``www.google.com``. La dirección IP de este sitio es ``172.217.164.132``, sin embargo, no es muy fácil de recordar.
fr_ca: Exemple 1 : Examinons le cas du site ``www.google.com``. L’adresse IP de ce site est ``172.217.164.132``, mais cette suite de nombres n’est pas très conviviale à retenir!
tr_tr: Örnek 1: ``www.google.com`` sitesine bakalım. Bu sitenin IP adresi ``172.217.164.132``, ancak bu hatırlanması çok kullanıcı dostu değil!
zh_cn: 示例1：让我们看一下“ www.google.com”网站。该站点的IP地址是``172.217.164.132''，但是记住它不是非常用户友好！

source: Whenever a user types ``www.google.com`` into their computer, the computer contacts the DNS server (a setting provided by DHCP!) and asks what is the IP address on file for ``www.google.com``. The DNS server returns the IP address and then the computer is able to use that to connect to the Google web site.
es_mx: Cada ocasión que un usuario escriba ``www.google.com`` en su computadora, la computadora se pone en contacto con el servidor DNS (una configuración proporcionada por DHCP!) y pregunta cuál es la dirección IP registrada para ``www.google.com``. El servidor DNS devuelve la dirección IP y luego la computadora puede usarla para conectarse al sitio web de Google.
fr_ca: Chaque fois qu’un utilisateur saisit l'adresse ``www.google.com`` à travers le clavier de son ordinateur, l’ordinateur contacte le serveur DNS (un paramètre fourni par DHCP!) et lui demande quelle est l’adresse IP, figurant sur le fichier, relative à ``www.google.com``. Le serveur DNS renvoie cette adresse IP, puis l’ordinateur est alors en mesure de l’utiliser pour se connecter au site Web de Google.
tr_tr: Bir kullanıcı bilgisayarına ``www.google.com`` yazdığında, bilgisayar DNS sunucusuyla bağlantı kurar (DHCP tarafından sağlanan bir ayar!) Ve ```www.google.com`` için kayıtlı IP adresinin ne olduğunu sorar. . DNS sunucusu IP adresini döndürür ve ardından bilgisayar bunu Google web sitesine bağlanmak için kullanabilir.
zh_cn: 每当用户在计算机上键入“ www.google.com”时，计算机都会与DNS服务器联系（DHCP提供的设置！），并询问“ www.google.com”文件上的IP地址是什么。 DNS服务器返回IP地址，然后计算机可以使用该IP地址连接到Google网站。

source: Example 2: On your home network, you have a server named ``MYCOMPUTER`` that you want to connect to from your laptop. Your network uses DHCP so you don’t know the IP Address of ``MYCOMPUTER``, but DNS allows you to connect just by using the ``MYCOMPUTER`` name. Additionally, whenever the DHCP assignments refresh, ``MYCOMPUTER`` may end up with a different address, but because you’re connecting by using the ``MYCOMPUTER`` name instead of a specific IP address, the DNS record was updated and you’re still able to connect.
es_mx: Ejemplo 2: En la red de cada, tiene un servidor llamado ``MYCOMPUTER`` que quiere conectarlo desde su computadora. Su red usa DHCP para que no sepa la dirección IP de ``MYCOMPUTER``, pero el DNS permite que se conecte por solo usar el nombre ``MYCOMPUTER``. Adicionalmente, cuando las asignaciones del DHCP se vuelven a cargar, ``MYCOMPUTER`` puede terminar con una dirección diferente, pero porque se está conectando usando el nombre ``MYCOMPUTER`` en vez de una dirección IP específica, el registro del DNS fue actualizado y esta disponible aún para conectar.
fr_ca: Exemple 2 : Sur votre réseau domestique, vous disposez d’un serveur nommé ``MYCOMPUTER`` auquel vous souhaitez vous connecter à partir de votre ordinateur portable. Votre réseau utilise DHCP de sorte que vous ne connaissez pas l’adresse IP de ``MYCOMPUTER``, cependant le DNS vous permet de vous connecter uniquement en utilisant le nom ``MYCOMPUTER``. De plus, à chaque fois que les attributions DHCP s'actualisent, ``MYCOMPUTER`` peut se retrouver avec une adresse différente, mais parce que vous vous connectez en utilisant le nom ``MYCOMPUTER`` au lieu d’une adresse IP spécifique, l’enregistrement DNS est mis à jour et vous êtes toujours en mesure de vous connecter.
tr_tr: Örnek 2: Ev ağınızda, dizüstü bilgisayarınızdan bağlanmak istediğiniz ``MYCOMPUTER`` adlı bir sunucunuz var. Ağınız DHCP kullanıyor, bu nedenle ``MYCOMPUTER`` IP Adresini bilmiyorsunuz, ancak DNS yalnızca ``MYCOMPUTER`` adını kullanarak bağlanmanıza izin veriyor. Ek olarak, DHCP atamaları her yenilendiğinde, ``MYCOMPUTER`` farklı bir adresle sonuçlanabilir, ancak belirli bir IP adresi yerine ``MYCOMPUTER`` adını kullanarak bağlandığınız için, DNS kaydı güncellenmiş olur ve siz yine de bağlanabilirsiniz.
zh_cn: 示例2：在您的家庭网络上，您有一个要从笔记本电脑连接到的名为``MYCOMPUTER''的服务器。您的网络使用DHCP，因此您不知道“ MYCOMPUTER”的IP地址，但是DNS允许您仅使用“ MYCOMPUTER”名称进行连接。此外，每当DHCP分配刷新时，“ MYCOMPUTER”可能会以不同的地址结尾，但是由于您是通过使用“ MYCOMPUTER”名称而不是特定的IP地址进行连接的，因此DNS记录已更新，您仍然能够连接。

source: This is the second benefit to DNS, and the most relevant for FRC. With DNS, if we reference devices by their friendly name instead of IP Address, we don’t have to change anything in our program if the IP Address changes. DNS will keep track of the changes and return the new address if it ever changes.
es_mx: Éste es el segundo beneficio para DNS, y el más relevante para FRC. Con DNS, si llamamos a los dispositivos por su nombre amigable en vez de su dirección IP, no tenemos que cambiar nada en nuestro programa si cambia la dirección IP. DNS va a dar seguimiento a los cambios y regresará una nueva dirección si esta cambia alguna vez.
fr_ca: Il s’agit du deuxième avantage pour le DNS, et le plus pertinent pour FRC. Avec le DNS, si nous invoquons les périphériques par leur nom convivial au lieu de leur adresse IP, nous n’avons pas à changer quoi que ce soit dans notre programme si l’adresse IP change. Le DNS gardera une trace des modifications et retournera la nouvelle adresse si jamais elle change.
tr_tr: Bu, DNS'in ikinci yararıdır ve FRC için en uygun olanıdır. DNS ile, cihazlara IP Adresi yerine kolay adlarıyla atıfta bulunursak, IP Adresi değişirse programımızdaki hiçbir şeyi değiştirmemiz gerekmez. DNS, değişiklikleri takip edecek ve herhangi bir değişiklik olması durumunda yeni adresi geri döndürecektir.
zh_cn: 这是DNS的第二个好处，与FRC最为相关。使用DNS时，如果我们通过设备的友好名称而不是IP地址来引用设备，则IP地址发生变化时，我们无需在程序中进行任何更改。 DNS将跟踪更改，并在更改后返回新地址。

source: DNS for FRC
es_mx: DNS para FRC
fr_ca: DNS pour FRC
tr_tr: FRC İçin DNS
zh_cn: FRC的DNS

source: On the field and in the pits, there is no DNS server that allows us to perform the lookups like we do for the Google web site, but we’d still like to have the benefits of not remembering every IP Address, and not having to guess at every device’s address if DHCP assigns a different address than we expect. This is where mDNS comes into the picture.
es_mx: En la cancha y en los pits, no hay servidor DNS que nos permita realizar las búsquedas como lo haríamos en el sitio web de Google , pero todavía queremos tener los beneficios de no recordar la dirección IP, y no tener que adivinar cada dirección de los dispositivos si DHCP asigna una dirección diferente que esperamos. Aquí es en donde mDNS entra a la acción.
fr_ca: Sur le terrain et dans les puits, il n’y a pas de serveur DNS qui nous permet d’effectuer les recherches comme nous le faisons pour le site Web de Google, mais nous aimerions toujours avoir les avantages de ne pas se souvenir de chaque adresse IP, et de ne pas avoir à deviner l’adresse de chaque appareil si DHCP attribue une adresse différente de celle à laquelle nous nous attendons. C’est là que mDNS entre en scène.
tr_tr: Sahada ve pit alanlarında, Google web sitesi için yaptığımız gibi aramaları gerçekleştirmemize izin veren bir DNS sunucusu yoktur, ancak yine de her IP Adresini hatırlamak zorunda kalmamanın avantajlarına sahip olmak isteriz, DHCP beklediğimizden farklı bir adres atarsa her aygıtın adresini tahmin edin. Bu, mDNS'nin devreye girdiği yerdir.
zh_cn: 在场地和Pits区内，没有DNS服务器可以像对Google网站那样执行查找，但是我们仍然希望拥有不记住每个IP地址，而不必记住每个IP地址的好处。如果DHCP分配的地址与我们期望的地址不同，则猜测每个设备的地址。这就是mDNS出现的地方。
