Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/networking-basics.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Bits
tr_tr: Bit Sayısı
zh_cn: 位元

source: Start Address
es_mx: Inicio de Dirección
tr_tr: Başlangıç Adresi
zh_cn: 起始地址

source: End Address
es_mx: Fin de Dirección
tr_tr: Bitiş Adresi
zh_cn: 结束地址

source: Number of Addresses
es_mx: Cantidad de Direcciones
tr_tr: Adres Sayısı
zh_cn: 地址数
