Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/om5p-ac-radio-modification.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: OM5P-AC Radio Modification
es_mx: Modificación de radio OM5P-AC
fr_ca: Modification à la radio OM5P-AC
tr_tr: OM5P-AC Radyo Modifikasyonu
zh_cn: 修改OM5P-AC路由器

source: The intended use case for the OM5P-AC radio does not subject it to the same shocks and forces as it sees in the FRC\ |reg| environment. If the radio is subjected to significant pressure on the bottom of the case, it is possible to cause a radio reboot by shorting a metal shield at the bottom of the radio to some exposed metal leads on the bottom of the board. This article details a modification to the radio to prevent this scenario.
es_mx: El caso de uso previsto para la radio OM5P-AC no lo somete a los mismos golpes y fuerzas que ve en el entorno FRC\ |reg|. Si la radio se somete a una presión significativa en la parte inferior de la carcasa, es posible provocar un reinicio de la radio poniendo en cortocircuito un blindaje metálico en la parte inferior de la radio con algunos cables metálicos expuestos en la parte inferior de la placa. Este artículo detalla una modificación a la radio para evitar este escenario.
fr_ca: Le contexte d’utilisation prévu pour la radio OM5P-AC ne le soumet pas aux mêmes chocs et forces qu’elle subit dans l'Environnemene FRC\ |reg|. Si la radio est soumise à une pression importante sur le fond du boîtier, il est possible de provoquer un redémarrage de la radio en court-circuitant un écran métallique en dessous de la radio à quelques fils métalliques exposés sur le fond du boitier. Cet article détaille une modification à apporter à la radio pour empêcher ce scénario.
tr_tr: OM5P-AC modem için amaçlanan kullanım durumu, onu FRC \ |reg| 'de gördüğü ile çevreden gelen aynı şoklara ve kuvvetlere maruz bırakmaz. Modem kasanın altında önemli bir baskıya maruz kalırsa,modemin altındaki metal bir kalkanın, kartın altındaki bazı açıkta kalan metal kablolara kısa devre yaparak radyonun yeniden başlatılmasına neden olması mümkündür. Bu makale, bu senaryoyu önlemek için modemde yapılan bir değişikliği ayrıntılarıyla anlatmaktadır.
zh_cn: OM5P-AC路由器可能会在FRC \ |reg|环境中遭受不确定的冲击和震动。如果路由器在外壳底层受到很大的压力，则可能通过将路由器底部的金属层接触到电路板底部的一些裸露的金属引线而短路来导致路由器重新启动。本文详细介绍了如何修改路由器，以防止出现这种情况。

source: It takes significant pressure applied to the bottom of the case to cause a reboot in this manner. Most FRC radio reboot issues can be traced to the power path in some form. We recommend mitigating this risk via strategic mounting of the radio rather than opening and modifying the radio (and risk damaging delicate internal components):
es_mx: Se necesita una presión significativa aplicada a la parte inferior de la carcasa para provocar un reinicio de esta manera. La mayoría de los problemas de reinicio de la radio FRC se pueden rastrear hasta la ruta de alimentación de alguna forma. Recomendamos mitigar este riesgo mediante el montaje estratégico de la radio en lugar de abrir y modificar la radio (y arriesgarse a dañar los delicados componentes internos):
fr_ca: Il faut une pression importante appliquée au fond du boîtier pour provoquer un tel redémarrage. La plupart des problèmes de redémarrage de la radio FRC peuvent être attribués à l'alimentation électrique sous une forme ou une autre. Nous recommandons d'atténuer ce risque via un montage stratégique de la radio plutôt que d'ouvrir et de modifier la radio (et risquer d'endommager les composants internes délicats):
tr_tr: Bu şekilde yeniden başlatmaya neden olmak için kasanın altına önemli miktarda bir baskı uygulanması gerekir. Çoğu FRC radyo yeniden başlatma sorunu, bir şekilde güç kablolamaları yoluyla tespit edilebilir. Radyoyu açıp değiştirmek (ve hassas dahili bileşenlere zarar verme riski) yerine telsizin stratejik montajı yoluyla bu riski azaltmanızı öneririz:
zh_cn: 路由器会在外壳底部受到很大的压力时才会以这种方式重新启动。大多数FRC路由器重新启动问题可以以某种形式追溯到电源路径。我们建议通过策略性地固定路由器设备来减轻这种风险，而不是打开和改装路由器（并且这存在损坏精密内部组件的风险）：

source: Avoid using the "mounting tab" features on the bottom of the radio.
es_mx: Evite utilizar las funciones de "pestaña de montaje" en la parte inferior de la radio.
fr_ca: Évitez d’utiliser les fonctionnalités "mounting tab" en bas de la radio.
tr_tr: Telsizin altındaki "montaj bağlantı noktaları" özelliklerini kullanmaktan kaçının.
zh_cn: 避免使用路由器底部的“固定片”功能。

source: You may wish to mount the radio to allow for some shock absorption. A little can go a long way, mounting the radio using hook and loop fastener or to a robot surface with a small amount of flex (plastic or sheet metal sheet, etc.) can significantly reduce the forces experienced by the radio.
es_mx: Es posible que desee montar la radio para permitir cierta absorción de impactos. Un poco puede ser muy útil, montar la radio usando un gancho o un velcro o en una superficie de robot con una pequeña cantidad de flex (plástico o chapa metálica, etc.) puede reducir significativamente las fuerzas experimentadas por la radio.
fr_ca: Vous souhaiterez peut-être installer la radio pour permettre une certaine absorption des chocs. Un détail peut prévenir beaucoup. Le montage de la radio à l'aide de bandes auto-agrippantes ou sur une surface du robot à faible flexion (plastique ou tôle, etc.) peut réduire considérablement les forces subies par la radio.
tr_tr: Radyoyu biraz şok emilimine izin verecek şekilde monte etmek isteyebilirsiniz. Biraz uzun bir yol olarak, telsizi kanca veya plastik kelepçe kullanarak veya az miktarda esnek (plastik veya sac levha vb.) bir malzemeye robot yüzeyinde monte etmek, radyonun maruz kaldığı kuvvetleri önemli ölçüde azaltabilir.
zh_cn: 您可能希望在安装路由器的位置能吸收一些震动。用钩环紧固件将路由器安装到机器人上，或者用少量弯曲（塑料或金属薄板等）将机器人安装在机器人表面上，可能会大大减少路由器所承受的外力干涉。

source: Opening the Radio
es_mx: Abrir la radio
fr_ca: Ouvrir le boîtier de la radio
tr_tr: Radyoyu Açmak
zh_cn: 打开路由器

source: The OpenMesh OM5P-AC is not designed to be a user serviceable device. Users perform this modification at their own risk. Make sure to work slowly and carefully to avoid damaging internal components such as radio antenna cables.
es_mx: El OpenMesh OM5P-AC no está diseñado para ser un dispositivo reparable por el usuario. Los usuarios realizan esta modificación bajo su propio riesgo. Asegúrese de trabajar lenta y cuidadosamente para evitar dañar los componentes internos, como los cables de la antena de radio.
fr_ca: La radio OpenMesh OM5P-AC n'est pas conçue pour être réparable par l'utilisateur. Les utilisateurs effectuent cette modification à leurs propres risques. Assurez-vous de travailler lentement et soigneusement pour éviter d'endommager les composants internes tels que les câbles d'antenne radio.
tr_tr: OpenMesh OM5P-AC, kullanıcılar tarafından bakımı yapılabilen bir cihaz olarak tasarlanmamıştır. Kullanıcılar bu değişikliği riskleri kabul ederek gerçekleştirirler. Radyo anten kabloları gibi dahili bileşenlere zarar vermekten kaçınmak için yavaş ve dikkatli çalıştığınızdan emin olun.
zh_cn: OpenMesh OM5P-AC并非设计为用户可维修的设备。用户自行承担执行此修改的责任。确保缓慢而谨慎地工作，以免损坏内部组件，例如路由器天线电线。

source: Case Screws
es_mx: Tornillos de caja
fr_ca: Vis du boîtier
tr_tr: Kasa Vidaları
zh_cn: 壳体螺丝

source: Location of the two front rubber feet.
fr_ca: Emplacement des deux pieds en caoutchouc avant.

source: Location of the screws beneath the rubber feet.
fr_ca: Emplacement des vis sous le pied en caoutchouc.

source: Locate the two rubber feet on the front side of the radio then pry them off the radio using fingernails, small flat screwdriver, etc. Using a small Phillips screwdriver, remove the two screws under the feet.
es_mx: Ubique las dos patas de goma en la parte frontal de la radio y luego sáquelas de la radio con las uñas, un destornillador plano pequeño, etc. Con un destornillador Phillips pequeño, retire los dos tornillos debajo de las patas.
fr_ca: Repérez les deux pattes en caoutchouc à l'avant de la radio, puis écartez-les de la radio à l'aide de vos ongles, d'un petit tournevis plat, etc. À l'aide d'un petit tournevis cruciforme, retirez les deux vis sous les pattes.
tr_tr: Radyonun ön tarafındaki iki lastik ayağı bulun ve tırnak, küçük düz tornavida, vb. kullanarak radyodan ayırın. Küçük bir yıldız tornavida kullanarak, ayakların altındaki iki vidayı çıkarın.
zh_cn: 找到路由器正面的两个橡胶支脚，然后使用指甲，小平头螺丝刀等将其撬出路由器。使用小的十字螺丝刀，卸下支脚下面的两个螺钉。

source: Side Latches
es_mx: Pestillos laterales
fr_ca: Loquets latéraux
tr_tr: Yan Mandallar
zh_cn: 侧面锁

source: Slightly lifting the top cover of the radio.
fr_ca: Soulevant légèrement le couvercle supérieur de la radio.

source: There is a small latch on the lid of the radio near the middle of each long edge (you can see these latches more clearly in the next picture). Using a fingernail or very thin tool, slide along the gap between the lid and case from front to back towards the middle of the radio, you should hear a small pop as you near the middle of radio. Repeat on the other side (note: it's not hard to accidentally re-latch the first side while doing this, make sure both sides are unlatched before proceeding). The radio lid should now be slightly open on the front side as shown in the image above.
es_mx: Hay un pequeño pestillo en la tapa de la radio cerca del medio de cada borde largo (puede ver estos pestillos con mayor claridad en la siguiente imagen). Con una uña o una herramienta muy delgada, deslice a lo largo del espacio entre la tapa y la caja de adelante hacia atrás hacia el centro de la radio. Debería escuchar un pequeño estallido cuando se acerque a la mitad de la radio. Repita en el otro lado (nota: no es difícil volver a enganchar accidentalmente el primer lado mientras hace esto, asegúrese de que ambos lados estén desbloqueados antes de continuar). La tapa de la radio ahora debe estar ligeramente abierta en la parte frontal como se muestra en la imagen de arriba.
fr_ca: Il y a un petit loquet sur le couvercle de la radio près du milieu de chaque bord long (vous pouvez voir ces verrous plus clairement dans l'image suivante). Faites glisser un ongle ou un outil très mince le long de l'espace entre le couvercle et le boîtier d'avant en arrière vers le milieu de la radio, vous devriez entendre un petit bruit lorsque vous vous approchez du milieu de la radio. Répétez de l'autre côté (remarque: il n'est pas difficile de reverrouiller accidentellement le premier côté en faisant cela, assurez-vous que les deux côtés sont déverrouillés avant de continuer). Le couvercle de la radio doit maintenant être légèrement ouvert sur la face avant, comme indiqué dans l'image ci-dessus.
tr_tr: Radyonun kapağında, her bir uzun kenarın ortasına yakın küçük bir tırnak vardır (bu mandalları bir sonraki resimde daha net görebilirsiniz). Bir tırnak veya çok ince bir alet kullanarak, önden arkaya telsizin ortasına doğru kapak ve kasa arasındaki boşluk boyunca kaydırın, radyonun ortasına yaklaştığınızda küçük bir ses duymalısınız. Diğer tarafta da tekrarlayın (not: Bunu yaparken yanlışlıkla ilk taraf yeniden kilitlenebilir, devam etmeden önce her iki tarafın da açıldığından emin olun). Radyo kapağı şimdi yukarıdaki resimde gösterildiği gibi ön tarafta biraz açık olmalıdır.
zh_cn: 路由器盖子上每个长边的中间附近都有一个小闩锁（您可以在下一张照片中更清楚地看到这些闩锁）。使用指甲或非常薄的工具，沿着盖子和外壳之间的间隙从前向后朝路由器的中央滑动，当您靠近路由器的中央时，应该会听到一声小声音。在另一侧重复（注意：这样做时不难将第一侧重新锁上，在继续操作之前，请确保两侧均未上锁）。如上图所示，路由器盖子现在应在前侧稍微打开。

source: Remove Lid
es_mx: Quitar la tapa
fr_ca: Retirez le couvercle
tr_tr: Kapağı Kaldır
zh_cn: 取下盖子

source: The board may stick to the lid as you remove it due to the heatsink pads. Look through the vents of the radio as you remove the lid to see if the board is coming with it, if it is you may need to insert a small tool to hold the board down to separate it from the lid. We recommend a small screwdriver or similar tool that fits through the vents, applied through the front corner on the barrel jack side, right above the screw hole. You can scroll down to the picture with the lid removed to see what the board looks like in this area.
es_mx: La placa puede adherirse a la tapa al retirarla debido a las almohadillas del disipador de calor. Mire a través de las rejillas de ventilación de la radio mientras retira la tapa para ver si la placa viene con ella, si es así, es posible que deba insertar una pequeña herramienta para sujetar la placa hacia abajo para separarla de la tapa. Recomendamos un destornillador pequeño o una herramienta similar que se ajuste a través de las rejillas de ventilación, aplicado a través de la esquina frontal del lado del gato de barril, justo encima del orificio del tornillo. Puede desplazarse hacia abajo hasta la imagen con la tapa retirada para ver cómo se ve el tablero en esta área.
fr_ca: La carte peut coller au couvercle lorsque vous le retirez en raison des coussinets du dissipateur thermique. Regardez à travers les ouvertures de la radio lorsque vous retirez le couvercle pour voir si la carte suit le couvercle; si c'est le cas, vous devrez peut-être insérer un petit outil pour maintenir la carte vers le bas et la séparer du couvercle. Nous recommandons un petit tournevis, inséré par le coin avant du côté du connecteur de l'alimentation, juste au-dessus du trou de vis. Défilez à l'image avec le couvercle retiré pour voir à quoi ressemble la carte à cet endroit.
tr_tr: Isı emici pedler nedeniyle kart kapağa yapışmış olabilir. Panonun onunla gelip gelmediğini kontrol etmek için kapağı çıkarırken radyonun havalandırma deliklerinden bakın, eğer varsa, panoyu kapaktan ayırmak için küçük bir alet araya sokmanız gerekebilir. Küçük bir tornavida veya benzeri bir alet, ön köşesinden, vida deliğinin hemen yukarısına uygulanarak havalandırma deliklerinden geçebilir. Bu alanda panonun neye benzediğini görmek için kapağı kaldırılmış olarak gösterilen resme kaydırabilirsiniz.
zh_cn: 由于散热垫的缘故，在卸下面板时，面板可能会粘在盖子上。卸下盖子时，请看一下收音机的通风孔，以查看电路板是否随其一起提起来了；如果是，则可能需要插入一个小的工具以将电路板压下，以将其与盖子分离。我们建议使用一个小螺丝刀或类似的工具，该螺丝刀可穿过通气孔，并通过枪管插孔侧的前角，就在螺丝孔上方。您可以向下滚动至图片，并取下盖子，以查看该区域板的外观。

source: Side latches of the top cover shown and how to slide the cover off pushing it forwards.
fr_ca: Loquets latéraux du couvercle supérieur montré et comment faire glisser le couvercle en le poussant vers l’avant.

source: To begin removing the lid, slide it forward (lifting slightly) until the screw holders hit the case front (you may need to apply pressure on the latch areas while doing this.
es_mx: Para comenzar a quitar la tapa, deslícela hacia adelante (levantándola ligeramente) hasta que los soportes de los tornillos golpeen el frente de la caja (es posible que deba aplicar presión en las áreas del pestillo mientras hace esto.
fr_ca: Pour commencer à retirer le couvercle, faites-le glisser vers l'avant (en le soulevant légèrement) jusqu'à ce que les porte-vis atteignent l'avant du boîtier (vous devrez peut-être appliquer une pression sur les zones de verrouillage tout en faisant cela.
tr_tr: Kapağı çıkarmaya başlamak için, vida tutucular kasanın ön tarafına çarpana kadar öne doğru kaydırın (hafifçe kaldırarak) (bunu yaparken mandal bölgelerine baskı uygulamanız gerekebilir.
zh_cn: 要开始取下盖子，请将其向前滑动（略微抬起），直到螺钉固定器碰到机箱正面为止（这样做时，您可能需要在闩锁区域上多加力气）。

source: The barrel jack corner that needs to be rotated away from.
fr_ca: Le coin du connecteur jack qui doit être tourné à l'écart.

source: Next, begin rotating the lid slightly away from the barrel jack side, as shown while continuing to lift. This will unhook the lid from the small triangle visible in the top right corner. Continue to rotate slightly in this direction while pushing the top left corner towards the barrel jack (don't try to lift further in this step) to unhook a similar feature in the top left corner. Then lift the lid completely away from the body.
es_mx: A continuación, comience a girar la tapa ligeramente alejándola del lado del gato de barril, como se muestra, mientras continúa levantando. Esto desenganchará la tapa del pequeño triángulo visible en la esquina superior derecha. Continúe girando ligeramente en esta dirección mientras empuja la esquina superior izquierda hacia el barrel jack(no intente levantar más en este paso) para desenganchar una característica similar en la esquina superior izquierda. Luego levante la tapa completamente alejándola del cuerpo.
fr_ca: Ensuite, commencez à faire pivoter légèrement le couvercle du côté du connecteur d'alimentation comme indiqué, tout en continuant à soulever. Cela décrochera le couvercle du petit triangle visible dans le coin supérieur droit. Continuez à tourner légèrement dans cette direction tout en poussant le coin supérieur gauche vers le connecteur de l'alimentation (n'essayez pas de soulever plus loin à cette étape) pour défaire une jonction similaire dans le coin supérieur gauche. Soulevez ensuite complètement le couvercle du corps.
tr_tr: Ardından, kaldırmaya devam ederken gösterildiği gibi kapağı güç bağlantı noktası tarafından hafifçe çevirmeye başlayın. Bu, kapağı sağ üst köşede görünen küçük üçgenden çıkaracaktır. Sol üst köşedeki benzer bir özelliği açmak için sol üst köşeyi güç bağlantı noktasına doğru iterken bu yönde hafifçe dönmeye devam edin (bu adımda daha fazla kaldırmaya çalışmayın). Ardından kapağı tamamen gövdeden kaldırın.
zh_cn: 接下来，如图所示，在继续提起的同时，将盖子从公头侧稍微旋转一点。这样可以将盖子从右上角可见的小三角形上解开。继续朝此方向稍微旋转，同时将左上角推向公头（在此步骤中请勿尝试进一步提起），以在左上角解开类似的功能。然后将盖子完全抬离身体。

source: Remove Board
es_mx: Quitar el tablero
fr_ca: Retirez la carte
tr_tr: Panoyu Kaldır
zh_cn: 移除板子

source: Note the three fragile antenna wires on the board.
fr_ca: Notez les trois fils d’antenne fragiles sur la carte.

source: Note the antenna wires shown in the image above. These wires, and their connectors, are fragile, take care not to damage them while performing the next steps.
es_mx: Tenga en cuenta los cables de la antena que se muestran en la imagen de arriba. Estos cables, y sus conectores, son frágiles, tenga cuidado de no dañarlos mientras realiza los siguientes pasos.
fr_ca: Notez la position des fils d'antenne montrés dans l'image ci-dessus. Ces fils et leurs connecteurs sont fragiles, veillez à ne pas les endommager lors des étapes suivantes.
tr_tr: Yukarıdaki resimde gösterilen anten kablolarına dikkat edin. Bu teller ve konektörleri kırılgandır, sonraki adımları gerçekleştirirken onlara zarar vermemeye özen gösterin.
zh_cn: 注意上图所示的天线线。这些电线及其连接器易碎，执行后续步骤时请注意不要损坏它们。

source: Grab the Ethernet port to help lift the board.
fr_ca: Saisissez le port Ethernet pour aider à soulever la carte.

source: The board lifted slightly out of the case.
fr_ca: La carte s’est légèrement retirée de la boite.

source: To remove the board, we recommend grasping one or both network ports with your fingers (as shown) and pushing inward (toward the front of the radio) and upward until the network ports and barrel jack are free from the case.
es_mx: Para quitar la placa, recomendamos sujetar uno o ambos puertos de red con los dedos (como se muestra) y empujar hacia adentro (hacia la parte frontal de la radio) y hacia arriba hasta que los puertos de red y el barrel jack estén libres de la carcasa.
fr_ca: Pour retirer la carte, nous vous recommandons de saisir avec vos doigts un ou les deux ports réseau (comme illustré) et de pousser vers l'intérieur (vers l'avant de la radio) et vers le haut jusqu'à ce que les ports réseau et le connecteur d'alimentation soient délogés du boîtier.
tr_tr: Kartı çıkarmak için, ağ bağlantı noktalarından birini veya her ikisini parmaklarınızla tutmanızı (gösterildiği gibi) ve ağ bağlantı noktaları ve güç jakı kasadan kurtulana kadar içe (radyonun önüne doğru) ve yukarı doğru itmenizi öneririz.
zh_cn: 要卸下板，我们建议您用手指抓住一个或两个网络端口（如图所示），然后向内（朝无线电设备的前部）推入并向上推，直到网络端口和机筒插孔脱离机壳。

source: The board angled vertically and the flat metal shield underneath where it was.
fr_ca: La carte inclinée verticalement et le bouclier métallique plat en dessous de là où il se trouvait.

source: Tilt the board up (towards the short grey antenna cable) to expose the metal shield underneath.
es_mx: Incline la placa hacia arriba (hacia el cable de antena gris corto) para exponer el blindaje de metal que se encuentra debajo.
fr_ca: Inclinez la carte vers le haut (vers le câble d'antenne court et gris) pour exposer le blindage métallique en dessous.
tr_tr: Altındaki metal korumayı ortaya çıkarmak için kartı yukarı (kısa gri anten kablosuna doğru) yatırın.
zh_cn: 将电路板向上倾斜（朝向短的灰色天线电缆），露出下面的金属层。

source: When you perform this step, you may notice that there is a small reset button on the underside of the board that is larger than the hole in the case. Note that pressing the reset button with the FRC firmware installed has no effect and that drilling the case of the radio is not a permitted modification.
es_mx: Al realizar este paso, es posible que observe que hay un pequeño botón de reinicio en la parte inferior de la placa que es más grande que el orificio de la caja. Tenga en cuenta que presionar el botón de reinicio con el firmware FRC instalado no tiene ningún efecto y que perforar la carcasa del radio no es una modificación permitida.
fr_ca: À cette étape, vous pouvez remarquer qu'il y a un petit bouton de réinitialisation sur le dessous de la carte et qui est plus grand que le trou dans le boîtier. Notez que le fait d'appuyer sur le bouton de réinitialisation alors que le micrologiciel FRC est installé n'a aucun effet et que percer le boîtier de la radio n'est pas une modification autorisée.
tr_tr: Bu adımı gerçekleştirdiğinizde, kartın alt tarafında kasadaki delikten daha büyük reset düğmesi olduğunu fark edebilirsiniz. FRC aygıt yazılımı kurulu haldeyken sıfırlama düğmesine basmanın hiçbir etkisi olmadığını ve radyo kasasını delmenin izin verilen bir değişiklik olmadığını unutmayın.
zh_cn: 当您执行此步骤时，您可能会注意到板的底侧有一个小的复位按钮，该按钮大于机壳上的孔。请注意，在安装了FRC固件的情况下，按下重置按钮无效，并且不允许修改路由器的外壳。

source: Apply Tape
es_mx: Aplicar cinta
fr_ca: Appliquez du ruban adhésif
tr_tr: Bant Uygula
zh_cn: 贴胶带

source: Applying electrical tape at the front of the shield near the Ethernet ports.
fr_ca: Application d’une bande électrique à l’avant de l'écran de protection près des ports Ethernet.

source: Apply a piece of electrical tape to the metal shield in the area just inside of the network port/barrel jack openings. This will prevent the exposed leads on the underside of the board from short circuiting on this plate.
es_mx: Aplique un trozo de cinta aislante al blindaje de metal en el área justo dentro de las aberturas del conector de barril / puerto de red. Esto evitará que los cables expuestos en la parte inferior de la placa entren en cortocircuito en esta placa.
fr_ca: Appliquez un morceau de ruban électrique adhésif sur le blindage métallique dans la zone juste à l'intérieur des ouvertures du port réseau et du connecteur d'alimentation. Cela empêchera les fils exposés sur le dessous de la carte de court-circuiter sur cette plaque.
tr_tr: Ağ bağlantı noktası / güç bağlantı jackı açıklıklarının hemen içindeki alandaki metal korumaya bir parça elektrik bandı uygulayın. Bu, kartın altındaki açıkta kalan uçların bu plakada kısa devre yapmasını önleyecektir.
zh_cn: 在网络端口/公头开口内部的区域中，在金属层上缠上一条胶带。这样可以防止电路板下面的裸露引线在该板上短路。

source: Re-assemble Radio
es_mx: Volver a montar la radio
fr_ca: Réassemblez la radio
tr_tr: Radyoyu Yeniden Birleştirin
zh_cn: 重新组装路由器

source: Re-assemble the radio by reversing the instructions to open it:
es_mx: Vuelva a ensamblar la radio invirtiendo las instrucciones para abrirla:
fr_ca: Procédez au réassemblage de la radio en inversant les instructions de démontage.
tr_tr: Açmak için talimatları tersine çevirerek radyoyu yeniden monte edin:
zh_cn: 按照将其打开的说明的相反步骤重新组装路由器：
