Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/om5p-ac-radio-modification.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Lay the board back down, making sure it aligns with the screw holes near the front and seats securely
es_mx: Vuelva a colocar la tabla, asegurándose de que se alinee con los orificios de los tornillos cerca del frente y se asiente de forma segura
fr_ca: Déposez la carte vers le bas, en vous assurant qu'elle s'aligne avec les trous de vis près de l'avant et qu'elle repose correctement.
tr_tr: Ön tarafa yakın vida delikleriyle hizalandığından ve güvenli bir şekilde oturduğundan emin olarak kartı geri yerleştirin
zh_cn: 将板放回原处，确保其与前部附近的螺孔对齐并牢固就位

source: Slide the lid onto the back left retaining feature by moving it in from right to left. Take care of the capacitor in this area
es_mx: Deslice la tapa sobre la función de retención trasera izquierda moviéndola hacia adentro de derecha a izquierda. Cuida el condensador en esta área
fr_ca: Faites glisser le couvercle sur la butée de retenue arrière gauche en le déplaçant de droite à gauche. Prenez soin du condensateur dans cette zone.
tr_tr: Kapağı sağdan sola hareket ettirerek arka sol tutma tırnağına kaydırın. Bu alandaki kondansatöre dikkat edin
zh_cn: 从右向左移动盖子，将盖子滑到左后固定功能部件上。照顾这个区域的电容器

source: Rotate the lid, press downwards and slide the back right retaining feature in
es_mx: Gire la tapa, presione hacia abajo y deslice la pieza de retención trasera derecha hacia dentro
fr_ca: Faites pivoter le couvercle, appuyez vers le bas et faites glisser la butée de retenue arrière droite.
tr_tr: Kapağı döndürün, aşağı doğru bastırın ve sağ arka tutma tırnağına oturtun
zh_cn: 旋转盖子，向下按，然后向右滑动后固定住

source: Press down firmly on the front/middle of the lid to seat the latches
es_mx: Presione firmemente hacia abajo en la parte delantera / central de la tapa para asentar los pestillos
fr_ca: Appuyez fermement sur l'avant / le milieu du couvercle pour asseoir les loquets.
tr_tr: Mandalları oturtmak için kapağın önüne / ortasına sıkıca bastırın
zh_cn: 用力向下按盖子的前部/中部以固定闩锁

source: Replace 2 screws in front feet
es_mx: Reemplace 2 tornillos en las patas delanteras
fr_ca: Replacez les 2 vis des pattes avant.
tr_tr: Ön ayaklardaki 2 vidayı yerleştirin
zh_cn: 装回前脚中的2个螺钉

source: Replace front feet
es_mx: Reemplazar pies delanteros
fr_ca: Replacez les pattes avant.
tr_tr: Ön ayakları yerleştirin
zh_cn: 装回前脚
