Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/roborio-network-troubleshooting.po
Languages: es_mx, tr_tr, zh_cn

source: roboRIO Network Troubleshooting
es_mx: Solución de problemas de la red en la roboRIO
tr_tr: roboRIO Ağ Sorunlarını Giderme
zh_cn: roboRIO网络故障排除

source: The roboRIO and FRC\ |reg| tools use dynamic IP addresses (DHCP) for network connectivity. This article describes steps for troubleshooting networking connectivity between your PC and your roboRIO
es_mx: La roboRIO y las herramientas de juego de FRC\ |reg| utilizan direcciones IP dinámicas (DHCP) para la conectividad de la red. Este artículo describe los pasos para la resolución de problemas de conectividad de red entre su PC y su roboRIO
tr_tr: RoboRIO ve FRC \ |reg| araçlar, ağ bağlantısı için dinamik IP adresleri (DHCP) kullanır. Bu makale, bilgisayarınız ve roboRIO'nuz arasındaki ağ bağlantısı sorunlarını giderme adımlarını açıklamaktadır.
zh_cn: roboRIO和FRC \ | reg |工具使用动态IP地址（DHCP）进行网络连接。本文介绍了对PC和roboRIO之间的网络连接进行故障排除的步骤

source: Ping the roboRIO using mDNS
es_mx: Fijar la roboRIO usando mDNS
tr_tr: MDNS kullanarak roboRIO’yu pingleyin
zh_cn: 使用mDNS 检查 roboRIO

source: The first step to identifying roboRIO networking issues is to isolate if it is an application issue or a general network issue. To do this, click **Start -> type cmd -> press Enter** to open the command prompt. Type ``ping roboRIO-####-FRC.local`` where #### is your team number (with no leading zeroes) and press enter. If the ping succeeds, the issue is likely with the specific application, verify your team number configuration in the application, and check your firewall configuration.
es_mx: El primer paso para identificar los problemas de red de roboRIO es aislar si se trata de un problema de aplicación o un problema general de la red. Para hacer esto, haga clic en **Start -> type cmd -> press Enter** para abrir el símbolo del sistema. Escriba ``ping roboRIO-####-FRC.local`` donde #### es el número de su equipo (sin ceros a la izquierda) y presione enter. Si el ping tiene éxito, es probable que el problema sea con la aplicación específica, verifique la configuración del número de su equipo en la aplicación y verifique la configuración de su firewall.
tr_tr: RoboRIO ağ iletişimi sorunlarını belirlemenin ilk adımı, bunun bir uygulama sorunu mu yoksa genel bir ağ sorunu mu olduğunu belirlemektir. Bunu yapmak için, komut istemi açmak için **Start -> cmd yazın -> Enter'a basın**. ``ping roboRIO-####-FRC.local`` yazın, burada #### takım numaranızdır (başında sıfır olmadan) ve enter tuşuna basın. Ping başarılı olursa, sorun büyük olasılıkla belirli bir uygulamadadır, uygulamadaki ekip numarası yapılandırmanızı doğrulayın ve güvenlik duvarı yapılandırmanızı kontrol edin.
zh_cn: 识别roboRIO网络问题的第一步是隔离如果其是应用程序问题或常规网络问题的话。为此，请单击**开始->输入cmd->按Enter **以打开命令提示符。输入``ping roboRIO-####-FRC.local``，其中####是您的团队编号（没有前导零），然后按Enter键。如果ping操作成功，则可能是特定应用程序出现了问题，请在应用程序中验证您的团队编号配置，然后检查防火墙配置。

source: Ping the roboRIO IP Address
es_mx: Fijar la dirección IP de la roboRIO
tr_tr: RoboRIO IP Adresine ping atma
zh_cn: ping roboRIO IP的地址

source: If there is no response, try pinging ``10.TE.AM.2`` (:ref:`TE.AM IP Notation <docs/networking/networking-introduction/ip-configurations:TE.AM IP Notation>`) using the command prompt as described above. If this works, you have an issue resolving the mDNS address on your PC. The two most common causes are not having an mDNS resolver installed on the system and a DNS server on the network that is trying to resolve the .local address using regular DNS.
es_mx: Si no hay respuesta, intente fijar "10.TE.AM.2". (:ref:`TE.AM IP Notation <docs/networking/networking-introduction/ip-configurations:TE.AM IP Notation>`) utilizando el símbolo del sistema como se ha descrito anteriormente. Si esto funciona, tiene un problema para resolver la dirección mDNS en tu PC. Las dos causas más comunes son no tener un solucionador de mDNS instalado en el sistema y un servidor DNS en la red que está tratando de resolver la dirección .local usando DNS regulares.
tr_tr: Yanıt yoksa, ``10.TE.AM.2`` (:ref:`TE.AM IP Notation <docs/networking/networking-introduction/ip-configurations:TE.AM IP Notation>`) yukarıda açıklandığı gibi hemen ping atmayı deneyin. Bu işe yararsa, PC'nizdeki mDNS adresini çözmede sorun yaşarsınız. En yaygın iki neden, sistemde kurulu bir mDNS çözücünün olmaması ve ağda .local adresini normal DNS kullanarak çözümlemeye çalışan bir DNS sunucusudur.
zh_cn: 如果没有响应，请尝试使用上述命令提示符对``10.TE.AM.2''（：ref：`TE.AM IP符号<docs/networking/networking-introduction/ip-configurations:TE.AM IP Notation>`）进行ping操作。如果这行得通，则说明您在PC上解析mDNS地址时遇到问题。两种最常见的原因是系统上没有安装mDNS解析器，而网络上没有试图使用常规DNS解析.local地址的DNS服务器。

source: Disconnect your computer from any other networks and make sure you have the OM5P-AN configured as an access point, using the :ref:`FRC Radio Configuration Utility <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`. Removing any other routers from the system will help verify that there is not a DNS server causing the issue.
es_mx: Desconecte su ordenador de cualquier otra red y asegúrese de que tiene el OM5P-AN configurado como punto de acceso, utilizando el :ref:`FRC Radio Configuration Utility <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`. Elimine cualquier otro router del sistema ayudará a verificar que no hay un servidor DNS que cause el problema.
tr_tr: Bilgisayarınızın diğer tüm ağlarla olan bağlantısını kesin ve OM5P-AN'nin bir erişim noktası olarak yapılandırıldığından emin olun : ref: `FRC Radyo Yapılandırma Yardımcı Programı <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`. Sistemden diğer yönlendiricilerin kaldırılması, soruna neden olan bir DNS sunucusu olmadığının doğrulanmasına yardımcı olacaktır.
zh_cn: 使用：ref：`FRC无线电配置实用程序<docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`，将您的计算机与其他任何网络断开连接，并确保已将OM5P-AN配置为访问点。从系统中删除任何其他路由器将有助于验证是否没有DNS服务器引起此问题。

source: Ping Fails
es_mx: Fije las fallas
tr_tr: Ping Başarısız
zh_cn: 平失败

source: If pinging the IP address directly fails, you may have an issue with the network configuration of the PC. The PC should be configured to **Automatic**. To check this, click :guilabel:`Start` -> :guilabel:`Settings` -> :guilabel:`Network & Internet`. Depending on your network, select :guilabel:`Wifi` or :guilabel:`Ethernet`. Then click on your connected network. Scroll down to **IP settings** and click :guilabel:`Edit` and ensure the :guilabel:`Automatic (DHCP)` option is selected.
es_mx: Si el ping de la dirección IP falla, se debe tener un problema con la configuración de la conexión de la PC. La PC debe tener configurado **automático**. Para verificar eso, click en :guilabel:`Start` -> :guilabel:`Settings` -> :guilabel:`Network & Internet`. Dependiendo de la conexión, seleccione :guilabel:`Wifi` or :guilabel:`Ethernet`. Después haga click en la conexión deseada. Baje por la pantalla a **IP settings** y de click en :guilabel:`Edit` y verifique que la opción :guilabel:`Automatic (DHCP)` esté seleccionada.
tr_tr: IP adresine doğrudan ping atmak başarısız olursa, bilgisayarın ağ yapılandırmasıyla ilgili bir sorununuz olabilir. PC **Automatic** olarak yapılandırılmalıdır. Bunu kontrol etmek için, tıklayın:guilabel:`Start` -> :guilabel:`Settings` -> :guilabel:`Network & Internet` e tıklayınız. Ağınıza bağlı olarak şunu seçin :guilabel:`Wifi` veya :guilabel:`Ethernet`. Ardından bağlı ağınıza tıklayın. **IP settings** 'na gidin ve tıklayın :guilabel:`Edit` ve :guilabel:`Automatic (DHCP)` seçeneğinin seçili olduğundan emin olun.
zh_cn: 如果直接ping IP地址失败，则PC的网络配置可能有问题。 PC应该配置为“自动”。要检查这一点，请单击“开始”->“设置”->“网络和Internet”。根据您的网络，选择“ Wifi”或“以太网”。然后单击您所连接的网络。向下滚动到“ IP设置”，然后单击“编辑”，并确保选择了“自动（DHCP）”选项。

source: If pinging the IP address directly fails, you may have an issue with the network configuration of the PC. The PC should be configured to **Obtain an Address Automatically** (also known as DHCP). To check this, click :guilabel:`Start` -> :guilabel:`Control Panel` -> :guilabel:`Network Connections` -> :guilabel:`Change adapter settings`, then right click on the appropriate interface (usually Local Area Connection for Ethernet or Wireless Network Connection for wireless) and select :guilabel:`Properties`. Click :guilabel:`Internet Protocol Version 4`, then click :guilabel:`Properties`. Make sure both radio buttons are set to :guilabel:`Obtain automatically`.
es_mx: Si el ping de la dirección IP falla, debe haber problemas con la configuración de la conexión de la PC. La PC debe estar configurada en **Obtener la dirección automáticamente** (también conocida como DHCP). PAra verificar esto, click en :guilabel:`Start` -> :guilabel:`Control Panel` -> :guilabel:`Network Connections` -> :guilabel:`Change adapter settings`, depués click-derecho en la interface apropiada (usualmente Conexión de área local o Conexión inalámbrica para hacerlo sin cable) y seleccione :guilabel:`Properties`. Click :guilabel:`Internet Protocol Version 4`, y click en :guilabel:`Properties`. Asegúrese que ambos radios estén en :guilabel:`Obtain automatically`.
tr_tr: IP adresine doğrudan ping atmak başarısız olursa, bilgisayarın ağ yapılandırmasıyla ilgili bir sorununuz olabilir. PC, **Obtain an Address Automatically** (DHCP olarak da bilinir) şeklinde yapılandırılmalıdır. Bunu kontrol etmek için, tıklayın :guilabel:`Start` -> :guilabel:`Control Panel` -> :guilabel:`Network Connections` -> :guilabel:`Change adapter settings` tıklayın, ardından uygun arayüze sağ tıklayın (genellikle Local Area Connection for Ethernet veya Wireless Network Connection for wireless) ve :guilabel:`Properties`. Click :guilabel:`Internet Protocol Version 4` seçin, ardından :guilabel:`Properties` tıklayın. Her iki radyo düğmesinin de şu şekilde ayarlandığından emin olun :guilabel:`Obtain automatically`.

source: USB Connection Troubleshooting
es_mx: Solución de problemas de conexión USB
tr_tr: USB Bağlantısı Sorunlarını Giderme
zh_cn: USB连接故障排除

source: If you are attempting to troubleshoot the USB connection, try pinging the roboRIO's IP address. As long as there is only one roboRIO connected to the PC, it should be configured as 172.22.11.2. If this ping fails, make sure you have the roboRIO connected and powered, and that you have installed the NI FRC Game Tools. The game tools installs the roboRIO drivers needed for the USB connection.
es_mx: Si está intentando solucionar un problema de conexión USB, intente hacer ping a la dirección IP de roboRIO. Siempre y cuando solo haya un roboRIO conectado a la PC, debe configurarse como 172.22.11.2. Si este ping falla, asegúrese de tener el roboRIO conectado y encendido, y de haber instalado NI FRC Game Tools. Las herramientas del juego instalan los controladores roboRIO necesarios para la conexión USB.
tr_tr: USB bağlantısındaki sorunu gidermeye çalışıyorsanız, roboRIO'nun IP adresine ping atmayı deneyin. Bilgisayara bağlı yalnızca bir roboRIO olduğu sürece, 172.22.11.2 olarak yapılandırılmıştır. Bu ping başarısız olursa, roboRIO'nun bağlı ve çalıştığından ve NI FRC Game Took araçlarının yüklü olduğundan emin olunuz. Game Tools, USB bağlantısı için gerekli roboRIO sürücülerini de yükler.
zh_cn: 如果您尝试对USB连接进行故障排除，请尝试ping roboRIO的IP地址。只要仅将一个roboRIO连接到PC，就应将其配置为172.22.11.2。如果无法ping通，请确保已连接roboRIO并为其供电，并且已安装NI FRC游戏工具。游戏工具会安装USB连接所需的roboRIO驱动程序。

source: If this ping succeeds, but the .local ping fails, it is likely that either the roboRIO hostname is configured incorrectly, or you are connected to a DNS server which is attempting to resolve the .local address.
es_mx: Si este ping tiene éxito, pero el .ping local falla, es probable que el nombre de host de roboRIO esté configurado incorrectamente o que esté conectado a un servidor DNS que está intentando resolver la .dirección local.
tr_tr: Bu ping başarılı olursa, ancak .local ping işlemi başarısız olursa, roboRIO ana bilgisayar adı yanlış yapılandırılmış olabilir veya .local adresini çözmeye çalışan bir DNS sunucusuna bağlanmış olabilirsiniz.
zh_cn: 如果此ping成功，但.local ping失败，则可能是roboRIO主机名配置错误，或者您已连接到尝试解析.local地址的DNS服务器。

source: Verify that your roboRIO has been :ref:`imaged for your team number <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>`. This sets the hostname used by mDNS.
es_mx: Verifica que su roboRIO ha sido :ref:`imaginado para su número de equipo <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>`. Esto establece el nombre del host usado por el mDNS.
tr_tr: RoboRIO'nuzun : ref:`takım numaranız <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>` için görüntülendiğini doğrulayın. Bu, mDNS tarafından kullanılan ana bilgisayar adını ayarlar.
zh_cn: 验证您的roboRIO已针对团队编号<docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>进行了映像。这将设置mDNS使用的主机名。

source: :ref:`Disable all other network adapters <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`
es_mx: :ref:`Desactive cualquier adapatador de red <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`
tr_tr: :ref:`Diğer tüm ağ bağdaştırıcılarını devre dışı bırak <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`
zh_cn: ：ref：`禁用所有其他网络适配器<docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`

source: Ethernet Connection
es_mx: Conexión ethernet
tr_tr: Ethernet Bağlantısı
zh_cn: 以太网连接

source: If you are troubleshooting an Ethernet connection, it may be helpful to first make sure that you can connect to the roboRIO using the USB connection. Using the USB connection, open the :ref:`roboRIO webdashboard <docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard>` and verify that the roboRIO has an IP address on the ethernet interface. If you are tethering to the roboRIO directly this should be a self-assigned ``169.*.*.*`` address, if you are connected to the OM5P-AN radio, it should be an address of the form ``10.TE.AM.XX`` where TEAM is your four digit FRC team number. If the only IP address here is the USB address, verify the physical roboRIO ethernet connection.
es_mx: Si está solucionando problemas con una conexión Ethernet, puede ser útil asegurarse primero de que puede conectarse al roboRIO mediante la conexión USB. Usando la conexión USB, abra :ref:`roboRIO webdashboard <docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard>` y verifique que roboRIO tenga una dirección IP en la interfaz ethernet. Si se conecta directamente al roboRIO, esta debe ser una dirección autoasignada ``169.*.*.*``, Si está conectado a la radio OM5P-AN, debe ser una dirección del formulario ``10.TE.AM.XX`` donde TEAM es su número de equipo FRC de cuatro dígitos. Si la única dirección IP aquí es la dirección USB, verifique la conexión física roboRIO ethernet.
tr_tr: Bir Ethernet bağlantısında sorun gideriyorsanız, önce USB bağlantısını kullanarak roboRIO'ya bağlanabildiğinizden emin olmanız faydalı olabilir. USB bağlantısını kullanarak :ref:`roboRIO webdashboard <docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard>` arayüzünü açın ve roboRIO'nun ethernet arayüzünde bir IP adresine sahip olduğunu doğrulayın. RoboRIO'ya doğrudan bağlantı kuruyorsanız, bu kendi kendine atanan bir ``169.*.*.*`` adresi olmalıdır, OM5P-AN radyo ile bağlıysanız, ``10.TE.AM.XX`` burada TEAM, dört haneli FRC takım numaranızdır. Buradaki tek IP adresi USB adresiyse, fiziksel roboRIO ethernet bağlantısını kontrol edin.
zh_cn: 如果要对以太网连接进行故障排除，首先确保你可以使用USB连接连接到roboRIO可能会有所帮助。使用USB连接，打开roboRIO Web面板<docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard>，并验证roboRIO在以太网接口上是否具有IP地址。如果要直接绑定到roboRIO，则应为自定义的``169。*。*。*''地址，如果已连接到OM5P-AN无线电，则应为``10''形式的地址.TE.AM.XX``，其中TEAM是您的四位数FRC团队编号。如果此处唯一的IP地址是USB地址，请验证物理roboRIO以太网连接。

source: Disabling Network Adapters
es_mx: Desactivar los adaptadores de red
tr_tr: Ağ Adaptörlerini Devre Dışı Bırakma
zh_cn: 禁用网络适配器

source: This is not always the same as turning the adapters off with a physical button or putting the PC into airplane mode. The following steps provide more detail on how to disable adapters.
es_mx: No siempre es lo mismo que apagar los adaptadores con un botón físico o poner el PC en modo avión. Los siguientes pasos proporcionan más detalles sobre cómo desactivar los adaptadores.
tr_tr: Bu, adaptörleri fiziksel bir düğme ile kapatmak veya bilgisayarı uçak moduna almakla her zaman aynı değildir. Aşağıdaki adımlar, adaptörlerin nasıl devre dışı bırakılacağı hakkında daha fazla ayrıntı sağlar.
zh_cn: 这与通过物理按钮关闭适配器或使PC进入飞行模式并不总是相同。以下步骤提供有关如何禁用适配器的更多详细信息。

source: Open the Settings application by clicking on the settings icon.
es_mx: Abra la aplicación Configuración haciendo clic en el icono de configuración.
tr_tr: Ayarlar simgesine tıklayarak Ayarlar uygulamasını açın.
zh_cn: 通过单击设置图标打开设置应用程序。

source: Choose the :guilabel:`Network & Internet` category.
es_mx: Elija la categoria :guilabel:`Network & Internet`
tr_tr: :guilabel:`Network & Internet` kategorisini seçin.
zh_cn: 选择“网络和Internet”类别。

source: Click on :guilabel:`Change adapter options`.
es_mx: Haga click en :guilabel:`Change adapter options`.
tr_tr: Şuna tıklayın :guilabel:`Change adapter options`.
zh_cn: 单击“更改适配器选项”。

source: Open the Control Panel by going to :guilabel:`Start` -> :guilabel:`Control Panel`
es_mx: Abra el panel de control al ir :guilabel:`Start` -> :guilabel:`Control Panel`
tr_tr: :guilabel:`Start` -> :guilabel:`Control Panel` konumuna giderek Denetim Masası'nı açın.

source: Choose the :guilabel:`Network and Internet` category.
es_mx: Elija la categoría :guilabel:`Network and Internet`
tr_tr: :guilabel:`Network and Internet` kategorisini seçin.

source: Click :guilabel:`Network and Sharing Center`
es_mx: Click en :guilabel:`Network and Sharing Center`
tr_tr: Tıklayın :guilabel:`Network and Sharing Center`

source: On the left pane, click :guilabel:`Change Adapter Settings`.
es_mx: En el panel izquierdo, haga click en :guilabel:`Change Adapter Settings`.
tr_tr: Sol bölmede, tıklayın :guilabel:`Change Adapter Settings`.
zh_cn: 在左窗格上，单击“更改适配器设置”。

source: For each adapter other than the one connected to the radio, right click on the adapter and select :guilabel:`Disable` from the menu.
es_mx: Para cada adaptador que no sea el que está conectado a la radio, haga clic con el botón derecho del ratón en el adaptador y seleccione :guilabel:`Disable` from the menu.
tr_tr: Telsize bağlı olan dışındaki her bir adaptör için, adaptöre sağ tıklayın ve menüden :guilabel:`Disable` seçin.
zh_cn: 对于除与无线电连接的适配器以外的每个适配器，请右键单击适配器，然后从菜单中选择“禁用”。

source: Proxies
tr_tr: Proxies-Vekil sunucular.
zh_cn: 代理

source: Proxies. Having a proxy enabled may cause issues with the roboRIO networking.
es_mx: Proxies. Tener un proxy habilitado puede causar problemas con la red roboRIO.
tr_tr: Proxies. Etkin bir proxy'ye sahip olmak roboRIO ağ iletişimi ile ilgili sorunlara neden olabilir.
zh_cn: 代理。启用代理可能会导致roboRIO网络出现问题。
