Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/windows-firewall-configuration.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Windows Firewall Configuration
es_mx: Configuración de Firewall de Windows
fr_ca: Configuration du pare-feu Windows
tr_tr: Windows Güvenlik Duvarı Yapılandırması
zh_cn: Windows防火墙配置

source: Many of the programming tools used in FRC\ |reg| need network access for various reasons. Depending on the exact configuration, the Windows Firewall may potentially interfere with this access for one or more of these programs.
es_mx: Muchas de las herramientas de programación utilizadas en FRC\ |reg| necesitan acceso a la red por varias razones. Dependiendo de la configuración exacta, el Firewall de Windows puede interferir potencialmente con este acceso para uno o más de estos programas.
fr_ca: De nombreux outils de programmation utilisés dans FRC\ |reg| besoin d’un accès au réseau pour diverses raisons. Selon la configuration exacte, le pare-feu Windows peut potentiellement interférer avec cet accès pour un ou plusieurs de ces programmes.
tr_tr: FRC \ |reg| 'de kullanılan programlama araçlarının çoğu çeşitli nedenlerle ağ erişimine ihtiyaç duyuyor. Tam yapılandırmaya bağlı olarak, Windows Güvenlik Duvarı bu programlardan biri veya daha fazlası için bu erişime potansiyel olarak müdahale edebilir.
zh_cn: FRC \ | reg |中使用的许多编程工具由于各种原因需要网络访问。根据确切的配置，Windows防火墙可能会干扰其中一个或多个程序的访问。

source: Disabling Windows Firewall
es_mx: Deshabilitar el Firewall de Windows
fr_ca: Désactiver le pare-feu Windows
tr_tr: Windows Güvenlik Duvarını Devre Dışı Bırakma
zh_cn: 禁用Windows防火墙

source: Disabling your firewall requires administrator privileges to the PC. Additionally note that disabling the firewall is not recommended for computers that connect to the internet.
es_mx: La desactivación de su firewall requiere privilegios de administrador en la PC. Además, tenga en cuenta que no se recomienda deshabilitar el firewall para computadoras que se conectan a Internet.
fr_ca: La désactivation de votre pare-feu nécessite des privilèges d'administrateur sur le PC. Notez également que la désactivation du pare-feu n'est pas recommandée pour les ordinateurs qui se connectent à Internet.
tr_tr: Güvenlik duvarınızı devre dışı bırakmak, bilgisayarda yönetici ayrıcalıkları gerektirir. Ayrıca, internete bağlanan bilgisayarlar için güvenlik duvarının devre dışı bırakılmasının tavsiye edilmediğini unutmayın.
zh_cn: 禁用防火墙需要具有PC管理员权限。另外请注意，对于连接到Internet的计算机，建议不要禁用防火墙。

source: The easiest solution is to disable the Windows Firewall. Teams should beware that this does make the PC potentially more vulnerable to malware attacks if connecting to the internet.
es_mx: La solución más sencilla es desactivar el Firewall de Windows. Los equipos deben tener en cuenta que esto hace que la PC sea potencialmente más vulnerable a los ataques de malware si se conecta a Internet.
fr_ca: La solution la plus simple consiste à désactiver le pare-feu Windows. Les équipes doivent être conscientes que cela rend le portable potentiellement plus vulnérable aux attaques de logiciels malveillants lors de la connexion à Internet.
tr_tr: En kolay çözüm, Windows Güvenlik Duvarını devre dışı bırakmaktır. Ekipler, bunun, internete bağlanıldığında bilgisayarı kötü amaçlı yazılım saldırılarına karşı potansiyel olarak daha savunmasız hale getireceğine dikkat etmelidir.
zh_cn: 最简单的解决方案是禁用Windows防火墙。团队应注意，如果连接到Internet，这确实会使PC可能更容易受到恶意软件攻击。

source: Click :guilabel:`Start` -> :guilabel:`Settings`
es_mx: Haga clic en :guilabel:`Start` -> :guilabel:`Settings`
fr_ca: Cliquez sur :guilabel:`Start` -> :guilabel:`Settings`
tr_tr: :guilabel:`Start` -> :guilabel:`Settings` tıklayın
zh_cn: 点击 :guilabel:`Start` -> :guilabel:`Settings`

source: Setting gear icon under the start menu.
fr_ca: Définition de l’icône d’engrenage sous le menu Démarrer.

source: Click :guilabel:`Update & Security`
es_mx: Haga clic en: guilabel:`Update & Security`
fr_ca: Cliquez sur :guilabel:`Update & Security`
tr_tr: :guilabel:`Update & Security` tıklayınız
zh_cn: 点击 :guilabel:`Update & Security`

source: Click the "Update & Security" category.
fr_ca: Cliquez sur la catégorie "Update & Security".

source: In the right pane, select :guilabel:`Open Windows Security`
es_mx: En el panel derecho, seleccione :guilabel:`Abrir seguridad de Windows`.
fr_ca: Dans le panneau de droite, sélectionner :guilabel:`Open Windows Security`
zh_cn: 在右边界面选择:guilabel:`Open Windows Security`

source: Click the "Open Windows Security" button at the top of the right pane.
fr_ca: Cliquez sur le bouton "Open Windows Security" en haut du volet droit.

source: In the left pane, select :guilabel:`Firewall and network protection`
es_mx: En el panel izquierdo, seleccione :guilabel:`Firewall y network protection`
fr_ca: Dans le volet gauche, sélectionnez :guilabel:`Firewall and network protection`
tr_tr: Sol bölmede, :guilabel:`Firewall and network protection` seçin
zh_cn: 左边界面选择:guilabel:`Firewall and network protection`

source: Left pane option on the Security at a glance page.
fr_ca: Option volet gauche sur la page Sécurité en un coup d’œil.

source: Click on **each** of the highlighted options
es_mx: Haga clic en **cada una** de las opciones resaltadas
fr_ca: Cliquez sur ** chacune ** des options mises en évidence
tr_tr: Vurgulanan seçeneklerden **her birine** tıklayın
zh_cn: 单击突出显示的**每个**选项

source: Click on the three highlighted options: Domain network, Private network, and Public Network.
fr_ca: Cliquez sur les trois options en surbrillance : Domain network, Private network, et Public Network.

source: Then click on the **On** toggle to turn it off.
es_mx: Luego, haga clic en el botón **On** para apagarlo.
fr_ca: Cliquez ensuite sur le bouton ** ON ** pour le désactiver.
tr_tr: Ardından kapatmak için **On** düğmesine tıklayın.
zh_cn: 然后单击** On **开关将其关闭。

source: The toggle button in the center for each option.
fr_ca: Bouton à bascule au centre de chaque option.

source: Whitelisting Apps
es_mx: Aplicaciones de la lista blanca
fr_ca: Liste blanche des applications
tr_tr: Beyaz Listeye Ekleyen Uygulamalar
zh_cn: 白名单程序

source: Alternatively, you can add exceptions to the Firewall for any FRC programs you are having issues with.
es_mx: Alternativamente, puede agregar excepciones al Firewall para cualquier programa de FRC con el que tenga problemas.
fr_ca: Vous pouvez également ajouter des exceptions au pare-feu pour tous les programmes FRC avec lesquels vous rencontrez des problèmes.
tr_tr: Alternatif olarak, sorun yaşadığınız tüm FRC programları için Güvenlik Duvarına istisnalar ekleyebilirsiniz.
zh_cn: 或者，您可以为遇到问题的任何FRC程序向防火墙添加例外。

source: The settings gear icon in the start menu.
fr_ca: L’icône d’engrenage des paramètres dans le menu Démarrer.

source: Update & Security category.
fr_ca: Catégorie Update & Security

source: Choose "Open Windows Security"
fr_ca: Choisir "Open Windows Security"

source: Choose "Firewall & Network protection" in the left pane.
fr_ca: Choisissez "Firewall & Network protection" dans le volet gauche.

source: At the bottom of the window, select :guilabel:`Allow an app through firewall`
es_mx: En la parte inferior de la ventana, seleccione :guilabel:`Allow an app through firewall`
fr_ca: En bas de la fenêtre, sélectionnez :guilabel:`Allow an app through firewall`
tr_tr: Pencerenin alt kısmında şunu seçin :guilabel:`Allow an app through firewall`
zh_cn: 窗口下方，选择:guilabel:`Allow an app through firewall`

source: Choose "Allow an app through firewall" in the center of the screen.
fr_ca: Choisir "Allow an app through firewall" au centre de l'écran.

source: For each FRC program you are having an issue with, make sure that it appears in the list and that it has a check in each of the 3 columns. If you need to change a setting, you made need to click the :guilabel:`Change settings` button in the top right before changing the settings. If the program is not in the list at all, click the :guilabel:`Allow another program...` button and browse to the location of the program to add it.
es_mx: Para cada programa de FRC con el que tenga un problema, asegúrese de que aparezca en la lista y de que tenga una marca en cada una de las 3 columnas. Si necesita cambiar una configuración, debe hacer clic en el botón :guilabel:`Change settings` en la parte superior derecha antes de cambiar la configuración. Si el programa no está en la lista, haga clic en el botón :guilabel:`Allow another program...` y busque la ubicación del programa para agregarlo.
fr_ca: Pour chaque programme FRC avec lequel vous rencontrez un problème, assurez-vous qu'il apparaît dans la liste et qu'il est coché dans chacune des 3 colonnes. Si vous avez besoin de modifier un paramètre, vous devez cliquer sur le bouton :guilabel:`Change settings` en haut à droite avant de modifier les paramètres. Si le programme n'est pas du tout dans la liste, cliquez sur le bouton :guilabel:`Allow another program...` et accédez à l'emplacement du programme pour l'ajouter.
tr_tr: Sorun yaşadığınız her FRC yazılımı için, programın listede göründüğünden ve 3 sütunun her birinde bir onayı bulunduğundan emin olun. Bir ayarı değiştirmeniz gerekirse, ayarları değiştirmeden önce sağ üstteki :guilabel:`Change settings` düğmesine tıklamanız gerekir. Program listede yoksa :guilabel:`Allow another program...` düğmesine tıklayın ve eklemek için programın konumuna göz atın.
zh_cn: 对于您遇到问题的每个FRC程序，请确保它出现在列表中，并且在3列的每一列中都有一个选中标记。如果您需要更改设置，则需要先单击右上角的 :guilabel:`Change settings` 按钮，然后再更改设置。如果该程序根本不在列表中，请单击 :guilabel:`Allow another program...`按钮，然后浏览至该程序的位置以将其添加。

source: Modify the list presented using the checkboxes to the right of each item.
fr_ca: Modifiez la liste présentée à l’aide des cases à cocher situées à droite de chaque élément.

source: Click :guilabel:`Start` -> :guilabel:`Control Panel` to open the Control Panel. Click the dropdown next to :guilabel:`View by:` and select :guilabel:`Small icons` then click :guilabel:`Windows Firewall`.
es_mx: Haga clic en :guilabel:`Inicio` -> :guilabel:`Panel de control` para abrir el Panel de control. Haga clic en el menú desplegable junto a :guilabel:`Ver por:` y seleccione :guilabel:`Iconos pequeños` y luego haga clic en :guilabel:`Firewall de Windows`.

source: In the left pane, click :guilabel:`Turn Windows Defender Firewall on or off`, and click yes. Enter your Administrator password if a dialog appears.
es_mx: En el panel izquierdo, haga clic en :guilabel:`Turn Windows Defender Firewall on or off` y haga clic en yes. Introduzca su contraseña de administrador si aparece un cuadro de diálogo.
tr_tr: Sol bölmede, :guilabel:`Turn Windows Defender Firewall on or off` a tıklayın ve evet'i tıklayın. Bir iletişim kutusu görünürse, Yönetici şifrenizi girin.

source: For each category, select the radio button to :guilabel:`Turn off Windows Defender Firewall`. Then click OK.
es_mx: Para cada categoría, seleccione el botón de radio para :guilabel:`Turn off Windows Defender Firewall`. Luego haga clic en OK.
tr_tr: Her kategori için, radyo düğmesini :guilabel:`Turn off Windows Defender Firewall` seçin. Ardından OK'e tıklayın.

source: Click :guilabel:`Start` -> :guilabel:`Control Panel` to open the Control Panel. Click the dropdown next to :guilabel:`View by:` and select :guilabel:`Small icons` then click :guilabel:`Windows Defender Firewall`.
es_mx: Haga clic en :guilabel:`Start` -> :guilabel:`Control Panel` para abrir el Panel de control. Haga clic en el menú desplegable junto a :guilabel:`View by:` y seleccione :guilabel:`Small icons` y luego haga clic en :guilabel:`Windows Defender Firewall`.
tr_tr: Kontrol Panelini açmak için :guilabel:`Start` -> :guilabel:`Control Panel` seçeneğine tıklayın. :guilabel:`View by:` yanındaki açılır menüye tıklayın ve :guilabel:`Small icons` seçin ve ardından :guilabel:`Windows Defender Firewall`'a tıklayın.

source: In the left pane, click :guilabel:`Allow a program or feature through Windows Defender Firewall`
es_mx: En el panel izquierdo, haga clic en :guilabel:`Allow a program or feature through Windows Defender Firewall`
tr_tr: Sol bölmede, :guilabel:`Allow a program or feature through Windows Defender Firewall` tıklayın

source: In the left pane, select :guilabel:`Open Windows Security`
tr_tr: Sol bölmede, :guilabel:`Open Windows Security`
