Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/glass/command-based-widgets.po
Languages: tr_tr, zh_cn

source: Widgets for the Command-Based Framework
tr_tr: Komut Tabanlı Çerçeve için Widgetlar
zh_cn: 基于指令的框架小部件

source: Glass also has several widgets that are specific to the :ref:`command-based framework <docs/software/commandbased/index:Command-Based Programming>`. These include widgets to schedule commands, view actively running commands on a specific subsystem, or view the state of the :ref:`command scheduler <docs/software/commandbased/command-scheduler:The Command Scheduler>`.
tr_tr: Glass'ın ayrıca :ref:`command-based framework <docs/software/commandbased/index:Command-Based Programming>` özgü birkaç widget'ı vardır. Bunlar, komutları zamanlamak, belirli bir alt sistemde aktif olarak çalışan komutları görüntülemek veya :ref:`command scheduler <docs/software/commandbased/command-scheduler:The Command Scheduler>`. durumunu görüntülemek için pencere öğelerini içerir.
zh_cn: Glass还具有一些特定于基于命令框架<docs/software/commandbased/index:Command-Based Programming>的小部件。这些工具包括用于计划命令，查看特定子系统上正在运行的命令或查看命令计划程序<docs/software/commandbased/command-scheduler:The Command Scheduler>的状态的小部件。

source: Command Selector Widget
tr_tr: Komut Seçici Widget
zh_cn: 指令选择器小部件

source: The :guilabel:`Command Selector` widget allows you to start and cancel a specific instance of a command (sent over NetworkTables) from Glass. For example, you can create an instance of ``MyCommand`` and send it to SmartDashboard:
tr_tr: :guilabel:`Command Selector` widget'ı, Glass'tan belirli bir komut örneğini (Ağ Tabloları üzerinden gönderilen) başlatmanıza ve iptal etmenize olanak sağlar. Örneğin, bir``MyCommand`` örneği oluşturabilir ve bunu SmartDashboard'a gönderebilirsiniz:
zh_cn: 使用“Command Selector”小部件，可以从Glass启动和取消指令的特定实例（通过NetworkTables发送）。 例如，您可以创建我的指令的实例并将其发送到SmartDashboard：

source: The ``MyCommand`` instance can also be sent using a lower-level NetworkTables API or using the :ref:`Shuffleboard API <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>`. In this case, the ``SmartDashboard`` API was used, meaning that the :guilabel:`Command Selector` widget will appear under the ``SmartDashboard`` table name.
tr_tr: ``MyCommand`` örneği, daha düşük seviyeli bir NetworkTables API kullanılarak veya :ref:`Shuffleboard API <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>` kullanılarak da gönderilebilir. Bu durumda, ``SmartDashboard`` API kullanıldı, yani: :guilabel:`Command Selector` widget will appear under the ``SmartDashboard``tablo adı altında görünecektir.
zh_cn: MyCommand实例也可以使用较低级别的NetworkTables API或使用Shuffleboard API <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>来发送。在这种情况下，使用了SmartDashboard API，这意味着Command Selector小部件将出现在SmartDashboard表名下方。

source: The widget has two states. When the command is not running, a :guilabel:`Run` button will appear -- clicking it will schedule the command. When the command is running, a :guilabel:`Cancel` button, accompanied by :guilabel:`Running...` text, will appear (as shown above). This will cancel the command.
tr_tr: Widget'ın iki durumu vardır. Komut çalışmadığında, bir:guilabel:`Run` düğmesi görünecektir - tıklamak komutu zamanlayacaktır. Komut çalışırken, bir :guilabel:`Cancel` düğmesi ile birlikte :guilabel:`Running...` metni görünecektir (yukarıda gösterildiği gibi). Bu, komutu iptal edecektir.
zh_cn: 小部件具有两种状态。 当指令未运行时，将显示“运行”按钮–单击它将安排指令。 当指令运行时，单击“取消”按钮，伴随正在运行…文本，将出现（如上所示）。 这将取消指令。

source: Subsystem Widget
tr_tr: Alt Sistem Widget'ı
zh_cn: 子系统小部件

source: The :guilabel:`Subsystem` widget can be used to see the default command and the currently scheduled command on a specific subsystem. If you are using the ``SubsystemBase`` base class, your subsystem will be automatically sent to NetworkTables over LiveWindow. To view this widget, look under the :guilabel:`LiveWindow` main table name in the :guilabel:`NetworkTables` menu.
tr_tr: :guilabel:`Subsystem` pencere öğesi, varsayılan komutu ve belirli bir alt sistemde o anda zamanlanmış komutu görmek için kullanılabilir. ``SubsystemBase`` temel sınıfını kullanıyorsanız, alt sisteminiz LiveWindow üzerinden NetworkTables'a otomatik olarak gönderilecektir. Bu parçacığı görüntülemek için :guilabel:`NetworkTables` menüsünde :guilabel:`LiveWindow`ana tablo adının altına bakın.
zh_cn: Subsystem小部件可用于查看特定子系统上的默认命令和当前计划的命令。如果使用的是SubsystemBase基类，则子系统将通过LiveWindow自动发送到NetworkTables。要查看此小部件，请在NetworkTables菜单的LiveWindow主表名称下。

source: Command Scheduler Widget
tr_tr: Komut Zamanlayıcı Widget'ı
zh_cn: 指令调度程序小部件

source: The :guilabel:`Command Scheduler` widget allows you to see all currently scheduled commands. In addition, any of these commands can be canceled from the GUI.
tr_tr: :guilabel:`Command Scheduler` widgeti , şu anda zamanlanmış tüm komutları görmenizi sağlar. Ek olarak, bu komutlardan herhangi biri GUI'den iptal edilebilir.
zh_cn: 使用“指令计划程序”小部件，您可以查看所有当前计划的指令。 此外，可以从GUI取消任何这些命令。

source: The ``CommandScheduler`` instance is automatically sent to NetworkTables over LiveWindow. To view this widget, look under the :guilabel:`LiveWindow` main table name in the :guilabel:`NetworkTables` menu.
tr_tr: ``CommandScheduler`` örneği, LiveWindow üzerinden NetworkTables'a otomatik olarak gönderilir. Bu parçacığı görüntülemek için:guilabel:`NetworkTables` menüsünde:guilabel:`LiveWindow` ana tablo adının altına bakın.
zh_cn: ``CommandScheduler''实例通过LiveWindow自动发送到NetworkTables。要查看此小部件，请在NetworkTables菜单的LiveWindow主表名称下。
