Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/glass/field2d-widget.po
Languages: es_mx, tr_tr, zh_cn

source: The Field2d Widget
es_mx: El widget Field2d
tr_tr: Field2d Widget-Araçları
zh_cn: Field2d小部件

source: Glass supports displaying your robot's position on the field using the :guilabel:`Field2d` widget. An instance of the ``Field2d`` class should be created, sent over NetworkTables, and updated periodically with the latest robot pose in your robot code.
es_mx: Glass permite mostrar la posición de su robot en el campo usando el widget :guilabel:`Field2d`. Debe crearse una instancia de la clase ``Field2d``, enviarse a través de NetworkTables y actualizarse periódicamente con la última pose de robot en su código de robot.
tr_tr: Cam, robotunuzun sahadaki konumunu :guilabel:`Field2d` widget'ını kullanarak görüntülemeyi destekler. ``Field2d`` sınıfının bir örneği oluşturulmalı, NetworkTables üzerinden gönderilmeli ve robot kodunuzdaki en son robot pozuyla periyodik olarak güncellenmelidir.
zh_cn: Glass支持使用Field2d小部件在地面上显示机器人的位置。 一个 应该创建Field2d类的实例，通过NetworkTables发送该实例，并使用机器人代码中的最新机器人姿态对其进行定期更新。

source: Sending Robot Pose from User Code
es_mx: Enviando la pose del robot desde el código de usuario
tr_tr: Kullanıcı Kodundan Robot Duruşu Gönderme
zh_cn: 从用户代码发送机器人姿势

source: To send your robot's position (usually obtained by :ref:`odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>` or a pose estimator), a ``Field2d`` instance must be created in robot code and sent over NetworkTables. The instance must then be updated periodically with the latest robot pose.
es_mx: Para enviar la posición de tu robot (normalmente obtenida por :ref:`odometría <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>` o un estimador de poses), se debe crear una instancia de ``Campo2d`` en código de robot y enviarla a través de NetworkTables. La instancia debe ser actualizada periódicamente con la última pose del robot.
tr_tr: Robotunuzun konumunu göndermek için (genellikle :ref:`odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>` veya bir poz tahmincisi tarafından elde edilir), robot kodunda bir ``Field2d`` örneği oluşturulmalı ve NetworkTables üzerinden gönderilmelidir. Örnek daha sonra en son robot pozuyla periyodik olarak güncellenmelidir.
zh_cn: 要发送机器人的位置（通常由odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>或姿势估算器获取），必须在机器人代码中创建“ Field2d”实例并通过NetworkTables发送。然后必须使用最新的机器人姿态定期更新实例。

source: The ``Field2d`` instance can also be sent using a lower-level NetworkTables API or using the :ref:`Shuffleboard API <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>`. In this case, the ``SmartDashboard`` API was used, meaning that the :guilabel:`Field2d` widget will appear under the ``SmartDashboard`` table name.
es_mx: La instancia de ``Field2d`` también se puede enviar usando una API NetworkTables de nivel inferior o usando :ref:`API de Shuffleboard <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>`. En este caso, se utilizó la API ``SmartDashboard``, lo que significa que el widget :guilabel:`Field2d` aparecerá debajo del nombre de la tabla ``SmartDashboard``.
tr_tr: ``Field2d`` örneği, daha düşük seviyeli bir NetworkTables API kullanılarak veya :ref:`Shuffleboard API <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>` kullanılarak da gönderilebilir. Bu durumda, ``SmartDashboard`` API kullanıldı, yani :guilabel:`Field2d` widget'ı ``SmartDashboard`` tablo adı altında görünecektir.
zh_cn: 也可以使用较低级别的NetworkTables API或使用Shuffleboard API <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>来发送Field2d实例。在这种情况下，使用了SmartDashboard API，这意味着Field2d小部件将出现在SmartDashboard表名称下。

source: Viewing the Robot Pose in Glass
es_mx: Ver la postura del robot en glass
tr_tr: Robot duruşunu Glass çalışma alanında görüntüleme
zh_cn: 在Glass中查看机器人姿势

source: After sending the ``Field2d`` instance over NetworkTables, the :guilabel:`Field2d` widget can be added to Glass by selecting :guilabel:`NetworkTables` in the menu bar, choosing the table name that the instance was sent over, and then clicking on the :guilabel:`Field` button.
es_mx: Después de enviar la instancia ``Field2d`` a través de NetworkTables, el widget :guilabel:`Field2d` se puede agregar a Glass seleccionando :guilabel:`NetworkTables` en la barra de menú, eligiendo el nombre de la tabla a la que se envió la instancia, y luego haciendo clic en el botón :guilabel:`Campo`.
tr_tr: ``Field2d`` örneğini NetworkTables üzerinden gönderdikten sonra, menü çubuğunda: guilabel: `NetworkTables` seçilerek, örneğin gönderildiği tablo adı seçilerek : guilabel:` Field2d` widget'ı Glass'a eklenebilir ve ardından :guilabel:`Field` düğmesine tıklayın.
zh_cn: 通过NetworkTables发送Field2d实例后，可以通过在菜单栏中选择NetworkTables并选择发送实例的表名，将Field2d小部件添加到Glass中。然后点击“字段”按钮。

source: Once the widget appears, you can resize and place it on the Glass workspace as you desire. Right-clicking the top of the widget will allow you to customize the name of the widget, select a custom field image, select a custom robot image, and choose the dimensions of the field and robot.
es_mx: Una vez que aparece el widget, puede cambiar su tamaño y colocarlo en el espacio de trabajo de Glass como desee. Al hacer clic con el botón derecho en la parte superior del widget, podrá personalizar el nombre del widget, seleccionar una imagen de campo personalizada, seleccionar una imagen de robot personalizada y elegir las dimensiones del campo y el robot.
tr_tr: Widget göründüğünde, onu yeniden boyutlandırabilir ve istediğiniz gibi Glass çalışma alanına yerleştirebilirsiniz. Widget'ın üst kısmına sağ tıklamak, widget'ın adını özelleştirmenize, özel bir alan görüntüsü seçmenize, özel bir robot görüntüsü seçmenize ve alan ile robotun boyutlarını seçmenize olanak tanır.
zh_cn: 窗口小部件出现后，您可以根据需要调整其大小并将其放置在Glass工作区中。右键单击窗口小部件的顶部，将允许您自定义窗口小部件的名称，选择自定义字段图像，选择自定义机器人图像以及选择字段和机器人的尺寸。

source: When selecting :guilabel:`Choose image...` you can choose to either select an image file or a PathWeaver JSON file as long as the image file is in the same directory. Choosing the JSON file will automatically import the correct location of the field in the image and the correct size of the field.
es_mx: Al seleccionar :guilabel:`Choose image...` puede elegir entre seleccionar un archivo de imagen o un archivo JSON de PathWeaver siempre que el archivo de imagen esté en el mismo directorio. La elección del archivo JSON importará automáticamente la ubicación correcta del campo en la imagen y el tamaño correcto del campo.
tr_tr: Seçerken :guilabel:`Choose image...` resim dosyası aynı dizinde olduğu sürece bir resim dosyası veya bir PathWeaver JSON dosyası seçmeyi seçebilirsiniz. JSON dosyasının seçilmesi, görüntüdeki alanın doğru konumunu ve alanın doğru boyutunu otomatik olarak içe aktaracaktır.
zh_cn: 选择“选择图像...”时，只要图像文件位于同一目录中，就可以选择选择图像文件还是PathWeaver JSON文件。选择JSON文件将自动导入图像中字段的正确位置和字段的正确大小。

source: You can retrieve the latest field image and JSON files from `here <https://github.com/wpilibsuite/PathWeaver/tree/main/src/main/resources/edu/wpi/first/pathweaver>`__. This is the same image and JSON that are used when generating paths using :ref:`PathWeaver <docs/software/wpilib-tools/pathweaver/introduction:Introduction to PathWeaver>`.
es_mx: Puede recuperar la imagen de campo más reciente y los archivos JSON desde `here <https://github.com/wpilibsuite/PathWeaver/tree/main/src/main/resources/edu/wpi/first/pathweaver>`__. Esta es la misma imagen y JSON que se usan al generar rutas usando :ref:`PathWeaver <docs/software/wpilib-tools/pathweaver/introduction:Introduction to PathWeaver>`.
tr_tr: En son saha görüntüsünü ve JSON dosyalarını buradan alabilirsiniz `here <https://github.com/wpilibsuite/PathWeaver/tree/main/src/main/resources/edu/wpi/first/pathweaver>`__. Bu, şunu kullanarak yollar oluştururken kullanılan aynı görüntü ve JSON'dur : ref: `PathWeaver <docs/software/wpilib-tools/pathweaver/introduction:Introduction to PathWeaver>`.
zh_cn: 您可以从“此处<https://github.com/wpilibsuite/PathWeaver/tree/main/src/main/resources/edu/wpi/first/pathweaver>” __中检索最新的字段图像和JSON文件。这是使用PathWeaver <docs/software/wpilib-tools/pathweaver/introduction:Introduction to PathWeaver>生成路径时使用的图像和JSON。
