Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/glass/introduction.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Introduction to Glass
es_mx: Introducción a Glass
fr_ca: Introduction à Glass
tr_tr: Glass Giriş
zh_cn: 对于Glass的介绍

source: Glass is a new dashboard and robot data visualization tool. It supports many of the same :ref:`widgets <docs/software/wpilib-tools/robot-simulation/simulation-gui:Learning the Layout>` that the Simulation GUI supports, including robot pose visualization and advanced plotting. In its current state, it is meant to be used as a programmer's tool for debugging and not as a dashboard for competition use.
es_mx: Glass es un nuevo dashboard y herramienta de visualización de datos del robot. Es compatible con muchos de los mismos :ref:`widgets <docs/software/wpilib-tools/robot-simulation/simulation-gui:Learning the Layout>` que admite la Simulación GUI, incluyendo visualización de pose de robot y trazado avanzado. En su estado actual, está destinado a ser utilizado como una herramienta de programación para la depuración y no como un dashboard para uso en competencia.
fr_ca: Glass est un nouvel outil de visualisation de données de tableau de bord et de robot. Il prend en charge plusieurs des mêmes :ref:`widgets <docs/software/wpilib-tools/robot-simulation/simulation-gui:Learning the Layout>` que l'interface graphique de simulation prend en charge, y compris la visualisation de pose de robot et le traçage avancé. Dans son état actuel, il est destiné à être utilisé comme un outil de débogage du programmeur et non comme un tableau de bord pour une utilisation en compétition.
tr_tr: Glass, yeni bir kontrol paneli ve robot veri görselleştirme aracıdır. Robot poz görselleştirme ve gelişmiş çizim de dahil olmak üzere Simülasyon GUI'nin desteklediği ref: `widgets <docs/ oftware pilib-tools obot-simülasyon/ simülasyon-gui: Learning the Layout>` ın çoğunu destekler. Mevcut durumunda, rekabet kullanımı için bir gösterge tablosu olarak değil, hata ayıklama için bir programcının aracı olarak kullanılması amaçlanmıştır.
zh_cn: Glass是一种新的仪表板和机器人数据可视化工具。它支持Simulation GUI支持的许多相同的小部件<docs/software/wpilib-tools/robot-simulation/simulation-gui:Learning the Layout>，包括机器人姿势可视化和高级绘图。在当前状态下，它打算用作编程人员的调试工具，而不是用作比赛使用的仪表板。

source: Opening Glass
es_mx: Apertura a Glass
fr_ca: Lancement de Glass
tr_tr: Glass Açılış
zh_cn: 启动Glass

source: Glass can be launched by selecting the ellipsis menu (:guilabel:`...`) in VS Code, clicking on :guilabel:`Start Tool` and then choosing :guilabel:`Glass`.
es_mx: Glass se puede iniciar seleccionando el menú de puntos suspensivos (:guilabel:`...`) en el código Visual Studio, haciendo clic en :guilabel:`Start Tool` y luego seleccionando :guilabel:`Glass`.
fr_ca: Glass peut être lancé en sélectionnant le menu points de suspension (:guilabel:`...`) dans VS Code, en cliquant sur :guilabel:`Start Tool` puis en choisissant :guilabel:`Glass`.
tr_tr: Glass, VS Code'da üç nokta menüsü (: guilabel: `...`) seçilerek, :guilabel:`Start Tool` tıklanarak ve ardından :guilabel:`Glass` seçilerek başlatılabilir.
zh_cn: 通过在VS Code中选择省略号菜单（：guilabel：`...`），单击“启动工具”，然后选择“ Glass”，可以启动Glass。

source: You can also launch Glass directly by navigating to ``~/wpilib/YYYY/tools`` and running ``Glass.py`` (Linux and macOS) or by using the desktop shortcut (Windows).
es_mx: De igual manera puede iniciar Glass directamente navegando a ``~/wpilib/YYYY/tools`` y corriendo ``Glass.py`` (Linux y macOS) o usando el acceso directo del escritorio (Windows).
fr_ca: Vous pouvez également lancer Glass directement en accédant à ``~/wpilib/YYYY/tools`` et en exécutant ``Glass.py`` (Linux et macOS) ou en utilisant le raccourci du bureau (Windows).
tr_tr: Glass'ı doğrudan ``~/wpilib/YYYY/tools`` adresine gidip ``Glass.py`` (Linux ve macOS) çalıştırarak veya masaüstü kısayolunu (Windows) kullanarak da başlatabilirsiniz.
zh_cn: 您也可以通过导航到〜/ wpilib / YYYY / tools并运行``Glass.py''（Linux和macOS）或使用桌面快捷方式（Windows）直接启动Glass。

source: Changing View Settings
es_mx: Cambiar la configuración de la vista
fr_ca: Modification des paramètres d'affichage
tr_tr: Görünüm Ayarlarını Değiştirme
zh_cn: 更改视图设置

source: The :guilabel:`View` menu item contains :guilabel:`Zoom` and :guilabel:`Style` settings that can be customized. The :guilabel:`Zoom` option dictates the size of the text in the application whereas the :guilabel:`Style` option allows you to select between the ``Classic``, ``Light``, and ``Dark`` modes.
es_mx: El elemento :guilabel:`View` del menú contiene configuraciones de :guilabel:`Zoom` y :guilabel:`Style` que se pueden personalizar. La opción de :guilabel:`Zoom` dicta el tamaño del texto en la aplicación mientras que la opción de :guilabel:`Style` le permite seleccionar entre los modos ``Clásico``, ``Claro``, y ``Oscuro``.
fr_ca: L'élément de menu :guilabel:`View` contient les réglages :guilabel:`Zoom` et :guilabel:`Style`: qui peuvent être personnalisés. L'option :guilabel:`Zoom` dicte la taille du texte dans l'application tandis que l'option :guilabel:`Style` vous permet de choisir entre les options ``Classic``, ``Light``, et ``Dark``.
tr_tr: :guilabel:`View` menü öğesi şunları içerir :guilabel:`Zoom` ve :guilabel:`Style` özelleştirilebilir ayarları. :guilabel:`Zoom` seçeneği, uygulamadaki metnin boyutunu belirler, oysa :guilabel:`Style` seçeneği, ``Classic``, ``Light`` ve ``Dark`` modlar arasında seçim yapmanızı sağlar .
zh_cn: 视图菜单项包含可自定义的缩放设置和样式设置。 ：guilabel：`Zoom`选项决定了应用程序中文本的大小，而：guilabel：`Style`选项则允许您在“ Classic”，“ Light”和“ Dark”之间进行选择。模式。

source: An example of the ``Dark`` style setting is below:
es_mx: Un ejemplo sobre la configuración en estilo ``Oscuro`` esta abajo:
fr_ca: Un exemple du paramètre de style ``Dark`` est ci-dessous:
tr_tr: ``Dark`` stil ayarının bir örneği aşağıdadır:
zh_cn: 深色样式设置的例子如下：

source: In Glass v2021.2.1 and below, the default zoom setting of 100% may cause text to appear too big on certain macOS Retina displays. Please reduce the zoom level to 75% or 50% or upgrade to v2021.2.2 or later to mitigate this issue.
es_mx: En Glass v2021.2.1 y posteriores, el ajuste de zoom por defecto del 100% puede hacer que el texto aparezca demasiado grande en algunas pantallas Retina de macOS. Reduzca el nivel de zoom al 75% o al 50% o actualice a la versión 2021.2.2 o posterior para disminuir este problema.
fr_ca: Dans Glass v2021.2.1 et ci-dessous, le paramètre de zoom par défaut de 100% peut faire apparaître le texte trop grossi sur certains écrans macOS Retina. Veuillez réduire le niveau de zoom à 75% ou 50% pour atténuer ce problème.
tr_tr: Glass v2021.2.1 ve altındaki% 100'lük varsayılan yakınlaştırma ayarı, metnin bazı macOS Retina ekranlarında çok büyük görünmesine neden olabilir. Bu sorunu hafifletmek için lütfen yakınlaştırma düzeyini % 75 veya % 50' ye düşürün veya v2021.2.2 veya sonraki bir sürüme yükseltin.
zh_cn: 在Glass v2021.2.1及更低版本中，默认缩放设置为100％可能导致文本在某些macOS Retina显示器上显得太大。请将缩放级别降低到75％或50％，或升级到v2021.2.2或更高版本以缓解此问题。

source: Clearing Application Data
es_mx: Borrar datos de la aplicación
fr_ca: Effacement des données d'application
tr_tr: Uygulama Verilerini Temizleme
zh_cn: 清除申请数据

source: Application data for Glass, including widget sizes and positions as well as other custom information for widgets is stored in a ``glass.ini`` file. The location of this file varies based on your operating system:
es_mx: Los datos de la aplicación para Glass, incluidos los tamaños y posiciones de los widgets, así como otra información personalizada para los widgets, se almacenan en un archivo ``glass.ini``. La ubicación de este archivo varía según su sistema operativo:
fr_ca: Les données d'application pour Glass, y compris la taille et la position des widgets ainsi que d'autres informations personnalisées pour les widgets, sont stockées dans un fichier ``glass.ini``. L'emplacement de ce fichier varie en fonction de votre système d'exploitation:
tr_tr: Widget boyutları ve konumları ile widget'lar için diğer özel bilgiler dahil Glass için uygulama verileri bir ``glass.ini`` dosyasında saklanır. Bu dosyanın konumu işletim sisteminize göre değişir:
zh_cn: Glass的应用程序数据（包括小部件尺寸和位置以及小部件的其他自定义信息）存储在“ glass.ini”文件中。该文件的位置因您的操作系统而异：

source: On Windows, the configuration file is located in ``%APPDATA%``.
es_mx: En Windows, la configuración del archivo se encuentra en ``%APPDATA%``.
fr_ca: Sous Windows, le fichier de configuration se trouve dans ``%APPDATA%``.
tr_tr: Windows'ta, yapılandırma dosyası ``%APPDATA%`` içinde bulunur.
zh_cn: 在Windows上，配置文件位于％APPDATA％中。

source: On macOS, the configuration file is located in ``~/Library/Preferences``.
es_mx: En macOS, la configuración del archivo se encuentra en ``~/Library/Preferences``.
fr_ca: Sous macOS, le fichier de configuration se trouve dans ``~/Library/Preferences``.
tr_tr: MacOS'ta, konfigürasyon dosyası ``~/Library/Preferences``. içinde bulunur.
zh_cn: 在macOS上，配置文件位于〜/ Library / Preferences中。

source: On Linux, the configuration file is located in ``$XDG_CONFIG_HOME`` or ``~/.config`` if the former does not exist.
es_mx: En Linux, la configuración del archivo se encuentra en ``$XDG_CONFIG_HOME`` o ``~/.config`` si la primera no existe.
fr_ca: Sous Linux, le fichier de configuration se trouve dans ``$XDG_CONFIG_HOME`` ou ``~/.config`` si le premier n'existe pas.
tr_tr: Linux'ta, yapılandırma dosyası ``$XDG_CONFIG_HOME`` veya eski yoksa ``~/.config`` içinde bulunur.
zh_cn: 在Linux上，配置文件位于$ XDG_CONFIG_HOME或〜/ .config中，如果前者不存在。

source: The ``glass.ini`` configuration file can simply be deleted to restore Glass to a "clean slate".
es_mx: El archivo de configuración `` glass.ini`` simplemente se puede eliminar para restaurar Glass a una "pizarra limpia".
fr_ca: Le fichier de configuration ``glass.ini`` peut simplement être supprimé pour restaurer Glass à son état initial.
tr_tr: ``glass.ini`` yapılandırma dosyası, glass'ı "clean slate" e geri yüklemek için basitçe silinebilir.
zh_cn: 只需删除glass.ini配置文件，即可将Glass恢复为“干净的状态”
