Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/glass/widgets.po
Languages: tr_tr, zh_cn

source: Glass Widgets
tr_tr: Glass Widget'lar
zh_cn: Glass 小部件

source: Specialized widgets are available for certain types that exist in robot code. These include objects that are manually sent over NetworkTables such as ``SendableChooser`` instances, or hardware that is automatically sent over :ref:`LiveWindow <docs/software/wpilib-tools/smartdashboard/test-mode-and-live-window/displaying-LiveWindow-values:Displaying LiveWindow Values>`.
tr_tr: Robot kodunda bulunan belirli türler için özel aletler mevcuttur. Bunlar, ``SendableChooser`` örnekleri gibi NetworkTables üzerinden manuel olarak gönderilen nesneleri veya otomatik olarak gönderilen donanımı içerir :ref: `LiveWindow <docs/software/wpilib-tools/smartdashboard/test-mode-and-live-window/displaying-LiveWindow-values:Displaying LiveWindow Values>`.
zh_cn: 专用窗口小部件可用于机器人代码中存在的某些类型。这些对象包括通过NetworkTables手动发送的对象（例如“ SendableChooser”实例），或通过LiveWindow自动发送的硬件。

source: Widget support in Glass is still in its infancy -- therefore, there are only a handful of widgets available. This list will grow as development work continues.
tr_tr: Glass'ta widget desteği henüz başlangıç aşamasındadır - bu nedenle, yalnızca birkaç widget mevcuttur. Geliştirme çalışmaları devam ettikçe bu liste büyüyecek.
zh_cn: Glass中的窗口小部件支持仍处于起步阶段–因此，只有少数窗口小部件可用。 随着开发工作的继续，这个清单将会增加。

source: A widget can be renamed by right-clicking on its header and specifying a new name.
tr_tr: Bir widget, başlığına sağ tıklanarak ve yeni bir ad belirtilerek yeniden adlandırılabilir.
zh_cn: 可以通过右键单击小部件的标题并指定新名称来重命名小部件。

source: Hardware Widgets
tr_tr: Donanım Widget'ları
zh_cn: 硬件小部件

source: Widgets for specific hardware (such as motor controllers) are usually available via LiveWindow. These can be accessed by selecting the :guilabel:`NetworkTables` menu option, clicking on :guilabel:`LiveWindow` and choosing the desired widget.
tr_tr: Belirli donanımlar için araçlar (motor denetleyicileri gibi) genellikle LiveWindow aracılığıyla kullanılabilir. Bunlara: :guilabel: `NetworkTables` menü seçeneği seçilerek, :guilabel:` LiveWindow'a tıklanarak ve istenen pencere öğesi seçilerek erişilebilir.
zh_cn: 通常可以通过LiveWindow获得用于特定硬件（例如电动机控制器）的小部件。 这些可以通过选择NetworkTables菜单选项，然后单击 LiveWindow并选择所需的小部件。

source: The list of hardware (sent over LiveWindow automatically) that has widgets is below:
tr_tr: Widget'lara sahip donanımların listesi (otomatik olarak LiveWindow üzerinden gönderilir) aşağıdadır:
zh_cn: 带有小部件的硬件列表（自动通过LiveWindow发送）如下：

source: ``DigitalInput``
zh_cn: 数字输入

source: ``DigitalOutput``
zh_cn: 数字输出

source: ``SpeedController``
tr_tr: ``SpeedController-Hız kontrol devresi``
zh_cn: 速度控制器

source: ``Gyro``
zh_cn: 陀螺仪

source: Here is an example of the widget for gyroscopes:
tr_tr: İşte jiroskoplar için bir widget örneği:
zh_cn: 这是陀螺仪小部件的示例：

source: Sendable Chooser Widget
tr_tr: Gönderilebilir Seçici Widget'ı
zh_cn: Sendable Chooser小部件

source: The :guilabel:`Sendable Chooser` widget represents a ``SendableChooser`` instance from robot code. It is often used to select autonomous modes. Like other dashboards, your ``SendableChooser`` instance simply needs to be sent using a NetworkTables API. The simplest is to use something like ``SmartDashboard``:
tr_tr: :guilabel:`Sendable Chooser` widget'ı, robot kodundan bir ``SendableChooser`` örneğini temsil eder. Genellikle otonom modları seçmek için kullanılır. Diğer kontrol panelleri gibi, ``SendableChooser`` örneğinizin bir NetworkTables API kullanılarak gönderilmesi gerekir. En basit olanı ``SmartDashboard``: gibi bir şey kullanmaktır:
zh_cn: Sendable Chooser小部件代表机器人代码中的SendableChooser实例。 它通常用于选择自动阶段。 与其他仪表板一样，您的SendableChooser实例仅需要使用NetworkTables API发送。 最简单的方法是使用SmartDashboard之类的东西：

source: For more information on creating a ``SendableChooser``, please see :ref:`this document <docs/software/wpilib-tools/smartdashboard/choosing-an-autonomous-program-from-smartdashboard:Setting up SendableChooser>`.
tr_tr: Bir ``SendableChooser``oluşturma hakkında daha fazla bilgi için lütfen bakınız :ref:`this document <docs/software/wpilib-tools/smartdashboard/choosing-an-autonomous-program-from-smartdashboard:Setting up SendableChooser>`.
zh_cn: 关创建SendableChooser的更多信息，请参阅此文档P509。

source: The :guilabel:`Sendable Chooser` widget will appear in the :guilabel:`NetworkTables` menu and underneath the main table name that the instance was sent over. From the example above, the main table name would be :guilabel:`SmartDashboard`.
tr_tr: :guilabel:`Sendable Chooser` widget'ı :guilabel:`NetworkTables` menüsünde ve örneğin gönderildiği ana tablo adının altında görünecektir. Yukarıdaki örnekten, ana tablo adı :guilabel:`SmartDashboard` olacaktır.
zh_cn: Sendable Chooser小部件将出现在NetworkTables菜单中，并在实例发送到的主表名称下方。 在上面的示例中，主表名称将为SmartDashboard。

source: PID Controller Widget
tr_tr: PID Denetleyici Widget'ı
zh_cn: PID控制器小部件

source: The :guilabel:`PID Controller` widget allows you to quickly tune PID values for a certain controller. A ``PIDController`` instance must be sent using a NetworkTables API. The simplest is to use something like ``SmartDashboard``:
tr_tr: :guilabel: `PID Controller` pencere öğesi, belirli bir kontrolör için PID değerlerini hızlı bir şekilde ayarlamanıza olanak tanır. NetworkTables API kullanılarak bir ``PIDController`` örneği gönderilmelidir. En basit olanı `` SmartDashboard '' gibi bir şey kullanmaktır:
zh_cn: PID控制器小部件可让您快速调整特定控制器的PID值。 必须使用NetworkTables API发送PIDController实例。 最简单的方法是使用SmartDashboard之类的东西：

source: This allows you to quickly tune P, I, and D values for various setpoints.
tr_tr: Bu, çeşitli ayar noktaları için P, I ve D değerlerini hızlı bir şekilde ayarlamanıza olanak tanır.
zh_cn: 这使您可以快速调整各种设定的P，I和D值。

source: FMSInfo Widget
zh_cn: FMSInfo 小部件

source: The :guilabel:`FMSInfo` widget is created by default when Glass connects to a robot. This widget displays basic information about the robot's enabled state, whether a Driver Station is connected, whether an FMS is connected, the game-specific data, etc. It can be viewed by selecting the :guilabel:`NetworkTables` menu item and clicking on :guilabel:`FMSInfo`.
tr_tr: Glass bir robota bağlandığında :guilabel:`FMSInfo` widget'ı varsayılan olarak oluşturulur. Bu pencere öğesi, bir Driver Station bağlı olup olmadığı, bir FMS'nin bağlı olup olmadığı, oyuna özel veriler, vb. Gibi robotun etkin durumu hakkında temel bilgileri görüntüler. :guilabel: `NetworkTables` menü öğesini seçip :guilabel:`FMSInfo` seçeneğine tıklayarak görüntülenebilir.
zh_cn: 当Glass连接到机器人时，默认情况下会创建FMSInfo小部件。 该小部件显示有关机器人的启用状态，是否连接了Driver Station，是否连接了FMS，特定游戏数据等基本信息。可以通过选择NetworkTables菜单项并单击FMSInfo来查看它。
