Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/accelerometers-hardware.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Accelerometers - Hardware
es_mx: Acelerómetros - Hardware
fr_ca: Accéléromètres
tr_tr: İvmeölçerler - Donanım
zh_cn: 加速度计 - 硬件

source: Accelerometers are common sensors used to measure acceleration.
es_mx: Estos sensores son comúnmente usados para medir la aceleración.
fr_ca: Les accéléromètres sont des capteurs courants utilisés pour mesurer l'accélération.
tr_tr: İvmeölçerler, ivmeyi ölçmek için kullanılan yaygın sensörlerdir.
zh_cn: 加速度传感器是常用于测量机器人运动的加速度。

source: In principle, precise measurements of acceleration can be double-integrated and used to track position (similarly to how the measurement of turn rate from a gyroscope can be integrated to determine heading) - however, in practice, accelerometers that are available within the legal FRC\ |reg| price range are not nearly accurate for this use. However, accelerometers are still useful for a number of tasks in FRC.
fr_ca: En principe, des mesures précises de l’accélération peuvent être intégrées deux fois de suite et utilisées pour suivre la position (de la même manière que la mesure du taux de rotation à partir d’un gyroscope peut être intégrée pour déterminer le cap) - cependant, dans la pratique, les accéléromètres qui sont disponibles dans gamme de prix légale autorisée en FRC\ |reg| ne sont quasiment pas précis pour cet usage. Toutefois, les accéléromètres sont toujours utiles pour un certain nombre de tâches en FRC.
tr_tr: Prensip olarak, hassas ivme ölçümleri çift-entegre olabilir ve konumu izlemek için kullanılabilir (bir denge çarkının dönüş hızı ölçümünün istikameti belirlemek için nasıl entegre edilebileceğine benzer şekilde) - ancak pratikte yasal FRC'de bulunan ivmeölçerlerin fiyat aralığı bu kullanım için neredeyse doğru değildir. Bununla birlikte, ivmeölçerler, FRC'deki bir dizi görev için hala yararlıdır.
zh_cn: 原则上，精确的测量加速度读数可以通过二重计分得到位置信息（这与二重积分从陀螺仪传感器测量的角速度变化率获取角度朝向信息十分类似）- 然而实际上可用于FRC\ |reg|比赛的加速度传感器的测量精度还是远远不足以估算位置的。尽管如此，加速度计依然在FRC比赛中有着十分大的用处。

source: The roboRIO comes with a :ref:`built-in three-axis accelerometer <docs/software/hardware-apis/sensors/accelerometers-software:BuiltInAccelerometer>` that all teams can use, however teams seeking more-precise measurements may purchase and use a peripheral accelerometer, as well.
fr_ca: Le roboRIO contient un :ref:`accéléromètre à trois axes intégré <docs/software/hardware-apis/sensors/accelerometers-software:BuiltInAccelerometer>` que toutes les équipes peuvent utiliser, mais les équipes qui recherchent des mesures plus précises peuvent acheter et utilisez également un accéléromètre périphérique.

source: Types of accelerometers
es_mx: Tipos de acelerómetros
fr_ca: Types d'accéléromètres
tr_tr: İvme ölçer türleri
zh_cn: 加速度计的种类

source: There are three types of accelerometers commonly-used in FRC: single-axis accelerometers, multi-axis accelerometers, and IMUs.
es_mx: Existen 3 tipos de acelerómetros comúnmente usados en FRC: acelerómetros de eje simple, acelerómetros de eje múltiple e IMUs.
fr_ca: Il existe trois types d'accéléromètres couramment utilisés en FRC: les accéléromètres à axe unique, les accéléromètres à axes multiples et les IMU.
tr_tr: FRC'de yaygın olarak kullanılan üç tür ivmeölçer vardır: tek eksenli ivmeölçerler, çok eksenli ivmeölçerler ve IMU'lar.
zh_cn: FRC中有以下三种常见的加速度计：单轴加速计，多轴加速度计和IMU惯性测量单元。

source: Single-axis accelerometers
es_mx: Acelerómetros de eje simple
fr_ca: Accéléromètres à axe unique
tr_tr: Tek eksenli-single axis ivmeölçerler
zh_cn: 单轴加速度计

source: The three wire connection from the Accelerometer to the Analog In port of the roboRIO.
fr_ca: La connexion à trois fils de l’accéléromètre au port Analog In du roboRIO.

source: As per their name, single-axis accelerometers measure acceleration along a single axis. This axis is generally specified on the physical device, and mounting the device in the proper orientation so that the desired axis is measured is highly important. Single-axis accelerometers generally output an analog voltage corresponding to the measured acceleration, and so connect to the roboRIO's :doc:`analog input <analog-inputs-hardware>` ports.
es_mx: Como lo dice su nombre estos acelerómetros pueden medir la aceleración a lo largo de ese simple eje. Estos ejes son generalmente especificados en los dispositivos físicos, y montar el dispositivo de manera apropiada para que el eje del dispositivo sea medido es muy importante. Estos acelerómetros generalmente sacan un voltaje análogo que corresponde a la medición de la aceleración, para que este sea conectado al puerto de entrada análoga en la roboRIO. Ver :doc:`analog input <analog-inputs-hardware>`.
fr_ca: Comme leur nom l'indique, les accéléromètres à axe unique mesurent l'accélération le long d'un axe unique. Cet axe est généralement spécifié sur l'appareil physique, et le montage de l'appareil dans la bonne orientation est primordial. afin que l'axe souhaité soit mesuré convenablement. Les accéléromètres à axe unique produisent généralement une tension analogique correspondant à l'accélération mesurée, et se connectent donc aux :doc:`ports d'entrée analogiques<analog-inputs-hardware>` du roboRIO.
tr_tr: Adlarına göre, tek eksenli ivmeölçerler, tek bir eksen boyunca ivmeyi ölçer. Bu eksen genellikle fiziksel cihaz üzerinde belirtilir ve istenen eksenin ölçülebilmesi için cihazın uygun yönde monte edilmesi oldukça önemlidir. Tek eksenli ivmeölçerler genellikle ölçülen ivmeye karşılık gelen bir analog voltaj üretir ve bu nedenle roboRIO'nun :doc:`analog giriş<analog-inputs-hardware>` bağlantı noktalarına bağlanır.
zh_cn: 根据他们的名字，单轴加速计测量的沿一个轴向上的加速度读数。该轴通常是由机械结构的设计决定，并且以正确的方向安装该加速度，以测量加速度读数在该轴向上的读数十分重要。单轴加速度计通常输出与加速度读数正相关的模拟电压信号，因此应当连接到roboRIO的模拟输入端口<analog-inputs-hardware>。

source: Multi-axis accelerometers
es_mx: Aceletrómetros de eje múltiple
fr_ca: Accéléromètres multi-axes
tr_tr: Çok eksenli-multi axis ivmeölçerler
zh_cn: 多轴加速度计

source: The triple axis accelerometer hooked up to three different Analog In channels.
fr_ca: L’accéléromètre à trois axes raccordé à trois canaux analogiques différents.

source: Multi-axis accelerometers measure acceleration along multiple spacial axes. The roboRIO's built-in accelerometer is a three-axis accelerometer.
es_mx: Estos acelerómetros miden la aceleración a lo largo de los múltiple ejes espaciales. El acelerómetro ya integrado en la roboRIO es unos de 3 ejes.
fr_ca: Les accéléromètres multi-axes mesurent l'accélération le long de plusieurs axes spatiaux. L'accéléromètre intégré du roboRIO est un accéléromètre à trois axes.
tr_tr: Çok eksenli ivmeölçerler, birden çok uzaysal eksen boyunca ivmeyi ölçer. RoboRIO'nun yerleşik ivmeölçeri, üç eksenli bir ivmeölçerdir.
zh_cn: 多轴加速度计可测量三维空间中多个轴向的加速度。 roboRIO的内置加速度计是一个三轴加速度计。

source: Peripheral multi-axis accelerometers may simply output multiple analog voltages (and thus connect to the :ref:`analog input ports <docs/hardware/sensors/analog-inputs-hardware:Connecting a sensor to multiple analog input ports>`, or (more commonly) they may communicate with one of the roboRIO's :doc:`serial buses <serial-buses>`.
es_mx: Los acelerómetros periféricos de eje múltiple pueden sacar múltiple voltajes análogos ( y así ser conectados al puerto de entrada análoga, ver :ref:`analog input ports <docs/hardware/sensors/analog-inputs-hardware:Connecting a sensor to multiple analog input ports>`, o (comúnmente) pueden comunicarse con uno de los serial buses de la roboRIO :doc:`serial buses <serial-buses>`.
fr_ca: Les accéléromètres multi-axes peuvent simplement produire plusieurs tensions analogiques (et donc se connecter à plusieurs :ref:`ports d'entrée analogiques <docs/hardware/sensors/analog-inputs-hardware:Connecting a sensor to multiple analog input ports>`, ou ( plus communément) ils peuvent communiquer de façon sérielle avec l'un des :doc:`bus série<serial-buses>` du roboRIO.
tr_tr: Dış çok eksenli ivmeölçerler, basitçe birden çok analog voltaj çıkışı sağlayabilir (ve bu nedenle şu bağlantılara bağlanabilir :ref:`analog giriş portları <docs/hardware/sensors/analog-inputs-hardware:Connecting a sensor to multiple analog input ports>` veya ( daha yaygın olarak) roboRIO'nun seri haberleşme portlarından biriyle iletişim kurabilirler :doc:`seri veriyolları<serial-buses>`.
zh_cn: 外围多轴加速度计可以简单地输出多个模拟电压（从而连接到模拟输入端口<docs/hardware/sensors/analog-inputs-hardware:Connecting a sensor to multiple analog input ports>，或者（更常见的是）它们可以与roboRIO的串行总线<serial-buses>之一通信。

source: roboRIO built-in accelerometer
es_mx: Acelerómetro integrado en la roboRIO.
fr_ca: L'accéléromètre intégré du roboRIO
tr_tr: roboRIO yerleşik ivme ölçer
zh_cn: roboRIO板载加速度计

source: The details of this accelerometer are printed on the roboRIO to the right of the NI logo.
fr_ca: Les détails de cet accéléromètre sont imprimés sur le roboRIO à droite du logo NI.

source: The roboRIO has a built-in accelerometer, which does not need any external connections. You can find more details about how to use it in the :ref:`Built-in Accelerometer section <docs/software/hardware-apis/sensors/accelerometers-software:BuiltInAccelerometer>` of the software documentation.
fr_ca: Le roboRIO dispose d'un accéléromètre intégré, qui ne nécessite aucune connexion externe. Vous pouvez trouver plus de détails sur son utilisation dans la :ref:`section Accéléromètre intégré <docs/software/hardware-apis/sensors/accelerometers-software:BuiltInAccelerometer>` de la documentation du logiciel.

source: IMUs (Inertial Measurement Units)
es_mx: IMUs (Unidades de medida inercial, por sus siglas en inglés)
fr_ca: IMU (unités de mesure inertielle)
tr_tr: IMU'lar (Atalet Ölçüm Cihazları)
zh_cn: IMU（惯性测量单元）

source: Show the NavX plugged in to the MXP port on the roboRIO.
fr_ca: Affichez le NavX branché sur le port MXP sur le roboRIO.

source: Several popular FRC devices (known as "inertial measurement units," or "IMUs") combine both an accelerometer and a gyroscope. Popular FRC example include:
es_mx: Varios de los más populares dispositivos de FRC (conocidos como IMUs) que combinan acelerómetros y giroscopios son:
fr_ca: Plusieurs dispositifs FRC populaires (appelés «unités de mesure inertielles» ou «IMU») combinent à la fois un accéléromètre et un gyroscope. Voici quelques exemple des modèles les plus populaires:
tr_tr: Birkaç popüler FRC cihazı ("atalet ölçüm cihazları" veya "IMU'lar" olarak bilinir) hem ivmeölçeri hem de jiroskopu birleştirir. Popüler FRC örneği şunları içerir:
zh_cn: 几种FRC提供的传感器（称为IMU或者惯性测量单元）整合了加速度计和陀螺仪。这些传感器包括：

source: The roboRIO comes with a :ref:`built-in three-axis accelerometer <docs/software/sensors/accelerometers-software:BuiltInAccelerometer>` that all teams can use, however teams seeking more-precise measurements may purchase and use a peripheral accelerometer, as well.
es_mx: La roboRIO viene con un acelerómetro construido en 3 ejes, ver en <docs/software/sensors/accelerometers-software:BuiltInAccelerometer>` el cual todos los equipos pueden usar, sin embargo los equipos que buscan medidas aún más precisas también pueden comprar un acelerómetro periférico.

source: The roboRIO has a built-in accelerometer, which does not need any external connections. You can find more details about how to use it in the :ref:`Built-in Accelerometer section <docs/software/sensors/accelerometers-software:BuiltInAccelerometer>` of the software documentation.
es_mx: Este acelerómetro no necesita de conexión externa. Para más detalles de como usarlo ir a la sección de :ref:`Built-in Accelerometer section <docs/software/sensors/accelerometers-software:BuiltInAccelerometer>` de la documentación del software.

source: `Analog Devices ADIS16448 and ADIS 16470 IMUs <https://www.analog.com/en/landing-pages/001/first.html>`__
es_mx: Dispositivos Análogos IMUs ADIS 16448 y ADIS 16470 <https://www.analog.com/en/landing-pages/001/first.html>`__
tr_tr: `Analog Aygıtlar ADIS16448 ve ADIS 16470 IMU'lar <https://www.analog.com/en/landing-pages/001/first.html>`__
zh_cn: `Analog Devices ADIS16448 和 ADIS 16470 IMUs <https://www.analog.com/en/landing-pages/001/first.html>`__

source: `CTRE Pigeon IMU <https://www.ctr-electronics.com/gadgeteer-imu-module-pigeon.html>`__
es_mx: IMU Paloma CTRE. <https://www.ctr-electronics.com/gadgeteer-imu-module-pigeon.html>`__
