Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/analog-inputs-hardware.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Analog Inputs - Hardware
es_mx: Entradas analógicas - Hardware
fr_ca: Entrées analogiques
tr_tr: Analog Girişler - Donanım
zh_cn: 模拟输入 - 硬件

source: This section covers analog input hardware. For a software guide to analog inputs, see :ref:`docs/software/hardware-apis/sensors/analog-inputs-software:Analog Inputs - Software`.
fr_ca: Cette section traite du matériel d'entrée analogique. Pour un guide logiciel sur les entrées analogiques, voir :ref:`docs/software/hardware-apis/sensors/analog-inputs-software:Analog Inputs - Software`.

source: An `analog signal <https://en.wikipedia.org/wiki/Analog_signal>`__ is a signal whose value can lie anywhere in a continuous interval. This lies in stark contrast to a :doc:`digital signal <digital-inputs-hardware>`, which can take only one of several discrete values. The roboRIO's analog input ports allow the measurement of analog signals with values from 0V to 5V.
es_mx: Una `señal análoga <https://en.wikipedia.org/wiki/Analog_signal>`__ es una señal cuyo valor puede encontrarse en cualquier lugar de un intervalo continuo. Esto se encuentra marcado en un contraste a :doc:`digital signal <digital-inputs-hardware>`, que puede tomar solo uno de varios valores discretos. Los puertos de entrada analógica del roboRIO permiten la medición de señales analógicas con valores de 0 V a 5 V.
fr_ca: Un `signal analogique <https://en.wikipedia.org/wiki/Analog_signal>`__ est un signal dont la valeur peut se situer n'importe où dans un intervalle continu. Cela diffère d'un :doc:`signal numérique<digital-inputs-hardware>`, qui ne peut prendre qu'une seule valeur discrète parmi plusieurs. Les ports d'entrée analogique du roboRIO permettent la mesure de signaux analogiques qui ont des valeurs entre 0 et 5 Volts.
tr_tr: Bir `analog sinyal <https://en.wikipedia.org/wiki/Analog_signal> `__, değeri herhangi bir aralıkta herhangi bir yerde bulunabilen bir sinyaldir. Bu, birkaç ayrık değerden yalnızca birini alabilen :doc:`digital sinyal<digital-inputs-hardware>`, ile tam bir tezat oluşturuyor. RoboRIO'nun analog giriş portları, 0V ile 5V arasındaki değerlere sahip analog sinyallerin ölçülmesine izin verir
zh_cn: 模拟信号 `analog signal <https://en.wikipedia.org/wiki/Analog_signal>`__ 是一种信号，其值可以位于连续间隔内的任何位置。这与数字信号形成鲜明对比，数字信号<digital-inputs-hardware>只能采用几个离散值之一。 roboRIO的模拟输入端口允许测量0V至5V范围内的模拟信号。

source: In practice, there is no way to measure a "true" analog signal with a digital device such as a computer (like the roboRIO). Accordingly, the analog inputs are actually measured as a 12-bit digital signal - however, this is quite a high resolution [1]_.
es_mx: En la práctica, no hay forma de medir una señal analógica "true" con un dispositivo digital como una computadora (como el roboRIO). En consecuencia, las entradas analógicas se miden en realidad como una señal digital de 12-bits - sin embargo, esta es una resolución bastante alta [1] _.
fr_ca: En pratique, il n'y a aucun moyen de mesurer un "vrai" signal analogique avec un appareil numérique tel qu'un ordinateur (comme le roboRIO). Par conséquent, les entrées analogiques sont réellement mesurées comme un signal numérique à 12 bits - qui est une résolution assez élevée [1]_.
tr_tr: Pratikte, bilgisayar gibi dijital bir cihazla (roboRIO gibi) "gerçek" bir analog sinyali ölçmenin bir yolu yoktur. Buna göre, analog girişler aslında 12 bitlik dijital sinyal olarak ölçülür - ancak bu oldukça yüksek bir çözünürlüktür [1] _.
zh_cn: 实际上，无法使用数字设备比如计算机（roboRIO）来测量模拟信号是否为“真”。因此，模拟输入实际上被当作12位数字信号来测量。这么高的测量分辨率已经足够了 [1]_。

source: Analog inputs are typically (but not always!) used for sensors whose measurements vary continuously over a range, such as :doc:`ultrasonic rangefinders <ultrasonics-hardware>` and :doc:`potentiometers <analog-potentiometers-hardware>`, as they can communicate by outputting a voltage proportional to their measurements.
es_mx: Las entradas analógicas se utilizan normalmente (¡pero no siempre!) Para sensores cuyas medidas varían continuamente en un rango, como :doc:`ultrasonic rangefinders <ultrasonics-hardware>` y :doc:`potentiometers <analog-potentiometers-hardware>`, ya que pueden comunicarse emitiendo un voltaje proporcional a sus medidas.
fr_ca: Les entrées analogiques sont généralement (mais pas toujours!) utilisées pour les capteurs dont les mesures varient en continu sur une plage, tels que :doc:`capteurs ultrasoniques<ultrasonics-hardware>` et :doc:`potentiomètres<analog-potentiometers-hardware>`, car ils fournissent une tension proportionnelle à leurs mesures.
tr_tr: Analog girişler tipik olarak (ancak her zaman değil!), aşağıdaki gibi ölçümleri bir aralıkta sürekli değişen sensörler için kullanılır: :doc:`ultrasonic mesafe ölçer<ultrasonics-hardware>` ve :doc:`potansiyometre<analog-potentiometers-hardware>` ölçümleriyle orantılı bir voltaj çıkararak iletişim kurabilirler. .
zh_cn: 模拟输入通常（但不总是）用于其测量值在一定范围内连续变化的传感器，例如超声波测距仪<ultrasonics-hardware>和电位计<analog-potentiometers-hardware>，因为它们可以通过输出与测量值成比例的电压进行通信。

source: Connecting to roboRIO analog input ports
es_mx: Conexión a puertos de entrada analógica roboRIO
fr_ca: Connexion aux ports d'entrée analogiques roboRIO
tr_tr: RoboRIO analog giriş bağlantı noktalarına bağlanma
zh_cn: 连接到roboRIO的模拟输入端口

source: An additional four analog inputs are available via the "MXP" expansion port. To use these, a breakout board of some sort that connects to the MXP is needed.
es_mx: Hay cuatro entradas analógicas adicionales disponibles a través del puerto de expansión "MXP". Para usarlas, se necesita una placa de ruptura de algún tipo que se conecte al MXP.
fr_ca: Quatre entrées analogiques supplémentaires sont disponibles via le port d'extension "MXP". Pour les utiliser, une carte supplémentaire qui se connecte au MXP est nécessaire.
tr_tr: "MXP" genişletme portu üzerinden ek dört analog giriş mümkündür. Bunları kullanmak için, MXP'ye bağlanan bir çeşit ara devre panosu gereklidir.
zh_cn: 通过“ MXP”扩展端口还可以使用另外四个模拟输入。要使用它们，需要和MXP连接的分线板上的端口相连。

source: Always consult the technical specifications of the sensor you are using *before* wiring the sensor, to ensure that the correct wire is being connected to each pin. Failure to do so can result in damage to the sensor or the RIO.
es_mx: Consulte siempre las especificaciones técnicas del sensor que está utilizando *antes* de cablear el sensor, para asegurarse de que se está conectando el cable correcto a cada pin. Si no lo hace, puede dañar el sensor o el RIO.
fr_ca: Consultez toujours les spécifications techniques du capteur que vous utilisez *avant* de le câbler au roboRIO, afin de vous assurer que le bon fil est connecté à la bonne broche. Ne pas le faire peut endommager le capteur ou le roboRIO.
tr_tr: Her bir pime doğru kablonun bağlandığından emin olmak için, sensörü kablolamadan *önce* kullandığınız sensörün teknik özellik dökümanlarına daima başvurun. Bunun yapılmaması sensör veya RIO'nun zarar görmesine neden olabilir.
zh_cn: 在对传感器进行接线之前，请务必先阅读正在使用的传感器的技术文档，以确保将正确的导线连接到每个引脚。否则可能会损坏传感器或roboRIO。

source: **Never** directly connect the power pin to the ground pin on any port on the roboRIO! This will trigger protection features on the roboRIO and may result in unexpected behavior.
es_mx: *Nunca* conectes directamente el pin de energía a el pin de tierra en ningún puerto del roboRIO! Esto activará las características de protección del roboRIO y puede resultar en un comportamiento inesperado.
fr_ca: Ne **Jamais** connecter directement la broche d'alimentation à la broche de mise à la terre sur n'importe quel port du roboRIO! Ce court-circuit déclenchera des fonctions de protection sur le roboRIO et générer comportement inattendu.
tr_tr: **Hiçbir zaman** güç pinini roboRIO üzerindeki herhangi bir bağlantı noktasındaki topraklama pinine doğrudan bağlamayın! Bu, roboRIO'daki koruma özelliklerini tetikleyecek ve beklenmeyen davranışlara neden olabilir.
zh_cn: **切勿**将传感器的电源引脚直接连接到roboRIO任意端口上的接地引脚！这将触发roboRIO上的保护功能，并可能导致意外行为。

source: The roboRIO, with the location of the Analog Inputs highlighted.
fr_ca: Le roboRIO, avec l’emplacement des entrées analogiques mis en évidence.

source: The roboRIO has 4 built-in analog input ports (numbered 0-3), as seen in the image above. Each port has three pins - signal ("S"), power ("V"), and ground ("|ground|"). The "power" and "ground" pins are used to power the peripheral sensors that connect to the analog input ports - there is a constant 5V potential difference between the "power" and the "ground" pins [2]_. The signal pin is the pin on which the signal is actually measured.
es_mx: El roboRIO tiene 4 puertos de entrada analógicos incorporados (numerados 0-3), como se ve en la imagen de arriba. Cada puerto tiene tres pines - señal ("S"), potencia ("V"), y tierra ("|ground|"). Los pines de "potencia" y "tierra" se utilizan para alimentar los sensores periféricos que se conectan a los puertos de entrada analógica - hay una diferencia de potencial constante de 5V entre los pines de "potencia" y "tierra" [2]_. El pin de la señal es el pin en el que se mide realmente la señal.
fr_ca: Le roboRIO dispose de 4 ports d'entrée analogique intégrés (numérotés 0-3), comme le montre l'image ci-dessus. Chaque port a trois broches - signal ("S"), alimentation ("V") et masse ("|ground|"). Les broches "alimentation" et "masse" sont utilisées pour alimenter les capteurs périphériques qui se connectent aux ports d'entrée analogique - il existe une différence de potentiel constante de 5 V entre les broches "alimentation" et "masse" [2]_. La broche de signal est la broche sur laquelle le signal est réellement mesuré.
tr_tr: RoboRIO, yukarıdaki resimde görüldüğü gibi 4 dahili analog giriş bağlantı noktasına (0-3 numaralı) sahiptir. Her bağlantı noktasının üç pini vardır - sinyal ("S"), güç ("V") ve toprak ("|toprak|"). "Güç" ve "toprak" pinleri, analog giriş bağlantı noktalarına bağlanan dış sensörlere güç sağlamak için kullanılır - "güç" ve "toprak" pinleri [2] _ arasında sabit bir 5V potansiyel farkı vardır. Sinyal pini, sinyalin gerçekte ölçüldüğü pindir.
zh_cn: 如上图所示，roboRIO内置4路模拟输入端口（0-3号）。每一个端口有三根引脚——信号引脚（S），电源引脚（V）和地线引脚（|ground|）。电源引脚和地线引脚 [2]_用于给传感器外设供电，电压是5V。信号引脚则是实际测量信号的引脚。

source: Connecting a sensor to a single analog input port
es_mx: Conectar un sensor a un solo puerto de entrada analógica
fr_ca: Connexion d'un capteur à un seul port d'entrée analogique
tr_tr: Bir sensörü tek bir analog giriş bağlantı noktasına bağlama
zh_cn: 将传感器连接到单个模拟输入端口

source: Some sensors (such as :doc:`potentiometers <analog-potentiometers-hardware>`) may have interchangeable power and ground connections.
es_mx: Algunos sensores (como :doc:`potentiometers <analog-potentiometers-hardware>`) pueden tener conexiones de energía y de tierra intercambiables.
fr_ca: Certains capteurs (tels que :doc:`potentiomètres<analog-potentiometers-hardware>`) peuvent avoir des connexions d'alimentation et de masse interchangeables.
tr_tr: Bazı sensörler (örneğin :doc:`potansiyometreler<analog-potentiometers-hardware>`), değiştirilebilir güç ve toprak bağlantılarına sahip olabilir.
zh_cn: 有的传感器（如电位器<analog-potentiometers-hardware>)可能会共享电源和地线引脚。

source: Most sensors that connect to analog input ports will have three wires - signal, power, and ground - corresponding precisely to the three pins of the analog input ports. They should be connected accordingly.
es_mx: La mayoría de los sensores que se conectan a los puertos de entrada analógicos tendrán tres cables -señal, potencia y tierra- que se corresponden precisamente con los tres pines de los puertos de entrada analógicos. Deben ser conectados en concordancia.
fr_ca: La plupart des capteurs qui se connectent aux ports d'entrée analogiques auront trois fils - signal, alimentation et masse - correspondant précisément aux trois broches des ports d'entrée analogiques. Ils doivent être connectés en conséquence.
tr_tr: Analog giriş bağlantı noktalarına bağlanan çoğu sensörde, analog giriş bağlantı noktalarının üç pinine tam olarak karşılık gelen üç kablo-sinyal, güç ve toprak-olacaktır. Buna göre bağlanmaları gerekir.
zh_cn: 连接到模拟输入端口的大多数传感器将具有三根线——信号，电源和地线——精确地对应于模拟输入端口的三个引脚。它们应进行相应连接。

source: Hooking a MB1013 distance sensor to an analog input on the roboRIO.
fr_ca: Branchement d’un capteur de distance MB1013 à une entrée analogique du roboRIO.

source: Connecting a sensor to multiple analog input ports
es_mx: Conectar un sensor a múltiples puertos de entrada analógica
fr_ca: Connexion d'un capteur à plusieurs ports d'entrée analogique
tr_tr: Bir sensörü birden çok analog giriş bağlantı noktasına bağlama
zh_cn: 将传感器连接到多个模拟输入端口

source: Some sensors may need to connect to multiple analog input ports in order to function. In general, these sensors will only ever require a single power and a single ground pin - only the signal pin of the additional port(s) will be needed. The image below is shows an analog accelerometer that requires three digital input ports, but similar wiring can be used for analog sensors requiring two analog input ports.
es_mx: Algunos sensores pueden necesitar conectarse a múltiples puertos de entrada analógica para funcionar. En general, estos sensores sólo necesitarán una única alimentación y un único pin de tierra - sólo se necesitará el pin de señal del puerto(s) adicionales. La imagen siguiente muestra un acelerómetro analógico que requiere tres puertos de entrada digital, pero se puede utilizar un cableado similar para los sensores analógicos que requieren dos puertos de entrada analógica.
fr_ca: Certains capteurs peuvent avoir besoin de se connecter à plusieurs ports d'entrée analogique pour fonctionner. En général, ces capteurs ne nécessiteront qu'une seule alimentation et une seule broche de masse - et les broches identifiées comme signaux iront se brancher dans les entrées analogiques correspondantes. L'image ci-dessous montre un accéléromètre qui nécessite trois ports d'entrée analogique, mais un câblage similaire peut être utilisé pour les capteurs nécessitant deux ports d'entrée analogiques.
tr_tr: Bazı sensörlerin çalışması için birden çok analog giriş bağlantı noktasına bağlanması gerekebilir. Genel olarak, bu sensörler yalnızca tek bir güç ve tek bir toprak pini gerektirecektir - yalnızca ek bağlantı noktalarının sinyal pin(lerine) ihtiyaç duyulacaktır. Aşağıdaki resim, üç dijital giriş portu gerektiren bir analog ivmeölçeri göstermektedir, ancak benzer kablolama, iki analog giriş portu gerektiren analog sensörler için de kullanılabilir.
zh_cn: 一些传感器可能需要连接到多个模拟输入端口才能工作。通常，这些传感器将仅需要一路供电引脚和多路信号引脚。下图显示了需要三个数字输入端口的模拟加速度计，但是类似的接线也可以用于需要两个模拟输入端口的模拟传感器。

source: Hooking a triple axis accelerometer to three different analog input channels of the roboRIO.
fr_ca: Branchement d’un accéléromètre à trois ports d’entrée analogiques différents du roboRIO.

source: Footnotes
es_mx: Pie de nota
fr_ca: Notes de bas de page
tr_tr: Dipnotlar
zh_cn: 脚注

source: A 12-bit resolution yields :math:`2^{12}`, or 4096 different values. For a 5V range, that's an effective resolution of approximately 1.2 mV, or .0012V. The actual accuracy specification is plus-or-minus 50mV, so the discretization is not the limiting factor in the measurement accuracy.
es_mx: Una resolución de 12 bits produce :matemáticas:`2^{12}`, o 4096 valores diferentes. Para un rango de 5V, eso es una resolución efectiva de aproximadamente 1.2 mV, o .0012V. La especificación de la precisión real es más o menos 50mV, por lo que la discretización no es el factor limitante en la precisión de la medición.
fr_ca: Une résolution de 12 bits donne :math:`2^{12}`, soit 4096 valeurs différentes. Pour une plage de 5 V, c'est une résolution effective d'environ 1,2 mV ou 0,0012 V. L'accéléromètre étant précis à plus ou moins 50 mV (dans ses spécifications techniques), donc cette résolution n'est pas le facteur limitant la précision de la mesure.
tr_tr: 12 bitlik bir çözünürlük şunu verir :math:`2^{12}` veya 4096 farklı değer. 5V aralığı için, bu yaklaşık 1,2 mV veya 0,0012V hassasiyetli bir çözünürlüktür. Gerçek doğruluk özelliği artı veya eksi 50mV'dir, bu nedenle ayrıklaştırma, ölçüm doğruluğunu sınırlayıcı faktör değildir.
zh_cn: 一个12位分辨率的信号可以产生 :math:`2^{12}` 即4096个不同的值。对于5V范围内的信号，这是大约1.2 mV或0.0012V的有效分辨率。实际测量精度为正负50mV，因此这些离散的信号值并不会限制测量精度。

source: All power pins are actually connected to a single rail, as are all ground pins - there is no need to use the power/ground pins corresponding to a given signal pin.
es_mx: Todos los pines de energía están en realidad conectados a un solo carril, al igual que todos los pines de tierra - no hay necesidad de utilizar los pines de energía/tierra correspondientes a un pin de señal determinado.
fr_ca: Toutes les broches d'alimentation sont en fait connectées à un seul rail, comme toutes les broches de masse - il n'est pas nécessaire d'utiliser les broches d'alimentation / de masse correspondant à une broche de signal donnée
tr_tr: Tüm güç pinleri, tüm toprak pinleri gibi aslında tek bir raya bağlıdır - belirli bir sinyal pinine karşılık gelen güç / toprak pinlerini kullanmaya gerek yoktur.
zh_cn: 所有的电源引脚和地线引脚都是统一的来源，因此无需一定连接到信号引脚旁的供电引脚。
