Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/analog-potentiometers-hardware.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Analog Potentiometers - Hardware
es_mx: Potenciómetros análogos - Hardware
fr_ca: Potentiomètres analogiques
tr_tr: Analog Potansiyometreler - Donanım
zh_cn: 模拟电位器 - 硬件

source: This section covers analog potentiometer hardware. For a software guide to analog potentiometers, see :ref:`docs/software/hardware-apis/sensors/analog-potentiometers-software:Analog Potentiometers - Software`.
fr_ca: Cette section couvre le matériel du potentiomètre analogique. Pour un guide logiciel sur les potentiomètres analogiques, voir :ref:`docs/software/hardware-apis/sensors/analog-potentiometers-software:Analog Potentiometers - Software`.

source: Potentiometers generally have a mechanically-limited travel range. Users should be careful that their mechanisms do not turn their potentiometers past their maximum travel, as this will damage or destroy the potentiometer.
es_mx: Los potenciómetros generalmente tienen un rango de recorrido limitado mecánicamente. Los usuarios deben tener cuidado de que sus mecanismos no giren sus potenciómetros más allá de su recorrido máximo, ya que esto dañará o destruirá el potenciómetro.
fr_ca: Les potentiomètres ont généralement une plage de déplacement limitée de façon mécanique. Les utilisateurs doivent faire attention que leurs mécanismes ne tournent pas leurs potentiomètres au-delà de leur course maximale (environ 270 degrés pour les modèles à un seul tour), car cela endommagerait ou détruirait le potentiomètre.
tr_tr: Potansiyometreler genellikle mekanik olarak sınırlı bir hareket aralığına sahiptir. Kullanıcılar, mekanizmalarının potansiyometrelerini maksimum hareket mesafesini aşmamasına dikkat etmelidir çünkü bu, potansiyometreye zarar verir veya bozar.
zh_cn: 电位计通常具有受机械限制的行程范围。用户应注意其机械装置不要使电位计旋转超过最大行程，因为这会损坏或破坏电位计。

source: Apart from :doc:`quadrature encoders <encoders-hardware>`, another common way of measuring rotation on FRC\ |reg| robots is with analog potentiometers. A potentiometer is simply a variable resistor - as the shaft of the potentiometer turns, the resistance changes (usually linearly). Placing this resistor in a `voltage divider <https://en.wikipedia.org/wiki/Voltage_divider>`__ allows the user to easily measure the resistance by measuring the voltage across the potentiometer, which can then be used to calculate the rotational position of the shaft.
es_mx: Aparte de :doc:`quadrature encoders<encoders-hardware>`, otra forma común de medir la rotación en los robots FRC\ |reg| es con potenciómetros analógicos. Un potenciómetro es simplemente una resistencia variable: a medida que gira el eje del potenciómetro, la resistencia cambia (generalmente de forma lineal). Colocando esta resistencia en un `divisor de voltaje <https://en.wikipedia.org/wiki/Voltage_divider>`__ permite al usuario medir fácilmente la resistencia midiendo el voltaje a través del potenciómetro, que luego se puede usar para calcular la posición de rotación del eje.
fr_ca: En dehors :doc:`quadrature encoders <encoders-hardware>`, une autre façon courante de mesurer la rotation pour des robots FRC\ |reg| est l'usage de potentiomètres analogiques. Un potentiomètre est simplement une résistance variable - comme l’arbre du potentiomètre tourne, la résistance change (généralement linéairement). Placer cette résistance dans un `diviseur de tension <https://en.wikipedia.org/wiki/Voltage_divider>`__ permet à l’utilisateur de mesurer facilement la résistance en mesurant la tension à travers le potentiomètre, qui peut ensuite être utilisée pour calculer la position angulaire de l’arbre.
tr_tr: :doc:`quadrature enkoderlerden <encoders-hardware>` ayrı olarak, FRC robotlarında dönüşü ölçmenin diğer bir yaygın yolu analog potansiyometrelerdir. Bir potansiyometre basitçe değişken bir dirençtir - potansiyometrenin şaftı döndükçe direnç değişir (genellikle doğrusal olarak). Bu direncin bir `voltaj bölücüye <https://en.wikipedia.org/wiki/Voltage_divider>`__ yerleştirilmesi, kullanıcının potansiyometre boyunca voltajı ölçerek direnci kolayca ölçmesine olanak tanır ve bu daha sonra şaftın dönüş konumunu hesaplamak için kullanılabilir.
zh_cn: 除 :doc:`quadrature encoders <encoders-hardware>`，另一种常用于测量FRC\|reg|机器人旋转的方式是使用模拟电位器。一个模拟电位器实际上是一个可调电阻 - 当电位器的轴旋转时，电阻的阻值也随之变化（通常是线性的）。应用`voltage divider <https://en.wikipedia.org/wiki/Voltage_divider>`__上可以通过测量电阻两端的电压来测出电阻的阻值，从而可以计算电位器旋转轴的旋转角度。

source: Wiring an analog potentiometer
es_mx: Cableado de un potenciómetro analógico
fr_ca: Câblage d'un potentiomètre analogique
tr_tr: Analog potansiyometre kablolama
zh_cn: 连接一个模拟电位器

source: As suggested by the names, analog potentiometers connect to the roboRIO's :doc:`analog input <analog-inputs-hardware>` ports. To understand how exactly to wire potentiometers, however, it is important to understand their internal circuitry.
es_mx: Como lo sugieren los nombres, los potenciómetros analógicos se conectan a los puertos :doc:`analog input <analog-inputs-hardware>` de la roboRIO. Sin embargo, para entender exactamente cómo cablear potenciómetros, es importante entender sus circuitos internos.
fr_ca: Comme le suggèrent les noms, les potentiomètres analogiques se connectent aux ports d':doc:`entrées analogiques<analog-inputs-hardware>` du roboRIO. Cependant, pour comprendre comment câbler exactement les potentiomètres, il est important de comprendre leur construction.
tr_tr: İsimlerin önerdiği gibi, analog potansiyometreler roboRIO'lara bağlanır :doc:`analog giriş <analog-inputs-hardware>` portuna. Bununla birlikte, potansiyometrelerin tam olarak nasıl bağlanacağını anlamak için, iç devrelerini anlamak önemlidir.
zh_cn: 就如其名，模拟电位器需要连接到roboRIO的模拟输入口<analog-inputs-hardware>。但是，若要了解如何精确连接电位计，了解其内部电路非常重要。

source: Wiring a potentiometer to an analog input of the roboRIO.
fr_ca: Câblage d’un potentiomètre à une entrée analogique du roboRIO.

source: The picture above on the left shows a typical potentiometer. There are three pins, just as there are on the RIO's analog inputs. The middle pin is the signal pin, while the outer pins can both be *either* power or ground.
es_mx: La imagen de arriba a la izquierda muestra un potenciómetro típico. Hay tres pines, al igual que en las entradas analógicas de RIO. El pin del medio es el pin de señal, mientras que los pines exteriores pueden ser *el que sea* de alimentación o de tierra.
fr_ca: L'image ci-dessus à gauche montre un potentiomètre typique. Il y a trois broches, tout comme il y en a sur les entrées analogiques du RIO. La broche du milieu est la broche de signal, tandis que les broches extérieures peuvent être reliés soit l'une à l'alimentation et l'autre à la masse, ou vice-versa.
tr_tr: Soldaki resim tipik bir potansiyometreyi göstermektedir. RIO'nun analog girişlerinde olduğu gibi üç pin vardır. Ortadaki pin sinyal pini iken, dış pinler hem güç *hem de* toprak olabilir.
zh_cn: 左上方的图片显示了一个典型的电位计。就像RIO的模拟输入口一样，它共有三个引脚。中间引脚是信号引脚，而外部两引脚可以是电源或地线任意一个。

source: As mentioned before, a potentiometer is a voltage divider, as shown in the circuit diagram on the right. As the potentiometer shaft turns, the resistances R1 and R2 change; however, their sum remains constant [1]_. Thus, the voltage across the entire potentiometer remains constant (for the roboRIO, this would be 5 volts), but the voltage between the signal pin and either the voltage or ground pin varies linearly as the shaft turns.
es_mx: Como se mencionó anteriormente, un potenciómetro es un divisor de voltaje, como se muestra en el diagrama de circuito de la derecha. A medida que gira el eje del potenciómetro, las resistencias R1 y R2 cambian; sin embargo, su suma permanece constante [1] _. Por lo tanto, el voltaje en todo el potenciómetro permanece constante (para el roboRIO, esto sería 5 voltios), pero el voltaje entre el pin de señal y el pin de voltaje o tierra varía linealmente a medida que gira el eje.
fr_ca: Comme mentionné précédemment, un potentiomètre est un diviseur de tension, comme le montre le schéma de droite. Lorsque l'arbre du potentiomètre tourne, les résistances R1 et R2 changent; cependant, leur somme reste constante [1]_. Ainsi, la tension à travers l'ensemble du potentiomètre reste constante (pour le roboRIO, ce serait 5 volts), mais la tension entre la broche de signal et la tension ou la broche de masse varie linéairement lorsque l'arbre tourne.
tr_tr: Daha önce belirtildiği gibi, bir potansiyometre, sağdaki devre şemasında gösterildiği gibi bir voltaj bölücüdür. Potansiyometre mili döndükçe, R1 ve R2 dirençleri değişir; ancak toplamları sabit kalır [1]_. Bu nedenle, tüm potansiyometre boyunca voltaj sabit kalır (roboRIO için bu 5 volt olacaktır), ancak sinyal pimi ile voltaj veya toprak pimi arasındaki voltaj, şaft döndükçe doğrusal olarak değişir.
zh_cn: 如前所述，电位器是分压器，如右图所示。随着电位计轴的旋转，电阻R1和R2改变；但是，它们的总和保持不变[1]_。因此，整个电位计上的电压保持恒定（对于roboRIO，这将是5伏），但是信号轴与电源或地线引脚之间的电压随轴旋转而线性变化。

source: Since the circuit is symmetric, it is reversible - this allows the user to choose at which end of the travel the measured voltage is zero, and at which end it is 5 volts. To reverse the directionality of the sensor, it can simply be wired backwards! Be sure to check the directionality of your potentiometer with a multimeter to be sure it is in the desired orientation before soldering your wires to the contacts.
es_mx: Dado que el circuito es simétrico, es reversible; esto permite al usuario elegir en qué extremo del recorrido el voltaje medido es cero y en qué extremo es de 5 voltios. Para invertir la direccionalidad del sensor, ¡simplemente se puede conectar al revés! Asegúrese de verificar la direccionalidad de su potenciómetro con un multímetro para asegurarse de que esté en la orientación deseada antes de soldar los cables a los contactos.
fr_ca: Comme le circuit est symétrique, il est réversible - cela permet à l'utilisateur de choisir à quelle extrémité du trajet la tension mesurée est nulle et à quelle extrémité elle est de 5 volts. Pour inverser la directionnalité du capteur, on peut simplement le câbler à l'envers! Assurez-vous de vérifier la directionnalité de votre potentiomètre avec un multimètre pour vous assurer qu'il est dans l'orientation souhaitée avant de souder vos fils aux contacts.
tr_tr: Devre simetrik olduğu için tersine çevrilebilir - bu, kullanıcının dönüşün hangi ucunda ölçülen voltajın sıfır ve hangi uçta 5 volt olduğunu seçmesine izin verir. Sensörün yönünü tersine çevirmek için, basitçe geriye doğru kablolanabilir! Potansiyometrenizin yönünü bir multimetre ile kontrol ettiğinizden emin olun ve tellerinizi kontaklara lehimlemeden önce istenen yönde olduğundan emin olun.
zh_cn: 由于电路是对称的，因此也是可逆的——允许用户选择在行程的哪一端测得的电压为零，在哪一端为5伏。若要反转传感器的方向，只需将其供电引脚反向接线即可！在将电线焊接到触点之前，请务必用万用表检查电位计的方向性，以确保其方向正确。

source: Absolute encoders
es_mx: Encoders absolutos
fr_ca: Codeurs absolus
tr_tr: Mutlak kodlayıcılar
zh_cn: 绝对编码器

source: Connecting a US Digital MA3 Absolute Encoder to the roboRIO.
fr_ca: Connexion d’un encodeur numérique absolu US Digital MA3 au roboRIO.

source: An "absolute encoder" is an encoder that measures the absolute position of the encoder shaft, rather than the incremental movement (as a :doc:`quadrature encoder <encoders-hardware>`) does. In this respect, absolute encoders are more similar to potentiometers than to incremental encoders. Many absolute encoders offer a simple analog output - these can be used exactly in the same way as a potentiometer, except their wiring is not generally reversible. Absolute encoders have the advantage of lacking a hard travel limit - the signal will simply reset when the shaft crosses the zero point. The analog potentiometer pictured above can be found at `AndyMark <https://www.andymark.com/products/absolute-encoder-with-cable>`__.
es_mx: Un "codificador absoluto" es un codificador que mide la posición absoluta del eje del codificador, en lugar de como lo hace el movimiento incremental (como :doc:`quadrature encoder <encoders-hardware>`). En este sentido, los codificadores absolutos son más similares a los potenciómetros que a los codificadores incrementales. Muchos codificadores absolutos ofrecen una salida analógica simple; estos se pueden usar exactamente de la misma manera que un potenciómetro, excepto que su cableado no es generalmente reversible. Los codificadores absolutos tienen la ventaja de carecer de un límite de recorrido estricto: la señal simplemente se restablecerá cuando el eje cruce el punto cero. El potenciómetro analógico que se muestra arriba se puede encontrar en `AndyMark <https://www.andymark.com/products/absolute-encoder-with-cable>`__.
fr_ca: Un "codeur absolu" est un codeur qui mesure la position absolue de l'arbre du codeur, plutôt que le mouvement incrémental (comme le fait un :doc:`encodeur en quadrature<encoders-hardware>`). À cet égard, les codeurs absolus sont plus similaires aux potentiomètres qu'aux codeurs incrémentaux. De nombreux codeurs absolus offrent une sortie analogique simple - ils peuvent être utilisés exactement de la même manière qu'un potentiomètre, sauf que leur câblage n'est généralement pas réversible. Les codeurs absolus ont l'avantage de ne pas avoir de limite de course stricte - le signal se réinitialise simplement lorsque l'arbre traverse le point zéro. Le potentiomètre analogique illustré ci-dessus se trouve chez `AndyMark <https://www.andymark.com/products/absolute-encoder-with-cable>`__.
tr_tr: "Mutlak enkoder", artan hareketten ziyade enkoder şaftının mutlak konumunu ölçen bir kodlayıcıdır (bir:doc:`quadrature encoder <encoders-hardware>`) gibi. Bu bakımdan mutlak kodlayıcılar, artımlı kodlayıcılardan çok potansiyometrelere benzer. Çoğu mutlak kodlayıcı, basit bir analog çıkış sunar - bunlar, kablolarının genel olarak terlenebilir olmaması dışında, bir potansiyometre ile tamamen aynı şekilde kullanılabilir. Mutlak enkoderler, bir sabit hareket sınırının olmaması avantajına sahiptir - şaft sıfır noktasını geçtiğinde sinyal basitçe sıfırlanır. Yukarıda resmi verilen analog potansiyometre şu adreste bulunabilir `AndyMark <https://www.andymark.com/products/absolute-encoder-with-cable>`__.
zh_cn: “绝对编码器”是一种编码器，它测量编码器轴的绝对位置，而不是增量运动（如正交编码器<encoders-hardware>一样）。在这方面，绝对编码器与电位器更像，而不是增量编码器。许多绝对值编码器都提供简单的模拟输出——可以完全与电位计相同的方式使用它们，但其接线通常不可逆。绝对值编码器的优点是没有硬行程限制-当轴超过零点时，信号将简单地复位。上图中的绝对编码器可以在这里找到`AndyMark <https://www.andymark.com/products/absolute-encoder-with-cable>`__。

source: Absolute encoders that do not offer a simple analog output require :doc:`more complicated communications with the RIO <serial-buses>`.
es_mx: Los codificadores absolutos que no ofrecen una salida analógica simple requieren :doc:`more complicated communications with the RIO <serial-buses>`.
fr_ca: Les codeurs absolus qui n'offrent pas de sortie analogique simple nécessitent un :doc:`protocole de communication plus compliqué avec le RIO<serial-buses>`.
tr_tr: Basit bir analog çıkış sunmayan mutlak kodlayıcılar şunları gerektirir :doc:`Roborio ile daha karmaşık haberleşme<serial-buses>`.
zh_cn: 若使用不直接输出模拟信号的绝对编码器，请阅读<serial-buses>

source: Footnotes
es_mx: Pie de nota
fr_ca: Notes de bas de page
tr_tr: Dipnotlar
zh_cn: 脚注

source: The way this actually works is generally by having the shaft control the position of a contact along a resistive "wiper" of fixed length along which the current flows - the resistance is proportional to the length of wiper between the contact and the end of the wiper.
es_mx: La forma en que esto realmente funciona es generalmente haciendo que el eje controle la posición de un contacto a lo largo de un "limpiador" resistente de longitud fija a lo largo del cual fluye la corriente; la resistencia es proporcional a la longitud del limpiador entre el contacto y el extremo del limpiador.
fr_ca: La façon dont un potentiomètre fonctionne réellement est généralement de faire en sorte que l'arbre du potentiomètre contrôle la position d'un contact, ou "balai" le long d'une piste semi-circulaire de longueur fixe qui est composée d'un elément résistif - la résistance est proportionnelle à la distance entre le balai et une des extrémités de la piste.
tr_tr: Bunun gerçekte çalışma şekli, genellikle şaftın, akımın aktığı sabit uzunluktaki dirençli bir "süpürücü" boyunca bir kontağın konumunu kontrol etmesini sağlamaktır - direnç, kontak ve süpürücü ucu arasındaki süpürücü uzunluğu ile orantılıdır. .
zh_cn: 其工作原理通常是，电位器旋转轴的刷头与一端固定长度的环状电阻材料想接触，电流从中流过。其阻值与刷头和电阻接触点到电阻材料末端的长度相关。

source: This section covers analog potentiometer hardware. For a software guide to analog potentiometers, see :ref:`docs/software/sensors/analog-potentiometers-software:Analog Potentiometers - Software`.
es_mx: Esta sección cubre el hardware del potenciómetro análogo. Para obtener una guía de software para potenciómetros analógicos, consulte :ref:`docs/software/sensors/analog-potentiometers-software:Analog Potentiometers - Software`.
