Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/digital-inputs-hardware.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Digital Inputs - Hardware
es_mx: Entradas digitales - Hardware
fr_ca: Entrées numériques
tr_tr: Dijital Girişler - Donanım
zh_cn: 数字输入 - 硬件

source: This section covers digital input hardware. For a software guide to digital inputs, see :ref:`docs/software/hardware-apis/sensors/digital-inputs-software:Digital Inputs - Software`.
fr_ca: Cette section couvre les entrées numériques. Pour un guide logiciel sur les entrées numériques, voir :ref:`docs/software/hardware-apis/sensors/digital-inputs-software:Digital Inputs - Software`.

source: A `digital signal <https://en.wikipedia.org/wiki/Digital_signal>`__ is a signal that can be in one of several discrete states. In the vast majority of cases, the signal is the voltage in a wire, and there are only two states for a digital signal - high, or low (also denoted 1 and 0, or true and false, respectively).
es_mx: Una `señal digital <https://en.wikipedia.org/wiki/Digital_signal>`__ es una señal que puede estar en uno de varios estados discretos. En la gran mayoría de los casos, la señal es el voltaje en un cable y solo hay dos estados para una señal digital - alto o bajo (también denotado 1 y 0, o verdadero y falso, respectivamente).
fr_ca: Un `signal numérique <https://en.wikipedia.org/wiki/Digital_signal>`__ est un signal qui peut être dans l'un de plusieurs états discrets. Dans la grande majorité des cas, le signal est la tension dans un fil, et il n'y a que deux états pour un signal numérique - haut ou bas (également dénotés 1 et 0, ou vrai et faux, respectivement).
tr_tr: Bir `digital sinyal<https://en.wikipedia.org/wiki/Digital_signal>`__ , birkaç farklı durumdan birinde olabilen bir sinyaldir. Çoğu durumda, sinyal bir teldeki voltajdır ve bir dijital sinyal için yalnızca iki durum vardır - yüksek veya düşük (ayrıca sırasıyla 1 ve 0 veya doğru ve yanlış olarak gösterilir).
zh_cn: `数字输入 <https://en.wikipedia.org/wiki/Digital_signal>`__ 是一个可能处于几种离散状态之一的信号。在大多数情况下，信号就是电线中的电压，数字信号只有两种状态——高或低（分别表示为1和0，或true和false）。

source: The roboRIO's built-in digital input-output ports (or "DIO") ports function on 5V, so "high" corresponds to a signal of 5V, and "low" to a signal of 0V [1]_ [2]_.
es_mx: Los puertos de entrada y salida digitales integrados de roboRIO (o puertos "DIO") funcionan en 5V, por lo que "alto" corresponde a una señal de 5V y "bajo" a una señal de 0V [1] _ [2] _.
fr_ca: Les ports d'entrée-sortie numériques (ou "DIO") intégrés du roboRIO fonctionnent sur 5V, donc "haut" correspond à un signal de 5V et "bas" à un signal de 0V [1]_ [2]_.
tr_tr: RoboRIO'nun dahili dijital giriş-çıkış portları (veya "DIO") portları 5V üzerinde çalışır, bu nedenle "yüksek" 5V'luk bir sinyale ve "düşük" 0V [1]_ [2]_ sinyaline karşılık gelir.
zh_cn: roboRIO的内置数字输入输出端口（ DIO）以5V供电，因此“高”对应于5V信号，“低”对应于0V信号 [1]_ [2]_。

source: Connecting to the roboRIO DIO ports
es_mx: Conexión a los puertos DIO de roboRIO
fr_ca: Connexion aux ports roboRIO DIO
tr_tr: RoboRIO DIO bağlantı noktalarına bağlanma
zh_cn: 连接到roboRIO的数字输入端口

source: Additional DIO ports are available through the "MXP" expansion port. To use these, a breakout board of some sort that connects to the MXP is needed.
es_mx: Los puertos DIO adicionales están disponibles a través del puerto de expansión "MXP". Para usarlos, se necesita una placa de conexión de algún tipo que se conecte al MXP.
fr_ca: Des ports DIO supplémentaires sont disponibles via le port d'extension "MXP". Pour les utiliser, une carte supplémentaire qui se connecte au MXP est nécessaire.
tr_tr: Ek DIO bağlantı noktaları "MXP" genişletme bağlantı noktası aracılığıyla kullanılabilir. Bunları kullanmak için, MXP'ye bağlanan bir çeşit ara devre panosu gereklidir.
zh_cn: 通过“ MXP”扩展端口还可以使用额外的DIO端口。要使用它们，需要和MXP连接的分线板上的端口相连。

source: Always consult the technical specifications of the sensor you are using *before* wiring the sensor, to ensure that the correct wire is being connected to each pin. Failure to do so can result in damage to the device.
es_mx: Consulte siempre las especificaciones técnicas del sensor que está utilizando *antes* de cablear el sensor, para asegurarse de que se está conectando el cable correcto a cada pin. Si no lo hace, puede dañar el dispositivo.
fr_ca: Consultez toujours les spécifications techniques du capteur que vous utilisez *avant* de câbler le capteur, pour vous assurer que le bon fil est connecté à la bonne broche sur le roboRIO. Le non-respect de cette consigne peut endommager soit le capteur et/ou le roboRIO.
tr_tr: Her bir pine doğru kablonun bağlandığından emin olmak için, sensörü kablolamadan *önce* kullandığınız sensörün teknik özelliklerine daima başvurun. Bunun yapılmaması, cihazda hasara neden olabilir.
zh_cn: 在对传感器进行接线之前，请务必*先*阅读正在使用的传感器的技术文档，以确保将正确的导线连接到每个引脚。否则可能会损坏传感器或roboRIO。

source: **Never** directly connect the power pin to the ground pin on any port on the roboRIO! This will trigger protection features on the roboRIO and may result in unexpected behavior.
es_mx: ¡**Nunca** conecte directamente el pin de alimentación al pin de tierra en cualquier puerto del roboRIO! Esto activará funciones de protección en roboRIO y puede resultar en un comportamiento inesperado.
fr_ca: Ne **jamais** connectez directement la broche d'alimentation à la broche de mise à la terre sur n'importe quel port du roboRIO! Ce court-circuit déclenchera des fonctions de protection sur le roboRIO et entraînera un comportement inattendu.
tr_tr: **Hiçbir zaman** güç pinini roboRIO üzerindeki herhangi bir bağlantı noktasındaki topraklama pinine doğrudan bağlamayın! Bu, roboRIO'daki koruma özelliklerini tetikleyecek ve beklenmeyen davranışlara neden olabilir.
zh_cn: **切勿**将传感器的电源引脚直接连接到roboRIO任意端口上的接地引脚！这将触发roboRIO上的保护功能，并可能导致意外行为。

source: roboRIO showing the DIO pins on the left side.
fr_ca: roboRIO montrant les broches DIO sur le côté gauche.

source: The roboRIO has 10 built-in DIO ports (numbered 0-9), as seen in the image above. Each port has three pins - signal ("S"), power ("V"), and ground ("|ground|"). The "power" and "ground" pins are used to power the peripheral sensors that connect to the DIO ports - there is a constant 5V potential difference between the "power" and the "ground" pins [3]_ - the "power" pin corresponds to the "high" state (5V), and the "ground" to "low" (0V). The signal pin is the pin on which the signal is actually measured (or, when used as an output, the pin that sends the signal).
es_mx: El roboRIO tiene 10 puertos DIO integrados (numerados del 0-9), como se ve en la imagen de arriba.Cada puerto tiene tres pines - señal ("S"), potencia ("V") y tierra ("|tierra|"). Los pines de "poder" y "tierra" se utilizan para alimentar los sensores periféricos que se conectan a los puertos DIO - hay una diferencia de potencia constante de 5 V entre los pines de "poder" y "tierra" [3] _ - el pin de "poder" corresponde al estado "alto" (5 V) y el de "tierra" a "bajo" (0 V ). El pin de señal es el pin en el que se mide realmente la señal (o, cuando se usa como salida, el pin que envía la señal).
fr_ca: Le roboRIO possède 10 ports DIO intégrés (numérotés de 0 à 9), comme le montre l'image ci-dessus. Chaque port a trois broches - signal ("S"), alimentation ("V") et masse ("|ground|"). Les broches "alimentation" et "masse" sont utilisées pour alimenter les capteurs périphériques qui se connectent aux ports DIO - il y a une différence de potentiel constante de 5 V entre les broches "alimentation" et "masse" [3]_ - l'état "haut" correspond au voltage sur la broche (5V), et la "masse" à l'état "bas" (0V). La broche de signal est la broche sur laquelle le signal est réellement mesuré (ou, lorsqu'elle est utilisée comme sortie, c'est la broche qui envoie le signal).
tr_tr: RoboRIO, yukarıdaki resimde görüldüğü gibi 10 dahili DIO bağlantı noktasına (0-9 numaralı) sahiptir. Her bağlantı noktasında üç pin bulunur - sinyal ("S"), güç ("V") ve toprak ("|toprak|"). "Güç" ve "toprak" pinleri, DIO bağlantı noktalarına bağlanan dış sensörlere güç sağlamak için kullanılır - "güç" ve "toprak" pinleri [3] _ - "güç" arasında sabit bir 5V potansiyel farkı vardır pin "yüksek" duruma (5V) ve "toprak" dan "düşük" e (0V) karşılık gelir. Sinyal pini, sinyalin gerçekte ölçüldüğü pindir (veya bir çıkış olarak kullanıldığında, sinyali gönderen pindir).
zh_cn: 如上图所示，roboRIO内置10路DIO端口（0-9号）。每一个端口有三根引脚——信号引脚（S），电源引脚（V）和地线引脚（|ground|）。电源引脚和地线引脚 [3]_用于给传感器外设供电，电压是5V。电源引脚对应高电平（5V），地线引脚对应低电平（0V）。信号引脚则是实际测量信号的引脚（当用于输出时，该引脚对外发送信号）。

source: All DIO ports have built in "pull-up" resistors between the power pins and the signal pins - these ensure that when the signal pin is "floating" (i.e. is not connected to any circuit), they consistently remain in a "high" state.
es_mx: Todos los puertos DIO tienen resistencias "pull-up" incorporadas entre los pines de poder y los pines de señal - estos aseguran que cuando el pin de señal está "flotando" (es decir, no está conectado a ningún circuito), permanecen consistentemente en un estado "alto".
fr_ca: Tous les ports DIO ont des résistances «pull-up» intégrées entre les broches d'alimentation et les broches de signal - celles-ci garantissent que lorsque la broche de signal est «flottante» (c'est-à-dire qu'elle n'est connectée à aucun circuit), elles restent constamment dans un état «haut».
tr_tr: Tüm DIO portları, güç pinleri ve sinyal pinleri arasında yerleşik "yukarı-pull-up" dirençlere sahiptir - bunlar, sinyal pini "boşta" olduğunda (yani herhangi bir devreye bağlı olmadığında), sürekli olarak "yüksek" durum konumunda kalır.
zh_cn: 所有DIO端口在电源引脚和信号引脚之间都内置了上拉电阻-这些确保当信号引脚“悬空”（即未连接到任何电路）时，它们始终保持在“高电平”位。

source: Connecting a simple switch to a DIO port
es_mx: Conexión de un conmutador simple a un puerto DIO
fr_ca: Connexion d'un simple commutateur à un port DIO
tr_tr: Basit bir anahtarı bir DIO bağlantı noktasına bağlama
zh_cn: 将简易开关连接到DIO端口

source: The simplest device that can be connected to a DIO port is a switch (such as a :ref:`limit switch <docs/hardware/sensors/proximity-switches:Mechanical proximity switches ("limit switches")>`). When a switch is connected correctly to a DIO port, the port will read "high" when the circuit is open, and "low" when the circuit is closed.
es_mx: El dispositivo más simple que se puede conectar a un puerto DIO es un conmutador (como un :ref:`limit switch <docs/hardware/sensors/proximity-switches:Mechanical proximity switches ("limit switches")>`). Cuando un interruptor está conectado correctamente a un puerto DIO, el puerto leerá "alto" cuando el circuito está abierto y "bajo" cuando el circuito está cerrado.
fr_ca: Le dispositif le plus simple pouvant être connecté à un port DIO est un commutateur (comme un :ref:`interrupteur de fin de course <docs/hardware/sensors/proximity-switches:Mechanical proximity switches ("limit switches")>`). Lorsqu'un commutateur est correctement connecté à un port DIO, le port indiquera "haut" lorsque le circuit est ouvert et "bas" lorsque le circuit est fermé.
tr_tr: Bir DIO portuna bağlanabilen en basit cihaz bir anahtardır (örneğin :ref:`limit anahtarı<docs/hardware/sensors/proximity-switches:Mechanical proximity switches ("limit switches")>`). Bir DIO bağlantı noktasına bir anahtar doğru şekilde bağlandığında, bağlantı noktası devre açıkken "high" ve devre kapalıyken "low" okuyacaktır.
zh_cn: 连接到DIO端口的最简单的设备就是开关（例如一个 :ref:`限位开关 <docs/hardware/sensors/proximity-switches:Mechanical proximity switches ("limit switches")>`）。当将开关正确连接到DIO端口时，电路断开时该端口将读值为“高”，而电路闭合时该端口将显示为“低”。

source: A simple switch does not need to be powered, and thus only has two wires. Switches should be wired between the *signal* and the *ground* pins of the DIO port. When the switch circuit is open, the signal pin will float, and the pull-up resistor will ensure that it reads "high." When the switch circuit is closed, it will connect directly to the ground rail, and thus read "low."
es_mx: Un simple interruptor no necesita poder y, por lo tanto, solo tiene dos cables. Los interruptores deben cablearse entre la *señal* y los pines de *tierra* del puerto DIO. Cuando el circuito del interruptor está abierto, el pin de señal flotará y la resistencia pull-up se asegurará de que se lea "alto". Cuando el circuito del interruptor está cerrado, se conectará directamente al riel de tierra y, por lo tanto, leerá "bajo".
fr_ca: Un simple interrupteur n'a pas besoin d'être alimenté et n'a donc que deux fils. Les commutateurs doivent être câblés entre les broches *signal* et *masse* du port DIO. Lorsque le circuit de commutation est ouvert, la broche de signal flottera et la résistance de pull-up s'assurera qu'elle indique "haut". Lorsque le circuit de commutation est fermé, il se connectera directement au rail de mise à la terre, et indiquera donc «bas».
tr_tr: Basit bir anahtara güç verilmesine gerek yoktur ve bu nedenle sadece iki tele sahiptir. Anahtarlar, DIO portunun *sinyal* ve *toprak* pinleri arasına bağlanmalıdır. Anahtar devresi açık olduğunda, sinyal pini boşta ve kaldırma direnci "yüksek" değerini okumasını sağlar. Anahtar devresi kapatıldığında, doğrudan toprak rayına bağlanır ve böylece "düşük" okur.
zh_cn: 简单的开关不需要供电，因此只有两根线。开关应连接在DIO端口的*信号*和*接地*引脚之间。当开关电路断开时，信号引脚将浮置，并且上拉电阻将确保其读数为“高”。当开关电路闭合时，它将直接连接到地线，因此显示为“低”。

source: Connecting a normally open limit switch to a DIO channel of the roboRIO.
fr_ca: Connexion d’un interrupteur de fin de course normalement ouvert à un port DIO du roboRIO.

source: Connecting a powered sensor to a DIO port
es_mx: Conectando un sensor energizado a un puerto DIO
fr_ca: Connexion d'un capteur alimenté à un port DIO
tr_tr: Elektrikli bir sensörü bir DIO bağlantı noktasına bağlama
zh_cn: 将一个需要供电的传感器连接至DIO端口

source: Many digital sensors (such as most no-contact proximity switches) require power in order to work. A powered sensor will generally have three wires - signal, power, and ground. These should be connected to the corresponding pins of the DIO port.
es_mx: Muchos sensores digitales (como la mayoría de los interruptores de proximidad sin contacto) requieren energía para funcionar. Un sensor energizado generalmente tendrá tres cables - señal, poder y tierra. Estos deben estar conectados a los pines correspondientes del puerto DIO.
fr_ca: De nombreux capteurs numériques (comme la plupart des détecteurs de proximité sans contact) nécessitent de l'énergie pour fonctionner. Un capteur alimenté aura généralement trois fils - signal, alimentation et masse. Ceux-ci doivent être connectés aux broches correspondantes du port DIO.
tr_tr: Çoğu dijital sensör (temassız yaklaşım anahtarlarının çoğu gibi) çalışmak için güce ihtiyaç duyar. Elektrikli bir sensörün genellikle üç kablosu vardır - sinyal, güç ve toprak. Bunlar, DIO portunun ilgili pinlerine bağlanmalıdır.
zh_cn: 许多数字传感器（例如大多数非接触式接近开关）都需要电源才能正常工作。有源传感器通常具有三根电线-信号线，电源线和地线。这些应连接到DIO端口的相应引脚。

source: Connecting a Hall Effect sensor to a roboRIO DIO channel.
fr_ca: Connexion d’un capteur à effet Hall à un port DIO du roboRIO.

source: Connecting a sensor that uses multiple DIO ports
es_mx: Conexión de un sensor que utiliza varios puertos DIO
fr_ca: Connexion d'un capteur utilisant plusieurs ports DIO
tr_tr: Birden çok DIO bağlantı noktası kullanan bir sensörü bağlama
zh_cn: 将传感器连接到多个DIO端口

source: Some sensors (such as :doc:`quadrature encoders <encoders-hardware>`) may need to connect to multiple DIO ports in order to function. In general, these sensors will only ever require a single power and a single ground pin - only the signal pin of the additional port(s) will be needed.
es_mx: Algunos sensores ( así como :doc:`quadrature encoders <encoders-hardware>`) es posible que deba conectarse a varios puertos DIO para funcionar. En general, estos sensores solo requerirán un solo poder y un solo pin de tierra - solo se necesitará el pin de señal de los puerto(s) adicionales.
fr_ca: Certains capteurs (tels que les :doc:`encodeurs en quadrature<encoders-hardware>`) peuvent avoir besoin de se connecter à plusieurs ports DIO pour fonctionner. En général, ces capteurs ne nécessiteront qu'une seule alimentation et une seule broche de terre - seule la broche de signal du ou des ports supplémentaires sera nécessaire.
tr_tr: Bazı sensörlerin (örneğin :doc:`quadrature encoders <encoders-hardware>`) çalışması için birden çok DIO bağlantı noktasına bağlanması gerekebilir. Genel olarak, bu sensörler yalnızca tek bir güç ve tek bir toprak pini gerektirecektir - yalnızca ek bağlantı nokta(larının) sinyal pinlerine ihtiyaç duyulacaktır.
zh_cn: 一些传感器（如正交编码器<encoders-hardware>）可能需要连接到多个DIO端口才能工作。通常，这些传感器将仅需要一路供电引脚和多路信号引脚。

source: Connecting a E4T Optical Encoder to two different DIO ports of the roboRIO.
fr_ca: Connexion d’un encodeur optique E4T à deux ports DIO différents du roboRIO.

source: Footnotes
es_mx: Notas al pie
fr_ca: Notes de bas de page
tr_tr: Dipnotlar
zh_cn: 脚注

source: More-precisely, the signal reads "high" when it rises above 2.0V, and reads "low" when it falls back below 0.8V - behavior between these two thresholds is not guaranteed to be consistent.
es_mx: Más precisamente, la señal se lee "alta" cuando se eleva por encima de 2.0 V y se lee "baja" cuando vuelve a caer por debajo de 0.8 V - no se garantiza que el comportamiento entre estos dos umbrales sea coherente.
fr_ca: Plus précisément, le signal se lit «haut» lorsqu'il monte au-dessus de 2,0 V et se lit «bas» lorsqu'il retombe en dessous de 0,8 V - le comportement entre ces deux seuils est indeterminé (soit "haut" ou"bas").
tr_tr: Daha kesin olarak, sinyal 2.0V'nin üzerine çıktığında "yüksek", 0.8V'nin altına düştüğünde ise "düşük" olarak okunur - bu iki eşik arasındaki davranışın tutarlı olması garanti edilmez.
zh_cn: 准确来说，当信号大于2.0V时即读为高电平，当低于0.8v时则读为低电平。任何在0.8v-2.0v范围内的读数的结果不可预测。

source: The roboRIO also offers 3.3V logic via the "MXP" expansion port; however, use of this is far less-common than the 5V.
es_mx: El roboRIO también ofrece lógica de 3.3V a través del puerto de expansión "MXP"; sin embargo, el uso de esto es mucho menos común que el de 5V.
fr_ca: Le roboRIO offre également une logique 3,3 V via le port d'extension "MXP"; cependant, son utilisation est beaucoup moins courante que le 5V.
tr_tr: RoboRIO ayrıca "MXP" genişletme portu üzerinden 3,3V sunar; ancak bunun kullanımı 5V'den çok daha az yaygındır.
zh_cn: roboRIO通过MXP扩展来的DIO端口的电源供电电压是3.3V。但这远不如5V常用。

source: All power pins are actually connected to a single rail, as are all ground pins - there is no need to use the power/ground pins corresponding to a given signal pin.
es_mx: Todos los pines de poder están realmente conectados a un solo riel, al igual que todos los pines de tierra - no es necesario utilizar los pines de poder / tierra correspondientes a un pin de señal dado.
fr_ca: Toutes les broches d'alimentation sont en fait connectées à un seul rail, comme toutes les broches de terre - il n'est pas nécessaire d'utiliser les broches d'alimentation / de terre correspondant à une broche de signal donnée.
tr_tr: Tüm güç pinleri, tüm toprak pinleri gibi aslında tek bir raya bağlıdır - belirli bir sinyal pinine karşılık gelen güç / zemin pinlerini kullanmaya gerek yoktur.
zh_cn: 所有的电源引脚和地线引脚都是统一的来源，因此无需一定连接到信号引脚旁的供电引脚。

source: This section covers digital input hardware. For a software guide to digital inputs, see :ref:`docs/software/sensors/digital-inputs-software:Digital Inputs - Software`.
tr_tr: Bu bölüm dijital giriş donanımını kapsar. Dijital girişlerle ilgili bir yazılım kılavuzu için bkz :ref:`docs/software/sensors/digital-inputs-software:Digital Inputs - Software`.
