Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/encoders-hardware.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Encoder Wiring
es_mx: Codificador alambrado
tr_tr: Enkoder Kablolaması
zh_cn: 编码器接线

source: Encoders that need two digital inputs, such as the `E4T OEM Miniature Optical Encoder <https://www.andymark.com/products/e4t-oem-miniature-optical-encoder-kit>`__, can be wired to two digital input ports. Other encoders, such as the on-shaft ones shown above, often need :doc:`an analog input port <analog-inputs-hardware>`. CTRE Magnetic encoders shown above can be wired to a :ref:`TalonSRX data port <docs/hardware/sensors/serial-buses:CAN Bus>` with a ribbon cable.
es_mx: Los codificadores que necesitan 2 entradas digitales, tales como el E4T OEM Codificador Óptico en Miniatura <https://www.andymark.com/products/e4t-oem-miniature-optical-encoder-kit>`__, puede ser cableado a 2 puertos de entradas digitales. Otros codificadores, tales como en eje ,mostrado anteriormente, necesita un puerto de entrada analógica :doc:`an analog input port <analog-inputs-hardware>`. Los codificadores magnéticos CTRE mostrado anteriormente, puede ser cableado al puerto de datos Talón SRX :ref:`TalonSRX data port <docs/hardware/sensors/serial-buses:CAN Bus>` con un cable plano.
tr_tr: `E4T OEM Miniature Optical Encoder <https://www.andymark.com/products/e4t-oem-miniature-optical-encoder-kit>`__ gibi iki dijital girişe ihtiyaç duyan kodlayıcılar, iki dijital giriş bağlantı noktasına bağlanabilir. Yukarıda gösterilenler gibi diğer kodlayıcılar genellikle şuna ihtiyaç duyar :doc:`analog giriş portu <analog-inputs-hardware>`. Yukarıda gösterilen CTRE Manyetik kodlayıcılar bir şerit kablo ile :ref:`TalonSRX data port <docs/hardware/sensors/serial-buses:CAN Bus>` a bağlanabilir.
zh_cn: 需要两个数字输入的编码器，例如`E4T OEM Miniature Optical Encoder <https://www.andymark.com/products/e4t-oem-miniature-optical-encoder-kit>`__，可以连接到两个数字输入输入端口。其他编码器，例如上面显示的轴上编码器，通常需要 :doc:`an analog input port <analog-inputs-hardware>`。上面显示的CTRE磁性编码器可以通过带状电缆连接到:ref:`TalonSRX data port <docs/hardware/sensors/serial-buses:CAN Bus>`

source: Encoder Resolution
es_mx: Resolución de codificadores
tr_tr: Enkoder Çözünürlüğü
zh_cn: 编码器分辨率

source: This section covers encoder hardware. For a software guide to encoders, see :ref:`docs/software/sensors/encoders-software:Encoders - Software`.
tr_tr: Bu bölüm, kodlayıcı donanımını kapsar. Kodlayıcılarla ilgili bir yazılım kılavuzu için buraya bakınız.:ref:`docs/software/sensors/encoders-software:Encoders - Software`.

source: Quadrature encoders are by far the most common method for measuring rotational motion in FRC, and for good reason - they are cheap, easy-to-use, and reliable. As they produce digital signals, they are less-prone to noise and interference than analog devices (such as :doc:`potentiometers <analog-potentiometers-hardware>`).
tr_tr: Quadrature kodlayıcılar, FRC'de dönme hareketini ölçmek için açık ara en yaygın yöntemdir ve bu ucuz, kullanımı kolay ve güvenilir olmaları gibi iyi bir nedenlerden ötürüdür. Dijital sinyaller ürettikleri için, analog cihazlara göre gürültüye ve distorsyona daha az eğilimlidirler (örneğin :doc:`potentiometers <analog-potentiometers-hardware>` ).
