Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/encoders-hardware.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Encoders - Hardware
es_mx: Codificadores - Hardware
fr_ca: Encodeurs
tr_tr: Kodlayıcılar-Donanım
zh_cn: 编码器 - 硬件

source: This section covers encoder hardware. For a software guide to encoders, see :ref:`docs/software/hardware-apis/sensors/encoders-software:Encoders - Software`.
fr_ca: Cette section traite des encodeurs. Pour un guide logiciel sur les encodeurs, voir :ref:`docs/software/hardware-apis/sensors/encoders-software:Encoders - Software`.

source: Encoders are by far the most common method for measuring rotational motion in FRC\ |reg|, and for good reason - they are cheap, easy-to-use, and reliable. As they produce digital signals, they are less-prone to noise and interference than analog devices (such as :doc:`potentiometers <analog-potentiometers-hardware>`).
fr_ca: L'usage d'encodeurs est de loin la méthode la plus courante pour mesurer le mouvement de rotation en FRC\ |reg|, et pour cause - ils sont bon marché, faciles à utiliser et fiables. Lorsqu’ils produisent des signaux numériques, ils sont moins sujets au bruit et aux interférences que les appareils analogiques (tels que les :doc:`potentiomètres <analog-potentiometers-hardware>`).

source: Types of Encoders
es_mx: Tipos de codificadores
fr_ca: Types d'encodeurs
tr_tr: Kodlayıcı Türleri
zh_cn: 编码器的种类

source: There are three main ways encoders connect physically that are typically used in FRC:
fr_ca: En FRC, il existe trois principales façons de brancher physiquement les encodeurs.

source: `Shafted encoders`_
es_mx: `Codificadores de eje`_
fr_ca: `Encodeurs à arbre`_
zh_cn: 轴编码器

source: `On-shaft encoders`_
es_mx: `Codificadores en el eje`_
fr_ca: `Encodeurs sur arbre`_
zh_cn: 轴上编码器

source: `Magnetic encoders`_
es_mx: `Codificadores magnéticos`_
fr_ca: `Encodeurs magnétiques`_
zh_cn: 磁编码器

source: These encoders vary in how they are mounted to the mechanism in question. In addition to these types of encoders, many FRC mechanisms come with quadrature encoders integrated into their design.
es_mx: Estos codificadores varían en cómo son montados en el mecanismo en cuestión. En adición a este tipo de codificadores, algunos mecanismos de FRC vienen con codificadores de cuadratura integrados en el diseño.
fr_ca: Ces encodeurs varient dans la façon dont ils sont montés sur le mécanisme en question. En plus de ces types d'encodeurs, de nombreux mécanismes FRC sont livrés avec des encodeurs en quadrature intégrés dans leur boîtier.
tr_tr: Bu kodlayıcılar, söz konusu mekanizmaya nasıl monte edildiklerine göre değişir. Bu tür kodlayıcılara ek olarak, birçok FRC mekanizması tasarımlarına entegre edilmiş quadrature kodlayıcılarla birlikte gelir.
zh_cn: 这些编码器的安装方式有所不同。除了这些类型的编码器，许多队伍还将正交编码器集成到机械设计中。

source: There are also three main ways the encoder data is communicated that are typically used in FRC:
fr_ca: Il existe également trois manières principales de communiquer les données de l'encodeur en FRC:

source: `Quadrature encoders`_
fr_ca: `Encodeurs à quadrature`_

source: `Duty Cycle encoders`_
fr_ca: `Encodeurs de rapport cyclique`_

source: `Analog encoders`_
fr_ca: `Encodeurs analogiques`_

source: Some encoders may support more then one communication method
fr_ca: Certains encodeurs peuvent prendre en charge plusieurs méthodes de communication.

source: Shafted Encoders
fr_ca: Encodeurs à arbre

source: Diagram of the Greyhill 63R Optical Encoder.
fr_ca: Diagramme de l'encodeur optique Greyhill 63R.

source: Shafted encoders have a sealed body with a shaft protruding out of it that must be coupled rotationally to a mechanism. This is often done with a helical beam coupling, or, more cheaply, with a length of flexible tubing (such as surgical tubing or pneumatic tubing), fastened with cable ties and/or adhesive at either end. Many commercial off-the-shelf FRC gearboxes have purpose-built mounting points for shafted encoders.
fr_ca: Les encodeurs à arbre ont un corps scellé avec un arbre qui en sort et qui doit être couplé en rotation à un mécanisme. Cela se fait souvent avec un couplage de faisceau hélicoïdal, ou, à moindre coût, avec une longueur de tubes flexibles (tels que les tubes chirurgicaux ou tubes pneumatiques), fixé avec des attaches de câble et/ou adhésif à chaque extrémité. De nombreuses boîtes de vitesses FRC commerciales ont des points de montage spécialement conçus pour les encodeurs à arbre.

source: Examples of shafted encoders:
fr_ca: Exemples d'encodeurs à arbre:

source: On-shaft Encoders
fr_ca: Encodeurs sur arbre

source: Diagram of the AMT103 and the AMT102 shaft encoders.
fr_ca: Diagramme des encodeurs à arbre AMT103 et AMT102.

source: On-shaft encoders couple to a shaft by fitting *around* it, forming a friction coupling between the shaft and a rotating hub inside the encoder.
fr_ca: Les encodeurs sur arbre sont couplés à un arbre en s'ajustant *autour* de celui-ci, formant un accouplement à friction entre l'arbre et un moyeu rotatif à l'intérieur de l'encodeur.

source: Examples of On-shaft encoders:
fr_ca: Exemples d'encodeurs sur arbre:

source: Magnetic Encoders
fr_ca: Encodeurs magnétiques

source: Picture of the CTRE Mag Encoder.
fr_ca: Photo de l'encodeur CTRE Mag.

source: Magnetic encoders require no mechanical coupling to the shaft at all; rather, they track the orientation of a magnet fixed to the shaft. While the no-contact nature of magnetic encoders can be handy, they often require precise construction in order to ensure that the magnet is positioned correctly with respect to the encoder.
fr_ca: Les encodeurs magnétiques ne nécessitent aucun accouplement mécanique à l'arbre; ils suivent plutôt l'orientation d'un aimant qui est fixé à l'arbre. Bien que la nature sans contact des encodeurs magnétiques puisse être pratique, ils nécessitent souvent une construction précise afin de s'assurer que l'aimant est correctement positionné par rapport à l'encodeur.

source: Examples of magnetic encoders:
fr_ca: Exemples d'encodeurs magnétiques:

source: Quadrature Encoders
fr_ca: Encodeurs à quadrature

source: The term "quadrature" refers to the method by which the motion is measured/encoded. A quadrature encoder produces two square-wave pulses that are 90-degrees out-of-phase from each other, as seen in the picture below:
es_mx: El término cuadratura se refiere al método por el cual el movimiento es medido/codificado. Un codificador de cuadratura produce 2 olas cuadradas, pulsos de 90 grados fuera de fase entre ellos como se ve en la imagen debajo:
fr_ca: Le terme "quadrature" fait référence à la méthode par laquelle le mouvement est mesuré / codé. Un codeur en quadrature produit deux impulsions carrées qui sont déphasées de 90 degrés l'une par rapport à l'autre, comme le montre l'image ci-dessous:
tr_tr: "Quadrature" terimi, hareketin ölçüldüğü/kodlandığı yöntemi ifade eder. Bir quadrature kodlayıcı, aşağıdaki resimde görüldüğü gibi, birbirinden 90 derece faz farkı olan iki kare dalga darbesi üretir:
zh_cn: 术语“正交”是指测量/编码运动的方法。正交编码器会产生两个相位相差为90度的方波脉冲，如下图所示：

source: The signal pattern in both directions and how using two channels allows us to tell the direction.
fr_ca: Le modèle de signal dans les deux sens et comment l’utilisation de deux canaux nous permet de déduire la direction.

source: Thus, across both channels, there are four total "edges" per period (hence "quad"). The use of two out-of-phase pulses allows the direction of motion to be unambiguously determined from which pulse "leads" the other.
es_mx: Así, a través de los 2 canales, son 4 bordes en total por periodo (por lo tanto “cuadrante”). El uso de 2 pulsos fuera de fase permite la dirección de movimiento para ser inequívocamente determinada por cuál pulso lidera a otro.
fr_ca: Ainsi, sur les deux canaux, il y a quatre "fronts" totaux par période (d'où "quad"). L'utilisation de deux impulsions déphasées permet de déterminer sans ambiguïté la direction du mouvement en déterminant quelle impulsion "est en avance" sur autre.
tr_tr: Bu nedenle, her iki kanalda, peryod başına toplam dört "kenar" vardır (dolayısıyla "dörtlü-quad"). İki faz farklı darbenin kullanılması, hareket yönünün, hangi darbenin diğerini "yönlendirdiği" net bir şekilde belirlenmesine izin verir.
zh_cn: 因此，在这两个信号通道之间，每个周期有四个“边”（因此为“ quad”）。通过判断两个不同相位的信号脉冲，哪个脉冲在另一个脉冲的前面，就可以明确确定运动方向，

source: As each square wave pulse is a digital signal, quadrature encoders connect to the :doc:`digital input <digital-inputs-hardware>` ports on the roboRIO.
fr_ca: Comme chaque impulsion d'onde carrée est un signal numérique, les encodeurs en quadrature se connectent aux ports :doc:`entrée numérique<digital-inputs-hardware>` du roboRIO.

source: Examples of quadrature encoders:
fr_ca: Exemples d'encodeurs à quadrature:

source: Quadrature Encoder Wiring
fr_ca: Câblage d'un encodeur à quadrature

source: Wiring the E4T Optical Encoder to two DIO ports.
fr_ca: Câblage de l'encodeur optique E4T sur deux ports DIO.

source: Some quadrature encoders have a third index pin which pulses when the encoder completes a revolution.
fr_ca: Certains encodeurs en quadrature ont une troisième broche d'index qui émet une impulsion lorsque l'encodeur effectue un tour.

source: Quaderature Encoder Resolution
fr_ca: Résolution de l'encodeur à quadrature

source: The acronyms "CPR" and "PPR" are *both* used by varying sources to denote both edges per revolution *and* cycles per revolution, so the acronym alone is not enough to tell which is of the two is meant when by a given value. When in doubt, consult the technical manual of your specific encoder.
es_mx: Los acrónimos “CPR” y “PPR” son usados por fuentes variadas para denotar ambos bordes por revolución y ciclos por revolución, entonces el acrónimo solo no es suficiente para decir cuál de los 2 se entiende cuando se da un valor. Si hay dudas, consulta el manual técnico del codificador específico.
fr_ca: Les acronymes "CPR" et "PPR" sont utilisés indifféremment par plusieurs sources pour désigner les deux fronts de montée par révolution (PPR = Pulses per Revolution) *et* les cycles par révolution (CPR = Cycles per Revolution), de sorte que l'acronyme seul ne suffit pas pour dire ce que le nombre associé à la valeur représente "dans la vraie vie". Il est préférable de se fier à la documentation technique de chaque encodeur pour obtenir l'information souhaitée.
tr_tr: "CPR"-cycles per revolution ve "PPR" kısaltmaları *her ikisi de*, çeşitli kaynaklarda her kenarı *ve* devir başına döngüyü belirtmek için kullanılır, bu nedenle kısaltma tek başına ikisinden hangisinin geçerli olduğunu belilemeye yetmez. Şüphe duyduğunuzda, kodlayıcınızın teknik kılavuzuna bakın.
zh_cn: 首字母缩写词“ CPR”和“ PPR”被不同的来源*同时*使用，以表示每转的两个边沿*和*每转的循环数，因此仅首字母缩写还不足以说明两者中的哪一个是何时给定的价值。如有疑问，请查阅您特定编码器的技术手册。

source: As encoders measure rotation with digital pulses, the accuracy of the measurement is limited by the number of pulses per given amount of rotational movement. This is known as the "resolution" of the encoder, and is traditionally measured in one of two different ways: edges per revolution, or cycles per revolution.
es_mx: Como codificadores de medida rotatoria con pulsos digitales, la exactitud de la medida es limitada por el número de pulsaciones por las cantidades dadas de los movimientos rotatorios. Esto es conocido como la “resolución” de los codificadores y es tradicionalmente medido en una de las 2 formas diferentes: bordes por revolución o ciclos por revolución.
fr_ca: Comme les encodeurs mesurent la rotation avec des impulsions numériques, la précision de la mesure est limitée par le nombre d'impulsions pour un angle donné, ou une rotation complète. C'est ce que l'on appelle la «résolution» de l'encodeur, et elle est traditionnellement mesurée de deux manières différentes: fronts par tour ou cycles par tour.
tr_tr: Kodlayıcılar dönüşü dijital darbelerle ölçtüğü için, ölçümün doğruluğu, belirli bir dönme hareketi miktarı başına darbe sayısı ile sınırlıdır. Bu, kodlayıcının "çözünürlüğü" olarak bilinir ve geleneksel olarak iki farklı yoldan biriyle ölçülür: devir başına kenar veya devir başına döngü.
zh_cn: 当编码器使用数字脉冲测量旋转时，测量精度受每给定旋转运动量的脉冲数限制。这被称为编码器的“分辨率”，并且通常以两种不同方式之一进行测量：每转的边沿或每转的圈数。

source: *Edges per revolution* refers to the total number of transitions from high-to-low or low-to-high across both channels per revolution of the encoder shaft. A full period contains *four* edges.
es_mx: Los *bordes por revolución* se refieren al número total de transmisiones de alto a bajo o de bajo a alto a través de ambos canales por revolución del codificador de eje. Un periodo completo contiene *cuatro* bordes.
fr_ca: Le terme *Fronts par révolution* fait référence au nombre total de transitions (soit du haut vers le bas, ou bas vers le haut) sur les deux canaux, pour un tour complet de l'arbre de l'encodeur. Une période complète contient *quatre* fronts, et un tour contient plusieurs périodes.
tr_tr: *Devir başına kenarlar*, kodlayıcı milinin her iki kanalında da yüksekten düşüğe veya düşükten yükseğe geçişlerin toplam sayısını ifade eder. Tam bir nokta *dört* kenar içerir.
zh_cn: *每转边沿*是指编码器轴每转两个通道从高到低或从低到高的过渡总数。一个完整的周期包含*四个*边。

source: *Cycles per revolution* refers to the total number of *complete periods* of both channels per revolution of the encoder shaft. A full period is *one* cycle.
es_mx: *Ciclos por revolución* se refiere al número total del periodo completo de ambos canales por revolución del codificador por eje. Un periodo completo es igual a un ciclo.
fr_ca: Le terme *Cycles par tour* fait référence au nombre total de *périodes complètes* des deux canaux par tour de l'arbre de l'encodeur. Une période complète est *un* cycle.
tr_tr: *Devir başına döngü*, enkoder milinin dönüşü başına her iki kanalın toplam *tam dönem* sayısını ifade eder. Tam bir peryod *bir* döngüdür.
zh_cn: *每转周期*是指编码器轴每转两个通道的*完整周期*的总数。一个完整的周期是*一*转。

source: Thus, a resolution stated in edges per revolution has a value four times that of the same resolution stated in cycles per revolution.
es_mx: Así, una resolución expresada en bordes por revolución tiene un valor 4 veces mayor que la misma resolución expresada en ciclos por revolución.
fr_ca: Ainsi, une résolution indiquée en fronts par tour a une valeur quatre fois supérieure à la même résolution indiquée en cycles par tour.
tr_tr: Bu nedenle, devir başına kenarlarda belirtilen bir çözünürlük, devir başına döngülerde belirtilen aynı çözünürlüğün dört katı bir değere sahiptir.
zh_cn: 因此，以每转边缘表示的分辨率的值是以每转周期表示的相同分辨率的值的四倍。

source: In general, the resolution of your encoder in edges-per-revolution should be somewhat finer than your smallest acceptable error in positioning. Thus, if you want to know the mechanism plus-or-minus one degree, you should have an encoder with a resolution somewhat higher than 360 edges per revolution.
es_mx: En general, la resolución en su codificador en bordes por revolución debería ser un poco más fina que su más pequeño aceptable error en posicionamiento. Así, si usted quiere conocer el mecanismo más o menos un grado, debería tener un codificador con resolución algo más alta que 360 bordes por revolución.
fr_ca: En général, la résolution de votre encodeur en fronts par révolution doit être supérieure à la plus petite erreur acceptable de positionnement. Ainsi, si vous voulez obtenir une précision angulaire de plus ou moins un degré dans un mécanisme, vous devriez utiliser un encodeur avec une résolution au moins supérieure à 360 fronts par tour.
tr_tr: Genel olarak, kodlayıcınızın dönüş başına kenardaki çözünürlüğü, konumlandırmadaki kabul edilebilir en küçük hatanızdan biraz daha hassas olmalıdır. Dolayısıyla, mekanizmayı artı veya eksi bir derece bilmek istiyorsanız, dönüş başına 360 kenardan biraz daha yüksek çözünürlüğe sahip bir kodlayıcıya sahip olmalısınız.
zh_cn: 通常，编码器每转边的分辨率应比定位中可接受的最小误差稍好。因此，如果您想知道正负一度的机制，则应使用分辨率稍高于每转360个边缘的编码器。

source: Duty Cycle Encoders
fr_ca: Encodeurs de rapport cyclique

source: The PWM signal pattern for minimum and maximum angles.
fr_ca: Le modèle de signal PWM pour les angles minimum et maximum.

source: Duty cycle encoders connect to a single digital input on the roboRIO. They output a pulse where the length of a pulse is proportional to the absolute position of the encoder.
fr_ca: Les encodeurs de rapport cyclique se connectent à une seule entrée numérique sur le roboRIO. Ils génèrent une impulsion dont la longueur est proportionnelle à la position absolue de l’encodeur.

source: Examples of duty cycle encoders:
fr_ca: Exemples d'encodeurs Duty Cycle:

source: Analog Encoders
fr_ca: Encodeurs analogiques

source: The connection of a US Digital MA3 Analog encoder to the roboRIO analog input.
fr_ca: Connexion d’un encodeur analogique US Digital MA3 au port analogique du roboRIO.

source: Analog encoders connect to a analog input on the roboRIO. They output a voltage proportional to the absolute position of the encoder.
fr_ca: Un encodeur analogique se connecte à une entrée analogique du roboRIO. Il produit une tension proportionnelle à sa position absolue.

source: Examples of analog encoders:
fr_ca: Exemples d'encodeurs analogiques:

source: Quadrature encoders are by far the most common method for measuring rotational motion in FRC\ |reg|, and for good reason - they are cheap, easy-to-use, and reliable. As they produce digital signals, they are less-prone to noise and interference than analog devices (such as :doc:`potentiometers <analog-potentiometers-hardware>`).
es_mx: Los codificadores de cuadratura son el método más común para medir el movimiento de rotación en FRC\ |reg|, y por una buena razón - son baratos, fáciles de usar y fiables. Como producen señales digitales, son menos propensos al ruido y a las interferencias que los dispositivos analógicos (como :doc:`potentiometers <analog-potentiometers-hardware>`).
zh_cn: 使用正交编码器是FRC\|reg|比赛中测量旋转运动的最常用方法。理由很充分：价格便宜，易于使用且可靠。正交编码器输出的是数字信号，因此不太容易想模拟信号的传感器一样存在噪音和干扰的问题（如:doc:`potentiometers <analog-potentiometers-hardware>）。

source: As each square wave pulse is a digital signal, quadrature encoders connect to the :doc:`digital input <digital-inputs-hardware>` ports on the RIO.
es_mx: Como cada ola cuadrada pulsa en una señal digital, los codificadores de cuadratura se conectan en un puerto de entrada digital :doc:`digital input <digital-inputs-hardware>` en la RIO.
tr_tr: Her kare dalga darbesi bir dijital sinyal olduğundan, quadrature kodlayıcılar RIO üzerindeki :doc:`digital giriş <digital-inputs-hardware>` bağlantı noktalarına bağlanır.
zh_cn: 由于每个方波脉冲都是数字信号，正交编码器可以连接到roboRIO上的DIO口。<digital-inputs-hardware>

source: There are three types of quadrature encoders typically used in FRC:
es_mx: Existen 3 tipos de codificadores de cuadratura usualmente usados en FRC:
tr_tr: Genellikle FRC'de kullanılan üç tür quadrature kodlayıcı vardır:
zh_cn: FRC比赛中，常用到以下三种正交编码器：

source: Shafted encoders
es_mx: Codificadores de eje
tr_tr: Shafted kodlayıcılar
zh_cn: 轴编码器

source: Shafted encoders have a sealed body with a shaft protruding out of it that must be coupled rotationally to a mechanism. This is often done with a helical beam coupling, or, more cheaply, with a length of flexible tubing (such as surgical tubing or pneumatic tubing), fastened with cable ties and/or adhesive at either end. Many commercial off-the-shelf FRC gearboxes have purpose-built mounting points for shafted encoders, such as the popular `Grayhill 63r <https://www.grayhill.com/documents/63R-Datasheet>`__, pictured above.
es_mx: Los codificadores con eje tienen un cuerpo sellado con un eje que sobresale y debe acoplarse rotacionalmente a un mecanismo. Esto a menudo se hace con un acoplamiento de viga helicoidal o, de manera más económica, con un tramo de tubería flexible (como tubería quirúrgica o tubería neumática), sujeta con bridas y / o adhesivo en cada extremo. Muchas cajas de engranajes FRC comerciales listas para usar tienen puntos de montaje especialmente diseñados para codificadores con eje, como el popular `Grayhill 63r <https://www.grayhill.com/documents/63R-Datasheet>` __, que se muestra arriba.
tr_tr: Şaftlı kodlayıcılar, bir mekanizmaya rotasyonel olarak bağlanması gereken, dışarı çıkıntı yapan bir şafta sahip kapalı bir gövdeye sahiptir. Bu genellikle bir sarmal kiriş bağlantısı ile veya daha ucuza, her iki ucunda kablo bağları ve/veya yapıştırıcı ile tutturulmuş uzun bir esnek boru (cerrahi boru veya pnömatik boru gibi) ile yapılır. Piyasada satılan birçok FRC dişli kutusu, yukarıda gösterilen popüler `Grayhill 63r <https://www.grayhill.com/documents/63R-Datasheet>`__ gibi şaftlı kodlayıcılar için amaca uygun montaj noktalarına sahiptir.
zh_cn: 轴编码器具有一个密封的主体，有一个输出轴伸出其中，这个输出轴必须与机构旋转连接。这通常是通过螺丝连接。或者用一定长度的软管（例如手术管或气动管）连接，两端用扎带或胶水固定。许多现成的FRC齿轮箱都有专门用于轴编码器的安装点，例如上图的 `Grayhill 63r <https://www.grayhill.com/documents/63R-Datasheet>`。

source: On-shaft encoders
es_mx: Codificadores en eje
tr_tr: On-shaft kodlayıcılar
zh_cn: 轴上编码器

source: On-shaft encoders (such as the `AMT103-V <https://www.cuidevices.com/product/motion/rotary-encoders/incremental/modular/amt10-v-kit/amt103-v>`__ available through FIRST Choice) couple to a shaft by fitting *around* it, forming a friction coupling between the shaft and a rotating hub inside the encoder.
es_mx: Los codificadores en eje (tales como el AMT 103-V <https://www.cuidevices.com/product/motion/rotary-encoders/incremental/modular/amt10-v-kit/amt103-v>`__ disponibles a través de FIRST CHOICE) unido al eje por *rodeándolo*, formando un acoplamiento de fricción entre el eje y el cubo giratorio dentro del codificador.
tr_tr: Şaft üstü-on shaft kodlayıcılar (örneğin, FIRST Choice yoluyla temin edilebilen `AMT103-V <https://www.cuidevices.com/product/motion/rotary-encoders/incremental/modular/amt10-v-kit/amt103-v>`__ gibi), şaft ile kodlayıcının içinde dönen bir göbek arasında bir sürtünme kuplajı oluşturarak, *etrafına* yerleştirerek bir şafta bağlanır.
zh_cn: 轴上编码器（例如AMT103-V <https://www.cuidevices.com/product/motion/rotary-encoders/incremental/modular/amt10-v-kit/amt103-v>`__可通过FIRST Choice获得）通过紧固锁紧到一个输出轴，从而使转轴和编码器内部的旋转环固定在一起。

source: Magnetic encoders
es_mx: Codificadores magnéticos
tr_tr: Manyetik kodlayıcılar
zh_cn: 磁编码器

source: Magnetic encoders require no mechanical coupling to the shaft at all; rather, they track the orientation of a magnet fixed to the shaft. The `CTRE Mag Encoder <https://www.ctr-electronics.com/srx-magnetic-encoder.html>`__ is a popular option, with many FRC products offering built-in mounting options for it. While the no-contact nature of magnetic encoders can be handy, they often require precise construction in order to ensure that the magnet is positioned correctly with respect to the encoder.
es_mx: Los codificadores magnéticos requieren de acoplamiento mecánico del todo en el eje; sin embargo, rastrean la orientación del imán fijo en el eje. El `CTRE Codificador Mag <https://www.ctr-electronics.com/srx-magnetic-encoder.html>`__ es una muy popular opción, con varios productos de FRC ofreciendo opciones de montaje ya completas. Mientras el no contacto natural de los codificadores magnéticos puede ser práctico, a menudo requieren una construcción precisa para asegurar que el imán está bien posicionado con respecto al codificador.
tr_tr: Manyetik kodlayıcılar, şafta hiçbir mekanik bağlantı gerektirmez; daha ziyade mile sabitlenmiş bir mıknatısın yönünü takipeder. `CTRE Mag Encoder <https://www.ctr-electronics.com/srx-magnetic-encoder.html>`__, bunun için yerleşik montaj seçenekleri sunan birçok FRC ürünü ile popüler bir seçenektir. Manyetik kodlayıcıların temassız doğası kullanışlı olabilirken, mıknatısın kodlayıcıya göre doğru konumlandırılmasını sağlamak için genellikle hassas yapı gerektirirler.
zh_cn: 磁性编码器完全不需要与转轴连接；它检测固定在转轴上的磁铁的方向。 “ CTRE Mag编码器<https://www.ctr-electronics.com/srx-magnetic-encoder.html>`__是一个受欢迎的选项，许多FRC产品都为其提供了内置安装孔位。虽然磁性编码器无接触的特性很方便，但它们通常需要精确的安装孔位，以确保磁体相对于编码器正确定位。
