Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/gyros-hardware.po
Languages: es_mx, fr_ca, tr_tr

source: Gyroscopes - Hardware
es_mx: Giroscopio - Hardware
fr_ca: Gyroscopes
tr_tr: Gyroscopes - Donanım

source: This section covers gyro hardware. For a software guide to gyros, see :ref:`docs/software/hardware-apis/sensors/gyros-software:Gyroscopes - Software`.
fr_ca: Cette section couvre le matériel du gyroscope. Pour un guide logiciel sur les gyroscopes, voir :ref:`docs/software/hardware-apis/sensors/gyros-software:Gyroscopes - Software`.

source: Gyroscopes (or "gyros", for short) are devices that measure rate-of-rotation. These are particularly useful for stabilizing robot driving, or for measuring heading or tilt by integrating (adding-up) the rate measurements to get a measurement of total angular displacement.
es_mx: Los giroscopios (o "gyros") son aparatos que miden la velocidad de rotación. Estos son particularmente útiles para estabilizar la conducción del robot, o para medir el camino o la inclinación mediante la integración (suma) de las medidas para obtener la medida del desplazamiento angular total.
fr_ca: Les gyroscopes sont des dispositifs qui mesurent le taux de rotation. Ceux-ci sont particulièrement utiles pour stabiliser la conduite du robot ou pour mesurer le cap ou l'inclinaison en intégrant (additionnant) les mesures de vitesse pour obtenir une mesure du déplacement angulaire total.
tr_tr: Jiroskoplar (veya kısaca "jiroskoplar") dönme oranını ölçen cihazlardır. Bunlar özellikle robot sürüşünü stabilize etmek için veya toplam açısal yer değiştirme ölçümünü elde etmek için hız ölçümlerini entegre ederek (toplayarak) yönü veya eğimi ölçmek için kullanışlıdır.

source: Several popular FRC\ |reg| devices known as :ref:`IMUs <docs/hardware/sensors/accelerometers-hardware:IMUs (Inertial Measurement Units)>` (Inertial Measurement Units) combine 3-axis gyros, accelerometers and other position sensors into one device. Some popular examples are:
fr_ca: Plusieurs dispositifs populaires en FRC\ |reg| connus sous le nom de :ref:`IMUs <docs/hardware/sensors/accelerometers-hardware:IMUs (Inertial Measurement Units)>` (Inertial Measurement Units) combinent gyros à 3 axes, accéléromètres et autres capteurs de position en un seul appareil. Voici quelques exemples populaires :
tr_tr: :ref:`IMUlar <docs/hardware/sensors/accelerometers-hardware:IMUs (Inertial Measurement Units)>`(Atalet Ölçüm Birimleri) olarak bilinen birkaç popüler FRC\ |reg| cihazı, 3 eksenli jiroskopları, ivmeölçerleri ve diğer konum sensörlerini tek bir cihazda birleştirir. Bazı popüler örnekler şunlardır:

source: `Analog Devices ADIS16448 and ADIS 16470 IMUs <https://www.analog.com/en/landing-pages/001/first.html>`__
es_mx: `Dispositivos Análogos ADIS16448 and ADIS 16470 IMUs <https://www.analog.com/en/landing-pages/001/first.html>`__
fr_ca: `IMU Analog Devices ADIS16448 et ADIS 16470 <https://www.analog.com/en/landing-pages/001/first.html>`__
tr_tr: `Analog Devices ADIS16448 veADIS 16470 IMUs <https://www.analog.com/en/landing-pages/001/first.html>`__

source: Types of Gyros
es_mx: Tipos de Giroscopios
fr_ca: Types de gyroscopes
tr_tr: Gyro Türleri

source: There are two types of Gyros commonly-used in FRC: single-axis gyros, three-axis gyros and IMUs, which often include a 3-axis gyro.
es_mx: Existen dos tipos de giroscopios comúnmente usados en FRC; giroscopios de eje simple, giroscopios de 3 ejes y los IMUs, los cuales incluyen también giroscopios de 3 ejes.
fr_ca: Il existe deux types de gyroscopes couramment utilisés en FRC: les gyroscopes à axe unique, les gyroscopes à trois axes et les IMU, qui comprennent souvent un gyroscope à 3 axes.
tr_tr: FRC'de yaygın olarak kullanılan iki tür Gyro vardır: tek eksenli jiroskoplar, üç eksenli jiroskoplar ve genellikle 3 eksenli jiroskop içeren IMU'lar.

source: Single-axis Gyros
es_mx: Giroscopios de Eje Simple
fr_ca: Gyroscopes à axe unique
tr_tr: Tek eksenli Gyrolar

source: The Analog Devices 1-axis Gyro plugged into the SPI port of the roboRIO.
fr_ca: Le gyroscope 1 axe d’Analog Devices est branché sur le port SPI du roboRIO.

source: As per their name, single-axis gyros measure rotation rate around a single axis. This axis is generally specified on the physical device, and mounting the device in the proper orientation so that the desired axis is measured is highly important. Some single-axis gyros can output an analog voltage corresponding to the measured rate of rotation, and so connect to the roboRIO's :doc:`analog input <analog-inputs-hardware>` ports. Other single-axis gyros, such as as the `ADXRS450 <https://wiki.analog.com/first>`__ pictured above, use the :ref:`SPI port <docs/hardware/sensors/serial-buses:SPI>` on the roboRIO instead.
fr_ca: Selon leur nom, les gyroscopes à axe unique mesurent le taux de rotation autour d’un seul axe. Cet axe est généralement spécifié sur le dispositif physique, et le montage de l’appareil dans la bonne orientation, de telle sorte que l’axe désiré est mesuré, est très important. Certains gyroscopes à axe unique peuvent donner une tension analogique correspondant au taux de rotation mesuré, et ainsi se connecter aux ports :doc:`d’entrée analogiques <analog-inputs-hardware> ` du roboRIO. D’autres gyroscopes à axe unique, tels que le `ADXRS450 <https://wiki.analog.com/first>`__ sur la photo ci-dessus, utilisent plutôt le :ref:`port SPI <docs/hardware/sensors/serial-buses:SPI>` du roboRIO.

source: The `Analog Devices ADXRS450 FRC Gyro Board <https://www.analog.com/en/landing-pages/001/first.html>`__ that has been in FIRST Choice in recent years is a commonly used single axis gyro.
es_mx: El `Dispositivo Análogo ADXRS450 FRC Gyro Board <https://www.analog.com/en/landing-pages/001/first.html>`__ el cual ha estado en FIRST Choice en los años recientes es un giroscopio de eje simple usado comunmente.
fr_ca: Le module gyroscopique FRC `Analog Devices ADXRS450 <https://www.analog.com/en/landing-pages/001/first.html>`__ qui faisait partie de FIRST Choice ces dernières années est un gyroscope à axe unique couramment utilisé.
tr_tr: Son yıllarda FIRST Choice'de olan `Analog Devices ADXRS450 FRC Gyro Board <https://www.analog.com/en/landing-pages/001/first.html>`__, yaygın olarak kullanılan bir tek eksenli jiroskoptur.

source: Three-axis Gyros
es_mx: Giroscopio de 3 Ejes
fr_ca: Gyroscopes à trois axes
tr_tr: Üç eksenli Gyrolar

source: This is the L3GD20H 3-Axis Gyro plugged in to the I2C port.
fr_ca: Il s’agit du gyroscope 3 axes L3GD20H branché sur le port I2C.

source: Three-axis gyros measure rotation rate around all three spacial axes (typically labeled x, y, and z). The motion around these axis is called pitch, yaw, and roll.
es_mx: El giroscopio de 3 ejes mide la tasa de rotación alrededor de los 3 ejes espaciales (normalmente etiquetado como x, y, z). El movimiento alrededor de estos ejes se llama cabeceo, guiñada y alabeo.
fr_ca: Les gyroscopes à trois axes mesurent le taux de rotation autour des trois axes spatiaux (généralement étiquetés x, y et z). Le mouvement autour de ces axes est appelé tangage, lacet et roulis (ou respectivement pitch, yaw et roll en anglais).
tr_tr: Üç eksenli jiroskoplar, üç uzaysal eksenin (tipik olarak x, y ve z olarak etiketlenir) etrafındaki dönüş oranını ölçer. Bu eksen etrafındaki harekete, pitch-eğim, yaw-sapma ve roll-yuvarlanma denir.

source: The 3 axis: yaw, pitch, and roll and how they relate to robot movement.
fr_ca: Les 3 axes: lacet, tangage et roulis (respectivement yaw, pitch et roll) et la manière dont ils se rapportent au mouvement du robot.

source: The coordinate system shown above is often used for three axis gyros, as it is a convention in avionics. Note that other coordinate systems are used in mathematics and referenced throughout WPILib. Please refer to the :ref:`Drive class axis diagram<docs/software/hardware-apis/motors/wpi-drive-classes:Axis Conventions>` for axis referenced in software.
fr_ca: Le système de coordonnées illustré ci-dessus est souvent utilisé pour les gyroscopes à trois axes, car il s'agit d'une convention en avionique. Notez que d'autres systèmes de coordonnées sont utilisés en mathématiques et référencés dans WPILib. Veuillez vous référer au :ref:`diagramme suivant <docs/software/hardware-apis/motors/wpi-drive-classes:Axis Conventions>` pour les axes référencés dans le logiciel.

source: Peripheral three-axis gyros may simply output three analog voltages (and thus connect to the :ref:`analog input ports <docs/hardware/sensors/analog-inputs-hardware:Connecting a sensor to multiple analog input ports>`, or (more commonly) they may communicate with one of the roboRIO's :doc:`serial buses <serial-buses>`.
es_mx: El giroscopio periférico de 3 ejes simplemente puede emitir tres voltajes analógicos ( y así conectar al :ref:`analog input ports <docs/hardware/sensors/analog-inputs-hardware:Connecting a sensor to multiple analog input ports>`, o ( mas comúnmente) se pueden comunicar con uno de los :doc:`buses seriales <serial-buses>` del roboRIO.
fr_ca: Les gyroscopes périphériques à trois axes peuvent simplement produire trois tensions analogiques (et donc se connecter aux :ref:`ports d'entrée analogiques <docs/hardware/sensors/analog-inputs-hardware:Connecting a sensor to multiple analog input ports>`, ou ( plus communément) ils peuvent communiquer avec l'un des :doc:`bus série<serial-buses>` du roboRIO.
tr_tr: Çevresel üç eksenli jiroskoplar, basitçe üç analog voltaj çıkışı sağlayabilir (ve böylece :ref:`analog giriş portları <docs/hardware/sensors/analog-inputs-hardware:Connecting a sensor to multiple analog input ports>` bağlanabilir veya (daha yaygın olarak) roboRIO'nun :doc:`seri veri yollarından <serial-buses>` biriyle iletişim kurabilirler

source: This section covers gyro hardware. For a software guide to gyros, see :ref:`docs/software/sensors/gyros-software:Gyroscopes - Software`.
es_mx: Esta sección cubre el hardware del giroscopio. Para una guia del software para el giroscopio, ver :ref:`docs/software/sensors/gyros-software:Gyroscopes - Software`.

source: As per their name, single-axis gyros measure rotation rate around a single axis. This axis is generally specified on the physical device, and mounting the device in the proper orientation so that the desired axis is measured is highly important. Some single-axis gyros can output an analog voltage corresponding to the measured rate of rotation, and so connect to the roboRIO's :doc:`analog input <analog-inputs-hardware>` ports. Other single-axis gyros, such as as the `ADXRS450 <https://wiki.analog.com/first/first_robotics_donation_resources>`__ pictured above, use the :ref:`SPI port <docs/hardware/sensors/serial-buses:SPI>` on the roboRIO instead.
es_mx: Según su nombre, los giroscopios de eje simple mide la tasa de rotación sobre el eje simple. Este eje es generalmente especificado en los dispositivos físicos y en el montaje de los dispositivos en la orientación adecuada, por eso la medición de eje deseado es sumamente importante. Algunos giroscopios de eje simple pueden mandar un voltaje análogo correspondiente a la mediciones de la tasa de rotación y a si conectarse a la :doc:`analog input <analog-inputs-hardware>` del puerto de la roboRIO. Otros giroscopios de eje simple, tales como el `ADXRS450 <https://wiki.analog.com/first/first_robotics_donation_resources>`__ mostrado anteriormente, usa el ref:`SPI port <docs/hardware/sensors/serial-buses:SPI>` en vez del de la roboRIO.

source: The coordinate system shown above is often used for three axis gyros, as it is a convention in avionics. Note that other coordinate systems are used in mathematics and referenced throughout WPILib. Please refer to the :ref:`Drive class axis diagram<docs/software/actuators/wpi-drive-classes:Axis Conventions>` for axis referenced in software.
es_mx: El sistema de coordinadas mostrado arriba es a menudo usado por el giroscopio de 3 ejes, como una convención en aviónica. Tenga en cuenta que otros sistemas de coordenadas son usados en matemáticas y referenciados mediante WPILib. Por favor referirse al :ref:`Diagrama de ejes de Drive class <docs/software/actuators/wpi-drive-classes:Axis Conventions>` para ejes referenciados en software.
