Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/lidar.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: LIDAR - Hardware
fr_ca: Les capteurs de type LIDAR
tr_tr: LIDAR - Donanım
zh_cn: LIDAR - 硬件

source: LIDAR (light detection and ranging) sensors are a variety of rangefinder seeing increasing use in FRC\ |reg|.
es_mx: Los sensores LIDAR (detección y alcance de luz) son una variedad de telémetros que se usan cada vez más en FRC\ |reg|.
fr_ca: Les capteurs LIDAR (détection de lumière et de portée) sont une variété de télémètres qui connaissent une utilisation croissante en FRC\ |reg|.
tr_tr: LIDAR (ışık algılama ve menzil) sensörleri, FRC\ |reg|'de kullanımı artan telemetri sistemleridir.
zh_cn: LIDAR（light detection and ranging 光检测和测距）传感器是各种测距仪，在 FRC\ |reg|中的使用越来越多。

source: LIDAR sensors work quite similarly to :doc:`ultrasonics <ultrasonics-hardware>`, but use light instead of sound. A laser is pulsed, and the sensor measures the time until the pulse bounces back.
es_mx: Trabajan casi igual que los ultrasónicos :doc:`ultrasonics <ultrasonics-hardware>`, pero usan luz en vez de sonido. Al láser ser pulsado, el sensor mide el tiempo en que este rebota de regreso.
fr_ca: Les capteurs LIDAR fonctionnent de manière assez similaire aux :doc:`capteurs à ultrasons<ultrasonics-hardware>`, mais utilisent la lumière au lieu du son. Un laser est pulsé et le capteur mesure le temps nécessaire pour que l'impulsion rebondisse.
tr_tr: LIDAR sensörleri aşağıdakilere :doc:`ultrasonics <ultrasonics-hardware>` oldukça benzer şekilde çalışır ancak ses yerine ışığı kullanır. Bir lazer atımı olur ve sensör, darbenin geri dönmesine kadar geçen süreyi ölçer.
zh_cn: LIDAR传感器的工作原理与 :doc:`ultrasonics <ultrasonics-hardware>`类似，但使用光代替声音。脉冲激光，传感器测量直到脉冲回弹的时间。

source: Types of LIDAR
es_mx: Tipos de LIDAR
fr_ca: Types de LIDAR
tr_tr: LIDAR türleri
zh_cn: LIDAR的类型

source: There are two types of LIDAR sensors commonly used in current FRC: 1-dimensional LIDAR, and 2-dimensional LIDAR.
es_mx: Existen 2 tipos muy comúnmente usados en FRC: 1-LIDAR dimensional y 2-LIDAR dimensional.
fr_ca: Il existe deux types de capteurs LIDAR couramment utilisés dans les FRC actuels: le LIDAR à 1 dimension et le LIDAR à 2 dimensions.
tr_tr: Mevcut FRC'de yaygın olarak kullanılan iki tür LIDAR sensörü vardır: 1 boyutlu LIDAR ve 2 boyutlu LIDAR.
zh_cn: 当前FRC中通常使用两种类型的LIDAR传感器：1维LIDAR和2维LIDAR。

source: 1-Dimensional LIDAR
es_mx: LIDAR 1-Dimensión
fr_ca: LIDAR 1 dimension
tr_tr: 1 Boyutlu - 1 Dimentional LIDAR
zh_cn: 1维LIDAR

source: Garmin LIDAR-Lite a 1D LIDAR device.
fr_ca: Périphérique LIDAR-Lite Garmin un LIDAR 1D.

source: A 1-dimensional (1D) LIDAR sensor works much like an ultrasonic sensor - it measures the distance to the nearest object more or less along a line in front of it. 1D LIDAR sensors can often be more-reliable than ultrasonics, as they have narrower "beam profiles" and are less susceptible to interference. Pictured above is the `Garmin LIDAR-Lite Optical Distance Sensor <https://www.andymark.com/products/lidar-lite-3>`__.
es_mx: Estos sensores (1D) trabajan como un sensor ultrasónico - mide la distancia del objeto mas cercano mas o menos a lo largo de una línea en frente de este. Estos sensores llegan a ser más confiables que los ultrasónicos ya que son menos propensos a interferencia y tienen unos perfiles de viga más estrechos. La fotografía mostrada arriba es el Sensor de Distancia Óptica Garmin LIDAR-Lite <https://www.andymark.com/products/lidar-lite-3>`__.
fr_ca: Un capteur LIDAR unidimensionnel (1D) fonctionne un peu comme un capteur à ultrasons - il mesure la distance à l'objet le plus proche le long d'une ligne devant lui. Les capteurs LIDAR 1D peuvent souvent être plus fiables que les ultrasons, car ils ont des «profils de faisceau» plus étroits et sont moins sensibles aux interférences. Sur la photo ci-dessus, le `Capteur de distance optique Garmin LIDAR-Lite <https://www.andymark.com/products/lidar-lite-3>`__.
tr_tr: 1 boyutlu (1D) bir LIDAR sensörü, ultrasonik sensör gibi çalışır - en yakın nesneye olan mesafeyi, doğrusal bir çizgi boyunca ölçer. 1D LIDAR sensörleri, daha dar "ışın profillerine" sahip olduklarından ve parazitte daha az duyarlı olduklarından, genellikle ultrasonik sensörlerden daha güvenilirlerdir. Yukarıdaki resimde `Garmin LIDAR-Lite Optik Mesafe Sensorü <https://www.andymark.com/products/lidar-lite-3>`__ görülmektedir.
zh_cn: 一维（1D）LIDAR传感器的工作原理与超声传感器非常相似-它沿其前面的一条线或多或少地测量到最近物体的距离。一维LIDAR传感器通常比超声波更可靠，因为它们的“光束轮廓”更窄并且不易受到干扰。上图是`Garmin LIDAR-Lite Optical Distance Sensor <https://www.andymark.com/products/lidar-lite-3>`__。

source: 1D LIDAR sensors generally output an analog voltage proportional to the measured distance, and thus connect to the roboRIO's :doc:`analog input <analog-inputs-hardware>` ports or to one of the :doc:`roboRIO's serial buses <serial-buses>`.
es_mx: También, estos sensores 1D generalmente sacan un voltaje análogo proporcional a la distancia de la medida, para así ser conectado al puerto de entrada análoga de la roboRIO :doc:`analog input <analog-inputs-hardware>` o a unos de los buses seriales de la roboRIO :doc:`roboRIO's serial buses <serial-buses>`.
fr_ca: Les capteurs 1D LIDAR génèrent normalement une tension analogique proportionnelle à la distance mesurée et se connectent ainsi aux ports :doc:`d'entrée analogiques<analog-inputs-hardware>` du roboRIO ou ceux qui ont un port série à l'un des :doc:`bus série du roboRIO<serial-buses>`.
tr_tr: 1D LIDAR sensörleri genellikle ölçülen mesafeye orantılı bir analog voltaj çıkarır ve böylece roboRIO'ların :doc:`analog input <analog-inputs-hardware>` bağlantı noktalarına veya :doc:`roboRIO seri iletişim portlarından<serial-buses>` birine bağlanır.
zh_cn: 1维LIDAR传感器通常输出与所测距离成比例的模拟电压，因此连接到roboRIO的:doc:`analog input <analog-inputs-hardware>` 端口或者 :doc:`roboRIO's serial buses <serial-buses>`的其中一个。

source: 2-Dimensional LIDAR
es_mx: LIDAR 2-Dimensiones
fr_ca: LIDAR bidimensionnel
tr_tr: 2 Boyutlu LIDAR
zh_cn: 2维LIDAR

source: RPLIDAR pictured is one option for 2D LIDAR
fr_ca: RPLIDAR illustré est une option pour le LIDAR 2D

source: A 2-dimensional (2D) LIDAR sensor measures distance in all directions in a plane. Generally, this is accomplished (more-or-less) by simply placing a 1D LIDAR sensor on a turntable that spins at a constant rate.
es_mx: Estos sensores (2D) miden distancias a todas direcciones sobre un plano. Generalmente esto es logrado (más o menos) simplemente colocando un 1D LIDAR en una placa giratoria que gira a una cierta velocidad.
fr_ca: Un capteur LIDAR bidimensionnel (2D) mesure la distance dans toutes les directions dans un plan. Généralement, ceci est réalisé (plus ou moins) en plaçant simplement un capteur LIDAR 1D sur une plaque tournante qui tourne à une vitesse constante.
tr_tr: 2 boyutlu (2D) bir LIDAR sensörü, bir düzlemdeki tüm yönlerdeki mesafeyi ölçer. Genel olarak bu işlem ( kabaca ), sabit bir hızda dönen döner tablaya 1D LIDAR sensörü yerleştirilerek gerçekleştirilir.
zh_cn: 2维（2D）LIDAR传感器可测量平面上所有方向的距离。通常，这可以通过将1维LIDAR传感器简单地放置在以恒定速度旋转的转盘上（或多或少）来实现。

source: Since, by nature, 2D LIDAR sensors need to send a large amount of data back to the roboRIO, they almost always connect to one of the roboRIO's :doc:`serial buses <serial-buses>`.
es_mx: Desde que los sensores de la 2D LIDAR naturalmente necesitan mandar una gran cantidad de información a la roboRIO, este se conecta al menos a uno de los buses seriales de la roboRIO :doc:`serial buses <serial-buses>`.
fr_ca: Étant donné que, par nature, les capteurs LIDAR 2D doivent renvoyer une grande quantité de données au roboRIO, ils se connectent presque toujours à l'un des :doc:`bus série<serial-buses>` du roboRIO.
tr_tr: Doğası gereği, 2D LIDAR sensörlerinin büyük miktarda veriyi roboRIO'ya geri göndermesi gerektiğinden, neredeyse her zaman roboRIO'nun :doc:`seri veri yollarından<serial-buses>` birine direkt bağlanırlar .
zh_cn: 由于2D LIDAR传感器本质上需要将大量数据发送回roboRIO，因此它们几乎总是连接到roboRIO的其中一个 :doc:`serial buses <serial-buses>`。

source: Caveats
es_mx: Advertencias
fr_ca: Avertissements
tr_tr: Uyarılar
zh_cn: 注意事项

source: LIDAR sensors do suffer from a few common drawbacks:
es_mx: Los sensores LIDAR sufren de algunos inconvenientes comunes:
fr_ca: Les capteurs LIDAR souffrent de quelques inconvénients courants:
tr_tr: LIDAR sensörlerinin birkaç yaygın dezavantajı vardır:
zh_cn: LIDAR传感器确实有一些常见的缺点：

source: Like ultrasonics, LIDAR relies on the reflection of the emitted pulse back to the sensor. Thus, LIDAR critically depends on the reflectivity of the material in the wavelength of the laser. The FRC field wall is made of polycarbonate, which tends to be transparent in the infrared wavelength (which is what is generally legal for FRC use). Thus, LIDAR tends to struggle to detect the field barrier.
es_mx: Igual que los ultrasónicos, estos se basan en la reflexión emitida con el pulso que regresa al sensor. Así que los LIDAR dependen fuertemente en la reflexión del material en la longitud de onda del láser. La barrera de la cancha de FRC es hecha de policarbonato, la cual tiende a ser transparente en la longitud de onda infrarroja (la cual es generalmente legal para el uso en FRC). Así, las LIDAR tienden a batallar para detectar la barrera de la cancha.
fr_ca: Comme les ultrasons, le LIDAR se fie sur la réflexion de l'impulsion émise vers le capteur. Ainsi, le LIDAR dépend de manière critique de la réflectivité du matériau dans la longueur d'onde du laser. La paroi de champ FRC est en polycarbonate (qui est parfaitement légal pour une utilisation FRC), cependant, ce matériau a tendance à être transparent dans la longueur d'onde infrarouge . Ainsi, le capteur LIDAR a de la difficulté à détecter la barrière du terrain de jeu.
tr_tr: Ultrasonik olanlar gibi, LIDAR da yayılan darbenin sensöre geri yansıması mantığına dayanır. Bu nedenle, LIDAR kritik olarak lazerin dalga boyundaki malzemenin yansıtıcılığına bağlıdır. FRC saha duvarları, kızılötesi dalga boyunda şeffaf olma eğiliminde olan polikarbonattan yapılmıştır (bu, genellikle FRC kullanımı için yasaldır). Bu nedenle, LIDAR saha duvarlarını tespit etmekde zorlanma eğilimindedir.
zh_cn: 像超声波一样，激光雷达依靠发射的脉冲反射回传感器。因此，激光雷达关键取决于材料在激光波长中的反射率。 FRC场墙由聚碳酸酯制成，在红外波长下它往往是透明的（这在FRC的使用中通常是合法的）。因此，LIDAR往往难以检测到场障。

source: 2D LIDAR sensors (at the price range legal for FRC use) tend to be quite noisy, and processing their measured data (known as a "point cloud") can involve a lot of complex software. Additionally, there are very few 2D LIDAR sensors made specifically for FRC, so software support tends to be scarce.
es_mx: Los sensores 2D LIDAR (en el rango de precio legal para el uso en FRC) tienden a ser un poco ruidosos y el proceso de medición de la información (conocido como “punto de nube”) puede estar envuelto en un software muy complejo. Adicionalmente, existen muy pocos sensores 2D LIDAR echos especialmente para FRC, así que el soporte del software tiende a ser escaso.
fr_ca: Les capteurs 2D LIDAR (dans la fourchette de prix légale pour une utilisation FRC) ont tendance à être assez flous et le traitement de leurs données mesurées (connu sous le nom de "nuage de points") peut impliquer beaucoup de logiciels complexes. De plus, il existe très peu de capteurs LIDAR 2D spécialement conçus pour FRC, de sorte que le support logiciel a tendance à être rare.
tr_tr: 2D LIDAR sensörleri (FRC kullanımı için yasal fiyat aralığında) oldukça gürültülü olma eğilimindedir ve ölçülen verilerinin işlenmesi ("nokta bulutu" olarak bilinir) çok sayıda karmaşık yazılımdan faydalanır. Ek olarak, özellikle FRC için yapılmış çok az sayıda 2D LIDAR sensörü vardır, bu nedenle yazılım desteği az olma eğilimindedir.
zh_cn: 2D LIDAR传感器（在FRC使用的合法价格范围内）往往噪声很大，处理其测量数据（称为“点云”）可能涉及许多复杂软件。此外，专门为FRC制造的2D LIDAR传感器很少，因此软件支持趋于匮乏。

source: As 2D LIDAR sensors rely on a turntable to work, their update rate is limited by the rate at which the turntable spins. For sensors in the price range legal for FRC, this often means that they do not update their values particularly quickly, which can be a limitation when the robot (or the targets) are moving.
es_mx: Como los sensores 2D LIDAR dependen de un plato giratorio para trabajar, las velocidades son limitadas a la velocidad por la que gira el plato giratorio. Por sensores que se encuentran en el rango de precios legal en FRC, esto también significa que no se podrán actualizar los valores particularmente rápido, el cual puede ser una limitación cuando el robot (o el objetivo) está en movimiento.
fr_ca: Comme les capteurs 2D LIDAR reposent sur une platine (table tournante) pour fonctionner, leur taux de mise à jour est limité par la vitesse à laquelle la platine tourne. Pour les capteurs dans la gamme de prix légale pour FRC, cela signifie souvent que la mise à jour des données est lente, ce qui peut limiter la capacité de détecter des cibles lorsque le robot se déplace rapidement.
tr_tr: 2D LIDAR sensörleri çalışmak için bir döner tablaya bağlı olduğundan, veri güncelleme hızları, döner tablanın dönme hızıyla sınırlıdır. FRC için yasal fiyat aralığındaki sensörler için, bu genellikle değerlerini özellikle hızlı bir şekilde güncellemedikleri anlamına gelir; bu, robot (veya hedefler) hareket ederken bir sınırlama olabilir.
zh_cn: 由于2D LIDAR传感器依靠转盘工作，因此其更新速度受到转盘旋转速度的限制。对于FRC合法价格范围内的传感器，这通常意味着它们不会特别快地更新其值，这在机器人（或目标）移动时可能会受到限制。

source: Additionally, as 2D LIDAR sensors are limited in *angular* resolution, the *spatial* resolution of the point cloud is worse when targets are further away.
es_mx: Adicionalmente , como los sensores 2D LIDAR son limitados en su resolución angular, la resolución espacial del punto de nube es peor cuando el objetivo se encuentra lejos.
fr_ca: De plus, comme les capteurs LIDAR 2D sont limités en résolution *angulaire*, la résolution *spatiale* du nuage de points est pire lorsque les cibles sont plus éloignées.
tr_tr: Ek olarak, 2D LIDAR sensörleri *açısal* çözünürlükle sınırlı olduğundan nokta bulutunun *uzamsal* çözünürlüğü, hedefler daha uzaktayken daha kötüdür.
zh_cn: 此外，由于2维LIDAR传感器的*角度*分辨率受到限制，所以当目标距离较远时，点云的*空间*分辨率会变差。
