Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/proximity-switches.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Photoelectric proximity switches are another type of no-contact proximity switch in widespread use in FRC. Photoelectric proximity switches contain a light source (usually an IR laser) and a photoelectric sensor that activates the switch when the detected light (which bounces off of the sensor target) exceeds a given threshold. One such sensor is the `IR Obstacle Avoidance Module <https://www.electrodragon.com/product/infraredir-obstacle-avoidance-sensor-moduleadjust-distance/>`__ pictured below.
es_mx: Los interruptor de proximidad fotoeléctrica son otro tipo de switch de proximidad de no contacto de uso extendido en FRC. Los interruptores de proximidad fotoeléctrica contienen una fuente de luz (normalmente un láser IR) y un sensor fotoeléctrico que activa el switch cuando la luz detectada (el cual rebota del sensor de objetivo) excede el límite dado. Uno de esos sensores es el `IR Obstacle Avoidance Module <https://www.electrodragon.com/product/infraredir-obstacle-avoidance-sensor-moduleadjust-distance/>`__ mostrado abajo.
fr_ca: Les interrupteurs de proximité photoélectriques sont un autre type de commutateur de proximité sans contact largement utilisé en FRC. Ces derniers contiennent une source de lumière (généralement un laser infrarouge) et un capteur photoélectrique qui active l'interrupteur lorsque la lumière détectée (qui rebondit sur la cible du capteur) dépasse un seuil donné. L'un de ces capteurs est le `Module IR d'évitement d'obstacles <https://www.electrodragon.com/product/infraredir-obstacle-avoidance-sensor-moduleadjust-distance/>`__ illustré ci-dessous.
tr_tr: Fotoelektrik yakınlık anahtarları, FRC'de yaygın olarak kullanılan bir başka temassız yakınlık anahtarı türüdür. Fotoelektrik yaklaşım anahtarları, bir ışık kaynağı (genellikle bir IR lazer) ve algılanan ışık (sensör hedefinden seken) belirli bir eşiği aştığında anahtarı etkinleştiren bir fotoelektrik sensör içerir. Böyle bir sensör, aşağıda gösterilen `IR Engel Önleme Modülü <https://www.electrodragon.com/product/infraredir-obstacle-avoidance-sensor-moduleadjust-distance/>`__ 'dir.
zh_cn: 光电接近开关是在FRC中广泛使用的另一种非接触式接近开关。光电接近开关包含一个光源（通常为IR激光）和一个光电传感器，当检测到的光（从传感器目标反射回来）超过给定阈值时，光电传感器将激活该开关。一种这样的传感器是下图中的`IR Obstacle Avoidance Module <https://www.electrodragon.com/product/infraredir-obstacle-avoidance-sensor-moduleadjust-distance/>`__。

source: Since photoelectric proximity switches rely on measuring the amount of reflected light, they are often inconsistent in their triggering range between different materials - accordingly, most photoelectric sensors have an adjustable activation point (typically controller by turning a screw somewhere on the sensor body). On the other hand, photoelectric sensors are also extremely versatile, as they can detect a greater variety of objects than the other types of no-contact switches.
es_mx: Ya que los interruptores de proximidad fotoeléctrica dependen de medida la cantidad de luz reflejada, a menudo son inconsistentes en sus rangos de activación entre diferentes materiales - en consecuencia, la mayoría de sensores fotoeléctricos tienen un punto de activación ajustable (normalmente controlado por el giro de un tornillo en algún lugar del sensor del cuerpo). En la otra mano, los sensores fotoeléctricos son también extremadamente versátiles, ya que pueden detectar una gran variedad de objetos que los otros tipos de interruptores de no contacto.
fr_ca: Étant donné que les interrupteurs de proximité photoélectriques mesurent la quantité de lumière réfléchie, leur plage de déclenchement est souvent incohérente entre différents matériaux - en conséquence, la plupart des interrupteurs photoélectriques ont un point d'activation réglable (généralement le contrôleur en tournant une vis quelque part sur le corps du capteur). D'autre part, les interrupteurs photoélectriques sont également extrêmement polyvalents, car ils peuvent détecter une plus grande variété d'objets que les autres types de commutateurs sans contact.
tr_tr: Fotoelektrik yakınlık anahtarları yansıyan ışık miktarını ölçmeye dayandığından, farklı malzemeler arasındaki tetikleme aralıklarında genellikle tutarsızdırlar - buna göre, çoğu fotoelektrik sensör ayarlanabilir bir çalışma noktasına sahiptir (tipik olarak sensör gövdesi üzerinde bir yerde bir vidayı döndürerek ayarlanır). Öte yandan, fotoelektrik sensörler, diğer temassız anahtar türlerinden çok daha çeşitli nesneleri algılayabildikleri için son derece çok yönlüdür.
zh_cn: 由于光电接近开关依赖于测量反射光的量，因此它们在不同材料之间的触发范围通常不一致-因此，大多数光电传感器具有可调的激活点（通常通过旋转传感器主体上的某个螺钉来进行控制）。另一方面，光电传感器的用途也非常广泛，因为与其他类型的非接触式开关相比，它们可以检测更多种类的物体。

source: Photoelectric sensors are also often often used in a "beam break" configuration, in which the emitter is separate from the sensor. These typically activate when an object is interposed between the emitter and the sensor. Pictured above is a `beam break sensor with an IR LED transmitter and IR receiver <https://www.adafruit.com/product/2167>`__.
es_mx: Los sensores fotoeléctricos también son a menudo usados en una configuración "beam break", en donde el emisor es separado del sensor. Estos normalmente se activan cuando un objeto es interpuesto entre el emisor y el sensor. La fotografía mostrada arriba es un `sensor beam break con un transmisor IR LED y un recibidor IR <https://www.adafruit.com/product/2167>`__.
fr_ca: Les interrupteurs photoélectriques sont également utilisés dans une configuration de "rupture de faisceau", dans laquelle l'émetteur est séparé du capteur. Ceux-ci s'activent généralement lorsqu'un objet est interposé entre l'émetteur et le capteur. Sur la photo ci-dessus est un `capteur de rupture de faisceau avec un émetteur IR LED et un récepteur IR <https://www.adafruit.com/product/2167>`__.
tr_tr: Fotoelektrik sensörler genellikle, yayıcının sensörden ayrı olduğu bir "ışın kırılması" konfigürasyonunda sıklıkla kullanılır. Bunlar tipik olarak, ışık yayıcı ve sensör arasına bir nesne girdiğinde etkinleşir. Yukarıdaki resimde bir `IR LED vericisi ve IR alıcısı ışın kesme <https://www.adafruit.com/product/2167> `__ sensörü gösterilmektedir.
zh_cn: 光电传感器也经常经常以“光束中断”配置使用，其中发射器与传感器分离。通常在将物体插入发射器和传感器之间时激活它们。上图是一个 `beam break sensor with an IR LED transmitter and IR receiver <https://www.adafruit.com/product/2167>`__。

source: Connecting a beam break receiver and transmitter each to one DIO channel on the roboRIO.
fr_ca: Connexion d’un récepteur optique et d’un émetteur optique chacun à un port DIO sur le roboRIO.

source: Time-of-flight Proximity Switches
es_mx: Interruptores de Proximidad de Tiempo de Vuelo
fr_ca: Interrupteurs de proximité à temps de vol
tr_tr: Uçuş Süresi -Time-of-flight Yakınlık Anahtarları
zh_cn: 飞行时间接近开关

source: VL53L0X time of flight sensor hooked up to the I2C port.
fr_ca: Capteur de temps de vol VL53L0X connecté au port I2C.

source: Time-of-flight Proximity Switches are newer to the market and are not commonly found in FRC. They use a concentrated light source, such as a small laser, and measure the time between the emission of light and when the receiver detects it. Using the speed of light, it can produce a very accurate distance measurement for a very small target area. Range on this type of sensor can range greatly, between 30mm to around 1000mm for the `VL53L0X sensor <https://www.adafruit.com/product/3317>`__ pictured above. There are also longer range version available. More information about time of flight sensors can be found in `this article <https://learn.adafruit.com/adafruit-vl53l0x-micro-lidar-distance-sensor-breakout>`__ and more about the circuitry can be found in `this article <https://www.allaboutcircuits.com/technical-articles/how-do-time-of-flight-sensors-work-pmdtechnologies-tof-3D-camera/>`__.
es_mx: Los interruptores de proximidad de tiempo de vuelo son nuevos en el mercado y no son comúnmente encontrados en FRC. Usa un a fuente concentrada de luz, como un pequeño láser, y mide el tiempo entre la emisión de luz y cuando el receptor la detecta. Usando la velocidad de la luz puede producir una distancia muy precisa para una pequeña área objetivo. El rango de estos sensores ronda entre los 30mm y cerca de los 1000mm para el ` sensor VL53L0X <https://www.adafruit.com/product/3317>` mostrado anteriormente. Igualmente contiene una versión de rango largo. Mas información sobre los sensores de tiempo de vuelo se puede encontrar en `este artículo <https://learn.adafruit.com/adafruit-vl53l0x-micro-lidar-distance-sensor-breakout>`__ y mas información sobre el circuito es puede encontrar en `este artículo <https://www.allaboutcircuits.com/technical-articles/how-do-time-of-flight-sensors-work-pmdtechnologies-tof-3D-camera/>`__.
fr_ca: Les commutateurs de proximité à temps de vol sont de conception plus récentes, et on les retrouve moins dans FRC. Ils utilisent une source de lumière concentrée, comme un mini-laser, et mesurent le temps entre l'émission de lumière et le moment où le récepteur la détecte. En utilisant la vitesse de la lumière comme référence, ils peuvent ainsi calculer la distance parcourue et effectuer une mesure de distance très précise pour une très petite zone cible. La portée de ce type de capteur peut varier considérablement, entre 30 mm et environ 1000 mm pour le `capteur VL53L0X <https://www.adafruit.com/product/3317>`__ illustré ci-dessus. Il existe également une version à plus longue portée. Vous trouverez plus d'informations sur les capteurs de temps de vol dans `cet article <https://learn.adafruit.com/adafruit-vl53l0x-micro-lidar-distance-sensor-breakout>`__ et plus sur les circuits dans `cet article <https://www.allaboutcircuits.com/technical-articles/how-do-time-of-flight-sensors-work-pmdtechnologies-tof-3D-camera/>`__.
tr_tr: Uçuş Süresi Yakınlık Anahtarları pazarda daha yenidir ve FRC'de yaygın olarak bulunmaz. Küçük bir lazer gibi konsantre bir ışık kaynağı kullanırlar ve ışık emisyonu ile alıcının onu algılaması arasındaki süreyi ölçer. Işık hızını kullanarak, çok küçük bir hedef alan için çok hassas bir mesafe ölçümü üretebilir. Bu tip sensördeki menzil, yukarıda gösterilen `VL53L0X sensör <https://www.adafruit.com/product/3317>`__ için 30 mm ile yaklaşık 1000 mm arasında değişebilir. Daha uzun menzilli versiyon da mevcuttur. Uçuş süresi sensörleri ile ilgili daha fazla bilgiyi `bu makale <https://learn.adafruit.com/adafruit-vl53l0x-micro-lidar-distance-sensor-breakout>`__ 'de bulabilirsiniz ve devre şeması hakkında daha fazla bilgiyi `bu makale <https://www.allaboutcircuits.com/technical-articles/how-do-time-of-flight-sensors-work-pmdtechnologies-tof-3D-camera/>`__ 'de bulabilirsiniz.
zh_cn: 飞行时间接近开关是较新的市场产品，在FRC中并不常见。他们使用诸如小激光之类的集中光源，并测量从发射光到接收器检测到光之间的时间。利用光速，它可以在很小的目标区域上进行非常精确的距离测量。这种类型的传感器的测距范围可以很大，上图的`VL53L0X sensor <https://www.adafruit.com/product/3317>`__为30mm至1000mm左右。也有更长距离的版本。有关飞行时间传感器的更多信息，请参见 `this article <https://learn.adafruit.com/adafruit-vl53l0x-micro-lidar-distance-sensor-breakout>`__ 有关该电路的更多信息，请参见 `this article <https://www.allaboutcircuits.com/technical-articles/how-do-time-of-flight-sensors-work-pmdtechnologies-tof-3D-camera/>`__。

source: This section covers proximity switch hardware. For a guide to using proximity switches in software, see :ref:`docs/software/sensors/digital-inputs-software:Digital Inputs - Software`.
tr_tr: Bu bölüm yakınlık anahtarı donanımını kapsar. Yazılımda yakınlık anahtarlarının kullanımına ilişkin bir kılavuz için bkz :ref:`docs/software/sensors/digital-inputs-software:Digital Inputs - Software`.
zh_cn: 本节介绍了接近开关的硬件。有关在软件中使用接近开关的指南，请参见:ref:`docs/software/sensors/digital-inputs-software:Digital Inputs - Software`。

source: See this :ref:`article <docs/software/sensors/limit-switch:Programming Limit Switches>` for writing the software for Limit Switches.
zh_cn: 查看:ref:`article <docs/software/sensors/limit-switch:Programming Limit Switches>` 用于帮助编写限位开关的软件。

source: Proximity switches can be either "normally-open," in which activating the switch closes the circuit, or "normally closed," in which activating the switch opens the circuit. Some switches offer *both* a NO and a NC circuit connected to the same switch. In practice, the effective difference between a NO and a NC switch is the behavior of the system in the case that the wiring to the switch fails, as a wiring failure will almost always result in an open circuit. NO switches are often "safer," in that a wiring failure causes the system to behave as if the switch were pressed - as switches are often used to prevent a mechanism from damaging itself, this mitigates the chance of damage to the mechanism in the case of a wiring fault.
tr_tr: Yakınlık anahtarları, anahtarın çalıştırılması ile devreyi kapattığı "normalde açık" veya anahtarın çalıştırışmasıyla devreyi açtığı "normalde kapalı" olabilir. Bazı anahtarlar, hem bir NO-normally open hem de aynı anahtara bağlı bir NC-normally closed devresi sunar. Pratikte, bir NO ve bir NC anahtarı arasındaki fark, bir kablolama arızası hemen hemen her zaman bir açık devreye neden olacağından, anahtara giden kablolamanın başarısız olması durumunda sistemin davranışıdır. NO anahtarları genellikle daha güvenlidir, çünkü bir kablo arızası sistemin anahtara basılmış gibi davranmasına neden olur - anahtarlar genellikle bir mekanizmanın kendisine zarar vermesini önlemek için kullanıldığından, bu durumda mekanizmanın hasar görme olasılığını azaltır.

source: Types of proximity switches
tr_tr: Yakınlık Anahtarı Türleri

source: Mechanical proximity switches (more commonly known as "limit switches") are probably the most-commonly used proximity switch in FRC, due to their simplicity, ease-of-use, and low cost. A limit switch is quite simply a switch attached to a mechanical arm. The switch is activated when an object pushes against the switch arm, actuating the switch.
tr_tr: Mekanik yaklaşım anahtarları (daha yaygın olarak "limit anahtarları" olarak bilinir), basitlikleri, kullanım kolaylıkları ve düşük maliyetleri nedeniyle muhtemelen FRC'de en yaygın kullanılan yaklaşım anahtarıdır. Limit anahtarı, mekanik bir kola bağlı bir anahtardır. Anahtar, bir nesne anahtar kolunu itip anahtarı çalıştırdığında etkinleştirilir.

source: There are two major types of magnetic proximity switches - reed switches and hall-effect sensors. In a reed switch, the magnetic field causes a pair of flexible metal contacts (the "reeds") to touch each other, closing the circuit. A hall-effect sensor, on the other hand, detects the induced voltage transversely across a current-carrying conductor. Hall-effect sensors are generally the cheaper and more-reliable of the two. Pictured above is the `Hall effect sensor from West Coast Products <https://www.wcproducts.com/wcp-0971>`__.
tr_tr: İki ana manyetik yakınlık anahtarı türü vardır - kamış anahtarları ve salon etkisi sensörleri. Manyetik bir anahtarda, manyetik alan bir çift esnek metal kontağın ("kamışlar") birbirine dokunarak devreyi kapatmasına neden olur. Öte yandan, bir salon etkisi sensörü, akım taşıyan bir iletken boyunca indüklenen gerilimi enlemesine algılar. Hall etkisi sensörleri genellikle ikisinden daha ucuz ve daha güvenilirdir. Yukarıdaki resimde, `West Coast firmanının Hall effect sensor <https://www.wcproducts.com/wcp-0971>`__ Hall etkisi sensörü görülmektedir.
