Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/proximity-switches.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Proximity Switches - Hardware
es_mx: Interruptores de proximidad: hardware
fr_ca: Commutateurs de proximité
tr_tr: Yakınlık-Proximity Anahtarları - Donanım
zh_cn: 接近开关-硬件

source: This section covers proximity switch hardware. For a guide to using proximity switches in software, see :ref:`docs/software/hardware-apis/sensors/digital-inputs-software:Digital Inputs - Software`.
fr_ca: Cette section couvre les dispositifs de détection de proximité. Pour un guide d'utilisation des détecteurs de proximité dans le logiciel, voir :ref:`docs/software/hardware-apis/sensors/digital-inputs-software:Digital Inputs - Software`.

source: One of the most common sensing tasks on a robot is detecting when an object (be it a mechanism, game piece, or field element) is within a certain distance of a known point on the robot. This type of sensing is accomplished by a "proximity switch."
es_mx: Una de las tareas de detección más comunes en un robot es detectar cuando un objeto (ya sea un mecanismo, una pieza de juego o un elemento de campo) se encuentra a una cierta distancia de un punto conocido del robot. Este tipo de detección se logra mediante un "interruptor de proximidad".
fr_ca: L'une des tâches les plus courantes sur un robot consiste à détecter lorsqu'un objet (qu'il s'agisse d'un mécanisme, d'une pièce de jeu ou d'un élément de terrain) se trouve à une certaine distance d'un point connu du robot. Ce type de détection est accompli par un "commutateur de proximité".
tr_tr: Bir robot üzerindeki en yaygın algılama görevlerinden biri, bir nesnenin (bir mekanizma, oyun parçası veya saha öğesi) robot üzerinde bilinen bir noktaya belirli bir mesafe içinde olup olmadığını algılamaktır. Bu tür bir algılama, "yakınlık anahtarı" ile gerçekleştirilir.
zh_cn: 机器人上最常见的传感任务之一是检测物体（无论是机制，游戏块还是场地元素）何时在机器人上已知点的一定距离内。这种类型的感测是通过“接近开关”完成的。

source: Proximity switch operation
es_mx: Operación del interruptor de proximidad
fr_ca: Fonctionnement du commutateur de proximité
tr_tr: Yakınlık anahtarı çalışması
zh_cn: 接近开关操作

source: Proximity switches are switches - they operate a circuit between an "open" state (in which there *is not* connectivity across the circuit) and a "closed" one (in which there *is*). Thus, proximity switches generate a digital signal, and accordingly, they are almost always connected to the roboRIO's :doc:`digital input <digital-inputs-hardware>` ports.
es_mx: Los interruptores de proximidad son interruptores: operan un circuito entre un estado "abierto" (en el que *no hay* conectividad a través del circuito) y uno "cerrado" (en el que *hay*). Por lo tanto, los interruptores de proximidad generan una señal digital y, en consecuencia, casi siempre están conectados a los puertos :doc:`digital input <digital-inputs-hardware>` del roboRIO.
fr_ca: Les commutateurs de proximité sont comme des interrupteurs - ils font fonctionner un circuit entre un état "ouvert" (dans lequel il n'y a *pas* de connectivité à travers le circuit) et un circuit "fermé" (dans lequel il y en *a*) . Ainsi, les détecteurs de proximité génèrent un signal numérique et, par conséquent, ils sont presque toujours connectés aux ports d' :doc:`entrées numériques<digital-inputs-hardware>` du roboRIO.
tr_tr: Yakınlık anahtarları switch-anahtardır - "açık" durum (devre boyunca *bağlantının olmadığı *) ve "kapalı" bir (devrede *bağlantı olduğu*) nu belirtir. Bu nedenle, yakınlık anahtarları dijital bir sinyal üretir ve buna göre neredeyse her zaman roboRIO'ların:doc:`digital giriş <digital-inputs-hardware>` bağlantı noktalarına bağlanırlar.
zh_cn: 接近开关是开关-它们在“断开”状态（电路中没有连接）和“闭合”状态（其中有*）之间操作电路。因此，接近开关会产生数字信号，因此，它们几乎总是连接到roboRIO的:doc:`digital input <digital-inputs-hardware>` 端口。

source: Proximity switches can be either "normally-open," in which activating the switch closes the circuit, or "normally closed," in which activating the switch opens the circuit. Some switches offer *both* a NO and a NC circuit connected to the same switch. In practice, the effective difference between a NO and a NC switch is the behavior of the system in the case that the wiring to the switch fails, as a wiring failure will almost always result in an open circuit. NC switches are often "safer," in that a wiring failure causes the system to behave as if the switch were pressed - as switches are often used to prevent a mechanism from damaging itself, this mitigates the chance of damage to the mechanism in the case of a wiring fault.
es_mx: Los interruptores de proximidad pueden ser ya sea "abiertos normalmente", en el que al activar el interruptor se cierra el circuito, o "cerrados normalmente", en el que al activar el interruptor se abre el circuito. Algunos interruptores ofrecen ambos los AB y los CN circuito conectado al mismo interruptor. En la práctica, la diferencia efectiva entre un AB y los CN interruptor es el comportamiento del sistema en caso en que el cableado del interruptor falle, ya que un fallo en el cableado casi siempre provocará un circuito abierto. Los interruptores AB suelen ser "más seguros", ya que un fallo en el cableado hace que el sistema se comporte como si el interruptor estuviera presionado - como los interruptores se utilizan a menudo para evitar que un mecanismo se dañe a sí mismo, esto mitiga la posibilidad de que se dañe el mecanismo en el caso de un fallo de cableado.
fr_ca: Les interrupteurs de proximité peuvent être soit "normalement ouverts ou NO", dans ces interrupteurs l’activation de l’interrupteur ferme le circuit, soit "normalement fermés ou NC", dans ce cas l’activation de l’interrupteur ouvre le circuit. Certains commutateurs offrent *à la fois* un circuit NO et NC relié au même interrupteur. Dans la pratique, la différence effective entre un interrupteur de type NO et un interrupteur de type NC est le comportement du système dans le cas où le câblage de l’interrupteur présence une défaillance, car une défaillance du câblage entraînera presque toujours un circuit ouvert. Les interrupteurs de type NC sont souvent "plus sûrs", en ce sens qu’une défaillance du câblage fait en sorte que le système se comporte comme si l’interrupteur était appuyé - puisque les interrupteurs sont souvent utilisés pour empêcher un mécanisme de s’endommager, ce qui atténue les risques de dommages au mécanisme en cas de défaillance du câblage.
zh_cn: 接近开关可以是“常开”，其中激活开关可以使电路闭合；也可以是“常开”，其中激活开关可以使电路断开。某些开关*同时提供* NO和连接到同一开关的NC电路。实际上，在常开和常闭开关之间的有效区别是在到开关的接线失败的情况下系统的行为，因为接线故障几乎总是会导致开路。 NC开关通常是“更安全的”，因为布线故障会导致系统像按下开关一样工作-因为经常使用开关来防止机械装置自身损坏，因此在这种情况下，可以减轻机械装置损坏的机会接线故障。

source: The digital inputs on the roboRIO have pull-up resistors that will make the input be high (1 value) when the switch is open, but when the switch closes the value goes to 0 since the input is now connected to ground.
es_mx: Las entradas digitales en el roboRIO tienen resistencias pull-up que harán que la entrada sea alta (valor 1) cuando el interruptor está abierto, pero cuando el interruptor se cierra, el valor pasa a 0 ya que la entrada ahora está conectada a tierra.
fr_ca: Les entrées numériques sur le roboRIO ont des résistances pull-up qui feront monter l’entrée au niveau haut (ce qui correspond à la valeur 1) lorsque le commutateur est ouvert, mais lorsque le commutateur se ferme la valeur passe à 0 puisque l’entrée est maintenant connectée à la masse.
zh_cn: roboRIO上的数字输入具有上拉电阻，当开关断开时，上拉电阻会使输入为高（1值），但是当开关闭合时，该值将变为0，因为现在输入已接地。

source: Types of Proximity Switches
es_mx: Tipos de interruptores de proximidad
fr_ca: Types de commutateurs de proximité
zh_cn: 接近开关的种类

source: There are several types of proximity switches that are commonly-used in FRC\ |reg|:
es_mx: Hay varios tipos de interruptores de proximidad que se utilizan comúnmente en FRC\ |reg|:
fr_ca: Il existe plusieurs types de détecteurs de proximité qui sont couramment utilisés en FRC\ |reg|:
tr_tr: FRC\ |reg|'de yaygın olarak kullanılan birkaç tür yakınlık anahtarı vardır:
zh_cn: FRC\|reg|中通常使用几种类型的接近开关：

source: `Mechanical Proximity Switches ("limit switches")`_
es_mx: `Interruptores mecánicos de proximidad ("interruptores de límite")` _
fr_ca: `Interrupteurs de proximité mécaniques ("interrupteurs de fin de course")`_
tr_tr: `Mekanik Yakınlık Anahtarları ("limit anahtarları")`_
zh_cn: 机械接近开关（“限位开关”）_

source: `Magnetic Proximity Switches`_
es_mx: `Interruptores de proximidad magnéticos`_
fr_ca: `Interrupteurs de proximité magnétiques`_
tr_tr: `Manyetik Yakınlık Anahtarları`_
zh_cn: `磁性接近开关`_

source: `Inductive Proximity Switches`_
es_mx: ʻInterruptores de proximidad inductivos`_
fr_ca: `Interrupteurs de proximité inductifs`_
tr_tr: `Endüktif Yakınlık Anahtarları`_
zh_cn: `感应接近开关`_

source: `Photoelectric Proximity Switches`_
es_mx: `Interruptores de proximidad fotoeléctricos`_
fr_ca: `Interrupteurs de proximité photoélectriques`_
tr_tr: `Fotoelektrik Yakınlık Anahtarları`_
zh_cn: `光电接近开关`_

source: `Time-of-flight Proximity Switches`_
es_mx: `Interruptores de proximidad de tiempo de vuelo`_
fr_ca: `Interrupteurs de proximité dans le temps de vol`_
tr_tr: `Uçuş Süresi Yakınlık Anahtarları`_
zh_cn: 飞行时间接近开关_

source: Mechanical Proximity Switches ("limit switches")
es_mx: Interruptor de Proximidad Mecánica ("Interruptor de Límite")
fr_ca: Interrupteurs de proximité mécaniques («interrupteurs de fin de course»)
tr_tr: Mekanik Yakınlık Anahtarları ("limit anahtarları")
zh_cn: 机械接近开关（“限位开关”）

source: A normally open limit switch connected to a channel of the roboRIO DIO.
fr_ca: Un interrupteur de fin de course normalement ouvert connecté à un port DIO du roboRIO.

source: Mechanical proximity switches (more commonly known as "limit switches") are probably the most-commonly used proximity switch in FRC, due to their simplicity, ease-of-use, and low cost. A limit switch is quite simply a switch attached to a mechanical arm, usually at the limits of travel. The switch is activated when an object pushes against the switch arm, actuating the switch.
es_mx: Los interruptores mecánicos de proximidad (más comúnmente conocidos como "limit switches") son probablemente los interruptores de proximidad más utilizados en FRC, debido a su simplicidad, facilidad de uso y su bajo costo. Un limit switch es simplemente un interruptor unido a un brazo mecánico, normalmente en los límites del recorrido. El interruptor es activado cuando un objeto empuja contra el brazo mecánico, accionando el interruptor.
fr_ca: Les interrupteurs de proximité mécaniques (plus communément appelés "interrupteurs de fin de course") sont probablement l’interrupteur de proximité le plus couramment utilisé en FRC, en raison de leur simplicité, leur facilité d’utilisation et de leur faible coût. Un interrupteur de fin de course est tout simplement un interrupteur attaché à un bras mécanique, généralement aux limites de la course du bras. Monté sur le bras, l'interrupteur de fin de course est activé lorsqu'il touche un objet présent sur le trajet du bras.
zh_cn: 机械接近开关（更通常称为“限位开关”）由于其简单，易用且成本低廉，可能是FRC中最常用的接近开关。限位开关非常简单，通常是在行程极限处，它是连接到机械臂的开关。当物体推到开关臂上时，该开关被激活，从而启动该开关。

source: Limit switches vary in size, the geometry of the switch-arm, and in the amount of "throw" required to activate the switch. While limit switches are quite cheap, their mechanical actuation is sometimes less-reliable than no-contact alternatives. However, they are also extremely versatile, as they can be triggered by any physical object capable of moving the switch arm.
es_mx: Los interruptores de límite varían en tamaño, la geometría de del **interruptor-brazo**, y en la cantidad de “fuerza” requerida para activar el interruptor. Mientras los interruptores de límite son más baratos, la actuación mecánica es por lo regular menos confiable que las alternativas sin contacto. Sin embargo, también son extremadamente versátiles, tanto que pueden ser **activadas** por cualquier objeto físico capaz de mover el brazo del interruptor.
fr_ca: Les interrupteurs de fin de course varient en taille, en géométrie (relativement au bras de commutation) et au déplacement requis pour activer l'interrupteur. Bien que les interrupteurs de fin de course soient assez bon marché, leur implémentation mécanique dans un robot est parfois moins fiable que les alternatives sans contact. Cependant, ils sont extrêmement polyvalents, car ils peuvent être déclenchés par tout objet physique capable de déplacer le bras de commutation.
tr_tr: Limit anahtarlarının boyutu, anahtar kolunun geometrisi ve anahtarı etkinleştirmek için gereken "itiş" miktarı değişir. Limit anahtarları oldukça ucuz olsa da, mekanik çalıştırma bazen temassız alternatiflere göre daha az güvenilirdir. Bununla birlikte, anahtar kolunu hareket ettirebilen herhangi bir fiziksel nesne tarafından tetiklenebildikleri için son derece fazla kullanım alanı bulurlar.
zh_cn: 限位开关的大小，开关臂的几何形状以及激活开关所需的“投掷”量各不相同。尽管限位开关非常便宜，但其机械致动有时不如无触点替代品可靠。但是，它们也具有极强的通用性，因为它们可以由能够移动开关臂的任何物理物体触发。

source: See this :ref:`article <docs/software/hardware-apis/sensors/limit-switch:Programming Limit Switches>` for writing the software for Limit Switches.
fr_ca: Voir cet :ref:`article <docs/software/hardware-apis/sensors/limit-switch:Programming Limit Switches>` pour écrire le logiciel pour les interrupteurs de fin de course.

source: Magnetic Proximity Switches
es_mx: Interruptor de Proximidad Magnética
fr_ca: Interrupteurs de proximité magnétiques
tr_tr: Manyetik Yakınlık Anahtarları
zh_cn: 磁性接近开关

source: A magnetic proximity switch hooked up to a DIO channel of the roboRIO.
fr_ca: Un commutateur de proximité magnétique connecté à un port DIO du roboRIO.

source: Magnetic proximity switches are activated when a magnet comes within a certain range of the sensor. Accordingly, they are "no-contact" switches - they do not require contact with the object being sensed.
es_mx: Los interruptores de proximidad magnética son activados cuando un imán se acerca a un cierto rango del sensor. En resultado, son interruptores de no contacto - no requieren contacto con el objeto detectado.
fr_ca: Les interrupteurs de proximité magnétiques sont activés lorsqu'un aimant se trouve dans une certaine plage du capteur. En conséquence, ce sont des commutateurs "sans contact" - ils ne nécessitent pas de contact avec l'objet détecté.
tr_tr: Manyetik yakınlık anahtarları, sensörün belirli bir mesafesine bir mıknatıs yaklaştığında etkinleşir. Buna göre, "temassız" anahtarlardır - algılanan nesne ile temas gerektirmezler.
zh_cn: 当磁铁进入传感器的特定范围内时，将激活磁性接近开关。因此，它们是“非接触式”开关-它们不需要与被感测的物体接触。

source: There are two major types of magnetic proximity switches - reed switches and hall-effect sensors. In a reed switch, the magnetic field causes a pair of flexible metal contacts (the "reeds") to touch each other, closing the circuit. A hall-effect sensor, on the other hand, detects the induced voltage transversely across a current-carrying conductor. Hall-effect sensors are generally the cheaper and more-reliable of the two. Pictured above is the `Hall effect sensor from West Coast Products <https://wcproducts.com/products/wcp-sensors>`__.
fr_ca: Il existe deux principaux types d’interrupteurs de proximité magnétique - les interrupteurs Reed et les capteurs à effet Hall. Dans un interrupteur Reed, un champ magnétique crée une paire de contacts métalliques flexibles (les "reeds") qui, en se touchant, ferment un circuit électrique. Un capteur à effet Hall, quant à lui, détecte la tension induite transversalement à travers un conducteur parcouru par un courant électrique. De ces deux types d'interrupteurs, les capteurs à effet Hall sont généralement les moins chers et les plus fiables. Sur la photo ci-dessus vous pouvez voir `un capteur à effet Hall produit par West Coast Products <https://wcproducts.com/products/wcp-sensors>`__.
zh_cn: 磁性接近开关主要有两种类型：磁簧开关和霍尔效应传感器。在簧片开关中，磁场使一对柔性金属触点（“簧片”）彼此接触，从而闭合电路。另一方面，霍尔效应传感器检测跨载流导体横向产生的感应电压。霍尔效应传感器通常是两者中更便宜，更可靠的。上图是“西海岸产品<https://wcproducts.com/products/wcp-sensors>`__的霍尔效应传感器。

source: Magnetic proximity switches may be either "unipolar," "bipolar," or "omnipolar." A unipolar switch activates and deactivates depending on the presence of a given pole of the magnet (either north or south, depending on the switch). A bipolar switch activates from the proximity of one pole, and deactivates from the proximity of the opposite pole. An omnipolar switch will activate in the presence of either pole, and deactivates when no magnet is present.
es_mx: Los interruptores de proximidad magnética podrían ser unipolar," "bipolar," or "omnipolar." Un interruptor unipolar se activa y desactiva dependiendo de la presencia del polo magnético otorgado (ya sea norte o sur, dependiendo del interruptor). Un interruptor bipolar se activa desde la proximidad de un solo polo y se desactiva con la proximidad del polo opuesto. Un interruptor omnipolar se activará con la presencia de cualquier polo y se desactiva cuando la presencia del imán desaparece.
fr_ca: Les détecteurs de proximité magnétiques peuvent être "unipolaires", "bipolaires" ou "omnipolaires". Un interrupteur unipolaire s'active et se désactive en fonction de la présence d'un pôle donné de l'aimant (soit le Nord ou le Sud, selon le détecteur). Un interrupteur bipolaire s'active à partir de la proximité d'un pôle et se désactive lorsque le pôle opposé est présenté. Un interrupteur omnipolaire s'activera en présence de l'un ou l'autre des pôles et se désactivera en l'absence d'aimant.
tr_tr: Manyetik yakınlık anahtarları "tek kutuplu-unipolar", "iki kutuplu-bipolar" veya "omnipolar" olabilir. Tek kutuplu bir anahtar, mıknatısın belirli bir kutbunun varlığına bağlı olarak etkinleştirilir ve devre dışı bırakılır (anahtara bağlı olarak mıknatısın N- kuzey veya S- güney kutpu). İki kutuplu bir anahtar, bir kutbun yakınlığından harekete geçer ve karşı kutbun yakınlığından devre dışı kalır. Omnipolar anahtarlar da her iki kutbun varlığında etkinleşir ve mıknatıs olmadığında devre dışı kalır.
zh_cn: 磁性接近开关可以是“单极”，“双极”或“全极”。单极开关根据磁铁的给定磁极的存在（根据开关的不同，是南极还是北极）来激活和停用。双极开关从一个极的附近激活，而从相对极的附近去激活。全极性开关将在任一极存在时激活，并在没有磁体的情况下禁用。

source: While magnetic proximity switches are often more reliable than their mechanical counterparts, they require the user to mount a magnet on the object to be sensed - thus, they are mostly used for sensing mechanism location.
es_mx: Mientras los interruptores de proximidad magnética son más confiables que sus contra partes mecánicas, requieren al usuario para montar un imán en el objeto para ser detectado - así son principalmente usados para detectar la ubicación de un mecanismo.
fr_ca: Bien que les détecteurs de proximité magnétiques soient souvent plus fiables que leurs homologues mécaniques, ils nécessitent que l'utilisateur monte un aimant sur l'objet à détecter - ils sont donc principalement utilisés pour détecter le positionnement d'un mécanisme intégré au robot.
tr_tr: Manyetik yakınlık anahtarları genellikle mekanik benzerlerinden daha güvenilir olsa da, kullanıcının algılanacak nesneye bir mıknatıs monte etmesini gerektirir - bu nedenle, çoğunlukla mekanizma konumunu algılamak için kullanılırlar.
zh_cn: 尽管磁性接近开关通常比机械接近开关更可靠，但是它们要求用户将磁体安装在要感测的物体上-因此，它们大多用于感测机构的位置。

source: Inductive Proximity Switches
es_mx: Interruptores de Proximidad Inductiva
fr_ca: Interrupteurs de proximité inductifs
tr_tr: Endüktif Yakınlık Anahtarları
zh_cn: 电感式接近开关

source: Example industrial inductive proximity switch.
fr_ca: Exemple d'un commutateur de proximité inductif industriel.

source: Inductive proximity switches are activated when a conductor of any sort comes within a certain range of the sensor. Like magnetic proximity switches, they are "no-contact" switches.
es_mx: Los interruptores de proximidad inductiva son activados cuando un conductor de cualquier tipo es dentro de un cierto rango del sensor. Como los interruptores de proximidad magnética, son interruptores de no contacto.
fr_ca: Les interrupteurs de proximité inductifs sont activés lorsqu'un matériau conducteur se trouve dans une certaine plage du capteur. Tout comme les interrupteurs magnétiques de proximité, ce sont des détecteurs «sans contact».
tr_tr: Endüktif yakınlık anahtarları, herhangi bir tür iletken sensörün belirli bir aralığına geldiğinde etkinleşir. Manyetik yakınlık anahtarları gibi, bunlar "temassız" anahtarlardır.
zh_cn: 当任何类型的导体进入传感器的特定范围内时，感应式接近开关就会激活。像磁性接近开关一样，它们是“无触点”开关。

source: Inductive proximity switches are used for many of the same purposes as magnetic proximity switches. Their more-general nature (activating in the presence of any conductor, rather than just a magnet) can be either a help or a hindrance, depending on the nature of the application.
es_mx: Los interruptores de proximidad inductiva son usados por algunos de los mismos propósitos que los switches de proximidad magnética. Su naturaleza más general (activándose en la presencia de cualquier conductor, en vez que solo un imán) puede ser una ayuda o un obstáculo, dependiendo de la naturaleza de la aplicación.
fr_ca: Les interrupteurs de proximité inductifs sont utilisés à de nombreuses fins identiques aux interrupteurs de proximité magnétiques. Leur nature plus générale (s'activant en présence de tout conducteur, plutôt que d'un simple aimant) peut être un avantage, ou un inconvéniant, selon la nature de l'application.
tr_tr: Endüktif yaklaşım anahtarları, manyetik yakınlık anahtarları ile aynı amaçların çoğu için uyumludur. Daha genel yapıları nedeniyle (sadece bir mıknatıs yerine herhangi bir iletkenin mevcudiyetinde aktif hale gelmeleri), uygulamanın doğasına bağlı olarak yardım veya engel teşgil edebilir.
zh_cn: 电感式接近开关用于许多与磁性接近开关相同的目的。根据应用的性质，它们的更一般的性质（在任何导体而不是仅在磁体的存在下激活）可以是帮助或阻碍。

source: Photoelectric Proximity Switches
es_mx: Interruptores de Proximidad Fotoeléctrica
fr_ca: Interrupteurs de proximité photoélectriques
tr_tr: Fotoelektrik-Photoelectric Yakınlık Anahtarları
zh_cn: 光电接近开关

source: Connecting a photoelectric proximity switch to a DIO port.
fr_ca: Connexion d’un commutateur de proximité photoélectrique à un port DIO.
