Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/serial-buses.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Serial Buses
es_mx: Buses seriales
fr_ca: Bus Séries
tr_tr: Seri Veri Yolları
zh_cn: 串行总线

source: In addition to the :doc:`digital <digital-inputs-hardware>` and :doc:`analog <analog-inputs-hardware>` inputs, the roboRIO also offers several methods of serial communication with peripheral devices.
es_mx: En adición a las entradas digitales :doc:`digital <digital-inputs-hardware>` y análogas :doc:`analog <analog-inputs-hardware>`, la roboRIO también ofrece varios métodos de comunicación en serie con dispositivos periféricos.
fr_ca: En plus des entrées :doc:`numériques <digital-inputs-hardware>` et :doc:`analogiques <analog-inputs-hardware>`, le roboRIO fournit aussi plusieurs méthodes de communication série avec des appareils périphérique.
tr_tr: RoboRIO, :doc:`digital <digital-inputs-hardware>` ve :doc:`analog <analog-inputs-hardware>` girişlerine ek olarak, çevre aygıtlarıyla çeşitli seri iletişim yöntemleri de sunar.
zh_cn: 除了:doc:`digital <digital-inputs-hardware>` 和 :doc:`analog <analog-inputs-hardware>`作为输入，roboRIO还提供了几种与外围设备进行串行通信的方法。

source: Both the digital and analog inputs are highly limited in the amount of data that can be sent over them. Serial buses allow users to make use of far more-robust and higher-bandwidth communications protocols with sensors that collect large amounts of data, such as inertial measurement units (IMUs) or 2D LIDAR sensors.
fr_ca: Les entrées numériques et analogiques sont très limitées avec la quantité de données qu'elles peuvent transmettre. Les bus série permettent l'usage de protocoles de communication beaucoup plus robustes et à plus large bande passante avec des senseurs qui collectent un grand nombre de données, commes des Unités de Mesure Inertielle (IMUs) ou des détecteurs LiDAR 2D.

source: Types of supported serial buses
es_mx: Tipos de buses seriales soportados
fr_ca: Types de bus série supportés.
tr_tr: Desteklenen seri veri yolu türleri
zh_cn: 支持的串行总线类型

source: The roboRIO supports many basic types of serial communications:
es_mx: La roboRio soporta varios tipos de comunicaciones en serie:
fr_ca: Le roboRIO supporte plusieurs protocoles de communications série:
tr_tr: RoboRIO, birçok temel seri iletişim türünü destekler:
zh_cn: roboRIO支持许多基本类型的串行通信：

source: `CAN Bus`_
fr_ca: `Bus CAN`_

source: Additionally, the roboRIO supports communications with peripheral devices over the :term:`CAN` bus. However, as the FRC\ |reg| CAN protocol is quite idiosyncratic, relatively few peripheral sensors support it (though it is heavily used for motor controllers).
fr_ca: De plus, le roboRIO prend en charge les communications avec les périphériques via le bus :term:`CAN`. Cependant, comme le FRC\ |reg| Le protocole CAN est assez idiosyncratique, relativement peu de capteurs périphériques le prennent en charge (bien qu'il soit largement utilisé pour les contrôleurs de moteur).

source: The I2C port on the roboRIO.
fr_ca: Le port I2C sur le roboRIO.

source: I2C roboRIO port pin specifications.
fr_ca: Spécifications de la broche I2C du roboRIO.

source: To communicate to peripheral devices over :term:`I2C`, each pin should be wired to its corresponding pin on the device. I2C allows users to wire a "chain" of slave devices to a single port, so long as those devices have separate IDs set.
fr_ca: Pour communiquer avec des périphériques via :term:`I2C`, chaque broche doit être connectée à sa broche correspondante sur l'appareil. I2C permet aux utilisateurs de câbler une « chaîne » d'appareils esclaves à un seul port, à condition que ces appareils aient des identifiants distincts.

source: The I2C bus can also be used through the `MXP expansion port`_. The I2C bus on the :term:`MXP` is independent. For example, a device on the main bus can have the same ID as a device on the MXP bus.
fr_ca: Le bus I2C peut également être utilisé via le « port d'extension MXP »_. Le bus I2C sur le :term:`MXP` est indépendant. Par exemple, un appareil sur le bus principal peut avoir le même ID qu'un appareil sur le bus MXP.

source: Be sure to familiarize yourself on the following known issue before using the onboard I2C port: :ref:`docs/yearly-overview/known-issues:Onboard I2C Causing System Lockups`
fr_ca: Assurez-vous de vous familiariser avec le problème connu suivant avant d'utiliser le port I2C intégré : :ref:`docs/yearly-overview/known-issues:I2C intégré provoquant des blocages du système`

source: Show the SPI port on the roboRIO.
fr_ca: Affiche le port SPI du roboRIO.

source: SPI roboRIO port pin specifications.
fr_ca: Spécifications de la broche SPI du roboRIO.

source: To communicate to peripheral devices over :term:`SPI`, each pin should be wired to its corresponding pin on the device. The SPI port supports communications to up to four devices (corresponding to the Chip Select (CS) 0-3 pins on the diagram above).
fr_ca: Pour communiquer avec des périphériques via :term:`SPI`, chaque broche doit être connectée à sa broche correspondante sur l'appareil. Le port SPI prend en charge les communications avec jusqu'à quatre appareils (correspondant aux broches Chip Select (CS) 0-3 sur le schéma ci-dessus).

source: The SPI bus can also be used through the `MXP expansion port`_. The MXP port provides independent clock, and input/output lines and an additional CS.
es_mx: El bus SPI también puede ser usado mediante `MXP expansion port`_. El puerto MXP proporciona un reloj independiente y líneas de entrada/salida y un CS adicional.
fr_ca: Le bus SPI peut aussi être utilisé via le `port d'expansion MXP`_. Le port MXP fournit une horloge indépendante (CLK), et des lignes d'entrée/sortie (MISO et MOSI) et un CS supplémentaire.
tr_tr: SPI veriyolu ayrıca `MXP expansion port`_ aracılığıyla da kullanılabilir. MXP bağlantı noktası, bağımsız saat ve giriş / çıkış hatları ve ek bir CS sağlar.
zh_cn: SPI总线也可以通过 `MXP expansion port`_使用。 MXP端口提供独立的时钟，输入/输出线和一个附加的CS。

source: Location of the RS-232 port on the roboRIO.
fr_ca: Emplacement du port RS-232 sur le roboRIO.

source: roboRIO RS-232 port pin specifications.
fr_ca: Spécifications de la broche RS-232 du roboRIO.

source: To communicate to peripheral devices over RS-232, each pin should be wired to its corresponding pin on the device.
es_mx: Para comunicar con los dispositivos periféricos sobre el RS-232, cada pin debe ser cableado con su correspondiente pin en el dispositivo.
fr_ca: Pour communiquer aux dispositifs périphériques via RS-232, chaque broche doit être reliée à la broche correspondante sur le dispositif. Faire attention au sens de la transmission, quelquefois le signal RX doit être relié au TX et vice-versa.
tr_tr: Çevresel cihazlarla RS-232 üzerinden iletişim kurmak için, her bir pinin cihaz üzerindeki ilgili pimine bağlanması gerekir.
zh_cn: 要通过RS-232与外围设备通信，应将每个引脚连接到设备上相应的引脚。

source: The RS-232 bus can also be used through the `MXP expansion port`_.
es_mx: El bus RS-232 también puede ser usado mediante el puerto de expansión MXP `MXP expansion port`_.
fr_ca: Le bus RS-232 peut aussi être utilisé via le `port d'expansion MXP`_.
tr_tr: RS-232 veri yolu aynı zamanda MXP expansion port`_ aracılığıyla da kullanılabilir.
zh_cn: RS-232总线也可以通过`MXP expansion port`_使用。

source: The roboRIO RS-232 serial port uses RS-232 signaling levels (+/- 15v). The MXP serial port uses CMOS signaling levels (+/- 3.3v).
fr_ca: Le port série RS-232 du roboRIO utilise les niveaux de signalisation RS-232 (+/- 15 Volts). le port série du MXP utilise les niveaux de signalisation CMOS (+/- 3.3 Volts).

source: By default, the onboard RS-232 port is utilized by the roboRIO's serial console. In order to use it for an external device, the serial console must be disabled using the :ref:`Imaging Tool <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO 1>` or :ref:`docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard`.
fr_ca: Par défaut, le port RS-232 intégré est utilisé par la console série du roboRIO. Afin de l'utiliser pour un périphérique externe, la console série doit être désactivée et pour ce faire consultez la section :ref:`Installation de l’image dans votre roboRIO <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO 1>` ou la section :ref:`docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard`.

source: USB Client
fr_ca: Client USB

source: One of the USB ports on the roboRIO is a USB-B, or USB client port. This can be connected to devices, such as a Driver Station computer, with a standard USB cable.
es_mx: Uno de los puertos USB de la roboRIO es un USB-B o un puerto de cliente USB. Este puede ser conectado a dispositivos, tales como la Driver Station con un cable USB estándar.
fr_ca: L'un des ports USB du roboRIO est un port client USB-B ou USB. Celui-ci peut être connecté à des appareils, tels qu'un ordinateur Driver Station, avec un câble USB standard.
tr_tr: RoboRIO'daki USB bağlantı noktalarından biri USB-B veya USB bağlantı noktasıdır. Bu, standart bir USB kablosuyla Driver Station bilgisayarı gibi cihazlara bağlanabilir.
zh_cn: roboRIO上的USB端口之一是USB-B或USB客户端端口。可以使用标准USB电缆将其连接到设备，例如Driver Station计算机。

source: Location of the two USB ports on the roboRIO at top center.
fr_ca: Emplacement des deux ports USB sur le roboRIO en haut au centre.

source: Two of the USB ports on the roboRIO is a USB-A, or USB host port. These can be connected to devices, such as cameras or sensors, with a standard USB cable.
es_mx: Dos de los puertos USB de la roboRIO es un USB-A o un puerto USB Host. Este puede ser conectado a diferentes dispositivos, tales como cámaras o sensores usando un cable USB estándar.
fr_ca: Deux des ports USB du roboRIO sont un port hôte USB-A ou USB. Ceux-ci peuvent être connectés à des dispositifs, tels que des caméras ou des capteurs, avec un câble USB standard.
tr_tr: RoboRIO'daki USB bağlantı noktalarından ikisi bir USB-A veya USB host bağlantı noktasıdır. Bunlar kameralar veya sensörler gibi cihazlara standart bir USB kablosuyla bağlanabilir.
zh_cn: roboRIO上的两个USB端口是USB-A或USB主机端口。可以使用例如相机或传感器的标准USB线将它们连接到设备。

source: MXP Expansion Port
es_mx: Puerto de expansión MXP
fr_ca: Port d'extension MXP
tr_tr: MXP Expansion Port - MXP Genişleme Portu
zh_cn: MXP扩展端口

source: Location of the MXP port on the roboRIO directly above the NI logo.
fr_ca: Emplacement du port MXP sur le roboRIO directement au-dessus du logo NI.

source: MXP pinout.
fr_ca: Brochage MXP

source: Several of the serial buses are also available for use through the roboRIO's :term:`MXP` Expansion Port. This port allows users to make use of many additional :doc:`digital <digital-inputs-hardware>` and :doc:`analog <analog-inputs-hardware>` inputs, as well as the various serial buses.
fr_ca: Plusieurs bus série sont également disponibles pour une utilisation via le port d'extension :term:`MXP` du roboRIO. Ce port permet aux utilisateurs d'utiliser de nombreuses entrées supplémentaires :doc:`digital <digital-inputs-hardware>` et :doc:`analog <analog-inputs-hardware>`, ainsi que les différents bus série.

source: Many peripheral devices attach directly to the MXP port for convenience, requiring no wiring on the part of the user.
es_mx: Algunos dispositivos periféricos se adjuntan directamente al puerto MXP por conveniencia, no requieren cableado por parte del usuario.
fr_ca: De nombreux périphériques se connectent directement au port MXP pour plus de commodité, ne nécessitant aucun câblage de la part de l'utilisateur.
tr_tr: Birçok çevresel aygıt, kullanıcı tarafından herhangi bir kablolama gerektirmeden, rahatlıkla doğrudan MXP bağlantı noktasına bağlanır.
zh_cn: 为了方便起见，许多外围设备都直接连接到MXP端口，不需要用户进行任何接线。

source: CAN Bus
es_mx: Bus CAN
fr_ca: Bus CAN
tr_tr: CAN Bus Veri Yolu
zh_cn: CAN总线

source: Show the location of the CAN bus terminals in the top left corner of the roboRIO.
fr_ca: Indique l’emplacement des terminaux bus CAN dans le coin supérieur gauche du roboRIO.

source: Additionally, the roboRIO supports communications with peripheral devices over the CAN bus. However, as the FRC CAN protocol is quite idiosyncratic, relatively few peripheral sensors support it (though it is heavily used for motor controllers). One of the advantages of using the CAN bus protocol is that devices can be daisy-chained, as shown below. If power is removed from any device in the chain, data signals will still be able to reach all devices in the chain.
es_mx: Adicionalmente la roboRIO soporta comunicaciones con dispositivos periféricos sobre el Bus CAN. Sin embargo como el protocolo CAN de FRC es bastante peculiar, relativamente algunos sensores periféricos lo soportan (aunque es más pesado usarlo para controles de motor). Una de las ventajas de usar el protocolo Bus CAN es que los dispositivos pueden ser encadenados, como se muestra arriba. Si la energía es removida de algún dispositivo en la cadena, las señales de información seguirán disponibles seguirán disponibles para llegar a todos los dispositivos de la cadena.
fr_ca: De plus, le roboRIO prend en charge les communications avec les périphériques via le bus CAN. Cependant, comme le protocole FRC CAN est assez particulier, relativement peu de capteurs périphériques le prennent en charge (bien qu'il soit largement utilisé pour les contrôleurs de moteur). L'un des avantages de l'utilisation du protocole de bus CAN est que les périphériques peuvent être connectés en "guirlande", ou "daisy-chain", comme illustré ci-dessous. Si l'alimentation est coupée de n'importe quel dispositif situé sur la chaîne, les signaux de données pourront toujours continuer de circuler sur la chaîne.
tr_tr: Ek olarak roboRIO, CAN veriyolu üzerinden çevresel cihazlarla iletişimi destekler. Bununla birlikte, FRC CAN protokolü oldukça kendine özgü olduğundan, nispeten az sayıda çevresel sensör onu desteklemektedir (ancak motor kontrolörleri için yoğun bir şekilde kullanılmaktadır). CAN veri yolu protokolünü kullanmanın avantajlarından biri, cihazların aşağıda gösterildiği gibi zincirleme bağlanabilmesidir. Zincirdeki herhangi bir aygıttan güç kesilirse, veri sinyalleri yine de zincirdeki tüm aygıtlara erişebilir.
zh_cn: 此外，roboRIO支持通过CAN总线与外围设备进行通信。但是，由于FRC CAN协议非常特殊，因此很少有外围传感器支持该协议（尽管它广泛用于电机控制器）。使用CAN总线协议的优点之一是可以采用菊花链方式连接设备，如下所示。如果断开链中任何设备的电源，数据信号仍将能够到达链中的所有设备。

source: A CAN bus topology between motor controllers.
fr_ca: Topologie du bus CAN entre les différents contrôleurs de moteur.

source: Several sensors primarily use the CAN bus. Some examples include:
es_mx: Algunos sensores son usados primordialmente por el bus CAN. Algunos ejemplos son:
fr_ca: Plusieurs capteurs utilisent principalement le bus CAN. Quelques exemples:
tr_tr: Bir çok sensör öncelikle CAN veriyolunu kullanır. Bazı örnekler şunları içerir:
zh_cn: 几个CAN主要使用的传感器。一些示例包括：

source: `CAN Based Time-of-Flight Range/Distance Sensor from playingwithfusion.com <https://www.playingwithfusion.com/productview.php?pdid=96&catid=1009>`__
es_mx: CAN basado en el rango de tiempo de vuelo/ sensor de distancia de playingwithfusion.com <https://www.playingwithfusion.com/productview.php?pdid=96&catid=1009>`__
fr_ca: `Capteur de distance/distance basé sur le temps de vol CAN de playwithfusion.com <https://www.playingwithfusion.com/productview.php?pdid=96&catid=1009>`__
tr_tr: `Playwithfusion.com'dan CAN Tabanlı Uçuş Süresi / Mesafe Sensörü <https://www.playingwithfusion.com/productview.php?pdid=96&catid=1009>`__

source: TalonSRX-based sensors, such as the `Gadgeteer Pigeon IMU <https://store.ctr-electronics.com/gadgeteer-pigeon-imu/>`__ and the `SRX MAG Encoder <https://store.ctr-electronics.com/srx-mag-encoder/>`__
fr_ca: Capteurs basés sur TalonSRX, tels que le `Gadgeteer Pigeon IMU <https://store.ctr-electronics.com/gadgeteer-pigeon-imu/>`__ et l’encodeur `SRX MAG Encoder <https://store.ctr-electronics.com/srx-mag-encoder/>`__

source: Power monitoring sensors built into the :ref:`CTRE Power Distribution Panel (PDP) <docs/controls-overviews/control-system-hardware:CTRE Power Distribution Panel>` and the :ref:`REV Power Distribution Hub (PDH) <docs/controls-overviews/control-system-hardware:REV Power Distribution Hub>`
fr_ca: Capteurs de surveillance de puissance intégrés dans le :ref:`Panneau de distribution de puissance CTRE (PDP) <docs/controls-overviews/control-system-hardware:CTRE Power Distribution Panel>` et le :ref:`Concentrateur de distribution de puissance REV (PDH) <docs/controls-overviews/control-system-hardware:REV Power Distribution Hub>`

source: More information about using devices connected to the CAN bus can be found in the article about :ref:`using can devices <docs/software/can-devices/using-can-devices:Using CAN Devices>`.
es_mx: Más información sobre cómo usar dispositivos conectados al Bus CAN, Ver :ref:`using can devices <docs/software/can-devices/using-can-devices:Using CAN Devices>`.
fr_ca: Pour plus d'informations sur l'utilisation des périphériques connectés au bus CAN, référez-vous à l'article sur l'utilisation des :ref:`dispositifs CAN <docs/software/can-devices/using-can-devices:Using CAN Devices>`.
tr_tr: CAN veriyoluna bağlı cihazları kullanma hakkında daha fazla bilgi şu makalede bulunabilir :ref:`CAN cihazların kullanımı<docs/software/can-devices/using-can-devices:Using CAN Devices>`.
zh_cn: 有关使用与CAN总线连接的设备的更多信息，请参见以下文章:ref:`using can devices <docs/software/can-devices/using-can-devices:Using CAN Devices>`。

source: Both the digital and analog inputs are highly limited in the amount of data that can be send over them. Serial buses allow users to make use of far more-robust and higher-bandwidth communications protocols with sensors that collect large amounts of data, such as inertial measurement units (IMUs) or 2D LIDAR sensors.
es_mx: Las 2 entradas antes mencionadas son muy limitadas en la cantidad de información que pueden enviar una vez conectadas. Los buses seriales permiten a los usuarios que hagan uso de protocolos de comunicación con mucha más robustez y con mayor ancho de banda con sensores que recolectan grandes cantidades de información, tales como las Unidades de medidas inerciales (IMUs) o los sensores 2D LIDAR.
tr_tr: Hem dijital hem de analog girişler, üzerlerinden gönderilebilecek veri miktarı açısından oldukça sınırlıdır. Seri veri yolları, kullanıcıların atalet ölçüm birimleri (IMU'lar) veya 2D LIDAR sensörleri gibi büyük miktarda veri toplayan sensörlerle çok daha sağlam ve daha yüksek bant genişliğine sahip iletişim protokollerinden yararlanmasına olanak tanır.
zh_cn: 数字和模拟输入的可发送数据量都受到很大限制。串行总线使用户能够利用更强大，带宽更高的通信协议，以及收集大量数据的传感器，例如惯性测量单元（IMU）或2D LIDAR传感器。

source: Additionally, the roboRIO supports communications with peripheral devices over the CAN bus. However, as the FRC CAN protocol is quite idiosyncratic, relatively few peripheral sensors support it (though it is heavily used for motor controllers).
es_mx: Adicionalmente la roboRIO soporta comunicaciones con dispositivos periféricos sobre el CAN Bus. Sin embargo, como el protocolo FRC CAN es bastante peculiar, relativamente algunos sensores periféricos lo soportan (aunque se usa mucho para controladores de motor).
tr_tr: Ek olarak roboRIO, CAN veriyolu üzerinden çevresel cihazlarla iletişimi destekler. Bununla birlikte, FRC CAN protokolü oldukça kendine özgü olduğundan, nispeten az sayıda çevresel sensör onu desteklemektedir (ancak motor kontrolörleri için yoğun bir şekilde kullanılmaktadır).

source: To communicate to peripheral devices over I2C, each pin should be wired to its corresponding pin on the device. I2C allows users to wire a "chain" of slave devices to a single port, so long as those devices have separate IDs set.
es_mx: Para comunicar con los dispositivos periféricos sobre el I2C, cada pin debe ser cableado con su correspondiente pin en el dispositivo. I2C permite a los usuarios cablear una "cadena" de dispositivos esclavos en un solo puerto, siempre y cuando esos dispositivos hayan separado un set ID.
tr_tr: Çevresel cihazlarla I2C üzerinden iletişim kurmak için, her bir pinin cihaz üzerindeki ilgili pimine bağlanması gerekir. I2C, kullanıcıların bir slave aygıtlar "zincirini" tek bir bağlantı noktasına bağlamasına izin verir ve aygıtlar ayrı ID kimliklerine sahip olur.
zh_cn: 要通过I2C与外围设备通信，每个引脚应连接到设备上相应的引脚。 I2C允许用户将从设备的“链”连接到单个端口，只要这些设备具有单独的ID集即可。

source: The I2C bus can also be used through the `MXP expansion port`_. The I2C bus on the MXP is independent. For example, a device on the main bus can have the same ID as a device on the MXP bus.
es_mx: El bus I2A también puede ser usado mediante el puerto de expansión MXP `MXP expansion port`_. El bus I2A en la MXP es independiente. Por ejemplo, un dispositivo en el bus principal puede tener el mismo ID como dispositivo en el bus MXP.
tr_tr: I2C veriyolu, `MXP expansion port`_ aracılığıyla da kullanılabilir. MXP'deki I2C veri yolu bağımsızdır. Örneğin, ana veri yolundaki bir cihaz, MXP veri yolundaki bir cihazla aynı kimliğe sahip olabilir.
zh_cn: I2C总线也可以通过`MXP expansion port`_使用。 MXP上的I2C总线是独立的。例如，主总线上的设备可以具有与MXP总线上的设备相同的ID。

source: To communicate to peripheral devices over SPI, each pin should be wired to its corresponding pin on the device. The SPI port supports communications to up to four devices (corresponding to the Chip Select (CS) 0-3 pins on the diagram above).
es_mx: Para comunicar con los dispositivos periféricos sobre el SPI, cada pin debe ser cableado con su correspondiente pin en el dispositivo. El puerto SPI soporta comunicaciones superiores a 4 dispositivos (correspondiendo al Chip Select (CS) 0-3 pins en el diagrama de arriba).
tr_tr: Çevresel cihazlarla SPI üzerinden iletişim kurmak için, her bir pinin cihazdaki ilgili pinine bağlanması gerekir. SPI bağlantı noktası, dört cihaza kadar iletişimi destekler (yukarıdaki şemadaki Çip Seçimi (CS) 0-3 pimlerine karşılık gelir).
zh_cn: 要通过SPI与外围设备通信，每个引脚应连接到设备上相应的引脚。 SPI端口最多支持与四个设备的通信（对应于上图的芯片选择（CS）0-3引脚）。

source: The RoboRIO RS-232 serial port uses RS-232 signaling levels (+/- 15v). The MXP serial port uses CMOS signaling levels (+/- 3.3v).
es_mx: Los puertos de serie de la roboRIO RS-232 usan niveles de señalización de RS-232 (+/- 15v). El puerto de serie del MXP usa niveles de señalización de CMOS (+/- 3.3v).
tr_tr: RoboRIO RS-232 seri portu, RS-232 sinyal seviyelerini (+/- 15v) kullanır. MXP seri bağlantı noktası CMOS sinyal seviyelerini (+/- 3,3v) kullanır.
zh_cn: RoboRIO RS-232串行端口使用RS-232信号电平（+/- 15v）。 MXP串行端口使用CMOS信号电平（+/- 3.3v）。

source: By default, the onboard RS-232 port is utilized by the roboRIO's serial console. In order to use it for an external device, the serial console must be disabled using the :ref:`Imaging Tool <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>` or :ref:`docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard`.
tr_tr: Varsayılan olarak, yerleşik RS-232 portu roboRIO'nun seri konsolu tarafından kullanılır. Harici bir cihaz için kullanmak için, seri konsol şu şekilde devre dışı bırakılmalıdır: ref: `Imaging Tool <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>` veya: ref: `docs / software / roborio-info / roborio-web-dashboard: roboRIO Web Dashboard`.
zh_cn: 默认情况下，roboRIO的串行控制台使用板载RS-232端口。为了将其用于外部设备，必须使用:ref:`Imaging Tool <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>` 或:ref:`docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard`。
