Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/serial-buses.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Several of the serial buses are also available for use through the roboRIO's MXP Expansion Port. This port allows users to make use of many additional :doc:`digital <digital-inputs-hardware>` and :doc:`analog <analog-inputs-hardware>` inputs, as well as the various serial buses.
es_mx: Algunos de los buses seriales disponibles también están disponibles para usarse mediante el Puerto de Expansión MXP de la roboRIO. Este puerto permite a los usuarios hacer uso de algunas entradas digitales :doc:`digital <digital-inputs-hardware>` y análogas :doc:`analog <analog-inputs-hardware>` , así como los diversos buses seriales.
tr_tr: RoboRIO'nun MXP Genişletme Portu aracılığıyla birkaç seri veri yolu da kullanılabilir. Bu bağlantı noktası, kullanıcıların birçok ek :doc:`digital <digital-inputs-hardware>` ve :doc:`analog <analog-inputs-hardware>` girişlerinin yanı sıra çeşitli seri veri yollarından yararlanmasına olanak tanır.
zh_cn: 还可以通过roboRIO的MXP扩展端口使用几种串行总线。该端口允许用户使用许多其他的 :doc:`digital <digital-inputs-hardware>` and :doc:`analog <analog-inputs-hardware>`输入以及各种串行总线。

source: TalonSRX-based sensors, such as the `Gadgeteer Pigeon IMU <http://www.ctr-electronics.com/sensors/gadgeteer-imu-module-pigeon.html>`__ and the `SRX MAG Encoder <https://www.ctr-electronics.com/sensors/srx-magnetic-encoder.html>`__
es_mx: Sensores TalonSRX-based, tales como `Gadgeteer Pigeon IMU <http://www.ctr-electronics.com/sensors/gadgeteer-imu-module-pigeon.html>`__ y el Codificador SRX MAG <https://www.ctr-electronics.com/sensors/srx-magnetic-encoder.html>`__
tr_tr: `Gadgeteer Pigeon IMU <http://www.ctr-electronics.com/sensors/gadgeteer-imu-module-pigeon.html>`__ ve `SRX MAG Encoder <https://www.ctr-electronics.com/sensors/srx-magnetic-encoder.html>`__ gibi TalonSRX tabanlı sensörler
zh_cn: TalonSRX-based 传感器, 如 `Gadgeteer Pigeon IMU <http://www.ctr-electronics.com/sensors/gadgeteer-imu-module-pigeon.html>`__ 和 `SRX MAG Encoder <https://www.ctr-electronics.com/sensors/srx-magnetic-encoder.html>`__

source: Power monitoring sensors built into the :ref:`Power Distribution Panel (PDP) <docs/zero-to-robot/step-1/control-system-hardware:Power Distribution Panel>`
es_mx: Sensores de monitoreo de energía integrados en :ref:`Panel de distribución de energía (PDP) <docs/zero-to-robot/step-1/control-system-hardware:Power Distribution Panel>`
tr_tr: :ref:`Power Distribution Panel (PDP) <docs/zero-to-robot/step-1/control-system-hardware:Power Distribution Panel>` 'de yerleşik güç izleme sensörleri

source: Additionally, the roboRIO supports communications with peripheral devices over the CAN bus. However, as the FRC\ |reg| CAN protocol is quite idiosyncratic, relatively few peripheral sensors support it (though it is heavily used for motor controllers).
zh_cn: 此外，roboRIO支持通过CAN总线与外围设备进行通信。但是，FRC \ | reg | CAN协议非常独特，外围传感器对此的支持相对较少（尽管它广泛用于电机控制器）。

source: USB Host
zh_cn: USB主机

source: Power monitoring sensors built into the :ref:`Power Distribution Panel (PDP) <docs/controls-overviews/control-system-hardware:Power Distribution Panel>`
zh_cn: 电源监控传感器内置在 :ref:`Power Distribution Panel (PDP) <docs/controls-overviews/control-system-hardware:Power Distribution Panel>`
