Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/triangulating-rangefinders.po
Languages: fr_ca

source: Triangulating Rangefinders
fr_ca: Télémètres triangulaires

source: Sharp-brand triangulating rangefinder.
fr_ca: Télémètre triangulant de marque Sharp.

source: Triangulating rangefinders (often called "IR rangefinders," as they commonly function in the infrared wavelength band) are another common type of rangefinder used in FRC\ |reg|. The sensor shown above is a `common Sharp-brand sensor <https://www.sparkfun.com/products/242>`__
fr_ca: Les télémètres de triangulation (souvent appelés "télémètres IR", car ils fonctionnent couramment dans la bande de longueur d’onde infrarouge) sont un autre type commun de télémètre utilisé en FRC\ |reg|. Le capteur ci-dessus est un `capteur commun de marque Sharp <https://www.sparkfun.com/products/242>`__

source: Unlike :doc:`LIDAR <lidar>`, triangulating rangefinders do not measure the time between the emission of a pulse and the receiving of a reflection. Rather, most IR rangefinders work by emitting a constant beam at a slight angle, and measuring the position of the reflected beam. The closer the point of contact of the reflected beam to the emitter, the closer the object to the sensor.
fr_ca: Contrairement à :doc:`LIDAR<lidar>`, les télémètres triangulaires ne mesurent pas le temps entre l'émission d'une impulsion et la réception d'une réflexion. Au contraire, la plupart des télémètres IR fonctionnent en émettant un faisceau constant à un léger angle et en mesurant la position du faisceau réfléchi. Plus le point de contact du faisceau réfléchi est proche de l'émetteur, plus l'objet est proche du capteur.

source: Using IR rangefinders
fr_ca: Utilisation de télémètres IR

source: Connecting the Sharp GP2Y0A21YK IR rangefinder to the analog in port of the roboRIO.
fr_ca: Connexion du télémètre IR Sharp GP2Y0A21YK au port analogique du roboRIO.

source: IR Rangefinders generally output an analog voltage proportional to the distance to the target, and thus connect to the :doc:`analog input <analog-inputs-hardware>` ports on the RIO.
fr_ca: Les télémètres IR émettent généralement une tension analogique proportionnelle à la distance de la cible, et se connectent ainsi aux ports :doc:`entrée analogique<analog-inputs-hardware>` sur le RIO.

source: Caveats
fr_ca: Avertissements

source: IR rangefinders suffer similar drawbacks to 1D LIDAR sensors - they are very sensitive to the reflectivity of the target in the wavelength of the emitted laser.
fr_ca: Les télémètres IR présentent des inconvénients similaires aux capteurs LIDAR 1D - ils sont très sensibles à la réflectivité de la cible dans la longueur d'onde du laser émis.

source: Additionally, while IR rangefinders tend to offer better resolution than LIDAR sensors when measuring at short distances, they are also usually more sensitive to differences in orientation of the target, *especially* if the target is highly-reflective (such as a mirror).
fr_ca: De plus, bien que les télémètres infrarouges aient tendance à offrir une meilleure résolution que les capteurs LIDAR lorsqu'ils mesurent à de courtes distances, ils sont généralement plus sensibles aux différences d'orientation de la cible, *surtout* si la cible est hautement réfléchissante (comme un miroir).
