Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/ultrasonics-hardware.po
Languages: fr_ca, tr_tr, zh_cn

source: Ultrasonics - Hardware
fr_ca: Ultrasons
tr_tr: Ultrasonik - Donanım
zh_cn: 超声波测距仪-硬件

source: This section covers ultrasonic sensor hardware. For a software guide to ultrasonics, see :ref:`docs/software/hardware-apis/sensors/ultrasonics-software:Ultrasonics - Software`.
fr_ca: Cette section couvre les dispositifs de capteurs à ultrasons. Pour un guide logiciel sur les ultrasons, voir :ref:`docs/software/hardware-apis/sensors/ultrasonics-software:Ultrasonics - Software`.

source: Ultrasonic rangefinders are some of the most common rangefinders used in FRC\ |reg|. They are cheap, easy-to-use, and fairly reliable. Ultrasonic rangefinders work by emitting a pulse of high-frequency sound, and then measuring how long it takes the echo to reach the sensor after bouncing off the target. From the measured time and the speed of sound in air, it is possible to calculate the distance to the target.
fr_ca: Les télémètres à ultrasons sont quelques-uns des télémètres les plus couramment utilisés en FRC\ |reg|. Ils sont bon marché, faciles à utiliser et assez fiables. Les télémètres à ultrasons fonctionnent en émettant une impulsion sonore à haute fréquence, puis en mesurant le temps qu’il faut à l’écho pour atteindre le capteur après avoir rebondi sur la cible. À partir du temps mesuré et de la vitesse du son dans l’air, il est possible de calculer la distance par rapport à la cible.
tr_tr: Ultrasonik telemetreler, FRC\ |reg|'de kullanılan en yaygın telemetrelerden bazılarıdır. Ucuz, kullanımı kolay ve oldukça güvenilirler. Ultrasonik telemetreler, yüksek frekanslı bir ses darbesi yayarak ve ardından yankının hedeften sıçradıktan sonra sensöre ulaşmasının ne kadar sürdüğünü ölçerek çalışır. Ölçülen zamandan ve havadaki ses hızından hedefe olan mesafeyi hesaplamak mümkündür.
zh_cn: 超声波测距仪是FRC \ | reg |中最常用的一些测距仪。它们便宜，易于使用且相当可靠。超声波测距仪的工作原理是发出高频声音脉冲，然后测量从目标弹回后回声到达传感器所需的时间。根据测得的时间和空气中的声速，可以计算到目标的距离。

source: Types of ultrasonics
fr_ca: Types de capteurs ultrasons
tr_tr: Ultrasonik türleri
zh_cn: 超声波测距仪的种类

source: While all ultrasonic rangefinders operate on the "ping-response" principle outlined above, they may vary in the way they communicate with the roboRIO.
fr_ca: Bien que tous les télémètres à ultrasons fonctionnent selon le principe de «réponse ping» décrit ci-dessus, ils peuvent varier dans leur façon de communiquer avec le roboRIO.
tr_tr: Tüm ultrasonik telemetreler yukarıda özetlenen "ping yanıtı" prensibine göre çalışırken, roboRIO ile iletişim kurma şekillerinde farklılık gösterebilir.
zh_cn: 尽管所有超声波测距仪均按照上述“ ping响应”原理运行，但它们与roboRIO通讯的方式可能会有所不同。

source: Analog ultrasonics
fr_ca: Ultrasons avec sorties analogiques
tr_tr: Analog ultrasonik
zh_cn: 模拟超声波测距仪

source: Connecting a MB1013 to the analog in port of the roboRIO.
fr_ca: Connexion d’un MB1013 au port analogique du roboRIO.

source: Analog ultrasonics output a simple analog voltage corresponding to the distance to the target, and thus connect to an :doc:`analog input <analog-inputs-hardware>` port. The user will need to calibrate the voltage-to-distance conversion in :ref:`software <docs/software/hardware-apis/sensors/ultrasonics-software:Ultrasonics - Software>`.
fr_ca: Les détecteurs à ultrasons analogiques produisent une simple tension analogique correspondant à la distance à la cible, et se connectent ainsi à un port :doc:`analog input`. L'utilisateur devra calibrer la conversion tension-distance dans :ref:`software <docs/software/hardware-apis/sensors/ultrasonics-software:Ultrasonics - Software>`.

source: Ping-response ultrasonics
fr_ca: Capteurs ultrasoniques à réponse ping
tr_tr: Ping yanıtı ultrasonikleri
zh_cn: 响应式超声波测距仪

source: Connecting the input and output channels of the VEX Ultrasonic Range Finder to two DIO ports.
fr_ca: Connexion des canaux d’entrée et de sortie du capteur ultrasons VEX Ultrasonic Range Finder à deux ports DIO.

source: While, as mentioned, all ultrasonics are functionally ping-response devices, a "ping response" ultrasonic is one configured to connect to :ref:`both a digital input and a digital output <docs/hardware/sensors/digital-inputs-hardware:Connecting a sensor that uses multiple DIO ports>`. The digital output is used to send the ping, while the input is used to read the response.
fr_ca: Alors que, comme mentionné, tous les capteurs ultrasoniques sont des dispositifs fonctionnellement à réponse ping, celui-ci est configuré pour se connecter :ref:`à la fois une entrée numérique et une sortie numérique <docs/hardware/sensors/digital-inputs-hardware:Connecting a sensor that uses multiple DIO ports>`. La sortie numérique est utilisée pour envoyer le ping, tandis que l'entrée est utilisée pour lire la réponse.
tr_tr: Bahsedildiği gibi, tüm ultrasonikler işlevsel olarak ping yanıtlı cihazlar olsa da, bir "ping yanıtı" ultrasonik şunlara bağlanmak üzere yapılandırılmıştır :ref:`digital giriş ve digital çıkış <docs/hardware/sensors/digital-inputs-hardware:Connecting a sensor that uses multiple DIO ports>`. Dijital çıkış ping göndermek için kullanılır, giriş ise yanıtı okumak için.
zh_cn: 如上所述，所有超声波都是具有功能性的ping响应设备，一种“ ping响应”超声波测距仪可配置为连接到 :ref:`both a digital input and a digital output <docs/hardware/sensors/digital-inputs-hardware:Connecting a sensor that uses multiple DIO ports>`。数字输出用于发送ping，而输入则用于读取响应。

source: Serial ultrasonics
fr_ca: Capteurs ultrasoniques avec bus série
tr_tr: Seri ultrasonik
zh_cn: 连续超声波

source: A Maxbotix RS-232 Ultrasonic sensor.
fr_ca: Un capteur ultrason Maxbotix RS-232.

source: Some more-complicated ultrasonic sensors may communicate with the RIO over one of the :doc:`serial buses <serial-buses>`, such as RS-232.
fr_ca: Certains capteurs à ultrasons plus compliqués peuvent communiquer avec le RIO sur l'un des :doc:`bus série<serial-buses>`, tels que RS-232.
tr_tr: Bazı daha karmaşık ultrasonik sensörler, RIO ile şu şunlardan biri üzerinden iletişim kurabilir: RS-232 gibi :doc:`serial buses <serial-buses>`
zh_cn: 一些更复杂的超声波传感器可能会通过 :doc:`serial buses <serial-buses>`,与RIO通信，比如 RS-232。

source: Caveats
fr_ca: Avertissements
tr_tr: Uyarılar
zh_cn: 注意事项

source: Ultrasonic sensors are generally quite easy to use, however there are a few caveats. As ultrasonics work by measuring the time between the pulse and its echo, they generally measure distance only to the *closest* target in their range. Thus, it is extremely important to pick the right sensor for the job. The documentation for ultrasonic sensors will generally include a picture of the "beam pattern" that shows the shape of the "window" in which the ultrasonic will detect a target - pay close attention to this when selecting your sensor.
fr_ca: Les capteurs à ultrasons sont généralement assez faciles à utiliser, mais il y a quelques mises en garde. Comme les ultrasons fonctionnent en mesurant le temps entre l'impulsion et son écho, ils mesurent généralement la distance uniquement à la cible *la plus proche* dans leur plage. Il est donc extrêmement important de choisir le bon capteur pour le travail. La documentation des capteurs à ultrasons comprendra généralement une image du «diagramme de faisceau» qui montre la forme de la «fenêtre» dans laquelle les ultrasons détecteront une cible - faites très attention à cela lors de la sélection de votre capteur.
tr_tr: Ultrasonik sensörlerin kullanımı genellikle oldukça kolaydır, ancak birkaç dikkat edilecek nokta vardır. Ultrasonik, darbe ile yankısı arasındaki süreyi ölçerek çalıştığından, genellikle yalnızca kendi aralıklarındaki *en yakın* hedefe olan mesafeyi ölçer. Bu nedenle, iş için doğru sensörü seçmek son derece önemlidir. Ultrasonik sensörler için dokümantasyon, genellikle ultrasoniğin bir hedefi tespit edeceği "pencerenin" şeklini gösteren bir "ışın modeli" resmini içerecektir - sensörünüzü seçerken buna çok dikkat edin.
zh_cn: 超声波传感器通常很容易使用，但是有一些警告。超声波通过测量脉冲与其回波之间的时间来工作，因此它们通常仅测量距其范围内“最近”目标的距离。因此，为工作选择合适的传感器非常重要。超声波传感器的文档通常会包含“光束图案”的图片，该图片显示超声波将在其中检测到目标的“窗口”的形状-选择传感器时请特别注意。

source: Ultrasonic sensors are also susceptible to interference from other ultrasonic sensors. In order to minimize this, the roboRIO can run ping-response ultrasonics in a "round-robin" fashion - however, in competition, there is no sure way to ensure that interference from sensors mounted on other robots does not occur.
fr_ca: Les capteurs à ultrasons sont également sensibles aux interférences d'autres capteurs à ultrasons. Afin de minimiser cela, le roboRIO peut exécuter des ultrasons à réponse ping de manière alternée, ou "round-robin" - cependant, en compétition, il n'y a aucun moyen sûr de s'assurer que les interférences des capteurs montés sur d'autres robots ne viennent pas entrer en conflit avec nos capteurs.
tr_tr: Ultrasonik sensörler ayrıca diğer ultrasonik sensörlerden kaynaklanan parazitlere karşı hassastır. Bunu en aza indirmek için roboRIO, ping yanıtı ultrasoniklerini "round-robin" tarzında çalıştırabilir - ancak rekabet halinde, diğer robotlara monte edilmiş sensörlerden kaynaklanan parazitlerin oluşmamasını sağlamanın kesin bir yolu yoktur.
zh_cn: 超声波传感器还容易受到其他超声波传感器的干扰。为了最大程度地减少这种情况，roboRIO可以“循环”方式运行ping响应超声波-但是，在竞争中，无法确定会不会受到来自其他机器人上安装的传感器的干扰。

source: Finally, ultrasonics may not be able to detect objects that absorb sound waves, or that redirect them in strange ways. Thus, they work best for detecting hard, flat objects.
fr_ca: Enfin, les capteurs ultrasoniques peuvent être dans l'impossibilité de détecter des objets qui absorbent les ondes sonores ou qui les redirigent de manière étrange. Ainsi, ils fonctionnent mieux pour détecter des objets durs et plats.
tr_tr: Son olarak, ultrasonik ses dalgalarını emen veya onları tuhaf şekillerde yönlendiren nesneleri tespit edemeyebilir. Bu nedenle, sert, düz nesneleri tespit etmek için en iyi şekilde çalışırlar.
zh_cn: 最后，超声波可能无法检测吸收声波或以八仙过海各显神通地重定向声波的物体。因此它最适用于检测坚硬的扁平物体。

source: This section covers ultrasonic sensor hardware. For a software guide to ultrasonics, see :ref:`docs/software/sensors/ultrasonics-software:Ultrasonics - Software`.
tr_tr: Bu bölüm ultrasonik sensör donanımını kapsar. Ultrasonik yazılım kılavuzu için bakınız :ref:`docs/software/sensors/ultrasonics-software:Ultrasonics - Software`.

source: Analog ultrasonics output a simple analog voltage corresponding to the distance to the target, and thus connect to an :doc:`analog input <analog-inputs-hardware>` port. The user will need to calibrate the voltage-to-distance conversion in :ref:`software <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`.
tr_tr: Analog ultrasonik, hedefe olan mesafeye karşılık gelen basit bir analog voltaj çıkarır ve böylece bir :doc:`analog giriş <analog-inputs-hardware>` bağlantı noktasına bağlanır. Kullanıcının voltaj-mesafe dönüşümünü şurada kalibre etmesi gerekecektir :ref:`software <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`.
