Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/wpilib/index.po
Languages: es_mx, fr_ca, he_il, tr_tr, zh_cn

source: Overview
es_mx: Vista general
fr_ca: Survol
he_il: סקירה כללית
tr_tr: Genel Bakış
zh_cn: 概述

source: Styleguide & wpiformat
es_mx: Styleguide y wpiformat
fr_ca: Guide de style et wpiformat
he_il: הנחיות סגנון ו-wpiformat
tr_tr: Stil kılavuzu ve wpiformat
zh_cn: 样式指南和WPI格式

source: Building with CMake
es_mx: Construyendo con CMake
fr_ca: Compilation avec CMake
he_il: בנייה עם CMake
tr_tr: CMake ile inşa etmek
zh_cn: 编译和CMake

source: Using Development Builds
es_mx: Usar compilaciones de desarrollo
fr_ca: Utilisation des builds de développement
he_il: שימוש בגרסאות בפיתוח
tr_tr: Geliştirme Derlemeleri Kullanma
zh_cn: 使用开发者版本

source: Maven Artifacts
fr_ca: Artefacts Maven

source: Contributor Guidelines
es_mx: Directrices para colaboradores
fr_ca: Directives aux contributeurs
he_il: הנחיות לתורמים
tr_tr: Katkı Yönergeleri
zh_cn: 开发者指南

source: NetworkTables 4 Protocol Spec
fr_ca: Spécification du protocole NetworkTables 4

source: Developing with allwpilib
es_mx: Desarrollando con allwpilib
fr_ca: Développer avec allwpilib
he_il: פיתוח עם allwpilib
tr_tr: Allwpilib ile geliştirme
zh_cn: 使用allwpilib开发

source: This document contains information for developers *of* WPILib. This is not for programming FRC\ |reg| robots.
es_mx: Este documento contiene informaci칩n de desarrolladores *de* WPILib. Esto no es para programar robots FRC\ |reg|
fr_ca: Ce document contient des informations pour les développeurs *de* la WPILib. Il n’est donc pas destiné à la programmation des robots FRC\ |reg|.
he_il: מסמך זה מכיל מידע למפתחים *של* WPILib. זה לא מיועד לתכנות של רובוטי FRC\ |reg| .
tr_tr: Bu belge, *WPILib geliştiricileri* için bilgiler içerir. Bu, FRC\ |reg| robotlarını programlamak için değildir.
zh_cn: 这个文档仅供WPILIB开发者参考，不是在正式比赛中的编程指南

source: Quick Start
fr_ca: Démarrage rapide

source: Below is a list of instructions that guide you through cloning, building, publishing and using local allwpilib binaries in a robot project. This quick start is not intended as a replacement for the information that is further listed in this document.
fr_ca: Ci-dessous figure une liste d'instructions qui vous guidera au travers du clonage, de la construction et de la publication des fichiers binaires dans un projet de robot en utilisant la allwpililb locale. Ce guide de démarrage rapide n'est pas conçu comme un remplacement de l'information présente plus loin dans le document.

source: Clone the repository with ``git clone https://github.com/wpilibsuite/allwpilib.git``
fr_ca: Clonez le référentiel avec ``git clone https://github.com/wpilibsuite/allwpilib.git``

source: Build the repository with ``./gradlew build`` or ``./gradlew build --build-cache`` if you have an internet connection
fr_ca: Construisez le référentiel avec ``./gradlew build`` ou ``./gradlew build --build-cache`` si vous possédez une connexion à internet

source: Publish the artifacts locally by running ``./gradlew publish``
fr_ca: Publiez les artéfacts localement en utilisant ``./gradlew publish``

source: Core Repository
es_mx: Repositorio principal
fr_ca: Référentiel de base
he_il: Repository ליבה
tr_tr: Çekirdek Depo
zh_cn: 核心代码库

source: NetworkTables 3 Protocol Spec
es_mx: Especificaciones del protocolo NetworkTables 3
he_il: מפרט פרוטוקול 3 של NetworkTables
tr_tr: NetworkTables 3 Protokol Spesifikasyonu
zh_cn: NetworkTables的三种协议详情

source: This is a list of links to the various documentation for the `allwpilib <https://github.com/wpilibsuite/allwpilib>`__ repository.
es_mx: Esta es una lista de enlaces a la diversa documentaci칩n para el repositorio `allwpilib <https://github.com/wpilibsuite/allwpilib>`__ .
he_il: זוהי רשימת קישורים לתיעודים עבור ה-Repository `allwpilib <https://github.com/wpilibsuite/allwpilib>`__.
tr_tr: Bu, `allwpilib <https://github.com/wpilibsuite/allwpilib>`__ deposu için çeşitli belgelere bağlantıların bir listesidir.
zh_cn: `allwpilib <https://github.com/wpilibsuite/allwpilib>`__ 是指向存储库的各种文档的链接列表。
