Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/wpilib-examples.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: **MecanumBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumBot>`__): Demonstrates an advanced mecanum drive implementation, including encoder-and-gyro odometry through the ``MecanumDriveOdometry`` class, and composition with PID velocity control through the ``MecanumDriveKinematics`` and ``PIDController`` classes.
fr_ca: **MecanumBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumBot>`__): Démontre une implémentation avancée de l'entraînement de type mécanum, incluant l’odométrie (à base d'encodeurs et gyroscopique) à travers la classe ``MecanumDriveOdometry`` et la composition avec le contrôle de la vitesse PID à travers les classes ``MecanumDriveKinematics`` et ``PIDController``.
zh_cn: •MecanumBot (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumBot>`__)：演示了一个高级的麦克纳姆轮的驱动实现，通过MecanumDriveOdometry类中的编码器和陀螺测程，并通过MecanumDriveKinematics和 PIDController类结合PID进行速度控制

source: **PotentiometerPID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/potentiometerpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/PotentiometerPID>`__): Demonstrates the use of the ``PIDController`` class and a potentiometer to control the position of an elevator mechanism.
fr_ca: **PotentiometerPID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/potentiometerpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/PotentiometerPID>`__): Démontre l’utilisation de la classe ``PIDController`` et d’un potentiomètre pour commander la position d’un mécanisme d’élevateur.
zh_cn: •PotentiometerPID (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/potentiometerpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/PotentiometerPID>`__):演示PIDController类和控制电梯结构位置的电位器

source: **RamseteController** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteController>`__): Demonstrates the use of the ``RamseteController`` class to follow a trajectory during the autonomous period.
fr_ca: **RamseteController** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteController>`__): Démontre l’utilisation de la classe ``RamseteController`` pour suivre une trajectoire (prédéfinie) pendant la période autonome.
zh_cn: •RamseteController (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteController>`__):演示RamseteController类的使用来实现自动阶段期间沿着一个特定的轨道行进

source: **SwerveBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SwerveBot>`__): Demonstrates an advanced swerve drive implementation, including encoder-and-gyro odometry through the ``SwerveDriveOdometry`` class, and composition with PID position and velocity control through the ``SwerveDriveKinematics`` and ``PIDController`` classes.
fr_ca: **SwerveBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SwerveBot>`__): Démontre une implémentation avancée de l'entraînement de type swerve, incluant l’odométrie (à base d'encodeurs et gyroscope) à travers la classe ``SwerveDriveOdometry`` et la composition avec des commandes PID de position et de vitesse à travers les classes ``SwerveDriveKinematics`` et ``PIDController``.
zh_cn: •SwerveBot (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SwerveBot>`__):演示了一个高级的转弯驱动实现，包括通过SwerveDriveOdometry类的编码器和陀螺测程，以及通过SwerveDriveKinematics与PIDController类结合PID进行速度控制

source: **UltrasonicPID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonicpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/UltrasonicPID>`__): Demonstrates the use of the ``PIDController`` class in conjunction with an ultrasonic sensor to drive to a set distance from an object.
fr_ca: **UltrasonicPID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonicpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/UltrasonicPID>`__): Démontre l’utilisation de la classe ``PIDController`` en conjonction avec un capteur à ultrasons pour déplacer le robot à une distance prédéfinie d’un objet donné.
zh_cn: •UltrasonicPID (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonicpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/UltrasonicPID>`__):演示了使用PIDController类结合超声波传感器使机器行进到距离一个对象特定值处

source: Sensor Examples
es_mx: Ejemplos de sensores
fr_ca: Exemples de programmation de capteurs
tr_tr: Sensör Örnekleri
zh_cn: 传感器实例

source: These examples demonstrate sensor reading and data processing using WPILib. Mechanisms control may be present, but is not the emphasized concept of these examples.
es_mx: Estos ejemplos demuestran la lectura de sensores y el procesamiento de datos usando WPILib. El control de mecanismos puede estar presente, pero no es el concepto enfatizado de estos ejemplos.
fr_ca: Ces exemples démontrent la lecture de signaux à partir des capteurs et le traitement des données à l’aide de WPILib. Le contrôle des mécanismes peut être présent, mais ce n’est pas le point focal de ces exemples.
tr_tr: Bu örnekler, WPILib kullanarak sensör okumayı ve veri işlemeyi gösterir. Mekanizma kontrolü mevcut olabilir, ancak bu örneklerin vurgulanan konsepti değildir.
zh_cn: 这些示例演示了使用WPILib进行传感器读取和数据处理。可能存在机制控制，但不是这些示例强调的概念。

source: **Axis Camera Sample** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/axiscamera>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/AxisCameraSample>`__): Demonstrates the use of OpenCV and an Axis Netcam to overlay a rectangle on a captured video feed and stream it to the dashboard.
fr_ca: **Axis Camera Sample** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/axiscamera>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/AxisCameraSample>`__): Démontre l'utilisation d'OpenCV et d'un Axis Netcam pour superposer un rectangle sur un flux vidéo capturé et le diffuser sur le Dashboard.
zh_cn: •Axis Camera Sample (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/axiscamera>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/AxisCameraSample>`__):演示了OpenCV和Axis网络摄像机的使用，在捕获的视频上覆盖一个矩形，并将其输出到仪表盘

source: **Power Distribution CAN Monitoring** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/canpdp>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/CANPDP>`__): Demonstrates obtaining sensor information from a Power Distribution module over CAN using the ``PowerDistribution`` class.
fr_ca: **PDP CAN Monitoring** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/canpdp>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/CANPDP>`__): Démontre l'obtention d'informations de capteur à partir du PDP via CAN en utilisant la classe ``PowerDistributionPanel``.

source: **Duty Cycle Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleencoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DutyCycleEncoder>`__): Demonstrates the use of the ``DutyCycleEncoder`` class to read values from a PWM-type absolute encoder.
fr_ca: **Duty Cycle Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleencoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DutyCycleEncoder>`__): Montre l'utilisation de la classe ``DutyCycleEncoder`` pour lire les valeurs d'un codeur absolu de type PWM.
zh_cn: •Duty Cycle Encoder (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleencoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DutyCycleEncoder>`__):演示了DutyCycleEncoder类的使用——从PWM类型的绝对式编码器读取值数值

source: **DutyCycleInput** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleinput>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DutyCycleInput>`__): Demonstrates the use of the ``DutyCycleInput`` class to read the frequency and fractional duty cycle of a PWM input.
fr_ca: **DutyCycleInput** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleinput>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DutyCycleInput>`__): Démontre l’utilisation de la classe ``DutyCycleInput`` pour lire la fréquence et de fractions du rapport cyclique d’une entrée PWM.
zh_cn: •DutyCycleInput (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleinput>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DutyCycleInput>`__):演示如何使用DutyCycleInput类读取PWM输入的频率和占空比

source: **Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/encoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Encoder>`__): Demonstrates the use of the ``Encoder`` class to read values from a quadrature encoder.
fr_ca: **Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/encoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Encoder>`__): Démontre l’utilisation de la classe ``Encoder`` pour lire les valeurs de données lues par un encodeur en quadrature.
zh_cn: •Encoder (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/encoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Encoder>`__):演示了如何使用Encoder类从一个正交编码器处读取数值

source: **Gyro** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyro>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Gyro>`__): Demonstrates the use of the ``AnalogGyro`` class to measure robot heading and stabilize driving.
fr_ca: **Gyro** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyro>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Gyro>`__): Démontre l’utilisation de la classe ``AnalogGyro`` pour mesurer l'orientation du robot et stabiliser le déplacement de celui-ci.
zh_cn: •Gyro (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyro>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Gyro>`__):演示使用AnalogGyro类测量机器人的方向以及稳定行驶过程

source: **Intermediate Vision** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/intermediatevision>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/IntermediateVision>`__): Demonstrates the use of OpenCV and a USB camera to overlay a rectangle on a captured video feed and stream it to the dashboard.
fr_ca: **Intermediate Vision** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/intermediatevision>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/IntermediateVision>`__): Démontre l'utilisation d'OpenCV et d'une caméra USB pour superposer un rectangle sur un flux vidéo capturé et le diffuser sur le Dashboard.
zh_cn: •Intermediate Vision (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/intermediatevision>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/IntermediateVision>`__):演示OpenCV和USB摄像头的使用，在捕获的视频上覆盖一个矩形，并将其输出到仪表板

source: **Ultrasonic** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonic>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Ultrasonic>`__): Demonstrates the use of the ``Ultrasonic`` class to read data from an ultrasonic sensor in conjunction with the ``MedianFilter`` class to reduce signal noise.
fr_ca: **Ultrasonic** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonic>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Ultrasonic>`__): Démontre l’utilisation de la classe ``Ultrasonic`` pour lire les données d’un capteur à ultrasons en conjonction avec la classe ``MedianFilter`` pour réduire le bruit du signal.
zh_cn: •Ultrasonic (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonic>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Ultrasonic>`__):演示如何使用Ultrasonic类使用超声波传感器结合MedianFilter类进行降噪以读取数据

source: Command-Based Examples
es_mx: Ejemplos basados en comandos
fr_ca: Exemples de programmes basés sur l'architecture orientée Commande
tr_tr: Komut-Tabanlı Örnekler
zh_cn: 基于指令的示例

source: These examples demonstrate the use of the :ref:`Command-Based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`.
es_mx: Estos ejemplos demuestran el uso de :ref:`Command-Based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`.
fr_ca: Ces exemples démontrent l’utilisation du :ref:`cadre de développement orienté Commande <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`.
tr_tr: Bu örnekler: :ref:`Command-Based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`. 'ın kullanımını gösterir.
zh_cn: 这些示例演示了 :ref:`Command-Based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`的使用。

source: **ArmBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBot>`__): Demonstrates the use of a ``ProfiledPIDSubsystem`` to control a robot arm.
fr_ca: **ArmBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBot>`__): Démontre l’utilisation d’un ``ProfiledPIDSubsystem`` pour contrôler le bras d'un robot.
zh_cn: •ArmBot (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBot>`__):演示了使用ProfiledPIDSubsystem控制机器人手臂

source: **ArmBotOffboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>`__): Demonstrates the use of a ``TrapezoidProfileSubsystem`` in conjunction with a "smart motor controller" to control a robot arm.
fr_ca: **ArmBotOffboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>`__): Démontre l’utilisation d’un ``TrapezoidProfileSubsystem`` en conjonction avec "un contrôleur de moteur intelligent" pour commander le bras d'un robot.
zh_cn: •ArmBotOffboard (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>`__):演示了TrapezoidProfileSubsystem结合“智能电机控制器”一起控制机器人手臂

source: **DriveDistanceOffboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>`__): Demonstrates the use of a ``TrapezoidProfileCommand`` in conjunction with a "smart motor controller" to drive forward by a set distance with a trapezoidal motion profile.
fr_ca: **DriveDistanceOffboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>`__): Démontre l’utilisation d’un ``TrapezoidProfileCommand`` en conjonction avec "un contrôleur de moteur intelligent" pour faire avancer le robot sur une distance prédéfinie à l'aide d'un profil de mouvement trapézoïdal.
zh_cn: •DriveDistanceOffboard (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>`__):演示使用TrapezoidProfileCommand结合“智能电机控制器”一起使机器人向前移动特定距离

source: **FrisbeeBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/frisbeebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Frisbeebot>`__): A complete set of robot code for a simple frisbee-shooting robot typical of the 2013 FRC\ |reg| game *Ultimate Ascent*. Demonstrates simple PID control through the ``PIDSubystem`` class.
fr_ca: **FrisbeeBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/frisbeebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Frisbeebot>`__): Un ensemble complet de code de robot pour un simple robot de tir au frisbee typique de 2013 FRC \ | reg | jeu *Ultimate Ascent*. Démontre un contrôle PID simple via la classe ``PIDSubystem``.
zh_cn: •FrisbeeBot (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/frisbeebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Frisbeebot>`__): 2013年FRC®赛事Ultimate Ascent中的典型的简单飞盘射击机器人的完整代码。演示通过PIDSubystem类实现简单的PID控制

source: **Gears Bot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gearsbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GearsBot>`__): A complete set of robot code for the WPI demonstration robot, GearsBot.
fr_ca: **Gears Bot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gearsbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GearsBot>`__): Un ensemble complet de codes de robot pour le robot de démonstration WPI, GearsBot.
zh_cn: •Gears Bot (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gearsbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GearsBot>`__):一套完整的WPI演示机器人代码：GearsBot
