Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/wpilib-examples.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: **MecanumBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MecanumBot>`__): Demonstrates an advanced mecanum drive implementation, including encoder-and-gyro odometry through the ``MecanumDriveOdometry`` class, and composition with PID velocity control through the ``MecanumDriveKinematics`` and ``PIDController`` classes.
es_mx: **MecanumBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MecanumBot>`__): Demuestra una implementación avanzada de unidad mecanum, incluida la odometría de codificador y giroscopio a través de la clase ``MecanumDriveOdometry``, y la composición con control de velocidad PID a través de clases ``MecanumDriveKinematics`` y ``PIDController``.
tr_tr: **MecanumBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MecanumBot>`__): ``MecanumDriveOdometry`` sınıfı aracılığıyla kodlayıcı ve cayro odometri ve ``MecanumDriveKinematics`` ' ve ``PIDController``sınıfları aracılığıyla PID hız kontrollü kompozisyon dahil olmak üzere gelişmiş bir mekanik sürücü uygulamasını gösterir.

source: **PotentiometerPID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/potentiometerpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/PotentiometerPID>`__): Demonstrates the use of the ``PIDController`` class and a potentiometer to control the position of an elevator mechanism.
es_mx: **PotentiometerPID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/potentiometerpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/PotentiometerPID>`__): Demuestra el uso de la clase ``PIDController`` y un potenciómetro para controlar la posición de un mecanismo de ascensor.
tr_tr: **PotentiometerPID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/potentiometerpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/PotentiometerPID>`__): Bir asansör mekanizmasının konumunu kontrol etmek için ``PIDController`` sınıfının ve bir potansiyometrenin kullanımını gösterir.

source: **RamseteController** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RamseteController>`__): Demonstrates the use of the ``RamseteController`` class to follow a trajectory during the autonomous period.
es_mx: **RamseteController** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RamseteController>`__): Demuestra el uso de la clase ``RamseteController`` para seguir una trayectoria durante el período autónomo.
tr_tr: **RamseteController** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RamseteController>`__): Otonom dönem boyunca bir yörüngeyi izlemek için ``RamseteController`` sınıfının kullanımını gösterir.

source: **SwerveBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SwerveBot>`__): Demonstrates an advanced swerve drive implementation, including encoder-and-gyro odometry through the ``SwerveDriveOdometry`` class, and composition with PID position and velocity control through the ``SwerveDriveKinematics`` and ``PIDController`` classes.
es_mx: **SwerveBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SwerveBot>`__): Demuestra una implementación avanzada de control de desvío, incluida la odometría de codificador y giroscopio a través de la clase ``SwerveDriveOdometry`` y control de composición con posición PID y control de velocidad a través de las clases ``SwerveDriveKinematics`` y ``PIDController``.
tr_tr: **SwerveBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SwerveBot>`__): ``SwerveDriveOdometry`` sınıfı aracılığıyla kodlayıcı ve cayro odometri ve ``SwerveDriveKinematics`` ve``PIDController`` sınıfları aracılığıyla PID konumu ve hız kontrolü ile kompozisyon dahil olmak üzere gelişmiş bir swerve sürücü uygulamasını gösterir.

source: **UltrasonicPID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonicpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/UltrasonicPID>`__): Demonstrates the use of the ``PIDController`` class in conjunction with an ultrasonic sensor to drive to a set distance from an object.
es_mx: **UltrasonicPID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonicpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/UltrasonicPID>`__): Demuestra el uso de la clase ``PIDController`` junto con un sensor ultrasónico para conducir a una distancia determinada de un objeto.
tr_tr: **UltrasonicPID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonicpid>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/UltrasonicPID>`__): Bir nesneden belirli bir mesafeye gitmek için ultrasonik sensör ile birlikte ``PIDController`` sınıfının kullanımını gösterir.

source: **Axis Camera Sample** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/axiscamera>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/AxisCameraSample>`__): Demonstrates the use of OpenCV and an Axis Netcam to overlay a rectangle on a captured video feed and stream it to the dashboard.
es_mx: **Axis Camera Muestra** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/axiscamera>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/AxisCameraSample>`__): Demuestra el uso de OpenCV y una Axis Netcam para superponer un rectángulo en un video capturado y transmitirlo al la dashboard.
tr_tr: **Axis Kamera Örneği** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/axiscamera>`__, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/AxisCameraSample>`__): Yakalanan bir video beslemesinde bir dikdörtgeni kaplamak ve bunu kontrol paneline aktarmak için OpenCV ve bir Axis Netcam kullanımını gösterir.

source: **PDP CAN Monitoring** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/canpdp>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/CANPDP>`__): Demonstrates obtaining sensor information from the PDP over CAN using the ``PowerDistributionPanel`` class.
es_mx: **PDP CAN Monitoring** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/canpdp>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/CANPDP>`__): Demuestra la información obtenida del sensor de PDP sobre CAN usando la clase``PowerDistributionPanel``.
tr_tr: **PDP CAN İzleme** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/canpdp>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/CANPDP>` __): ``PowerDistributionPanel`` sınıfını kullanarak CAN üzerinden PDP'den sensör bilgilerini almayı gösterir.

source: **Duty Cycle Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleencoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DutyCycleEncoder>`__): Demonstrates the use of the ``DutyCycleEncoder`` class to read values from a PWM-type absolute encoder.
es_mx: **Duty Cycle Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleencoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DutyCycleEncoder>`__): Demuestra el uso de la clase ``DutyCycleEncoder`` a valores leíbles de un encoder absoluto de tipo PWM
tr_tr: **Duty Cycle Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleencoder>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DutyCycleEncoder>` __): PWM tipi bir mutlak encoderden değerleri okumak için ``DutyCycleEncoder``sınıfının kullanımını gösterir.

source: **DutyCycleInput** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleinput>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DutyCycleInput>`__): Demonstrates the use of the ``DutyCycleInput`` class to read the frequency and fractional duty cycle of a PWM input.
es_mx: **DutyCycleInput** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleinput>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DutyCycleInput>`__): Demuestra el uso de la clase ``DutyCycleInput`` para leer la frecuencia y el ciclo de trabajo fraccional de una entrada PWM.
tr_tr: **DutyCycleInput** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/dutycycleinput>`__, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DutyCycleInput>`__): Bir PWM girişinin frekansını ve kesirli görev döngüsünü okumak için ``DutyCycleInput`` sınıfının kullanımını gösterir.

source: **Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/encoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Encoder>`__): Demonstrates the use of the ``Encoder`` class to read values from a quadrature encoder.
es_mx: **Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/encoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Encoder>`__): Demuestra el uso de la clase ``Encoder`` para leer valores de un codificador en cuadratura.
tr_tr: **Kodlayıcı** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/encoder>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Encoder>`__): Bir dörtlü kodlayıcıdan değerleri okumak için ``Encoder`` sınıfının kullanımını gösterir.

source: **Gyro** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyro>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Gyro>`__): Demonstrates the use of the ``AnalogGyro`` class to measure robot heading and stabilize driving.
es_mx: **Gyro** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyro>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Gyro>`__): Demuestra el uso de la clase ``AnalogGyro`` para medir el rumbo del robot y estabilizar la conducción.
tr_tr: **Gyro** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyro>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Gyro>`__): Robotun yönünü ölçmek ve sürüşü stabilize etmek için ``AnalogGyro`` sınıfının kullanımını gösterir.

source: **Intermediate Vision** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/intermediatevision>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/IntermediateVision>`__): Demonstrates the use of OpenCV and a USB camera to overlay a rectangle on a captured video feed and stream it to the dashboard.
es_mx: **Intermediate Vision** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/intermediatevision>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/IntermediateVision>`__): Demuestra el uso de OpenCV y una cámara USB para superponer un rectángulo en un video capturado y transmitirlo a la dashboard.
tr_tr: **Intermediate Vision** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/intermediatevision>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/IntermediateVision>`__): Yakalanan bir video beslemesinin üzerine bir dikdörtgenin üzerine bindirmek ve bunu kontrol paneline aktarmak için OpenCV ve bir USB kamera kullanımını gösterir.

source: **Ultrasonic** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonic>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Ultrasonic>`__): Demonstrates the use of the ``Ultrasonic`` class to read data from an ultrasonic sensor in conjunction with the ``MedianFilter`` class to reduce signal noise.
es_mx: **Ultrasonic** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonic>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Ultrasonic>`__): Demuestra el uso de la clase ``Ultrasonic`` para leer datos de un sensor ultrasónico junto con la clase ``MedianFilter`` para reducir la señal ruido.
tr_tr: **Ultrasonic** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ultrasonic>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Ultrasonic>`__): Sinyaldeki gürültüyü azaltmak için``MedianFilter`` sınıfı ile birlikte bir ultrasonik sensörden veri okumak için``Ultrasonic`` sınıfının kullanımını gösterir.

source: **ArmBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArmBot>`__): Demonstrates the use of a ``ProfiledPIDSubsystem`` to control a robot arm.
es_mx: **ArmBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArmBot>`__): Demuestra el uso de un ``ProfiledPIDSubsystem`` para controlar un brazo robótico.
tr_tr: **ArmBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArmBot>`__): Bir robot kolunu kontrol etmek için bir``ProfiledPIDSubsystem`` kullanıldığını gösterir.

source: **ArmBotOffboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>`__): Demonstrates the use of a ``TrapezoidProfileSubsystem`` in conjunction with a "smart motor controller" to control a robot arm.
es_mx: **ArmBotOffboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>`__): Demuestra el uso de un ``TrapezoidProfileSubsystem`` junto con un "controlador de motor inteligente" para controlar un brazo robótico.
tr_tr: **ArmBotOffboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>`__): Bir robot kolunu kontrol etmek için bir "akıllı motor kontrolörü" ile birlikte bir "TrapezoidProfileSubsystem" in kullanımını gösterir.

source: **DriveDistanceOffboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>`__): Demonstrates the use of a ``TrapezoidProfileCommand`` in conjunction with a "smart motor controller" to drive forward by a set distance with a trapezoidal motion profile.
es_mx: **DriveDistanceOffboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>`__): Demuestra el uso de un ``TrapezoidProfileCommand`` junto con un "controlador de motor inteligente" para avanzar una distancia determinada con un perfil de movimiento trapezoidal .
tr_tr: **DriveDistanceOffboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>`__): Trapezoidal hareket profiliyle belirli bir mesafede ileri gitmek için bir ``TrapezoidProfileCommand`` ile bağlantılı olarak bir ``TrapezoidProfileCommand`` kullanımını gösterir .

source: **FrisbeeBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/frisbeebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Frisbeebot>`__): A complete set of robot code for a simple frisbee-shooting robot typical of the 2013 FRC\ |reg| game *Ultimate Ascent*. Demonstrates simple PID control through the ``PIDSubystem`` class.
es_mx: **FrisbeeBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/frisbeebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Frisbeebot>`__): Un conjunto completo de código de robot para un sencillo tiro de frisbee del juego FRC\ |reg| 2013 *Ultimate Ascent*. Demuestra control PID a través de la clase ``PIDSubystem`` .
tr_tr: ** FrisbeeBot ** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/frisbeebot>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Frisbeebot>` __): 2013 FRC'ye özgü basit bir frizbi atan robot için eksiksiz bir robot kodu seti \ | reg | oyun * Ultimate Ascent *. ``PIDSubystem`` sınıfı aracılığıyla basit PID kontrolünü gösterir.

source: **Gears Bot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gearsbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GearsBot>`__): A complete set of robot code for the WPI demonstration robot, GearsBot.
es_mx: **Gears Bot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gearsbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GearsBot>`__): Un set completo de código del robot para el robot de demostración de WPI, GearsBot.
tr_tr: **Gears Bot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gearsbot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GearsBot>`__): WPI gösteri robotu GearsBot için eksiksiz bir robot kodu seti.
