Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/wpilib-examples.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: **HID Rumble** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hidrumble>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HidRumble>`__): Demonstrates the use of the "rumble" functionality for tactile feedback on supported HIDs (such as XboxControllers).
fr_ca: **HID Rumble** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hidrumble>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HidRumble>`__): Démontre l'utilisation de la fonctionnalité "grondement" pour un retour tactile sur les HID pris en charge (tels que les XboxControllers).
zh_cn: •HID Rumble (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hidrumble>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HidRumble>`__): 演示了触觉的“Rumble”向支持的HID(如XboxControllers)的反馈功能的实现

source: **Shuffleboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/shuffleboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ShuffleBoard>`__): Demonstrates configuring tab/widget layouts on the "Shuffleboard" dashboard from robot code through the ``Shuffleboard`` class's fluent builder API.
fr_ca: **Shuffleboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/shuffleboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ShuffleBoard>`__): Démontre la configuration des dispositions d’onglet/widget sur le dashboard "Shuffleboard" à partir du code robot à travers l’API du constructeur fluide de la classe ``Shuffleboard``.
zh_cn: •Shuffleboard(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/shuffleboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ShuffleBoard>`__): 在机器人代码中通过Shuffleboard类的fluent builder API演示在“Shuffleboard”仪表板上配置标签/小部件布局

source: **RomiReference** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/romireference>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RomiReference>`__): A command based example of how to run the :doc:`Romi robot </docs/romi-robot/index>`.
fr_ca: **RomiReference** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/romireference>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RomiReference>`__): Un exemple basé sur des commandes sur la façon d'exécuter le :doc:`Romi robot </docs/romi-robot/index>`.
zh_cn: •RomiReference(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/romireference>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RomiReference>`__): 基于指令的Romi机器人运行示例。(见41）

source: **Mechanism2d** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mechanism2d>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Mechanism2d>`__): A simple example of using :doc:`Mechanism2d </docs/software/dashboards/glass/mech2d-widget>`.
fr_ca: **Mechanism2d** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mechanism2d>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Mechanism2d>`__): Un exemple simple d’utilisation de :doc:`Mechanism2d </docs/software/dashboards/glass/mech2d-widget>`.

source: **Arcade Drive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArcadeDrive>`__): Demonstrates a simple differential drive implementation using "arcade"-style controls through the ``DifferentialDrive`` class.
es_mx: **Arcade Drive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArcadeDrive>`__): Demuestra una implementación de un manejo diferencial simple usando el estilo de control "arcade" mediante la clase ``DifferentialDrive``.
tr_tr: **Arcade Drive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArcadeDrive> `__): "arcade"-tarzı kontrolleri kullanarak basit bir diferansiyel sürücü uygulamasını ``DifferentialDrive`` sınıfı aracılığıyla gösterir.

source: **Arcade Drive Xbox Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrivexboxcontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArcadeDriveXboxController>`__): Demonstrates the same functionality seen in the previous example, except using an ``XboxController`` instead of an ordinary joystick.
es_mx: **Arcade Drive Xbox Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrivexboxcontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArcadeDriveXboxController>`__): Demuestra la misma funcionalidad vista en el ejemplo anterior, excepto que se usa un ``XboxController`` en vez de un control ordinario.
tr_tr: **Arcade Drive Xbox Denetleyicisi** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrivexboxcontroller>`__ , `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArcadeDriveXboxController>`__): Sıradan bir joystick yerine bir ``XboxController`` kullanılması dışında, önceki örnekte görülen aynı işlevselliği gösterir.

source: **Getting Started** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gettingstarted>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GettingStarted>`__): Demonstrates a simple autonomous routine that drives forwards for two seconds at half speed.
es_mx: **Empezando** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gettingstarted>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GettingStarted>`__): Demuestra una rutina de autónomo simple que avanza derecho por dos segundos a velocidad media.
tr_tr: **Başlarken** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gettingstarted>` __, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GettingStarted> `__): Yarı hızda iki saniye ileri götüren basit bir otonom rutin gösterir.

source: **Mecanum Drive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumdrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MecanumDrive>`__): Demonstrates a simple mecanum drive implementation using the ``MecanumDrive`` class.
es_mx: **Mecanum Drive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumdrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MecanumDrive>`__): Demuestra una implementación de manejo de mecanum simple usando la clase ``MecanumDrive``.
tr_tr: **Mecanum Drive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumdrive>` __, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MecanumDrive> `__):``MecanumDrive``sınıfını kullanarak basit bir mecanum sürücü uygulamasını gösterir.

source: **Motor Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrol>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MotorControl>`__): Demonstrates how to control the output of a motor with a joystick.
es_mx: **Motor Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrol>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MotorControl>`__): Demuestra como controlar la salida de un motor con un control/joystick.
tr_tr: **Motor Kontrolörü** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrol>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MotorControl>`__): Bir motorun çıkışının bir kumanda çubuğu ile nasıl kontrol edileceğini gösterir.

source: **Motor Control With Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrolencoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MotorControlEncoder>`__): Identical to the above example, except with the addition of an encoder to read the motor position.
es_mx: **Motor Control Con Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrolencoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MotorControlEncoder>`__): Idéntico como el ejemplo anterior, excepto que tiene como adición un encoder para leer la posición del motor.
tr_tr: **Motor Control With Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrolencoder>` __ , `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MotorControlEncoder>` __): Motor pozisyonunu okumak için bir kodlayıcının eklenmesi dışında yukarıdaki örnekle aynıdır.

source: **Simple Vision** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/quickvision>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/QuickVision>`__): Demonstrates how to stream video from a USB camera to the dashboard.
es_mx: **Simple Vision** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/quickvision>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/QuickVision>`__): Demuestra como transmitir un video de una cámara USB a la dashboard.
tr_tr: **Simple Vision** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/quickvision>` __,`C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/QuickVision> `__): Bir USB kameradan kontrol paneline video akışının nasıl yapıldığını gösterir.

source: **Relay** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/relay>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Relay>`__): Demonstrates the use of the ``Relay`` class to control a relay output with a set of joystick buttons.
es_mx: **Relay** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/relay>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Relay>`__): Demuestra el uso de la clase ``Relay`` para controlar la salida relay con un ajuste de botones del control.
tr_tr: **Relay** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/relay>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Relay> `__): Bir dizi kumanda kolu düğmesiyle bir röle çıkışını kontrol etmek için ``Relay`` sınıfının kullanımını gösterir.

source: **Solenoids** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/solenoid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Solenoid>`__): Demonstrates the use of the ``Solenoid`` and ``DoubleSolenoid`` classes to control solenoid outputs with a set of joystick buttons.
es_mx: **Solenoides** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/solenoid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Solenoid>`__): Demuestra el uso de las clases ``Solenoid`` y ``DoubleSolenoid`` para controlar salidas de solenoides con un set de botones de control/joystick.
tr_tr: **Solenoids** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/solenoid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/Solenoid>`__): Solenoid çıkışlarını bir dizi kumanda kolu düğmesiyle kontrol etmek için ``Solenoid`` ve ``DoubleSolenoid`` sınıflarının kullanımını gösterir.

source: **TankDrive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/tankdrive>`__): Demonstrates a simple differential drive implementation using "tank"-style controls through the ``DifferentialDrive`` class.
es_mx: **TankDrive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/tankdrive>`__): Demuestra la implementación de un diferencial drive simple usando el estilo de control "tanque" mediante la clase ``DifferentialDrive``.
tr_tr: **TankDrive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/tankdrive>` __): ``DifferentialDrive`` sınıfı aracılığıyla "tank" tarzı kontrolleri kullanan basit bir diferansiyel sürücü uygulamasını gösterir.

source: **Tank Drive Xbox Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/tankdrivexboxcontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/TankDriveXboxController>`__): Demonstrates the same functionality seen in the previous example, except using an ``XboxController`` instead of an ordinary joystick.
es_mx: **Tank Drive Xbox Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/tankdrivexboxcontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/TankDriveXboxController>`__): Demuestra la misma función vista en el ejemplo anterior, excepto que usa un ``XboxController`` en vez de un control normal.
tr_tr: **Tank Drive Xbox Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/tankdrivexboxcontroller>`__ , `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/TankDriveXboxController>`__): Sıradan bir joystick yerine bir ``XboxController`` kullanılması dışında, önceki örnekte görülen aynı işlevselliği gösterir.

source: **DifferentialDriveBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/differentialdrivebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DifferentialDriveBot>`__): Demonstrates an advanced differential drive implementation, including encoder-and-gyro odometry through the ``DifferentialDriveOdometry`` class, and composition with PID velocity control through the ``DifferentialDriveKinematics`` and ``PIDController`` classes.
es_mx: **DifferentialDriveBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/differentialdrivebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DifferentialDriveBot>`__): Demuestra una implementación avanzada de accionamiento diferencial, incluida la odometría de codificador y giroscopio a través de la clase ``DifferentialDriveOdometry`` y la composición con las clases de control de velocidad PID ``DifferentialDriveKinematics`` y ``PIDController``.
tr_tr: **DifferentialDriveBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/differentialdrivebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DifferentialDriveBot>`__): ``DifferentialDriveOdometry`` sınıfı aracılığıyla kodlayıcı ve cayro odometrisi ve ``DifferentialDriveKinematics`` ve ``PIDController`` sınıfları aracılığıyla PID hız kontrollü kompozisyon dahil olmak üzere gelişmiş bir diferansiyel sürücü uygulamasını gösterir.

source: **Elevator with profiled PID controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorprofiledpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ElevatorProfiledPID>`__): Demonstrates the use of the ``ProfiledPIDController`` class to control the position of an elevator mechanism.
es_mx: **Elevador con un controlador PID perfilado** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorprofiledpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ElevatorProfiledPID>`__): Demuestra el uso de la clase ``ProfiledPIDController`` para controlar la posición de un mecanismo de elevador.
tr_tr: **Elevator with profiled PID controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorprofiledpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ElevatorProfiledPID>`__): Bir asansör mekanizmasının konumunu kontrol etmek için ``ProfiledPIDController``sınıfının kullanımını gösterir.

source: **Elevator with trapezoid profiled PID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatortrapezoidprofile>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ElevatorTrapezoidProfile>`__): Demonstrates the use of the ``TrapezoidProfile`` class in conjunction with a "smart motor controller" to control the position of an elevator mechanism.
es_mx: **Elevador con un trapezoide PID perfilado** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatortrapezoidprofile>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ElevatorTrapezoidProfile>`__): Demuestra el uso de la clase ``TrapezoidProfile`` en conjunto con un "controlador de motor inteligente" para controlar la posición de un mecanismo de elevador.
tr_tr: **Elevator with trapezoid profiled PID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatortrapezoidprofile>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ElevatorTrapezoidProfile>`__): Bir asansörün konumunu kontrol etmek için bir "akıllı motor kontrolörü" ile birlikte ``TrapezoidProfile``sınıfının kullanımını gösterir mekanizma.

source: **Gyro Mecanum** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyromecanum>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GyroMecanum>`__): Demonstrates field-oriented control of a mecanum robot through the ``MecanumDrive`` class in conjunction with a gyro.
es_mx: **Gyro Mecanum** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyromecanum>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GyroMecanum>`__): Demuestra el control orientado a cancha de un robot mecanum mediante la clase ``MecanumDrive`` en conjunto con un giroscopio.
tr_tr: **Gyro Mecanum** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyromecanum>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GyroMecanum>`__): Bir jiroskopla birlikte ``MecanumDrive`` sınıfı aracılığıyla bir mecanum robotun saha odaklı kontrolünü gösterir.
