Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/wpilib-examples.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: **PacGoat** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/pacgoat>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/PacGoat>`__): A full command-based robot project from FRC Team 190's 2014 robot. Uses the legacy version of the command framework; categorized as miscellaneous to avoid confusion.
es_mx: **PacGoat** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/pacgoat>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/PacGoat>`__): Un proyecto de robot completo basado en comandos del robot 2014 de FRC Team 190. Utiliza la versión heredada del marco de comandos; categorizados como varios para evitar confusiones.
tr_tr: **PacGoat** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/pacgoat>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/PacGoat>`__): FRC Team 190'ın 2014 robotundan tam bir komut tabanlı robot projesi. Komut çerçevesinin eski sürümünü kullanır; karışıklığı önlemek için çeşitli olarak kategorize edilmiştir.

source: **Shuffleboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/shuffleboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ShuffleBoard>`__): Demonstrates configuring tab/widget layouts on the "Shuffleboard" dashboard from robot code through the ``Shuffleboard`` class's fluent builder API.
es_mx: **Shuffleboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/shuffleboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ShuffleBoard>`__): Demuestra la configuración de diseños de pestañas/widgets en el dashboard "Shuffleboard" desde el código del robot a través de la fluida API de construcción de la clase ``Shuffleboard``.
tr_tr: **Shuffleboard** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/shuffleboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ShuffleBoard>`__): "Shuffleboard" kontrol panelindeki tab/widget düzenlerini, ```Shuffleboard`` sınıfının akıcı oluşturucu API'si aracılığıyla robot kodundan yapılandırmayı gösterir.

source: **RomiReference** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/romireference>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RomiReference>`__): A command based example of how to run the :doc:`Romi robot </docs/romi-robot/index>`.
tr_tr: **RomiReference** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/romireference>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RomiReference>`__): Romi robotunun nasıl çalıştırılacağına dair komuta dayalı bir örnek.</docs/romi-robot/index>`.
