Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/wpilib-examples.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: WPILib Example Projects
es_mx: Proyectos ejemplo de WPILib
fr_ca: Exemples fournis de Projets WPILib
tr_tr: WPILib Örnek Projeler
zh_cn: WPILib 示例项目

source: While every attempt is made to keep WPILib examples functional, they are *not* intended to be used "as-is." At the very least, robot-specific constants will need to be changed for the code to work on a user robot. Many empirical constants have their values "faked" for demonstration purposes. Users are strongly encouraged to write their own code (from scratch or from an existing template) rather than copy example code.
es_mx: Mientras todos los intentos son hechos para mantener los ejemplos de WPILib funcionando, no están con la intención de ser la única manera de hacerlo. Al final, las constantes de robot específicos necesitarán cambiarse por el código para funcionar en un robot de usuario. Muchas constantes empíricas tienen valores "falsificados" para propósitos demostrativos. Los usuarios alientan fuertemente en escribir sus propios códigos (desde cero o desde una plantilla existente) en vez de copiar el código de ejemplo.
fr_ca: Bien qu'on ne ménage aucun effort pour maintenir les exemples WPILib fonctionnels, ils ne sont *pas* destinés à être utilisés "tel quel". À tout le moins, les valeurs constantes spécifiques aux robots devront être modifiées pour que le code fonctionne sur le robot de l'utilisateur. Beaucoup de constantes empiriques ont des valeurs "factices" à des fins de démonstration. Les utilisateurs sont fortement encouragés à écrire leur propre code (à partir de zéro ou à partir d’un modèle existant) plutôt que de copier le code d’exemple et de l'utiliser tel quel.
tr_tr: WPILib örneklerini işlevsel tutmak için her girişimde bulunulsa da, "olduğu gibi" kullanılması *amaçlanmamıştır*. Kodun bir kullanıcı robotunda çalışması için en azından robota özgü sabitlerin değiştirilmesi gerekecektir. Birçok ampirik sabitin değerleri, gösterim amacıyla "sahte" hale getirilmiştir. Kullanıcıların, örnek kodu kopyalamak yerine kendi kodlarını (sıfırdan veya mevcut bir şablondan) yazmaları şiddetle tavsiye edilir.
zh_cn: 虽然我们要尽力保持WPILib示例的功能，但并不意味着可以直接使用示例代码。如果要使代码在用户的机器人上工作，至少要更改特定于机器人的常量。为了演示的目的，许多需要实际测试得出的常数的值都被“伪造”了。我们强烈鼓励用户编写自己的代码（从零开始或从现有模板开始），而不是复制示例代码。

source: WPILib example projects demonstrate a large number of library features and use patterns. Projects range from simple demonstrations of a single functionality to complete, competition-capable robot programs. All of these examples are available in VS Code by entering :kbd:`Ctrl+Shift+P`, then selecting `WPILib: Create a new project` and choosing example.
es_mx: Los proyectos de ejemplo de WPILib demuestran un gran número de características en librerías y uso de patrones. El rango de proyectos es para simples demostraciones de una sola función a completar, programas para robots de competencias. Todos estos ejemplos están disponibles en VS Code entrando a :kbd:`Ctrl+Shift+P`, después seleccionar `WPILib: Create a new project` y elegir un ejemplo.
fr_ca: Les exemples de projets WPILib illustrent un grand nombre de fonctionnalités de bibliothèque et de modèles d'utilisation. Les projets vont de la simple démonstration d'une seule fonctionnalité à des programmes robotiques complets et compétitifs. Tous ces exemples sont disponibles dans VS Code en entrant :kbd:`Ctrl+Shift+P`, puis en sélectionnant `WPILib: Create a new project` et en choisissant l'exemple.
tr_tr: WPILib örnek projeleri, çok sayıda kitaplık özelliği ve kullanım desenleri gösterir. Projeler, tek bir işlevin basit gösterimlerinden eksiksiz, rekabete uygun robot programlarına kadar çeşitlilik gösterir. Bu örneklerin tümü VS Code'da şu şekilde kullanılabilir :kbd:`Ctrl+Shift+P`, ardından `WPILib: Create a new project` ve örnek seçilerek.
zh_cn: WPILib示例项目演示了许多库功能和使用模式。项目范围从单一功能的简单演示到完整的具有竞争能力的机器人程序。输入Ctrl + Shift + P键，然后选择`WPILib: Create a new project` 并选择示例，即可在VS Code中使用所有这些示例。

source: Basic Examples
es_mx: Ejemplos básicos
fr_ca: Exemples de base
tr_tr: Temel Örnekler
zh_cn: 基本范例

source: These examples demonstrate basic/minimal robot functionality. They are useful for beginning teams who are gaining initial familiarity with robot programming, but are highly limited in functionality.
es_mx: Éstos ejemplos demuestran funciones básicas/mínimas para el robot. Son útiles para equipos que van empezando que van adquiriendo familiaridad con la programación de un robot, pero son realmente limitadas en su funcionalidad.
fr_ca: Ces exemples démontrent la fonctionnalité de base/minimale du robot. Ils sont utiles pour des équipes recrues qui s'initient à la programmation de robots, mais sont grandement limités en terme de fonctionnalité.
tr_tr: Bu örnekler, temel / minimum robot işlevselliğini gösterir. Robot programlamaya ilk aşina olan, ancak işlevsellik açısından oldukça sınırlı olan yeni başlayan ekipler için kullanışlıdır.
zh_cn: 这些示例演示了基本的机器人功能。对于刚开始熟悉机器人编程但机器人功能受到严重限制的入门团队，它们很有用。

source: **Arcade Drive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArcadeDrive>`__): Demonstrates a simple differential drive implementation using "arcade"-style controls through the ``DifferentialDrive`` class.
fr_ca: **ArcadeDrive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArcadeDrive>`__): Démontre une implémentation d'un simple entraînement différentiel à l’aide de contrôles de style "arcade" à travers la classe ``DifferentialDrive``.
zh_cn: •Arcade Drive (Java<https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArcadeDrive> __)通过“Differentialdrive”类使用“arcade”风格的控制演示了实现简单机器人差速驱动的方法

source: **Arcade Drive Xbox Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrivexboxcontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArcadeDriveXboxController>`__): Demonstrates the same functionality seen in the previous example, except using an ``XboxController`` instead of an ordinary joystick.
fr_ca: **Arcade Drive Xbox Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrivexboxcontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArcadeDriveXboxController>`__): Démontre la même fonctionnalité que dans l'exemple précédent, sauf en utilisant un ``XboxController`` au lieu d'un joystick ordinaire.
zh_cn: •Arcade Drive Xbox Controller(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/arcadedrivexboxcontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArcadeDriveXboxController>`__):与上一案例实现了相同的功能；他们之间的区别在于此案例使用了XboxController而不是普通的摇杆

source: **Getting Started** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gettingstarted>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GettingStarted>`__): Demonstrates a simple autonomous routine that drives forwards for two seconds at half speed.
fr_ca: **Getting Started** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gettingstarted>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GettingStarted>`__): Démontre une routine autonome simple qui avance pendant deux secondes à demi-vitesse.
zh_cn: •Getting Started(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gettingstarted>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GettingStarted>`__):这段代码演示了一个简单的自动阶段的驱动例程——半速前进两秒

source: **Mecanum Drive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumdrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumDrive>`__): Demonstrates a simple mecanum drive implementation using the ``MecanumDrive`` class.
fr_ca: **Mecanum Drive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumdrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumDrive>`__): Démontre une implémentation simple d'un lecteur mecanum à l'aide de la classe ``MecanumDrive``.
zh_cn: •Mecanum Drive(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumdrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumDrive>`__):这一使用了MecanumDrive类的代码实现了一个简单的麦克纳姆轮的驱动

source: **Motor Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrol>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MotorControl>`__): Demonstrates how to control the output of a motor with a joystick.
fr_ca: **Motor Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrol>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MotorControl>`__): Démontre comment contrôler la sortie d'un moteur avec un joystick.
zh_cn: •Motor Controller(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrol>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MotorControl>`__):演示如何使用一个摇杆控制电机的输出

source: **Motor Control With Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrolencoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MotorControlEncoder>`__): Identical to the above example, except with the addition of an encoder to read the motor position.
fr_ca: **Motor Control With Encoder** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrolencoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MotorControlEncoder>`__): Identique à l'exemple ci-dessus, sauf avec l'ajout d'un encodeur pour lire la position du moteur.
zh_cn: •Motor Control With Encoder(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/motorcontrolencoder>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MotorControlEncoder>`__):与上述例子相同，但增加了一个编码器来读取电机的位置

source: **Simple Vision** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/quickvision>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/QuickVision>`__): Demonstrates how to stream video from a USB camera to the dashboard.
fr_ca: **Simple Vision** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/quickvision>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/QuickVision>`__): Démontre comment diffuser une vidéo d'une caméra USB vers le tableau de bord.
zh_cn: •Simple Vision (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/quickvision>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/QuickVision>`__):演示如何从USB摄像头转换视频到Driver Station的仪表板中

source: **Relay** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/relay>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Relay>`__): Demonstrates the use of the ``Relay`` class to control a relay output with a set of joystick buttons.
fr_ca: **Relay** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/relay>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Relay>`__): Démontre l’utilisation de la classe ``Relay`` pour contrôler une sortie de relais avec un ensemble de boutons d'un joystick.
zh_cn: •Relay**Relay** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/relay>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Relay>`__):演示了使用Relay类来通过一组摇杆的按钮控制继电器输出

source: **Solenoids** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/solenoid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Solenoid>`__): Demonstrates the use of the ``Solenoid`` and ``DoubleSolenoid`` classes to control solenoid outputs with a set of joystick buttons.
fr_ca: **Solenoids** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/solenoid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Solenoid>`__): Démontre l'utilisation des classes ``Solenoid`` et ``DoubleSolenoid`` pour contrôler les sorties de solénoïde avec un ensemble de boutons de joystick.
zh_cn: •Solenoids (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/solenoid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/Solenoid>`__):演示了Solenoid和DoubleSolenoid类的使用，使用操纵杆按钮控制电磁阀输出。

source: **TankDrive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/tankdrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/TankDrive>`__): Demonstrates a simple differential drive implementation using "tank"-style controls through the ``DifferentialDrive`` class.
fr_ca: **TankDrive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/tankdrive>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/TankDrive>`__): Démontre une implémentation simple d'entraînement différentiel utilisant des commandes de style "tank" via la classe ``DifferentialDrive``.

source: **Tank Drive Xbox Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/tankdrivexboxcontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/TankDriveXboxController>`__): Demonstrates the same functionality seen in the previous example, except using an ``XboxController`` instead of an ordinary joystick.
fr_ca: **Tank Drive Xbox Controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/tankdrivexboxcontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/TankDriveXboxController>`__): Démontre la même fonctionnalité que dans l'exemple précédent, sauf en utilisant un ``XboxController`` au lieu d'un joystick ordinaire.
zh_cn: •TankDrive Xbox Controller(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/tankdrivexboxcontroller>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/TankDriveXboxController>`__):与上例实现了相同的功能；区别在于使用XboxController而不是普通的操纵杆

source: Control Examples
es_mx: Ejemplos de control
fr_ca: Exemples de contrôle (commande)
tr_tr: Kontrol Örnekleri
zh_cn: 控制示例

source: These examples demonstrate WPILib implementations of common robot controls. Sensors may be present, but are not the emphasized concept of these examples.
es_mx: Estos ejemplos demuestran las implementaciones de WPILib de controles de robot comunes. Los sensores pueden estar presentes, pero no son el concepto enfatizado de estos ejemplos.
fr_ca: Ces exemples illustrent les implémentations dans la WPILib de contrôles de robot courants. Les capteurs peuvent être présents, mais ils ne constituent pas le point focal dans ces exemples.
tr_tr: Bu örnekler, yaygın robot kontrollerinin WPILib uygulamalarını gösterir. Sensörler mevcut olabilir, ancak bu örneklerin vurgulanan konsepti değildir.
zh_cn: 这些示例演示了通用机器人控件的WPILib实现。可能存在传感器，但不是这些示例的重点概念。

source: **DifferentialDriveBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/differentialdrivebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DifferentialDriveBot>`__): Demonstrates an advanced differential drive implementation, including encoder-and-gyro odometry through the ``DifferentialDriveOdometry`` class, and composition with PID velocity control through the ``DifferentialDriveKinematics`` and ``PIDController`` classes.
fr_ca: **DifferentialDriveBot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/differentialdrivebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DifferentialDriveBot>`__): Démontre une implémentation avancée de l'entraînement différentiel, incluant l’odométrie (à base d'encodeurs et de gyroscope) à travers la classe ``DifferentialDriveOdometry`` ainsi qu'une composition avec la commande de vitesse PID à travers les classes ``DifferentialDriveKinematics`` et ``PIDController``.
zh_cn: •DifferentialDriveBot (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/differentialdrivebot>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DifferentialDriveBot>`__):演示了一个高级的机器人差速驱动方式的实现，包括通过DifferalDriveOdometry类的编码器和陀螺测程，以及通过DifferentialDriveKinematics和PIDController类的PID速度控制组成

source: **Elevator with profiled PID controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorprofiledpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorProfiledPID>`__): Demonstrates the use of the ``ProfiledPIDController`` class to control the position of an elevator mechanism.
fr_ca: **Elevator with profiled PID controller** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorprofiledpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorProfiledPID>`__): Démontre l'utilisation de la classe ``ProfiledPIDController`` pour contrôler la position d'un mécanisme élévateur.
zh_cn: • Elevator with profiled PID controller (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorprofiledpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorProfiledPID>`__):演示使用ProfiledPIDController类来控制电梯结构的位置

source: **Elevator with trapezoid profiled PID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatortrapezoidprofile>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorTrapezoidProfile>`__): Demonstrates the use of the ``TrapezoidProfile`` class in conjunction with a "smart motor controller" to control the position of an elevator mechanism.
fr_ca: **Elevator with trapezoid profiled PID** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatortrapezoidprofile>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorTrapezoidProfile>`__): Démontre l'utilisation de la classe ``TrapezoidProfile`` en conjonction avec un "contrôleur de moteur intelligent" pour contrôler la position d'un mécanisme élévateur.
zh_cn: • Elevator with trapezoid profiled PID(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatortrapezoidprofile>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorTrapezoidProfile>`__):演示使用TrapezoidProfile类结合一个“智能电机控制器”来控制电梯结构的位置

source: **Gyro Mecanum** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyromecanum>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroMecanum>`__): Demonstrates field-oriented control of a mecanum robot through the ``MecanumDrive`` class in conjunction with a gyro.
fr_ca: **Gyro Mecanum** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyromecanum>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroMecanum>`__): Démontre le contrôle orienté terrain d'un robot mecanum via la classe ``MecanumDrive`` en conjonction avec un gyroscope.
zh_cn: • Gyro Mecanum (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyromecanum>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroMecanum>`__):通过MecanumDrive类与陀螺仪连接演示了Mecanum机器人的领域导向控制
