Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/wpilib-examples.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: **Gyro Drive Commands** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__): Demonstrates the use of ``PIDCommand`` and ``ProfiledPIDCommand`` in conjunction with a gyro to turn a robot to face a specified heading and to stabilize heading while driving.
es_mx: **Comandos Gyro Drive** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__): Demuestra el uso de ``PIDCommand`` y ``ProfiledPIDCommand`` en conjunto con un gyro para girar un robot para que mire hacia un rumbo específico y para estabilizar el rumbo mientras conduce.
tr_tr: **Gyro Drive Commands** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__): ``PIDCommand`` ve ``ProfiledPIDCommand`` ın bir cayro ile birlikte bir robotu belirli bir yöne bakacak şekilde döndürmek ve sürüş sırasında istikameti sabitlemek için kullanımını gösterir.

source: **Inlined Hatchbot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HatchbotInlined>`__): A complete set of robot code for a simple hatch-delivery bot typical of the 2017 FRC game *Steamworks*. Commands are written in an "inline" style, in which explicit subclassing of ``Command`` is avoided.
es_mx: **Inlined Hatchbot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HatchbotInlined>`__): Un conjunto completo de código de robot para un simple bot de entrega de escotillas típico del juego FRC de 2017 *Steamworks*. Los comandos están escritos en un estilo "en línea", en el que se evita la subclasificación explícita de ``Comando``.
tr_tr: **Inlined Hatchbot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HatchbotInlined>`__): 2017 FRC oyunu *Steamworks* 'e özgü basit bir tarama teslimat botu için eksiksiz bir robot kodu seti. Komutlar, ``Command`` un açık alt sınıflamasından kaçınıldığı bir "inline" tarzda yazılır.

source: **Traditional Hatchbot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__): A complete set of robot code for a simple hatch-delivery bot typical of the 2017 FRC game *Steamworks*. Commands are written in a "traditional" style, in which subclasses of ``Command`` are written for each robot action.
es_mx: **Traditional Hatchbot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__): Un conjunto completo de código de robot para un simple bot de entrega de escotillas típico del juego FRC de 2017 *Steamworks*. Los comandos están escritos en un estilo "tradicional", en el que se escriben subclases de ``Comando`` para cada acción del robot.
tr_tr: **Traditional Hatchbot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__): 2017 FRC oyunu*Steamworks*.'e özgü basit bir tarama teslimat botu için eksiksiz bir robot kodu seti. Komutlar, her robot eylemi için ``Command`` alt sınıflarının yazıldığı "geleneksel" bir tarzda yazılır.

source: **MecanumControllerCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumcontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MecanumControllerCommand>`__): Demonstrates trajectory generation and following with a mecanum drive using the ``TrajectoryGenerator`` and ``MecanumControllerCommand`` classes.
es_mx: **MecanumControllerCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumcontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MecanumControllerCommand>`__): Demuestra la generación y el seguimiento de trayectorias con una unidad mecanum utilizando las clases ``TrajectoryGenerator`` y ``MecanumControllerCommand``.
tr_tr: **MecanumControllerCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumcontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/MecanumControllerCommand>`__):`TrajectoryGenerator`` ve ``MecanumControllerCommand`` sınıflarını kullanarak bir mecanum sürücü ile yörünge oluşturma ve takibi gösterir.

source: **RamseteCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__): Demonstrates trajectory generation and following with a differential drive using the ``TrajectoryGenerator`` and ``RamseteCommand`` classes. A matching step-by-step tutorial can be found :ref:`here <docs/software/examples-tutorials/trajectory-tutorial/index:Trajectory Tutorial>`.
es_mx: **RamseteCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__): Demuestra la generación de trayectorias y el seguimiento con una unidad diferencial utilizando las clases ``TrajectoryGenerator`` y ``TrajectoryGenerator``. Se puede encontrar un tutorial paso a paso correspondiente :ref:`aquí <docs/software/examples-tutorials/trajectory-tutorial/index:Trajectory Tutorial>`.
tr_tr: **RamseteCommand** (``Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__): ``TrajectoryGenerator`` ve ``RamseteCommand`` sınıflarını kullanarak bir diferansiyel sürücü ile yörünge oluşturmayı ve takibini gösterir. Eşleşen bir adım adım öğretici burada bulunabilir: :ref:`here <docs/software/examples-tutorials/trajectory-tutorial/index:Trajectory Tutorial>`.

source: **Scheduler Event Logging** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/schedulereventlogging>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SchedulerEventLogging>`__): Demonstrates the use of scheduler event actions to log dashboard event markers whenever a command starts, ends, or is interrupted.
es_mx: **Registro de Eventos del Programador** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/schedulereventlogging>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SchedulerEventLogging>`__): Demuestra el uso de acciones de eventos del programador para registrar marcadores de eventos la dashboard cada vez que un comando comienza, finaliza o se interrumpe.
tr_tr: **Scheduler Event Logging** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/schedulereventlogging>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SchedulerEventLogging>`__): Bir komut başladığında, sona erdiğinde veya kesintiye uğradığında gösterge tablosu olay işaretleyicilerini günlüğe kaydetmek için zamanlayıcı olay eylemlerinin kullanımını gösterir.

source: **Select Command Example** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SelectCommand>`__): Demonstrates the use of the ``SelectCommand`` class to run one of a selection of commands depending on a runtime-evaluated condition.
es_mx: **Seleccionar Comando Ejemplo** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SelectCommand>`__): Demuestra el uso de la clase ``SelectCommand`` para ejecutar uno de una selección de comandos dependiendo de una condición evaluada en tiempo de ejecución.
tr_tr: **Select Command Example** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SelectCommand>`__): Çalışma zamanı tarafından değerlendirilen bir koşula bağlı olarak komutlardan birini çalıştırmak için ``SelectCommand`` sınıfının kullanımını gösterir.

source: **SwerveControllerCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervecontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SwerveControllerCommand>`__): Demonstrates trajectory generation and following with a swerve drive using the ``TrajectoryGenerator`` and ``SwerveControllerCommand`` classes.
es_mx: **SwerveControllerCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervecontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SwerveControllerCommand>`__): Demuestra la generación de trayectorias y el seguimiento con un desvío usando las clases ``TrajectoryGenerator`` y ``SwerveControllerCommand``.
tr_tr: **SwerveControllerCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervecontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SwerveControllerCommand>`__):``TrajectoryGenerator`` ve ``SwerveControllerCommand`` sınıflarını kullanarak yörünge oluşturmayı ve takip etmeyi gösterir.

source: **StateSpaceFlywheel** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel>`__): Demonstrates state-space control of a flywheel.
es_mx: **StateSpaceFlywheel** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel>`__): Demuestra el control del espacio de estado de un volante.
tr_tr: **StateSpaceFlywheel** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel>`__): Bir dönentekerin durum uzayı kontrolünü gösterir.

source: **StateSpaceFlywheelSysId** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheelsysid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheelSysId>`__): Demonstrates state-space control using FRC Characterization's System Identification for controlling a flywheel.
es_mx: **StateSpaceFlywheelSysId** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheelsysid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheelSysId>`__): Demuestra el control del espacio de estado usando el Sistema de Identificación de FRC Characterization para controlar un volante.
tr_tr: **StateSpaceFlywheelSysId** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheelsysid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheelSysId>`__): Bir volanı kontrol etmek için FRC Characterization's System Identification kullanarak durum-uzayı kontrolünü gösterir.

source: **StateSpaceElevator** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceelevator>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceElevator>`__): Demonstrates state-space control of an elevator.
es_mx: **StateSpaceElevator** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceelevator>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceElevator>`__): Demuestra el control del espacio del estado de un elevador.
tr_tr: **StateSpaceElevator** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceelevator>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceElevator>`__): Bir asansörün durum alanı kontrolünü gösterir.

source: **StateSpaceArm** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacearm>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceArm>`__): Demonstrates state-space control of an Arm.
es_mx: **StateSpaceArm** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacearm>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceArm>`__): Demuestra el control del espacio de estado de un Brazo.
tr_tr: **StateSpaceArm** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacearm>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceArm>`__): Bir Kolun durum-uzay kontrolünü gösterir.

source: **StateSpaceDriveSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacedifferentialdrivesimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceDifferentialDriveSimulation>`__): Demonstrates state-space control of a differential drivetrain in combination with a RAMSETE path following controller and Field2d class.
es_mx: **StateSpaceDriveSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacedifferentialdrivesimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceDifferentialDriveSimulation>`__): Demuestra el control del espacio de estado de un tren motriz diferencial en combinación con un controlador de seguidor de camino RAMSETE y clase Field2d.
tr_tr: **StateSpaceDriveSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacedifferentialdrivesimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/StateSpaceDifferentialDriveSimulation>`__): Controller ve Field2d sınıfını takip eden bir RAMSETE yolu ile kombinasyon halinde bir diferansiyel aktarma organının durum-alanı kontrolünü gösterir.

source: **ElevatorSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ElevatorSimulation>`__): Demonstrates the use of physics simulation with a simple elevator.
es_mx: **ElevatorSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ElevatorSimulation>`__): Demuestra el uso de la simulación física con un elevador simple.
tr_tr: **ElevatorSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ElevatorSimulation>`__): Basit bir asansörle fizik simülasyonunun kullanımını gösterir.

source: **ArmSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArmSimulation>`__): Demonstrates the use of physics simulation with a simple single-jointed arm.
es_mx: **ArmSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArmSimulation>`__): Demuestra el uso de una simulación física con un simple brazo de una articulación.
tr_tr: **ArmSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ArmSimulation>`__): Basit tek eklemli kol ile fizik simülasyonunun kullanımını gösterir.

source: **Addressable LED** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/addressableled>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/AddressableLED>`__): Demonstrates the use of the ``AddressableLED`` class to control RGB LEDs for robot decoration and/or driver feedback.
es_mx: **Addressable LED** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/addressableled>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/AddressableLED>`__): Demuestra el uso de la clase ``AddressableLED`` a un control de RGB LED para la decoración del robot y/o retroalimentación para el driver.
tr_tr: **Addressable LED** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/addressableled>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/AddressableLED>`__): Robot dekorasyonu ve/veya sürücü geri bildirimi için RGB LED'leri kontrol etmek için `` AddressableLED '' sınıfının kullanımını gösterir.

source: **DMA** (`C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DMA>`__): Demonstrates the use of DMA (Direct Memory Access) to read from sensors without using the RoboRIO's CPU (C++ only).
es_mx: **DMA** (`C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DMA>`__): Demuestra el uso de DMA (Acceso directo a memoria) para leer de los sensores sin usar la CPU de RoboRIO (solo C ++).
tr_tr: **DMA** (`C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/DMA>`__): RoboRIO'nun CPU'sunu (yalnızca C++) kullanmadan sensörlerden okumak için DMA'nın (Doğrudan Bellek Erişimi) kullanımını gösterir.

source: **HAL** (`C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HAL>`__): Demonstrates the use of HAL (Hardware Abstraction Layer) without the use of the rest of WPILib. This example is for advanced users (C++ only).
es_mx: **HAL** (`C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HAL>`__): Demuestra el uso de HAL (Capa de abstracción de hardware) sin el uso del resto de WPILib. Este ejemplo es para usuarios avanzados (solo C++).
tr_tr: **HAL** (`C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HAL>`__): WPILib'in geri kalanını kullanmadan HAL (Donanım Soyutlama Katmanı-Hardware Abstraction Layer) kullanımını gösterir. Bu örnek ileri düzey kullanıcılar içindir (yalnızca C++).

source: **HID Rumble** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hidrumble>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HidRumble>`__): Demonstrates the use of the "rumble" functionality for tactile feedback on supported HIDs (such as XboxControllers).
es_mx: **HID Rumble** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hidrumble>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HidRumble>`__): Demuestra el uso de la funcionalidad "rumble" para la retroalimentación táctil en HID compatibles (como XboxControllers).
tr_tr: **HID Rumble** (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hidrumble>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HidRumble>`__): Desteklenen HID'lerde (XboxControllers gibi) dokunsal geri bildirim için "rumble" işlevinin kullanımını gösterir.
