Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/wpilib-examples.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: **Gyro Drive Commands** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__): Demonstrates the use of ``PIDCommand`` and ``ProfiledPIDCommand`` in conjunction with a gyro to turn a robot to face a specified heading and to stabilize heading while driving.
fr_ca: **Gyro Drive Commands** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__): Démontre l'utilisation de ``PIDCommand`` et ``ProfiledPIDCommand`` en conjonction avec un gyroscope pour faire tourner un robot pour faire face à un cap spécifié et pour stabiliser le cap pendant la conduite.
zh_cn: •Gyro Drive Commands (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/gyrodrivecommands>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/GyroDriveCommands>`__):演示使用PIDCommand和ProfiledPIDCommand与陀螺仪结合，使机器人始终朝向一个特定的方向并在驾驶时稳定朝向

source: **Inlined Hatchbot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotInlined>`__): A complete set of robot code for a simple hatch-delivery bot typical of the 2019 FRC game *Destination: Deep Space*. Commands are written in an "inline" style, in which explicit subclassing of ``Command`` is avoided.
fr_ca: **Inlined Hatchbot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotInlined>`__): Un ensemble complet de code d'un simple robot typique pourvu d'une livraison à l’écoutille du jeu FRC 2019 *Destination: Deep Space*. Les commandes sont écrites dans un style "en ligne", dans lequel le sous-classement explicite de la classe ``Command`` est évité.
zh_cn: * *内联Hatchbot * * (Java & lt; https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined&gt __, c++ & lt; https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotInlined&gt的__):一套完整的机器人代码简单hatch-delivery机器人的典型2019 FRC游戏*目的地:深空*。命令是用“内联”风格写的，在这种风格中，显式地避免了对“命令”进行子类化。

source: **Traditional Hatchbot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__): A complete set of robot code for a simple hatch-delivery bot typical of the 2019 FRC game *Destination: Deep Space*. Commands are written in a "traditional" style, in which subclasses of ``Command`` are written for each robot action.
fr_ca: **Traditional Hatchbot** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__): Un ensemble complet de code d'un simple robot typique pourvu d'une livraison à l’écoutille du jeu FRC 2019 *Destination: Deep Space*. Les commandes sont écrites dans un style "traditionnel", dans lequel des sous-classes de la classe ``Command`` sont écrites pour chaque action du robot.
zh_cn: * *传统Hatchbot * * (Java & lt; https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional&gt __, c++ & lt; https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional&gt的__):一套完整的机器人代码简单hatch-delivery机器人的典型2019 FRC游戏*目的地:深空*。命令是用“传统”的风格写的，在“命令”的子类是为每个机器人动作写的。

source: **MecanumControllerCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumcontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumControllerCommand>`__): Demonstrates trajectory generation and following with a mecanum drive using the ``TrajectoryGenerator`` and ``MecanumControllerCommand`` classes.
fr_ca: **MecanumControllerCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumcontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumControllerCommand>`__): Démontre la génération et le suivi de trajectoire pour un entraînement de type mécanum à l’aide des classes ``TrajectoryGenerator`` et ``MecanumControllerCommand``.
zh_cn: •MecanumControllerCommand (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumcontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumControllerCommand>`__): 演示使用TrajectoryGenerator和MecanumControllerCommand类用麦克纳姆轮实现轨迹的生成与追踪

source: **RamseteCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__): Demonstrates trajectory generation and following with a differential drive using the ``TrajectoryGenerator`` and ``RamseteCommand`` classes. A matching step-by-step tutorial can be found :ref:`here <docs/software/pathplanning/trajectory-tutorial/index:Trajectory Tutorial>`.
fr_ca: **RamseteCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__): Démontre la génération et le suivi de trajectoire pour un entraînement de type différentiel à l'aide des classes ``TrajectoryGenerator`` et ``RamseteCommand``. Un tutoriel à tout point identique est disponible :ref:`ici <docs/software/pathplanning/trajectory-tutorial/index:Trajectory Tutorial>`.

source: **Scheduler Event Logging** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/schedulereventlogging>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SchedulerEventLogging>`__): Demonstrates the use of scheduler event actions to log dashboard event markers whenever a command starts, ends, or is interrupted.
fr_ca: **Scheduler Event Logging** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/schedulereventlogging>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SchedulerEventLogging>`__): Démontre l'utilisation des actions d'événement du planificateur pour consigner les marqueurs d'événements du tableau de bord chaque fois qu'une commande démarre, se termine ou est interrompue.
zh_cn: • Scheduler Event Logging (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/schedulereventlogging>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SchedulerEventLogging>`__):演示了使用调度器事件来记录仪表板事件标记，包括指令何时开始、结束或被中断

source: **Select Command Example** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SelectCommand>`__): Demonstrates the use of the ``SelectCommand`` class to run one of a selection of commands depending on a runtime-evaluated condition.
fr_ca: **Select Command Example** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SelectCommand>`__): Démontre l'utilisation de la classe ``SelectCommand`` pour exécuter l'une d'une sélection de commandes en fonction d'une condition évaluée à l'exécution.
zh_cn: •Select Command Example (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SelectCommand>`__):演示通过SelectCommand类的使用根据运行时计算的条件运行所选命令之一

source: **SwerveControllerCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervecontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SwerveControllerCommand>`__): Demonstrates trajectory generation and following with a swerve drive using the ``TrajectoryGenerator`` and ``SwerveControllerCommand`` classes.
fr_ca: **SwerveControllerCommand** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervecontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SwerveControllerCommand>`__): Démontre la génération et le suivi de trajectoire pour un entraînement de type swerve à l'aide des classes ``TrajectoryGenerator`` et ``SwerveControllerCommand``.
zh_cn: •SwerveControllerCommand(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervecontrollercommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SwerveControllerCommand>`__):使用TrajectoryGenerator和SwerveControllerCommand类演示轨迹生成和转向驱动。

source: State-Space Examples
es_mx: Ejemplos de Espacio de Estado
fr_ca: Exemples d'espace d'état
tr_tr: State-Space Durum Uzayı Örnekleri
zh_cn: 状态空间示例

source: These examples demonstrate the use of the :ref:`State-Space Control <docs/software/advanced-controls/state-space/state-space-intro:Introduction to State-Space Control>`.
es_mx: Estos ejemplos demuestran el uso del :ref:`State-Space Control <docs/software/advanced-controls/state-space/state-space-intro:Introduction to State-Space Control>`.
fr_ca: Ces exemples illustrent l'utilisation de la :ref:`commande espace-d’état <docs/software/advanced-controls/state-space/state-space-intro:Introduction to State-Space Control>`.
tr_tr: Bu örnekler, :ref:`State-Space Control<docs/software/advanced-controls/state-space/state-space-intro:Introduction to State-Space Control>`. 'ın kullanımını gösterir.
zh_cn: 这些示例演示了 :ref:`State-Space Control <docs/software/advanced-controls/state-space/state-space-intro:Introduction to State-Space Control>`的使用。

source: **StateSpaceFlywheel** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel>`__): Demonstrates state-space control of a flywheel.
fr_ca: **StateSpaceFlywheel** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel>`__): Démontre le contrôle de l'espace d'état d'un volant d'inertie.
zh_cn: •StateSpaceFlywheel(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel>`__): 演示了飞轮的状态空间控制

source: **StateSpaceFlywheelSysId** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheelsysid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheelSysId>`__): Demonstrates state-space control using SysId's System Identification for controlling a flywheel.
fr_ca: **StateSpaceFlywheelSysId** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheelsysid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheelSysId>`__): Démontre le contrôle de l'espace d'état à l'aide de l'identification du système de SysId pour contrôler un volant d'inertie.

source: **StateSpaceElevator** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceelevator>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceElevator>`__): Demonstrates state-space control of an elevator.
fr_ca: **StateSpaceElevator** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceelevator>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceElevator>`__): Démontre le contrôle de l'espace d'état d'un élévateur.
zh_cn: •StateSpaceElevator (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceelevator>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceElevator>`__): 演示电梯的状态空间控制

source: **StateSpaceArm** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacearm>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceArm>`__): Demonstrates state-space control of an Arm.
fr_ca: **StateSpaceArm** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacearm>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceArm>`__): Démontre le contrôle de l'espace d'état d'un bras.
zh_cn: •Statespacarm (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacearm>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceArm>`__): 演示机械臂的状态空间控制

source: **StateSpaceDriveSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacedifferentialdrivesimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceDifferentialDriveSimulation>`__): Demonstrates state-space control of a differential drivetrain in combination with a RAMSETE path following controller and Field2d class.
fr_ca: **StateSpaceDriveSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacedifferentialdrivesimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceDifferentialDriveSimulation>`__): Démontre le contrôle de l'espace d'états d'une transmission différentielle en combinaison avec un contrôleur de suivi de trajectoire RAMSETE et une classe Field2d.
zh_cn: •Statespacedrivessimulation(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespacedifferentialdrivesimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/StateSpaceDifferentialDriveSimulation>`__): 结合RAMSETE路径跟踪控制器和Field2d类演示差速传动系统的状态空间控制

source: Simulation Physics Examples
es_mx: Ejemplos de Simulación Física
fr_ca: Exemples de physique de simulation
tr_tr: Simülasyon Fiziği Örnekleri
zh_cn: 模拟物理实例

source: These examples demonstrate the use of the physics simulation.
es_mx: Estos ejemplos demuestran el uso de la simulación física.
fr_ca: Ces exemples démontrent l'utilisation de la simulation physique.
tr_tr: Bu örnekler, fizik simülasyonunun kullanımını göstermektedir.
zh_cn: 这些示例说明了物理模拟的用法。

source: **ElevatorSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorSimulation>`__): Demonstrates the use of physics simulation with a simple elevator.
fr_ca: **ElevatorSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorSimulation>`__): Démontre l'utilisation de la simulation physique avec un simple élévateur.
zh_cn: •ElevatorSimulation(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorSimulation>`__):通过一个简单的电梯结构演示物理模拟的使用

source: **ArmSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmSimulation>`__): Demonstrates the use of physics simulation with a simple single-jointed arm.
fr_ca: **ArmSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmSimulation>`__): Démontre l'utilisation de la simulation physique avec un bras à simple articulation.
zh_cn: •ArmSimulation (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmSimulation>`__): 通过单节机械臂演示了一个简单物理模拟的使用

source: **SimpleDifferentialDriveSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/simpledifferentialdrivesimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SimpleDifferentialDriveSimulation>`__): A barebones example of a basic drivetrain that can be used in simulation.
fr_ca: **SimpleDifferentialDriveSimulation** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/simpledifferentialdrivesimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SimpleDifferentialDriveSimulation>`__): Un exemple simple d’une base pilotable qui peut être utilisée dans la simulation.
zh_cn: •StateSpaceDrivesSimulation (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/simpledifferentialdrivesimulation>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SimpleDifferentialDriveSimulation>`__): 结合RAMSETE路径跟踪控制器和Field2d类演示了差速传动系统的状态空间控制

source: Miscellaneous Examples
es_mx: Ejemplos varios
fr_ca: Exemples divers
tr_tr: Çeşitli Örnekler
zh_cn: 其他例子

source: These examples demonstrate miscellaneous WPILib functionality that does not fit into any of the above categories.
es_mx: Estos ejemplos demuestran diversas funciones de WPILib que no encajan en ninguna de las categorías anteriores.
fr_ca: Ces exemples illustrent une variété de fonctionnalités WPILib qui ne s’inscrivent dans aucune des catégories ci-dessus.
tr_tr: Bu örnekler, yukarıdaki kategorilerin hiçbirine uymayan çeşitli WPILib işlevselliğini gösterir.
zh_cn: 这些示例演示了不属于上述任何类别的其他WPILib功能。

source: **Addressable LED** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/addressableled>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/AddressableLED>`__): Demonstrates the use of the ``AddressableLED`` class to control RGB LEDs for robot decoration and/or driver feedback.
fr_ca: **Addressable LED** (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/addressableled>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/AddressableLED>`__): Démontre l'utilisation de la classe ``AddressableLED`` pour contrôler les LED RVB pour la décoration du robot et/ou les repères visuels du conducteur.
zh_cn: •Addressable LED (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/addressableled>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/AddressableLED>`__): 演示了通过对AddressableLED类的使用控制RGB LED灯用于装饰机器人或向操纵手反馈信息

source: **HAL** (`C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HAL>`__): Demonstrates the use of HAL (Hardware Abstraction Layer) without the use of the rest of WPILib. This example is for advanced users (C++ only).
fr_ca: **HAL** (`C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HAL>`__): Démontre l'utilisation de HAL (Hardware Abstraction Layer) sans utiliser le reste de WPILib. Cet exemple est destiné aux utilisateurs avancés (C++ uniquement).
zh_cn: •HAL(`C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HAL>`__): 演示了HAL（硬件抽象层）的使用（不使用WPILib的其余部分）这个例子是针对进阶用户的（仅限C++)
