Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-1/control-system-hardware.po
Languages: fr_ca, tr_tr

source: Image of roboRIO courtesy of National Instruments. Image of DMC-60 courtesy of Digilent. Image of SD540 courtesy of Mindsensors. Images of Jaguar Motor Controller, Talon SRX, Victor 888, Victor SP, Victor SPX, and Spike H-Bridge Relay courtesy of VEX Robotics, Inc. Image of SPARK MAX courtesy of REV Robotics. Lifecam, PDP, PCM, SPARK, and VRM photos courtesy of *FIRST*\ |reg|. All other photos courtesy of AndyMark Inc.
fr_ca: Image de roboRIO courtoisie de National Instruments. Image de DMC-60 courtoisie de Digilent. Image de SD540 courtoisie de Mindsensors. Images de contrôleur de moteur Jaguar, Talon SRX, Victor 888, Victor SP, Victor SPX et Relais H-Bridge Spike courtoisie de VEX Robotics, Inc. Image de SPARK MAX courtoisie de REV Robotics. Photos des Lifecam, PDP, PCM, SPARK et VRM courtoisie de *FIRST*\ |reg|. Toutes les autres photos courtoisie de AndyMark Inc.
tr_tr: RoboRIO resmi National Instruments tarafından sağlanmıştır. DMC-60 resmi Digilent tarafından sağlanmıştır. SD540 resmi Mindsensors tarafından sağlanmıştır. Jaguar Motor Controller, Talon SRX, Victor 888, Victor SP, Victor SPX ve Spike H-Bridge Relay resimleri VEX Robotics, Inc. tarafından sağlanmıştır. SPARK MAX resmi REV Robotics tarafından sağlanmıştır. Lifecam, PDP, PCM, SPARK ve VRM fotoğrafları *FIRST*\ |reg| izniyle. Diğer tüm fotoğraflar AndyMark Inc.'in izniyle kullanılmıştır.
