Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-1/control-system-hardware.po
Languages: fr_ca, tr_tr

source: The Talon SRX motor controller is a CAN-enabled “smart motor controller” from Cross The Road Electronics/VEX Robotics. The Talon SRX has an electrically isolated metal housing for heat dissipation, making the use of a fan optional. The Talon SRX can be controlled over the CAN bus or PWM interface. When using the CAN bus control, this device can take inputs from limit switches and potentiometers, encoders, or similar sensors in order to perform advanced control such as limiting or PID(F) closed loop control on the device. For more information see the `Talon SRX User Manual <https://www.ctr-electronics.com/talon-srx.html>`__.
fr_ca: Le contrôleur de moteur Talon SRX est un "contrôleur de moteur intelligent" compatible avec CAN de la compagnie Cross The Road Electronics/VEX Robotics. Le Talon SRX a un boîtier métallique isolé électriquement pour la dissipation thermique, qui rend l'utilisation d'un ventilateur facultative. Le Talon SRX peut être contrôlé via le bus CAN ou l'interface PWM. Lors de l'utilisation de la commande de bus CAN, cette dispositif peut prendre des entrées des interrupteurs de fin de course et potentiomètres, encodeurs ou d'autre capteurs similaires pour effectuer du contrôle avancée comme la limitation de courant ou contrôle de boucle fermée PID(F) sur l'appareil. Pour d'autres informations veuillez consulter le `Manuel de l'Utilisateur Talon SRX <https://www.ctr-electronics.com/talon-srx.html>`__.
tr_tr: Talon SRX motor kontrolörü, Cross The Road Electronics / VEX Robotics'ten CAN özellikli bir "akıllı motor kontrolörü" dür. Talon SRX, ısı dağıtımı için elektriksel olarak izole edilmiş metal bir muhafazaya sahiptir, bu da isteğe bağlı bir fan kullanımını sağlar. Talon SRX, CAN veriyolu veya PWM arayüzü üzerinden kontrol edilebilir. CAN veriyolu kontrolünü kullanırken, bu cihaz, cihaz üzerinde sınırlama veya PID(F) kapalı döngü kontrolü gibi gelişmiş kontroller gerçekleştirmek için limit anahtarlarından ve potansiyometrelerden, kodlayıcılardan veya benzeri sensörlerden girişler alabilir. Daha fazla bilgi için bkz. `Talon SRX User Manual <https://www.ctr-electronics.com/talon-srx.html>`__.

source: CAN Talon SRX has been removed from WPILib. See this `blog <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ for more info and find the CTRE Toolsuite installer `here <https://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__.
fr_ca: CAN Talon SRX a été supprimé de WPILib. Veuillez consulter ce `blog <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ pour d'autres informations et trouvez le programme d'installation de la suite d'outils CTRE `ici <https://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__.
tr_tr: CAN Talon SRX, WPILib'den kaldırıldı. Daha fazla bilgi için bu `bloga <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ bakın ve CTRE Toolsuite yükleyicisini inceleyin `burada <https://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__.

source: Victor 888 Motor Controller / Victor 884 Motor Controller
fr_ca: Contrôleur de Moteur Victor 888 / Contrôleur de Moteur Victor 884
tr_tr: Victor 888 Motor Kontrol Cihazı / Victor 884 Motor Kontrol Cihazı

source: The Victor 888 Motor Controller from VEX Robotics is a variable speed motor controller for use in FRC. The Victor 888 replaces the Victor 884, which is also usable in FRC. The Victor is controlled over the PWM interface. The Victor should be connected to a PWM output of the roboRIO and powered from the Power Distribution Panel. For more information, see the `Victor 884 User Manual <https://content.vexrobotics.com/docs/ifi-v884-users-manual-9-25-06.pdf>`__ and `Victor 888 User Manual <https://content.vexrobotics.com/docs/217-2769-Victor888UserManual.pdf>`__.
fr_ca: Le contrôleur de moteur Victor 888 de la compagnie VEX Robotics est un contrôleur de moteur à vitesse variable pour utilisation en FRC. Le Victor 888 remplace le Victor 884, qui est également utilisable en FRC. Le Victor est contrôlée via l'interface PWM. Le Victor doit être connecté à une sortie PWM du roboRIO, et alimenté du Panneau de Distribution de puissance. Pour d'autres informations, veuillez voir le `Manuel de l'Utilisateur Victor 884 <https://content.vexrobotics.com/docs/ifi-v884-users-manual-9-25-06.pdf>`__ et `Manuel de l'Utilisateur Victor 888 <https://content.vexrobotics.com/docs/217-2769-Victor888UserManual.pdf>`__.
tr_tr: VEX Robotics'in Victor 888 Motor Kontrolörü, FRC'de kullanım için değişken hızlı bir motor kontrolörüdür. Victor 888, FRC'de de kullanılabilen Victor 884'ün yerini alıyor. Victor, PWM arayüzü üzerinden kontrol edilir. Victor, roboRIO'nun bir PWM çıkışına bağlanmalı ve Güç Dağıtım Panelinden beslenmelidir. Daha fazla bilgi için, bkz. `Victor 884 User Manual <https://content.vexrobotics.com/docs/ifi-v884-users-manual-9-25-06.pdf>`__ ve `Victor 888 User Manual <https://content.vexrobotics.com/docs/217-2769-Victor888UserManual.pdf>`__.

source: The Victor SP motor controller is a PWM motor controller from Cross The Road Electronics/VEX Robotics. The Victor SP has an electrically isolated metal housing for heat dissipation, making the use of the fan optional. The case is sealed to prevent debris from entering the controller. The controller is approximately half the size of previous models.
fr_ca: Le contrôleur de moteur Victor SP est un contrôleur de moteur PWM de Cross The Road Electronics/VEX Robotics. Le Victor SP a un boîtier métallique isolé électriquement pour la dissipation thermique, ce qui rend l'utilisation du ventilateur faculative. Le boîtier est scellé pour empêcher les débris de pénétrer dans le contrôleur. Le controleur a environ la moitié de la taille des modèles précédents.
tr_tr: Victor SP motor kontrolörü, Cross The Road Electronics / VEX Robotics'in bir PWM motor kontrolörüdür. Victor SP, ısı dağıtımı için elektriksel olarak izole edilmiş metal bir muhafazaya sahiptir, bu da fan kullanımını isteğe bağlı kılar. Muhafaza, toz yada metal tozlarının kontrolöre girmesini önlemek için kapatılmıştır. Denetleyici, önceki modellerin yaklaşık yarısı boyutundadır.

source: The Victor SPX motor controller is a CAN or PWM controlled motor controller from Cross The Road Electronics/VEX Robotics. The device is connectorized to allow easy connection to the roboRIO PWM connectors or a CAN bus chain. When controlled over the CAN bus, the device has a number of the closed loop features also present in the Talon SRX. The case is sealed to prevent debris from entering the controller. For more information, see the `Victor SPX Webpage <https://www.vexrobotics.com/217-9191.html>`__.
fr_ca: Le contrôleur de moteur Victor SPX est un contrôleur de moteur de la compagnie Cross The Road Electronics/VEX Robotics et celui-ci est commandé par le réseau CAN ou par liaison PWM. Le dispositif est connecté pour permettre une connexion facile aux connecteur roboRIO PWM ou à une chaîne de réseau CAN. Lorsqu'il est contrôlé via le réseau CAN, le dispositif a un certain nombre de fonctionnalités en boucle-fermée qui sont également présentes dans le Talon SRX. Le boîtier est scellé pour empêcher les débris de pénétrer dans le contrôleur. Pour d'autres informations, veuillez consulter `la page Web Victor SPX <https://www.vexrobotics.com/217-9191.html>`__.
tr_tr: Victor SPX motor kontrolörü, Cross The Road Electronics / VEX Robotics'ten CAN veya PWM kontrollü bir motor kontrolörüdür. Cihaz, roboRIO PWM konektörlerine veya bir CAN veri yolu zincirine kolay bağlantı sağlamak için tasarlanmıştır. CAN veriyolu üzerinden kontrol edildiğinde, cihaz, Talon SRX'te de bulunan bir dizi kapalı döngü özelliğine sahiptir. Muhafaza, metal tozların kontrolöre girmesini önlemek için kapatılmıştır. Daha fazla bilgi için bkz. `Victor SPX Webpage <https://www.vexrobotics.com/217-9191.html>`__.

source: Victor SPX CAN control is not supported from WPILib. See `this blog <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ for more info and find the CTRE Toolsuite installer `here <https://www.ctr-electronics.com/control-system/hro.html#product_tabs_technical_resources>`__.
fr_ca: Le contrôle CAN du Victor SPX n'est pas pris en charge par WPILib. Veuillez consulter `ce blog <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ pour d'autres informations et pour trouver le programme d'installation de la suite d'outils CTRE veuillez vous rendre `ici <https://www.ctr-electronics.com/control-system/hro.html#product_tabs_technical_resources>`__.
tr_tr: Victor SPX CAN kontrolü, WPILib tarafından desteklenmemektedir. Daha fazla bilgi için buradaki `bloga <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ bakınız ve CTRE Toolsuite kurulun aracı için `buraya <https://www.ctr-electronics.com/control-system/hro.html#product_tabs_technical_resources>`__ bakınız.

source: Spike H-Bridge Relay
fr_ca: Relais H-Bridge Spike
tr_tr: Spike H-Köprü Rölesi

source: The Spike H-Bridge Relay from VEX Robotics is a device used for controlling power to motors or other custom robot electronics. When connected to a motor, the Spike provides On/Off control in both the forward and reverse directions. The Spike outputs are independently controlled so it can also be used to provide power to up to 2 custom electronic circuits. The Spike H-Bridge Relay should be connected to a relay output of the roboRIO and powered from the Power Distribution Panel. For more information, see the `Spike User’s Guide <https://content.vexrobotics.com/docs/spike-blue-guide-sep05.pdf>`__.
fr_ca: Le Relais H-Bridge Spike de VEX Robotics est un dispositif utilisé pour contrôler l'alimentation des moteurs ou d'autre circuits électroniques personnalisés de robot. Quand il est connecté à un moteur, le Spike procure un contrôle de Marche/Arrêt dans les deux sens de rotation. Les sorties du Spike sont contrôlées indépendamment donc ils peuvent également être utilisés pour alimenter jusqu'à 2 circuits électroniques personnalisés. Le Relais H-Bridge Spike devrait être connecté à une sortie relais du roboRIO et alimenté du Panneau de Distribution de puissance. Pour d'autres informations, veuillez consulter le `Manuel de l'Utilisateur Spike <https://content.vexrobotics.com/docs/spike-blue-guide-sep05.pdf>`__.
tr_tr: VEX Robotics'in Spike H-Bridge Relay, motorlara veya diğer özel robot elektronik cihazlarına giden gücü kontrol etmek için kullanılan bir cihazdır. Bir motora bağlandığında, Spike hem ileri hem de geri yönde On/Off kontrolü sağlar. Spike çıkışları bağımsız olarak kontrol edildiğinden 2 adede kadar özel elektronik devreye güç sağlamak için de kullanılabilir. Spike H-Bridge Rölesi roboRIO'nun bir röle çıkışına bağlanmalı ve Güç Dağıtım Panelinden beslenmelidir. Daha fazla bilgi için bkz. `Spike User’s Guide <https://content.vexrobotics.com/docs/spike-blue-guide-sep05.pdf>`__.

source: Servo Power Module
fr_ca: Module d'Alimentation Servo
tr_tr: Servo Güç Modülü

source: The Servo Power Module from Rev Robotics is capable of expanding the power available to servos beyond what the roboRIO integrated power supply is capable of. The Servo Power Module provides up to 90W of 6V power across 6 channels. All control signals are passed through directly from the roboRIO. For more information, see the `Servo Power Module webpage <https://www.revrobotics.com/rev-11-1144/>`__.
fr_ca: Le Module d'Alimentation Servo de REV Robotics est capable d'étendre la puissance disponible aux servos au-délà de ce que l'alimentation intégrée du roboRIO peut fournir. Le Module d'Alimentation Servo fournit jusqu'à 90W de puissance 6Volts sur 6 canaux. Tous les signaux de commande passent directement du roboRIO. Pour d'autres informations, veuillez consulter la `page web du Module d'Alimentation Servo <https://www.revrobotics.com/rev-11-1144/>`__.
tr_tr: Rev Robotics'in Servo Güç Modülü, servolara sağlanan gücü roboRIO entegre güç kaynağının yapabileceğinin ötesinde genişletebilir. Servo Güç Modülü, 6 kanalda 90W'a kadar 6V güç sağlar. Tüm kontrol sinyalleri doğrudan roboRIO'dan geçirilir. Daha fazla bilgi için, bkz. `Servo Power Module webpage <https://www.revrobotics.com/rev-11-1144/>`__.

source: Axis M1013/M1011/206 Ethernet Camera
fr_ca: Caméra Ethernet Axis M1013/M1011/206
tr_tr: Axis M1013/M1011/206 Ethernet Kamerası

source: The Axis M1013, M1011 and Axis 206 Ethernet cameras are used for capturing images for vision processing and/or sending video back to the Driver Station laptop. The camera should be wired to a 5V power output on the Voltage Regulator Module and an open ethernet port on the robot radio. For more information, see :ref:`Configuring an Axis Camera <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>` and the `Axis 206 <https://www.axis.com/en-us/products/axis-206>`__, `Axis M1011 <https://www.axis.com/en-us/products/axis-m1011>`__, `Axis M1013 pages <https://www.axis.com/en-us/products/axis-m1013>`__.
fr_ca: Les caméras Ethernet Axis M1013, M1011 et Axis 206 sont utilisées pour capturer des images pour le traitement de la vision et ou renvoyer la vidéo à l'ordinateur portable du poste de conduite. La caméra devrait être branchée à une sortie de 5V sur le VRM et un port Ethernet ouvert sur la radio du robot. Pour plus d'informations, veuillez consulter la section :ref:`Configuration d'une caméra Axis <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>` et les pages `Axis 206 <https://www.axis.com/en-us/products/axis-206>`__, `Axis M1011 <https://www.axis.com/en-us/products/axis-m1011>`__, `Axis M1013 <https://www.axis.com/en-us/products/axis-m1013>`__.
tr_tr: Axis M1013, M1011 ve Axis 206 Ethernet kameraları, görüntü işleme için görüntü yakalamak ve / veya videoyu Driver Station dizüstü bilgisayarına geri göndermek için kullanılır. Kamera, Voltage Regulator Module'deki 5V güç çıkışına ve robot modeminde boş bir ethernet bağlantı noktasına bağlanmalıdır. Daha fazla bilgi için bakınız :ref:`Configuring an Axis Camera<docs/software/vision-processing/axis-camera/configuration-an-axis-camera:Configuration an Axis Camera>` ve `Axis 206 <https://www.axis.com/en-us/products/axis-206>`__, `Axis M1011 <https://www.axis.com/en-us/products/axis-m1011>`__, `Axis M1013 sayfaları <https://www.axis.com/en-us/products/axis-m1013>`__.

source: The Microsoft Lifecam HD3000 is a USB webcam that can be plugged directly into the roboRIO. The camera is capable of capturing up to 1280x720 video at 30 FPS. For more information about the camera, see the `Microsoft product page <https://www.microsoft.com/accessories/en-us/business/lifecam-hd-3000-for-business/t4h-00002>`__. For more information about using the camera with the roboRIO, see the :ref:`Vision Processing <docs/software/vision-processing/index:Vision Processing>` section of this documentation.
fr_ca: La caméra Microsoft Lifecam HD3000 est une webcam USB qui peut être branchée directement au roboRIO. La caméra est capable de capturer des vidéos jusqu’à 1280x720 à 30 FPS. Pour plus d’informations sur cette caméra, consultez la page `Microsoft product page <https://www.microsoft.com/accessories/en-us/business/lifecam-hd-3000-for-business/t4h-00002>`__. Pour plus d’informations sur l’utilisation de la caméra avec le roboRIO, voir la section :ref:`Vision Processing <docs/software/vision-processing/index:Vision Processing>` de la présente documentation.

source: OpenMesh OM5P-AN or OM5P-AC Radio
fr_ca: Radio OpenMesh OM5P-AN ou OM5P-AC
tr_tr: OpenMesh OM5P-AN veya OM5P-AC Radyo

source: Either the OpenMesh OM5P-AN or OpenMesh OM5P-AC wireless radio is used as the robot radio to provide wireless communication functionality to the robot. The device can be configured as an Access Point for direct connection of a laptop for use at home. It can also be configured as a bridge for use on the field. The robot radio should be powered by one of the 12V/2A outputs on the VRM and connected to the roboRIO controller over Ethernet. For more information, see :ref:`Programming your Radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`.
fr_ca: La radio sans fil OpenMesh OM5P-AN ou OpenMesh OM5P-AC est utilisée comme radio du robot pour fournir une fonctionnalité de communication sans fil au robot. L'appareil peut être configuré comme point d'accès pour la connexion directe d'un ordinateur portable pour une utilisation à la maison. Il peut également être configuré comme un pont pour une utilisation sur le terrain. La radio du robot doit être alimentée par l'une des sorties 12V / 2A du VRM et connectée au contrôleur roboRIO via Ethernet. Pour plus d'informations, voir :ref:`Programming your Radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`
tr_tr: Robota kablosuz iletişim işlevselliği sağlamak için robot radyo olarak OpenMesh OM5P-AN veya OpenMesh OM5P-AC kablosuz radyo kullanılır. Cihaz, evde kullanım için bir dizüstü bilgisayarın doğrudan bağlantısı için erişim noktası olarak yapılandırılabilir. Ayrıca sahada kullanım için bir köprü-bridge olarak yapılandırılabilir. Robot radyosu, VRM üzerindeki 12V/2A çıkışlarından birinden güç almalı ve roboRIO kontrolörüne Ethernet üzerinden bağlanmalıdır. Daha fazla bilgi için, bakınız :ref:`Programming your Radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`

source: The OM5P-AN `is no longer available for purchase <https://www.firstinspires.org/robotics/frc/blog/radio-silence>`__. The OM5P-AC is slightly heavier, has more cooling grates, and has a rough surface texture compared to the OM5P-AN.
fr_ca: Le OM5P-AN `n'est plus disponible pour achat <https://www.firstinspires.org/robotics/frc/blog/radio-silence>`__. Le OM5P-AC est légèrement plus lourd, possède plus de grilles de refroidissement et a une texture de surface rugueuse par rapport au OM5P-AN.
tr_tr: OM5P-AN `artık satın alınamıyor <https://www.firstinspires.org/robotics/frc/blog/radio-silence>`__. OM5P-AC, OM5P-AN'ye kıyasla biraz daha ağırdır, daha fazla soğutma ızgarasına sahiptir ve pürüzlü bir yüzey dokusuna sahiptir.

source: 120A Circuit Breaker
fr_ca: Disjoncteur 120A
tr_tr: 120A Devre Kesici - Sigorta

source: The 120A Main Circuit Breaker serves two roles on the robot: the main robot power switch and a protection device for downstream robot wiring and components. The 120A circuit breaker is wired to the positive terminals of the robot battery and Power Distribution boards. For more information, please see the `Cooper Bussmann 18X Series Datasheet (PN: 185120F) <http://www.cooperindustries.com/content/dam/public/bussmann/Transportation/Circuit%20Protection/resources/datasheets/BUS_Tns_DS_18X_CIRCUITBREAKER.pdf>`__
fr_ca: Le Disjoncteur Principal 120A sert à deux fonctions sur le robot: Il sert d'interrupteur principal du robot ainsi que de dispositif de protection pour le câblage et les composants du robot en aval. Le disjoncteur 120A est câblé aux bornes positives de la batterie du robot et des tableaux de distribution électrique. Pour d'autres informations, veuillez consulter la `fiche technique Cooper Bussmann 18X Series (PN: 185120F) <http://www.cooperindustries.com/content/dam/public/bussmann/Transportation/Circuit%20Protection/resources/datasheets/BUS_Tns_DS_18X_CIRCUITBREAKER.pdf>`__.
tr_tr: 120A Ana Devre Kesici, robot üzerinde iki görev görür: ana robot güç anahtarı ve aşağı akışlı robot kabloları ve bileşenleri için bir koruma cihazı. 120A devre kesici, robot aküsünün ve Güç Dağıtım kartlarının pozitif terminallerine bağlanır. Daha fazla bilgi için lütfen `Cooper Bussmann 18X Series Veri Sayfası'na (PN: 185120F) <http://www.cooperindustries.com/content/dam/public/bussmann/Transportation/Circuit%20Protection/resources/datasheets/BUS_Tns_DS_18X_CIRCUITBREAKER.pdf>`__ bakın.

source: Snap Action Circuit Breakers
fr_ca: Disjoncteurs à Action rapide
tr_tr: Hızlı Devre Kesiciler

source: The Snap Action circuit breakers, MX5-A40 and VB3 series, are used with the Power Distribution Panel to limit current to branch circuits. The MX5-A40 40A MAXI style circuit breaker is used with the larger channels on the Power Distribution Panel to power loads which draw current up to 40A continuous. The VB3 series are used with the smaller channels on the PDP to power circuits drawing current of 30A or less continuous. For more information, see the Datasheets for the `MX5 series <http://www.snapaction.net/pdf/MX5%20Spec%20Sheet.pdf>`__ and `VB3 Series <http://www.snapaction.net/pdf/vb3.pdf>`__.
fr_ca: Les disjoncteurs Snap Action, séries MX5-A40 et VB3, sont utilisés avec le Panneau de Distribution de Puissance (PDP) pour limiter le courant aux circuits de dérivation. Le disjoncteur MX5-A40 40A de style MAXI est utilisé avec les plus grands canaux sur le PDP pour alimenter des charges qui tirent jusqu'à 40A en continu. La série VB3 est utilisée avec les canaux plus petits sur le PDP pour alimenter des circuits qui tirent 30A ou moins en continu. Pour plus d'informations, veuillez consulter les fiches techniques de la `série MX5 <http://www.snapaction.net/pdf/MX5%20Spec%20Sheet.pdf>`__ et `la série VB3 <http://www.snapaction.net/pdf/vb3.pdf>`__.
tr_tr: Snap Action devre kesiciler, MX5-A40 ve VB3 serisi, akımı dal devrelerine sınırlamak için Power Distribution Panel ile birlikte kullanılır. MX5-A40 40A MAXI tarzı devre kesici, 40A'ya kadar sürekli akım çeken yüklere güç sağlamak için Power Distribution Panel deki daha büyük kanallarla birlikte kullanılır. VB3 serisi, 30A veya daha az sürekli akım çeken devreleri çalıştırmak için PDP üzerindeki daha küçük kanallarla birlikte kullanılır. Daha fazla bilgi için, `MX5 series <http://www.snapaction.net/pdf/MX5%20Spec%20Sheet.pdf>`__ and `VB3 Series <http://www.snapaction.net/pdf/vb3.pdf>`__.

source: Robot Battery
fr_ca: Batterie de Robot
tr_tr: Robot Aküsü

source: The power supply for an FRC robot is a single 12V 18Ah battery. The batteries used for FRC are sealed lead acid batteries capable of meeting the high current demands of an FRC robot. For more information, see the datasheet for the `MK ES17-12 <https://www.mkbattery.com/application/files/2515/3308/8109/ES17-12.pdf>`__.
fr_ca: L'alimentation d'un robot FRC consiste en une seule batterie 12V 18Ah. Les batteries utilisées en FRC sont des batteries plomb-acide scellées qui sont capables de répondre aux fortes demandes en courant des robots FRC. Pour plus d'informations, veuillez consulter la fiche technique de la batterie `MK ES17-12 <https://www.mkbattery.com/application/files/2515/3308/8109/ES17-12.pdf>`__.
tr_tr: Bir FRC robotunun güç kaynağı tek bir 12V 18Ah bataryadır. FRC için kullanılan bataryalar, bir FRC robotunun yüksek akım taleplerini karşılayabilen sealed lead acid bataryalardır. Daha fazla bilgi için, `MK ES17-12 <https://www.mkbattery.com/application/files/2515/3308/8109/ES17-12.pdf>`__.Veri sayfasına bakın.

source: Other battery part numbers may be legal, consult the `FRC Manual <https://www.firstinspires.org/resource-library/frc/competition-manual-qa-system>`__ for a complete list.
fr_ca: D'autres numéros de pièces de batterie pourrait être légale. Consultez le `Manuel FRC <https://www.firstinspires.org/resource-library/frc/competition-manual-qa-system>`__ pour une liste complète.
tr_tr: Diğer akü model numaraları da yasal olabilir, tam bir liste için `FRC Kılavuzu <https://www.firstinspires.org/resource-library/frc/competition-manual-qa-system>`__ 'na bakın.

source: Image Credits
fr_ca: Crédits d'Images
tr_tr: Görsel Atıflar
