Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-1/control-system-hardware.po
Languages: fr_ca, tr_tr

source: FRC Control System Hardware Overview
fr_ca: Survol des composants matériels du système de contrôle FRC
tr_tr: FRC Kontrol Sistemi Donanımına Genel Bakış

source: The goal of this document is to provide a brief overview of the hardware components that make up the FRC\ |reg| Control System. Each component will contain a brief description of the component function, a brief listing of critical connections, and a link to more documentation if available.
fr_ca: L'objectif du présent document est de fournir un bref aperçu des composants matériels du système de contrôle FRC. Chaque composant est accompagné d'une description sommaire de son fonctionnement, d'une liste sommaire des branchements, et d'un lien vers d'autres documents, quand il en existe, plus complèts.
tr_tr: Bu belgenin amacı, FRC\ |reg| Kontrol sistemi'ni oluşturan donanım bileşenlerine kısa bir genel bakış sağlamaktır. Her bileşen, bileşen işlevinin kısa bir açıklamasını, kritik bağlantıların kısa bir listesini ve varsa daha fazla dokümantasyona bağlantı içerecektir.

source: For complete wiring instructions/diagrams, please see the :doc:`Wiring the FRC Control System <how-to-wire-a-robot>` document.
fr_ca: Pour des références complètes sur le câblage, veuillez consulter la section :doc:`Comment câbler un robot FRC <how-to-wire-a-robot>`
tr_tr: Tam kablolama talimatları/şemaları için lütfen şu belgeye bakın :doc:`Wiring the FRC Control System <how-to-wire-a-robot>`.

source: Overview of Control System
fr_ca: Survol du système de contrôle
tr_tr: Kontrol Sistemine Genel Bakış

source: Diagram courtesy of FRC Team 3161 and Stefen Acepcion.
fr_ca: Ce diagramme est une gracieuseté de l'équipe FRC 3161 et Stefen Acepcion
tr_tr: FRC Team 3161 ve Stefen Acepcion'un izniyle şema.

source: NI roboRIO
fr_ca: Contrôleur principal NI RoboRIO de National Instrument

source: The NI-roboRIO is the main robot controller used for FRC. The roboRIO includes a dual-core ARM Cortex™-A9 processor and FPGA which runs both trusted elements for control and safety as well as team-generated code. Integrated controller I/O includes a variety of communication protocols (Ethernet, USB, CAN, SPI, I2C, and serial) as well as PWM, servo, digital I/O, and analog I/O channels used to connect to robot peripherals for sensing and control.The roboRIO should connect to the dedicated 12V port on the Power Distribution Panel for power. Wired communication is available via USB or Ethernet. Detailed information on the roboRIO can be found in the `roboRIO User Manual <https://www.ni.com/pdf/manuals/374474a.pdf>`__ and in the `roboRIO technical specifications <https://www.ni.com/pdf/manuals/374661a.pdf>`__.
fr_ca: Le NI roboRIO est le principal contrôleur utilisé dans un robot FRC. Le roboRIO est constitué d'un processeur ARM Cortex-A9 double cœur et d'un FPGA qui exécute les éléments fiables pour le contrôle et la sécurité aussi bien que le code généré par l'équipe. Le contrôleur I/O intégré dans le roboRIO comprend une variété de protocoles de communication (Ethernet, USB, CAN, SPI, I2C, et sériel) ainsi que PWM, servo, des ports I/O numériques et analogiques utilisés pour se connecter aux périphériques du robot pour la détection et le contrôle. Pour son alimentation, le roboRIO doit être connecté au port de 12V dédié sur le Panneau de Distribution d'Énergie. La communication filaire est disponible par USB ou Ethernet. Des informations détaillées pour le roboRIO peuvent être trouvées dans le `roboRIO User Manual <https://www.ni.com/pdf/manuals/374474a.pdf>`__ et dans les `roboRIO technical specifications <https://www.ni.com/pdf/manuals/374661a.pdf>`__.
tr_tr: NI-roboRIO, FRC için kullanılan ana robot denetleyicidir. RoboRIO, kontrol ve güvenlik için hem güvenilir öğeleri hem de ekip tarafından oluşturulan kodu çalıştıran çift çekirdekli bir ARM Cortex ™ -A9 işlemci ve FPGA içerir. Entegre kontrolör I/O, çeşitli iletişim protokollerinin (Ethernet, USB, CAN, SPI, I2C ve seri) yanı sıra, robot çevre birimlerine bağlanmak için kullanılan PWM, servo, dijital I/O ve analog I/O kanallarını içerir. roboRIO, güç için Güç Dağıtım Panelindeki özel 12V bağlantı noktasına bağlanmalıdır. Kablolu iletişim USB veya Ethernet üzerinden sağlanabilir. RoboRIO hakkında ayrıntılı bilgi `roboRIO Kullanıcı Kılavuzu <https://www.ni.com/pdf/manuals/374474a.pdf>`__ ve `roboRIO technical specifications <https://www.ni.com/pdf/manuals/374661a.pdf>`__. içinde bulunabilir.

source: Power Distribution Panel
fr_ca: Panneau de Distribution de Puissance

source: The Power Distribution Panel (PDP) is designed to distribute power from a 12VDC battery to various robot components through auto-resetting circuit breakers and a small number of special function fused connections. The PDP provides 8 output pairs rated for 40A continuous current and 8 pairs rated for 30A continuous current. The PDP provides dedicated 12V connectors for the roboRIO, as well as connectors for the Voltage Regulator Module and Pneumatics Control Module. It also includes a CAN interface for logging current, temperature, and battery voltage. For more detailed information, see the `PDP User Manual <https://www.ctr-electronics.com/downloads/pdf/PDP%20User's%20Guide.pdf>`__.
fr_ca: Le Panneau de Distribution de Puissance (PDP) est conçu pour distribuer l'énergie d'une batterie 12VDC à divers composants de robot à travers des disjoncteurs à réinitialisation automatique et quelques connexions protégé à fonction spéciales. Le PDP fournit 8 paires de sorties évalué pour 40A courant continu et 8 paires évalué pour 30A courant continu. Le PDP fournit des connecteurs 12V dédiés pour le roboRIO ainsi que des connecteurs pour le régulateur de tension et pour le module de contrôle pneumatique. Ça inclut aussi un interface CAN pour enregistrer le courant, le température, et le tension de la batterie. Pour de l'information plus détaillée, veuillez consulter le `Manuel de l'Utilisateur <https://www.ctr-electronics.com/downloads/pdf/PDP%20User's%20Guide.pdf>`__.
tr_tr: Power Distribution Panel (PDP), gücü bir 12VDC bataryadan çeşitli robot bileşenlerine otomatik sıfırlamalı devre kesici sigortalar ve az sayıda özel işlevli sigortalı bağlantılar aracılığıyla dağıtmak için tasarlanmıştır. PDP, 40A sürekli akım için derecelendirilmiş 8 çıkış çifti ve 30A sürekli akım için derecelendirilmiş 8 çıkış çift sağlar. PDP, roboRIO için özel 12V konektörlerin yanı sıra Voltage Regulator Module - Voltaj Düzenleyici Modülü ve Pneumatics Control Module - Pnömatik Kontrol Modülü için besleme konektörleri de sağlar. Ayrıca akım, sıcaklık ve pil voltajını kaydetmek için bir CAN arabirimi içerir. Daha ayrıntılı bilgi için, bkz. `PDP Kullanım Kılavuzu <https://www.ctr-electronics.com/downloads/pdf/PDP%20User's%20Guide.pdf>`__.

source: Pneumatics Control Module
fr_ca: Module de contrôle pneumatique PCM
tr_tr: Pneumatics Control Module - Pnömatik Kontrol Modülü

source: The PCM is a device that contains all of the inputs and outputs required to operate 12V or 24V pneumatic solenoids and the on board compressor. The PCM is enabled/disabled by the roboRIO over the CAN interface. The PCM contains an input for the pressure sensor and will control the compressor automatically when the robot is enabled and a solenoid has been created in the code. The device also collects diagnostic information such as solenoid states, pressure switch state, and compressor state. The module includes diagnostic LED’s for both CAN and the individual solenoid channels. For more information see the `PCM User Manual <https://www.ctr-electronics.com/downloads/pdf/PCM%20User's%20Guide.pdf>`__.
fr_ca: Le module PCM est un dispositif qui contient les entrées et les sorties requises pour l'opération des électrovalves solénoïdes pneumatique qui sont alimentés 12V ou 24V ainsi que pour l'opération du compresseur d'air du système. Le module PCM est activé/désactivés par le roboRIO via l'interface CAN. Le module PCM contient une entrée pour le commutateur de pression et va contrôler le compresseur automatiquement lorsque le robot est activé et qu'une solénoïde a été créé dans le code. Le dispositif recueille aussi les informations de diagnostique tels que les états des solénoïdes, l'état du commutateur de pression ainsi que l'état du compresseur. Le module PCM inclut des indicateurs DEL de diagnostique pour le CAN ainsi que pour chaque chaîne de solénoïde individuelle. Pour d'autres informations, veuillez consulter le `Manuel de l'Utilisateur PCM <https://www.ctr-electronics.com/downloads/pdf/PCM%20User's%20Guide.pdf>`__.
tr_tr: PCM, 12V veya 24V pnömatik solenoidleri ve yerleşik kompresörü çalıştırmak için gerekli tüm giriş ve çıkışları içeren bir cihazdır. PCM, CAN arayüzü üzerinden roboRIO tarafından etkinleştirilir/devre dışı bırakılır. PCM, basınç sensörü için bir giriş içerir ve robot etkinleştirildiğinde ve kodda bir solenoid oluşturulduğunda kompresörü otomatik olarak kontrol eder. Cihaz ayrıca solenoid durumları, basınç anahtarı durumu ve kompresör durumu gibi teşhis bilgilerini de toplar. Modül, hem CAN hem de bağımsız solenoid kanallar için durum tespit LED'leri içerir. Daha fazla bilgi için bkz. `PCM Kullanıcı Kılavuzu <https://www.ctr-electronics.com/downloads/pdf/PCM%20User's%20Guide.pdf>"__.

source: Voltage Regulator Module
fr_ca: Régulateur de Tension
tr_tr: Voltage Regulator Module-Voltaj Regülatör Modülü

source: The VRM is an independent module that is powered by 12 volts. The device is wired to a dedicated connector on the PDP. The module has multiple regulated 12V and 5V outputs. The purpose of the VRM is to provide regulated power for the robot radio, custom circuits, and IP vision cameras. The two connector pairs associated with each label have a combined rating of what the label indicates (e.g. 5V/500mA total for both pairs not for each pair). The 12V/2A limit is a peak rating, the supply should not be loaded with more than 1.5A continuous current draw. For more information, see the `VRM User Manual <https://www.ctr-electronics.com/VRM%20User's%20Guide.pdf>`__.
fr_ca: Le VRM est un module indépendant qui est alimenté par 12 volts. L'appareil est câblé à un connecteur dédié sur le PDP. Le module possède plusieurs sorties 12Volts et 5Volts régulés. Le but du VRM est de fournir une tension régulée pour la radio de robot, les circuits personnalisés, et les caméras de vision IP. Les deux paires de connecteur associées avec chaque étiquette offrent une capacité totale combinés tel que décrit sur l'étiquette. (par exemple. 5V/500mA en totale pour les deux pairs, pas pour chacun). La limite 12V/2A est une note maximale, le source ne devrait pas être chargé avec plus de 1.5A en consommation de courant continu. Pour d'autres informations, veuillez consulter le `Manuel de l'Utilisateur VRM <https://www.ctr-electronics.com/VRM%20User's%20Guide.pdf>`__.
tr_tr: VRM, 12 volt ile çalışan bağımsız bir modüldür. Cihaz, PDP üzerindeki özel bir konektöre kablolanmıştır. Modül, birden fazla düzenlenmiş 12V ve 5V çıkışa sahiptir. VRM'nin amacı, robot radyo, özel devreler ve IP görüş kameraları için düzenlenmiş güç sağlamaktır. Her bir etiketle ilişkili iki bağlayıcı çifti, etiketin neyi gösterdiğine ilişkin birleşik bir derecelendirmeye sahiptir (örneğin, her bir çift için geçerli olmayan toplam 5V / 500mA). 12V / 2A sınırı bir tepe değeridir, besleme 1.5A'dan fazla sürekli akım çekişiyle yüklenmemelidir. Daha fazla bilgi için bkz.`VRM User Manual <https://www.ctr-electronics.com/VRM%20User's%20Guide.pdf>`__.

source: Motor Controllers
fr_ca: Contrôleurs de Moteur
tr_tr: Motor Sürücüleri

source: There are a variety of different motor controllers which work with the FRC Control System and are approved for use. These devices are used to provide variable voltage control of the brushed DC motors used in FRC. They are listed here in alphabetical order.
fr_ca: Il existe un variété de contrôleurs de moteurs différents qui fonctionnent avec le système de contrôle FRC et qui sont approuvés pour être utilisés. Ces dispositifs sont utilisés pour fournir un contrôle de tension variable du moteur CC à brosses utilisé en FRC. Ils sont énumérés ci-dessous par ordre alphabétique.
tr_tr: FRC Kontrol Sistemiyle çalışan ve kullanım için onaylanmış çeşitli farklı motor kontrolörleri vardır. Bu cihazlar, FRC'de kullanılan fırçalı DC motorların değişken voltaj kontrolünü sağlamak için kullanılır. Burada alfabetik sıraya göre listelenmiştir.

source: DMC-60 and DMC-60C Motor Controller
fr_ca: Contrôleur de Moteur DMC-60 et DMC-60C
tr_tr: DMC-60 ve DMC-60C Motor Kontrol Cihazı

source: The DMC-60 is a PWM motor controller from Digilent. The DMC-60 features integrated thermal sensing and protection including current-foldback to prevent overheating and damage, and four multi-color LEDs to indicate speed, direction, and status for easier debugging. For more information, see the `DMC-60 reference manual <https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__
fr_ca: Le DMC-60 est un contrôleur de motor PWM de la compagnie Digilent. Le DMC-60 dispose d'une détection thermique intégrée et d'une protection comprenant un repli-courant pour éviter la surchauffe et les dommages, de quatre LED multicolore pour indiquer la vitesse, la direction, et le statut pour un débogage plus facile. Pour d'autres informations, veuillez consulter le `Manuel de référence DMC-60 <https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__
tr_tr: DMC-60, Digilent'in bir PWM motor kontrolörüdür. DMC-60, aşırı ısınmayı ve hasarı önlemek için akım katlama dahil entegre termal algılama ve koruma ve daha kolay hata ayıklama için hızı, yönü ve durumu gösteren dört çok renkli LED içerir. Daha fazla bilgi için, bkz.`DMC-60 reference manual <https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__

source: The DMC-60C adds CAN smart controller capabilities to the DMC-60 controller. This enables closed loop control features and other intelligent control options. For more information see the `DMC-60C Product Page <https://store.digilentinc.com/dmc60c-digital-motor-controller-approved-for-first-robotics/>`__
fr_ca: Le DMC-60C ajoute des capacités de contrôleur intelligent CAN au controleur DMC-60. Cela permet des fonctionnalités de contrôle en boucle fermée ainsi que d'autres options de contrôle intelligent. Pour d'autres informations, veuillez consulter la `page du produit DMC-60C <https://store.digilentinc.com/dmc60c-digital-motor-controller-approved-for-first-robotics/>`__
tr_tr: DMC-60C, DMC-60 kontrol cihazına ek olarak CAN akıllı kontrolör yetenekleri içerir. Bu, kapalı döngü kontrol özelliklerini ve diğer akıllı kontrol seçeneklerini etkinleştirir. Daha fazla bilgi için bkz. `DMC-60C Ürün Sayfası <https://store.digilentinc.com/dmc60c-digital-motor-controller-approved-for-first-robotics/>`__

source: Jaguar Motor Controller
fr_ca: Contrôleur de Moteur Jaguar
tr_tr: Jaguar Motor Kontrolörü

source: The Jaguar Motor Controller from VEX Robotics (formerly made by Luminary Micro and Texas Instruments) is a variable speed motor controller for use in FRC. For FRC, the Jaguar may only be controlled using the PWM interface.
fr_ca: Le contrôleur de moteur Jaguar de VEX Robotics (anciennement manufacturé par Luminary Micro et Texas Instruments) est un contrôleur de moteur à vitesse variable pour utilisation en FRC. En FRC, le Jaguar ne peut être contrôlé qu'à l'aide de l'interface PWM.
tr_tr: VEX Robotics'in Jaguar Motor Denetleyicisi (önceden Luminary Micro ve Texas Instruments tarafından yapılmıştır), FRC'de kullanım için değişken hızlı bir motor denetleyicisidir. FRC için Jaguar yalnızca PWM arayüzü kullanılarak kontrol edilebilir.

source: SD540B and SD540C Motor Controllers
fr_ca: Contrôleurs de Moteur SD540B et SD540C
tr_tr: SD540B ve SD540C Motor Kontrolörleri

source: The SD540 Motor Controller from Mindsensors is a variable speed motor controller for use in FRC. The SD540B is controlled using the PWM interface. The SD540C is controllable over CAN. Limit switches may be wired directly to the SD540 to limit motor travel in one or both directions. Switches on the device are used to flip the direction of motor travel, configure the wiring polarity of limit switches, set Brake or Coast mode, and put the device in calibration mode. For more information see the `Mindsensors FRC page <http://www.mindsensors.com/68-frc>`__
fr_ca: Le Contrôleur de Moteur SD540 de la compagnie Mindsensors est un contrôleur de moteur à vitesse variable pour utilisation en FRC. Le SD540B est contrôlé en utilisant l'interface PWM. Le SD540C est contrôlable sur le réseau CAN. Des interrupteurs de fin de course peuvent être câblés directement au SD540 afin de limiter les déplacements moteurs dans l'une ou dans les deux directions. Des interrupteurs montés sur le dispositif sont utilisés pour Inverser la direction du déplacement, permettre la configuration de la polarité du câblage des interrupteurs de fin de course, définir le mode frein ou roue libre et, finalement, mettre l'appareil en mode d'étalonnage. Pour d'autres informations, veuillez consulter la `page FRC de Mindsensors <http://www.mindsensors.com/68-frc>`__
tr_tr: Mindsensors SD540 Motor Denetleyicisi, FRC'de kullanım için değişken hızlı bir motor denetleyicisidir. SD540B, PWM arayüzü kullanılarak kontrol edilir. SD540C, CAN üzerinden kontrol edilebilir. Limit anahtarları, bir veya her iki yönde motor hareketini sınırlamak için doğrudan SD540'a bağlanabilir. Cihaz üzerindeki anahtarlar, motor hareket yönünü değiştirmek, sınır anahtarlarının kablo bağlantı polaritesini yapılandırmak, Fren veya Serbest modunu ayarlamak ve cihazı kalibrasyon moduna geçirmek için kullanılır. Daha fazla bilgi için bakınız `Mindsensors FRC page <http://www.mindsensors.com/68-frc>`__

source: SPARK Motor Controller
fr_ca: Contrôleur de Moteur Spark
tr_tr: SPARK Motor Kontrolörü

source: The SPARK Motor Controller from REV Robotics is a variable speed motor controller for use in FRC. The SPARK is controlled using the PWM interface. Limit switches may be wired directly to the SPARK to limit motor travel in one or both directions. The RGB status LED displays the current state of the device including whether the device is currently in Brake mode or Coast mode. For more information, see the `REV Robotics SPARK product page <https://www.revrobotics.com/rev-11-1200/>`__
fr_ca: Le contrôleur de moteur SPARK de REV Robotics est un contrôleur de moteur à vitesse variable pour utilisation en FRC. Le SPARK est contrôlé en utilisant l'interface PWM. Des interrupteurs de fin de course peuvent être câblé directement au SPARK pour limiter les déplacements moteurs dans une ou dans les deux directions. Le DEL d'état multi couleurs RVB affiche l'état actuel de l'appareil, y compris si l'appareil est actuellement en mode freinage ou roue libre. Pour d'autres informations, veuillez consulter la `page du produit REV Robotics SPARK <https://www.revrobotics.com/rev-11-1200/>`__
tr_tr: REV Robotics'in SPARK Motor Kontrolörü, FRC'de kullanım için değişken hızlı bir motor kontrolörüdür. SPARK, PWM arayüzü kullanılarak kontrol edilir. Limit anahtarları, bir veya her iki yönde motor hareketini sınırlandırmak için doğrudan SPARK'a bağlanabilir. RGB durum LED'i, cihazın o anda Fren modunda mı yoksa Serbest modda mı olduğu dahil olmak üzere cihazın mevcut durumunu gösterir. Daha fazla bilgi için bakınız , `REV Robotics SPARK product page <https://www.revrobotics.com/rev-11-1200/>`__

source: SPARK MAX Motor Controller
fr_ca: Contrôleur de Moteur SPARK MAX
tr_tr: SPARK MAX Motor Kontrol Cihazı

source: The SPARK MAX Motor Controller from REV Robotics is a variable speed motor controller for use in FRC. The SPARK MAX is capable of controlling either the traditional brushed DC motors commonly used in FRC or the REV Robotics NEO Brushless Motor. The SPARK MAX can be controlled over PWM, CAN or USB (for configuration/testing only). The controller has a data port for sensor input and is capable of closed loop control modes when controlled over CAN or USB. For more information see the `REV Robotics SPARK MAX product page <https://www.revrobotics.com/rev-11-2158/>`__.
fr_ca: Le Contrôleur de Moteur SPARK MAX de REV Robotics est un contrôleur de moteur à vitesse variable pour utilisation en FRC. Le SPARK MAX est capable de contrôler soit les motor CC brossés traditionnels ou le nouveau Moteur sans balais REV Robotics NEO. Le SPARK MAX peut être contrôlé par PWM, CAN, ou USB (pour configuration/test uniquement). Le contrôleur a un port de données pour l'entrée des capteurs et est capable des modes de contrôle en boucle fermée quand contrôlé par CAN ou USB. Pour d'autres informations veuillez consulter la `page du produit REV Robotics SPARK MAX <https://www.revrobotics.com/rev-11-2158/>`__.
tr_tr: REV Robotics'in SPARK MAX Motor Kontrolörü, FRC'de kullanım için değişken hızlı bir motor kontrolörüdür. SPARK MAX, FRC'de yaygın olarak kullanılan geleneksel fırçalı DC motorları veya REV Robotics NEO Fırçasız Motoru kontrol edebilir. SPARK MAX, PWM, CAN veya USB (yalnızca yapılandırma / test için) üzerinden kontrol edilebilir. Kontrolör, sensör girişi için bir veri portuna sahiptir ve CAN veya USB üzerinden kontrol edildiğinde kapalı döngü kontrol modları kullanabilir. Daha fazla bilgi için, `REV Robotics SPARK MAX ürün sayfasına bakın <https://www.revrobotics.com/rev-11-2158/>`__.

source: Talon Motor Controller
fr_ca: Contrôleur de Moteur Talon
tr_tr: Talon Motor Kontrolörü

source: The Talon Motor Controller from Cross the Road Electronics is a variable speed motor controller for use in FRC. The Talon is controlled over the PWM interface. The Talon should be connected to a PWM output of the roboRIO and powered from the Power Distribution Panel. For more information see the `Talon User Manual <https://ctr-electronics.com/Talon_User_Manual_1_1.pdf>`__.
fr_ca: Le Contrôleur de Moteur Talon de la compagnie Cross the Road Electronics est un contrôleur de moteur à vitesse variable pour utilisation en FRC. Le Talon est contrôlé via la liaison PWM. Le Talon devrait être connecté à une sortie PWM du roboRIO et alimenté par le Panneau de Distribution de puissance. Pour d'autres informations veuillez consulter le `Manuel de l'Utilisateur Talon <https://ctr-electronics.com/Talon_User_Manual_1_1.pdf>`__.
tr_tr: Cross the Road Electronics'in Talon Motor Kontrolörü, FRC'de kullanım için değişken hızlı bir motor kontrolörüdür. Talon, PWM arayüzü üzerinden kontrol edilir. Talon, roboRIO'nun bir PWM çıkışına bağlanmalı ve Power Distribution Panel den beslenmelidir. Daha fazla bilgi için bkz. `Talon User Manual <https://ctr-electronics.com/Talon_User_Manual_1_1.pdf>`__.
