Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-1/how-to-wire-a-robot.po
Languages: es_mx, pt, tr_tr, zh_cn

source: How to Wire an FRC Robot
es_mx: Como Cablear un Robot FRC
pt: Como conectar um robô FRC
tr_tr: Bir FRC Robotunda Kablolama Nasıl Yapılır
zh_cn: 如何给FRC机器人接线

source: This document details the wiring of a basic electronics board for bench-top testing.
es_mx: Este documento detalla el cableado de una placa electrónica básica para las pruebas de mesa.
pt: Este documento detalha o cabeamento de uma placa eletrônica básica para testes de bancada.
tr_tr: Bu döküman deneme amaçlı kullanılabilecek basit bir elektronik panelinin kablolanmasını açıklar.
zh_cn: 本文档详细介绍了用于台式测试的基本电路板的接线。

source: Some images shown in this section reflect the setup for a Robot Control System using Victor SPX Motor Controllers. Wiring diagram and layout should be similar for other motor controllers. Where appropriate, two sets of images are provided to show connections using controllers with and without integrated wires.
es_mx: Algunas imágenes que se muestran en esta sección reflejan la configuración de un sistema de control de robot utilizando controladores de motor Victor SPX. El diagrama de cableado y el diseño deben ser similares para otros controladores de motor. Cuando corresponda, se proporcionan dos conjuntos de imágenes para mostrar las conexiones que utilizan controladores con y sin cables integrados.
tr_tr: Bu bölümde gösterilen bazı resimler Victor SPX Motor Kontrol Cihazlarını kullanan bir Robot Kontrol Sisteminin kurulumunu yansıtır. Bağlantı şeması ve düzeni diğer motor kontrolörleri için benzer olmalıdır. Uygun olduğu durumlarda, entegre kablolar içeren ve içermeyen denetleyicileri kullanan bağlantıları göstermek için iki görüntü seti sağlanır.
zh_cn: 本节中显示的某些图像反映了使用SPARK电机控制器的机器人控制系统的设置。其他电机控制器的接线图和布局应类似。在适当的位置，第二组图像显示了将PWM控制器与集成电线一起使用的接线步骤。

source: Overview
es_mx: Descripción General
pt: Resumo
tr_tr: Genel Bakış
zh_cn: 概述

source: Detailed diagram of all of the components and how they are connected.
zh_cn: 展示了组件该如何连接的详细图示

source: Diagram courtesy of FRC\ |reg| Team 3161 and Stefen Acepcion.
es_mx: Diagrama cortesía de FRC\ Iregl Team 3161 y Stefen Acepcion.
pt: Diagrama cortesia da FRC \ | reg | Equipe 3161 e Stefen Acepcion.
tr_tr: FRC\ |reg| Takım 3161 ve Stefen Acepcion izniyle şema
zh_cn: 图由FRC\ |reg|3161团队和Stefen Acepcion提供。

source: Gather Materials
es_mx: Reunir Materiales
pt: Reunindo materiais
tr_tr: Malzemeleri Toplayın
zh_cn: 收集材料

source: Locate the following control system components and tools
es_mx: Localice los siguientes componentes y herramientas del sistema de control
pt: Localize os seguintes componentes e ferramentas do sistema de controle
tr_tr: Aşağıdaki kontrol sistemi bileşenlerini ve takımları edinin
zh_cn: 找到以下控制系统组件和工具

source: Kit Materials:
es_mx: Materiales del Kit:
pt: Materiais do kit:
tr_tr: Kit Malzemeleri:
zh_cn: 套件材料：

source: Power Distribution Panel (PDP)
es_mx: Panel de distribución de energía (PDP)
tr_tr: Power Distribution Panel (PDP) - Güç Dağıtım Paneli
zh_cn: 配电板（PDP）

source: Pneumatics Control Module (PCM)
es_mx: Módulo controlador de neumática (PCM)
tr_tr: Pneumatics Control Module (PCM) - Pnömatik Kontrol Modülü
zh_cn: 气动控制模块（PCM）

source: Voltage Regulator Module (VRM)
es_mx: Módulo regulador de voltaje (VRM)
tr_tr: Voltage Regulator Module (VRM) - Voltaj Regülatör Modülü
zh_cn: 稳压器模块（VRM）

source: OpenMesh radio (with power cable and Ethernet cable)
es_mx: Radio OpenMesh (con cable de alimentación y cable Ethernet)
pt: Rádio OpenMesh (com cabo de alimentação e cabo Ethernet)
tr_tr: OpenMesh radio (Güç kablosu ve ethernet kablosuyla)
zh_cn: OpenMesh无线路由器（带有电源线和以太网线）

source: Robot Signal Light (RSL)
es_mx: Luz de señal del robot (RSL)
tr_tr: Robot Sinyal Işığı - Robot Signal Light (RSL)
zh_cn: 机器人状态信号灯 (RSL)

source: 4x SPARK MAX or other motor controllers
es_mx: 4x SPARK MAX u otros controladores de motor
tr_tr: 4x SPARK MAX veya diğer motor kontrolörleri
zh_cn: 4个SPARK MAX或其他电机控制器

source: 2x PWM y-cables
pt: 2 cabos Y PWM
tr_tr: 2x PWM y-kablosu
zh_cn: 2个PWM Y型电缆

source: 120A Circuit breaker
es_mx: Disyuntor 120A
tr_tr: 120A Circuit breaker - Devre Kesici
zh_cn: 120A断路器

source: 4x 40A Circuit breaker
es_mx: 4x Fusible 40A
tr_tr: 4 adet 40A Sigorta - Circuit Breaker
zh_cn: 4个40A断路器

source: 6 AWG (16 :math:`mm^2`) Red wire
es_mx: 6 AWG (16 :math:`mm^2`) Cable rojo
pt: Fio Vermelho de 6 AWG (16 :math:`mm^2`)
tr_tr: 6 AWG (16 :math:`mm^2`) Kırmızı kablo
zh_cn: 6 AWG（16 :math:`mm^2`）红色电线

source: 10 AWG (6 :math:`mm^2`) Red/Black wire
es_mx: 10 AWG (6 :math:`mm^2`) Cable rojo/negro
pt: Fio Vermelho/Preto de 10 AWG (6 :math:`mm^2`)
tr_tr: 10 AWG (6 :math:`mm^2`) Kırmızı / Siyah kablo
zh_cn: 10 AWG（6 :math:`mm^2`）红色/黑色电线

source: 18 AWG (1 :math:`mm^2`) Red/Black wire
es_mx: 18 AWG (1 :math:`mm^2`) Cable rojo/negro
pt: Fio Vermelho/Preto de 18 AWG (1 :math:`mm^2`)
tr_tr: 18 AWG (1 :math:`mm^2`) Kırmızı / Siyah kablo
zh_cn: 18 AWG (1 :math:`mm^2`) 红色/黑色电线

source: 22 AWG (0.5 :math:`mm^2`) Yellow/Green twisted CAN cable
es_mx: 22 AWG (0.5 :math:`mm^2`) Cable torcido CAN amarillo/verde
pt: Fio CAN trançado Amarelo/Verde de 22 AWG (0.5 :math:`mm^2`)
tr_tr: 22 AWG (0.5 :math:`mm^2`) Sarı / Yeşil bükülmüş CAN kablosu
zh_cn: 22 AWG（0.5 :math:`mm^2`）黄色/绿色双绞CAN电缆

source: 16x 10-12 AWG (4 - 6 :math:`mm^2`) (Yellow) ring terminals (8x quick disconnect pairs if using integrated wire controllers)
es_mx: 16x 10-12 AWG (4 - 6 :math:`mm^2`) (Amarillo) terminales de anillo (8x pares de desconexión rápida si se utilizan controladores de cable integrados)
pt: 16x terminas em anel (amarelo) de 10-12 AWG (4 - 6: math: `mm ^ 2`) ( 8x pares de desconexão rápida se estiver usando controladores de fio integrados)
tr_tr: 16x 10-12 AWG (4 - 6 :math:`mm^2`) (Sarı) halka terminaller (entegre tel denetleyicileri kullanılıyorsa 8x hızlı bağlantı kesme çifti)
zh_cn: 16个 10-12 AWG（4 - 6 :math:`mm^2`）（黄色）环形端子（如果使用集成线控制器，则为8个快速断开对）

source: 2x Anderson SB50 battery connectors
es_mx: 2x Anderson SB50 conectores de batería
pt: 2x conectores de bateria Anderson SB50
tr_tr: 2x Anderson SB50 pil konektörleri
zh_cn: 2个Anderson SB50电池连接器

source: 6 AWG (16 :math:`mm^2`) Terminal lugs
es_mx: 6 AWG (16 :math:`mm^2`) Terminales lug
pt: 6x terminais de 6 AWG (16: matemática: `mm ^ 2`)
tr_tr: 6 AWG (16 :math:`mm^2`) Terminal pabuçları
zh_cn: 6 AWG（16 :math:`mm^2`）接线端子

source: 12V Battery
es_mx: Batería 12V
pt: Bateria de 12V'
tr_tr: 12V Akü
zh_cn: 12V电池

source: Red/Black Electrical tape
es_mx: Cinta eléctrica roja/negra
pt: Fita isolante vermelha/preta
tr_tr: Kırmızı/Siyah Elektrik Bandı
zh_cn: 红色/黑色电工胶带

source: Dual Lock material or fasteners
es_mx: Materiales de Dual Lock o sujetadores
pt: Fita dual lock ou materias para fixação
tr_tr: Dual Lock malzemesi veya bağlantı elemanları
zh_cn: 双锁材料或紧固件

source: Zip ties
es_mx: Cinchos
pt: Abraçadeiras plásticas
tr_tr: Plastik Kelepçeler
zh_cn: 扎带

source: 1/4" or 1/2" (6-12 mm) plywood
es_mx: 1/4" or 1/2" (6-12 mm) madera contrachapada
pt: Compensado ou Policarbonato de 1/2" ou 1/4" (6-12mm).
tr_tr: 1/4" or 1/2" (6-12 mm) kontrplak
zh_cn: 1/4“或1/2”（6-12毫米）胶合板

source: Tools Required:
es_mx: Herramientas Necesarias
pt: Ferramentas necessárias:
tr_tr: Gerekli Aletler
zh_cn: 所需工具：

source: Wago Tool or small flat-head screwdriver
es_mx: Herramienta Wago o destornillador pequeño de cabeza plana
pt: Chave de fenda pequena ou a ferramenta Wago
tr_tr: Wago Aleti veya küçük düz başlı tornavida
zh_cn: Wago工具或小型平头螺丝刀

source: Very small flat head screwdriver (eyeglass repair size)
es_mx: Destornillador de cabeza plana muy pequeño (tamaño reparación de anteojos)
pt: Chave de fenda bem pequena (do tipo utilizado em ajuste de óculos)
tr_tr: Çok küçük düz başlı tornavida (gözlük tamiri boyutunda)
zh_cn: 很小的一字螺丝刀（眼镜维修尺寸）

source: Philips head screw driver
es_mx: Destornillador de cabeza Philips
pt: Chave Phillips
tr_tr: Philips başlı tornavida - genel olarak yıldız başlı
zh_cn: 十字螺丝刀

source: 5 mm Hex key (3/16" may work if metric is unavailable)
es_mx: 5 mm Hex key (3/16" debe funcionar si la métrica no está disponible)
pt: Chave Allen de 5mm (3/16" deve funcionar se a de medida métrica estiver indisponível)
tr_tr: 5 mm Altıgen anahtar (metrik yoksa 3/16"çalışabilir)
zh_cn: 5毫米六角扳手（如果无公制，则3/16英寸可能会起作用）

source: 1/16" Hex key
es_mx: Llave hexagonal de 1/16”
pt: Chave Allen de 1/16"
tr_tr: 1/16" Hex-alyan anahtarı
zh_cn: 1/16“内六角扳手

source: Wire cutters, strippers, and crimpers
es_mx: Cortadores de alambre, pelacables y crimpadoras
pt: Alicate desencapador, crimpador e de corte
tr_tr: Yan keski, kablo soyucu ve kablo pabucu sıkıştırma pensesi
zh_cn: 剪线钳，剥线钳和压接钳

source: 7/16" (11 mm may work if imperial is unavailable) box end wrench or nut driver
es_mx: Llave de extremo de caja o destornillador de tuerca de 7/16" (11 mm pueden funcionar si el sistema inglés no está disponible)
zh_cn: 套筒扳手或螺母起子7/16英寸（如果没有英制，则11毫米可能起作用）

source: Create the Base for the Control System
es_mx: Crear la base para el Sistema de Control
pt: Crie a base para o sistema de controle
tr_tr: Kontrol Sistemini Monte Edecek Bir Yüzey Oluşturun
zh_cn: 为控制系统创建基础

source: For a benchtop test board, cut piece of 1/4" or 1/2" (6-12 mm) material (wood or plastic) approximately 24" x 16" (60 x 40 cm). For a Robot Quick Build control board see the supporting documentation for the proper size board for the chosen chassis configuration.
es_mx: Para una tabla de prueba de mesa, corte una pieza de material de 1/4"o 1/2" (6-12 mm) (madera o plástico) de aproximadamente 24 "x 16" (60 x 40 cm). Para una placa de control Robot Quick Build, consulte la documentación de apoyo para la placa del tamaño adecuado para la configuración de chasis elegida.
zh_cn: 对于台式测试板，切成1/4“或1/2”（6-12毫米）的材料（木材或塑料）约24“ x 16”（60 x 40厘米）。对于Robot Quick Build控制板，请参阅支持文档，以获取适用于所选配置的适当尺寸的板。

source: Layout the Core Control System Components
es_mx: Diseño de los componentes del sistema de control central
pt: Organize os principais componentes do Sistema de Controle
tr_tr: Temel Kontrol Sistemi Bileşenlerinin Yerleşimi
zh_cn: 布置核心控制系统组件

source: A basic wiring layout.
zh_cn: 基础布线

source: Lay out the components on the board. An example layout is shown in the image above.
es_mx: Coloque los componentes en el tablero. Un ejemplo de diseño se muestra en la imagen de arriba.
pt: Posicione os componentes na placa. Um exemplo é mostrado na imagem acima.
tr_tr: Bileşenleri tahtanın üzerine yerleştirin. Örnek düzen yukarıdaki görselde gösterilmiştir.
zh_cn: 布置板上的组件。上图显示了示例布局。

source: Using zipties to secure components down.
zh_cn: 用扎带来固定住组件

source: Fasten Components
es_mx: Sujetar Componentes
pt: Fixe os componentes
tr_tr: Bileşenleri Sabitleyin
zh_cn: 固定组件

source: Using the Dual Lock or hardware, fasten all components to the board. Note that in many FRC games robot-to-robot contact may be substantial and Dual Lock alone is unlikely to stand up as a fastener for many electronic components. Teams may wish to use nut and bolt fasteners or (as shown in the image above) cable ties, with or without Dual Lock to secure devices to the board.
es_mx: Usando Dual Lock o el hardware, fije todos los componentes a la placa. Tome en cuenta que en muchos juegos de FRC, el contacto de robot a robot puede ser sustancial y que Dual Lock solo, es poco probable que se mantenga como un elemento de fijación para muchos componentes electrónicos. Es posible que los equipos deseen utilizar sujetadores de tuerca y perno o (como se muestra en la imagen de arriba) cinchos, con o sin Dual Lock para asegurar los dispositivos a la placa.
pt: Utilizando fitas dupla-face (VHB por exemplo) ou abraçadeiras plásticas, prenda todos componentes à placa. Tenha em mente que, em muitos dos jogos da FRC, há constante toque físico entre os robôs. Muitos times optam por utilizar fitas dupla face e, principalmente, abraçadeiras plásticas para garantir a fixação apropriada dos componentes.
tr_tr: Dual Lock veya donanımı kullanarak, tüm bileşenleri karta sabitleyin. Birçok FRC oyununda robot-robota temasın olabileceğini ve Dual Lock'un tek başına birçok elektronik bileşen için bir bağlantı elemanı olarak ayakta durma ihtimalinin düşük olduğunu unutmayın. Takımlar, cihazları tahtaya sabitlemek için Dual Lock lu olan veya olmayan somun ve cıvata bağlantı elemanları veya (yukarıdaki resimde gösterildiği gibi) kablo bağları kullanmak isteyebilirler.
zh_cn: 使用双锁或紧固件将所有组件固定到板上。请注意，在许多FRC比赛中，机器人之间的碰撞可能很激烈，仅双重锁不可能作为许多电子组件的紧固件。团队可能希望使用带或不带双重锁定的螺母和螺栓紧固件或束线带（如上图所示）将设备固定到板上。

source: Attach Battery Connector to PDP
es_mx: Unir el conector de la batería a la PDP
pt: Fixe o conector da bateria à PDP
tr_tr: Akü Konektörünü PDP'ye takın
zh_cn: 将电池连接器连接到PDP

source: Highlights the location of the terminal lugs on the PDP and circuit breaker.
zh_cn: 标记出接线端子在PDP和断路器上的位置

source: Requires: Battery Connector, 6 AWG (16 :math:`mm^2`) terminal lugs, 1/16" Allen, 5 mm Allen, 7/16" (11 mm) Box end
es_mx: Requiere: Conector de batería, terminales de terminal 6 AWG (16 :math:`mm^2`), Allen de 1/16", Allen de 5 mm, extremo de caja de 7/16" (11 mm)
pt: Requer: Conector Anderson, Terminal olho de 6AWG (16 :math:`mm^2`) , Allen de 1/16", Allen de 5mm e a chave de boca 7/16" (11 mm)
tr_tr: Gerektirir: Pil Konnektörü, 6 AWG (16 :math:`mm^2`) terminal pabuçları, 1/16 "Alyan, 5 mm Alyan, 7/16" (11 mm) Kutu ucu
zh_cn: 要求：电池连接器，6 AWG（16 :math:`mm^2`）接线端子，1/16“内六角，5 mm内六角，7/16”（11 mm）套筒

source: Attach terminal lugs to battery connector:
es_mx: Una las terminales al conector de la batería:
pt: Prenda os terminais em olho ao conector da bateria:
tr_tr: Kablo pabuçlarını akü konektörüne takın
zh_cn: 将接线端子连接到电池连接器：

source: Using a 1/16" Allen wrench, remove the two screws securing the PDP terminal cover.
es_mx: Usando una llave Allen de 1/16", retire los dos tornillos que aseguran la cubierta del terminal PDP.
pt: Utilizando a Allen 1/16", retire os dois parafusos que prendem a proteção dos terminais da PDP.
tr_tr: 1/16 "Alyen anahtarı kullanarak, PDP terminal kapağını sabitleyen iki vidayı çıkarın.
zh_cn: 使用1/16英寸内六角扳手，卸下固定PDP端子盖的两颗螺钉。

source: Using a 5 mm Allen wrench (3/16"), remove the negative (-) bolt and washer from the PDP and fasten the negative terminal of the battery connector.
es_mx: Con una llave Allen de 5 mm (3/16"), retire el perno negativo (-) y la arandela del PDP y fije el terminal negativo del conector de la batería.
pt: Utilizando a Allen 5mm (3/16"), remova o parafuso e a arruela que ficam rosqueados ao o polo negativo (-) da PDP e prenda o terminal negativo do conector da bateria.
tr_tr: 5 mm Alyan anahtarı (3/16") kullanarak, negatif (-) cıvatayı ve pulu PDP'den çıkarın ve akü konektörünün negatif terminalini sıkın.
zh_cn: 使用5毫米内六角扳手（3/16“），从PDP上卸下负极（-）螺栓和垫圈，然后拧紧电池连接器的负极端子。

source: Using a 7/16" (11 mm) box end wrench, remove the nut on the "Batt" side of the main breaker and secure the positive terminal of the battery connector
es_mx: Con una llave inglesa de extremo de caja de 7/16" (11 mm), retire la tuerca del lado "Batt" del disyuntor principal y asegure el terminal positivo del conector de la batería
pt: Utilizando a chave de boca 7/16" (11 mm), remova a proteção de borracha e a porca do parafuso do lado "Batt" do Disjuntor principal, encaixe o terminal positivo do conector de bateria e prenda-o bem com a porca.
tr_tr: 7/16"(11 mm) kutu uçlu anahtar kullanarak, ana kesicinin "Akü" tarafındaki somunu çıkarın ve akü konektörünün artı kutbunu sabitleyin
zh_cn: 使用7/16英寸（11毫米）套筒扳手，卸下主断路器“ Batt”侧的螺母，并固定电池连接器的正极

source: Wire Breaker to PDP
es_mx: Cablear el interruptor a la PDP
pt: Do Disjuntor principal à PDP
tr_tr: Sigortayı PDP ye bağlayın
zh_cn: 将断路器连接到PDP

source: Show the circuit breaker wired to the PDP.
zh_cn: 断路器已经连接到PDP

source: Requires: 6 AWG (16 :math:`mm^2`) red wire, 2x 6 AWG (16 :math:`mm^2`) terminal lugs, 5 mm Allen, 7/16" (11 mm) box end
es_mx: Requiere: cable rojo 6 AWG (16 :math:`mm^2`), 2 terminales terminales de 6 AWG (16 :math:`mm^2`), Allen de 5 mm, extremo de caja de 7/16" (11 mm)
pt: Requer: Fio vermelho de 6AWG (16 :math:`mm^2`), 2x terminais olho de 6AWG (16 :math:`mm^2`), Allen de 5mm e a chave de boca 7/16" (11 mm).
tr_tr: Gerektirir: 6 AWG (16 :math:`mm^2`) kırmızı kablo, 2x 6 AWG (16 :math:`mm^2`) terminal pabuçları, 5 mm Alyan, 7/16"(11 mm) kutu ucu
zh_cn: 要求：6 AWG（16 :math:`mm^2`）红色电线，2x 6 AWG（16 :math:`mm^2`）接线端子，5 mm内六角，7/16“（11 mm）套筒扳手

source: Secure one terminal lug to the end of the 6 AWG (16 :math:`mm^2`) red wire. Using the 7/16" (11 mm) box end, remove the nut from the "AUX" side of the 120A main breaker and place the terminal over the stud. Loosely secure the nut (you may wish to remove it shortly to cut, strip, and crimp the other end of the wire). Measure out the length of wire required to reach the positive terminal of the PDP.
es_mx: Asegure una terminal al extremo del cable rojo de 6 AWG (16 :math:`mm^2`). Usando el extremo de la caja de 7/16" (11 mm), retire la tuerca del lado "AUX" del disyuntor principal de 120A y coloque el terminal sobre el espárrago. Asegure sin apretar la tuerca (es posible que desee quitarla en breve para cortar, pelar y engarzar el otro extremo del cable.) Mida la longitud del cable necesaria para llegar al terminal positivo del PDP.
zh_cn: 将一个接线端子固定到6 AWG（16：math：`mm ^ 2`）红色电线的末端。使用7/16英寸（11毫米）的套筒扳手，从120A主断路器的“ AUX”侧卸下螺母，然后将端子放在双头螺栓上。轻轻固定螺母（您可能希望将其短时卸下以进行切割，剥去并压接电线的另一端），测量出到达PDP正极所需的电线长度。

source: Cut, strip, and crimp the terminal to the 2nd end of the red 6 AWG (16 :math:`mm^2`) wire.
es_mx: Corte, pele y engarce el terminal al segundo extremo del cable rojo 6 AWG (16 :math:`mm^2`).
pt: Corte, encaixe e crimpe o terminal no outro lado do fio vermelho de 6AWG (16 :math:`mm^2`).
tr_tr: Kırmızı 6 AWG(16 :math:`mm^2`) kablonun 2. ucuna kadar terminali kesin, soyun ve kıvırın.
zh_cn: 将端子切割，剥皮并压接到红色的6 AWG（16 :math:`mm^2`）线的第二端。

source: Using the 7/16" (11 mm) box end, secure the wire to the "AUX" side of the 120A main breaker.
es_mx: Usando el extremo de la caja de 7/16" (11 mm), asegure el cable al lado "AUX" del disyuntor principal de 120A.
pt: Utilizando a chave de boca 7/16" (11 mm), prenda o fio no lado "AUX" do disjuntor principal de 120A.
tr_tr: 7/16" (11 mm) kutu ucunu kullanarak kabloyu 120A ana kesicinin "AUX" tarafına sabitleyin.
zh_cn: 使用7/16英寸（11毫米）的套筒扳手，将电线固定到120A主断路器的“ AUX”侧。

source: Using the 5 mm Allen wrench, secure the other end to the PDP positive terminal.
es_mx: Con la llave Allen de 5 mm, fije el otro extremo al terminal positivo del PDP.
pt: Utilizando a Allen de 5mm, prenda a outra ponta ao terminal positivo da PDP.
tr_tr: 5 mm Alyan anahtarı kullanarak, diğer ucu PDP pozitif terminale sabitleyin.
zh_cn: 使用5毫米内六角扳手，将另一端固定到PDP正极端子。

source: Insulate PDP connections
es_mx: Aislar conexiones PDP
pt: Isolando as conexões da PDP
tr_tr: PDP bağlantılarını yalıtın
zh_cn: 给PDP连接做绝缘

source: Putting tape around the connectors to insulate them.
zh_cn: 在连接处缠上电工胶布以绝缘

source: Requires: 1/16" Allen, Electrical tape
es_mx: Requiere: Allen de 1/16", cinta de aislar
pt: Requer: Allen 1/16", Fita isolante
tr_tr: Gerekenler: 1/16" Alyan, Elektrik bandı
zh_cn: 需要：1/16“内六角扳手，电工胶带

source: Using electrical tape, insulate the two connections to the 120A breaker. Also insulate any part of the PDP terminals which will be exposed when the cover is replaced. One method for insulating the main breaker connections is to wrap the stud and nut first, then use the tape wrapped around the terminal and wire to secure the tape.
es_mx: Usando cinta de aislar, aísle las dos conexiones al interruptor de 120A. Tambien aísle cualquier parte de las terminales de la PDP que quedarán expuestas cuando se reemplace la cubierta. Un método para aislar las conexiones del interruptor principal es envolver primero el perno y la tuerca, luego use la cinta envuelta en la terminal y el cable para asegurar la cinta.
pt: Utilizando a fita isolante, isole as duas conexões do disjuntor principal de 120A. Isole tambem a parte dos terminais da PDP que ficarão expostas quando a proteção quando for presa novamente. Uma maneira de isolar as conexões do disjuntor principal é passar a fita no cabo e na porca antes de serem presos e, depois de presos, passar fita novamente.
tr_tr: Elektrik bandı kullanarak 120A devre kesiciye giden iki bağlantıyı yalıtın. Ayrıca PDP konektörlerinin kapağı kaldırıldığında açığa çıkacak herhangi bir parçasını da yalıtın. Devre kesici bağlantılarını yalıtmanın bir yolu, önce saplamayı ve somunu sarmak, ardından somunun etrafındaki bandı sabitlemek için pabuç ve telin etrafına sarılmış bandı kullanmaktır.
zh_cn: 使用胶带将到120A断路器的两个连接绝缘。此外，还要对PDP端子的部分进行绝缘，使其在更换盖子被放回时不会裸露。给主断路器连接处绝缘的一种方法是先包裹柱头螺栓和螺母，然后使用电工胶带缠绕在端子和导线周围以紧固胶带。

source: Using the 1/16" Allen wrench, replace the PDP terminal cover
es_mx: Usando la llave Allen de 1/16", reemplace la cubierta del terminal PDP.
pt: Utilizando a Allen de 1/16", prenda a capa de proteção dos terminais à PDP.
tr_tr: 1/16" alyan anahtarı kullanarak PDP pabuç kapağını takın
zh_cn: 使用1/16“内六角扳手，装回PDP端子盖

source: Wago connectors
es_mx: Conectores Wago
pt: Conectores Wago
tr_tr: Wago konektörleri
zh_cn: Wago连接器

source: The next step will involve using the Wago connectors on the PDP. To use the Wago connectors, insert a small flat blade screwdriver into the rectangular hole at a shallow angle then angle the screwdriver upwards as you continue to press in to actuate the lever, opening the terminal. Two sizes of Wago connector are found on the PDP:
es_mx: El siguiente paso consistirá en utilizar los conectores Wago en el PDP. Para usar los conectores Wago, inserte un destornillador pequeño de punta plana en el orificio rectangular en un ángulo poco profundo y luego incline el destornillador hacia usted mientras continúe presionándolo actuara como una palanca, abriendo la terminal. Dos tamaños de conectores Wago son encontrados en la PDP:
pt: O próximo passo é aprender a utilizar os conectores Wago da PDP. Para utiliza-los, pegue uma pequena chave de fenda e a insira no buraco retangular o mais horizontal possível. Empurre a chave para cima, aí você vai poder ver que, abaixo do buraco retangular, uma pequena entrada vai se abrir. Nessa entrada devem ser presos os cabos dos componentes a serem energizados. A PDP têm dois tamanhos de conectores Wago:
tr_tr: Sonraki adımda PDP'deki Wago konnektörlerini kullanmamız gerekecek. Wago konnektörlerini kullanmak için, dikdörtgen deliğe küçük bir düz uçlu tornavidayı, yere yaklaşık paralel olacak şekilde sokun ve ardından terminali açmak için tornavidayı hafifçe yukarı kaldırarak kablo kıskacını açın. PDP'de iki boyutta Wago konektörü bulunur:
zh_cn: 下一步将涉及在PDP上使用Wago连接器。要使用Wago连接器，请将小号一字螺丝刀以较小的角度插入矩形孔中，然后在继续按入以致动操纵杆并打开端子的同时，将螺丝刀向上倾斜。 PDP上有两种尺寸的Wago连接器：

source: Small Wago connector: Accepts 10 - 24 AWG (0.25 - 6 :math:`mm^2`), strip 11-12 mm (~7/16")
es_mx: Conector Wago pequeño: Acepta 10 - 24 AWG (0.25 - 6 :math:`mm^2`), tira de 11-12 mm (~7/16")
pt: Conector Wago pequeno: Aceita 10AWG-24AWG (0.25 - 6 :math:`mm^2`), strip 11-12mm (~7/16")
tr_tr: Küçük Wago konektörü: 10-24 AWG'yi kabul eder (0.25 - 6 :math:`mm^2`), 11-12 mm şerit (~7/16")
zh_cn: 小型Wago连接器：10-24 AWG（0.25-6：math：`mm ^ 2`），剥到11-12 mm（〜7/16“）

source: Large Wago connector: Accepts 6 - 12 AWG (4 - 16 :math:`mm^2`), strip 12-13 mm (~1/2")
es_mx: Conector Wago largo: Acepta 6 - 12 AWG (4 - 16 :math:`mm^2`), tira de 12-13 mm (~1/2")
pt: Conector Wago pequeno: Aceita 6AWG-12AWG (4 - 16 :math:`mm^2`), strip 12-13mm (~1/2")
tr_tr: Büyük Wago konektörü: 6-12 AWG'yi kabul eder (4 - 16 :math:`mm^2`), 12-13 mm şerit (~1/2")
zh_cn: 大型Wago连接器：接受6-12 AWG（4-16：math：`mm ^ 2`），剥到12-13 mm（〜1/2“）
