Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-1/how-to-wire-a-robot.po
Languages: es_mx, pt, tr_tr, zh_cn

source: To maximize pullout force and minimize connection resistance wires should not be tinned (and ideally not twisted) before inserting into the Wago connector.
es_mx: Para maximizar la fuerza de extracción y minimizar la resistencia de la conexión, los cables no deben estañarse (y lo ideal es que no estén torcidos) antes de insertarlos en el conector Wago.
pt: Para facilitar a entrada do cabo na entrada da PDP, deve deixar a parte de cobre exposta bem esticada (não torcida, de preferencia).
tr_tr: Kıstırma kuvvetini en üst düzeye çıkarmak ve bağlantı direncini en aza indirmek için, teller Wago konnektörüne takılmadan önce lehimlenmemeli (ve tercihen bükülmemelidir).
zh_cn: 为了最大程度地提高拔出力并最大程度地减少连接电阻，在将电线插入Wago连接器之前，请勿对电线进行镀锡（理想情况下，应避免其绞合）。

source: Motor Controller Power
es_mx: Controlador de la Potencia del motor
pt: Ligando os controladores de motor
tr_tr: Motor Kontrolöre Güç Vermek
zh_cn: 电机控制器电源

source: Wiring power from the PDP to motor controllers.
zh_cn: 在PDP和电机控制器之间连上电线

source: Wiring power to a Spark Motor Controller with ring terminals.
zh_cn: 使用使用环形端子给Spark电机连上电线

source: Requires: Wire Stripper, Small Flat Screwdriver, 10 or 12 AWG (4 - 6 :math:`mm^2`) wire, 10 or 12 AWG (4 - 6 :math:`mm^2`) fork/ring terminals (terminal controllers only), wire crimper
es_mx: Requiere: pelacables, destornillador plano pequeño, 10 o 12 AWG (4 - 6 :math:`mm^2`) cable, 10 o 12 AWG (4 - 6 :math:`mm^2`) terminales de horquilla/anillo (controladores de terminal solamente), crimpadora de alambre
pt: Requer: Alicate para desencapar fios, Chave de fenda pequena, fio de 10 ou 12 AWG (4 - 6 :math:`mm^2`), terminal olho de 10 ou 12AWG (4 - 6 :math:`mm^2`), alicate crimpador
tr_tr: Gerektirir: Kablo Sıyırıcı, Küçük Düz Tornavida, 10 veya 12 AWG (4 - 6 :math:`mm^2`) kablo, 10 veya 12 AWG (4 - 6 :math:`mm^2`) çatal / halka terminalleri ( yalnızca terminal denetleyicileri), kablo kıvırıcı
zh_cn: 要求：剥线钳，小型平头螺丝刀，10或12 AWG（4-6 mm2）电线，10或12 AWG（4-6 mm2）叉/环终端（仅限终端控制器），压线钳

source: For SPARK MAX or other wire integrated motor controllers (top image):
es_mx: Para SPARK MAX u otros controladores de motor con cables integrados (imagen superior):
tr_tr: SPARK MAX veya diğer kablolu entegre motor kontrolörleri için (üstteki resim):
zh_cn: 对于SPARK MAX或其他有线集成电机控制器（上图）：

source: Cut and strip the red and black power input wires, then insert into one of the 40A (larger) Wago terminal pairs.
es_mx: Corte y pele los cables rojos y negros de entrada , luego insértelos en uno de los pares de terminales Wago de 40 A (más grandes).
tr_tr: Kırmızı ve siyah güç giriş kablolarını kesin ve soyun, ardından 40A (daha büyük) Wago terminal çiftlerinden birine takın.
zh_cn: 切割并剥去红色和黑色电源输入线的电线，然后插入40A（更大）的Wago终端对之一。

source: For terminal motor controllers (bottom image):
es_mx: Para terminales de controladores de motor (imagen inferior):
pt: Para controladores de motor com terminais (imagem de baixo):
tr_tr: Vida tipi bağlantılı motor sürücüleri için (alttaki resim):
zh_cn: 对于终端电机控制器（下图）：

source: Cut red and black wire to appropriate length to reach from one of the 40A (larger) Wago terminal pairs to the input side of the motor controller (with a little extra for the length that will be inserted into the terminals on each end)
es_mx: Corte el cable rojo y negro a la longitud adecuada para llegar desde uno de los pares de terminales Wago de 40 A (más grandes) hasta el lado de entrada del controlador del motor (con un poco más de la longitud que se insertará en los terminales en cada extremo)
pt: Corte um cabo vermelho e um preto do tamanho apropriado para chegar até a entrada de 40A (grande) do terminal Wago PDP (deixe um pouco de sobra para inserir nos terminais em cada ponta)
tr_tr: 40A (daha büyük) Wago terminal çiftlerinden birinden motor kontrol cihazının giriş tarafına ulaşmak için kırmızı ve siyah kabloyu uygun uzunlukta kesin (her uçtaki terminallere eklenecek uzunluk için biraz fazladan)
zh_cn: 将红色和黑色电线切成适当的长度，以从40A（更大）的Wago端子连接到电动机控制器的输入侧（在插入到两端的端子中的长度上稍有增加）

source: Strip one end of each of the wires, then insert into the Wago terminals.
es_mx: Pele un extremo de cada uno de los cables, luego insértelo en las terminales Wago.
pt: Desencape a extremidade de cada um dos fios, então os insira nos terminais Wago
tr_tr: Her bir kablonun bir ucunu soyun, ardından Wago terminallerine yerleştirin.
zh_cn: 剥去每根电线的一端，然后插入Wago端子。

source: Strip the other end of each wire, and crimp on a ring or fork terminal
es_mx: Pele el otro extremo de cada cable y crímpelo en una terminal de anillo u horquilla
pt: Desencape a outra extremidade de cada cabo e crimpe um terminal olhal em cada um
tr_tr: Her kablonun diğer ucunu soyun ve bir halka veya çatal pabuç içinde sıkıştırın
zh_cn: 剥去每根电线的另一端，并压在环形或叉形端上

source: Attach the terminal to the motor controller input terminals (red to +, black to -)
es_mx: Conecte la terminal a los terminales de entrada del controlador del motor (rojo a +, negro a -)
pt: Prenda os fios nos terminais dos controladores (vermelho no + e preto no -)
tr_tr: Terminali motor kontrol cihazı giriş terminallerine bağlayın (kırmızı +'ya, siyah -'a)
zh_cn: 将端子连接到电机控制器输入端子（红色至+，黑色至-）

source: Weidmuller Connectors
es_mx: Conectores Weidmuller
pt: Conector Weidmuller
tr_tr: Weidmuller Konnektörleri
zh_cn: 魏德米勒连接器

source: The correct strip length is ~5/16" (~8 mm), not the 5/8" (~16 mm) mentioned in the video.
pt: O tamanho correto para se desencapar é 5/16"(~8mm), e não 5/8" (~16 mm) como dito no vídeo.
tr_tr: Doğru şerit uzunluğu videoda bahsedilen ~5/16" (~8 mm),değil, 5/8" (~16 mm)'dir.
zh_cn: 正确的剥皮长度是〜5/16“（〜8 mm），而不是视频中提到的5/8”（〜16 mm）。

source: A number of the CAN and power connectors in the system use a Weidmuller LSF series wire-to-board connector. There are a few things to keep in mind when using this connector for best results:
es_mx: Varios conectores CAN y de alimentación en el sistema utilizan un conector de cable a placa serie Weidmuller LSF. Hay algunas cosas a tener en cuenta al usar este conector para obtener mejores resultados:
pt: Uma parte dos conectores, tanto CAN quanto de energia, utilizam um conector Weidmuller LSF. Há algumas coisas importantes de se ter em mente para utiliza-los da melhor forma possível.
tr_tr: Sistemdeki bazı CAN ve güç konnektörleri, Weidmuller LSF serisi kablodan-karta konnektöri kullanır. En iyi sonuçlar için bu konnektörü kullanırken akılda tutulması gereken birkaç nokta vardır:
zh_cn: 系统中的许多CAN和电源连接器都使用Weidmuller LSF系列线对板连接器。使用此连接器以获得最佳结果时，请记住以下几点：

source: Wire should be 16 AWG (1.5 :math:`mm^2`) to 24 AWG (0.25 :math:`mm^2`) (consult rules to verify required gauge for power wiring)
es_mx: El cable debe ser de 16 AWG (1.5 :math:`mm^2`) a 24 AWG (0.25 :math:`mm^2`) (consulte las reglas para verificar el calibre requerido para el cableado de energía)
pt: O fio deve estar entre 16AWG (1.5 :math:`mm^2`) e 24AWG (0.25 :math:`mm^2`) (consulte as regras e verifique cada espessura de fio correspondente ao componente que será utilizado)
tr_tr: Kablo 16 AWG (1.5 :math:`mm^2`) ila 24 AWG (0.25 :math:`mm^2`) olmalıdır (güç kablolaması için gerekli ölçüyü doğrulamak için kurallara bakın)
zh_cn: 电线应为16 AWG（1.5 mm2）至24 AWG（0.25 mm2）（查看规则以确认所需的电源接线规格）

source: Wire ends should be stripped approximately 5/16 (~8 mm)"
es_mx: Los extremos de los cables deben ser pelados aproximadamente 5/16 (~8 mm)"
pt: Fios devem ser desencapados a aproximadamente 5/16"(~8mm) da extremidade
tr_tr: Kablo uçları yaklaşık 5/16 (~ 8 mm) soyulmalıdır "
zh_cn: 电线末端应剥去大约5/16（〜8 mm）”

source: To insert or remove the wire, press down on the corresponding "button" to open the terminal
es_mx: Para insertar o quitar el cable, presione el "botón" correspondiente para abrir la terminal
pt: Para inserir ou remover os fios, pressione o "botão" correspondente para abrir o terminal
tr_tr: Kabloyu takmak veya çıkarmak için, terminali açmak için ilgili "düğmeye" basın
zh_cn: 要插入或拔出电线，请按下相应的“按钮”以打开端口

source: After making the connection check to be sure that it is clean and secure:
es_mx: Después de realizar la conexión, verifique que esté limpia y segura:
pt: Depois de conectar, cheque para ter certeza se está tudo certo:
tr_tr: Bağlantıyı kontrol ettikten sonra temiz ve sağlam olduğundan emin olun:
zh_cn: 建立连接后，请检查连接是否整洁且安全：

source: Verify that there are no "whiskers" outside the connector that may cause a short circuit
es_mx: Verifique que no haya "bigotes" fuera del conector que puedan causar un cortocircuito.
pt: Verifique se não há pequenos fios expostos para fora do terminal que possam causar um curto-circuito
tr_tr: Konektörün dışında kısa devreye neden olabilecek "çapak" olmadığını doğrulayın
zh_cn: 确认连接器外部没有“胡须”，胡须可能会引起短路

source: Tug on the wire to verify that it is seated fully. If the wire comes out and is the correct gauge it needs to be inserted further and/or stripped back further.
es_mx: Tire del cable para verificar que esté completamente asentado. Si el cable sale y tiene el calibre correcto, debe insertarse más y/o pelarse más.
pt: Puxe o fio para verificar se ele está bem preso. Se ele ceder, abra o terminal e prenda-o melhor ou desencape um pouco mais a ponta do fio.
tr_tr: Tam olarak oturduğunu doğrulamak için kabloyu çekin. Tel çıkar ve doğru ölçü ise, daha fazla sokulması ve / veya daha fazla sıyrılması gerekir.
zh_cn: 拖拽电线以确认其完全固定。如果电线被拉出并且是正确的规格，则需要进一步插入和/或剥开更多。

source: roboRIO Power
es_mx: Alimentación roboRIO
pt: Ligando a roboRIO
tr_tr: roboRIO Gücü
zh_cn: roboRIO电源

source: Power coming from the PDP to the roboRIO.
zh_cn: 电线从PDP连接到roboRIO

source: Requires: 10A/20A mini fuses, Wire stripper, very small flat screwdriver, 18 AWG (1 :math:`mm^2`) Red and Black
es_mx: Requiere: mini fusibles 10A/20A, pelacables, destornillador plano muy pequeño, 18 AWG (1 :math:`mm^2`) Rojo y Negro
pt: Requer: Fusiveis automotivos de 10A e 20A, alicate desemcapador, chave fenda bem pequena, fios vermelho e preto de 18 AWG (1 :math:`mm^2`)
tr_tr: Gerektirir: 10A / 20A mini sigortalar, Kablo sıyırıcı, çok küçük düz tornavida, 18 AWG (1 :math:`mm^2`) Kırmızı ve Siyah
zh_cn: 要求：10A / 20A迷你保险丝，剥线钳，非常小的一字螺丝刀，18 AWG（1 :math:`mm^2`）红色和黑色

source: Insert the 10A and 20A mini fuses in the PDP in the locations shown on the silk screen (and in the image above)
es_mx: Inserte los mini fusibles de 10A y 20A en el PDP en los lugares que se muestran en la impresión (y en la imagen de arriba)
pt: Insira os fusíves de 10 e 20 amperes na PDP nos lugares demonstrados na imagem acima.
tr_tr: 10A ve 20A mini sigortaları, ipek ekranda gösterilen konumlara (ve yukarıdaki resimde) PDP'ye takın.
zh_cn: 将10A和20A微型保险丝插入丝印所示位置（以及上图）的PDP中。

source: Strip ~5/16" (~8 mm) on both the red and black 18 AWG (1 :math:`mm^2`) wire and connect to the "Vbat Controller PWR" terminals on the PDB
es_mx: Pele ~5/16" (~8 mm) en tanto en el cable 18 AWG (1 :math:`mm^2`) rojo como en el negro y conecte las terminales del "Vbat Controller PWR" en el PDB
pt: Desencape aproximadamente ~5/16" (~8 mm) das pontas dos fios de 18 AWG (1 :math:`mm^2`) vermelho e preto e conecte aos terminais "Vbat Controller PWR" na PDP.
tr_tr: Hem kırmızı hem de siyah 18 AWG (1 :math:`mm^2`) kabloyu ~ 5/16 "(~ 8 mm) soyun ve PDB üzerindeki "Vbat Controller PWR" terminallerine bağlayın
zh_cn: 剥去红色和黑色18 AWG（1上的〜5/16“（〜8 mm） mm2）电线并连接到PDB上的“ Vbat Controller PWR”端子

source: Measure the required length to reach the power input on the roboRIO. Take care to leave enough length to route the wires around any other components such as the battery and to allow for any strain relief or cable management.
es_mx: Mida la longitud requerida para alcanzar la entrada de energía en la roboRIO. Tenga cuidado de dejar suficiente longitud para enrutar los cables alrededor de cualquier otro componente, como la batería, y para permitir cualquier alivio de tensión o manejo del cable.
pt: Meça o comprimento nescessário dos fios para chegarem do roboRIO a PDP. Tome cuidado ao fazer o caminho desses fios, deixe comprimento o suficiente para contornar outros componentes e não passe por nenhum lugar que possa causar problemas.
tr_tr: RoboRIO'daki güç girişine ulaşmak için gerekli uzunluğu ölçün. Kabloları pil gibi diğer bileşenlerin etrafından dolaştırmak ve herhangi bir gerilim azaltma veya kablo yönetimine izin vermek için yeterli uzunluk bırakmaya özen gösterin.
zh_cn: 测量所需的长度，以达到roboRIO上的电源输入。注意留出足够的长度，以将导线绕在电池等任何其他组件周围，并进行应力消除或电缆整理。

source: Cut and strip the wire.
es_mx: Corte y pele el cable.
pt: Corte e desencape o fio
tr_tr: Kabloyu kesin ve soyun.
zh_cn: 切割并剥去电线。

source: Using a very small flat screwdriver connect the wires to the power input connector of the roboRIO (red to V, black to C). Also make sure that the power connector is screwed down securely to the roboRIO.
es_mx: Con un destornillador plano muy pequeño, conecte los cables al conector de entrada de alimentación de la roboRIO (rojo a V, negro a C). También asegúrese de que el conector dé alimentación esté atornillado de forma segura a la roboRIO.
pt: Utilizando uma pequena chave de fenda, conecte os fios no terminal do roboRIO (Vermelho no V e preto no C). Tenha certeza que o terminal está preso firmemente ao roboRIO.
tr_tr: Çok küçük bir düz tornavida kullanarak kabloları roboRIO'nun güç girişi konektörüne bağlayın (kırmızıdan V'ye, siyahtan C'ye). Ayrıca güç konektörünün roboRIO'ya güvenli bir şekilde vidalandığından emin olun.
zh_cn: 使用非常小的平头螺丝刀将电线连接到roboRIO的电源输入连接器（红色至V，黑色至C）。还要确保将电源连接器牢固地拧到roboRIO上。

source: Voltage Regulator Module Power
es_mx: Alimentación del Módulo Regulador de Voltaje
pt: Ligando o Módulo regulador de tensão (VRM)
tr_tr: Voltaj Regülatör Modülü Gücü
zh_cn: 稳压模块电源

source: Power going from the PDP to the VRM.
zh_cn: 电线从PDP连接到VRM

source: Requires: Wire stripper, small flat screwdriver (optional), 18 AWG (1 :math:`mm^2`) red and black wire:
es_mx: Requiere: Pelacables, destornillador plano pequeño (opcional), cables 18 AWG (1 :math:`mm^2`) rojo y blanco:
pt: Requer: alicate desemcapador, chave de fenda pequena (opcional), fio vermelho e preto de 18 AWG(1 :math:`mm^2`):
tr_tr: Gerektirir: Kablo sıyırıcı, küçük düz tornavida (isteğe bağlı), 18 AWG (1 :math:`mm^2`)kırmızı ve siyah kablo:
zh_cn: 要求：剥线钳，小型平头螺丝刀（可选），18 AWG（1 :math:`mm^2`）红色和黑色电线：

source: Strip ~5/16" (~8 mm) on the end of the red and black 18 AWG (1 :math:`mm^2`) wire.
es_mx: Pele ~5/16" (~8 mm) tanto en el cable 18 AWG (1 :math:`mm^2`) rojo como en el negro.
pt: Desencape ~5/16" (~8 mm) da ponta do cabo vermelho e do cabo preto de 18 AWG (1 :math:`mm^2`).
tr_tr: Kırmızı ve siyah 18 AWG (1 :math:`mm^2`) kablonun ucunu ~ 5/16"(~8 mm) soyun.
zh_cn: 在红色和黑色18 AWG（1 :math:`mm^2`）导线的末端剥去〜5/16“（〜8 mm）。

source: Connect the wire to one of the two terminal pairs labeled "Vbat VRM PCM PWR" on the PDP.
es_mx: Conecte el cable a uno de los dos pares de terminales etiquetados "Vbat VRM PCM PWR" en el PDP.
pt: Conecte os fios à um dos dois pares de terminais da PDP com nome de "Vbat VRM PCM PWR".
tr_tr: Kabloyu PDP'de "Vbat VRM PCM PWR" etiketli iki terminal çiftinden birine bağlayın.
zh_cn: 将电线连接到PDP上标有“ Vbat VRM PCM PWR”的两个端子对之一。

source: Measure the length required to reach the "12Vin" terminals on the VRM. Take care to leave enough length to route the wires around any other components such as the battery and to allow for any strain relief or cable management.
es_mx: Mida la longitud requerida para alcanzar las terminales de "12Vin" en el VRM. Tenga cuidado de dejar suficiente longitud para enrutar los cables alrededor de cualquier otro componente, como la batería, y para permitir cualquier alivio de tensión o manejo del cable.
pt: Meça o comprimento para alcançar os terminais "12Vin" da VRM. Sempre cuide para deixar um comprimento suficiente para contornar alguns componentes no caminho e evitar qualquer desprendimento do cabo.
tr_tr: VRM'deki "12Vin" terminallerine ulaşmak için gereken uzunluğu ölçün. Kabloları pil gibi diğer bileşenlerin etrafından dolaştırmak ve herhangi bir gerilim azaltma veya kablo yönetimine izin vermek için yeterli uzunluk bırakmaya özen gösterin.
zh_cn: 测量到达VRM上“ 12Vin”端子所需的长度。请注意留出足够的长度，以将导线绕在电池等任何其他组件周围，并进行应力消除或电缆整理。

source: Cut and strip ~5/16" (~8 mm) from the end of the wire.
es_mx: Cortar y pelar ~5/16" (~8 mm) del extremo del cable.
pt: Corte e desencape ~5/16" (~8mm) da ponta do cabo.
tr_tr: Kablonun ucundan ~5/16" (~8 mm) kesin ve soyun.
zh_cn: 从导线末端切下并剥去〜5/16“（〜8 mm）。

source: Connect the wire to the VRM 12Vin terminals.
es_mx: Conecte el cable a las terminales PCM 12Vin.
pt: Conecte os fios ao terminal 12Vin da VRM.
tr_tr: Kabloyu VRM 12Vin terminallerine bağlayın.
zh_cn: 将电线连接到VRM 12Vin端子。

source: Pneumatics Control Module Power (Optional)
es_mx: Alimentación del Módulo de Control Neumático (opcional)
pt: Ligando o Módulo de Controle Pneumático (PCM) (opcional)
tr_tr: Pnömatik Kontrol Modülü Gücü (İsteğe Bağlı)
zh_cn: 气动控制模块功率（可选）

source: Power going from the PDP to the PCM.
zh_cn: 电线从PDP连接到PCM

source: Requires: Wire stripper, small flat screwdriver (optional), 18 AWG (1 :math:`mm^2`) red and black wire
es_mx: Requiere: Pelacables, un pequeño destornillador plano (opcional), un cable rojo y negro de 18 AWG (1 :math:`mm^2`)
pt: Requer: alicate desemcapador, chave de fenda pequena (opcional), fio vermelho e preto de 18 AWG (1 :math:`mm^2`):
tr_tr: Gerektirir: Kablo sıyırıcı, küçük düz tornavida (isteğe bağlı),18 AWG (1 :math:`mm^2`) kırmızı ve siyah kablo
zh_cn: 要求：剥线钳，小型平头螺丝刀（可选），18 AWG（1 :math:`mm^2`）红色和黑色电线

source: Measure the length required to reach the "Vin" terminals on the PCM. Take care to leave enough length to route the wires around any other components such as the battery and to allow for any strain relief or cable management.
es_mx: Mida la longitud requerida para alcanzar los terminales "Vin" en el PCM. Tenga cuidado de dejar suficiente longitud para enrutar los cables alrededor de cualquier otro componente, como la batería, y para permitir cualquier alivio de tensión o manejo del cable.
pt: Meça o comprimento para alcançar os terminais "Vin" da PCM. Sempre cuide para deixar um comprimento suficiente para contornar alguns componentes no caminho e evitar qualquer desprendimento do cabo.
tr_tr: PCM'deki "Vin" terminallerine ulaşmak için gereken uzunluğu ölçün. Kabloları pil gibi diğer bileşenlerin etrafından dolaştırmak ve herhangi bir gerilim azaltma veya kablo yönetimine izin vermek için yeterli uzunluk bırakmaya özen gösterin.
zh_cn: 测量到达PCM上“ Vin”端子所需的长度。请注意留出足够的长度，以将导线绕在电池等任何其他组件周围，并进行应力消除或电缆整理。

source: Connect the wire to the PCM 12Vin terminals.
es_mx: Conecte el cable a las terminales PCM 12Vin.
pt: Conecte os fios ao terminal 12Vin da PCM.
tr_tr: Kabloyu PCM 12Vin terminallerine bağlayın.
zh_cn: 将电线连接到PCM 12Vin端子。

source: Radio Power and Ethernet
es_mx: Alimentación del Radio y Ethernet
pt: Ligando o Rádio e a ethernet
tr_tr: Radyo-Modem Gücü ve Ethernet
zh_cn: 路由器电源和以太网

source: DO NOT connect the Rev passive POE injector cable directly to the roboRIO. The roboRIO MUST connect to the female end of the cable using an additional Ethernet cable as shown in the next step.
es_mx: NO conecte el cable del inyector POE pasivo Rev directamente a la roboRIO. La roboRIO DEBE conectarse al extremo hembra del cable utilizando un cable Ethernet adicional como se muestra en el siguiente paso.
pt: NÃO conecte o POE diretamente à roboRIO. Você deve utilizar um CABO ETHERNET que faça a ponte entre o POE e a roboRIO.
tr_tr: Rev pasif POE enjektör kablosunu doğrudan roboRIO'ya BAĞLAMAYIN. RoboRIO, bir sonraki adımda gösterildiği gibi ek bir Ethernet kablosu kullanarak kablonun dişi ucuna BAĞLANMALIDIR.
zh_cn: 请勿将Rev passive POE供电器电缆直接连接到roboRIO。 roboRIO务必使用另一条以太网电缆连接到电缆的母端，如下一步所示。

source: Connection power to the robot radio via a PoE cable.
zh_cn: 通过连接PeE线给路由器供电

source: Requires: Small flat screwdriver (optional), Rev radio PoE cable
es_mx: Requiere: Destornillador plano pequeño (opcional), cable Rev radio PoE
pt: Requer: Chave de fenda pequena (opcional), Rádio Rev, Cabo PoE incluso no Kit
tr_tr: Gerektirir: Küçük düz tornavida (isteğe bağlı), Rev radyo PoE kablosu
zh_cn: 需要：小型平头螺丝刀（可选），Rev radio PoE电缆

source: Insert the ferrules of the passive PoE injector cable into the corresponding colored terminals on the 12V/2A section of the VRM.
es_mx: Inserte los ferrules del cable inyector PoE pasivo en las correspondientes terminales de colores en la sección 12V/2A del VRM.
pt: Insira os conectores do cabo PoE nos terminais correspondentes a 12V/2A da VRM.
tr_tr: Pasif PoE enjektör kablosunun yüksüklerini VRM'nin 12V / 2A bölümündeki ilgili renkli terminallere takın.
zh_cn: 将无源PoE供电器电缆的套管插入VRM的12V / 2A部分上相应的彩色端子中。

source: Connect the male RJ45 (Ethernet) end of the cable into the Ethernet port on the radio closest to the barrel connector (labeled 18-24v POE)
es_mx: Conecte el extremo macho RJ45 (Ethernet) del cable al puerto Ethernet en el radio más cercana al conector de barril (etiquetado 18-24v POE)
pt: Conecte o conector macho de Ethernet (RJ45) à porta de ethernet do rádio mais próxima da entrada do pino de energia (com o nome de 18-24v POE)
tr_tr: Kablonun erkek RJ45 (Ethernet) ucunu namlu konektörüne en yakın radyodaki Ethernet bağlantı noktasına bağlayın (18-24v POE etiketli)
zh_cn: 将电缆的RJ45公头（以太网）端连接到最靠近桶形连接器（标记为18-24v POE）的无线电的以太网端口。

source: roboRIO to Radio Ethernet
es_mx: roboRIO a Radio Ethernet
pt: Conectando a Ethernet do rádio a roboRIO
tr_tr: roboRIO'dan Radyo Ethernet'e
zh_cn: roboRIO连接到路由器以太网

source: Connecting Ethernet from the roboRIO to the PoE cable.
zh_cn: 从roboRIO连接以太网到PoE线

source: Requires: Ethernet cable
es_mx: Requiere: Cable Ethernet
pt: Requer: Cabo Ethernet
tr_tr: Gerektirir: Ethernet kablosu
zh_cn: 需要：以太网电缆

source: Connect an Ethernet cable from the female RJ45 (Ethernet) port of the Rev Passive POE cable to the RJ45 (Ethernet) port on the roboRIO.
es_mx: Conecte un cable Ethernet desde el puerto hembra RJ45 (Ethernet) del cable Rev PoE pasivo al puerto RJ45 (Ethernet) en la roboRIO.
pt: Conecte o cabo de Ethernet na porta RJ45 (Ethernet) do cabo POE e na entrada RJ45 (Ethernet) da roboRIO.
tr_tr: Rev Pasif POE kablosunun dişi RJ45 (Ethernet) bağlantı noktasından roboRIO üzerindeki RJ45 (Ethernet) bağlantı noktasına bir Ethernet kablosu bağlayın.
zh_cn: 将以太网电缆从Rev Passive POE电缆的母RJ45（以太网）端口连接到roboRIO上的RJ45（以太网）端口。

source: CAN Devices
es_mx: Dispositivos CAN
pt: Dispositivos CAN
tr_tr: CAN Cihazları
zh_cn: CAN设备

source: roboRIO to PCM CAN
es_mx: roboRIO a PCM CAN
pt: CAN da roboRIO para a CAN da PCM
tr_tr: roboRIO'dan PCM CAN'a
zh_cn: roboRIO连接到PCM CAN

source: Connecting CAN wire from the roboRIO to the PCM.
zh_cn: 把CAN线从roboRIO到PCM

source: Requires: Wire stripper, small flat screwdriver (optional), yellow/green twisted CAN cable
es_mx: Requiere: Pelacables, destornillador plano pequeño (opcional), cable CAN amarillo-verde trenzado
pt: Requer : Alicate desemcapador, chave de fenda pequena (opcional), fio verde/amarelo trançado de 22 AWG
tr_tr: Gerektirir: Kablo sıyırıcı, küçük düz tornavida (isteğe bağlı), sarı/yeşil bükümlü CAN kablosu
zh_cn: 需要：剥线钳，小型平头螺丝刀（可选），黄色/绿色双绞线CAN电缆

source: Strip ~5/16" (~8 mm) off of each of the CAN wires.
es_mx: Quiten ~5/16" (~8 mm) de cada uno de los cables de la CAN.
pt: Desencape ~5/16" (~8mm) de cada fio CAN.
tr_tr: Her CAN kablosundan ~5/16" (~8 mm) sıyırın.
zh_cn: 剥下每根CAN线的〜5/16“（〜8 mm）。

source: Insert the wires into the appropriate CAN terminals on the roboRIO (Yellow->YEL, Green->GRN).
es_mx: Inserte los cables en la apropiada terminal CAN de la roboRIO (Amarillo->AMAR, Verde->VD).
pt: Insira os fios nos terminais destinados à linha CAN na roboRIO (Amarelo -> YEL, Verde -> GRN).
tr_tr: Kabloları roboRIO (Yellow->YEL, Green->GRN) üzerindeki uygun CAN terminallerine takın.
zh_cn: 将电线插入roboRIO上相应的CAN端子（黄色-> YEL，绿色-> GRN）。
