Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-1/how-to-wire-a-robot.po
Languages: es_mx, pt, tr_tr, zh_cn

source: Check that the red wire passes through the main breaker and to the + terminal of the PDP and that the black wire travels directly to the - terminal.
es_mx: Revise que el cable rojo pase a través del interruptor principal y a la terminal + del PDP y el cable negro viaje directamente a la terminal -.
pt: Verifique se o fio vermelho está indo do disjuntor principal para o terminal positivo da PDP e se o fio preto está indo para o terminal negativo.
tr_tr: Kırmızı kablonun ana kesiciden ve PDP'nin + terminalinden geçtiğini ve siyah kablonun doğrudan - terminaline gittiğini kontrol edin.
zh_cn: 检查红色导线穿过主断路器并到达PDP的+端子，黑色导线直接进入-端子。

source: For each motor controller, verify that the red wire goes from the red PDP terminal to the Red wire on the Victor SPX (not the white M+!!!!)
es_mx: Para cada controlador del motor, verifique que el cable rojo vaya desde la terminal PDP al cable rojo en el Victor SPX (no el blanco M+!!!!)
pt: Para cada controlador de motor, verifique se o fio vermelho que sai do terminal vermelho da PDP está conectado com o fio vermelho do Victor SPX (não o M+ branco!!!!)
tr_tr: Her motor denetleyicisi için, kırmızı kablonun kırmızı PDP terminalinden Victor SPX'teki Kırmızı kabloya (beyaz M+ değil !!!!) gittiğini doğrulayın.
zh_cn: 对于每个电机控制器，请验证红色导线从红色PDP端子到Victor SPX上的红色导线（不是白色M + !!!!）。

source: For each device on the end of the PDP, verify that the red wire connects to the red terminal on the PDP and the red terminal on the component.
es_mx: Para cada dispositivo al final de la PDP, verifique que el cable rojo se conecta a la terminal roja en el PDP y la terminal roja en el componente.
pt: Para cada componente que está ligado à PDP, verifique se o fio vermelho que sai do terminal vermelho da PDP se conecta com o terminal positivo do componente.
tr_tr: PDP'nin ucundaki her cihaz için, kırmızı kablonun PDP'deki kırmızı terminale ve bileşen üzerindeki kırmızı terminale bağlandığını doğrulayın.
zh_cn: 对于PDP末端的每个设备，请验证红色导线是否连接到PDP上的红色端子和组件上的红色端子。

source: Make sure that the orange Passive PoE cable is plugged directly into the radio NOT THE roboRIO! It must be connected to the roboRIO using an additional Ethernet cable.
es_mx: Asegúrese que el cable PoE pasivo naranja esta conectado directamente en la radio NO A LA roboRIO! Debe estar conectado a la roboRIO usando un cable Ethernet adicional.
pt: Tenha certeza de que o conector PoE está conectado diretamente ao rádio, NÃO A roboRIO! Para conectar na roboRIO, deve ser utilizado um cabo Ethernet adicional.
tr_tr: Turuncu Pasif PoE kablosunun doğrudan radyoya takıldığından emin olun, roboRIO DEĞİL! Ek bir Ethernet kablosu kullanılarak roboRIO'ya bağlanmalıdır.
zh_cn: 确保橙色无源PoE电缆直接插入无线电而不是roboRIO！必须使用附加的以太网电缆将其连接到roboRIO。

source: It is also recommended to put the robot on blocks so the wheels are off the ground before proceeding. This will prevent any unexpected movement from becoming dangerous.
es_mx: También es recomendado poner el robot sobre bloques para que las ruedas estén lejos del suelo antes de proceder. Esto prevendrá que un movimiento inesperado se convierta en peligroso.
pt: É recomendado colocar o robô sobre blocos de forma que as rodas giram livremente sem tocar o chão. Isso ajudará a previnir qualquer acidente se o robô se mover inesperadamente
tr_tr: Devam etmeden önce tekerleklerin yerden kalkması için robotu blokların üzerine koymanız da önerilir. Bu, herhangi bir beklenmedik hareketin tehlikeli hale gelmesini önleyecektir.
zh_cn: 还建议将机器人放在块上，以便在继续操作之前将轮子从地面上移开。这样可以防止任何意外的动作变得危险。

source: Manage Wires
es_mx: Organizar cables
pt: Organize os fios
tr_tr: Kabloları Yönetin
zh_cn: 管理电线

source: Using zipties to make the wiring look more organized.
zh_cn: 使用扎带让电线看起来更整齐

source: Requires: Zip ties
es_mx: Requiere: Cinchos
pt: Requer: Abraçadeiras Plásticas
tr_tr: Gerektirir: Zip bağları-plastik kelepçe
zh_cn: 需要：扎带

source: Now may be a good time to add a few zip ties to manage some of the wires before proceeding. This will help keep the robot wiring neat.
es_mx: Este puede ser un buen momento para añadir unos cinchos para organizar algunos cables antes de proceder. Esto ayudará a mantener el cableado del robot ordenado.
pt: Essa é a hora de adicionar alguns zip ties aos fios. Isso fará com que os fios do robô se mantenham firmes e organizados.
tr_tr: Devam etmeden önce bazı kabloları yönetmek için birkaç plastik kelepçe eklemenin şimdi tam zamanı olabilir. Bu, robot kablolarının düzenli kalmasına yardımcı olacaktır.
zh_cn: 现在可能是个不错的时机，在继续操作之前添加一些扎带来管理一些电线。这将有助于保持机器人接线整齐。

source: Connect Battery
es_mx: Conectar batería
pt: Conecte a Bateria
tr_tr: Akümülatörü Bağlayın
zh_cn: 连接电池

source: Connect the battery to the robot side of the Anderson connector. Power on the robot by moving the lever on the top of the 120A main breaker into the ridge on the top of the housing.
es_mx: Conecta la batería al lado del robot del conector Anderson. Encienda el robot moviendo la palanca en la parte superior del interruptor principal de 120A en la cresta de la parte superior de la carcasa.
pt: Conecte a bateria ao robô com o conector Anderson. Para ligar o robô, empurre a "alavanca" do disjuntor principal de 120A até ela dar um estalo e ficar presa.
tr_tr: Pili Anderson konektörünün robot tarafına bağlayın. 120A ana kırıcının üstündeki kolu muhafazanın üst kısmındaki çıkıntıya doğru hareket ettirerek robotu çalıştırın.
zh_cn: 将电池连接到Anderson连接器的机器人侧。通过将120A主断路器顶部的手柄移入外壳顶部的凸脊中，为机器人通电。

source: If stuff blinks, you probably did it right.
es_mx: Si algo parpadea, probablemente lo hizo bien.
tr_tr: Bir şeyler yanıp sönerse, muhtemelen doğru yapmışsınızdır.
zh_cn: 如果东西闪烁，则您可能做对了。

source: Before moving on, if using SPARK MAX controllers, there is one more configuration step to complete. The SPARK MAX motor controllers are configured to control a brushless motor by default. You can verify this by checking that the light on the controller is blinking either cyan or magenta (indicating brushless brake or brushless coast respectively). To change to to brushed mode, press and hold the mode button for 3-4 seconds until the status LED changes color. The LED should change to either blue or yellow, indicating that the controller is in brushed mode (brake or coast respectively). To change the brake or coast mode, which control how quickly the motor slows down when a neutral signal is applied, press the mode button briefly.
es_mx: Antes de continuar, si usa controladores SPARK MAX, hay un paso de configuración más para completar. Los controladores de motor SPARK MAX están configurados para controlar un motor sin escobillas de forma predeterminada. Puede verificar esto verificando que la luz del controlador parpadee en cian o magenta (indicando freno sin escobillas o costa sin escobillas, respectivamente). Para cambiar al modo cepillado, mantenga presionado el botón de modo durante 3-4 segundos hasta que el LED de estado cambie de color. El LED debe cambiar a azul o amarillo, lo que indica que el controlador está en modo cepillado (freno o inercia respectivamente). Para cambiar el modo de freno o inercia, que controla la rapidez con la que el motor se ralentiza cuando se aplica una señal neutral, presione brevemente el botón de modo.
tr_tr: Devam etmeden önce, SPARK MAX denetleyicileri kullanıyorsanız, tamamlanması gereken bir yapılandırma adımı daha vardır. SPARK MAX motor kontrolörleri, varsayılan olarak fırçasız bir motoru kontrol edecek şekilde yapılandırılmıştır. Bunu, denetleyicideki ışığın camgöbeği veya macenta (sırasıyla fırçasız fren veya fırçasız yanaşma olduğunu gösterir) yanıp söndüğünü kontrol ederek doğrulayabilirsiniz. Fırçalanmış moda geçmek için, durum LED'inin rengi değişene kadar mod düğmesini 3-4 saniye basılı tutun. LED, kontrolörün fırçalanmış modda olduğunu (sırasıyla fren veya boşta) gösterecek şekilde mavi veya sarıya dönmelidir. Nötr sinyal uygulandığında motorun ne kadar hızlı yavaşladığını kontrol eden fren veya boşta çalışma modunu değiştirmek için mod düğmesine kısa süre basın.
zh_cn: 在继续之前，如果使用SPARK MAX控制器，还需要完成一个配置步骤。 SPARK MAX电机控制器默认配置为控制无刷电机。您可以通过检查控制器上的指示灯是否闪烁青色或品红色（分别指示无刷制动或无刷滑行）来验证这一点。要更改为刷洗模式，请按住模式按钮3-4秒钟，直到状态LED变色。 LED指示灯应变为蓝色或黄色，表示控制器处于有刷模式（分别为制动或惯性停车）。要更改制动或惯性停车模式，以控制施加空档信号时电机减速的速度，请短暂按一下模式按钮。

source: For more information on the SPARK MAX motor controllers, including how to test your motors/controllers without writing any code by using the REV Hardware Client, see the `SPARK MAX Quickstart guide <https://docs.revrobotics.com/sparkmax/gs-sm>`__.
es_mx: Para obtener más información sobre los controladores de motor SPARK MAX, incluida la forma de probar sus motores / controladores sin escribir ningún código utilizando REV Hardware Client, consulte la `Guía de inicio rápido de SPARK MAX <https://docs.revrobotics.com/sparkmax/gs-sm>` __.
tr_tr: REV Donanım İstemcisini kullanarak herhangi bir kod yazmadan motorlarınızı / kontrol cihazlarınızı nasıl test edeceğiniz dahil olmak üzere SPARK MAX motor denetleyicileri hakkında daha fazla bilgi için, bkz. SPARK MAX Hızlı Başlangıç kılavuzu <https://docs.revrobotics.com/sparkmax/gs-sm> `__.
zh_cn: 有关SPARK MAX电动机控制器的更多信息，包括如何使用REV硬件客户端在不编写任何代码的情况下测试电动机/控制器，请参阅`SPARK MAX Quickstart guide <https://docs.revrobotics.com/sparkmax/gs-sm>`__.

source: From here, you should connect to the roboRIO and try uploading your code!
es_mx: ¡Desde aquí, debe conectarse al roboRIO e intentar cargar su código!
tr_tr: Buradan roboRIO'ya bağlanmalı ve kodunuzu yüklemeyi denemelisiniz!
zh_cn: 从这里，您应该连接到roboRIO并尝试上传您的代码！
