Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-1/how-to-wire-a-robot.po
Languages: es_mx, pt, tr_tr, zh_cn

source: Measure the length required to reach the CAN terminals of the PCM (either of the two available pairs). Cut and strip ~5/16" (~8 mm) off this end of the wires.
es_mx: Mida la longitud necesaria para alcanzar los terminales CAN del PCM (cualquiera de los dos pares disponibles). Cortar y pelar ~5/16" (~8 mm) de este extremo de los cables.
pt: Meça o comprimento nescessário dos cabos para chegar com um pouco de folga na PCM. Corte e desencape ~5/16" (~8mm) do fim de cada fio CAN.
tr_tr: PCM'nin CAN terminallerine (mevcut iki çiftten biri) ulaşmak için gereken uzunluğu ölçün. Kabloların bu ucundan~5/16" (~8 mm) kesin ve soyun.
zh_cn: 测量到达PCM（两个可用对中的一个）的CAN端子所需的长度。切割并剥去电线此端的〜5/16“（〜8 mm）。

source: Insert the wires into the appropriate color coded CAN terminals on the PCM. You may use either of the Yellow/Green terminal pairs on the PCM, there is no defined in or out.
es_mx: Inserte los cables en las terminales codificadas por color CAN apropiadas en el PCM. Debe usar cualquiera de los pares de terminales Amarillo/Verde en el PCM, no hay definido dentro o fuera.
pt: Insira os fios CAN de acordo com a cor em qualquer um dos terminais destinado à eles. Pode-se utilizar qualquer um dos pares de terminais CAN , não há entrada e saída definidos.
tr_tr: Kabloları PCM'deki uygun renk kodlu CAN terminallerine takın. PCM'deki Sarı/Yeşil terminal çiftlerinden birini kullanabilirsiniz, tanımlanmış giriş veya çıkış yoktur.
zh_cn: 将电线插入PCM上相应的颜色编码的CAN端子中。您可以使用PCM上的黄色/绿色端子对中的任何一个，没有定义输入或输出。

source: PCM to PDP CAN
es_mx: PCM a PDP CAN
pt: PCM para CAN da PDP
tr_tr: PCM'den PDP'ye CAN
zh_cn: PCM连接到PDP CAN

source: Connecting the PCM CAN to the PDP.
zh_cn: 连接PCM CAN到PDP

source: Insert the wires into the appropriate CAN terminals on the PCM.
es_mx: Inserte los cables en la terminal CAN apropiada en el PCM.
pt: Insira os fios nos terminais CAN apropiados da PCM.
tr_tr: Kabloları PCM üzerindeki uygun CAN terminallerine takın.
zh_cn: 将电线插入PCM上相应的CAN端子中。

source: Measure the length required to reach the CAN terminals of the PDP (either of the two available pairs). Cut and strip ~5/16" (~8 mm) off this end of the wires.
es_mx: Mida la longitud necesaria para alcanzar los terminales CAN del PDP (cualquiera de los dos pares disponibles). Cortar y pelar ~5/16" (~8 mm) de este extremo de los cables.
pt: Meça o comprimento nescessário do cabo CAN para chegar com um pouco de folga na PCM. Corte e desencape ~5/16" (~8mm) do fim de cada fio CAN.
tr_tr: PDP'nin CAN terminallerine (mevcut iki çiftten biri) ulaşmak için gereken uzunluğu ölçün. Kabloların bu ucundan~5/16" (~8 mm) kesin ve soyun.
zh_cn: 测量到达PDP（两个可用对中的一个）的CAN端子所需的长度。切割并剥去电线此端的〜5/16“（〜8 mm）。

source: Insert the wires into the appropriate color coded CAN terminals on the PDP. You may use either of the Yellow/Green terminal pairs on the PDP, there is no defined in or out.
es_mx: Inserte los cables en las apropiadas terminales CAN codificadas por color en el PDP. Debe usar cualquiera de los pares de terminales Amarillo/Verde en el PDP, no hay definido dentro o fuera.
pt: Insira os fios CAN de acordo com a cor em qualquer um dos terminais da PDP destinado à eles. Pode-se utilizar qualquer um dos pares de terminais CAN , não há entrada e saída definidos.
tr_tr: Kabloları PDP üzerindeki uygun renk kodlu CAN terminallerine takın. PDP'deki Sarı/Yeşil terminal çiftlerinden birini kullanabilirsiniz, tanımlanmış giriş veya çıkış yoktur.
zh_cn: 将电线插入PDP上相应的颜色编码的CAN端子中。您可以在PDP上使用黄色/绿色端子对中的任何一个，没有定义输入或输出。

source: PWM Cables
es_mx: Cables PWM
pt: Cabos PWM
tr_tr: PWM Kabloları
zh_cn: PWM电缆

source: PWM Cables going from the roboRIO to the Spark Motor Controller.
zh_cn: 把PWM线从roboRIO连接到Spark控制器

source: This section details how to wire the SPARK MAX controllers using PWM signaling. This is a recommended starting point as it is less complex and easier to troubleshoot than CAN operation. The SPARK MAXs (and many other FRC motor controllers) can also be wired using :ref:`CAN<docs/hardware/hardware-basics/can-wiring-basics:CAN Wiring Basics>` which unlocks easier configuration, advanced functionality, better diagnostic data and reduces the amount of wire needed.
es_mx: Esta sección detalla cómo cablear los controladores SPARK MAX usando señalización PWM. Este es un punto de partida recomendado, ya que es menos complejo y más fácil de solucionar que la operación CAN. Los SPARK MAX (y muchos otros controladores de motor FRC) también se pueden cablear usando :ref:`CAN<docs/hardware/hardware-basics/can-wiring-basics:CAN Wiring Basics>` que desbloquea una configuración más fácil, funcionalidad avanzada, mejores datos de diagnóstico y reduce la cantidad de cable necesario.
zh_cn: 本节详细介绍如何使用PWM信号连接SPARK MAX控制器。这是一个推荐的方式，因为它比CAN操作更简单且更易于排除故障。 SPARK MAX（和许多其他FRC电机控制器）也可以使用:ref:`CAN线<docs/hardware/hardware-basics/can-wiring-basics:CAN Wiring Basics>`进行接线，从而更轻松的配置，更高级的功能，更好的诊断数据并减少所需的电线数量。

source: Requires: 4x SPARK MAX PWM adapters (if using SPARK MAX), 4x PWM cables (if controllers without integrated wires or adapters, otherwise optional), 2x PWM Y-cable (Optional)
es_mx: Requiere: 4 adaptadores SPARK MAX PWM (si usa SPARK MAX), 4 cables PWM (si los controladores no tienen cables integrados o adaptadores, de lo contrario son opcionales), 2 cables PWM en Y (opcional)
tr_tr: Gereksinimler: (SPARK MAX kullanılıyorsa) 4x SPARK MAX PWM adaptörleri, 4x PWM kabloları (entegre kablolar veya adaptörler olmayan kontrolörler, aksi takdirde isteğe bağlı), 2x PWM Y kablosu (İsteğe bağlı)
zh_cn: 要求：4个SPARK MAX PWM适配器（如果使用SPARK MAX），4个PWM电缆（如果控制器不带集成线或适配器，否则为可选件），2个PWM Y电缆（可选）

source: Option 1 (Direct connect):
es_mx: Opción 1 (Conexión directa):
pt: Opção 1 (conectar diretamente):
tr_tr: Seçenek 1 (Doğrudan bağlantı):
zh_cn: 选项1（直接连接）：

source: If using SPARK MAX, attach the PWM adapter to the SPARK MAX (small adapter with a 3 pin connector with black/white wires).
es_mx: Si usa SPARK MAX, conecte el adaptador PWM al SPARK MAX (adaptador pequeño con un conector de 3 clavijas con cables negro / blanco).
tr_tr: SPARK MAX kullanıyorsanız, PWM adaptörünü SPARK MAX'a takın (siyah / beyaz telli, 3 pinli konnektörlü küçük adaptör).
zh_cn: 如果使用SPARK MAX，则将PWM适配器连接至SPARK MAX（带有3针黑色/白色电线的小型适配器）。

source: If needed, attach PWM extension cables to the controller or adapter. On the controller side, match the colors or markings (some controllers may have green/yellow wiring, green should connect to black).
es_mx: Si es necesario, conecte cables de extensión PWM al controlador o adaptador. En el lado del controlador, haga coincidir los colores o las marcas (algunos controladores pueden tener cableado verde / amarillo, el verde debe conectarse al negro).
tr_tr: Gerekirse, PWM uzatma kablolarını denetleyiciye veya adaptöre bağlayın. Denetleyici tarafında renkleri veya işaretleri eşleştirin (bazı denetleyicilerin kabloları yeşil / sarı olabilir, yeşilin siyaha bağlanması gerekir).
zh_cn: 如果需要，将PWM扩展电缆连接到控制器或适配器。在控制器侧，匹配颜色或标记（某些控制器可能具有绿色/黄色接线，绿色应连接至黑色）。

source: Attach the other end of the cable to the roboRIO with the black wire towards the outside of the roboRIO. It is recommended to connect the left side to PWM 0 and 1 and the right side to PWM 2 and 3 for the most straightforward programming experience, but any channel will work as long as you note which side goes to which channel and adjust the code accordingly.
es_mx: Conecte el otro extremo del cable a la roboRIO con el cable negro hacia el exterior de la roboRIO. Se recomienda conectar el lado izquierdo a PWM 0 y 1 y el lado derecho a PWM 2 y 3 para una experiencia de programación más sencilla, pero cualquier canal funcionará siempre y cuando observe qué lado va a qué canal y ajuste el código en consecuencia.
tr_tr: Kablonun diğer ucunu siyah tel roboRIO'nun dışına bakacak şekilde roboRIO'ya bağlayın. En basit programlama deneyimi için sol tarafı PWM 0 ve 1'e ve sağ tarafı PWM 2 ve 3'e bağlamanız önerilir, ancak herhangi bir kanal hangi tarafın hangi kanala gittiğini not ettiğiniz ve kodu buna göre ayarladığınız sürece çalışacaktır. .
zh_cn: 将电缆的另一端连接到roboRIO上，黑色电线朝向roboRIO的外部。为了获得最直接的编程体验，建议将左侧连接到PWM 0和1，将右侧连接到PWM 2和3，但是任何通道都可以使用，只要您注意哪一侧转到哪个通道并相应地调整代码即可。 。

source: Option 2 (Y-cable):
es_mx: Opción 2 (Cable Y):
pt: Opção 2 (cabo Y):
tr_tr: Seçenek 2 (Y kablosu):
zh_cn: 选项2（Y型电缆）：

source: If needed, attach PWM extension cables between the controller or adapter and the PWM Y-cable. On the controller side, match the colors or markings (some controllers may have green/yellow wiring, green should connect to black).
es_mx: Si es necesario, conecte cables de extensión PWM entre el controlador o adaptador y el cable Y PWM. En el lado del controlador, haga coincidir los colores o las marcas (algunos controladores pueden tener cableado verde / amarillo, el verde debe conectarse al negro).
tr_tr: Gerekirse, denetleyici veya adaptör ile PWM Y kablosu arasına PWM uzatma kabloları takın. Denetleyici tarafında renkleri veya işaretleri eşleştirin (bazı denetleyicilerin kabloları yeşil / sarı olabilir, yeşilin siyaha bağlanması gerekir).
zh_cn: 如果有需要，在控制器或适配器与PWM Y电缆之间连接PWM延长电缆。在控制器侧，匹配颜色或标记（某些控制器可能具有绿色/黄色接线，绿色应连接至黑色）。

source: Connect 1 PWM Y-cable to the 2 PWM cables for the controllers controlling each side of the robot. The brown wire on the Y-cable should match the black wire on the PWM cable.
es_mx: Conecte 1 cable PWM Y a los 2 cables PWM para los controladores que controlan cada lado del robot. El cable marrón del cable Y debe coincidir con el cable negro del cable PWM.
tr_tr: Robotun her iki tarafını kontrol eden kontrolörler için 1 PWM Y kablosunu 2 PWM kablosuna bağlayın. Y kablosundaki kahverengi tel, PWM kablosundaki siyah telle eşleşmelidir.
zh_cn: 将1个PWM Y电缆连接到2条PWM电缆上，以用于控制机器人各侧的控制器。 Y型电缆上的棕色线应与PWM电缆上的黑色线匹配。

source: Connect the PWM Y-cables to the PWM ports on the roboRIO. The brown wire should be towards the outside of the roboRIO. It is recommended to connect the left side to PWM 0 and the right side to PWM 1 for the most straightforward programming experience, but any channel will work as long as you note which side goes to which channel and adjust the code accordingly.
es_mx: Conecte los cables Y PWM a los puertos PWM en la roboRIO. EL cable marrón debe estar hacia el exterior de la roboRIO. Es recomendado conectar el lado izquierdo al PWM 0 y el lado derecho al PWM 1 para la experiencia de programación más sencilla, pero cualquier canal funcionará mientras note cual lado va a cuál canal y ajuste el código acorde a esto.
pt: Conecte os cabos PMW Y às portas PWM da roboRIO. O fio marrom deve ser conectado ao lado mais próximo à borda da roboRIO. É recomendado conectar o lado esquerdo ao PWM 0 e o lado direito ao PWM 1 para facilitar a programação, mas qualquer terminal vai funcionar desde que você anote qual lado está conectado a quais canais
tr_tr: PWM Y kablolarını roboRIO üzerindeki PWM bağlantı noktalarına bağlayın. Kahverengi tel roboRIO'nun dışına doğru olmalıdır. En basit programlama deneyimi için sol tarafı PWM 0'a ve sağ tarafı PWM 1'e bağlamanız önerilir, ancak hangi tarafın hangi kanala gittiğini not ettiğiniz ve kodu buna göre ayarladığınız sürece herhangi bir kanal çalışacaktır.
zh_cn: 将PWM Y电缆连接到roboRIO上的PWM端口。棕色电线应朝向roboRIO的外部。为了获得最直接的编程经验，建议将左侧连接到PWM 0，将右侧连接到PWM 1，但是任何通道都可以使用，只要您注意哪一侧对应哪个通道并相应地调整代码即可。

source: Robot Signal Light
es_mx: Luz de Señal del Robot
pt: Robot Signal Light (RSL)
tr_tr: Robot Sinyal Işığı
zh_cn: 机器人信号灯

source: Robot Signal Light (rsl) wiring from roboRIO to RSL
zh_cn: 连接机器人信号灯（rsl）的线从roboRIO到信号灯

source: Requires: Wire stripper, 2 pin cable, Robot Signal Light, 18 AWG (1 :math:`mm^2`) red wire, very small flat screwdriver
es_mx: Requiere: Pelacables, cable de 2 pines, luz de señal del robot, cable rojo de 18 AWG (1:math:`mm^2`), un destornillador plano muy pequeño.
pt: Requer: Alicate desemcapador, cabo de 2 vias, Robot Signal Light, fio vermelho de 18 AWG (1 :math:`mm^2`) e chave de fenda bem pequena.
tr_tr: Gerektirir: Kablo sıyırıcı, 2 pimli kablo, Robot Sinyal Işığı, 18 AWG (1 :math:`mm^2`) kırmızı kablo, çok küçük düz tornavida
zh_cn: 需要：剥线钳，2针电缆，机器人信号灯，18 AWG（1 :math:`mm^2`）红色电线，非常小的平头螺丝刀

source: Cut one end off of the 2 pin cable and strip both wires
es_mx: Corte un extremo del cable de 2 pines y pele ambos cables
pt: Corte um lado do cabo de 2 vias e desencape os dois fios
tr_tr: 2 pinli kablonun bir ucunu kesin ve her iki kabloyu da soyun
zh_cn: 切断2针电缆的一端并剥去两根电线

source: Insert the black wire into the center, "N" terminal and tighten the terminal.
es_mx: Inserte el cable negro en el centro, terminal "N" y apriete la terminal.
pt: Insira o cabo preto no terminal central "N" e aperte o parafuso do terminal
tr_tr: Siyah teli ortaya, "N" terminaline sokun ve terminali sıkın.
zh_cn: 将黑色电线插入中间的“ N”端子，并拧紧端子。

source: Strip the 18 AWG (1 :math:`mm^2`) red wire and insert into the "La" terminal and tighten the terminal.
es_mx: Pele el cable rojo de 18 AWG (1 :math:`mm^2`) e introdúzcalo en el terminal "La" y apriete el terminal.
pt: Corte um pequeno cabo vermelho de 18 AWG (1 :math:`mm^2`), insira uma das pontas no terminal "La" e aperte o parafuso do terminal
tr_tr: 18 AWG (1 :math:`mm^2`) kırmızı kabloyu soyun ve "La" terminaline yerleştirin ve terminali sıkın.
zh_cn: 剥去18 AWG（1 :math:`mm^2`）红色电线，并将其插入“ La”端子，并拧紧端子。

source: Cut and strip the other end of the 18 AWG (1 :math:`mm^2`) wire to insert into the "Lb" terminal
es_mx: Cortar y despojar el otro extremo del 18 AWG (1 :math:`mm^2`) cable para insertar en el terminal "Lb"
pt: Corte o a outra ponta do cabo 18 AWG (1 :math:`mm^2`) e para inserir no terminal "Lb"
tr_tr: "Lb" terminaline eklemek için 18 AWG (1 :math:`mm^2`)kablosunun diğer ucunu kesin ve sıyırın
zh_cn: 切割并剥去18 AWG（1：math：`mm ^ 2`）电线的另一端，将其插入“ Lb”端子

source: Insert the red wire from the two pin cable into the "Lb" terminal with the 18 AWG (1 :math:`mm^2`) red wire and tighten the terminal.
es_mx: Inserte el cable rojo del cable de dos clavijas en el terminal "Lb" con el cable rojo de 18 AWG (1 :math:`mm^2`) y apriete la terminal.
pt: Insira o lado vermelho do cabo de duas vias no terminal "Lb" com o fio vermelho de 18AWG (1 :math:`mm^2`) e aperte o parafuso do terminal
tr_tr: Kırmızı kabloyu iki pimli kablodan 18 AWG (1 :math:`mm^2`) kırmızı tel ile" Lb" terminaline yerleştirin ve terminali sıkın.
zh_cn: 用18 AWG（1 :math:`mm^2`）红色电线将两芯电缆中的红色电线插入“ Lb”端子，并拧紧端子。

source: Connect the two-pin connector to the RSL port on the roboRIO. The black wire should be closest to the outside of the roboRIO.
es_mx: Conecte el conector de 2 pines al puerto RSL en la roboRIO. El cable negro debe estar más cerca del exterior de la roboRIO.
pt: Conecte os cabos com conector tubular na porta RSL da roboRIO. O fio preto deve ser conectado à porta mais próxima da borda da roboRIO.
tr_tr: İki pimli konektörü roboRIO üzerindeki RSL bağlantı noktasına bağlayın. Siyah kablo, roboRIO'nun dışına en yakın olmalıdır.
zh_cn: 将两针连接器连接到roboRIO的RSL端口。黑线应最接近roboRIO的外部。

source: You may wish to temporarily secure the RSL to the control board using cable ties or Dual Lock (it is recommended to move the RSL to a more visible location as the robot is being constructed)
es_mx: Es posible que desee asegurar temporalmente el RSL al tablero de control usando cinchos o Dual Lock (es recomendado mover el RSL a un lugar más visible mientras el robot está siendo construido)
pt: Você pode querer prender temporariamente a RSL à chapa de eletrônica utilizando zip ties ou Dual Shock (é recomendado mover a RSL para um local mais visível conform o robô é construido)
tr_tr: RSL'yi kablo bağları veya Çift Kilit kullanarak geçici olarak kontrol panosuna sabitlemek isteyebilirsiniz (robot oluşturulurken RSL'yi daha görünür bir konuma taşımanız önerilir)
zh_cn: 您可能希望使用电缆扎带或双重锁定将RSL临时固定在控制板上（建议在构建机器人时将RSL移到更明显的位置）。

source: Circuit Breakers
es_mx: Disyuntores
pt: Circuit Breakers (Fusíveis)
tr_tr: Devre kesiciler-Sigortalar
zh_cn: 断路器

source: Installing 40A breakers in the PDP.
zh_cn: 在PDP上安装40A的断路器

source: Requires: 4x 40A circuit breakers
es_mx: Requiere: 4 disyuntores 40A
pt: Requer: 4x fusíveis de 40A
tr_tr: Gerektirir: 4x 40A devre kesiciler
zh_cn: 需要：4个40A断路器

source: Insert 40-amp Circuit Breakers into the positions on the PDP corresponding with the Wago connectors the Talons are connected to. Note that, for all breakers, the breaker corresponds with the nearest positive (red) terminal (see graphic above). All negative terminals on the board are directly connected internally.
es_mx: Inserte los disyuntores 40 Amp en las posiciones en el PDP correspondientes a los conectores Wago a los que están conectados los Talons. Note que, para todos los disyuntores, el disyuntor corresponde con la terminal (vea el gráfico anterior) más cercana positiva (roja). Todas las terminales negativas en el tablero están directamente conectadas internamente.
pt: Adicione os fusíveis de 40 amperes na posição correspondente dos terminais Wago em que os cabos dos controladores se conectam a PDP. Observe que as frestas para encaixar o fusível sempre estão ao lado da entrada positiva (vermelha) correspondente (veja a imagem acima). Todos os terminais negativos estão conectados internamente.
tr_tr: Pençelerin bağlı olduğu Wago konektörlerine karşılık gelen PDP üzerindeki konumlara 40 amperlik Devre Kesiciler takın. Tüm kesiciler için kesicinin en yakın pozitif (kırmızı) terminale karşılık geldiğini unutmayın (yukarıdaki grafiğe bakın). Kart üzerindeki tüm negatif terminaller doğrudan dahili olarak bağlanır.
zh_cn: 将40安培断路器插入PDP上与Talon所连接的Wago连接器相对应的位置。请注意，对于所有断路器，断路器均与最近的正极（红色）端子相对应（请参见上图）。板上的所有负极端子都直接在内部连接。

source: If working on a Robot Quick Build, stop here and insert the board into the robot chassis before continuing.
es_mx: Si trabaja en un Robot Quick Build, deténgase aquí e inserte el tablero en el chasis del robot antes de continuar.
pt: Se você está trabalhando em um Robot Quick Build, pare e insira a chapa de testes no seu chassi antes de continuar.
tr_tr: Bir Robot Hızlı Oluşturma üzerinde çalışıyorsanız, burada durun ve devam etmeden önce kartı robot kasasına yerleştirin.
zh_cn: 如果要使用Robot Quick Build，请在此处停止并将板子插入机器人机箱，然后再继续。

source: Motor Power
es_mx: Alimentación de Motor
pt: Energizando motor
tr_tr: Motor gücü
zh_cn: 电机电源

source: Connecting power from the motor to the motor controller.
zh_cn: 连接从电机到电机控制器的电线

source: Requires: Wire stripper, wire crimper, phillips head screwdriver, wire connecting hardware
es_mx: Requiere: Pelacables, ponchadora de cable, destornillador Phillips, hardware de conexión de cables
pt: Requer: Alicate desemcapador, Alicate crimpador, chave phillips, terminais de conexão entre cabos
tr_tr: Gerektirir: Kablo sıyırıcı, kablo kıvırıcı, yıldız başlı tornavida, kablo bağlantı donanımı
zh_cn: 需要：剥线钳，压线钳，十字螺丝刀，电线连接硬件

source: For each CIM motor:
es_mx: Para cada motor CIM:
pt: Para cada motor CIM:
tr_tr: Her CIM motoru için:
zh_cn: 对于每个CIM电机：

source: Strip the ends of the red and black wires from the CIM
es_mx: Pele los extremos de los cables rojo y negro del CIM
pt: Desencape a ponta dos cabos vermelhos e pretos do CIM
tr_tr: Kırmızı ve siyah tellerin uçlarını CIM'den soyun
zh_cn: 从CIM剥去红线和黑线的末端

source: For integrated wire controllers including SPARK MAX (top image):
es_mx: Para controladores de motor con cables integrados incluyendo SPARK MAX (imagen superior):
tr_tr: SPARK MAX dahil olmak üzere entegre tel denetleyicileri için (üstteki resim):
zh_cn: 对于包括SPARK MAX的集成线控制器（上图）：

source: Strip the red and black wires (or white and green wires) from the controller (the SPARK MAX white wire is unused for brushed motors such as the CIM, it should be secured and the end should be insulated such with electrical tape or other insulation method).
es_mx: Pele los cables rojo y negro (o cables blanco y verde) del controlador (el cable blanco SPARK MAX no se usa para motores con escobillas como el CIM, debe asegurarse y el extremo debe aislarse con cinta aislante u otro método de aislamiento ).
tr_tr: Kırmızı ve siyah telleri (veya beyaz ve yeşil telleri) kontrolörden sıyırın (SPARK MAX beyaz tel, CIM gibi fırçalanmış motorlar için kullanılmaz, sabitlenmeli ve uç, elektrik bandı veya başka bir yalıtım yöntemi ile yalıtılmalıdır. ).
zh_cn: 剥去控制器上的红色和黑色电线（或白色和绿色电线）（SPARK MAX白色电线未用于有刷电机，如CIM，应将其固定好，并用电工胶带或其他绝缘方法将其端部绝缘 ）。

source: Connect the motor wires to the matching controller output wires (for controllers with white/green, connect red to white and green to black). The images above show an example using quick disconnect terminals which are provided in the Rookie KOP.
es_mx: Conecte los cables del motor a los cables de salida del controlador correspondientes (para controladores con blanco / verde, conecte el rojo con el blanco y el verde con el negro). Las imágenes de arriba muestran un ejemplo usando terminales de desconexión rápida que se proporcionan en el Rookie KOP.
tr_tr: Motor kablolarını eşleşen kontrolör çıkış kablolarına bağlayın (beyaz / yeşil olan kontrolörler için kırmızıyı beyaza ve yeşili siyaha bağlayın). Yukarıdaki resimler, Rookie KOP'da sağlanan hızlı bağlantı kesme terminallerinin kullanıldığı bir örneği göstermektedir.
zh_cn: 将电动机线连接到匹配的控制器输出线（对于具有白色/绿色的控制器，将红色连接到白色，将绿色连接到黑色）。上图显示了使用Rookie KOP中提供的快速断开端子的示例。

source: For the SPARK or other non-integrated-wire controllers (bottom image):
es_mx: Para el SPARK u otros controladores de cable no integrados (imagen inferior):
tr_tr: SPARK veya diğer entegre olmayan kablolu denetleyiciler için (alttaki resim):
zh_cn: 对于SPARK或其他非集成线控制器（下图）：

source: Crimp a ring/fork terminal on each of the motor wires.
es_mx: Crimpe una terminal de anillo/horquilla en cada uno de los cables del motor.
pt: Crimpe um terminal olho ou garfo em cada um dos fios do motor
tr_tr: Motor kablolarının her bir ucunu halka / çatal çeklinde kıvırın.
zh_cn: 压接每条电机导线上的环形/叉形端子。

source: Attach the wires to the output side of the motor controller (red to +, black to -)
es_mx: Conecte los cables al lado de salida del controlador del motor (rojo a +, negro a -)
pt: Conecte os fios na saída de cada controlador (vermelho no +, preto no -)
tr_tr: Kabloları motor kontrol cihazının çıkış tarafına bağlayın (kırmızı + ya, siyah -- ye)
zh_cn: 将电线连接到电机控制器的输出侧（红色到+，黑色到-）

source: STOP
es_mx: ALTO
pt: PARE
tr_tr: DUR
zh_cn: 停止

source: Giant red stop sign.
zh_cn: 巨大的红色停止标志

source: Before plugging in the battery, make sure all connections have been made with the proper polarity. Ideally have someone that did not wire the robot check to make sure all connections are correct.
es_mx: Antes de conectar la batería, asegúrese que todas las conexiones han sido realizadas con la polaridad apropiada. Idealmente tenga a alguien que no conectó el robot para asegurarse que todas las conexiones estén correctas.
pt: Antes de conectar a bateria, tenha certeza que todas as conexões estão com as polaridades corretas (positivo no positivo, negativo no negativo). Se possível peça a alguém que não ajudou na montagem eletrônica para checar se tudo está correto
tr_tr: Pili takmadan önce, tüm bağlantıların doğru kutuba-polariteyle yapıldığından emin olun. İdeal olarak, tüm bağlantıların doğru olduğundan emin olmak için robotu kontrol etmeyen birine sahip olun.
zh_cn: 插入电池之前，请确保所有连接的极性均正确。理想情况下，请没有对机器人进行连线检查的人确保所有连接正确。

source: Start with the battery and verify that the red wire is connected to the positive terminal
es_mx: Empiece por la batería y verifique que el cable rojo esté conectado a la terminal positiva
pt: Inicie com a bateria e verifique se o fio vermelho está conectado ao terminal positivo da bateria
tr_tr: Pil ile başlayın ve kırmızı kablonun pozitif terminale bağlı olduğunu doğrulayın
zh_cn: 从电池开始，确认红色导线连接到正极
