Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-1/intro-to-frc-robot-wiring.po
Languages: es_mx, fr_ca, ja

source: Insert the black wire into the center, "N" terminal and tighten the terminal.
fr_ca: Insérez le fil noir dans la borne centrale "N" et serrez la borne.
ja: 黒いワイヤーを中央の「N」端子に挿入し、端子を固定する。

source: Strip the 18 AWG (1 :math:`mm^2`) red wire and insert into the "La" terminal and tighten the terminal.
fr_ca: Dénudez le fil rouge 18 AWG (1 :math:`mm^2`) et insérez-le dans la borne "La" et serrez la borne.

source: Cut and strip the other end of the 18 AWG (1 :math:`mm^2`) wire to insert into the "Lb" terminal
fr_ca: Coupez et dénudez l'autre extrémité du fil 18 AWG (1 :math:`mm^2`) à insérer dans la borne "Lb"

source: Insert the red wire from the two pin cable into the "Lb" terminal with the 18 AWG (1 :math:`mm^2`) red wire and tighten the terminal.
fr_ca: Insérez le fil rouge du câble à deux broches dans la borne "Lb" avec le fil rouge 18 AWG (1 :math:`mm^2`) et serrez la borne.

source: Connect the two-pin connector to the RSL port on the roboRIO. The black wire should be closest to the outside of the roboRIO.
fr_ca: Connectez le connecteur à deux broche au port RSL sur le roboRIO. Le fil noir devrait être plus proche à l'extérieur du roboRIO.

source: You may wish to temporarily secure the RSL to the control board using cable ties or Dual Lock (it is recommended to move the RSL to a more visible location as the robot is being constructed)
fr_ca: Il serait préférable de fixer temporairement le RSL au panneau de contrôle en utilisant des Zip-ties (Le RSL doit être très visible sur le robot).

source: Circuit Breakers
fr_ca: Les disjoncteurs
ja: サーキットブレーカー

source: Installing 40A breakers in the PDP.
fr_ca: Installation de disjoncteurs 40A dans le PDP.
ja: PDPに設置された40Aのブレーカー。

source: Requires: 4x 40A circuit breakers
fr_ca: Requiert: 4x disjoncteurs 40A
ja: 必要なもの：40A サーキットブレーカー4個

source: Insert 40-amp Circuit Breakers into the positions on the PDH corresponding with the Wago connectors the motor controllers are connected to. Note that the white graphic indicates which breakers are associated with which terminal pairs.
fr_ca: Insérez les disjoncteurs de 40 A dans les positions du PDH correspondant aux connecteurs Wago auxquels les contrôleurs de moteur sont connectés. Notez que le graphique blanc indique quels disjoncteurs sont associés à quelles paires de bornes.

source: If working on a Robot Quick Build, stop here and insert the board into the robot chassis before continuing.
fr_ca: Si vous optez de faire la Construction rapide du robot, arrêtez ici et insérez le panneau réalisé ci-haut dans le châssis de votre robot.

source: Insert 40-amp Circuit Breakers into the positions on the PDP corresponding with the Wago connectors the motor controllers are connected to. Note that, for all breakers, the breaker corresponds with the nearest positive (red) terminal (see graphic above). All negative terminals on the board are directly connected internally.
fr_ca: Insérez les disjoncteurs de 40 ampères dans les positions du PDP correspondant aux connecteurs Wago auxquels les contrôleurs de moteur sont connectés. Notez que, pour tous les disjoncteurs, le disjoncteur correspond à la borne positive (rouge) la plus proche (voir graphique ci-dessus). Toutes les bornes négatives de la carte sont directement connectées en interne.

source: Motor Power
fr_ca: Alimentation des moteurs
ja: モーターの電源

source: Connecting power from the motor to the motor controller.
fr_ca: Connexion de l’alimentation du moteur au contrôleur de moteur.
ja: モーターからモーターコントローラーへの電力配線。

source: Requires: Wire stripper, wire crimper, phillips head screwdriver, wire connecting hardware
fr_ca: Nécessite: Pince à dénuder, Sertisseur de fil, Tournevis cruciforme, Matériel de connexion de fil
ja: 必要なもの：ワイヤーストリッパー、圧着工具、プラスドライバー、ワイヤー接続ハードウェア

source: For each :term:`CIM` motor:
fr_ca: Pour chaque moteur :term:`CIM` :
ja: 各 :term:`CIM` モーターについて：

source: Strip the ends of the red and black wires from the CIM
fr_ca: Dénudez les extrémités des fils rouge et noir du moteur CIM
ja: CIMの赤と黒のワイヤーの端を剥く。

source: For integrated wire controllers including SPARK MAX (top image):
fr_ca: Pour les contrôleurs à fil intégré, y compris SPARK MAX (image du haut) :
ja: SPARK MAX（上の画像）のようなワイヤー付きコントローラーの場合：

source: Strip the red and black wires (or white and green wires) from the controller (the SPARK MAX white wire is unused for brushed motors such as the CIM, it should be secured and the end should be insulated such with electrical tape or other insulation method).
fr_ca: Dénudez les fils rouges et noirs (ou fils blancs et verts) du contrôleur (le fil blanc SPARK MAX n’est pas utilisé pour les moteurs à balais tels que le CIM, il doit être fixé et l’extrémité doit être isolée par exemple avec du ruban électrique ou d’autres méthodes d’isolation).

source: Connect the motor wires to the matching controller output wires (for controllers with white/green, connect red to white and green to black). The images above show an example using quick disconnect terminals which are provided in the Rookie KOP.
fr_ca: Connectez les fils du moteur aux fils de sortie du contrôleur correspondant (pour les contrôleurs avec du blanc/vert, connectez-vous rouge à blanc et vert à noir). Les images ci-dessus montrent un exemple d'utilisation de bornes de déconnexion rapide qui sont fournis dans le KOP Rookie.

source: For the SPARK or other non-integrated-wire controllers (bottom image):
fr_ca: Pour le SPARK ou d’autres contrôleurs à fil non intégré (image du bas) :
ja: SPARKまたは他の端子型コントローラー（下の画像）の場合：

source: Crimp a ring/fork terminal on each of the motor wires.
fr_ca: Sertissez une cosse à anneau ou à fourchette sur chacun des fils moteur
ja: リングまたはフォーク端子をモーターワイヤーのそれぞれに圧着する。

source: Attach the wires to the output side of the motor controller (red to +, black to -)
fr_ca: Attachez les fils sur la sortie du contrôleur de moteur (rouge à +, noir à -)

source: Giant red stop sign.
fr_ca: Panneau d’arrêt rouge géant.
ja: 巨大な赤いストップのサイン。

source: Before plugging in the battery, make sure all connections have been made with the proper polarity. Ideally have someone that did not wire the robot check to make sure all connections are correct.
fr_ca: Avant de brancher la batterie, assurez-vous que toutes les connexions ont été faites avec la bonne polarité. Idéalement, demander à quelqu'un qui n'a pas câblé le robot de valider que toutes les connexions soient correctes.

source: Start with the battery and verify that the red wire is connected to the positive terminal
fr_ca: Commencez avec la batterie et vérifiez que le fil rouge est connecté à la borne positive

source: Check that the red wire passes through the main breaker and to the + terminal of the PDP and that the black wire travels directly to the - terminal.
fr_ca: Vérifiez que le fil rouge passe à travers le disjoncteur principal et aboutit à la borne positive + du PDP et que le fil noir se rend directement à la borne négative -.

source: For each motor controller, verify that the red wire goes from the red PDP terminal to the V+ terminal on the motor controller (not M+!!!!)
fr_ca: Pour chaque contrôleur de moteur, vérifiez que le fil rouge va de la borne rouge PDP à la borne V+ du contrôleur de moteur (pas M+!!!!)

source: For each non-motor controller device, verify that the red wire runs from a red terminal on the PD connects to a red terminal on the component.
fr_ca: Pour chaque dispositif autre qu'un contrôleur de moteur, vérifiez que le fil rouge part d'une borne rouge sur le PD et se connecte à une borne rouge sur le composant.

source: It is also recommended to put the robot on blocks so the wheels are off the ground before proceeding. This will prevent any unexpected movement from becoming dangerous.
fr_ca: Il est aussi recommandé de mettre le robot sur des blocs afin que les roues ne touchent pas le sol ou la table de travail avant de procéder à la mise sous tension. Cette précaution évitera que le robot ne se déplace de façon dangereuse.

source: Manage Wires
fr_ca: Gestion des câbles
ja: 配線の整理

source: Requires: Zip ties
fr_ca: Nécessite: attaches Zip Ties
ja: 必要なもの：結束バンド

source: Now may be a good time to add a few zip ties to manage some of the wires before proceeding. This will help keep the robot wiring neat.
fr_ca: A ce moment, il serait préférable d'ajouter quelques Zip Ties pour placer convenablement les câbles avant de procéder plus loin. Cela aidera à garder le câblage du robot ordonné.

source: Connect Battery
fr_ca: Connecter la Batterie
ja: バッテリーを接続する

source: Connect the battery to the robot side of the Anderson connector. Power on the robot by moving the lever on the top of the 120A main breaker into the ridge on the top of the housing.
fr_ca: Connectez la batterie au côté robot du connecteur Anderson. Mettez le robot sous tension en déplaçant le levier sur le dessus du disjoncteur principal 120A.

source: If stuff blinks, you probably did it right. If you hear any clicking, or see any smoke, power the system off immediately, clicking is likely the sound of circuit breakers tripping.
fr_ca: Si des temoins LED clignotent, vous l'avez probablement bien fait. Si vous entendez un clic ou voyez de la fumée, éteignez immédiatement le système. Un clic est probablement le bruit du déclenchement des disjoncteurs.

source: Before moving on, if using SPARK MAX controllers, there is one more configuration step to complete. The SPARK MAX motor controllers are configured to control a brushless motor by default. You can verify this by checking that the light on the controller is blinking either cyan or magenta (indicating brushless brake or brushless coast respectively). To change to brushed mode, press and hold the mode button for 3-4 seconds until the status LED changes color. The LED should change to either blue or yellow, indicating that the controller is in brushed mode (brake or coast respectively). To change the brake or coast mode, which controls how quickly the motor slows down when a neutral signal is applied, press the mode button briefly.
fr_ca: Avant de continuer, si vous utilisez des contrôleurs SPARK MAX, il reste une étape de configuration supplémentaire à effectuer. Les contrôleurs de moteur SPARK MAX sont configurés pour contrôler un moteur sans balais par défaut. Vous pouvez le vérifier en vérifiant que le voyant du contrôleur clignote en cyan ou en magenta (indiquant respectivement le frein sans balais ou la roue libre sans balais). Pour passer en mode "avec balais", maintenir enfoncé le bouton de mode pendant 3 à 4 secondes jusqu'à ce que le voyant d'état change de couleur. La LED doit passer au bleu ou au jaune, indiquant que le contrôleur est en mode "avec balais" (respectivement freinage ou roue libre). Pour modifier le mode freinage ou roue libre, qui contrôle la rapidité avec laquelle le moteur ralentit lorsqu'un signal neutre est appliqué, appuyez brièvement sur le bouton mode.

source: From here, you should connect to the roboRIO and try uploading your code!
fr_ca: De là, vous devez vous connecter au roboRIO et essayer de télécharger votre code!
ja: ここから、roboRIOに接続してコードをアップロードしてみてください！

source: Radio Power Module (:term:`RPM`) / Voltage Regulator Module (:term:`VRM`)
ja: ラジオ電源モジュールと電圧レギュレータモジュール：Radio Power Module (:term:`RPM`) / Voltage Regulator Module (:term:`VRM`)

source: OpenMesh radio (with power cable and Ethernet cable)
ja: OpenMeshラジオ（電源ケーブルとイーサネットケーブル付き）

source: Power going from the PDH to the RPM.
ja: PDHからRPMへの電力配線。

source: Power going into the RPM.
ja: 電力配線がRPMに接続されます。

source: Connect the wire to the RPM 12V Input terminals.
ja: ワイヤをRPMの12V入力端子に接続します。

source: Power going from the PDP to the VRM.
ja: PDPからVRMへの電力配線。

source: Connect the wire to the VRM 12Vin terminals.
ja: ワイヤをVRMの12Vin端子に接続します。

source: Connection power to the robot radio via a PoE cable.
ja: PoEケーブルでロボットラジオに電源を接続する。

source: Requires: Small flat screwdriver (optional), Rev radio PoE cable
ja: 必要なもの：極小マイナスドライバー（オプション）、RevラジオPoEケーブル

source: Picture of the RPM.
ja: RPMを表示する画像。

source: Picture of the radio.
ja: ラジオを表示する画像。

source: Requires: 2x Ethernet cables
ja: 必要なもの：イーサネットケーブル2本

source: Connecting Ethernet from the roboRIO to the PoE cable.
ja: roboRIOからPoEケーブルへのイーサネット接続。

source: Requires: Ethernet cable
ja: 必要なもの：イーサネットケーブル

source: STOP
ja: **止める**

source: Make sure that the PoE cable is plugged directly into the radio NOT THE roboRIO!
ja: PoEケーブルがroboRIOではなく、直接ラジオに接続されていることを確認してください！

source: Detailed diagram of all of the components and how they are connected.
es_mx: Diagrama detallado de todos los componentes y como están conectados.

source: (Optional) REV PoE Injector cable or similar
es_mx: (Opcional) REV cable inyector de PoE o similar

source: Wire cutters, wire stripper (6, 10, 18, 22 AWGs), and terminal crimper (6AWG terminal) or vice
es_mx: Cortadores de cables, pelacables (6, 10, 18, 22 AWG) y engarzadores de terminales (terminal 6 AWG) o tornillo de banco

source: Scissors
es_mx: Tijeras

source: Drill with 1/4" (6mm) bit
es_mx: Taladro con broca de 1/4" (6mm)

source: A basic wiring layout of the components on the Kitbot boards
es_mx: Un layout básico de los componentes de las placas del Kitbot

source: CAN Bus connections - PDH and roboRIO
es_mx: Conexiones CAN Bus- PDH y roboRIO

source: A pair of images. One showing a CAN bus connection to a roboRIO and one showing a connection to a PDH.
es_mx: Un par de imágenes. Una mostrando una conexión CAN bus a la roboRIO y otra mostrando la conexión a la PDH.
