Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-1/intro-to-frc-robot-wiring.po
Languages: es_mx, fr_ca, ja

source: Introduction to FRC Robot Wiring
es_mx: Introducción a la conexión de cables del robot FRC
fr_ca: Introduction au câblage du robot FRC
ja: FRCロボット配線の紹介

source: This document details the wiring of a basic electronics board for the kitbot or to allow basic drivetrain testing.
fr_ca: Ce document détaille le câblage d'un panneau d'électronique basique pour le kitbot ou afin de permettre un test basique de la base de pilotage.

source: Some images shown in this section reflect the setup for a Robot Control System using SPARK or SPARK MAX Motor Controllers. Wiring diagram and layout should be similar for other motor controllers. Where appropriate, two sets of images are provided to show connections using controllers with and without integrated wires.
fr_ca: Certaines images dans cette section démontrent l'installation pour un système de contrôle du robot utilisant les contrôleurs de moteur SPARK MAX. Les diagrammes de câblage et la disposition devraient être similaire pour les autres contrôleurs de moteur.. Lorsque approprié, deux ensembles d'images sont fournis afin de démontrer les connections en utilisant de contrôleurs avec et sans fils intégrés.
ja: このセクションに表示される一部の画像は、SPARKまたはSPARK MAXモーターコントローラーを使用したロボット制御システムのセットアップについて説明します。配線図とレイアウトは他のモーターコントローラーにも類似するはずです。該当する場合、2組の画像を提供し、ワイヤー付き型および端子型のコントローラーを使用した接続を示します。

source: Overview
es_mx: Vista general
fr_ca: Aperçu
ja: 概要

source: Diagram courtesy of FRC\ |reg| Team 3161 and Stefen Acepcion.
fr_ca: Diagramme gracieuseté de l'équipe FRC\ |reg| 3161 et Stefen Acepcion.
ja: FRC\ |reg| Team 3161 および Stefen Acepcion 提供の図

source: Gather Materials
fr_ca: Rassembler des Matériaux
ja: 工具と部品を集める

source: Locate the following control system components and tools
fr_ca: Localisez les outils et composants de système de contrôle suivants
ja: 以下の制御システムのコンポーネントと工具を見つけてください。

source: Kit Materials:
fr_ca: Matériaux du Kit:
ja: キットの材料：

source: Power Distribution Hub (:term:`PDH`) / Power Distribution Panel (:term:`PDP`)
fr_ca: Hub de distribution d'énergie (:term:`PDH`) / Panneau de distribution d'énergie (:term:`PDP`)
ja: 配電板：Power Distribution Hub (:term:`PDH`) / Power Distribution Panel (:term:`PDP`)

source: Pneumatics Hub (:term:`PH`) / Pneumatics Control Module (:term:`PCM`)
fr_ca: Hub pneumatique (:term:`PH`) / Module de commande pneumatique (:term:`PCM`)
ja: 空気圧ハブと制御モジュール：Pneumatics Hub (:term:`PH`) / Pneumatics Control Module (:term:`PCM`)

source: Robot Signal Light (:term:`RSL`)
fr_ca: Signal lumineux du robot (:term:`RSL`)
ja: ロボット信号灯：Robot Signal Light (:term:`RSL`)

source: 4x SPARK MAX or other motor controllers
fr_ca: 4x SPARK MAX ou d’autres contrôleurs de moteur
ja: SPARK MAX または他のモーターコントローラー4個

source: 2x :term:`PWM` y-cables
fr_ca: 2x :term:`PWM` cables en Y
ja: :term:`PWM` Yケーブル2本

source: 120A Circuit breaker
fr_ca: Disjoncteur 120A
ja: 120A サーキットブレーカー

source: 4x 40A Circuit breaker
fr_ca: 4x Disjoncteur 40A
ja: 40A サーキットブレーカー4個

source: 6 AWG (16 :math:`mm^2`) Red wire
fr_ca: Fil rouge 6 AWG (16 :math:`mm^2`)
ja: 6 AWG (16 :math:`mm^2`) 赤いワイヤー

source: 10 AWG (6 :math:`mm^2`) Red/Black wire
fr_ca: Fil rouge/noir 10 AWG (6 :math:`mm^2`)
ja: 10 AWG (6 :math:`mm^2`) 赤/黒のワイヤー

source: 18 AWG (1 :math:`mm^2`) Red/Black wire
fr_ca: Fil rouge/noir 18 AWG (1 :math:`mm^2`)
ja: 18 AWG (1 :math:`mm^2`) 赤/黒のワイヤー

source: 22 AWG (0.5 :math:`mm^2`) Yellow/Green twisted :term:`CAN` cable
fr_ca: 22 AWG (0.5 :math:`mm^2`) filage jaune et vert :term:`CAN`
ja: 22 AWG (0.5 :math:`mm^2`) 黄/緑のツイスト :term:`CAN` ケーブル

source: 8x Pairs of 10-12 AWG (4 - 6 :math:`mm^2`) (Yellow) quick disconnect terminals (16x ring terminals if using integrated wire controllers)
fr_ca: 8x paires de terminaux à déconnexion rapide 10-12 AWG (4 - 6 :math:`mm^2`) (Jaune) (16x terminaux en anneau si un contrôleur avec fils intégrés est utilisé).
ja: 8組の10〜12 AWG (４〜６ :math:`mm^2`) （黄色）クイックディスコネクト端子（ワイヤー付きコントローラを使用する場合はリング端子を16個）

source: 2x Anderson SB50 battery connectors
fr_ca: 2x Connecteurs de batterie Anderson SB50
ja: Anderson SB50 バッテリーコネクタ2個

source: 6 AWG (16 :math:`mm^2`) Terminal lugs
fr_ca: Cosses pour bornes de raccordement 6 AWG (16 :math:`mm^2`)
ja: 6 AWG (16 :math:`mm^2`) ターミナルラグ

source: 12V Battery
fr_ca: Batterie 12V
ja: 12V バッテリー

source: Red/Black Electrical tape
fr_ca: Ruban électrique Rouge/Noir
ja: 赤/黒の電気テープ

source: Dual Lock material or fasteners
fr_ca: Ruban Velcro avec double bande adhésive, ou vis
ja: デュアルロックファスナーまたは固定金物

source: Zip ties
fr_ca: Attaches de style Tie-wrap ou Zip Ties
ja: 結束バンド

source: 1/4" or 1/2" (6-12 mm) plywood
fr_ca: Contreplaqué 1/4″ ou 1/2″ (6-12 mm)
ja: 1/4"または1/2"（6〜12 mm）の合板

source: Tools Required:
fr_ca: Outils Nécessaires:
ja: 必要な工具：

source: Wago Tool or small flat-head screwdriver
fr_ca: Outil spécialisé pour le branchement aux connecteurs Wago ou encore petit tournevis à tête plate.
ja: Wagoの操作工具または小型マイナスドライバー

source: Very small flat head screwdriver (eyeglass repair size)
fr_ca: Minuscule tournevis à tête plate (style réparation de lunettes)
ja: 極小マイナスドライバー（眼鏡修理用サイズ）

source: Wire cutters, strippers, and crimpers
fr_ca: Pinces coupantes, Pince à dénuder et pinces à sertir
ja: ワイヤーカッター、ワイヤーストリッパー、圧着工具

source: 7/16" (11 mm may work if imperial is unavailable) box end wrench or nut driver
fr_ca: Clé à 6 pans ou tourne-écrou de 7/16″ (11 mm peuvent fonctionner si le système impérial n'est pas disponible)
ja: 7/16インチ（帝国単位の工具がない場合は11mmでも可能）のボックスエンドレンチまたはナットドライバー

source: Additional 7/16" wrench/nut driver or Philips head screw driver
fr_ca: Clé/tournevis à boulon 7/16" ou tournevis à tête Philips additionnel.
ja: 追加の7/16インチのレンチ/ナットドライバーまたはプラスドライバー

source: For CTR PDP only: 5 mm Hex key (3/16" may work if metric is unavailable)
fr_ca: Pour le PDP CTR seulement: clé Hex 5mm (une clé 3/16" peut fonctionner si la clé métrique n'est pas disponible).
ja: CTR PDPのみ：5mm 六角レンチ（メートル法の工具がない場合は3/16インチでも可能）

source: For CTR PDP only: 1/16" Hex key
fr_ca: Pour le PDP CTR seulement: clé Hex 1/16"
ja: CTR PDPのみ：1/16インチの六角レンチ

source: Create the Base for the Control System
fr_ca: Créer le panneau de support pour le Système de Contrôle
ja: 制御システムの基礎を作る

source: For a test board, cut piece of 1/4" or 1/2" (6-12 mm) material (wood or plastic) approximately 24" x 16" (60 x 40 cm). For a Robot Quick Build control board see the supporting documentation for the proper size board for the chosen chassis configuration.
fr_ca: Pour le panneau-prototype, coupez un morceau de matériau de 1/4″ ou 1/2″ (6-12 mm) (bois ou plastique) d'environ 24″ x 16″ (60 x 40 cm). Pour un panneau de contrôle «Robot Quick Build» voir la documentation de support pour la carte de taille appropriée pour la configuration de châssis choisie.

source: Layout the Core Control System Components
fr_ca: Disposer les Composants du Système de Contrôle de Base
ja: 制御システムの主要コンポーネントを配置する

source: A basic wiring layout with CTR components.
fr_ca: Une disposition de base du câblage avec des composantes CTR.
ja: CTR部品で構成される基本的な配線配置。

source: Lay out the components on the board. An example layout is shown in the image above.
fr_ca: Disposez les composants sur le panneau. Un exemple de disposition est illustré dans l'image ci-dessus.
ja: ボード上にコンポーネントを配置します。上の画像には配置の例が示されています。

source: Fasten Components
fr_ca: Fixer les composants
ja: コンポーネントを固定する

source: Using zipties to secure components down.
fr_ca: Utilisation de zipties pour sécuriser les composants sur le socle.
ja: コンポーネントを固定するために結束バンドの使用。

source: Using the Dual Lock or hardware, fasten all components to the board. Note that in many FRC games robot-to-robot contact may be substantial and Dual Lock alone is unlikely to stand up as a fastener for many electronic components. Teams may wish to use nut and bolt fasteners or (as shown in the image above) cable ties, with or without Dual Lock to secure devices to the board.
fr_ca: En utilisant le ruban Velcro ou la quincaillerie, attachez tout les composants au panneau. Notez que lors des tournois FRC, les contacts entre les robots peuvent être intenses, et le Dual Lock seul peut quelquefois se détacher. L'usage de vis et écrous (tel que démontré dans l'image ci-dessus) est une façon supérieure de fixer les composants électriques de grande taille. Ou encore, l'emploi de zip-ties peut être adéquat.

source: Attach Robot Side Battery Connector
fr_ca: Attachez le connecteur latéral de la batterie du Robot.
ja: ロボット側バッテリーコネクターの取り付け

source: The next step will involve using the Wago connectors on the PDH. To use the Wago connectors, open the lever, insert the wire, then close the lever. Two sizes of Wago connector are found on the PDH:
fr_ca: La prochaine étape impliquera l'utilisation de connecteurs Wago sur le PDH. Pour utiliser les connecteurs Wago, ouvrez le levier, insérez le fil et fermez le levier. Deux tailles de connecteurs Wago se trouvent sur le PDH.

source: Main power connectors: Accept 4 - 18 AWG (.75 - 25 :math:`mm^2`), strip 20 mm (~3/4")
fr_ca: Connecteur principal d'alimentation: accepte de 4 à 18 AWG (.75 - 25 :math:`mm^2`), dénudez 20 mm (~3/4")

source: High current channel connectors: Accept 8 - 24 AWG (.25 - 10 :math:`mm^2`), strip 12 mm (~1/2")
fr_ca: Connecteur des canaux haute puissance: accepte de 8 à 24 AWG (.25 - 10 :math:`mm^2`), dénudez 12 mm (~1/2")

source: To maximize pullout force and minimize connection resistance wires should not be tinned (and ideally not twisted) before inserting into the Wago connector.
fr_ca: Pour maximiser la résistance mécanique à l'arrachement et minimiser la résistance électrique, les fils ne doivent pas être étamés (et idéalement non- torsadés) avant d'être inséré dans le connecteur Wago.

source: Highlights the location of the terminal lugs on the PDH and circuit breaker.
fr_ca: Met en évidence l'emplacement des cosses de borne sur le PDH et le disjoncteur.
ja: PDHとサーキットブレーカーの端子ラグの位置を強調する。

source: Requires: Battery Connector, 6 AWG (16 :math:`mm^2`) terminal lugs, 7/16" (11 mm) Box end
fr_ca: Nécessite : connecteur de batterie, cosses de borne 6 AWG (16 :math:`mm^2`), clé 7/16" (11 mm)
ja: 必要なもの： バッテリーコネクタ、6 AWG（16 :math:`mm^2`）ターミナルラグ、7/16インチ（11 mm）ボックスエンドレンチ

source: Attach terminal lug to positive (red) wire of battery connector. Strip .75" off the black wire.
fr_ca: Fixez la cosse au fil positif (rouge) du connecteur de la batterie. Dénudez 0,75" du fil noir.

source: Lift the lever above the black main power input terminal on the PDH until it clicks into place. Insert the wire. Pull the lever down to secure the wire.
fr_ca: Levez le levier au-dessus de l'entrée principale d'alimentation sur le PDH jusqu'il clique en place. Insérez le fil. Abaissez le levier pour sécuriser le fil.

source: Using a 7/16" (11 mm) box end wrench, remove the nut on the "Batt" side of the main breaker and secure the positive terminal of the battery connector
fr_ca: À l'aide d'une clé Hex de 7/16″ (11 mm), retirez l'écrou du côté "Batt" du disjoncteur principal et fixez la borne positive du connecteur de batterie.

source: Highlights the location of the terminal lugs on the PDP and circuit breaker.
fr_ca: Met en évidence l’emplacement des cosses de borne sur le PDP et le disjoncteur.
ja: PDPとサーキットブレーカーの端子ラグの位置を強調する。

source: Requires: Battery Connector, 6 AWG (16 :math:`mm^2`) terminal lugs, 1/16" Allen, 5 mm Allen, 7/16" (11 mm) Box end
fr_ca: Requiert: Connecteur de batterie, Cosses de terminaison 6 AWG (16 :math:`mm^2`), Clé Allen 1/16″, Clé Allen 3/16'' (5 mm) et Clé à 6 pans 7/16″ (11 mm)

source: Attach terminal lugs to battery connector.
fr_ca: Attachez les cosses à bornes au connecteur de batterie:
ja: バッテリーコネクタにターミナルラグを取り付けてください。

source: Using a 1/16" Allen wrench, remove the two screws securing the PDP terminal cover.
fr_ca: En utilisant un clé Allen 1/16″, retirez les deux vis fixant le couvercle des bornes du PDP.
ja: 1/16インチの六角レンチを使用して、PDP端子カバーを固定している2本のネジを取り外す。

source: Using a 5 mm Allen wrench (3/16"), remove the negative (-) bolt and washer from the PDP and fasten the negative terminal of the battery connector.
fr_ca: À l'aide d'une clé Allen de 5 mm (3/16″), retirez le boulon négatif (-) ainsi que la rondelle du PDP et fixez la borne négative du connecteur de batterie.

source: Wire Breaker to Power Distribution
fr_ca: Connectez le disjoncteur au panneau de distribution.
ja: ブレーカーを配電盤に接続する

source: Show the circuit breaker wired to the PDH.
fr_ca: Affiche le disjoncteur connecté au PDP.
ja: PDHに配線されたサーキットブレーカーが表示されます。

source: Requires: 6 AWG (16 :math:`mm^2`) red wire, 1x 6 AWG (16 :math:`mm^2`) terminal lugs, 7/16" (11 mm) wrench
fr_ca: Nécessite : fil rouge 6 AWG (16 :math:`mm^2`), 1x cosses de borne 6 AWG (16 :math:`mm^2`), clé de 7/16" (11 mm)

source: Secure one terminal lug to the end of the 6 AWG (16 :math:`mm^2`) red wire. Using the 7/16" (11 mm) wrench, remove the nut from the "AUX" side of the 120A main breaker and place the terminal over the stud. Loosely secure the nut (you may wish to remove it shortly to cut and strip the other end of the wire). Measure out the length of wire required to reach the positive terminal of the PDH.
fr_ca: Fixez une cosse à l'extrémité du fil rouge 6 AWG (16 :math:`mm^2`). À l'aide de la clé de 7/16" (11 mm), retirez l'écrou du côté "AUX" du disjoncteur principal de 120 A et placez la borne sur le goujon. Fixez l'écrou sans serrer (vous souhaiterez peut-être le retirer sous peu pour couper et dénuder l'autre extrémité du fil). Mesurez la longueur de fil nécessaire pour atteindre la borne positive du PDH.

source: Cut and strip the other end of the red wire.
fr_ca: Coupez et dénudez l'autre extrémité du fil rouge.
ja: 赤いワイヤーのもう一方の端を切断して剥きます。

source: Using the 7/16" (11 mm) wrench, secure the wire to the "AUX" side of the 120A main breaker.
fr_ca: À l'aide de la clé de 7/16" (11 mm), fixez le fil du côté "AUX" du disjoncteur principal de 120 A.

source: Lift the lever on the positive (red) input terminal of the PDH, insert the wire, then close the terminal.
fr_ca: Soulevez le levier de la borne d'entrée positive (rouge) du PDH, insérez le fil, puis fermez la borne.

source: Show the circuit breaker wired to the PDP.
fr_ca: Affiche le disjoncteur connecté au PDP.
ja: PDPに配線されたサーキットブレーカーが表示されます。

source: Requires: 6 AWG (16 :math:`mm^2`) red wire, 2x 6 AWG (16 :math:`mm^2`) terminal lugs, 5 mm Allen, 7/16" (11 mm) box end
fr_ca: Nécessite: fil rouge 6 AWG (16 :math:`mm^2`), 2x cosses de borne 6 AWG (16 :math:`mm^2`), Clé Allen 5mm, Clé à 6 pans 7/16″ (11 mm)

source: Secure one terminal lug to the end of the 6 AWG (16 :math:`mm^2`) red wire. Using the 7/16" (11 mm) box end, remove the nut from the "AUX" side of the 120A main breaker and place the terminal over the stud. Loosely secure the nut (you may wish to remove it shortly to cut, strip, and crimp the other end of the wire). Measure out the length of wire required to reach the positive terminal of the PDP.
fr_ca: Fixez une cosse de borne à l'extrémité du fil rouge 6 AWG (16 :math:`mm^2`). En utilisant la clé à 6 pans de 7/16″ (11 mm), retirez l'écrou du côté "AUX" du disjoncteur principal de 120 A et placez la borne sur le goujon. Fixez légèrement l’écrou (vous pouvez le retirer momentanément pour le couper, le dénuder et sertir l’autre extrémité du fil). Mesurez la longueur de fil nécessaire pour atteindre la borne positive du PDP.

source: Cut, strip, and crimp the terminal to the 2nd end of the red 6 AWG (16 :math:`mm^2`) wire.
fr_ca: Coupez, dénudez et sertissez la borne à la 2ème extrémité du fil rouge 6 AWG (16 :math:`mm^2`).

source: Using the 7/16" (11 mm) box end, secure the wire to the "AUX" side of the 120A main breaker.
fr_ca: À l'aide de la clé à 6 pans 7/16″ (11 mm), fixez le câble au côté "AUX" du disjoncteur principal de 120A.

source: Using the 5 mm Allen wrench, secure the other end to the PDP positive terminal.
fr_ca: À l'aide de la clé Allen de 5 mm, fixez l'autre extrémité à la borne positive du PDP.
ja: 5mmの六角レンチを使用して、他の端をPDPのプラス端子に固定する。

source: Insulate power connections
fr_ca: Isolation des connexions au PDP
ja: 電源接続を絶縁する

source: Putting tape around the connectors to insulate them.
fr_ca: Mettre du ruban adhésif autour des connecteurs pour les isoler.
ja: コネクターには絶縁のために電気テープが巻かれています。

source: Requires: Electrical tape
fr_ca: Requiert: ruban électrique
ja: 必要なもの：電気テープ

source: Using electrical tape, insulate the two connections to the 120A breaker.
fr_ca: En utilisant un ruban électrique, isolez les deux connexions du disjoncteur 120A.
ja: 電気テープを使用して、120Aブレーカーへの2つの接続点を絶縁します。

source: Requires: 1/16" Allen, Electrical tape
fr_ca: Requiert: Allen 1/16″, Ruban électrique
ja: 必要なもの：1/16インチの六角レンチ、電気テープ

source: Using electrical tape, insulate the two connections to the 120A breaker. Also insulate any part of the PDP terminals which will be exposed when the cover is replaced.
fr_ca: À l'aide de ruban isolant, isolez les deux connexions au disjoncteur 120A. Isolez également toute partie des bornes PDP qui sera exposée lorsque le couvercle sera remplacé.

source: Using the 1/16" Allen wrench, replace the PDP terminal cover
fr_ca: En utilisant la clé Allen 1/16″, replacer le cache-borne PDP
ja: 1/16インチの六角レンチを使用して、PDP端子カバーを元に戻します。

source: Motor Controller Power
es_mx: Controlador de Potencia del motor
fr_ca: L'alimentation du Contrôleur de moteur
ja: モーターコントローラーの電源

source: Wiring power from the PDH to motor controllers.
es_mx: Conexión de energía desde el PDH a los controladores de motor.
fr_ca: Câblage de l’alimentation du PDH aux contrôleurs de moteur.
ja: PDHからモーターコントローラーへの電力配線。

source: Wiring power to a Spark Motor Controller with ring terminals.
fr_ca: Connexion de l'alimentation à un contrôleur de moteur Spark avec bornes en anneau.
ja: Sparkモーターコントローラーにリング端子で電源を配線する。

source: Requires: Wire Stripper Terminal Controllers only: 10 or 12 AWG (4 - 6 :math:`mm^2`) wire , 10 or 12 AWG (4 - 6 :math:`mm^2`) fork/ring terminals, wire crimper
fr_ca: Nécessite : Contrôleurs de bornes à dénuder uniquement : fil 10 ou 12 AWG (4 - 6 :math:`mm^2`), bornes à fourche/anneau 10 ou 12 AWG (4-6 :math:`mm^2`), sertisseuse

source: For SPARK MAX or other wire integrated motor controllers (top image):
fr_ca: Pour SPARK MAX ou d’autres contrôleurs de moteur avec fil intégré (image du haut) :
ja: SPARK MAXまたは他のワイヤー付きモーターコントローラー（上の画像）について：

source: Cut and strip the red and black power input wires, then insert into one of the Wago terminal pairs.
fr_ca: Coupez et dénudez les fils d'entrée d'alimentation rouge et noir, puis insérez-les dans l'une des paires de bornes Wago.

source: For terminal motor controllers (bottom image):
fr_ca: Pour les contrôleurs de moteur avec bornes (image du bas):
ja: 端子型モーターコントローラー（下の画像）について：

source: Cut red and black wire to appropriate length to reach from one of the Wago terminal pairs to the input side of the motor controller (with a little extra for the length that will be inserted into the terminals on each end)
fr_ca: Coupez les fils rouge et noir à la longueur appropriée pour atteindre l'une des paires de bornes Wago jusqu'au côté entrée du contrôleur de moteur (avec un peu plus pour la longueur qui sera insérée dans les bornes à chaque extrémité).

source: Strip one end of each of the wires, then insert into the Wago terminals.
fr_ca: Dénudez une extrémité de chaque fil, ensuite insérez dans les bornes Wago.
ja: 各ワイヤーの片方の端を剥き、それからWago端子に挿入する。

source: Strip the other end of each wire, and crimp on a ring or fork terminal
fr_ca: Dénudez l'autre extrémité de chaque fil, et sertissez une cosse en anneau ou à fourchette.
ja: 各ワイヤーのもう一方の端を剥き、リングまたはフォーク端子を圧着する。

source: Attach the terminal to the motor controller input terminals (red to +, black to -)
fr_ca: Reliez le terminal aux terminaux d’entrée du contrôleur de moteur (rouge à +, noir à -)
ja: 端子をモーターコントローラーの入力端子に接続する（赤をプラスに、黒をマイナスに）

source: The next step will involve using the Wago connectors on the PDP. To use the Wago connectors, insert a small flat blade screwdriver into the rectangular hole at a shallow angle then angle the screwdriver upwards as you continue to press in to actuate the lever, opening the terminal. Two sizes of Wago connector are found on the PDP:
fr_ca: La prochaîne étape consiste à relier les fils aux connecteurs Wago sur le PDP. Pour utiliser les connecteurs Wago, insérez un petit tournevis à tête plate dans le trou rectangulaire à un angle peu prononcé (presque à l'horizontale) puis incliner le tournevis vers le haut pendant que vous continuez à appuyer pour actionner le levier, ce qui ouvre la borne. Le PDP a deux tailles de connecteurs Wago:

source: Small Wago connector: Accepts 10 - 24 AWG (0.25 - 6 :math:`mm^2`), strip 11-12 mm (~7/16")
fr_ca: Petit connecteur Wago: accepte 10 - 24 AWG (0,25 - 6 :math:`mm^2`), bande 11-12 mm (~ 7/16″)

source: Large Wago connector: Accepts 6 - 12 AWG (4 - 16 :math:`mm^2`), strip 12-13 mm (~1/2")
fr_ca: Grand connecteur Wago: accepte 6 - 12 AWG (4 - 16 :math:`mm^2`), bande 12-13 mm (~ 1/2″)

source: Wiring power from the PDP to motor controllers.
fr_ca: Connexion de l'alimentation du PDP aux contrôleurs de moteur.
ja: PDPからモーターコントローラーへの電力配線。

source: Requires: Wire Stripper, Small Flat Screwdriver, Terminal Controllers only: 10 or 12 AWG (4 - 6 :math:`mm^2`) wire, 10 or 12 AWG (4 - 6 :math:`mm^2`) fork/ring terminals, wire crimper
fr_ca: Nécessite : une pince à dénuder, un petit tournevis plat, des contrôleurs de bornes uniquement : fil de 10 ou 12 AWG (4 - 6 :math:`mm^2`), fourchette de 10 ou 12 AWG (4-6 :math:`mm^2`) / cosses à anneau, pince à sertir

source: Cut and strip the red and black power input wires, then insert into one of the 40A (larger) Wago terminal pairs.
fr_ca: Coupez et dénudez les fils d’entrée d'alimentation rouge et noir, puis insérez-les dans l’une des paires terminales Wago 40A (plus grands).

source: Cut red and black wire to appropriate length to reach from one of the 40A (larger) Wago terminal pairs to the input side of the motor controller (with a little extra for the length that will be inserted into the terminals on each end)
fr_ca: Couper le fil rouge et noir à la longueur appropriée pour partir de l’une des paires terminales Wago 40A (plus grandes) et atteindre le côté correspondant à l’entrée du contrôleur de moteur (avec un petit bout de longueur additionnelle pour la longueur qui sera insérée dans les terminaux à chaque extrémité)

source: Weidmuller Connectors
fr_ca: Les connecteurs Weidmuller
ja: Weidmullerコネクター

source: A number of the CAN and power connectors in the system use a Weidmuller LSF series wire-to-board connector. There are a few things to keep in mind when using this connector for best results:
fr_ca: Certains connecteurs pour le bus CAN et l'alimentation basse puissance utilisent une série de connecteur de type Weidmuller LSF. Voici quelques conseils à retenir lorsque vous utilisez ce type de connecteur pour obtenir les meilleurs résultats:

source: Wire should be 16 AWG (1.5 :math:`mm^2`) to 24 AWG (0.25 :math:`mm^2`) (consult rules to verify required gauge for power wiring)
fr_ca: Le fil doit être de 16 AWG (1,5 :math:`mm^2`) à 24 AWG (0,25 :math:`mm^2`) (consultez les règles pour vérifier le calibre requis pour le câblage d'alimentation)

source: Wire ends should be stripped approximately 5/16 (~8 mm)"
fr_ca: Les extrémités des fils doivent être dénudées d'environ 5/16″ (~ 8 mm)
ja: ワイヤーの端は、約5/16インチ（約8 mm）を剥くべきです。

source: To insert or remove the wire, press down on the corresponding "button" to open the terminal
fr_ca: Pour insérer ou retirer le fil, appuyez sur le petit picot, ou "bouton" correspondant pour ouvrir la borne.

source: After making the connection check to be sure that it is clean and secure:
fr_ca: Après avoir fait la connexion, vérifiez qu'elle est propre et sécurisé:
ja: 接続を確定した後、クリーンで安全であることを確認してください：
