Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-1/intro-to-frc-robot-wiring.po
Languages: es_mx, fr_ca, ja

source: Verify that there are no "whiskers" outside the connector that may cause a short circuit
fr_ca: Vérifiez qu'il n'y a aucun brin de fil qui dépasse à l'extérieur du connecteur, ce qui pourrait causer un court-circuit
ja: コネクタの外側にショートサーキットを引き起こす可能性のある「ウィスカ」がないことを確認してください

source: Tug on the wire to verify that it is seated fully. If the wire comes out and is the correct gauge it needs to be inserted further and/or stripped back further. Occasionally the terminal may remain stuck open with the wire inserted and the button released even if the wire is stripped and inserted properly; in these cases wiggling the wire in and out a small amount will often allow the connector to latch shut and grip the wire.
fr_ca: Tirez sur le fil pour vérifier qu’il est bien en place. Si le fil sort et que son calibre est correct, il doit être inséré davantage et/ou dénudé davantage. Parfois, la borne peut rester ouverte avec le fil inséré et le bouton relâché même si le fil est dénudé et inséré correctement ; dans ces cas, remuer légèrement le fil vers l'intérieur et l'extérieur permettra souvent au connecteur de se verrouiller et de saisir le fil.

source: roboRIO Power
fr_ca: L'alimentation du roboRIO
ja: roboRIOの電源

source: Power coming from the PDH to the roboRIO.
fr_ca: Alimentation venant du PDH vers le roboRIO.
ja: PDHからroboRIOへの電力配線。

source: Power going into the roboRIO.
fr_ca: Alimentation allant dans le roboRIO.
ja: roboRIOに接続された電力配線。

source: Requires: 10A mini fuse, Wire stripper, very small flat screwdriver, 18 AWG (1 :math:`mm^2`) Red and Black
fr_ca: Nécessite : un mini fusible 10 A, une pince à dénuder, un très petit tournevis plat, 18 AWG (1 :math:`mm^2`) rouge et noir

source: Insert the 10A fuse into the PDH in one of the non-switchable fused channels (20-22).
fr_ca: Insérez le fusible 10A dans le PDH dans l'un des canaux à fusibles non commutables (20-22).
ja: PDHの「switchable」ではないヒューズ付きチャンネル（20-22）の一つに10Aのヒューズを挿入する。

source: Strip ~5/16" (~8 mm) on both the red and black 18 AWG (1 :math:`mm^2`) wire and connect to the corresponding terminals on the PDH channel where the fuse was installed
fr_ca: Dénudez ~5/16" (~8 mm) sur les fils rouge et noir 18 AWG (1 :math:`mm^2`) et connectez-les aux bornes correspondantes sur le canal PDH où le fusible a été installé.

source: Measure the required length to reach the power input on the roboRIO. Take care to leave enough length to route the wires around any other components such as the battery and to allow for any strain relief or cable management.
fr_ca: Mesurez la longeur nécessaire pour atteindre l'entrée d'alimentation sur le roboRIO. Prenez soin de laisser une longeur suffisante pour acheminer les fils autour de tout autre composant tel que la batterie et pour allouer assez de longueur pour gérer convenablement la disposition des câbles.

source: Cut and strip the wire.
fr_ca: Coupez et dénudez le fil.
ja: ワイヤーを切断し、ストリップします。

source: Using a very small flat screwdriver connect the wires to the power input connector of the roboRIO (red to V, black to C). Also make sure that the power connector is screwed down securely to the roboRIO.
fr_ca: En utilisant le minuscule tournevis à tête plate, connectez les fils aux bornes d'alimentation du roboRIO (rouge à V, noir à C). Assurez aussi que le connecteur d'alimentation est vissé solidement au roboRIO.

source: Power coming from the PDP to the roboRIO.
fr_ca: Alimentation venant du PDP vers le roboRIO.
ja: PDPからroboRIOへの電力配線。

source: Requires: 10A/20A mini fuses, Wire stripper, very small flat screwdriver, 18 AWG (1 :math:`mm^2`) Red and Black
fr_ca: Nécessite: mini-fusibles 10A/20A, pince à dénuder, très petit tournevis plat, 18 AWG (1 :math:`mm^2`) rouge et noir

source: Insert the 10A and 20A mini fuses in the PDP in the locations shown on the silk screen (and in the image above)
fr_ca: Insérez les petits fusibles 10A et 20A dans le PDP aux locations illustrées sur la sérigraphie du PDP (et selon l'image ci-dessus)

source: Strip ~5/16" (~8 mm) on both the red and black 18 AWG (1 :math:`mm^2`) wire and connect to the "Vbat Controller PWR" terminals on the PDB
fr_ca: Dénudez ~ 5/16″ (~ 8 mm) sur le fil rouge et noir 18 AWG (1 :math:`mm^2`) et connectez aux bornes "Vbat Controller PWR" sur le PDB

source: Radio Power
fr_ca: Alimentation de la radio
ja: ラジオの電源

source: Requires: Wire stripper, small flat screwdriver (optional), 18 AWG (1 :math:`mm^2`) red and black wire:
fr_ca: Nécessite: une pince à dénuder, un petit tournevis plat (optionnel), un fil rouge et noir 18 AWG (1 :math:`mm^2`):
ja: 必要なもの：ワイヤーストリッパー、極小マイナスドライバー（オプション）、赤と黒の18AWG (1 :math:`mm^2`) ワイヤー

source: Strip ~5/16" (~8 mm) on the end of the red and black 18 AWG (1 :math:`mm^2`) wire and connect the wire to the corresponding terminals on the PDH.
fr_ca: Dénudez ~5/16" (~8 mm) à l'extrémité du fil rouge et noir 18 AWG (1 :math:`mm^2`) et connectez le fil aux bornes correspondantes du PDH.

source: Strip ~5/16" (~8 mm) on the end of the red and black 18 AWG (1 :math:`mm^2`) wire.
fr_ca: Dénudez ~ 5/16″ (~ 8 mm) à l'extrémité du fil rouge et noir 18 AWG (1 :math:`mm^2`).

source: Connect the wire to one of the two terminal pairs labeled "Vbat VRM PCM PWR" on the PDP.
fr_ca: Connectez les fils à l'une des deux paires de bornes étiquetée "Vbat VRM PCM PWR" sur le PDP.

source: Cut and strip ~5/16" (~8 mm) from the end of the wire.
fr_ca: Coupez et dénudez ~ 5/16″ (~ 8 mm) de l'extrémité du fil.
ja: ワイヤーを切断して、端から約5/16インチ（約8mm）を剥く。

source: Pneumatics Power (Optional)
fr_ca: Alimentation des composantes pneumatiques (optionnel)
ja: 空気圧制御機器の電源 (オプション)

source: Power going from the PDH to the PH.
fr_ca: Alimentation allant du PDH au PH.
ja: PDPからPHへの電力配線。

source: Power going into the PH.
fr_ca: Alimentation allant dans le PH.
ja: 電力配線がPHに接続されます。

source: Requires: Wire stripper, small flat screwdriver (optional), 18 AWG (1 :math:`mm^2`) red and black wire
fr_ca: Nécessite: une pince à dénuder, un petit tournevis plat (en option), un fil rouge et noir 18 AWG (1 :math:`mm^2`)
ja: 必要なもの：ワイヤーストリッパー、小型マイナスドライバー（オプション）、赤と黒の18AWG (1 :math:`mm^2`) ワイヤー

source: The Pneumatics Hub is an optional component used for controlling pneumatics on the robot.
fr_ca: Le hub pneumatique est un composant optionnel utilisé pour contrôler le système pneumatique du robot.
ja: Pneumatics Hubはロボット上での空気制御に使用されるオプションのコンポーネントです。

source: The Pneumatics Hub can be wired to either a non-switchable fused port on the PDH with a 15A or smaller fuse or to a circuit breaker protected port with a breaker up to 20A.
fr_ca: Le hub pneumatique peut être câblé soit à un port à fusible non commutable sur le PDH avec un fusible de 15 A ou moins, soit à un port protégé par disjoncteur avec un disjoncteur jusqu'à 20 A.

source: Connect the wire to the PDH in one of the two ways described above
fr_ca: Connectez le fil au PDH de l'une des deux manières décrites ci-dessus
ja: PDHにワイヤを接続する方法は、上記の2つの方法のいずれかで行う

source: Measure the length required to reach the red terminals on the short end of the PH labeled +/-. Take care to leave enough length to route the wires around any other components such as the battery and to allow for any strain relief or cable management.
fr_ca: Mesurez la longueur nécessaire pour atteindre les bornes rouges sur l'extrémité courte du PH étiquetée +/-. Veillez à laisser suffisamment de longueur pour acheminer les fils autour de tout autre composant tel que la batterie et pour permettre tout soulagement de traction ou gestion des câbles.

source: Cut and strip ~5/16" (~8 mm) from the other end of the wire.
fr_ca: Coupez et dénudez ~5/16" (~8 mm) de l'autre extrémité du fil.
ja: ワイヤーのもう一方の端を切断し、端から約5/16インチ（約8mm）を剥く。

source: Connect the wire to the PH input terminals.
fr_ca: Connectez le fil aux bornes d'entrée PH.
ja: ワイヤをPH入力端子に接続します。

source: Power going from the PDP to the PCM.
fr_ca: Alimentation allant du PDP au PCM.
ja: PDPからPCMへの電力配線。

source: The PCM is an optional component used for controlling pneumatics on the robot.
fr_ca: Le PCM est un composant optionnel utilisé pour contrôler le système pneumatique du robot.
ja: PCMはロボット上での空気制御に使用されるオプションのコンポーネントです。

source: Measure the length required to reach the "Vin" terminals on the PCM. Take care to leave enough length to route the wires around any other components such as the battery and to allow for any strain relief or cable management.
fr_ca: Mesurez la longeur requise pour atteindre les terminaux "Vin" sur le PCM. Prenez soin de laisser une longeur suffisante pour acheminer les fils autours de tout autre composants tel que la batterie et allouez assez de longueur pour gérer convenablement la disposition des câbles.

source: Connect the wire to the PCM 12Vin terminals.
fr_ca: Connectez le fil aux terminaux 12Vin du PCM.
ja: ワイヤをPCMの12Vin端子に接続します。

source: Ethernet Cables
fr_ca: Câbles Ethernet
ja: イーサネットケーブル

source: CAN Devices
fr_ca: Les dispositifs CAN
ja: CANデバイス

source: roboRIO to Pneumatics CAN
fr_ca: Bus CAN du roboRIO au contrôle pneumatique
ja: roboRIOから空気圧制御機器へのCAN接続

source: roboRIO CAN connection.
fr_ca: Connection CAN du roboRIO.
ja: roboRIOのCANの接続端子。

source: PH CAN connection.
fr_ca: Connection CAN du PH.
ja: PHのCANの接続端子。

source: Requires: Wire stripper, small flat screwdriver (optional), yellow/green twisted CAN cable
fr_ca: Necessite: Pince à dénuder, Petit tournevis à tête plate (optionnel), Câble jaune/vert CAN torsadé
ja: 必要なもの：ワイヤーストリッパー、小型マイナスドライバー（オプション）、黄/緑のツイストCANケーブル

source: The PH is an optional component used for controlling pneumatics on the robot. If you are not using the PH, wire the CAN connection directly from the roboRIO (shown in this step) to the PDH (shown in the next step).
fr_ca: Le PH est un composant optionnel utilisé pour contrôler le système pneumatique du robot. Si vous n'utilisez pas le PH, câblez la connexion CAN directement du roboRIO (illustré dans cette étape) au PDH (illustré dans l'étape suivante).

source: Strip ~5/16" (~8 mm) off of each of the CAN wires.
fr_ca: Dénudez ~ 5/16″ (~ 8 mm) de chacun des fils CAN.
ja: 各CANワイヤーから約5/16インチ（約8 mm）剥きます。

source: Insert the wires into the appropriate CAN terminals on the roboRIO (Yellow->YEL, Green->GRN).
fr_ca: Insérez les fils dans les bornes approprié sur le roboRIO (Jaune->YEL, Vert->GRN).
ja: roboRIOの適切なCAN端子にワイヤーを挿入する（黄→YEL、緑→GRN）。

source: Measure the length required to reach the CAN terminals of the PCM (either of the two available pairs). Cut and strip ~5/16" (~8 mm) off this end of the wires.
fr_ca: Mesurez la longueur nécessaire pour atteindre les bornes CAN du PCM (l'une des deux paires disponibles). Coupez et dénudez ~ 5/16″ (~ 8 mm) cette extrémité des fils.

source: Insert the wires into the appropriate color coded CAN terminals on the PH. You may use either of the Yellow/Green terminal pairs on the PH, there is no defined in or out.
fr_ca: Insérez les fils dans les bornes CAN à code couleur appropriées sur le PH. Vous pouvez utiliser l'une ou l'autre des paires de bornes jaune/vert sur le PH, il n'y a pas d'entrée ou de sortie définie.

source: Connecting CAN wire from the roboRIO to the PCM.
fr_ca: Connexion du fil CAN du roboRIO au PCM.
ja: roboRIOからPCMへのCAN配線。

source: The PCM is an optional component used for controlling pneumatics on the robot. If you are not using the PCM, wire the CAN connection directly from the roboRIO (shown in this step) to the PDP (shown in the next step).
fr_ca: Le PCM est un composant optionnel utilisé pour contrôler le système pneumatique du robot. Si vous n'utilisez pas le PCM, câblez la connexion CAN directement du roboRIO (illustré dans cette étape) au PDP (illustré à l'étape suivante).

source: Insert the wires into the appropriate color coded CAN terminals on the PCM. You may use either of the Yellow/Green terminal pairs on the PCM, there is no defined in or out.
fr_ca: Insérez les fils dans les bornes CAN selon le code de couleur approprié sur le PCM. Vous pouvez utiliser n'importe quelle paire de bornes jaune/vert sur le PCM.

source: Pneumatics to PD CAN
fr_ca: Pneumatique vers PD CAN
ja: 空気圧制御機器からPDへのCAN接続

source: The PH is an optional component used for controlling pneumatics on the robot. If you are not using the PH, wire the CAN connection directly from the roboRIO (shown in the above step) to the PDH (shown in this step).
fr_ca: Le PH est un composant optionnel utilisé pour contrôler le système pneumatique du robot. Si vous n'utilisez pas le PH, câblez la connexion CAN directement du roboRIO (illustré dans l'étape ci-dessus) au PDH (illustré dans cette étape).

source: Insert the wires into the appropriate CAN terminals on the PH.
fr_ca: Insérez les fils dans les bornes CAN appropriées du PH.
ja: PHの適切なCAN端子にワイヤーを挿入します。

source: Measure the length required to reach the CAN terminals of the PDH (either of the two available pairs). Cut and strip ~5/16" (~8 mm) off this end of the wires.
fr_ca: Mesurez la longueur nécessaire pour atteindre les bornes CAN du PDH (l'une ou l'autre des deux paires disponibles). Coupez et dénudez ~5/16" (~8 mm) de cette extrémité des fils.

source: Insert the wires into the appropriate color coded CAN terminals on the PDH. You may use either of the Yellow/Green terminal pairs on the PDH, there is no defined in or out.
fr_ca: Insérez les fils dans les bornes CAN à code couleur appropriées sur le PDH. Vous pouvez utiliser l'une ou l'autre des paires de bornes jaune/vert sur le PDH, il n'y a pas d'entrée ou de sortie définie.

source: See the :ref:`CAN Wiring Basics<docs/hardware/hardware-basics/can-wiring-basics:Termination>` if you need to terminate the CAN bus somewhere other than the PDP.
fr_ca: Consultez les :ref:`CAN Wiring Basics<docs/hardware/hardware-basics/can-wiring-basics:Termination>` si vous devez terminer le bus CAN ailleurs que sur le PDP.

source: Connecting the PCM CAN to the PDP.
fr_ca: Connexion du PCM CAN au PDP.
ja: PCMのCAN配線をPDPに接続。

source: The PCM is an optional component used for controlling pneumatics on the robot. If you are not using the PCM, wire the CAN connection directly from the roboRIO (shown in the above step) to the PDP (shown in this step).
fr_ca: Le PCM est un composant optionnel utilisé pour contrôler le système pneumatique du robot. Si vous n'utilisez pas le PCM, câblez la connexion CAN directement du roboRIO (illustré dans l'étape ci-dessus) au PDP (illustré dans cette étape).

source: Insert the wires into the appropriate CAN terminals on the PCM.
fr_ca: Insérez les fils dans les bornes CAN appropriés sur le PCM.
ja: PCMの適切なCAN端子にワイヤーを挿入します。

source: Measure the length required to reach the CAN terminals of the PDP (either of the two available pairs). Cut and strip ~5/16" (~8 mm) off this end of the wires.
fr_ca: Mesurez la longueur nécessaire pour atteindre les bornes CAN du PDP (l'une des deux paires disponibles). Coupez et dénudez ~ 5/16″ (~ 8 mm) cette extrémité des fils.

source: Insert the wires into the appropriate color coded CAN terminals on the PDP. You may use either of the Yellow/Green terminal pairs on the PDP, there is no defined in or out.
fr_ca: Insérez les fils dans les bornes CAN de code couleur approprié sur le PDP. Vous pouvez utilisé n'importe quelle paire de bornes jaune/vert sur le PDP.

source: Motor Controller Signal Wires
fr_ca: Fils de signal du contrôleur de moteur
ja: モーターコントローラーの信号配線

source: PWM Cables going from the roboRIO to the Spark Motor Controller.
fr_ca: Câbles PWM allant du roboRIO au contrôleur de moteur Spark.
ja: PWMケーブルはroboRIOからSparkモーターコントローラーに接続される。

source: This section details how to wire the SPARK MAX controllers using PWM signaling. This is a recommended starting point as it is less complex and easier to troubleshoot than CAN operation. The SPARK MAXs (and many other FRC motor controllers) can also be wired using :ref:`CAN<docs/hardware/hardware-basics/can-wiring-basics:CAN Wiring Basics>` which unlocks easier configuration, advanced functionality, better diagnostic data and reduces the amount of wire needed.
fr_ca: Cette section explique comment brancher les contrôleurs SPARK MAX à l’aide des signaux de commande PWM. Il s’agit d’un point de départ recommandé car il est moins complexe et plus facile à dépanner que le fonctionnement du réseau CAN. Les SPARK MAX (et de nombreux autres contrôleurs de moteurs FRC) peuvent également être câblés à l’aide de :ref:`CAN<docs/hardware/hardware-basics/can-wiring-basics:CAN Wiring Basics>` qui permet une configuration plus facile, les fonctionnalités avancées, de meilleures données de diagnostique et réduit la quantité de fils nécessaires.

source: Requires: 4x SPARK MAX PWM adapters (if using SPARK MAX), 4x PWM cables (if controllers without integrated wires or adapters, otherwise optional), 2x PWM Y-cable (Optional)
fr_ca: Nécessite: 4x adaptateurs SPARK MAX PWM (si vous utilisez SPARK MAX), 4x câbles PWM (si les contrôleurs sont sans fils ou adaptateurs intégrés, autrement facultatif), 2x câble en Y PWM (facultatif)
ja: 必要なもの：SPARK MAX PWM アダプタ4個（SPARK MAXを使用する場合）、PWMケーブル4本（組み込まれたワイヤーまたはアダプタのないコントローラの場合は必須、それ以外の場合はオプション）、PWM Y-ケーブル2本（オプション）

source: Option 1 (Direct connect):
fr_ca: Option 1 (connexion directe):
ja: 選択肢 1（直接接続）：

source: If using SPARK MAX, attach the PWM adapter to the SPARK MAX (small adapter with a 3 pin connector with black/white wires).
fr_ca: Si vous utilisez SPARK MAX, fixez l’adaptateur PWM au SPARK MAX (petit adaptateur avec un connecteur à 3 broches avec fils noirs/blancs).

source: If needed, attach PWM extension cables to the controller or adapter. On the controller side, match the colors or markings (some controllers may have green/yellow wiring, green should connect to black).
fr_ca: Au besoin, attachez des câbles d’extension PWM au contrôleur ou à l’adaptateur. Du côté du contrôleur, faire correspondre les couleurs ou les marques (certains contrôleurs peuvent avoir un câblage vert/jaune, le vert doit se connecter au noir).

source: Attach the other end of the cable to the roboRIO with the black wire towards the outside of the roboRIO. It is recommended to connect the left side to PWM 0 and 1 and the right side to PWM 2 and 3 for the most straightforward programming experience, but any channel will work as long as you note which side goes to which channel and adjust the code accordingly.
fr_ca: Fixez l’autre extrémité du câble au roboRIO avec le fil noir vers l’extérieur du roboRIO. Il est recommandé de connecter le côté gauche à PWM 0 et 1 et le côté droit à PWM 2 et 3 pour concevoir une manipulation de programmation la plus simple, mais n’importe quel canal fonctionnera aussi longtemps que vous notez quel côté va à quel canal et ajuster le code en conséquence.

source: Option 2 (Y-cable):
fr_ca: Option 2 (câble en Y):
ja: 選択肢 2（Yケーブル）：

source: If needed, attach PWM extension cables between the controller or adapter and the PWM Y-cable. On the controller side, match the colors or markings (some controllers may have green/yellow wiring, green should connect to black).
fr_ca: Au besoin, fixez des câbles d’extension PWM entre le contrôleur ou l’adaptateur et le câble en Y de PWM. Du côté du contrôleur, faire correspondre les couleurs ou les marques (certains contrôleurs peuvent avoir un câblage vert/jaune, le vert doit se connecter au noir).

source: Connect 1 PWM Y-cable to the 2 PWM cables for the controllers controlling each side of the robot. The brown wire on the Y-cable should match the black wire on the PWM cable.
fr_ca: Connectez 1 câble en Y PWM aux 2 câbles PWM pour les contrôleurs contrôlant chaque côté du robot. Le fil brun sur le câble en Y doit correspondre au fil noir du câble PWM.

source: Connect the PWM Y-cables to the PWM ports on the roboRIO. The brown wire should be towards the outside of the roboRIO. It is recommended to connect the left side to PWM 0 and the right side to PWM 1 for the most straightforward programming experience, but any channel will work as long as you note which side goes to which channel and adjust the code accordingly.
fr_ca: Connectez les câbles en Y PWM aux ports PWM sur le roboRIO. Le fil brun devrait être vers l'extérieur du roboRIO. Il est recommandé de connectez le côté gauche à PWM 0 et le côté droit à PWM 1 pour pour faciliter la programmation. Cependant, n'importe quel branchement fonctionnera convenablement si vous prenez soin de noter la disposition des PWMs et de changer le code en conséquence.

source: The Spark MAX controllers can also be wired using CAN. When wiring CAN the objective is to create a single complete bus running from the roboRIO on one end and running through all CAN devices on the robot. It is recommended to have either Power Distribution device at the other end of the bus because they have built-in termination. If you do not wish to locate one of these devices at the end of the bus see :ref:`CAN Wiring Basics<docs/hardware/hardware-basics/can-wiring-basics:CAN Wiring Basics>` for info about terminating yourself.
fr_ca: Les contrôleurs Spark MAX peuvent également être câblés via CAN. Lors du câblage CAN, l'objectif est de créer un seul bus complet partant du roboRIO à une extrémité et passant par tous les appareils CAN du robot. Il est recommandé d'avoir l'un ou l'autre des dispositifs de distribution d'alimentation à l'autre extrémité du bus car ils ont une terminaison intégrée. Si vous ne souhaitez pas localiser l'un de ces appareils à l'extrémité du bus, consultez :ref:`CAN Wiring Basics<docs/hardware/hardware-basics/can-wiring-basics:CAN Wiring Basics>` pour plus d'informations sur comment effectuer la terminaison par vous-même.

source: The Spark MAX controllers come with CAN cables that are pre-terminated with connectors. You can chain these cables together directly, or buy or build extension cables to bridge larger gaps. To connect to other CAN devices such as pneumatics controllers, power distribution boards, or the roboRIO you will need to either cut off one of these pre-terminated connectors on the controller, cut off a connector on an extension, or build your own extension with just a single connector.
fr_ca: Les contrôleurs Spark MAX sont livrés avec des câbles CAN pré-terminés par des connecteurs. Vous pouvez brancher ces câbles directement, ou acheter ou construire des rallonges pour combler des espaces plus importants. Pour vous connecter à d'autres appareils CAN tels que des contrôleurs pneumatiques, des cartes de distribution d'énergie ou le roboRIO, vous devrez soit couper l'un de ces connecteurs pré-terminés sur le contrôleur, soit couper un connecteur sur une extension, soit construire votre propre extension avec juste un seul connecteur.

source: When chaining controllers together using the provided connectors, make sure to use the provided retaining clip. If unavailable, secure the connection with a small ziptie, electrical tape, or other similar method.
fr_ca: Lorsque vous reliez les contrôleurs ensemble à l’aide des connecteurs fournis, assurez-vous d’utiliser le clip de retenue fourni. En cas d'indisponibilité, sécurisez la connexion avec une petite attache zip-tie, du ruban isolant ou toute autre méthode similaire.

source: Robot Signal Light
fr_ca: Lumière de Signal du Robot
ja: ロボットの信号灯 - Robot Signal Light

source: Robot Signal Light (rsl) wiring from roboRIO to RSL
fr_ca: Câblage de l'indicateur de signal du robot (RSL) du roboRIO à la RSL
ja: Robot Signal Light (rsl) の配線、roboRIOからRSLへ

source: Requires: Wire stripper, 2 pin cable, Robot Signal Light, 18 AWG (1 :math:`mm^2`) red wire, very small flat screwdriver
fr_ca: Nécessite: Pince à dénuder, Câble à 2 broches, Lumière du signal lumineux du robot, Fil rouge 18 AWG (1 :math:`mm^2`) et un très petit tournevis plat

source: Cut one end off of the 2 pin cable and strip both wires
fr_ca: Coupez une extrémité du câble à 2 broches et dénudez les deux fils
ja: 2ピンケーブルの一方の端を切り落とし、その端の両方のワイヤーを剥く。
