Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/custom-widgets/creating-a-new-widget.po
Languages: tr_tr, zh_cn

source: Creating A Widget
tr_tr: Araç Oluşturma
zh_cn: 创建一个 小部件

source: Widgets allow us to view, change, and interact with data published through different data sources. The CameraServer, NetworkTables, and Base plugins provide the widgets to control basic data types (including FRC-specific data types). However, custom widgets allow us to control our custom data types we made in the previous sections or Java Objects.
tr_tr: Widget - Araçlar, farklı veri kaynakları aracılığıyla yayınlanan verileri görüntülememize, değiştirmemize ve verilerle etkileşim kurmamıza olanak tanımaktadır. CameraServer, NetworkTables ve Base eklentileri, (FRC'ye özgü veri türleri dahil olmak üzere) temel veri türlerini kontrol etmek için pencere öğeleri sağlamaktadır. Bununla birlikte, kişisel araçlar, önceki bölümlerde veya Java Nesnelerinde oluşturduğumuz özel veri türlerimizi kontrol etmemize izin verir.
zh_cn: 小部件使我们能够查看，更改和与通过不同数据源发布的数据进行交互。 CameraServer，NetworkTables 和 Base 插件提供了用于控制基本数据类型（包括特定于 FRC 的数据类型）的小部件。但是，自定义小部件允许我们控制在上一节或 Java 对象中创建的自定义数据类型。

source: The basic ``Widget`` interface inherits from the ``Component`` and ``Sourced`` interfaces. ``Component`` is the most basic building block of components that be displayed in Shuffleboard. ``Sourced`` is an interface for things that can handle and interface with data sources to display or modify data. Widgets that don't support data bindings but simply have child nodes would not use the ``Sourced`` interface but simply the ``Component`` interface. Both are basic building blocks towards making widgets and allows us to modify and display data.
tr_tr: Temel ``Widget`` arayüzü, ``Component`` - Bileşen ve ``Sourced`` - Kaynaklı arayüzlerinin mirasçısıdır. ``Component``, Shuffleboard'da görüntülenebilecek bileşenlerin en temel yapı taşıdır. ``Sourced``, verileri görüntülemek veya değiştirmek için veri kaynaklarını işleyebilen ve bunlarla arayüz oluşturabilen şeyler için bir arayüzdür. Veri bağlamalarını desteklemeyen ancak sadece alt düğümlere sahip olan araçlar ``Sourced`` arayüzü değil, sadece ``Component`` arayüzünü kullanmaktadır. Her ikisi de widget oluşturmaya yönelik temel yapı taşlarıdır ve verileri değiştirip görüntülememizi sağlamaktadır.
zh_cn: 基本的 “Widget” 接口继承自 “Component” 和 “Sourced” 接口。“组件” 是在 Shuffleboard 中显示的最基本的组件构建块。Sourced 是用于处理和显示数据源或修改数据源的接口。不支持数据绑定但仅具有子节点的小部件将不使用 Sourced 接口，而仅使用 Component 接口。两者都是制作小部件的基本构建块，并允许我们修改和显示数据。

source: A good widget allows the end-user to customize the widget to suit their needs. An example could be to allow the user to control the range of the number slider, that is, its maximum and minimum or the orientation of the slider itself. The view of the widget or how it looks is defined using FXML. ``FXML`` is an XML based language that is useful for defining the static layout of the widget (Panes, Labels and Controls).
tr_tr: İyi bir araç, son kullanıcının aracı ihtiyaçlarına göre kişiselleştirmesine olanak tanımaktadır. Bu duruma bir örnek olarak, kullanıcının sayı kaydırıcısının aralığını, diğer bir deyişle maksimum ve minimum aralığını veya kaydırıcının yönünü kontrol etmesine olanak tanıması gösterilebilmektedir. Widget'ın görünümü veya nasıl görüntülendiği FXML kullanılarak tanımlanmaktadır. ``FXML``, aracın statik düzenini (Bölmeler, Etiketler ve Kontroller) tanımlamak için yararlı olan XML tabanlı bir dildir.
zh_cn: 一个好的小部件可以让用户自定义窗口小部件以适应他们的需求。一个示例可能是允许用户控制数字滑块的范围，即其最大和最小值或滑块本身的方向。小部件的视图或其外观是使用 FXML 定义的。FXML 是一种基于 XML 的语言，可用于定义小部件（面板，标签和控件）的静态布局。

source: More about FXML can be found `here <https://openjfx.io/javadoc/11/javafx.fxml/javafx/fxml/doc-files/introduction_to_fxml.html>`_.
zh_cn: 有关 FXML 的更多信息，请参见此处 https://openjfx.io/javadoc/11/javafx.fxml/javafx/fxml/doc-files/introduction_to_fxml.html。

source: Defining a Widget's FXML
tr_tr: Bir Aracın FXML'inin Tanımlanması
zh_cn: 定义小组件的 FXML

source: In this example, we will create two sliders to help us control the X and Y coordinates of our Point2D data type we created in previous sections. It is helpful to place the FXML file in the same package as the Java class.
tr_tr: Bu örnekte, önceki bölümlerde oluşturduğumuz Point2D veri türümüzün X ve Y koordinatlarını kontrol etmemize yardımcı olması için iki kaydırıcı oluşturacağız. FXML dosyasınını Java sınıfıyla aynı pakete yerleştirmeniz faydalı olacaktır.
zh_cn: 在此示例中，我们将创建两个滑块，以帮助我们控制在上一节中创建的 Point2D 数据类型的 X 和 Y 坐标。将 FXML 文件与 Java Class 放在同一包中会很有帮助。

source: In order to create an empty, blank window for our widget, we need to create a ``Pane``. A Pane is a parent node that contains other child nodes, in this case, 2 sliders. There are many different types of Pane, they are as noted:
tr_tr: Aracımız için boş, üzerinde işlem yapılmamış bir pencere oluşturmak için bir ``Pane`` - Bölme oluşturmamız gerekmektedir. Bölme, diğer alt düğümleri, bu durumda 2 kaydırıcıyı içeren bir ana düğümdür. Aşağıda belirtildiği üzere birçok farklı Pane türü vardır:
zh_cn: 为了给我们的小部件创建一个空的空白窗口，我们需要创建一个 “Pane”。Pane 窗格是一个父节点，其中包含其他子节点，在本例中为2个滑块。有许多不同类型的窗格，如下所示：

source: Stack Pane
tr_tr: Stack Pane - Yığın Bölmesi
zh_cn: 堆栈窗格

source: Stack Panes allow elements to be overlaid. Also, StackPanes by default center child nodes.
tr_tr: Stack Pane, öğelerin üst üste bindirilmesine izin vermektedir. Ayrıca, StackPanes varsayılan olarak alt düğümleri ortalamaktadır.
zh_cn: 堆栈窗格允许叠加的元素。另外，默认情况下，堆栈窗格默认为中心子节点。

source: Grid Pane
tr_tr: Grid Pane - Izgara Bölmesi
zh_cn: 网格窗格

source: Grid Panes are extremely useful defining child elements using a coordinate system by creating a flexible grid of rows and columns on the pane.
zh_cn: ”网格窗格“通过在窗格上创建行和列的灵活网格来使用坐标系，在定义子元素非常有用。

source: Flow Pane
tr_tr: Flow Pane - Akış Bölmesi
zh_cn: 流窗格

source: Flow Panes wrap all child nodes at a boundary set. Child nodes can flow vertically (wrapped at the height boundary for the pane) or horizontally (wrapped at the width boundary of the pane).
tr_tr: Flow Pane, tüm alt düğümleri bir sınır kümesinde sarmaktadır. Alt düğümler (pane'in yükseklik sınırına sarılmış) dikey veya (pane'in genişlik sınırına sarılmış) yatay olarak akabilmektedir.
zh_cn: 流窗格将所有子节点都包装在边界集中。子节点可以垂直流动（包裹在窗格的高度边界处）或水平流动（包裹在窗格的宽度边界处）。

source: Anchor Pane
tr_tr: Anchor Pane - Bağlantı Bölmesi
zh_cn: 锚定窗格

source: Anchor Panes allow child elements to be placed in the top, bottom, left side, right side, or center of the pane.
tr_tr: Anchor Pane, alt öğelerin pane'in üstüne, altına, sol tarafına, sağ tarafına veya ortasına yerleştirilmesine izin vermektedir.
zh_cn: 锚定窗格允许把子元素放在上方、下方、左侧、右侧和窗格的中心

source: Layout panes are also extremely useful for placing child nodes in one horizontal row using a `HBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/HBox.html>`_ or one vertical column using a `VBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/VBox.html>`_.
zh_cn: 布局窗格在用 HBox（https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/HBox.html）把子元素放在一行，或用 VBox（https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/VBox.html）把子元素放在一列时，会非常有用。

source: The basic syntax for defining a Pane using FXML would be as the following:
tr_tr: FXML kullanarak bir Pane'i tanımlayan temel sözdizimi aşağıdaki şekildedir:
zh_cn: 使用 FXML 定义窗格的基本语法如下：

source: The ``fx:controller`` attribute contains the name of the widget class. An instance of this class is created when the FXML file is loaded. For this to work, the controller class must have a no-argument constructor.
tr_tr: ``fx: controller`` özniteliği, widget sınıfının adını içermektedir. FXML dosyası yüklendiğinde bu sınıfın bir örneği oluşturulmaktadır. Sınıfın çalışması için, kontrolör sınıfının bağımsız değişken olmayan bir "constructor"a sahip olması gerekmektedir.
zh_cn: fx：controller 属性会包含小组件的类的名称。加载 FXML 文件时，将创建此类的实例。 为此，“控制器”类必须没有实际参数的构造函数。

source: Creating A Widget Class
tr_tr: Widget Sınıfı Oluşturmak
zh_cn: 创建一个小组件类

source: Now that we have a Pane, we can now add child elements to that pane. In this example, we can add two slider objects. Remember to add an ``fx:id`` to each element so they can be referenced in our Java class we will make later on. We will use a ``VBox`` to position our slider on top of each other.
tr_tr: Artık elimizde bir Pane olduğuna göre, şimdi bu pane içerisine alt öğeler ekleyebiliriz. Bu örnekte, iki kaydırıcı nesnesi ekleyebilmekteyiz. Her öğeye bir ``fx:id`` eklemeyi unutmayınız, bu eklenti sayesinde öğeler daha sonra oluşturacağımız Java sınıfımızda referans alınabilirler. Kaydırıcılarımızı üst üste konumlandırmak için bir ``VBox`` kullanacağız.
zh_cn: 现在我们有了一个“窗格”，我们可以将子元素添加到该窗格中。在此示例中，我们可以添加两个滑块对象。记住要在每个元素上添加一个“ fx：id”，以便可以在我们稍后将要创建的Java类中引用。 我们将使用 “VBox” 将滑块放·置在彼此的顶部。

source: Now that we have finished creating our FXML file, we can now create a widget class. The widget class should include a ``@Description`` annotation that states the supported data types of the widget and the name of the widget. If a ``@Description`` annotation is not present, the plugin class must implement the ``get()`` method to return its widgets.
tr_tr: FXML dosyamızı oluşturduğumuza göre, artık bir araç sınıfı oluşturabiliriz. Araç sınıfı, aracın desteklediği veri türlerini ve adını belirten bir ``@Description`` ek açıklaması içermelidir. Bir ``@Description`` ek açıklaması yoksa, eklenti sınıfı, araçlarını döndürmek için ``get ()`` metodu uygulamalıdır.
zh_cn: 现在我们已经完成了 FXML 文件的创建，现在可以创建一个小部件类了。小部件类应包含一个@Description 注释，该注释说明小部件支持的数据类型和小部件名称。如果不存在@Description 注解，则插件类必须实现 get（）方法以返回其小部件。

source: It also must include a ``@ParametrizedController`` annotation that points to the FXML file containing the layout of the widget. If the class that only supports one data source it must extend the ``SimpleAnnotatedWidget`` class. If the class supports multiple data sources, it must extend the ``ComplexAnnotatedWidget`` class. For more information, see :doc:`widget-types`.
tr_tr: Eklenti sınıfı pencere aracının düzenini içeren FXML dosyasına işaret eden bir ``@ParametrizedController`` ek açıklaması da içermelidir. Sınıf yalnızca bir veri kaynağını destekliyorsa, ``SimpleAnnotatedWidget`` sınıfını genişletmelidir. Sınıf birden çok veri kaynağını destekliyorsa, ``ComplexAnnotatedWidget``sınıfını genişletmelidir. Daha fazla bilgi için bkz. : :doc:`widget-types`.
zh_cn: 它还必须包含一个 @ParametrizedController 注释，该注释指向包含小部件布局的 FXML 文件。 如果该类仅支持一个数据源，则必须扩展 SimpleAnnotatedWidget 类。如果该类支持多个数据源，则它必须扩展 ComplexAnnotatedWidget 类。 有关更多信息，请参见：widget-types。

source: If you are not using a custom data type, you can reference any Java data type (ie. ``Double.class``), or if the widget does not need data binding you can pass ``NoneType.class``.
tr_tr: Özel bir veri türü kullanmıyorsanız, herhangi bir Java veri türüne (yani ``Double.class``) başvurabilirsiniz veya araç veri bağlamaya ihtiyaç duymuyorsa, ``NoneType.class`` öğesini iletebilirsiniz.
zh_cn: 如果您没有使用自定义数据类型，则可以引用任何 Java 数据类型（即 Double.class），或者如果小部件不需要数据绑定，则可以传递 NoneType.class。

source: Now that we have created our class we can create fields for the widgets we declared in our FXML file using the ``@FXML`` annotation. For our two sliders, an example would be:
tr_tr: Artık sınıfımızı oluşturduğumuza göre, ``@ FXML`` ek açıklamasını kullanarak FXML dosyamıza eklediğimiz araçlar için alanlar oluşturabiliriz. İki kaydırıcımız özelinde bir örnek aşağıdaki şekildedir:
zh_cn: 现在我们已经创建了类，我们可以使用 @FXML 批注为在 FXML 文件中声明的小部件创建字段。 对于我们的两个滑块，一个示例是：

source: In order to display our pane on our custom widget we need to override the ``getView()`` method and return our ``StackPane``.
tr_tr: Bölmemizi kişisel aracımızda görüntülemek için ``getView()`` metodunu geçersiz kılmamız ve ``StackPane``'i geri almamız gerekmektedir.
zh_cn: 为了在我们的自定义窗口小部件上显示我们的窗格，我们需要重写getView（）方法并返回我们的 Stack Pane。

source: Binding Elements and Adding Listeners
tr_tr: Dinleyicilerin Eklenmesi ve Bağlama Öğeleri
zh_cn: 绑定元素和添加侦听器

source: Binding is a mechanism that allows JavaFX widgets to express direct relationships with the data source. For example, changing a widget will change its related NetworkTableEntry and vise versa.
zh_cn: Binding 是一种机制，它允许 JavaFX 小部件直接表达与数据源的关系。例如，更改窗口小部件将更改其相关的 NetworkTableEntry，反之亦然。

source: An example, in this case, would be changing the X and Y coordinate of our 2D point by changing the values of xSlider and ySlider respectively.
tr_tr: Bu duruma bir örnek, sırasıyla xSlider ve ySlider değerlerini değiştirerek 2B noktamızın X ve Y koordinatlarını değiştirmek olabilir.
zh_cn: 在这种情况下，示例将通过分别更改 xSlider 和 ySlider 的值来更改 2D 点的 X 和 Y 坐标。

source: A good practice is to set bindings in the ``initialize()`` method tagged with the ``@FXML`` annotation which is required to call the method from FXML if the method is not ``public``.
tr_tr: Metod ``public`` değilse, metodu FXML'den çağırmak için gerekli olan ``@FXML`` ek açıklaması ile etiketlenmiş ``initialize()`` metoduna bağlamaları ayarlamak doğru bir uygulama olacaktır.
zh_cn: 一个好的做法是在带有@FXML批注的“ initialize（）”方法中设置绑定，如果该方法不是“ public”，则必须从 FXML 调用该方法。

source: The above ``initialize`` method binds the slider's value property to the ``MyPoint2D`` data class' corresponding X and Y value. Meaning, changing the slider will change the coordinate and vise versa. The ``dataOrDefault.map()`` method will get the data source's value, or, if no source is present, will return the default value.
zh_cn: 上面的 “initialize” 方法将滑块的 value 属性绑定到对应的 X 和 Y 值的 “MyPoint2D” 数据类。这意味着，更改滑块将更改坐标，反之亦然。dataOrDefault.map（）方法将获取数据源的值，或者，如果不存在数据源，则将返回默认值。

source: Using a listener is another way to change values when the slider or data source has changed. For example a listener for our slider would be:
tr_tr: Dinleyici kullanımı, kaydırıcı veya veri kaynağı değiştiğinde değerleri değiştirmenin başka bir yoludur. Örneğin kaydırıcımız için bir dinleyici aşağıdaki gibi olacaktır:
zh_cn: 当滑块或数据源已更改时，使用侦听器是另一种更改值的方法。例如，滑块的侦听器为：

source: In this case, the ``setData()`` method sets the value in the data source of the widget to the ``newValue``.
zh_cn: 在这种情况下，setData（）方法会将小部件的数据源中的值设置为 newValue。

source: Exploring Custom Components
tr_tr: Özel Bileşenlerin Keşfedilmesi
zh_cn: 探索自定义组件

source: Widgets are not automatically discovered when loading plugins; the defining plugin must explicitly export it for it to be usable. This approach is taken to allow multiple plugins to be defined in the same JAR.
zh_cn: 加载插件时不会自动发现窗口小部件；定义插件必须导出它才能使用。采用这种方法可以在同一个 JAR 中定义多个插件。

source: Set Default Widget For Data type
tr_tr: Veri Türü için Varsayılan Aracı Ayarlamak
zh_cn: 设置默认小组件数据类型

source: In order to set your widget as default for your custom data type, you can override the ``getDefaultComponents()`` in your plugin class that stores a Map for all default widgets as noted below:
zh_cn: 为了将小部件设置为自定义数据类型的默认值，您可以覆盖插件类中的 getDefaultComponents（），该类存储所有默认小部件的 Map，如下所示：

source: More about FXML can be found `here <https://openjfx.io/javadoc/11/javafx.fxml/javafx/fxml/doc-files/introduction_to_fxml.html>`__.
tr_tr: FXML'e dair daha fazla biliye `buradan <https://openjfx.io/javadoc/11/javafx.fxml/javafx/fxml/doc-files/introduction_to_fxml.html>`__ ulaşabilirsiniz.

source: Layout panes are also extremely useful for placing child nodes in one horizontal row using a `HBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/HBox.html>`__ or one vertical column using a `VBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/VBox.html>`__.
tr_tr: Layout pane - Düzen bölmeleri, alt düğümleri HBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/HBox.html>`__ kullanılarak tek bir yatay satıra veya `VBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/VBox.html>`__ kullanarak tek bir dikey sütuna yerleştirmek için faydalıdır.

source: Binding is a mechanism that allows JavaFX widgets to express direct relationships with the data source. For example, changing a widget will change its related NetworkTableEntry and vice versa.
tr_tr: Bağlama, JavaFX araçlarının veri kaynağı ile doğrudan bir ilişki ifade etmesine izin veren bir düzenektir. Örneğin aracın değiştirilmesiyle aracın ilgili olduğu NetworkTableEntry'nin değişmesi veya bu ilişkinin tam tersini mümkün kılmaktadır.

source: The above ``initialize`` method binds the slider's value property to the ``MyPoint2D`` data class' corresponding X and Y value. Meaning, changing the slider will change the coordinate and vice versa. The ``dataOrDefault.map()`` method will get the data source's value, or, if no source is present, will return the default value.
tr_tr: Yukarıdaki ``initialize`` metodu kaydırıcının değer özelliğini ``MyPoint2D`` veri sınıfının ilgili X ve Y değerlerine bağlamaktadır. Diğer bir deyişle kaydırıcının değiştirilmesi koordinatları değiştirecek veya bunun tam tersi bir ilişkiyi mümkün kılacaktır. ``dataOrDefault.map()`` metodu veri kaynağının değerini elde edecektir veya hiçbir kaynak mevcut değilse değeri varsayılana döndürecektir.
