Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/custom-widgets/creating-custom-data-types.po
Languages: tr_tr, zh_cn

source: Creating Custom Data Types
tr_tr: Özel Veri Türlerinin Oluşturulması
zh_cn: 创建自定义数据类型

source: Widgets allow us to control and visualize different types of data. This data could be integers and doubles or even Java Objects. In order to display these types of data using widgets, it is helpful to create a container class for them. It is not necessary to create your own Data Class if the widget will handle single fielded data types such as doubles, arrays, or strings.
tr_tr: Widget - Araçlar, farklı veri türlerini kontrol etmemizi ve görselleştirmemize olanak tanımaktadır. Bu veriler tamsayılar ve çiftler hatta Java Nesneleri olabilir. Bu tür verileri araç kullanarak görüntülemek için, verilere özel bir kapsayıcı sınıf oluşturmak faydalı olacaktır. Araç doubles, arrays veya string gibi tek alanlı veri türlerini işleyecekse kendi Data Class - Veri Sınıfınızı oluşturmanız gerekmemektedir.
zh_cn: 小部件使我们能够控制和可视化不同类型的数据。 该数据可以是整数或双精度甚至Java对象。 为这些类型的数据创建一个容器类会帮助小部件显示它们。 如果窗口小部件将处理单个字段数据类型（例如，双精度，数组或字符串），则无需创建自己的数据类。

source: Creating The Data Class
tr_tr: Veri Sınıfının Oluşturulması
zh_cn: 创建数据类

source: In this example, we will create a custom data type for a 2D Point and its x and y coordinates. In order to create a custom data type class, it must extend the abstract class `ComplexData <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/data/ComplexData.java>`__. Your custom data class must also implement the ``asMap()`` method that returns the represented data as a simple map as noted below with the ``@Override`` annotation:
tr_tr: Bu örnekte 2D Point - 2 boyutta bir nokta ile bu noktanın x ve y koordinatları için kişisel bir veri türü oluşturacağız. Bu sınıfı oluşturmak için, veri türü sınıfı `ComplexData <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/data/ComplexData.java>`__ soyut sınıfını genişletmelidir. Ayrıca kişisel veri sınıfınız, aşağıdaki ``@Override`` ek açıklamasında da belirtildiği üzere, temsil edilen veriyi basit bir haritaya döndüren ``asMap()`` metodunu gerçekleştirmeniz gerekmektedir:

source: It is also good practice to override the default ``equals`` and ``hashcode`` methods to ensure that different objects are considered equivalent when their fields are the same. The ``asMap()`` method should return the data represented in a simple Map object as it will be mapped to the NetworkTables entry it corresponds to. In this case, we can represent the point as its X and Y coordinates and return a ``Map`` containing them.
tr_tr: Alanları eşleştiğinde farklı nesnelerin eşit sayılmasını sağlamak için varsayılan ``equals`` ve ``hashcode`` metodlarını geçersiz kılmak iyi bir uygulama olacaktır. ``asMap()`` metodu, ilgili oldukları NetworkTables girişine eşlenecekleri için temsil edilen verileri basit birer Map object - Harita nesnesine döndürmelidir. Bu durumda noktayı X ve Y koordinatları şeklinde temsil edebilir ve bu koordinatları içeren bir ``Map`` döndürebiliriz.
zh_cn: 覆盖默认的“equals”和“hashcode”方法也是一种很好的做法，以确保不同的对象在其字段相同时被认为是等效的。 ``asMap()`` 方法应该返回以简单 Map 对象表示的数据，因为它将被映射到它对应的 NetworkTables 条目。在这种情况下，我们可以将点表示为其 X 和 Y 坐标，并返回一个包含它们的“地图”。

source: Other methods can be added to retrieve or edit fields and instance variables, however, it is good practice to make these classes immutable to prevent changing the source data objects. Instead, you can make a new copy object instead of manipulating the existing object. For example, if we wanted to change the y coordinate of our point, we can define the following method:
tr_tr: Alanları ve örnek değişkenlerine erişim sağlamak veya değişkenleri düzenlemek için başka yöntemler eklenebilmekte, ancak kaynak veri nesnelerinin değiştirilmesini önlemek için bu sınıfları değişmez yapmak iyi bir uygulama olacaktır. Bunun yerine, mevcut nesneyi değiştirmek yerine yeni bir kopya nesnesi oluşturabilirsiniz. Örneğin, noktamızın y koordinatını değiştirmek istersek, aşağıdaki yöntemi tanımlayabiliriz:
zh_cn: 可以添加其他方法来检索或编辑字段和实例变量，但是，优良作法是使这些类不可变以防止更改源数据对象。 相反，您可以创建一个新的副本对象，而不是操纵现有对象。 例如，如果要更改点的y坐标，则可以定义以下方法：

source: This creates a new ``MyPoint2D`` object and returns it with the new y-coordinate. Same can be done for changing the x coordinate.
tr_tr: Bu, yeni bir ``MyPoint2D`` nesnesi oluşturmakta ve onu yeni y koordinatı ile döndürmektedir. Aynı işlem x koordinatını değiştirmek için de yapılabilmektedir.
zh_cn: 这将创建一个新的MyPoint2D对象，并以新的y坐标返回它。 更改x坐标时也可以这样做。

source: Creating a Data Type
tr_tr: Veri Türü Oluşturmak
zh_cn: 创建数据类型

source: There are two different data types that can be made: Simple data types that have only one field (ie. a single number or string), and Complex data types that have multiple data fields (ie. multiple strings, multiple numbers).
tr_tr: Oluşturulabilecek iki farklı veri türü vardır: yalnızca bir alana (yani, tek bir sayı veya dizgeye) sahip basit veri türleri ve birden fazla veri alanına (yani, birden çok dizgi, birden çok sayıya) sahip karmaşık veri türleri.
zh_cn: 可以创建两种不同的数据类型：仅具有一个字段（即单个数字或字符串）的简单数据类型，以及具有多个数据字段（即多个字符串，多个数字）的复杂数据类型。

source: In order to define a simple data type, the class must extend the ``SimpleDataType<DataType>`` class with the data type needed and implement the ``getDefaultValue()`` method. In this example, we will use a double as our simple data type.
tr_tr: Basit bir veri türü tanımlamak için, sınıfın gerekli veri türü ile ``SimpleDataType <DataType>`` sınıfını genişletmesi ve ``getDefaultValue()`` metodunu uygulaması gerekmektedir. Bu örnekte, basit veri tipimiz olarak bir double kullanacağız.
zh_cn: 为了定义一个简单的数据类型，该类必须用所需的数据类型扩展“ SimpleDataType<DataType>”类，并使用“ getDefaultValue（）”方法。 在此示例中，我们将使用double作为我们的简单数据类型。

source: The class constructor is set to private to ensure that only a single instance of the data type will exist.
tr_tr: Sınıf constructor, yalnızca tek bir veri türü örneğinin var olmasını sağlamak için "özel" ayarına alınmaktadır.
zh_cn: 将类构造函数设置为私密，以确保仅存在数据类型的单个实例。

source: In order to define a complex data type, the class must extend the ``ComplexDataType`` class and override the ``fromMap()`` and ``getDefaultValue()`` methods. We will use our MyPoint2D class as an example to see what a complex data type class would look like.
tr_tr: Karmaşık bir veri türü tanımlamak için, sınıfın ``ComplexDataType`` sınıfını genişletmesi ve ``fromMap()`` ve ``getDefaultValue()`` metodlarını geçersiz kılması gerekmektedir. Karmaşık bir veri türü sınıfının nasıl gözükeceğini önceden görmek için MyPoint2D sınıfımızı örnek olarak kullanacağız.
zh_cn: 为了定义复杂的数据类型，该类必须扩展“ComplexDataType”类，并覆盖“fromMap（）”和“getDefaultValue（）”方法。 我们将以MyPoint2D类为例，以了解复杂数据类型类的外观。

source: The following code above works as noted:
tr_tr: Yukarıdaki kod, aşağıda belirtilen şekilde çalışmaktadır:
zh_cn: 上面的以下代码按规定工作：

source: The ``fromMap()`` method creates a new MyPoint2D using the values in the NetworkTables entry it is bound to. The ``getOrDefault`` method will return 0.0 if it cannot get the entry values. The ``getDefaultValue`` will return a new ``MyPoint2D`` object if no source is present.
tr_tr: ``fromMap()`` metodu, bağlandığı NetworkTables girişindeki değerleri kullanarak yeni bir MyPoint2D oluşturmaktadır. ``getOrDefault` metodu, giriş değelerine erişemezse 0.0 olarak dönecektir. ``getDefaultValue`` herhangi bir kaynak yoksa yeni bir ``MyPoint2D`` nesnesi döndürecektir.
zh_cn: ``fromMap()`` 方法使用它绑定到的 NetworkTables 条目中的值创建一个新的 MyPoint2D。如果无法获取条目值，``getOrDefault`` 方法将返回 0.0。如果不存在源，``getDefaultValue`` 将返回一个新的``MyPoint2D`` 对象。

source: Exporting Data Type To Plugin
tr_tr: Veri Türünü Eklentiye Aktarma
zh_cn: 将数据类型导出到插件

source: In order to have the data type be recognized by Shuffleboard, the plugin must export them by overriding the ``getDataTypes`` method. For example,
tr_tr: Veri türünün Shuffleboard tarafından tanınması için, eklentinin ``getDataTypes`` metodunu geçersiz kılarak veri türlerini dışa aktarması gerekmektedir. Örneğin,
zh_cn: 为了让Shuffleboard能够识别数据类型，插件必须通过覆盖“getDataTypes”的方法来导出它们。 例如，

source: In this example, we will create a custom data type for a 2D Point and its x and y coordinates. In order to create a custom data type class, it must extend the abstract class `ComplexData <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/data/ComplexData.java>`_. Your custom data class must also implement the ``asMap()`` method that returns the represented data as a simple map as noted below with the ``@Override`` annotation:
zh_cn: 在此示例中，我们将为 2D 点及其 x 和 y 坐标创建自定义数据类型。为了创建自定义数据类型类，它必须扩展抽象类`ComplexData <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard /api/data/ComplexData.java>`_.您的自定义数据类还必须实现 ``asMap()`` 方法，该方法将表示的数据作为简单地图返回，如下所述，带有 ``@Override`` 批注：
