Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/custom-widgets/creating-plugins.po
Languages: tr_tr, zh_cn

source: Creating a Plugin
tr_tr: Bir Eklenti Oluşturmak
zh_cn: 创建一个插件

source: Overview
tr_tr: Genel Bakış
zh_cn: 概述

source: Plugins provide the ability to create custom widgets, layouts, data sources/types, and custom themes. Shuffleboard provides the following :ref:`built-in plugins <docs/software/dashboards/shuffleboard/custom-widgets/builtin-plugins:Built-in Plugins>`.
tr_tr: Eklentiler, kişisel araçların, düzenlerin, veri kaynakları/türlerinin ve kişiselleştirilmiş temaların oluşturulmasına imkan tanımaktadır. Shuffleboard, aşağıdaki :ref:`gömülü eklentileri <docs/software/dashboards/shuffleboard/custom-widgets/builtin-plugins:Built-in Plugins>` sağlamaktadır.
zh_cn: 插件提供了创建自定义小部件、布局、数据源/类型和自定义主题的能力。 Shuffleboard 提供以下:ref:`内置插件<docs/software/dashboards/shuffleboard/custom-widgets/builtin-plugins:Built-in Plugins>`。

source: NetworkTables Plugin: To connect to data published over NetworkTables
zh_cn: NetworkTables Plugin: 用于连接通过网络传输的数据

source: Base Plugin: To display custom FRC\ |reg| data types in custom widgets
zh_cn: Base Plugin: 用于展示自定义的FRC\ |reg| 在自定义小配件里的数据分类

source: CameraServer Plugin: To view streams from the CameraServer
zh_cn: CameraServer Plugin: 用于观察从照相服务器传来的数据

source: An example custom Shuffleboard plugin which creates a custom data type and a simple widget for displaying it can be found `here <https://github.com/wpilibsuite/shuffleboard/tree/main/example-plugins/custom-data-and-widget>`__.
zh_cn: 创建自定义数据类型的示例自定义 Shuffleboard 插件和用于显示它的简单小部件可以在这里找到 <https://github.com/wpilibsuite/shuffleboard/tree/main/example-plugins/custom-data-and-widget>`__。

source: Create a Custom Plugin
zh_cn: 创建一个自定义插件

source: In order to define a plugin, the plugin class must be a subclass of `edu.wpi.first.shuffleboard.api.Plugin <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/plugin/Plugin.java>`_ or one of its subclasses. An example of a plugin class would be as following.
zh_cn: 为了定义插件，插件类必须是`edu.wpi.first.shuffleboard.api.Plugin <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/plugin/Plugin.java>`_ 或其子类之一。插件类的示例如下。

source: Additional explanations on how these attributes are used, including version numbers can be found `here <https://semver.org/>`_.
zh_cn: 有关如何使用这些属性（包括版本号）的其他说明，请参见“此处<https://semver.org/>” _。

source: Note the ``@Description`` annotation is needed to tell the plugin loader the properties of the custom plugin class. Plugin classes are permitted to have a default constructor but it cannot take any arguments.
zh_cn: 请注意，需要@Description注释来告知插件加载程序自定义插件类的属性。允许插件类具有默认构造函数，但不能接受任何参数。

source: Building plugin
zh_cn: 建筑插件

source: Plugins require the usage of the `Shuffleboard API Library <https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/shuffleboard/api/>`_. These dependencies can be resolved in the ``build.gradle`` file or using maven. The dependencies would be as follows:
zh_cn: 插件要求使用`Shuffleboard API库<https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/shuffleboard/api/>`_。这些依赖关系可以在build.gradle文件中或使用maven解决。依赖关系如下：

source: For Gradle:
zh_cn: 对于Gradle：

source: Plugins are allowed to have dependencies on other plugins and libraries, however, they must be included correctly in the maven or gradle build file. When a plugin depends on other plugins, it is good practice to define those dependencies so the plugin does not load when the dependencies do not load as well. This can be done using the ``@Requires`` annotation as shown below:
zh_cn: 允许插件依赖于其他插件和库，但是，它们必须正确包含在maven或gradle构建文件中。当一个插件依赖于其他插件时，最好定义这些依赖项，以便在依赖项也未加载时不加载该插件。这可以使用@Requires注释完成，如下所示：

source: The ``minVersion`` specifies the minimum allowable version of the plugin that can be loaded. For example, if the ``minVersion`` is 1.4.5, and the plugin with the version 1.4.7 is loaded, it will be allowed to do so. However, if the plugin with the version 1.2.4 is loaded, it will not be allowed to since it is less than the ``minVersion``.
zh_cn: minVersion指定可加载的插件的最低允许版本。例如，如果“ minVersion”为1.4.5，并且加载了版本为1.4.7的插件，则将允许这样做。但是，如果加载了版本1.2.4的插件，由于它小于``minVersion``，因此将不允许这样做。

source: Deploying Plugin To Shuffleboard
zh_cn: 将插件部署到沙狐球

source: In order to load a plugin in Shuffleboard, you will need to generate a jar file of the plugin and put it in the ``~/Shuffleboard/plugins`` folder. This can be done automatically from gradle as noted:
zh_cn: 为了在Shuffleboard中加载插件，您将需要生成插件的jar文件，并将其放置在〜/ Shuffleboard / plugins文件夹中。可以按照如下所述从gradle自动完成：

source: The path to your Shuffleboard plugin folder will most likely be ``~/Shuffleboard/plugins``.
zh_cn: Shuffleboard插件文件夹的路径很可能是``〜/ Shuffleboard / plugins''。

source: The ``deployPlugin`` task takes four parameters, the ``type: Copy`` parameter makes the task implement the `CopySpec <https://docs.gradle.org/current/javadoc/org/gradle/api/file/CopySpec.html>`_ interface specifying what to copy. The group and description parameters to specify what the Group ID of the plugin is and a short descriptive description to what the Plugin does.
zh_cn: 任务“ deployPlugin”具有四个参数，“类型：复制”参数使该任务实现“ CopySpec <https://docs.gradle.org/current/javadoc/org/gradle/api/file/CopySpec.html>” _接口，指定要复制的内容。组和描述参数，用于指定插件的组ID是什么，以及对插件的简短描述。

source: In the body, the ``from`` field specifies from where the file is to be copied from, followed by the ``into`` field specifying the destination to where the file needs to be copied to. Finally, the ``include`` field ensures all files with the ``.jar`` extension is also copied.
zh_cn: 在主体中，“ from”字段指定要从中复制文件的位置，然后是“ into”字段，该位置指定要将文件复制到的目标位置。最后，include字段确保所有扩展名为.jar的文件也被复制。

source: After deploying, Shuffleboard will cache the path of the plugin so it can be automatically loaded the next time Shuffleboard loads. It may be necessary to click on ``Clear Cache`` under the plugins menu to remove a plugin or reload a plugin into Shuffleboard.
zh_cn: 部署后，Shuffleboard将缓存插件的路径，以便下次Shuffleboard加载时可以自动加载。可能需要单击插件菜单下的``清除缓存''以删除插件或将插件重新加载到Shuffleboard中。

source: By running ``gradle deployPlugin`` from the command line, the jar file will automatically placed into the Shuffleboard plugin folder.
zh_cn: 通过从命令行运行gradle deployPlugin，jar文件将自动放置到Shuffleboard插件文件夹中。

source: Manually Adding Plugin
zh_cn: 手动添加插件

source: The other way to add a plugin to Shuffleboard is to compile it to a jar file and add it from Shuffleboard. First, compile your plugin into a ``.jar`` file using Maven or Gradle. Then, open Shuffleboard, click on the file tab in the top left, and choose Plugins from the drop down menu.
zh_cn: 将插件添加到Shuffleboard的另一种方法是将其编译为jar文件，然后从Shuffleboard添加它。首先，使用Maven或Gradle将您的插件编译为.jar文件。然后，打开Shuffleboard，单击左上角的文件选项卡，然后从下拉菜单中选择插件。

source: Manually adding custom plugins
tr_tr: Kişiselleştirilmiş eklentilerin elle eklenmesi
zh_cn: 手动添加自定义插件

source: From the plugins window, choose the "Load plugin" button in the bottom right, and select your jar file.
zh_cn: 在插件窗口中，选择右下角的“加载插件”按钮，然后选择您的jar文件。

source: In order to define a plugin, the plugin class must be a subclass of `edu.wpi.first.shuffleboard.api.Plugin <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/plugin/Plugin.java>`__ or one of its subclasses. An example of a plugin class would be as following.
tr_tr: Bir eklenti tanımlamak için eklenti sınıfı `edu.wpi.first.shuffleboard.api.Plugin <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/plugin/Plugin.java>`__ altı sınıfı veya alt sınıfın bir alt sınıfı olmalıdır. Bir eklenti sınıfı örneği aşağıdaki gibi olacaktır.

source: Additional explanations on how these attributes are used, including version numbers can be found `here <https://semver.org/>`__.
tr_tr: Sürüm numaraları da dahil olmak üzere, bu özniteliklerin nasıl kullanıldığına dair daha fazla açıklamaya `buradan <https://semver.org/>`__ ulaşabilirsiniz.

source: The easiest way to build plugins is to utilize the `example-plugins` folder in the shufflebloard source tree. Clone Shuffleboard with ``git clone https://github.com/wpilibsuite/shuffleboard.git``, and checkout the version that corresponds to the WPILib version you have installed (e.g. 2023.2.1). ``git checkout v2023.2.1``
tr_tr: Bir eklenti oluşturmanın en kolay yolu shufflebloard kaynak ağıcındaki* `example-plugins` klasörünü kullanmaktır. ``Git clone https://github.com/wpilibsuite/shuffleboard.git`` kullanrak Shuffleboard'u kopyalayınız ve cihazınızda yüklü olan WPILib sürümü ile eşleşen sürümü kitaplıktan seçiniz (örn. 2023.2.1). ``git checkout v2023.2.1``

source: Put your plugin in the ``example-plugins\PLUGIN-NAME`` directory. Copy the ``custom-data-and-widget.gradle`` from ``example-plugins\custom-data-and-widget`` and rename to match your plugin name. Edit ``settings.gradle`` in the shuffleboard root directory to add ``include "example-plugins:PLUGIN-NAME"``
tr_tr: Eklentinizi ``example-plugins\PLUGIN-NAME`` veri havuzuna ekleyiniz. ``example-plugins\custom-data-and-widget`` üzerinden ``custom-data-and-widget.gradle``'ı koyalayınız ve eklentinizin adıyla eşleşecek şekilde kopyaladığınız dosyayı yeniden adlandırınız. Shuffleboard kök dizinindeki ``settings.gradle``'ı, ``include "example-plugins:PLUGIN-NAME"``'i ekleyecek şekilde düzenleyiniz.

source: In order to load a plugin in Shuffleboard, you will need to generate a jar file of the plugin and put it in the ``~/Shuffleboard/plugins`` folder. This can be done automatically by running from the shuffleboard root ``gradlew :example-plugins:PLUGIN-NAME:installPlugin``
tr_tr: Shuffleboard'a eklenti aktarmak için eklentinin bir jar dosyaysı halini oluşturmanız ve oluşturduğunuz dosyayı ``~/Shuffleboard/plugins`` klasörüne eklemeniz gerekecektir. Bu işlem Shuffleboard kökünden ``gradlew :example-plugins:PLUGIN-NAME:installPlugin``'in çalıştırılmasıyla kendi kendiliğine gerçekleştirilebilmektedir.

source: The other way to add a plugin to Shuffleboard is to compile it to a jar file and add it from Shuffleboard. The jar file is located in ``example-plugins\PLUGIN-NAME\build\libs`` after running ``gradlew build`` in the shuffleboard root Open Shuffleboard, click on the file tab in the top left, and choose Plugins from the drop down menu.
tr_tr: Shuffleboard'a eklenti eklemenin bir diğer yoluysa eklentiyi jar dosyası olarak derlemek ve Shuffleboard üzerinden eklemektir. Jar dosyası shuffleboard kökü Open Shuffleboard'da ``gradlew build``'ın çalıştırılmasını takiben ``example-plugins\PLUGIN-NAME\build\libs`` bulunmaktadır, sol üstteki dosya sekmesine tıklayıp açılır listedeki Plugins - Eklentiler seçeneğini seçiniz.
