Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/custom-widgets/custom-themes.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Custom Themes
es_mx: Temas Personalizados
fr_ca: Thèmes personnalisés
tr_tr: Kişisel Temalar
zh_cn: 自定义主题

source: Since shuffleboard is a JavaFX application, it has support for custom themes via Cascading Stylesheets (**CSS** for short). These are commonly used on webpages for making HTML look nice, but JavaFX also has ,support, albeit for a different language subset (see `here <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/doc-files/cssref.html>`_ for documentation on how to use it).
fr_ca: Le shuffleboard étant une application programmée en JavaFX, il prend en charge les thèmes personnalisés via des feuilles de style en cascade (**CSS** pour simplifier le texte). Ceux-ci sont couramment utilisés sur les pages Web pour rendre le HTML agréable, mais JavaFX gère également, bien que pour un sous-ensemble de langages différents (référez-vous `ici <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/doc-files/cssref.html>`_ pour la documentation relative à son utilisation).
zh_cn: 由于shuffleboard是JavaFX应用程序，因此它通过级联样式表（简称** CSS **）支持自定义主题。这些通常在网页上用于使HTML看起来不错，但是JavaFX也具有支持，尽管它支持不同的语言子集（有关如何使用它的文档，请参见此处的“ <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/doc-files/cssref.html>” _）。

source: Shuffleboard comes with three themes by default: Material Light, Material Dark, and Midnight. These are color variations on the same material design stylesheet. In addition, they inherit from a ``base.css`` stylesheet that defines styles for the custom components ,defined in shuffleboard or libraries that it uses; the base material design stylesheet only applies to the UI components built into JavaFX.
es_mx: La shuffleboard viene con tres temas por defecto: Material Light, Material Dark y Midnight. Estas son variaciones de color en la misma hoja de estilo de diseño de material. Además, heredan de una hoja de estilo``base.css`` que define estilos para los componentes personalizados, definidos en shuffleboard o bibliotecas que utiliza; la hoja de estilo de diseño de material base solo se aplica a los componentes de la interfaz de usuario integrados en JavaFX.
fr_ca: Shuffleboard est livré avec trois thèmes par défaut: Material Light, Material Dark et Midnight. Ce sont des variations de couleur sur la même feuille de style de conception matérielle. De plus, ils héritent d'une feuille de style ``base.css`` qui définit les styles des composants personnalisés, définis dans Shuffleboard ou les librairies qu'il utilise; la feuille de style de conception du matériau de base s'applique uniquement aux composants d'interface utilisateur intégrés à JavaFX.
tr_tr: Shuffleboard varsayılan olarak üç temayla içermektedir: Material Light, Material Dark ve Midnight. Bunlar, aynı malzeme tasarım stylesheet - stil sayfasındaki renk çeşitleridir. Ayrıca, shuffleboard veya kullandıkları kitaplıklarda tanımlanan özel bileşenler için stilleri tanımlayan bir ``base.css`` stylesheet'in mirasçılarıdır; temel malzeme tasarım stylesheet yalnızca JavaFX'te gömülü olan arayüz bileşenleri için geçerlidir.
zh_cn: Shuffleboard 默认带有三个主题：浅色，深色和午夜。这些是同一材料设计样式表上的颜色变化。另外，它们继承自base.css样式表，该样式表定义了自定义组件的样式，这些样式在沙狐球板或所使用的库中定义；基础材料设计样式表仅适用于JavaFX中内置的UI组件。

source: There are two ways to define a custom theme: place the stylesheets in a directory with the name of the theme in ``~/Shuffleboard/themes``; for example, a theoretical "Yellow" theme could be placed in
es_mx: Hay dos maneras de definir un tema personalizado: colocar las hojas de estilo en un directorio con el nombre del tema en ``~/Shuffleboard/themes``; por ejemplo, un tema teórico "Amarillo" podría colocarse ahí
fr_ca: Il existe deux façons de définir un thème personnalisé: placer les feuilles de style dans un répertoire avec le nom du thème dans ``~/Shuffleboard/themes``; par exemple, un thème théorique "Yellow" pourrait être placé dans
tr_tr: Kişisel bir tema belirlemenin iki yolu vardır: stylesheet'lerin ``~/Shuffleboard/themes`` içerisinde temanın ismine sahip bir dizine aktarılması; örneğin, teorik bir "Sarı" tema aşağıdaki dizine aktarılabilir:
zh_cn: 定义自定义主题有两种方法：将样式表放在“~/Shuffleboard/themes”中主题名称的目录中；例如，理论上的“黄色”主题可以放在

source: All the stylesheets in the directory will be treated as part of the theme.
es_mx: Todas las hojas de estilo del directorio se tratarán como parte del tema.
fr_ca: Toutes les feuilles de style du répertoire seront traitées comme faisant partie du thème.
tr_tr: Dizindeki tüm stylesheet'ler temanın bir parçası olarak ele alınacaktır.
zh_cn: 目录中的所有样式表将被视为主题的一部分。

source: Loading Themes via Plugins
es_mx: Cargar Temas a través de Complementos
fr_ca: Chargement de thèmes via des plugins
tr_tr: Eklentiler Aracılığıyla Temaların Yüklenmesi
zh_cn: 通过插件加载主题

source: Custom themes can also be defined by plugins. This makes them easier to share and bundle with custom widgets, but are slightly more difficult to define. The theme object will need a reference to a class defined in the plugin so that the plugin loader can determine where the stylesheets are located. If a class is passed that is *not* present in the JAR that the plugin is in, the theme will not be able to be used.
es_mx: Los temas personalizados también se pueden definir mediante complementos/plugins. Esto hace que sea más fácil compartirlos y agruparlos con widgets personalizados, pero son un poco más difíciles de definir. El objeto de tema necesitará una referencia a una clase definida en el complemento para que el cargador del complemento pueda determinar dónde se encuentran las hojas de estilo. Si se pasa una clase que *no* está presente en el JAR en el que se encuentra el complemento, el tema no podrá utilizarse.
fr_ca: Les thèmes personnalisés peuvent également être définis par des plugins. Cela les rend plus faciles à partager et à regrouper avec des widgets personnalisés, mais est légèrement plus difficile à définir. L'objet de thème aura besoin d'une référence à une classe définie dans le plugin afin que le chargeur de plugin puisse déterminer où se trouvent les feuilles de style. Si une classe est transmise qui n'est *pas* présente dans le JAR dans lequel se trouve le plugin, le thème ne pourra pas être utilisé.
tr_tr: Kişisel temalar, eklentiler tarafından da tanımlanabilmektedir. Bu, temaların kişisel araçlarla gönderimi ve paketlemeyi kolaylaştırmakta, ancak tanımlanmayı biraz zorlaştırmaktadır. Eklenti yükleyicinin stylesheet'lerin nerede bulunduğunu belirleyebilmesi için tema nesnesinin, eklentide tanımlanan bir sınıfa referans olması gerekmektedir. Eklentinin içinde bulunduğu JAR'da *bulunmayan* bir sınıf iletilirse, tema kullanılamayacaktır.
zh_cn: 自定义主题也可以由插件定义。这使它们更易于与自定义窗口小部件共享和捆绑，但定义起来却稍微困难一些。主题对象将需要对插件中定义的类的引用，以便插件加载器可以确定样式表的位置。如果传递的类在插件所在的JAR中不存在，则将无法使用该主题。

source: Modifying or Extending Shuffleboard’s Default Themes
es_mx: Modificar o Ampliar los Temas Predeterminados de la Shuffleboard
fr_ca: Modifier ou étendre les thèmes par défaut du Shuffleboard
tr_tr: Shuffleboard’un Varsayılan Temalarının Değiştirilmesi veya Genişletilmesi
zh_cn: 修改或扩展Shuffleboard的默认主题

source: Shuffleboard’s Material Light and Material Dark themes provide a lot of the framework for light and dark themes, respectively, as well as many styles specific to shuffleboard, ControlsFX, and Medusa UI components to fit with the material-style design.
es_mx: Los temas Material Light y Material Dark de la Shuffleboard proporcionan una gran parte del marco para los temas claros y oscuros, respectivamente, así como muchos estilos específicos de los componentes de la interfaz de usuario de la Shuffleboard, ControlsFX y Medusa para adaptarse al diseño de estilo material.
fr_ca: Les thèmes Material Light et Material Dark de Shuffleboard fournissent une grande partie du cadre pour les thèmes clairs et sombres, respectivement, ainsi que de nombreux styles spécifiques aux composants de shuffleboard, ControlsFX et Medusa UI pour s'adapter à la conception selon le style du matériau.
tr_tr: Shuffleboard’un Material Light ve Material Dark temaları, sırasıyla açık ve koyu temalar için çok sayıda çerçeve ve malzeme tarzı tasarıma uyacak şekilde disk iteleme panosu, ControlsFX ve Medusa UI bileşenlerine özgü birçok stil sağlamaktadır.
zh_cn: Shuffleboard的Material Light和Material Dark主题分别为亮色和深色主题提供了很多框架，以及针对Shuffleboard，ControlsFX和Medusa UI组件的许多特定样式，以适应材料样式设计。

source: Themes that want to modify these themes need to add ``import`` statements for these stylesheets:
es_mx: Los temas que quieran modificar estos temas deben agregar declaraciones de ``import`` para estas hojas de estilo:
fr_ca: Les thèmes qui souhaitent modifier ceci doivent ajouter des instructions ``import`` pour ces feuilles de style:
tr_tr: Bu temaları değiştirmek isteyen temaların, aşağıdaki stil sayfaları için ``import`` - içe aktarma ifadelerini eklemesi gerekmektedir:
zh_cn: 想要修改这些主题的主题需要为这些样式表添加“ import”语句 ：

source: Note that ``base.css`` internally imports ``material.css``, and ``light.css``, ``dark.css``, and ``midnight.css`` all import ``base.css``, so importing ``light.css`` will implicitly import both ``base.css`` and ``material.css`` as well.
es_mx: Tenga en cuenta que ``base.css`` importa internamente ``material.css``, y ``light.css``, ``dark.css`` y ``midnight.css`` todos importan ``base.css``, por lo que la importación ``light.css`` también importará implícitamente tanto ``base.css`` como ``material.css``.
fr_ca: Notez que ``base.css`` importe en interne ``material.css``, et ``light.css``, ``dark.css``, et ``midnight.css`` importent tous ``base.css``, donc l'importation de ``light.css`` importera implicitement à la fois ``base.css`` and ``material.css``.
zh_cn: 请注意，base.css内部会导入material.css和light.css，dark.css和midnight.css都将导入base。 css”，因此导入“ light.css”将隐式导入“ base.css”和“ material.css”。

source: Source Code for the CSS Files
es_mx: Código Fuente para los Archivos CSS
fr_ca: Code source pour les fichiers CSS
zh_cn: CSS文件的源代码

source: Material Design Color Swatches
es_mx: Muestras de Color del Diseño del Material
fr_ca: Échantillons de couleur de conception matérielle
zh_cn: 材质设计颜色色板

source: The material design CSS uses color swatch variables for almost everything. These variables can be set from custom CSS files, reducing the amount of custom code needed.
es_mx: El diseño CSS del material utiliza variables de muestra de color para casi todo. Estas variables se pueden configurar desde los archivos CSS personalizados, lo que reduce la cantidad de código personalizado necesario.
fr_ca: Le CSS de conception matérielle utilise des variables d'échantillons de couleurs pour presque tout. Ces variables peuvent être définies à partir de fichiers CSS personnalisés, ce qui réduit la quantité de code personnalisé nécessaire.
zh_cn: 材质设计CSS对几乎所有内容都使用颜色样本变量。可以从自定义CSS文件设置这些变量，从而减少所需的自定义代码量。

source: The ``-swatch-<100|200|300|400|500>`` variables define progressively darker shades of the same primary color. The light theme uses the default shades of blue set in ``material.css``, but the dark theme overrides these with shades of red. ``-swatch-<|light|dark>-gray`` defines three levels of gray to use for various background or text colors.
es_mx: Las variables ``-swatch- <100|200|300|400|500>`` definen tonos progresivamente más oscuros del mismo color primario. El tema claro usa los tonos de azul predeterminados establecidos en ``material.css``, pero el tema oscuro los reemplaza con tonos de rojo. ``-swatch-<|light|dark>-gray`` define tres niveles de gris para usar con varios colores de fondo o texto.
fr_ca: Les variables ``-swatch- <100 | 200 | 300 | 400 | 500>`` définissent des nuances progressivement plus foncées de la même couleur primaire. Le thème clair utilise les nuances de bleu par défaut définies dans ``material.css``, mais le thème sombre les remplace par des nuances de rouge. ``-swatch-<|light|dark>-gray`` définit trois niveaux de gris à utiliser pour diverses couleurs d'arrière-plan ou de texte.
zh_cn: ``-swatch- <100|200|300|400|500>''变量定义相同原色的逐渐变深的阴影。浅色主题使用在material.css中设置的默认蓝色阴影，而深色主题用红色阴影覆盖它们。 ``-swatch- <|light|dark> -gray''定义了三个灰度等级，用于各种背景或文本颜色。

source: Overriding the Swatch Colors
es_mx: Anulación de los Colores de Muestra
fr_ca: Remplacer les couleurs de l'échantillon
zh_cn: 覆盖色板颜色

source: Replacing blue with red (light)
es_mx: Reemplazo de azul con rojo (claro)
fr_ca: Remplacement du bleu par du rouge (clair)
zh_cn: 用红色代替蓝色（浅色）

source: Replacing red with blue (dark)
es_mx: Reemplazo de rojo con azul (oscuro)
fr_ca: Remplacement du rouge par du bleu (foncé)
zh_cn: 将红色替换为蓝色（深色）

source: Since shuffleboard is a JavaFX application, it has support for custom themes via Cascading Stylesheets (**CSS** for short). These are commonly used on webpages for making HTML look nice, but JavaFX also has support, albeit for a different language subset (see `here <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/doc-files/cssref.html>`__ for documentation on how to use it).
tr_tr: Shuffleboard bir JavaFX uygulaması olduğundan, uygulama Cascading Stylesheets (kısaca **CSS**) desteğine sahiptir. CSS genellikle web sayfalarında HTML'in daha güzel görünmesini sağlamak için kullanılmaktadır, ancak JavaFX, farklı bir dil alt kümesi (bu dili nasıl kullanacağınıza dair belglere `buradan <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/doc-files/cssref.html>`__ ulaşabilirsiniz) için olsa da, CSS desteğine sahiptir.
