Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/custom-widgets/widget-types.po
Languages: fr_ca, zh_cn

source: Widget Types
fr_ca: Types de widgets
zh_cn: 小部件类型

source: While ``Widget`` is pretty straightforward as far as the interface is concerned, there are several intermediate implementations to make it easier to define the widget.
fr_ca: Bien qu'un ``Widget`` soit assez simple pour ce qui concerne son interface, il existe cependant plusieurs implémentations intermédiaires pour faciliter la définition du widget.
zh_cn: 虽然“ Widget ”对于接口来说非常直观，但是有几个中间实现可以使定义小部件变得更容易。

source: Class
fr_ca: Classe
zh_cn: 类

source: Description
zh_cn: 描述

source: ``AbstractWidget``
zh_cn: “抽象小部件”

source: Implements ``getProperties()``, ``getSources()``, and ``titleProperty()``
fr_ca: Implemente ``getProperties()``, ``getSources()``, et ``titleProperty()``
zh_cn: 实现“getProperties()”, “getSources()”, 和 “titleProperty()”

source: ``SingleTypeWidget<T>``
fr_ca: ``SingleTypeWidget1``
zh_cn: “单一类型小部件”

source: Adds properties for widgets that only support a single data type
fr_ca: Ajoute des propriétés pour les widgets qui ne prennent en charge qu'un seul type de données
zh_cn: 添加只支持一种数据类型的小部件特性

source: ``AnnotatedWidget``
zh_cn: “带注释的小部件”

source: Adds default implementations for ``getName()`` and ``getDataTypes()`` for widgets with a ``@Description`` annotation
fr_ca: Ajoute des implémentations par défaut pour ``getName()`` et ``getDataTypes()`` pour les widgets avec une annotation ``@Description``
zh_cn: 给带有 “@Description”注释的小部件添加“getName()” 和 “getDataTypes()” 的默认实现

source: ``SingleSourceWidget``
zh_cn: “单一资源小部件”

source: For widgets with only a single source (by default, widgets support multiple sources)
fr_ca: Pour les widgets avec une seule source (par défaut, les widgets prennent en charge plusieurs sources)
zh_cn: 对于只有一个源的小部件(默认情况下，小部件支持多个源)

source: ``SimpleAnnotatedWidget<T>``
fr_ca: ``SimpleAnnotatedWidget1<T>``
zh_cn: “单一带注释的小部件”

source: Combines ``SingleTypeWidget<T>``, ``AnnotatedWidget``, and ``SingleSourceWidget``
fr_ca: Combine ``SingleTypeWidget1``, ``AnnotatedWidget``, et ``SingleSourceWidget``
zh_cn: 合并“单一类型小部件”，“带注释的小部件” 和“单一资源小部件”

source: There are also two annotations to help define widgets:
fr_ca: Il existe également deux annotations pour aider à définir les widgets:
zh_cn: 还有两个注释可以帮助定义widget：

source: Name
fr_ca: Nom
zh_cn: 名称

source: ``@ParametrizedController``
zh_cn: “@参数化控制器”

source: Allows widgets to be FXML controllers for JavaFX views defined via FXML
fr_ca: Permet aux widgets d'être des contrôleurs FXML pour les vues JavaFX définies via FXML
zh_cn: 允许小部件成为通过FXML定义的JavaFX视图的FXML控制器

source: ``@Description``
zh_cn: “@描述”

source: Lets the name and supported data types be defined in a single line
fr_ca: Permet de définir le nom et les types de données pris en charge sur une seule ligne
zh_cn: 让名称和支持的数据类型定义在一行中

source: AbstractWidget
zh_cn: 抽象小部件

source: This class implements ``getProperties()``, ``getSources()``, ``addSource()``, and ``titleProperty()``. It also defines a method ``exportProperties(Property<?>...)`` method so subclasses can easy add custom widget properties, or properties for the JavaFX components in the widget. Most of the `widgets in the base plugin <https://github.com/wpilibsuite/shuffleboard/tree/main/plugins/base/src/main/java/edu/wpi/first/shuffleboard/plugin/base/widget>`_ use this.
fr_ca: Cette classe implémente ``getProperties()``, ``getSources()``, ``addSource()``, et ``titleProperty()``. Elle définit également une méthode ``exportProperties(Property<?>...)`` de telle sorte que les sous-classes peuvent facilement ajouter des propriétés widget personnalisé, ou des propriétés pour les composants JavaFX dans le widget. La plupart `des widgets dans le plugin de base <https://github.com/wpilibsuite/shuffleboard/tree/main/plugins/base/src/main/java/edu/wpi/first/shuffleboard/plugin/base/widget>`_ l’utilisent.
zh_cn: 此类实现了“getProperties()”、“getSources()”、“addSource()”和“titleProperty()”。它还定义了一个方法 ``exportProperties(Property<?>...)`` 方法，因此子类可以轻松添加自定义小部件属性，或小部件中 JavaFX 组件的属性。基础插件中的大部分`widgets <https://github.com/wpilibsuite/shuffleboard/tree/main/plugins/base/src/main/java/edu/wpi/first/shuffleboard/plugin/base/widget> `_ 使用这个。

source: SingleTypeWidget
zh_cn: 单一类别小部件

source: A type of widget that only supports a single data type. This interface is parametrized and has methods for setting or getting the data, as well as a method for getting the (single) data type of the widget.
fr_ca: Un type de widget qui ne prend en charge qu'un seul type de données. Cette interface est paramétrée et possède des méthodes pour définir ou obtenir les données, ainsi qu'une méthode pour obtenir le type de données (unique) du widget.
zh_cn: 一种只支持一种数据类型的小部件。这个接口是参数化的，具有设置或获取数据的方法，以及获取小部件(单个)数据类型的方法。

source: AnnotatedWidget
zh_cn: 带注释的小部件

source: This interface implements ``getDataTypes()`` and ``getName()`` by looking at the the ``@Description`` annotation on the implementing class. This *requires* the annotation to be present, or the widget will not be able to be loaded and used.
fr_ca: Cette interface implémente ``getDataTypes()`` et ``getName()`` en regardant l'annotation ``@Description`` sur la classe d'implémentation. Cela *nécessite* que l'annotation soit présente, sinon le widget ne pourra pas être chargé et utilisé.
zh_cn: 这个接口通过查看在实现类上的注释“@Description”来实现“getDataTypes()” 和“getName()” 。这*要求*注释存在，否则小部件不能被加载或使用。

source: SingleSourceWidget
zh_cn: 单一资源小部件

source: A type of widget that only uses a single source.
fr_ca: Un type de widget qui n'utilise qu'une seule source.
zh_cn: 一种只用一个资源的小部件。

source: SimpleAnnotatedWidget
zh_cn: 单一带注释的小部件

source: A combination of ``SingleTypeWidget<T>``, ``AnnotatedWidget``, and ``SingleSourceWidget``. Most widgets in the base plugin extend from this class. This also has a ``protected`` field called ``dataOrDefault`` that lets subclasses use a default data value if the widget doesn’t have a source, or if the source is providing ``null``.
fr_ca: Une combinaison de ``SingleTypeWidget<T>``, ``AnnotatedWidget``, et ``SingleSourceWidget``. La plupart des widgets du plugin de base proviennent de cette classe. Cela a également un champ ``protected`` appelé ``dataOrDefault`` qui permet aux sous-classes d'utiliser une valeur de données par défaut si le widget n'a pas de source, ou si la source fournit ``null``.
zh_cn: “SingleTypeWidget1”, “AnnotatedWidget”, 和“SingleSourceWidget” 的组合。大多数基本插件中的小部件从这个类中拓展而来。这同时也有一个“受保护的”名叫“dataOrDefault” 的字段，它在小部件没有资源或资源显示“null”时使子类别们使用没有资源的默认数据。

source: @ParametrizedController
zh_cn: @参数化控制器

source: This annotation can be placed on a widget class to let shuffleboard know that it’s an FXML controller for a JavaFX view defined via FXML. The annotation takes a single parameter that defines where the FXML file *in relation to the class on which it is placed*. For example, a widget in the directory ``src/main/java/com/acme`` that is an FXML controller for a FXML file in ``src/main/resources/com/acme`` can use the annotation as either
fr_ca: Cette annotation peut être placée sur une classe de widget pour indiquer au shuffleboard qu'il s'agit d'un contrôleur FXML pour une vue JavaFX définie via FXML. L'annotation prend un seul paramètre qui définit où le fichier FXML *par rapport à la classe sur laquelle il est placé*. Par exemple, un widget dans le répertoire ``src/main/java/com/acme`` qui est un contrôleur FXML pour un fichier FXML dans ``src/main/resources/com/acme`` peut utiliser l'annotation comme
zh_cn: 这个注释可以放在小部件类上，让shuffleboard知道它是通过FXML定义的JavaFX视图的FXML控制器。注释接受一个参数，该参数定义了FXML文件*相对于它所在的类的位置*。例如，目录“src/main/java/com/acme”中的一个小部件，它是“ src/main/resources/com/acme”中的一个FXML文件的FXML控制器，可以使用注释作为任何一种

source: or as
fr_ca: ou comme
zh_cn: 或作为

source: @Description
zh_cn: @描述

source: This allows widgets to have their name and supported data types defined by a single annotation, when used alongside `AnnotatedWidget`_.
fr_ca: Cela permet aux widgets d'avoir leur nom et les types de données pris en charge définis par une seule annotation, lorsqu'ils sont utilisés avec `AnnotatedWidget`_.
zh_cn: 当与' AnnotatedWidget ' _一起使用时，这允许小部件的名称和受支持的数据类型由单个注释定义。
