Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-3/imaging-your-roborio.po
Languages: fr_ca, zh_cn

source: Imaging your roboRIO
fr_ca: Installation de l'image dans votre roboRIO
zh_cn: 为您的 roboRIO 写入镜像

source: Before imaging your roboRIO, you must have completed installation of the :doc:`FRC Game Tools</docs/zero-to-robot/step-2/frc-game-tools>`. You also must have the roboRIO power properly wired to the Power Distribution Panel. Make sure the power wires to the roboRIO are secure and that the connector is secure firmly to the roboRIO (4 total screws to check).
fr_ca: Avant d’installer l'image de votre roboRIO, vous devez avoir terminé l’installation des outils de jeu :doc:`FRC Game Tools</docs/zero-to-robot/step-2/frc-game-tools>`. Vous devez également avoir l'alimentation du roboRIO solidement câblé au Panneau de distribution de puissance. Assurez-vous que les fils électriques du roboRIO sont sécurisés et que le connecteur est solidement attaché au roboRIO (4 vis au total à vérifier).
zh_cn: 在为你的roboRIO镜像之前，, 你必须完成:doc:`FRC Game Tools</docs/zero-to-robot/step-2/frc-game-tools>`的安装. 你也必须将 roboRIO电源正确地连接到配电板上。确保roboRIO的电源线连接牢固，并且接口牢固地固定在roboRIO上（共检查4个螺钉）。

source: Configuring the roboRIO
fr_ca: Configuration du roboRIO
zh_cn: 配置 roboRIO

source: The roboRIO Imaging Tool will be used to image your roboRIO with the latest software.
fr_ca: L'outil d'installation d'image du roboRIO sera utilisé pour installer une image dans votre roboRIO à l'aide de la version la plus à jour du logiciel.
zh_cn: roboRIO 镜像工具将被用于升级 roboRIO 的固件。

source: USB Connection
fr_ca: Connexion USB
zh_cn: USB 连接

source: Highlights the USB Type B input at the top of the roboRIO.
fr_ca: Met en évidence l’entrée USB Type B en haut du roboRIO.
zh_cn: 突出显示 roboRIO 顶部的 USB Type B 输入。

source: Connect a USB cable from the roboRIO USB Device port to the PC. This requires a USB Type A male (standard PC end) to Type B male cable (square with 2 cut corners), most commonly found as a printer USB cable.
fr_ca: Connectez un câble USB du roboRIO au PC. Cela nécessite un câble USB type A mâle (extrémité de PC standard) à Type B male (carré avec 2 coins coupés), le plus souvent trouvé comme câble USB d'imprimante.
zh_cn: 将 USB 电缆从 roboRIO USB 设备端口连接到个人电脑。这需要 USB A 型公头 (标准PC端) 到 B 型公头 (形似切去2个角的正方形) 电缆。常见的有打印机USB电缆等。

source: The roboRIO should only be imaged via the USB connection. It is not recommended to attempt imaging using the Ethernet connection.
fr_ca: L'installation de l'image du roboRIO devrait seulement être faite par l'intermédiaire de la connexion USB. Il n'est pas recommandé d'utiliser la connexion Ethernet pour créer l'image.
zh_cn: roboRIO 应只能通过 USB 连接进行镜像写入。不建议在尝试写入影像时使用以太网连接。

source: Driver Installation
fr_ca: Installation des pilotes (Drivers)
zh_cn: 驱动安装

source: The device driver should install automatically. If you see a "New Device" pop-up in the bottom right of the screen, wait for the driver install to complete before continuing.
fr_ca: Les pilotes devraient s'installer automatiquement. Si vous voyez un pop-up "New Device" en bas à droite de l'écran, attendez que l'installation du pilote soit terminée avant de continuer.
zh_cn: 设备驱动程序应自动开始安装。如果您在屏幕的右下方看到一个 “新设备” 弹窗，等待至驱动程序安装完成后再继续。

source: Launching the Imaging Tool
fr_ca: Démarrage de l'outil d'installation d'Image
zh_cn: 启动镜像工具

source: The roboRIO Imaging Tool desktop shortcut.
fr_ca: Raccourci bureau de l'outil roboRIO Imaging Tool.
zh_cn: roboRIO 成像工具桌面快捷方式。

source: The roboRIO imaging tool and latest image are installed with the NI FRC\ |reg| Game Tools. Launch the imaging tool by double clicking on the shortcut on the Desktop. If you have difficulties imaging your roboRIO, you may need to try right-clicking on the icon and selecting Run as Administrator instead.
fr_ca: L’outil d’installation d'image roboRIO imaging tool et la dernière image sont installés avec l'outil de jeu NI FRC\ |reg| Game Tools. Lancez l’outil d’installation d'image en cliquant deux fois sur le raccourci sur le bureau. Si vous avez des difficultés à installer l'image de votre roboRIO, vous devrez peut-être essayer de cliquer à droite sur l’icône et de sélectionner Exécuter en tant qu’administrateur à la place.
zh_cn: roboRIO映像工具和最新映像已随NI FRC \ | reg |一起安装。游戏工具。双击桌面上的快捷方式启动映像工具。如果您在对roboRIO进行成像时遇到困难，则可能需要尝试右键单击该图标，然后选择以管理员身份运行。

source: The roboRIO imaging tool is also located at ``C:\Program Files (x86)\National Instruments\LabVIEW YYYY\project\roboRIO Tool`` where YYYY is the current year - 1. If it's 2020, the directory would be ``LabVIEW 2019``.
fr_ca: L'outil d'installation d'image du roboRIO est également situé à ``C:\Program Files (x86)\National Instruments\LabVIEW YYYY\project\roboRIO Tool`` où YYYY est l'année actuelle - 1. Si c'est 2020, le répertoire serait ``LabVIEW 2019``.
zh_cn: roboRIO 镜像工具也位于 ``C:\Program Files (x86)\National Instruments\LabVIEW YYYY\project\roboRIO Tool`` 中，其中 YYYY 是当前年份减去1。 若今年是2020年，目录名将是 ``LabVIEW 2019`` 。

source: roboRIO Imaging Tool
fr_ca: Outil d'installation d'image du roboRIO
zh_cn: roboRIO 镜像工具

source: The roboRIO Imaging Tool main screen.
fr_ca: L’écran principal de l’outil d’imagerie roboRIO Tool.
zh_cn: roboRIO 成像工具主屏幕。

source: After launching, the roboRIO Imaging Tool will scan for available roboRIOs and indicate any found in the top left box. The bottom left box will show information and settings for the roboRIO currently selected. The right hand pane contains controls for modifying the roboRIO settings:
fr_ca: Après le lancement, l'outil d'installation d'image du roboRIO va scanner pour trouver des roboRIO disponibles et indiquer ceux qui sont trouvés en haut à gauche de l'écran. En bas et à gauche de l'écran, on peut visualiser l'information et les paramètres pour le roboRIO actuellement choisi. Le volet de droite contient les contrôles pour modifier les paramètres du roboRIO:
zh_cn: 启动后，roboRIO 镜像工具将扫描可用的 roboRIO，并在左上方的框中显示所有找到的 roboRIO。左下方的框将显示当前所选 roboRIO 的信息和设置。右侧面板包含了用于修改 roboRIO 设置的控件：

source: **Edit Startup Settings** - This option is used when you want to configure the startup settings of the roboRIO (the settings in the right pane), without imaging the roboRIO.
fr_ca: **Edit Startup Settings** - Cette option est utilisée pour quand vous voulez configurer les paramètres de démarrage du roboRIO (les paramètres dans le volet droit), sans installer l'image au roboRIO.
zh_cn: **编辑启动设置**-当您要配置roboRIO的启动设置（右窗格中的设置）而不使用roboRIO的映像时，使用此选项。

source: **Format Target** - This option is used when you want to load a new image on the roboRIO (or reflash the existing image). This is the most common option.
fr_ca: **Format Target** - Cette option est utilisée quand vous voulez charger une nouvelle image sur le roboRIO (où de reflasher l'image existante). C'est l'option la plus courante.
zh_cn: **格式化目标**-当您要在roboRIO上加载新图像（或重新刷新现有图像）时使用此选项。这是最常见的选择。

source: **Update Firmware** - This option is used to update the roboRIO firmware. For this season, the imaging tool will require roboRIO firmware to be version 5.0 or greater.
fr_ca: **Update Firmware** - Cette option est utilisé pour mettre à jour le micrologiciel du roboRIO. Pour cette saison, il faut le micrologiciel de roboRIO version 5.0 ou supérieure.
zh_cn: **更新固件**-此选项用于更新roboRIO固件。在这个季节，映像工具将需要roboRIO固件版本为5.0或更高版本。

source: Updating Firmware
fr_ca: Mettre à jour du micrologiciel
zh_cn: 更新固件

source: Numbers identifying the different parts of the Imaging Tool main screen for changing firmware.
fr_ca: Numéros identifiant les différentes parties de l’écran principal de l’outil Imaging Tool pour permettre de changer de firmware.
zh_cn: 标识用于更改固件的 Imaging Tool 主屏幕不同部分的数字。

source: roboRIO firmware must be at least v5.0 to work with the 2019 or later image. If your roboRIO is at least version 5.0 (as shown in the bottom left of the imaging tool) you do not need to update.
fr_ca: Le firmware du roboRIO doit être au moins v5.0 pour travailler avec l’image 2019 ou plus. Si votre roboRIO est pourvu la version 5.0 au moins (comme indiqué en bas à gauche de l’outil d’installation d'image), vous n’avez pas besoin de faire de mise à jour.
zh_cn: roboRIO固件必须至少为v5.0才能使用2019或更高版本的映像。如果roboRIO的版本至少为5.0（如映像工具的左下方所示），则无需更新。

source: To update roboRIO firmware:
fr_ca: Pour mettre à jour le micrologiciel du roboRIO:
zh_cn: 要更新roboRIO固件：

source: Make sure your roboRIO is selected in the top left pane.
fr_ca: Assurez-vous que votre roboRIO est selectionné dans volet supérieur gauche.
zh_cn: 请确保在左上方窗格中选择了您需要的 roboRIO。

source: Select Update Firmware in the top right pane
fr_ca: Selectionnez Update Firmware dans le volet supérieur droit
zh_cn: 在右上方面板中选择 “更新固件”

source: Enter a team number in the Team Number box
fr_ca: Entrez votre numéro d'équipe dans la boîte Team Number
zh_cn: 在 “团队编号” 框中输入您的团队编号

source: Select the latest firmware file in the bottom right
fr_ca: Selectionnez le dernier fichier de micrologiciel en bas à droite
zh_cn: 在右下方选择最新的固件文件

source: Click the **Update** button
fr_ca: Cliquez sur le bouton **Update**
zh_cn: 点击 “更新” 按钮

source: Imaging the roboRIO
fr_ca: Installation de l'image dans le roboRIO
zh_cn: 镜像 roboRIO

source: Numbers identifying the different parts of the Imaging Tool main screen for formatting the target.
fr_ca: Nombres identifiant les différentes parties de l’écran principal de l’outil Imaging Tool pour le formatage de la cible.
zh_cn: 用于格式化目标的成像工具主屏幕不同部分的数字。

source: Make sure the roboRIO is selected in the top left pane
fr_ca: Assurez-vous que le roboRIO est selectionné dans le volet supérieur gauche
zh_cn: 确保在左上方窗格中选择了 roboRIO

source: Select Format Target in the right pane
fr_ca: Selectionnez Format Target dans le volet de droite
zh_cn: 在右侧面板中选择 “格式化目标”

source: Enter your team number in the box
fr_ca: Entrez votre numéro d'équipe dans la boîte
zh_cn: 在框中输入您的团队编号

source: Select the latest image version in the box.
fr_ca: Selectionnez la dernière version d'image dans la boîte
zh_cn: 在框中选择最新的镜像版本。

source: Click Reformat to begin the imaging process.
fr_ca: Cliquez Reformat pour commencez le processus.
zh_cn: 单击 "重新格式化" 以开始写入镜像。

source: Imaging Progress
fr_ca: Processus d'installation de l'image
zh_cn: 写入镜像过程

source: Progress Bar along the bottom shows how long till completion.
fr_ca: La barre de progression le long du bas indique le temps restant avant la fin.
zh_cn: 底部的进度条显示完成的时间。

source: The imaging process will take approximately 3-10 minutes. A progress bar in the bottom left of the window will indicate progress.
fr_ca: Le processus d'installation de l'image prendra environ 3-10 minutes. Une barre de progression en bas à gauche de la fenêtre indique le progrès.
zh_cn: 写入镜像过程大约需要3-10分钟。窗口左下方的进度条将指示进度。

source: Imaging Complete
fr_ca: Installation de l'image terminée
zh_cn: 写入镜像完成

source: Dialog that pops up when imaging is complete listing IP address and DNS name.
fr_ca: Boîte de dialogue qui s’affiche lorsque l’installation de l'image est terminée répertoriant l’adresse IP et le nom DNS.
zh_cn: 映像完成时弹出的对话框列出 IP 地址和 DNS 名称。

source: When the imaging completes you should see the dialog above. Click Ok, then click the Close button at the bottom right to close the imaging tool. Reboot the roboRIO using the Reset button to have the new team number take effect.
fr_ca: Quand l'installation de l'image est complétée, vous allez voir la boîte de dialogue ci-dessus. Cliquez "Ok" puis cliquez sur le bouton "Close" en bas à droite pour fermer l'outil. Redémarrez le roboRIO en utilisant le bouton "Reset" pour que le nouveau numéro d'équipe prenne effet.
zh_cn: 镜像写入完成后，您应该会看到上面的对话框。单击确定，然后单击右下角的关闭按钮以关闭镜像工具。使用 “重置” 按钮重新启动 roboRIO，以使新的团队编号生效。

source: Troubleshooting
fr_ca: Dépannage
zh_cn: 故障排除

source: If you are unable to image your roboRIO, troubleshooting steps include:
fr_ca: Si vous êtes pas capable d'installer l'image de votre roboRIO, les étapes de dépannage sont:
zh_cn: 如果您无法对roboRIO进行镜像，则故障排除步骤包括：

source: Try running the roboRIO Imaging Tool as Administrator by right-clicking on the Desktop icon to launch it.
fr_ca: Sous le compte administrateur, essayez de lancer "roboRIO Imaging Tool" en cliquant avec le bouton droit de la souris sur l'icône du bureau.
zh_cn: 尝试以管理员身份运行roboRIO 镜像工具，方法是右键单击桌面图标以启动它。

source: Try accessing the roboRIO webpage with a web-browser at ``http://172.22.11.2/`` and/or verify that the NI network adapter appears in your list of Network Adapters in the Control Panel. If not, try re-installing the NI FRC Game Tools or try a different PC.
fr_ca: Essayez d'accéder à la page Web du roboRIO avec un navigateur web à ``http://172.22.11.2/`` et/ou vérifiez que l'adapteur réseau NI apparaît dans votre liste "Network Adapter" (adapteur réseau) dans le panneau de configuration. Sinon, essayez de réinstaller les Outils de Jeu FRC NI ou essayez un PC différent.
zh_cn: 尝试使用网络浏览器在 http://172.22.11.2/ 访问 roboRIO 网页，并验证 NI 网络适配器是否出现在控制面板的网络适配器列表中。如果未出现，请尝试重新安装 NI FRC Game Tools 或尝试使用其他PC。

source: :ref:`Disable all other network adapters <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`
fr_ca: :ref:`Désactivation des adapteurs réseau <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`
zh_cn: ：ref：`禁用所有其他网络适配器<docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`

source: Make sure your firewall is turned off.
fr_ca: Assurez-vous que votre pare-feu (Firewall) est désactivé.
zh_cn: 确保您的防火墙已关闭。

source: Some teams have experienced an issue where imaging fails if the device name of the computer you're using has a dash (``-``) in it. Try renaming the computer (or using a different PC).
fr_ca: Quelques équipes vu l'installation de l'image échouer parceque le nom de l'ordinateur utilisé contenait un tiret (``-``). Dans le doute, essayez de renommer votre ordinateur (ou d'utiliser un PC différent).
zh_cn: 如果您使用的计算机的设备名称中带有破折号（``-''），则一些团队遇到了成像失败的问题。尝试重命名计算机（或使用其他PC）。

source: Try booting the roboRIO into Safe Mode by pressing and holding the reset button for at least 5 seconds.
fr_ca: Essayez de démarrer le roboRIO en "Safe Mode" en appuyant et en maintenant le bouton reset pendant au moins 5 secondes.
zh_cn: 按住复位按钮至少5秒钟，尝试将roboRIO引导至安全模式。

source: Try a different USB Cable
fr_ca: Essayer un câble USB différent

source: Try a different PC
fr_ca: Essayez un PC différent
zh_cn: 尝试其他电脑

source: Try imaging a roboRIO 2.0 using the :doc:`roboRIO 2.0 microSD card imaging process</docs/software/roborio-info/roborio2-imaging>`
fr_ca: Essayer d'installer l'image dans un roboRIO 2.0 en vous servant de :doc:`roboRIO 2.0 microSD card imaging process</docs/software/roborio-info/roborio2-imaging>`
