Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-3/radio-programming.po
Languages: es_mx, fr_ca, ja, zh_cn

source: Follow the instructions above to install the software, launch the program and select the Ethernet interface.
es_mx: Siga las instrucciones anteriores para instalar el software, inicie el programa y seleccione la interfaz Ethernet.
fr_ca: Suivez les instructions ci-dessus pour installer le logiciel, lancer le programme et sélectionner l’interface Ethernet.
zh_cn: 请按照上述说明安装软件，启动程序并选择以太网接口。

source: Make sure the Open Mesh radio is selected in the Radio dropdown.
es_mx: Asegúrese que la radio OpenMesh esté seleccionada en el desplegable de Radio.
fr_ca: Assurez-vous que la radio Open Mesh est sélectionnée dans la liste déroulante Radio.
zh_cn: 确保在“无线电”下拉列表中选择了“Open Mesh radio”。

source: Make sure the radio is connected to the PC via Ethernet.
es_mx: Asegúrese que la radio esté conectada a la PC vía Ethernet.
fr_ca: Assurez-vous que la radio est connectée au PC via Ethernet.
zh_cn: 确保路由器通过以太网连接到PC。

source: Unplug the power from the radio. (If using a PoE cable, this will also be unplugging the Ethernet to the PC, this is fine)
es_mx: Desenchufe la energía del radio. (Si esta usando un cable PoE, también desenchufará el Ethernet de la PC, esto está bien)
fr_ca: Débranchez l’alimentation de la radio. (Si vous utilisez un câble PoE, il faudra également débrancher le Ethernet sur le PC, ce qui est correct)
zh_cn: 拔掉路由器的电源。（如果使用PoE电缆，也可以将以太网从PC上拔下，这没问题）

source: Press the Load Firmware button
es_mx: Presione el botón Load Firmware
fr_ca: Appuyez sur le bouton Load Firmware
zh_cn: 按“加载固件”按钮

source: When prompted, plug in the radio power. The software should detect the radio, load the firmware and prompt you when complete.
es_mx: Cuando se le indique, enchufe energía al radio. El software debería detectar el radio, cargue el firmware e indique cuando termine.
fr_ca: Lorsque vous y êtes invité, branchez l'alimentation de la radio. Le logiciel doit détecter la radio, charger le firmware et vous informer, une fois terminé.
zh_cn: 出现提示时，插入路由器电源。该软件应检测路由器、加载固件并在完成时提示您。

source: If you see an error about NPF name, try disabling all adapters other than the one being used to program the radio. If only one adapter is found, the tool should attempt to use that one. See the steps in :ref:`Disabling Network Adapters <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>` for more info.
es_mx: Si ve un error sobre el nombre NPF, pruebe deshabilitando todos los adaptadores excepto el que esté siendo usado para programar el radio. Si solo un adaptador es encontrado, la herramienta debería intentar usar ese. Vea los pasos en "`Troubleshooting: Disabling Network Adapters`_" para más información.
fr_ca: Si vous voyez une erreur concernant le nom NPF, essayez de désactiver tous les adaptateurs autres que celui utilisé pour programmer la radio. Si un seul adaptateur est trouvé, l'outil doit essayer de l'utiliser. Consultez les étapes dans :ref:`Désactivation des cartes réseau <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>` pour plus d'informations.
zh_cn: 如果看到有关NPF名称的错误，请尝试禁用除用于编程路由器的适配器以外的所有适配器。如果仅找到一个适配器，则该工具应尝试使用该适配器。有关更多信息，请参阅 :ref:`禁用网络适配器<docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>` 。

source: Teams may also see this error with foreign language Operating Systems. If you experience issues loading firmware or programming on a foreign language OS, try using an English OS, such as on the KOP provided PC or setting the Locale setting to "en_us" as described on `this page <https://www.java.com/en/download/help/locale.xml>`_.
es_mx: Equipos también podrían ver este error con Sistemas Operativos con idiomas extranjeros. Si experimenta problemas al cargar el firmware o programando con Sistemas Operativos en idiomas extranjeros, pruebe usando un Sistema Operativo en inglés, como en la PC provista por KOP o estableciendo la configuración Regional en "en_us" como se describe en `esta página <https://www.java.com/en/download/help/locale.xml>`_.
fr_ca: Les équipes peuvent également voir cette erreur avec les systèmes d’exploitation en langue étrangère. Si vous rencontrez des problèmes de chargement du firmware ou de la programmation sur un système d’exploitation en langue étrangère, essayez d’utiliser un système d’exploitation en anglais, par exemple sur le PC fourni dans le Kit de Pièces (KOP) ou de configurer les paramètres locaux sur "en_us" comme décrit sur `cette page <https://www.java.com/en/download/help/locale.xml>`_.
zh_cn: 队伍也可能会在外语操作系统中看到此错误。如果您在外语操作系统上加载固件或编程时遇到问题，请尝试使用英语操作系统，例如在KOP提供的PC上，或按 `此页面<https://www.java.com/en/download/help/locale.xml>`_的说明将“区域设置”设置为“ en_us” 。

source: Select Radio and Operating Mode
es_mx: Seleccione un modelo de puente y modo operativo
fr_ca: Sélectionnez la radio et le mode de fonctionnement
zh_cn: 选择无线电和操作模式

source: Highlights the Radio and Mode dropdown boxes.
fr_ca: Met en surbrillance les zones déroulantes Radio et Mode.
zh_cn: 突出显示 Radio 和 Mode 下拉框。

source: Select which radio you are configuring using the drop-down list.
es_mx: Seleccione cual radio va a configurar usando la lista desplegable.
fr_ca: Sélectionnez la radio que vous configurez à l’aide de la liste déroulante.
zh_cn: 使用下拉列表选择要配置的无线电。

source: Select which operating mode you want to configure. For most cases, the default selection of 2.4GHz Access Point will be sufficient. If your computers support it, the 5GHz AP mode is recommended, as 5GHz is less congested in many environments.
es_mx: Seleccione cual modo operativo desea configurar. Para la mayoría de los casos, la selección default de 2.4GHz Access Point será suficiente. Si sus computadoras lo soportan, el modo 5GHz AP es recomendado, debido a que el 5GHz está menos congestionado en muchos entornos.
fr_ca: Sélectionnez le mode d'opération à configurer. Dans la plupart des cas, la sélection par défaut du point d’accès 2.4 GHz sera suffisante. Si vos ordinateurs le supporte, le mode AP 5GHz est recommandé, car 5GHz est moins encombré dans de nombreux environnements.
zh_cn: 选择要配置的操作模式。对于大多数情况，默认选择2.4GHz接入点就足够了。如果您的计算机支持的话，则建议使用5GHz AP模式，因为在许多环境中5GHz不太容易拥堵。

source: Select Options
es_mx: Seleccione Opciones
fr_ca: Sélectionnez les options
zh_cn: 选择选项

source: Setting the robot name will change the SSID. The checkboxes make the radio more similar to competition operation.
fr_ca: La définition du nom du robot changera le SSID. Les cases à cocher rendent la radio plus similaire au mode d’opération en compétition.
zh_cn: 设置机器人名称将更改 SSID。复选框使收音机更类似于比赛操作。

source: The default values of the options have been selected to match the use case of most teams, however, you may wish to customize these options to your specific scenario:
es_mx: Los valores predeterminados de las opciones han sido seleccionados para corresponder el caso de uso de la mayoría de los equipos, de cualquier forma, podría desear personalizar estas opciones para su específico escenario:
fr_ca: Les valeurs par défaut des options ont été sélectionnées pour correspondre au cas d’utilisation de la plupart des équipes, cependant, vous pouvez personnaliser ces options à votre scénario spécifique :
zh_cn: 已选项的默认值匹配大多数队伍的使用，但是，您可能希望针对特定方案自定义这些选项：

source: **Robot Name:** This is a string that gets appended to the SSID used by the radio. This allows you to have multiple networks with the same team number and still be able to distinguish them.
es_mx: **Robot Name:** Esta es una cadena que se agrega al SSID utilizado por la radio. Esto le permite tener múltiples redes con el mismo número de equipo y aún así poder distinguirlas.
fr_ca: **Robot Name:** Il s'agit d'une chaîne de caractères qui est ajoutée au SSID utilisé par la radio. Cela vous permet d'avoir plusieurs réseaux avec le même numéro d'équipe et de toujours pouvoir les distinguer.
zh_cn: 机器名称：这是一个字符串，附加到路由器使用的SSID。这使您可以拥有多个具有相同队伍编号的网络，并且仍然能够区分它们。

source: **Firewall:** If this box is checked, the radio firewall will be configured to attempt to mimic the port blocking behavior of the firewall present on the FRC field. For a list of open ports, please see the FRC Game Manual.
es_mx: **Firewall:** Si esta casilla está marcada, el firewall del radio estará configurado para intentar imitar el comportamiento de bloqueo del puerto del firewall presente en el campo de FRC. Para una lista de puertos abiertos, vea el FRC Game Manual.
fr_ca: **Firewall:** Si cette case est cochée, le pare-feu radio sera configuré pour tenter d'imiter le comportement de blocage de port du pare-feu présent sur le champ FRC. Pour une liste des ports ouverts, veuillez consulter le manuel du jeu FRC.
zh_cn: 防火墙：如果选中此框，则将无线电防火墙配置为尝试模仿FRC波段上存在的防火墙的端口阻碍。有关开放端口的列表，请参阅FRC游戏手册。

source: **BW Limit:** If this box is checked, the radio enforces a 4 Mbps bandwidth limit like it does when programmed at events. Note that this is a total limit, not per client, so streaming video to multiple clients simultaneously may cause undesired behavior.
fr_ca: **BW Limit:** Si cette case est cochée, la radio applique une limite de bande passante de 4 Mbps comme elle le fait lorsqu'elle est programmée lors d'événements. Notez qu'il s'agit d'une limite totale, pas par client, donc la diffusion de vidéo vers plusieurs clients simultanément peut provoquer un comportement indésirable.

source: Firewall and BW Limit only apply to the Open Mesh radios. These options have no effect on D-Link radios.
es_mx: El Firewall y el Límite de Banda Ancha solo aplican para radios OpenMesh. Éstas opciones no tienen efecto en radios D-Link.
fr_ca: Le pare-feu et la limite BW s'appliquent uniquement aux radios Open Mesh. Ces options n'ont aucun effet sur les radios D-Link.
zh_cn: 防火墙和带宽限制仅适用于Open Mesh路由器。这些选项对D-Link无线电无效。

source: The "Firewall" option configures the radio to emulate the field firewall. This means that you will not be able to deploy code wirelessly with this option enabled. This is useful for simulating blocked ports that may exist at competitions.
es_mx: La opción “Firewall” configura la radio para emular el firewall de campo. Esto significa que no podrá implementar código de forma inalámbrica con esta opción habilitada.
fr_ca: L'option "Firewall" configure la radio pour émuler le pare-feu de terrain. Cela signifie que vous ne pourrez pas déployer du code sans fil avec cette option activée. Ceci est utile pour simuler les ports bloqués qui peuvent exister lors de compétitions.
zh_cn: “防火墙”选项将路由器配置为模拟现场防火墙。这意味着启用此选项后，您将无法无线部署代码。这对于模拟比赛中可能存在的端口拥堵很有用。

source: Starting the Configuration Process
es_mx: Prepare e inicie el proceso de configuración
fr_ca: Démarrage du processus de configuration
zh_cn: 开始配置过程

source: At the bottom of the screen is instructions for completing the configuration process.
fr_ca: Au bas de l’écran se trouvent des instructions pour terminer le processus de configuration.
zh_cn: 屏幕底部是完成配置过程的说明。

source: Follow the on-screen instructions for preparing your wireless bridge, entering the settings the bridge will be configured with, and starting the configuration process. These on-screen instructions update to match the bridge model and operating mode chosen.
es_mx: Siga las instrucciones en la pantalla para preparar su puente inalámbrico, ingresando los ajustes con los que el puente será configurado, e iniciando el proceso de configuración. Estas instrucciones en la pantalla se actualizan para corresponder al modelo del puente y el modo operativo elegido.
fr_ca: Suivez les instructions à l’écran pour préparer votre passerelle sans fil, entrer les paramètres avec lesquels la passerelle sera configurée et démarrer le processus de configuration. Ces instructions à l’écran sont mises à jour pour correspondre au modèle de pont et au mode de fonctionnement choisi.
zh_cn: 按照屏幕上的说明准备无线连接，输入将使用该连接配置的设置，然后开始配置进程。这些屏幕说明会进行更新，以匹配所选的连接类型和操作模式。

source: Configuration Progress
es_mx: Progreso de Configuración
fr_ca: Progression de la configuration
zh_cn: 配置过程

source: The progress bar dialog while the configuration is working.
fr_ca: Boîte de dialogue de la barre de progression pendant que la configuration fonctionne.
zh_cn: 配置工作时的进度条对话框。

source: Throughout the configuration process, the window will indicate:
es_mx: Durante el proceso de configuración, la ventana indicará:
fr_ca: Tout au long du processus de configuration, la fenêtre indique:
zh_cn: 在整个配置过程中，该窗口将指示：

source: The step currently being executed.
es_mx: El paso que esta siendo ejecutado en ese momento
fr_ca: L'étape en cours d'exécution.
zh_cn: 当前正在执行的步骤。

source: The overall progress of the configuration process.
es_mx: El progreso general del proceso de configuración
fr_ca: La progression globale du processus de configuration.
zh_cn: 配置过程的总体进度。

source: All steps executed so far.
es_mx: Todos los pasos ejecutados hasta el momento
fr_ca: Toutes les étapes exécutées jusqu'à présent.
zh_cn: 到目前为止，所有已执行的步骤。

source: Configuration Completed
es_mx: Configuración completada
fr_ca: Configuration terminée
zh_cn: 配置完成

source: A pop up dialog indicating the programming was successful.
fr_ca: Une boîte de dialogue contextuelle indiquant que la programmation a réussi.
zh_cn: 一个弹出对话框表明编程成功。

source: Once the configuration is complete:
es_mx: Una vez que se complete la configuración:
fr_ca: Une fois la configuration terminée:
zh_cn: 配置完成后：

source: Press :guilabel:`OK` on the dialog window.
es_mx: Presione “OK” en la ventana de diálogo
fr_ca: Appuyez sur :guilabel:`OK` dans la fenêtre de dialogue.
zh_cn: 在对话框窗口中按确定。

source: Press :guilabel:`OK` on the main window to return to the settings screen.
es_mx: Presione “OK” en la ventana principal para regresar a la pantalla de ajustes
fr_ca: Appuyez sur :guilabel:`OK` dans la fenêtre principale pour revenir à l'écran des paramètres.
zh_cn: 在主窗口上按OK确定以返回到设置屏幕。

source: Configuration Errors
es_mx: Errores de configuración
fr_ca: Erreurs de configuration
zh_cn: 配置错误

source: A error dialog pop up.
fr_ca: Une boîte de dialogue d’erreur s’affiche.
zh_cn: 弹出错误对话框。

source: If an error occurs during the configuration process, follow the instructions in the error message to correct the problem.
es_mx: Si ocurre un error durante el proceso de configuración, siga las instrucciones en el mensaje de error para corregir el problema.
fr_ca: Si une erreur se produit pendant le processus de configuration, suivez les instructions du message d’erreur pour corriger le problème.
zh_cn: 如果在配置过程中发生错误，请按照错误消息中的说明更正问题。

source: Troubleshooting
es_mx: Solución de problemas
fr_ca: Dépannage
zh_cn: 故障排除

source: :ref:`Disable all other network adapters <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`.
es_mx: :ref: `Desactive todos los demás adaptadores de red <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`.
fr_ca: :ref:`Désactiver tous les autres adapteurs réseaux <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`.
zh_cn: :ref:`禁用所有其他网络适配器 <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`。

source: Make sure you wait long enough that the power light has stayed solid for 10 seconds.
es_mx: Asegúrese de esperar el tiempo suficiente para que la luz de encendido permanezca fija durante 10 segundos.
fr_ca: Assurez-vous d'attendre suffisamment longtemps pour que le voyant d'alimentation reste fixe pendant 10 secondes.
zh_cn: 确保等待足够长的时间，使电源指示灯保持常亮 10 秒钟。

source: Make sure you have the correct network interface, and only one interface is listed in the drop-down.
es_mx: Asegúrese de tener la interfaz de red correcta, y solo una interfaz aparece en el menú desplegable.
fr_ca: Assurez-vous que vous disposez de la bonne interface réseau et qu'une seule interface est répertoriée dans la liste déroulante.
zh_cn: 确保您拥有正确的网络接口，并且下拉列表中只列出了一个接口。

source: Make sure your firewall is turned off.
fr_ca: Assurez-vous que votre pare-feu (Firewall) est désactivé.

source: Plug directly from your computer into the wireless bridge and make sure no other devices are connected to your computer via ethernet.
es_mx: Conecte directamente desde su computadora el puente inalámbrico y asegúrese de que no hayan otros dispositivos conectados a su computadora vía ethernet
fr_ca: Branchez directement depuis votre ordinateur dans le pont sans fil (Wireless bridge) et assurez-vous qu'aucun autre appareil n'est connecté à votre ordinateur via Ethernet.
zh_cn: 直接从计算机插入无线连接，并确保没有其他设备通过以太网连接到计算机。

source: Ensure the ethernet is plugged into the port closest to the power jack on the wireless bridge.
es_mx: Asegúrese de que el ethernet esté enchufado en el puerto más cercano al conector de alimentación en el puente inalámbrico.
fr_ca: Assurez-vous que l'Ethernet est branché sur le port le plus proche de la prise d'alimentation sur le pont sans fil.
zh_cn: 确保以太网已插入最靠近无线桥接器电源插孔的端口。

source: If using a foreign language Operating System, try using an English OS, such as on the KOP provided PC or setting the Locale setting to "en_us" as described on `this page <https://www.java.com/en/download/help/locale.xml>`_.
es_mx: Si usa un sistema operativo en un idioma extranjero, intente usar un sistema operativo en inglés, como en el PC provisto por KOP o establezca la configuración regional en "en_us" como se describe en `esta página <https://www.java.com/en/download/help/locale.xml>`_.
fr_ca: Si vous utilisez un système d'exploitation en français, essayez plutôt d'utiliser un système d'exploitation en anglais, comme sur le PC fourni dans le Kit de Pièces KOP ou définissez le paramètre Locale comme "en_us" comme décrit sur `cette page <https://www.java.com/en/download/help/locale.xml>`_.
zh_cn: 如果使用外语操作系统，请尝试使用英文操作系统，例如在 KOP 提供的 PC 上或将区域设置设置为“en_us”，如本页 <https://www.java.com/en/download /help/locale.xml>`_。

source: Some users have reported success after installing `npcap 1.60 <https://npcap.com/>`__. If this doesn't resolve the issue, it's recommended to uninstall npcap and the radio tool and then reinstall the radio tool in order to get back to a known configuration.
fr_ca: Certains utilisateurs ont signalé avoir réussi après avoir installé `npcap 1.60 <https://npcap.com/>`__. Si cela ne résout pas le problème, il est recommandé de désinstaller npcap et l'outil radio, puis de réinstaller l'outil radio afin de revenir à une configuration connue.

source: If all else fails, try a different computer.
fr_ca: Si tout le reste échoue, essayez un autre ordinateur.

source: Robot TCP & :term:`NetworkTables` (TCP ``1735``, ``1740``)
ja: ロボットのTCPと :term:`NetworkTables` (TCP ``1735``, ``1740``)
zh_cn: 机器人 TCP & :term:`NetworkTables` (TCP ``1735``, ``1740``)

source: Plug directly from your computer into the wireless bridge ethernet port closest to the power jack and make sure no other devices are connected to your computer via ethernet.
es_mx: Conéctelo directamente desde su computadora al puerto ethernet de puente inalámbrico más cercano al conector de alimentación y asegúrese de que no haya otros dispositivos conectados a su computadora a través de ethernet.

source: Todo
es_mx: Qué hacer

source: There are no changes to this tool for the 2021 season so the 20.0.0 version is still the latest available.
es_mx: No hay cambios en esta herramienta para la temporada 2021, por lo que la versión 20.0.0 sigue siendo la última disponible.

source: For the FRC Radio Configuration Utility to program the OM5P-AN and OM5P-AC radio, the radio must be running an FRC specific build of the OpenWRT firmware. OM5P-AC radios in the 2019 KoP should not need an update.
es_mx: Para que la FRC Radio Configuration Utility pueda programar la radio OM5P-AN y OM5P-AC, la radio debe estar ejecutando una compilación específica de FRC del firmware OpenWRT. Las radios OM5P-AC en el KoP de 2019 no deberían necesitar una actualización.

source: Radios used in 2019 **do not** need to be updated before configuring, the 2020 tool uses the same 2019 firmware.
es_mx: Las radios usados en 2019 **no** necesitan actualizarse antes de configurarlas, la herramienta de 2020 usa el mismo firmware que en 2019.

source: `FRC Radio Configuration 23.0.2 Israel Version <https://firstfrc.blob.core.windows.net/frc2023/Radio/FRC_Radio_Configuration_23_0_2_IL.zip>`_
ja: `FRC Radio Configuration 23.0.2 イスラエル・バージョン <https://firstfrc.blob.core.windows.net/frc2023/Radio/FRC_Radio_Configuration_23_0_2_IL.zip>`_

source: :term:`DHCP` server enabled. Serves out:
ja: :term:`DHCP` サーバーの有効化。以下のIPに対応：
