Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-3/radio-programming.po
Languages: es_mx, fr_ca, ja, zh_cn

source: Programming your Radio
es_mx: Programando su Radio
fr_ca: Programmation de votre Radio
ja: ラジオの設定
zh_cn: 给你的路由器编程

source: This guide will show you how to use the FRC\ |reg| Radio Configuration Utility software to configure your robot's wireless bridge for use outside of FRC events.
es_mx: Esta guía le enseñará cómo usar el software FRC\ |reg| Radio Configuration Utility para configurar el puente inalámbrico de su robot para usarlo fuera de los eventos de FRC.
fr_ca: Ce guide vous montrera comment utiliser le logiciel FRC\ |reg| Radio Configuration Utility pour configurer le pont sans fil (Wireless bridge) de votre robot pour une utilisation en dehors des événements officiels de la FRC.
ja: このガイドでは、FRCイベント以外でも使用できるようにロボットの無線ブリッジを設定するために、FRC\ |reg| 無線設定ユーティリティソフトウェアを使用する方法を説明します。
zh_cn: 本指南将向您展示如何使用FRC®Radio Configuration Utility软件来配置机器人的无线连接，来在FRC比赛之外使用。

source: Prerequisites
es_mx: Requisitos previos
fr_ca: Pré-requis
ja: 前提条件
zh_cn: 先行准备

source: The FRC Radio Configuration Utility requires administrator privileges to configure the network settings on your machine. The program should request the necessary privileges automatically (may require a password if run from a non-administrator account), but if you are having trouble, try running it from an administrator account.
es_mx: La FRC Radio Configuration Utility requiere de privilegios de Administrador para configurar ajustes de red en su máquina. El programa debería solicitar los privilegios automáticamente (podría requerir una contraseña si se ejecuta en una cuenta que no sea de Administrador), pero si esta teniendo problemas, intente ejecutarlo desde una cuenta de Administrador.
fr_ca: L'utilitaire FRC Radio Configuration Utility nécessite des privilèges d'administrateur pour configurer les paramètres réseau de votre radio. Le programme doit demander automatiquement les privilèges nécessaires (ceci peut nécessiter un mot de passe s'il est exécuté à partir d'un compte non administrateur), mais si vous rencontrez des problèmes, essayez de l'exécuter à partir d'un compte administrateur.
ja: FRC無線設定ユーティリティを使用してコンピューターのネットワーク設定を行うには、管理者権限が必要です。プログラムは自動的に必要な権限を要求しますが（非管理者アカウントから実行する場合はパスワードが必要な場合があります）、問題がある場合は管理者アカウントから実行してみてください。
zh_cn: FRC 路由器配置工具需要管理员权限才能配置您电脑上的网络设置。该程序会自动请求必要的权限 (如果您使用非管理员帐户登录计算机，则可能需要密码) 。如果遇到问题，尝试用管理员帐户运行。

source: Download the latest FRC Radio Configuration Utility Installer from the following links:
es_mx: Descargue el último instalador de FRC Radio Configuration Utility de los siguientes links:
fr_ca: Téléchargez la toute dernière version du logiciel d'installation de l'utilitaire FRC Radio Configuration Utility à partir des liens suivants:
ja: 以下のリンクから最新のFRC無線設定ユーティリティのインストーラーをダウンロードしてください：
zh_cn: 从以下链接下载最新的 FRC 路由器配置工具安装程序：

source: The _IL version is for Israel teams and contains a version of the OM5PAC firmware with restricted channels for use in Israel.
es_mx: La versión _IL es para los equipos de Israel y contiene una versión del firmware OM5PAC con canales restringidos para uso en Israel.
fr_ca: La version _IL est destinée aux équipes israéliennes et contient une version du firmware OM5PAC avec des canaux restreints pour une utilisation en Israël.
ja: 「_IL」が付いたバージョンはイスラエルチーム用で、イスラエルで使用するためにチャンネルが制限されたバージョンのOM5PACファームウェアが含まれています。
zh_cn: 此 _IL 版本适用于以色列团队。为了使软件能在以色列使用，其包含一个有受限信道的 OM5PAC 固件版本。

source: Before you begin using the software:
es_mx: Antes de empezar a usar el software:
fr_ca: Avant de procéder à l'installation du logiciel:
ja: ソフトウェアを使用する前：
zh_cn: 在开始使用此软件之前：

source: :ref:`Disable all other network adapters <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`
es_mx: :ref:`Deshabilite cualquier otro adaptador de red <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`
fr_ca: :ref:`Désactivez toutes les autres cartes réseau <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`
ja: :ref:`他の全てのネットワークアダプターを無効にする <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`
zh_cn: :ref:`禁用所有其他网络适配器<docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`

source: Plug directly from your computer into the wireless bridge ethernet port closest to the power jack. Make sure no other devices are connected to your computer via ethernet. If powering the radio via PoE, plug an Ethernet cable from the PC into the socket side of the PoE adapter (where the roboRIO would plug in). If you experience issues configuring through the PoE adapter, you may try connecting the PC to the alternate port on the radio.
fr_ca: Branchez directement à partir de votre ordinateur dans le port Ethernet du pont sans fil le plus proche de la prise d’alimentation. Assurez-vous qu’aucun autre appareil n’est connecté à votre ordinateur via le port Ethernet. Si vous alimentez la radio via le port PoE, branchez un câble Ethernet du PC sur le côté de la prise de l’adaptateur PoE (où le roboRIO se brancherait). Si vous rencontrez des problèmes de configuration en vous connectant via l’adaptateur PoE, vous pouvez essayer de connecter le PC à l’autre port de la radio.
ja: 電源ジャックに最も近いワイヤレスブリッジのイーサネットポートとコンピューターを直接繋げてください。他の機器がイーサネット経由でコンピューターに接続されていないことを確認してください。PoE経由で無線機に電源を供給する場合は、PCからのイーサネットケーブルをPoEアダプターのソケット側（roboRIOが差し込まれる場所）に差し込みます。PoEアダプター経由での設定に問題がある場合は、PCを無線機の代替ポートに接続してみてください。

source: The OM5P-AN and AC use the same power plug as the D-Link DAP1522, however they are 12V radios. Wire the radio to the 12V 2A terminals on the VRM (center-pin positive).
es_mx: El OM5P-AN y AC usan el adaptador de corriente que el D-Link DAP 1522, sin embargo, son radios de 12V. Conecte la radio a los terminales de 12V 2A en el VRM (pin central positivo).
fr_ca: Le OM5P-AN et AC utilisent la même prise d'alimentation que le D-Link DAP1522, cependant ce sont des radios de 12V. Branchez la radio aux bornes 12V 2A sur le module VRM (la broche centrale étant de signe positif).
ja: OM5Pの「-AN」型と「-AC」型はD-Link DAP1522と同じ電源プラグを使用しますが、12V無線機です。無線機をVRMの12V 2A端子（センターピンプラス）に配線します。
zh_cn: OM5P-AN 和 AC 使用与 D-Link DAP1522 相同的电源插头，但是它们是 12V 路由器。将路由器连接到 VRM 上的 12V 2A 端口 (中心引脚正极) 。

source: Application Notes
es_mx: Notas de Aplicación
fr_ca: Notes d'application
ja: 応用時の注意点
zh_cn: 应用须知

source: By default, the Radio Configuration Utility will program the radio to enforce the 4Mbps bandwidth limit on traffic exiting the radio over the wireless interface. In the home configuration (AP mode) this is a total, not a per client limit. This means that streaming video to multiple clients is not recommended.
es_mx: Por default, la Radio Configuration Utility programará para imponer el límite de ancho de banda de 4Mbps en el tráfico que sale de la radio a través de la interfaz inalámbrica. En la configuración de inicio (Modo AP) este es un límite total, no por cliente. Esto significa que no se recomienda transmitir video a múltiples clientes.
fr_ca: Par défaut, l'utilitaire FRC Radio Configuration Utility programmera la radio pour appliquer la limite de bande passante de 4 Mbps sur le trafic sortant de la radio via l'interface sans fil. Dans le configuration maison (mode AP), ce nombre de 4Mbps signifie l'utilisation de la totalité de la bande passante, et non une limite par client. Cela veut dire que la vidéo en streaming vers plusieurs clients n'est pas recommandée.
ja: デフォルトでは、無線設定ユーティリティは、無線インターフェースを介して無線機から出るトラフィックに4Mbpsの帯域幅制限を強制するように無線機をプログラムします。家庭用設定（APモード）では、これはクライアントごとの制限ではなく合計です。つまり、複数のクライアントにビデオをストリーミングすることは推奨されません。
zh_cn: 默认情况下，the Radio Configuration Utility程序将对路由器进行编程，以对通过无线接口输出路由器的流量实施4Mbps带宽限制。在家庭配置（AP模式）下，这是总数，而不是每个用户的限制。这意味着将视频流传输到多个用户是不明智的。

source: The Utility has been tested on Windows 7, 8 and 10. It may work on other operating systems, but has not been tested.
es_mx: La Utility ha sido probada en Windows 7, 8 y 10. Puede que trabaje en otros sistemas operativos, pero no ha sido probada.
fr_ca: L’utilitaire a été testé sur Windows 7, 8 et 10. Il peut fonctionner sur d’autres systèmes d’exploitation, mais n’y a pas été testé.
ja: Windows 7、8、および10でユーティリティがテストされました。他のオペレーティングシステムでも動作する可能性がありますが、テストされていません。
zh_cn: 该程序已经在Windows 7、8和10上进行了测试。它可以在其他操作系统上运行，但尚未经过测试。

source: Programmed Configuration
es_mx: Configuración Programada
fr_ca: Configuration programmée
ja: プログラムされた設定
zh_cn: 程控配置

source: Lists the names of each of the status lights on the two legal radios.
fr_ca: Répertorie les noms de chacun des voyants lumineux d’état sur les deux radios légales.
ja: 2つの利用可能なラジオの各ステータスライトの名前をリストアップします。
zh_cn: 列出两个合法收音机上每个状态灯的名称。

source: The Radio Configuration Utility programs a number of configuration settings into the radio when run. These settings apply to the radio in all modes (including at events). These include:
es_mx: La FRC Radio Configuration Utility programa una serie de ajustes de configuración en la radio cuando se inicia. Esta configuración se aplica a la radio en todos los modos (incluso en eventos). Éstos incluyen:
fr_ca: L’utilitaire FRC Radio Configuration Utility programme un certain nombre de paramètres de configuration dans la radio lors de son exécution. Ces paramètres s’appliquent à la radio dans tous les modes (y compris lors d’événements). Il s’agit notamment de:
ja: 無線機設定ユーティリティを実行すると、無線機に多くの設定内容がプログラムされます。これらの設定は、すべてのモード（競技を含む）で無線機に適用されます。これらには以下が含まれます：
zh_cn: 运行时，“路由器配置工具” 会通过内置程序将一些配置直接设定到路由器中。这适用于所有模式下的路由器 (包括在比赛时) 。这些配置包括：

source: Set a static IP of ``10.TE.AM.1``
es_mx: Establecer una IP estática de ``10.TE.AM.1``
fr_ca: Définir une IP statique de ``10.TE.AM.1``
ja: ``10.TE.AM.1`` の静的IPを設定する
zh_cn: 将静态IP设置为``10.TE.AM.1''

source: Set an alternate IP on the wired side of ``192.168.1.1`` for future programming
es_mx: Establecer una IP alternativa en el lado cableado de ``192.168.1.1`` para programación futura
fr_ca: Définir une adresse IP alternative du côté relié par fil de ``192.168.1.1`` pour la programmation future
ja: 将来のプログラミングのために、有線側の代替IPを ``192.168.1.1`` に設定する
zh_cn: 在有线端设置备用IP，`192.168.1.1''以备将来编程

source: Bridge the wired ports so they may be used interchangeably
es_mx: Puentee los puertos cableados para que puedan ser usados indistintamente
fr_ca: Relier des ports câblés afin qu’ils puissent être utilisés de façon interchangeable
ja: 有線ポートをブリッジし、入れ替えても使えるようにする
zh_cn: 桥接有线端口，以便端口互换使用

source: The LED configuration noted in the graphic above.
es_mx: Las configuraciones LED en el gráfico anterior.
fr_ca: La DEL de configuration notée dans le graphique ci-dessus.
ja: 上記の図に示されているLEDの構成。
zh_cn: 上图中指出了LED配置。

source: 4Mb/s bandwidth limit on the outbound side of the wireless interface (may be disabled for home use)
es_mx: Límite de ancho de banda de 4 Mb/s en el lado de salida de la interfaz inalámbrica (puede deshabilitarse para uso doméstico)
fr_ca: Limiter la bande passante à 4 Mo/s du côté sortie de l’interface sans fil (ceci peut être désactivé pour une utilisation à la maison)
ja: ワイヤレスインターフェイスのアウトバウンド側で4Mb/sの帯域幅制限（家庭用では無効にすることも可能）
zh_cn: 无线接口输出侧的带宽限制为4Mb / s（可能禁用以供家庭使用）

source: QoS rules for internal packet prioritization (affects internal buffer and which packets to discard if bandwidth limit is reached). These rules are:
es_mx: Reglas QoS para priorización interna de paquetes (afecta el búfer interno y qué paquetes descartar si se alcanza el límite de ancho de banda). Estas reglas son:
fr_ca: La qualité de service ou QS régularise la hiérarchisation interne des paquets (affecte la mémoire tampon interne et les paquets à éliminer si la limite de bande passante est atteinte). Les règles appliquées sont les suivantes:
ja: 内部パケットの優先順位付けのためのQoSルール（内部バッファに影響し、帯域幅制限に達した場合にどのパケットを破棄するか）。ルールは以下の通り:
zh_cn: 遵从内部数据包优先的QoS规则（影响内部缓冲区且决定如果达到带宽限制则丢弃哪些数据包）。这些规则是：

source: Robot Control and Status (UDP ``1110``, ``1115``, ``1150``)
es_mx: Robot Control y Estatus (UDP ``1110``, ``1115``, ``1150``)
fr_ca: Contrôle et état du robot (UDP ``1110``, ``1115``, ``1150``)
ja: ロボットの制御とステータス (UDP ``1110``, ``1115``, ``1150``)
zh_cn: 机器人控制和状态（UDP``1110''，``1115''，``1150''）

source: Bulk (All other traffic). (disabled if BW limit is disabled)
es_mx: Bulk (todo el resto del tráfico). (deshabilitado si el límite de ancho de banda está deshabilitado)
fr_ca: En vrac (Tout autre trafic). (désactivé si la limite de largeur de bande (BW) est désactivée)
ja: バルク（他のすべてのネットワークトラフィック）。(帯域幅制限が無効の場合、このルールは無効になります。）
zh_cn: 批量（所有其他流量）。 （如果禁用带宽限制，则禁用）

source: DHCP server enabled. Serves out:
es_mx: Servidor DHCP habilitado. Sirve:
fr_ca: Serveur DHCP activé. Sert:
zh_cn: DHCP服务器已启用。提供：

source: ``10.TE.AM.11`` - ``10.TE.AM.111`` on the wired side
es_mx: ``10.TE.AM.11`` - ``10.TE.AM.111`` en el lado cableado
fr_ca: ``10.TE.AM.11`` - ``10.TE.AM.111`` du côté relié par fil
ja: 有線側では、 ``10.TE.AM.11`` 〜 ``10.TE.AM.111``
zh_cn: 接线侧的``10.TE.AM.11''-``10.TE.AM.111''

source: ``10.TE.AM.138`` - ``10.TE.AM.237`` on the wireless side
es_mx: ``10.TE.AM.138`` - ``10.TE.AM.237`` en el lado inalámbrico
fr_ca: ``10.TE.AM.138`` - ``10.TE.AM.237`` du côté sans-fil
ja: 無線側では、 ``10.TE.AM.138`` 〜 ``10.TE.AM.237``
zh_cn: 无线侧的``10.TE.AM.138''-``10.TE.AM.237''

source: Subnet mask of ``255.255.255.0``
es_mx: Máscara de subred ``255.255.255.0``
fr_ca: Masque Subnet de ``255.255.255.0``
ja: ``255.255.255.0`` のサブネットマスク
zh_cn: 子网掩码``255.255.255.0''

source: Broadcast address ``10.TE.AM.255``
es_mx: Dirección de transmisión ``10.TE.AM.255``
fr_ca: Adresse de diffusion ``10.TE.AM.255``
ja: ``10.TE.AM.255`` のブロードキャストアドレス
zh_cn: 广播地址``10.TE.AM.255''

source: DNS server enabled. DNS server IP and domain suffix (``.lan``) are served as part of the DHCP.
fr_ca: Serveur DNS activé. L’adresse IP du serveur DNS et le suffixe de domaine (``.lan``) sont servis dans le cadre du DHCP.
ja: DNSサーバーの有効化。DNSサーバーのIPとドメインの接尾辞 (``.lan``) はDHCPの一部として提供されます。

source: At home only:
es_mx: Solo en casa:
fr_ca: À la maison seulement:
ja: 家庭用のみ：
zh_cn: 仅在家中：

source: SSID may have a "Robot Name" appended to the team number to distinguish multiple networks.
es_mx: El SSID puede tener un "Nombre del robot" anexado al número de equipo para distinguir varias redes.
fr_ca: SSID peut avoir un "Nom de robot" joint au numéro d’équipe pour distinguer plusieurs réseaux.
ja: SSIDは、複数のネットワークを区別するために、チーム番号に「ロボット名」を付加することができます。
zh_cn: SSID可能在团队编号后附加一个“机器人名称”，以区分多个网络。

source: Firewall option may be enabled to mimic the field firewall rules (open ports may be found in the Game Manual)
es_mx: La opción Firewall puede estar habilitada para imitar las reglas del firewall de campo (los puertos abiertos se pueden encontrar en el Manual del Juego)
fr_ca: L’option Pare-feu peut être activée pour imiter les règles du champ pare-feu (pour les ports ouverts veuillez consulter le Manuel de jeu)
ja: ファイアウォールオプションは、フィールドのファイアウォールルールを模倣するために有効にすることができる（利用可能なポートはゲームマニュアルを参照してください）。
zh_cn: 可以启用防火墙选项以模仿现场防火墙规则（可以在游戏手册中找到开放的端口）

source: It is not possible to modify the configuration manually.
es_mx: Esta configuración no se puede modificar manualmente.
fr_ca: Il n'est pas possible de modifier la configuration manuellement.
ja: 設定を手動で変更することはできません。
zh_cn: 无法手动修改配置。

source: Install the Software
es_mx: Instalar el software
fr_ca: Installez le logiciel
ja: ソフトウェアをインストールする
zh_cn: 安装此软件

source: The radio configuration installer .exe file in windows explorer.
fr_ca: Le fichier .exe correspondant au programme d’installation de l'outil de configuration de la radio dans l’explorateur Windows.
ja: Windowsエクスプローラーにあるラジオの設定インストーラー.exeファイル。
zh_cn: Windows 资源管理器中的无线电配置安装程序 .exe 文件。

source: Double click on ``FRC_Radio_Configuration_VERSION.exe`` to launch the installer. Follow the prompts to complete the installation.
es_mx: Haga doble clic en ``FRC_Radio_Configuration_VERSION.exe`` para iniciar el instalador. Siga las indicaciones para completar la instalación.
fr_ca: Double-cliquez sur ``FRC_Radio_Configuration_VERSION.exe`` pour lancer le programme d'installation. Suivez les instructions pour terminer l'installation.
ja: ``FRC_Radio_Configuration_VERSION.exe`` をダブルクリックしてインストーラーを起動してください。指示に従ってインストールを完了してください。
zh_cn: 双击``FRC_Radio_Configuration_VERSION.exe''启动安装程序。按照提示完成安装。

source: Part of the installation prompts will include installing Npcap if it is not already present. The Npcap installer contains a number of checkboxes to configure the install. You should leave the options as the defaults.
es_mx: Algunas de las indicaciones incluirán instalar Npcap si aún no está presente. El instalador de Npcap contiene un número de casillas de verificación para configurar la instalación. Debe dejar las opciones como default.
fr_ca: Durant l'installation, on proposera d'installer Npcap si il n’est pas déjà présent. L’installateur pour Npcap contient un certain nombre de cases à cocher pour configurer l’installation. Vous devez laisser les valeurs par défaut pour chacune des options.
ja: インストールのプロンプトの一部には、Npcapがまだインストールされていない場合にインストールするように求めるものが含まれます。Npcapインストーラには、インストールを設定するためのいくつかのチェックボックスがあります。オプションはデフォルトのままにしておいてください。
zh_cn: 如果尚未安装Npcap，则部分安装提示将包括安装Npcap。Npcap安装程序包含许多用于配置安装的复选框。您应该将这些选项保留为默认值。

source: Launch the software
es_mx: Iniciar el software
fr_ca: Lancer le logiciel
ja: ソフトウェアを起動する
zh_cn: 启动软件

source: The FRC Radio Configuration Utility in the start menu.
fr_ca: L’utilitaire FRC Radio Configuration Utility dans le menu Démarrer.
ja: スタートメニューに表示されるFRC無線設定ユーティリティ。
zh_cn: 开始菜单中的 FRC 无线电配置实用程序。

source: Use the Start menu or desktop shortcut to launch the program.
es_mx: Use el menú de inicio o el atajo del escritorio para iniciar el programa.
fr_ca: Utilisez le menu Démarrer ou le raccourci de bureau pour lancer le programme.
ja: スタートメニューやデスクトップのショートカットを使用して、プログラムを起動してください。
zh_cn: 使用 “开始” 菜单或桌面快捷方式启动程序。

source: If you need to locate the program, it is installed to ``C:\Program Files (x86)\FRC Radio Configuration Utility``. For 32-bit machines the path is ``C:\Program Files\FRC Radio Configuration Utility``
es_mx: Si usted necesita localizar el programa, está instalado en ``C:/Program Files (x86)/FRC Radio Configuration Utility``. Para computadoras de 32-bit la ubicación es ``C:/Program Files/FRC Radio Configuration Utility/``
fr_ca: Si vous avez besoin de localiser le programme, il est installé dans ``C:\Program Files (x86)\FRC Radio Configuration Utility``. Pour les machines 32 bits, le chemin est ``C:\Program Files\FRC Radio Configuration Utility``
ja: プログラムを見つける必要がある場合は、「C:￥Program Files (x86)￥FRC Radio Configuration Utility」にインストールされています。32ビットマシンの場合、パスは「C:￥Program Files￥FRC Radio Configuration Utility」です。
zh_cn: 如果需要找到该程序，则将其安装到``C：\ Program Files（x86）\ FRC Radio Configuration Utility''中。对于32位计算机，路径为``C：\ Program Files \ FRC Radio Configuration Utility''

source: Allow the program to make changes, if prompted
es_mx: Permita que el programa realice cambios, si lo solicita
fr_ca: Autoriser le programme à apporter des modifications, si vous y êtes invité
ja: プロンプトが表示される場合は、プログラムに変更を許可してください
zh_cn: 如果出现弹窗提示，请允许程序对系统进行更改

source: User Account Control dialog that pops up when running the config utility.
fr_ca: Boîte de dialogue User Account Control qui s’affiche lors de l’exécution de l’utilitaire de configuration.
ja: 設定ユーティリティを実行する際に表示されるユーザーアカウント制御ダイアログ。
zh_cn: 运行配置实用程序时弹出的用户帐户控制对话框。

source: A prompt may appear about allowing the configuration utility to make changes to the computer. Click :guilabel:`Yes` if the prompt appears.
fr_ca: Une invite peut s’afficher pour autoriser l’utilitaire de configuration à apporter des modifications à l’ordinateur. Cliquez sur :guilabel:`Yes` si l’invite s’affiche.

source: Select the network interface
es_mx: Seleccione la interfaz de red
fr_ca: Sélectionner l’interface réseau
zh_cn: 选择网络接口

source: Each of the Parts of the Network Interfaces selection pop up.
fr_ca: Chacune des parties de la sélection Network Interfaces apparaît.
zh_cn: 弹出网络接口选择的每个部分。

source: Use the pop-up window to select the which ethernet interface the configuration utility will use to communicate with the wireless bridge. On Windows machines, ethernet interfaces are typically named "Local Area Connection". The configuration utility can not program a bridge over a wireless connection.
es_mx: Use la ventana desplegable para seleccionar cual interfaz ethernet usará la utilidad de configuración para comunicarse con el puente inalámbrico. En máquinas Windows, las interfaces ethernet son llamadas "Local Area Connection". La configuration utility no puede programar el puente sobre una conexión inalámbrica.
fr_ca: Utilisez la fenêtre contextuelle pour sélectionner l’interface ethernet que l’utilitaire de configuration utilisera pour communiquer avec la passerelle sans fil. Sur les ordinateurs Windows, les interfaces ethernet sont généralement nommées "Local Area Connection". L’utilitaire de configuration ne peut pas programmer une passerelle via une connexion sans fil.
zh_cn: 使用弹出窗口选择该程序将用于与路由器通信的以太网接口。在Windows计算机上，以太网接口通常称为“本地连接”。该程序无法对通过无线连接的路由器进行编程

source: If no ethernet interfaces are listed, click :guilabel:`Refresh` to re-scan for available interfaces.
es_mx: Si no hay interfaces ethernet enlistadas, haga clic en :guilabel:`Refresh` para reescanear por interfaces disponibles
fr_ca: Si aucune interface Ethernet n'est répertoriée, cliquez sur :guilabel:`Refresh` pour effectuer une nouvelle recherche des interfaces disponibles.
zh_cn: 如果未列出任何以太网接口，请单击“刷新”以重新扫描可用接口。

source: Select the interface you want to use from the drop-down list.
es_mx: Seleccione la interface que desee del menú desplegable.
fr_ca: Sélectionnez l'interface que vous souhaitez utiliser dans la liste déroulante.
zh_cn: 从下拉列表中选择要使用的接口。

source: Click :guilabel:`OK`.
fr_ca: Cliquez sur :guilabel:`OK`.
zh_cn: 单击确定。

source: Open Mesh Firmware Note
es_mx: Abra Mesh Firmware Note
fr_ca: Note concernant le Firmware Open Mesh
zh_cn: Open Mesh固件说明

source: For the FRC Radio Configuration Utility to program the OM5P-AN and OM5P-AC radio, the radio must be running an FRC specific build of the OpenWRT firmware.
fr_ca: Pour que l’utilitaire de configuration radio FRC puisse programmer la radio OM5P-AN et OM5P-AC, la radio doit fonctionner sous une version FRC spécifique du micrologiciel OpenWRT.

source: If you do not need to update or re-load the firmware, skip the next step.
es_mx: Si no necesita actualizar o recargar el firmware, salte el siguiente paso.
fr_ca: Si vous n’avez pas besoin de mettre à jour ou de réinstaller le firmware, sautez l’étape suivante.
zh_cn: 如果不需要更新或重新加载固件，请跳过下一步。

source: Radios used in 2019/2020/2021 **do not** need to be updated before configuring, the 2022 tool uses the same 2019 firmware.
fr_ca: Les radios utilisées en 2019/2020/2021 **n’ont pas besoin** d’être mises à jour avant la configuration, l’outil 2022 utilise le même firmware qu'en 2019.

source: Loading FRC Firmware to Open Mesh Radio
es_mx: Cargando el Firmware de FRC para radio OpenMesh
fr_ca: Chargement du micrologiciel FRC pour ouvrir la radio Mesh
zh_cn: 将FRC固件加载到Open Mesh Radio

source: Highlighting the radio dropdown and the Load Firmware button on the main configuration utility screen.
fr_ca: Mise en surbrillance de la liste déroulante de la radio et du bouton Load Firmware ou Charger le firmware sur l’écran principal de l’utilitaire de configuration.
zh_cn: 在主配置实用程序屏幕上突出显示无线电下拉菜单和加载固件按钮。

source: If you need to load the FRC firmware (or reset the radio), you can do so using the FRC Radio Configuration Utility.
es_mx: Si necesita cargar el firmware de FRC (o reiniciar el radio), puede hacerlo usando la FRC Radio Configuration Utility.
fr_ca: Si vous devez charger le firmware FRC (ou réinitialiser la radio), vous pouvez le faire à l’aide de l’utilitaire de configuration radio FRC.
zh_cn: 如果您需要加载FRC固件（或重置路由器），则可以使用FRC Radio Configuration Utility程序进行加载。
