Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-overview/3rd-party-libraries.po
Languages: es_mx, fr_ca

source: To remove a library dependency from a project, select **Manage Current Libraries** from the **Manage Vendor Libraries** menu, check the box for any libraries to uninstall and click OK. These libraries will be removed as dependencies from the project.
es_mx: Para quitar una dependencia de biblioteca de un proyecto, seleccione **Administrar bibliotecas actuales** en el menú **Administrar bibliotecas de proveedores**, active la casilla de las bibliotecas que desea desinstalar y haga clic en Aceptar. Estas bibliotecas se quitarán como dependencias del proyecto.
fr_ca: Pour supprimer une dépendance de bibliothèque d'un projet, sélectionnez **Manage Current Libraries** du menu **Manage Vendor Libraries**, cochez la case des bibliothèques à désinstaller et cliquez sur OK. Ces bibliothèques seront supprimées en tant que dépendances du projet.
