Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-overview/3rd-party-libraries.po
Languages: es_mx, fr_ca

source: 3rd Party Libraries
es_mx: Bibliotecas de 3ros
fr_ca: Bibliothèques tierces

source: A number of software components were broken out of WPILib starting in 2017 and are now maintained by the third parties who produce the hardware. See `this <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ blog for more details.
es_mx: Una serie de componentes de software se desglosaron de WPILib a partir de 2017 y ahora son mantenidos por los terceros que producen el hardware. Consulte `este <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ blog para obtener más detalles.
fr_ca: Un certain nombre de composants logiciels ont été supprimés de WPILib à partir de 2017 et sont maintenant maintenus par des tiers qui produisent le matériel en question. Consultez `ce blogue <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ pour plus de détails.

source: Libraries
es_mx: Librerías
fr_ca: Bibliothèques

source: These are **not** links to directly plug in to the VS Code -> Install New Libraries (online) feature. Click these links to visit the vendor site to see whether they offer online installers, offline installers, or both.
es_mx: Estos **no** son vínculos para ir directamente a la función en VS Code -> Instalar nuevas bibliotecas (en línea). Haga clic los enlaces para visitar el sitio del proveedor para ver si ofrecen instaladores en línea, instaladores fuera de línea, o ambos.
fr_ca: Ci-dessous, ce ne sont **pas** des liens pour se connecter directement à la fonction VS Code -> Install New Libraries (online). Cliquez sur ces liens pour visiter le site du fournisseur pour voir s'ils proposent des programmes d'installation en ligne, hors ligne ou les deux.

source: `Analog Devices ADIS16448 IMU <https://github.com/juchong/ADIS16448-roboRIO-Driver>`__ - Driver for ADIS16448 IMU. More info `here <https://wiki.analog.com/first/first_robotics_donation_resources#adis16448_imu_board_for_first_robotics>`__
es_mx: `Analog Devices ADIS16448 IMU <https://github.com/juchong/ADIS16448-roboRIO-Driver>`__ - Controlador para ADIS16448 IMU. Más información `aquí <https://wiki.analog.com/first/first_robotics_donation_resources#adis16448_imu_board_for_first_robotics>`__
fr_ca: `Analog Devices ADIS16448 IMU <https://github.com/juchong/ADIS16448-roboRIO-Driver>`__ - Pilote pour ADIS16448 IMU. Plus d'info `ici <https://wiki.analog.com/first/first_robotics_donation_resources#adis16448_imu_board_for_first_robotics>`__

source: `Analog Devices ADIS16470 IMU <https://github.com/juchong/ADIS16470-roboRIO-Driver>`__ - Driver for ADIS16470 IMU. More info `here <https://wiki.analog.com/first/first_robotics_donation_resources#adis16470_imu_board_for_first_robotics>`__
es_mx: `Analog Devices ADIS16470 IMU <https://github.com/juchong/ADIS16470-roboRIO-Driver>`__ - Controlador para ADIS16470 IMU. Más información `aquí <https://wiki.analog.com/first/first_robotics_donation_resources#adis16470_imu_board_for_first_robotics>`__
fr_ca: `Analog Devices ADIS16470 IMU <https://github.com/juchong/ADIS16470-roboRIO-Driver>`__ - Pilote pour ADIS16470 IMU. Plus d'info `ici <https://wiki.analog.com/first/first_robotics_donation_resources#adis16470_imu_board_for_first_robotics>`__

source: `Copperforge LibCu Software Library <https://copperforge.cc/docs/software/libcu/>`__ - Library for all Copperforge devices including the Lasershark
es_mx: `Librería de Software Copperforge LibCu <https://copperforge.cc/docs/software/libcu/>`__ - Librerpia para todos los dispositivos Copperforge incluyendo el Lasershark
fr_ca: `Copperforge LibCu Software Library <https://copperforge.cc/docs/software/libcu/>`__ - Bibliothèque pour tous les équipements Copperforge, dont Lasershark

source: `CTRE Phoenix Toolsuite <https://www.ctr-electronics.com/control-system/hro.html#product_tabs_technical_resources>`__ - Contains CANCoder, Canifier, Pigeon, Talon FX, Talon SRX, and Victor SPX Libraries and Phoenix Tuner program for configuring CTRE CAN devices
es_mx: `CTRE Phoenix Toolsuite <https://www.ctr-electronics.com/control-system/hro.html#product_tabs_technical_resources>`__ - Contiene librerías de CANCoder, Canifier, Pigeon, Talon FX, Talon SRX, and Victor SPX y Phoenix Tuner program para configurar dispositivos CTRE CAN
fr_ca: `CTRE Phoenix Toolsuite <https://www.ctr-electronics.com/control-system/hro.html#product_tabs_technical_resources>`__ - Incluant les bibliothèques CANCoder, Canifier, Pigeon, Talon FX, Talon SRX, et Victor SPX et le programme Phoenix Tuner pour configurer les appareils CTRE CAN

source: `Digilent <https://reference.digilentinc.com/dmc-60c/getting-started>`__ - DMC-60C library
es_mx: `Digilent <https://reference.digilentinc.com/dmc-60c/getting-started>`__ - librería DMC-60C.
fr_ca: `Digilent <https://reference.digilentinc.com/dmc-60c/getting-started>`__ - Bibliothèque DMC-60C

source: `Playing With Fusion Driver <https://www.playingwithfusion.com/docview.php?docid=1205>`__ - Library for all PWF devices including the Venom motor/controller
es_mx: `Playing With Fusion Driver <https://www.playingwithfusion.com/docview.php?docid=1205>`__ - Biblioteca para todos los dispositivos PWF, incluido el motor/controlador Venom
fr_ca: `Playing With Fusion Driver <https://www.playingwithfusion.com/docview.php?docid=1205>`__ - Bibliothèque pour tous les équipements PWF, dont le moteur/contrôleur Venom

source: `Kauai Labs <https://pdocs.kauailabs.com/navx-mxp/software/roborio-libraries/>`__ - Libraries for NavX-MXP, NavX-Micro, and Sensor Fusion
es_mx: Kauai Labs <https://pdocs.kauailabs.com/navx-mxp/software/roborio-libraries/>`__ - Bibliotecas para NavX-MXP, NavX-Micro y Sensor Fusion
fr_ca: `Kauai Labs <https://pdocs.kauailabs.com/navx-mxp/software/roborio-libraries/>`__ - Bibliothèques pour NavX-MXP, NavX-Micro, et Sensor Fusion

source: `Rev Robotics Color Sensor V3 <http://www.revrobotics.com/rev-31-1557/>`__ - Library for Rev Robotics Color Sensor included in 2020 Kit of Parts
es_mx: `Rev Robotics Color Sensor V3 <http://www.revrobotics.com/rev-31-1557/>`__ - Biblioteca para sensor de color Rev Robotics incluido en el kit de piezas 2020
fr_ca: `Rev Robotics Color Sensor V3 <http://www.revrobotics.com/rev-31-1557/>`__ - Bibliothèque pour le capteur de couleur Rev Robotics faisant partie du kit de pièces 2020

source: `Rev Robotics SPARK MAX <https://www.revrobotics.com/sparkmax-software/>`__ - SPARK MAX Library
es_mx: `Rev Robotics SPARK MAX <https://www.revrobotics.com/sparkmax-software/>`__ - Biblioteca SPARK MAX
fr_ca: `Rev Robotics SPARK MAX <https://www.revrobotics.com/sparkmax-software/>`__ - Bibliothèque SPARK MAX

source: Community Libraries
fr_ca: Bibliothèques communautaires

source: `PhotonVision <https://docs.photonvision.org/en/latest/docs/programming/photonlib/adding-vendordep.html>`_ - Library for PhotonVision CV software
fr_ca: Bibliothèque du logiciel PhotonVision CV `PhotonVision <https://docs.photonvision.org/en/latest/docs/programming/photonlib/adding-vendordep.html>`_

source: WPILib Command Libraries
es_mx: Bibliotecas de comandos WPILib
fr_ca: Bibliothèques de commandes WPILib

source: The WPILib :doc:`old </docs/software/old-commandbased/index>` and :doc:`new </docs/software/commandbased/index>` command libraries have been split into vendor libraries in order to reduce the chances of mixing the two which will not work correctly. They are both installed by the wpilib installer for offline installation. They may also be installed with the following online links:
es_mx: Las bibliotecas de comandos WPILib :doc:`antiguas </docs/software/old-commandbased/index>` y :doc:`nuevas </docs/software/commandbased/index>` se han dividido en bibliotecas de proveedores con el fin de reducir las posibilidades de mezclar las dos que no funcionarán correctamente. Ambos son instalados por el instalador wpilib para la instalación sin conexión. También se pueden instalar con los siguientes enlaces en línea:
fr_ca: Les bibliothèques de commandes WPILib :doc:`old </docs/software/old-commandbased/index>` and :doc:`new </docs/software/commandbased/index>` ont été organisées en bibliothèques de fournisseurs afin de réduire les chances de mélanger les deux, ce qui ne fonctionnerait pas correctement. Elles sont toutes deux installées par le programme d'installation de wpilib pour une installation hors ligne. Elles peuvent également être installées avec les liens en ligne suivants:

source: `Old Command Library <https://raw.githubusercontent.com/wpilibsuite/allwpilib/master/wpilibOldCommands/WPILibOldCommands.json>`__
es_mx: `Biblioteca de comandos antigua <https://raw.githubusercontent.com/wpilibsuite/allwpilib/master/wpilibOldCommands/WPILibOldCommands.json>`__
fr_ca: `Bibliothèque de commandes Old <https://raw.githubusercontent.com/wpilibsuite/allwpilib/master/wpilibOldCommands/WPILibOldCommands.json>`__

source: `New Command Library <https://raw.githubusercontent.com/wpilibsuite/allwpilib/master/wpilibNewCommands/WPILibNewCommands.json>`__
es_mx: `Nueva biblioteca de comandos <https://raw.githubusercontent.com/wpilibsuite/allwpilib/master/wpilibNewCommands/WPILibNewCommands.json>`__
fr_ca: `Bibliothèque de commandes New <https://raw.githubusercontent.com/wpilibsuite/allwpilib/master/wpilibNewCommands/WPILibNewCommands.json>`__

source: The Mechanism
es_mx: El mecanismo
fr_ca: Processus

source: In support of this effort NI (for LabVIEW) and FIRST/WPI (for C++/Java) have developed mechanisms that should make it easy for vendors to plug their code into the WPILib software and for teams to use that code once it has been installed. A brief description of how the system works for each language can be found below.
es_mx: En apoyo de este esfuerzo NI (para LabVIEW) y FIRST/WPI (para C++/Java) han desarrollado mecanismos que deberían facilitar a los proveedores conectar su código al software WPILib y que los equipos usen ese código una vez que se ha instalado. A continuación, encontrará una breve descripción de cómo funciona el sistema para cada idioma.
fr_ca: NI (pour LabVIEW) et FIRST/WPI (pour C ++ / Java) ont développé des mécanismes pour permettre aux fournisseurs d'intégrer facilement leur code au logiciel WPILib et aux équipes d'utiliser ce code une fois installé. . Vous trouverez ci-dessous une brève description du fonctionnement du système pour chaque langage.

source: The Mechanism - LabVIEW
es_mx: El mecanismo - LabVIEW
fr_ca: Processus - LabVIEW

source: For LabVIEW teams, you may notice a few new Third Party items on various palettes (specifically, one in Actuators, one in Actuators->Motor Control labeled “CAN Motor”, and one in “Sensors”). These correspond to folders in ``C:\Program Files\National Instruments\LabVIEW 2016\vi.lib\Rock Robotics\WPI\Third Party``.
es_mx: Para los equipos LabVIEW, puede notar algunos elementos nuevos de terceros en varias paletas (específicamente, uno en Actuadores, uno en Actuadores->Control de motor etiquetado como "Motor CAN", y uno en "Sensores"). Estos corresponden a carpetas en C:\Program Files\National Instruments\ LabVIEW 2016\vi.lib\Rock Robotics\WPI\Third Party.
fr_ca: Pour les équipes travaillant avec LabVIEW, vous remarquerez peut-être quelques nouveaux éléments tiers sur diverses palettes (spécifiquement: un dans Actuators, un dans Actuators->Motor Control labeled “CAN Motor”, et un dans “Sensors”). Ils correspondent aux dossiers dans ``C:\Program Files\National Instruments\LabVIEW 2016\vi.lib\Rock Robotics\WPI\Third Party``.

source: For a library to insert VI’s in these palettes, they simply make a subfolder in one of these three Third Party folders containing their VIs and they will be added automatically. To control the appearance of the palette (have some VI’s not show up, set the Icon for the folder, etc.) there is a process to create a dir.mnu file for your directory. We will be working on documenting that process shortly.
es_mx: Para que una biblioteca inserte VI en estas paletas, simplemente crean una subcarpeta en una de estas tres carpetas de terceros que contienen sus VIs y se agregarán automáticamente. Para controlar el aspecto de la paleta (que algunos VI no aparezcan, configure el icono de la carpeta, etc.) hay un proceso para crear un archivo dir.mnu para su directorio. Estaremos trabajando en la documentación de ese proceso en breve.
fr_ca: Pour qu'une bibliothèque insère des VIs dans ces palettes, les fournisseurs créent simplement un sous-dossier dans l'un de ces trois dossiers tiers contenant leurs VIs et ils seront ajoutés automatiquement. Pour contrôler l'apparence de la palette (ne pas afficher certains VI, définir l'icône du dossier, etc.), il existe un processus pour créer un fichier dir.mnu dans votre répertoire. Nous produirons la documentation de ce processus sous peu.

source: To use installed Third Party libraries, simply locate the VIs in one of these 3 locations and drag them into your project as you would with any other VI.
es_mx: Para utilizar las bibliotecas de terceros instaladas, simplemente localice los VI en una de estas 3 ubicaciones y arrástrelos a su proyecto como lo haría con cualquier otro VI.
fr_ca: Pour utiliser les bibliothèques tierces installées, localisez simplement les VI dans l'un des 3 emplacements et faites-les glisser dans votre projet comme vous le feriez avec n'importe quel autre VI.

source: The Mechanism - C++/Java
es_mx: El mecanismo - C++/Java
fr_ca: Processus - C++/Java

source: For C++ and Java a JSON file describing the vendor library is installed on your system to ``~/wpilib/YYYY/vendordeps`` (where YYYY is the year and ~ is ``C:\Users\Public`` on Windows). This can either be done by an offline installer or the file can be fetched from an online location using the menu item in Visual Studio Code. This file is then used from VS Code to add to the library to each individual project. Vendor library information is managed on a per-project basis to make sure that a project is always pointing to a consistent version of a given vendor library. The libraries themselves are placed in the Maven cache at ``C:\Users\Public\wpilib\YYYY\maven``. Vendors can place a local copy here with an offline installer (recommended) or require users to be online for an initial build to fetch the library from a remote Maven location.
es_mx: Para C++ y Java, se instala un archivo JSON que describe la biblioteca de proveedores en el sistema en ~/ wpilib/YYYY/vendordeps (Dónde YYYY es el año y ~ es C:\Users\Public en Windows). Esto se puede hacer mediante un instalador sin conexión o el archivo se puede obtener desde una ubicación en línea mediante el elemento de menú en Visual Studio Code. A continuación, este archivo se utiliza desde VS Code para agregar a la biblioteca a cada proyecto individual. La información de la biblioteca de proveedores se administra por proyecto para asegurarse de que un proyecto siempre apunta a una versión coherente de una biblioteca de proveedores determinada. Las propias bibliotecas se colocan en la caché de Maven en C:\Users\Public\wpilib\ YYYY\maven. Los proveedores pueden colocar una copia local aquí con un instalador sin conexión (recomendado) o requerir que los usuarios estén en línea para una compilación inicial para recuperar la biblioteca desde una ubicación remota de Maven.
fr_ca: Pour C ++ et Java, un fichier JSON décrivant la bibliothèque du fournisseur est installé sur votre système dans ``~/wpilib/YYYY/vendordeps`` (où YYYY est l'année et ~ est ``C:\Users\Public`` sur Windows) . Cela peut être fait par un programme d'installation hors ligne ou le fichier peut être récupéré en ligne à l'aide du menu dans Visual Studio Code. Ce fichier est ensuite utilisé à partir de VS Code pour être ajouté à la bibliothèque de chaque projet individuel. Les informations de la bibliothèque du fournisseur sont gérées par projet pour garantir qu'un projet pointe toujours vers une version cohérente de la bibliothèque du fournisseur donné. Les bibliothèques elles-mêmes sont placées dans le cache Maven sur ``C:\Users\Public\wpilib\YYYY\maven``. Les fournisseurs peuvent placer une copie locale ici avec un programme d'installation hors ligne (recommandé) ou exiger que les utilisateurs soient en ligne pour la génération initiale afin de récupérer la bibliothèque à partir d'un emplacement Maven distant.

source: The JSON file allows specification of complex libraries with multiple components (C++, Java, JNI, etc.) and also helps handle some complexities related to simulation. Vendors choosing to provide a remote URL in the JSON also enable users to check for updates from within VS Code.
es_mx: El archivo JSON permite la especificación de bibliotecas complejas con multiples componentes (C++, Java, JNI, etc.) y también ayuda a manejar algunas complejidades relacionadas con la simulación. Los proveedores que eligen proporcionar una dirección URL remota en el JSON también permiten a los usuarios buscar actualizaciones desde VS Code.
fr_ca: Le fichier JSON permet de spécifier des bibliothèques complexes avec plusieurs composants (C ++, Java, JNI, etc.) et aide également à gérer certaines complexités liées à la simulation. Les fournisseurs qui choisissent de fournir une URL distante dans le fichier JSON permettent également aux utilisateurs de rechercher des mises à jour à partir de VS Code.

source: The vendor JSON files are actually processed by GradleRIO once they are in your projects vendordeps folder. If you are using another IDE, you will need to manually create a “vendordeps” folder in your project and copy any desired vendor JSON files from the “wpilib/YYYY” folder (where they should be placed by an offline installer) or download them directly from the vendor and place them into the folder in the project.
es_mx: GradleRIO procesa los archivos JSON del proveedor una vez que se encuentran en la carpeta vendordeps de sus proyectos. Si utiliza otro IDE, deberá crear manualmente una carpeta "vendordeps" en el proyecto y copiar los archivos JSON de proveedor deseados desde la carpeta "wpilib/YYYY" (donde deben colocarlos un instalador sin conexión) o descargarlos directamente del proveedor y colocarlos en la carpeta del proyecto.
fr_ca: Les fichiers JSON des fournisseurs sont traités par GradleRIO une fois qu'ils sont dans le dossier vendordeps de votre projet. Si vous utilisez un autre IDE, vous devrez créer manuellement un dossier "vendordeps" dans votre projet et copier les fichiers JSON du fournisseur à partir du dossier "wpilib/YYYY" (où ils seraient placés par un installateur hors ligne) ou téléchargez-les directement du fournisseur et placez-les dans le dossier du projet.

source: Adding an Offline-Installed Library
es_mx: Añadiendo una biblioteca instalada sin conexión
fr_ca: Ajout d'une bibliothèque installée hors ligne

source: To add a vendor library that has been installed by an offline installer, press **Ctrl+Shift+P** and type WPILib or click on the WPILib icon in the top right to open the WPILib Command Palette and begin typing **Manage Vendor Libraries**, then select it from the menu. Select the option to **Install new libraries (offline)**.
es_mx: Para agregar una biblioteca de proveedores que ha sido instalada por un instalador sin conexión, presione **Ctrl+Mayús+P** y escriba WPILib o haga clic en el icono WPILib en la parte superior derecha para abrir la paleta de comandos WPILib y empiece a escribir **Administrar bibliotecas de proveedores** y, a continuación, selecciónelo en el menú. Seleccione la opción **Instalar nuevas bibliotecas (sin conexión)**.
fr_ca: Pour ajouter une bibliothèque de fournisseur qui a été installée par un programme d'installation hors ligne, appuyez sur **Ctrl+Maj+P** et tapez WPILib ou cliquez sur l'icône WPILib en haut à droite pour ouvrir la palette de commandes WPILib puis tapez **Manage Vendor Libraries**, puis sélectionnez la commande dans le menu. Sélectionnez l'option **Install new libraries (offline)**.

source: Select the desired libraries to add to the project by checking the box next to each, then click OK. The JSON file will be copied to the **vendordeps** folder in the project, adding the library as a dependency to the project.
es_mx: Seleccione las bibliotecas deseadas para agregarlas al proyecto marcando la casilla situada junto a cada una y, a continuación, haga clic en Aceptar. El archivo JSON se copiará en la carpeta **vendordeps** del proyecto, agregando la biblioteca como una dependencia al proyecto.
fr_ca: Sélectionnez les bibliothèques à ajouter au projet en cochant la case à côté de chacune, puis cliquez sur OK. Le fichier JSON sera copié dans le dossier **vendordeps** du projet, en ajoutant la bibliothèque au projet.

source: Checking for Updates (Offline)
es_mx: Buscando actualizaciones (Desconectado)
fr_ca: Vérification des mises à jour (hors ligne)

source: Remember: Dependencies are now version managed and done on a per-project bases. Even if you have installed an updated library using an offline installer, you will need to Manage Vendor Libraries and select **Check for updates (offline)** for each project you wish to update.
es_mx: Recuerde: las dependencias ahora se administran por versión y se realizan por proyecto. Incluso si ha instalado una biblioteca actualizada utilizando un instalador sin conexión, deberá administrar las bibliotecas de proveedores y seleccionar **Buscar actualizaciones (sin conexión)** para cada proyecto que desee actualizar.
fr_ca: Rappel: les dépendances sont désormais gérées par version et effectuées par projet. Même si vous avez installé une bibliothèque mise à jour à l'aide d'un programme d'installation hors ligne, vous devrez gérer les bibliothèques des fournisseurs, Manage Vendor Libraries, et sélectionner**Check for updates (offline)** pour chaque projet que vous souhaitez mettre à jour.

source: Checking for Updates (Online)
es_mx: Buscando actualizaciones (En Linea)
fr_ca: Vérification des mises à jour (en ligne)

source: Part of the JSON file that vendors may optionally populate is an online update location. If a library has an appropriate location specified, running **Check for updates (online)** will check if a newer version of the library is available from the remote location.
es_mx: Parte del archivo JSON que los proveedores pueden rellenar opcionalmente es una ubicación de actualización en línea. Si una biblioteca tiene una ubicación adecuada especificada, la ejecución de **Buscar actualizaciones (online)** comprobará si hay una versión más reciente de la biblioteca disponible en la ubicación remota.
fr_ca: Une partie du fichier JSON que les fournisseurs peuvent éventuellement remplir est un emplacement de mise à jour en ligne. Si un emplacement est spécifié pour une bibliothèque, l'exécution de **Check for updates (online)** vérifiera si une version plus récente de la bibliothèque est disponible à partir de l'emplacement distant.

source: Removing a Library Dependency
es_mx: Eliminación de una dependencia de biblioteca
fr_ca: Suppression d'une dépendance
