Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-overview/debugging-robot-program.po
Languages: es_mx

source: Debugging a Robot Program
es_mx: Depuración de un programa de robot

source: Inevitably, a program will not behave in the way we expect it to behave. When this occurs, it becomes necessary to figure out why the program is doing what it is doing, so that we can make it do what we want it to do, instead. Such an undesired program behavior is called a "bug," and this process is called "debugging."
es_mx: Inevitablemente, un programa no se comportará de la manera que esperamos que se comporte. Cuando esto ocurre, es necesario averiguar por qué el programa está haciendo lo que está haciendo, para que podamos hacer que haga lo que queremos que haga, en su lugar. Este comportamiento de programa no deseado se denomina "error", y este proceso se denomina "depuración".

source: A debugger is a tool used to control program flow and monitor variables in order to assist in debugging a program. This section will describe how to set up a debug session for an FRC robot program.
es_mx: Un depurador es una herramienta que se utiliza para controlar el flujo del programa y supervisar las variables con el fin de ayudar a depurar un programa. Esta sección describirá cómo configurar una sesión de depuración para un programa de robot FRC.

source: For beginning users who need to debug their programs but do not know/have time to learn how to use a debugger, it is often possible to debug a program simply by printing the relevant program state to the console. However, it is strongly recommended that students eventually learn to use a debugger.
es_mx: Para los usuarios principiantes que necesitan depurar sus programas pero no saben/tienen tiempo para aprender a usar un depurador, a menudo es posible depurar un programa simplemente imprimiendo el estado del programa relevante en la consola. Sin embargo, se recomienda encarecidamente que los alumnos finalmente aprendan a usar un depurador.

source: A "breakpoint" is a line of code at which the debugger will stop the program execution so that the user can examine the program state. This is extremely useful while debugging, as it allows the user to pause the program at specific points in problematic code to determine where exactly the program is deviating from the expected behavior.
es_mx: Un "breakpoint" es una línea de código en la que el depurador detendrá la ejecución del programa para que el usuario pueda examinar el estado del programa. Esto es extremadamente útil durante la depuración, ya que permite al usuario pausar el programa en puntos específicos en código problemático para determinar dónde exactamente el programa se está desviando del comportamiento esperado.

source: Setting a Breakpoint
es_mx: Estableciendo un Breakpoint

source: |Setting a Breakpoint|
es_mx: |Estableciendo un Breakpoint|

source: Double-click in the left margin of the source code window to set a breakpoint in your user program: A small red circle indicates the breakpoint has been set on the corresponding line.
es_mx: Haga doble clic en el margen izquierdo de la ventana del código fuente para establecer un breakpoint en el programa: el pequeño círculo rojo indica que el breakpoint se ha establecido en la línea correspondiente.

source: Viewing Program State
es_mx: Visualización del estado del programa

source: |Debug Tab|
es_mx: |Ventana de depuración|

source: When the program is stopped at a breakpoint, various pieces of program state can be viewed from the debug tab. The Debug tab is accessed by clicking on the debug icon on the far left pane. Within the debug tab, the program state can be viewed from an assortment of "panes."
es_mx: Cuando el programa se detiene en un breakpoint, se pueden ver varias partes del estado del programa desde la pestaña de depuración. Se accede a la pestaña Depurar haciendo clic en el icono de depuración en el panel izquierdo. Dentro de la pestaña de depuración, el estado del programa se puede ver desde una variedad de "paneles."

source: The Variables Pane
es_mx: El panel de variables

source: |Variables Pane|
es_mx: |Panel de variables|

source: The Variables view shows the current values of variables. To see a variable that is not displayed, select the “Watch” pane and enter the variable name. This will show the variable’s value if it’s in-scope. Clicking on the arrows next to a variable name will expand the tree and show its `fields <https://en.wikipedia.org/wiki/Field_(computer_science)>`__.
es_mx: La vista Variables muestra los valores actuales de las variables. Para ver una variable que no se muestra, seleccione el panel "Ver" e introduzca el nombre de la variable. Esto mostrará el valor de la variable si está en el ámbito. Al hacer clic en las flechas junto a un nombre de variable se expandirá el árbol y se mostrarán sus `campos <https://en.wikipedia.org/wiki/Field_(computer_science)>`__.

source: Watch Pane
es_mx: Panel de observación

source: |Watch Pane|
es_mx: |Panel de observación|

source: The Watch Pane can be used to monitor specific variables or expressions while debugging. To add an expression, right-click and select Add Expression.
es_mx: El panel de observación se puede utilizar para supervisar variables o expresiones específicas durante la depuración. Para agregar una expresión, haga clic con el botón derecho y seleccione Agregar expresión.

source: Call Stack
es_mx: Pila de llamadas

source: |Call Stack|
es_mx: |Pila de llamadas|

source: The Call Stack pane is used to display the current `call stack <https://en.wikipedia.org/wiki/Call_stack>`__ of the running program. This can be used to monitor the current call hierarchy of the program while debugging.
es_mx: El panel Pila de llamadas se utiliza para mostrar la `pila de llamadas <https://en.wikipedia.org/wiki/Call_stack>`__ actual del programa en ejecución. Esto se puede utilizar para supervisar la jerarquía de llamadas actual del programa durante la depuración.

source: Breakpoint Pane
es_mx: Panel de Breakpoint

source: |Breakpoint Pane|
es_mx: |Panel de Breakpoint|

source: The Breakpoint Pane displays all of the current breakpoints. To temporarily disable a breakpoint without permanently removing it, click the corresponding checkbox.
es_mx: El panel breakpoint muestra todos los breakpoint actuales. Para desactivar temporalmente un breakpoint sin eliminarlo permanentemente, haga clic en la casilla correspondiente.

source: Running the Debugger
es_mx: Ejecución del depurador

source: |Start Debugging|
es_mx: |Iniciar depuración|

source: Press Ctrl+Shift+P and type WPILib or click on the WPILib Menu item to open the Command palette with WPILib pre-populated. Type Debug and select the Debug Robot Code menu item to start debugging. The code will download to the roboRIO and begin debugging.
es_mx: Presione Ctrl+Mayús+P y escriba WPILib o haga clic en el elemento Menú WPILib para abrir la paleta Comandos con WPILib rellenado previamente. Escriba Depurar y seleccione el elemento de menú Depurar código robot para iniciar la depuración. El código se descargará en la roboRIO y comenzará la depuración.

source: The debugger will automatically pause at the first breakpoint it encounters. The user can then tell the debugger when to proceed to the next breakpoint.
es_mx: El depurador se detendrá automáticamente en el primer breakpoint que encuentre. A continuación, el usuario puede indicar al depurador cuándo pasar al siguiente breakpoint.

source: Debugging with Console
es_mx: Depuración con consola

source: Another way to debug your program is to use System.out.println statements in your code and receive them using the RioLog in Visual Studio Code.
es_mx: Otra forma de depurar el programa es usar instrucciones System.out.println en el código y recibirlas mediante RioLog en Visual Studio Code.
