Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-overview/importing-eclipse-project.po
Languages: es_mx

source: Importing an Eclipse project into VS Code
es_mx: Importando un proyecto de eclipse en VS Code

source: To make it easy for teams to use existing projects with the new IDE, WPILib includes a wizard for importing Eclipse projects into VS Code. This will generate the necessary Gradle components and load the project into VS Code. The importer automatically imports the old command framework 3rd party library.
es_mx: Para facilitar a los equipos el uso de proyectos existentes con el nuevo IDE, WPILib incluye un asistente para importar proyectos eclipse en VS Code. Esto generará los componentes Gradle necesarios y cargará el proyecto en VS Code. El importador importa automáticamente la antigua biblioteca de 3ra parte del marco de comandos.

source: Launching the Import Wizard
es_mx: Iniciar el Asistente para importación

source: |Launching Import Wizard|
es_mx: |Iniciar el Asistente para importación|

source: Press Ctrl+Shift+P and type "WPILib" or click the WPILib icon to locate the WPILib commands. Begin typing "Import a WPILib Eclipse project" and select it from the dropdown.
es_mx: Presione Ctrl+Mayús+P y escriba "WPILib" o haga clic en el icono WPILib para localizar los comandos WPILib. Comience a escribir "Importar un proyecto WPILib Eclipse" y selecciónelo en el menú desplegable.

source: |Eclipse Project Importer|
es_mx: |Importando un proyecto de eclipse|

source: You'll be presented with the WPILib Eclipse Project Upgrade window. This is similar to the process of creating a new project and the window and the steps are shown below. This window contains the following elements:
es_mx: Se le presentará la ventana Actualización del proyecto Eclipse WPILib. Esto es similar al proceso de creación de un nuevo proyecto y la ventana y los pasos se muestran a continuación. Esta ventana contiene los siguientes elementos:

source: **Eclipse Project Selection**: Selects the Eclipse project to be imported. Users should select the build.properties file in the root directory of the eclipse project.
es_mx: **Selección de Proyecto Eclipse:** Selecciona el proyecto Eclipse que se va a importar. Los usuarios deben seleccionar el archivo build.properties en el directorio raíz del proyecto de eclipse.

source: **Project Location**: This determines the folder in which the robot project will be located.
es_mx: **Localización del proyecto:** Esto determina la carpeta en la que se ubicará el proyecto del robot.

source: **Create New Folder**: If this is checked, a new folder will be created to hold the project within the previously-specified folder. If it is *not* checked, the project will be located directly in the previously-specified folder. An error will be thrown if the folder is not empty and this is not checked.
es_mx: **Crear una nueva carpeta**: Si se activa esta opción, se creará una nueva carpeta para contener el proyecto dentro de la carpeta especificada anteriormente. Si no está marcado, el proyecto se ubicará directamente en la carpeta especificada anteriormente. Se producirá un error si la carpeta no está vacía y esto no está comprobado.

source: **Project Name**: The name of the robot project. This also specifies the name that the project folder will be given if the Create New Folder box is checked.
es_mx: **Nombre del proyecto**: El nombre del proyecto del robot. Esto también especifica el nombre que se dará a la carpeta del proyecto si la casilla Crear nueva carpeta está activada.

source: **Team Number**: The team number for the project, which will be used for package names within the project and to locate the robot when deploying code.
es_mx: **Número del equipo**: El número de equipo del proyecto, que se usará para los nombres de paquetes dentro del proyecto y para localizar el robot al implementar código.

source: Click "Upgrade Project" to begin the upgrade.
es_mx: Dé clic en “Actualizar proyecto” para empezar la actualización.

source: The eclipse project will be upgraded and copied into the new project directory. You can then either open the new project immediately (the pop-up shown below should appear in the bottom right) or open it later using the Ctrl-O (or Command-O for macOS) shortcut.
es_mx: El proyecto de eclipse se actualizará y se copiará en el nuevo directorio del proyecto. A continuación, puede abrir el nuevo proyecto inmediatamente (la ventana emergente que se muestra a continuación debe aparecer en la parte inferior derecha) o abrirlo más tarde mediante el acceso directo Ctrl-O (o Comando-O para macOS).

source: |Opening Project|
es_mx: |Abriendo proyecto|

source: C++ Configurations (C++ Only)
es_mx: Configuraciones de C++ (solo C++)

source: For C++ projects, there is one more step to set up IntelliSense. Whenever you open a project, you should get a pop-up in the bottom right corner asking to refresh C++ configurations. Click "Yes" to set up IntelliSense.
es_mx: Para los proyectos de C++, hay un paso más para configurar IntelliSense. Cada vez que abra un proyecto, debe obtener una ventana emergente en la esquina inferior derecha que pide actualizar las configuraciones de C++. Haga clic en "Sí" para configurar IntelliSense.

source: |C++ Configurations|
es_mx: |Configuraciones C++|
