Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-overview/importing-gradle-project.po
Languages: es_mx

source: Importing a Gradle Project
es_mx: Importación de un proyecto de Gradle

source: Due to changes in the project, it is necessary to update the build files for a previous years Gradle project. To make it easy for teams to import previous years gradle projects into the current year's framework, WPILib includes a wizard for importing previous years projects into VS Code. This will generate the necessary gradle components and load the project into VS Code. In place upgrades are not supported. The importer automatically imports the old command framework 3rd party library.
es_mx: Debido a los cambios en el proyecto, es necesario actualizar los archivos de compilación para un proyecto de Gradle de años anteriores. Para facilitar que los equipos importen proyectos de Gradle de años anteriores en el marco del año actual, WPILib incluye un asistente para importar proyectos de años anteriores en VS Code. Esto generará los componentes de gradle necesarios y cargará el proyecto en VS Code. Las actualizaciones en el lugar no son compatibles. El importador importa automáticamente la antigua biblioteca de 3ros del marco de comandos.

source: The import process copies your project from the current directory to a new directory and completely regenerates the gradle files. If you made non-standard updates to the build.gradle, you will need to make those changes again. For this reason, in place upgrades are not supported. It is also necessary to import vendor libraries again, since last year's vendor libraries must be updated to be compatible with this year's projects.
es_mx: El proceso de importación copia su proyecto del directorio actual a un nuevo directorio y regenera completamente los archivos gradle. Si realizó actualizaciones no estándar en build.gradle, deberá realizar esos cambios nuevamente. Por esta razón, las actualizaciones en el lugar no son compatibles. También es necesario volver a importar las bibliotecas de proveedores, ya que las bibliotecas de proveedores del año pasado deben actualizarse para que sean compatibles con los proyectos de este año.

source: Launching the Import Wizard
es_mx: Iniciar el Asistente para importación

source: When you open a previous year's project, you will be prompted to import that project. Click yes.
es_mx: Al abrir el proyecto de un año anterior, se le pedirá que importe ese proyecto. Haga clic en Sí.

source: Alternately, you can chose to import it from the menu. Press Ctrl+Shift+P and type "WPILib" or click the WPILib icon to locate the WPILib commands. Begin typing "Import a WPILib 2019 Gradle project" and select it from the dropdown as shown below.
es_mx: Como alternativa, puede elegir importarlo desde el menú. Presione Ctrl+Mayús+P y escriba "WPILib" o haga clic en el icono WPILib para localizar los comandos WPILib. Comience a escribir "Importar un proyecto de Gradle WPILib 2019" y selecciónelo en el menú desplegable como se muestra a continuación.

source: You'll be presented with the WPILib Project Importer window. This is similar to the process of creating a new project and the window and the steps are shown below. This window contains the following elements:
es_mx: Se le presentará la ventana Importador de proyectos WPILib. Esto es similar al proceso de creación de un nuevo proyecto y la ventana y los pasos se muestran a continuación. Esta ventana contiene los siguientes elementos:

source: **Gradle Project**: Selects the project to be imported. Users should select the build.gradle file in the root directory of the gradle project.
es_mx: **Proyecto Gradle**: selecciona el proyecto a importar. Los usuarios deben seleccionar el archivo build.gradle en el directorio raíz del proyecto gradle.

source: **Project Location**: This determines the folder in which the robot project will be located.
es_mx: **Ubicación del proyecto**: determina la carpeta en la que se ubicará el proyecto del robot.

source: **Create New Folder**: If this is checked, a new folder will be created to hold the project within the previously-specified folder. If it is *not* checked, the project will be located directly in the previously-specified folder. An error will be thrown if the folder is not empty and this is not checked.
es_mx: **Crear nueva carpeta**: Si se activa esta opción, se creará una nueva carpeta para contener el proyecto dentro de la carpeta especificada anteriormente. Si no está marcado, el proyecto se ubicará directamente en la carpeta especificada anteriormente. Se producirá un error si la carpeta no está vacía y esto no está comprobado.

source: **Project Name**: The name of the robot project. This also specifies the name that the project folder will be given if the Create New Folder box is checked. This must be a different directory from the original location.
es_mx: **Nombre del proyecto**: el nombre del proyecto del robot. Esto también especifica el nombre que se dará a la carpeta del proyecto si la casilla "Crear nueva carpeta" está activada. Debe ser un directorio diferente de la ubicación original.

source: **Team Number**: The team number for the project, which will be used for package names within the project and to locate the robot when deploying code.
es_mx: **Número de equipo**: El número de equipo del proyecto, que se usará para los nombres de paquetes dentro del proyecto y para localizar el robot al implementar código.

source: Click "Upgrade Project" to begin the upgrade.
es_mx: Haga clic en "Actualizar proyecto" para iniciar la actualización.

source: The gradle project will be upgraded and copied into the new project directory. You can then either open the new project immediately (the pop-up shown below should appear in the bottom right) or open it later using the Ctrl-O (or Command-O for macOS) shortcut.
es_mx: El proyecto gradle se actualizará y copiará en el nuevo directorio del proyecto. A continuación, puede abrir el nuevo proyecto inmediatamente (la ventana emergente que se muestra a continuación debería aparecer en la parte inferior derecha) o abrirlo más tarde utilizando el atajo Ctrl-O (o Comando-O para macOS).

source: C++ Configurations (C++ Only)
es_mx: Configuraciones de C++ (solo C++)

source: For C++ projects, there is one more step to set up IntelliSense. Whenever you open a project, you should get a pop-up in the bottom right corner asking to refresh C++ configurations. Click "Yes" to set up IntelliSense.
es_mx: Para proyectos C++, hay un paso más para configurar IntelliSense. Cada vez que abra un proyecto, debería aparecer una ventana emergente en la esquina inferior derecha pidiéndole que actualice las configuraciones de C++. Haga clic en "Sí" para configurar IntelliSense.

source: 3rd Party Libraries
es_mx: Bibliotecas de 3ros

source: It is necessary to update and re-import 3rd party libraries. See :doc:`3rd Party Libraries <3rd-party-libraries>` for details.
es_mx: Es necesario actualizar y volver a importar bibliotecas de terceros. Vea :doc:`3rd Party Libraries<3rd-party-libraries>` para más detalles.
