Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-overview/known-issues.po
Languages: es_mx

source: Known Issues
es_mx: Problemas conocidos

source: This article details known issues (and workarounds) for FRC Control System Software.
es_mx: Este artículo detalla problemas comunes (y soluciones) para el software del sistema de control de FRC.

source: Open Issues
es_mx: Problemas abiertos

source: macOS Simulation fails to launch in Visual Studio Code
es_mx: La simulación en macOS falla al usarse en Visual Studio Code

source: The first time launching simulation in VS Code on macOS using the ``WPILib: Simulate Robot Code on Desktop`` task will fail with a warning similar to the one below.
es_mx: La primera vez abriendo la simulación en VS Code en macOS usando la tarea ``WPILib: Simulate Robot Code on Desktop`` la tarea va a fallar con una advertencia similar a la siguiente.

source: This is a bug in VS Code being tracked by WPILib in `vscode-wpilib#334 <https://github.com/wpilibsuite/vscode-wpilib/issues/334>`__.
es_mx: Este es un error en VS Code que está siendo revisado por WPILib en `vscode-wpilib#334 <https://github.com/wpilibsuite/vscode-wpilib/issues/334>`__.

source: **Workaround:** Attempt to launch the simulation once using the ``WPILib: Simulate Robot Code on Desktop`` task and let the task fail. Without closing the console that opens at the bottom of the VS Code window, launch the simulator again using the ``WPILib: Simulate Robot Code on Desktop`` task. The second time the simulator will launch properly.
es_mx: **Solución:** Intente iniciar la simulación usando la tarea ``WPILib: Simulate Robot Code on Desktop`` y deje que falle la tarea. Sin cerrar la consola que se abre en la parte inferior de VS Code, abra de nuevo el simulador usando la tarea ``WPILib: Simulate Robot Code on Desktop``. Al segundo intento el simulador funcionará correctamente.

source: C++ Intellisense - Files Open on Launch Don't Work Properly
es_mx: C++ Intellisense - Los archivos se abren pero no funcionan correctamente

source: **Issue:** In C++, files open when VS Code launches will have issues with Intellisense showing suggestions from all options from a compilation unit and not just the appropriate ones or not finding header files. This is a bug in VS Code.
es_mx: **Problema:** En C++, los archivos abiertos cuando se abra VS code tendrán problemas con Intellisense mostrando sugerencias desde toda la unidad de compilación y no solo las apropiadas o no encontrando los encabezados. Este es un error en VS code.

source: **Workaround:**
es_mx: **Solución:**

source: Close all files in VS Code, but leave VS Code open
es_mx: Cierre todos los archivos en VS Code, pero mantenga VS Code abierto

source: Delete c_cpp_properties.json file in the .vscode folder, if it exists
es_mx: Elimine el archivo c_cpp_properties.json en la carpeta .vscode si es que existe.

source: Run the "Refresh C++ Intellisense" command in vscode.
es_mx: Use el comando "Refresh C++ Intellisense" en vscode.

source: In the bottom right you should see something that looks like a platform (linuxathena or windowsx86-64 etc). If it’s not linuxathena click it and set it to linuxathena (release)
es_mx: En la parte inferior derecha deberá ver algo que se ve como una plataforma (linuxathena o windowsx86-64 etc). Si no es linuxathena dé clic y cámbielo por linuxathena (release)

source: Wait ~ 1 min
es_mx: Espere ~ 1 minuto

source: Open the main cpp file (not a header file). Intellisense should now be working
es_mx: Abra el archivo CPP principal (no un archivo de encabezado). Intellisense debería estar funcionando ahora.

source: SmartDashboard and Simulation fail to launch on Windows N Editions
es_mx: SmartDashboard y Simulation fallan al usarse en las versiones de Windows N

source: **Issue:** WPILib code using CSCore (dashboards and simulated robot code) will fail to launch on Education N editions of Windows.
es_mx: **Problema:** Código WPILib con CSCore (dashboards y código de robot simulado) fallarán al iniciarse en las versiones de Windows Education N.

source: **Solution:** Install the `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__
es_mx: **Solución:** Instale `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__

source: NetworkTables Interoperability
es_mx: Interoperabilidad de NetworkTables

source: There is currently an issue with inter-operating C++/Java Network Tables clients (dashboards or co-processors) with LabVIEW servers (LV robot code). In some scenarios users will see updates from one client fail to be replicated across to other clients (e.g. data from a co-processor will not be properly replicated out to a dashboard). Data still continues to return correctly when accessed by code on the server.
es_mx: Actualmente hay un problema al interoperar C++/Java Network Tables (tableros o coprocesadores) con servidores LabVIEW (código de robot LV). En algunos escenarios, los usuarios verán que las actualizaciones de un cliente no se pueden replicar en otros clientes (por ejemplo, los datos de un coprocesador no se replicarán correctamente en un tablero). Los datos siguen devolviéndose correctamente cuando se accede por código en el servidor.

source: **Workaround**: Write code on the server to mirror any keys you wish to see on other clients (e.g. dashboards) to a separate key. For example, if you have a key named ``targetX`` being published by a co-processor that you want to show up on a dashboard, you could write code on the robot to read the key and re-write it to a key like ``targetXDash``.
es_mx: **Solución alterna:** Escriba código en el servidor para reflejar las claves que desee ver en otros clientes (v. gr. dashboards) en una clave independiente. Por ejemplo, si tiene una clave denominada ``targetX`` publicada por un coprocesador que desea mostrar en un dashboard, puede escribir código en el robot para leer la clave y volver a escribirla en una clave como ``targetXDash``.

source: Fixed in 2020.3.2
es_mx: Corregido en 2020.3.2

source: PathWeaver Units
es_mx: Unidades PathWeaver

source: **Issue:** PathWeaver exports paths using the length unit that was used for the project. However, the WPILib trajectory tools expects paths with the length units of meters. If different units are selected in PathWeaver, the paths will be scaled incorrectly.
es_mx: **Problema:** PathWeaver exporta rutas utilizando la unidad de longitud que se usó para el proyecto. Sin embargo, las herramientas de trayectoria WPILib esperan rutas con las unidades de longitud en metros. Si se seleccionan unidades diferentes en PathWeaver, los trazados se escalarán incorrectamente.

source: **Solution:** PathWeaver, starting with version 2020.3.2, can now export export to meters when the units within PathWeaver are set to something else.
es_mx: **Solución:** PathWeaver, a partir de la versión 2020.3.2, puede exportar a metros cuando las unidades dentro de PathWeaver se establecen en otra unidad.

source: Fixed in 2020.2.2
es_mx: Corregido en 2020.2.2

source: Java predefined colors are all zero
es_mx: Los colores predefinidos de Java son todos cero

source: The predefined (static) colors from the WPILib Color class have all zero red, green, blue values.
es_mx: Los colores predefinidos (estáticos) de la clase de WPILib Color tienen todos los valores cero en rojo, verde y azul.

source: This issue is being tracked by WPILib in `allwpilib#2269 <https://github.com/wpilibsuite/allwpilib/pull/2269>`__.
es_mx: Este problema está siendo revisado por WPILib en `allwpilib#2269 <https://github.com/wpilibsuite/allwpilib/pull/2269>`__.

source: C++ Command Based JoystickButton and POVButton not functioning
es_mx: C++ Command Based JoystickButton y POVButton no funcionan

source: C++ JoystickButton and POVButton are both non functioning.
es_mx: C ++ JoystickButton y POVButton no funcionan.

source: This issue is being tracked by WPILib in `allwpilib#2259 <https://github.com/wpilibsuite/allwpilib/pull/2259>`__.
es_mx: Este problema está siendo revisado por WPILib en `allwpilib#2259 <https://github.com/wpilibsuite/allwpilib/pull/2259>`__.

source: **Workaround**: Use a Button object directly instead of using JoystickButton or POVButton.
es_mx: **Solución alterna:** Utilice un objeto Button directamente en lugar de usar JoystickButton o POVButton.

source: RobotBuilder extensions use the frc namespace (C++)
es_mx: Las extensiones RobotBuilder utilizan el espacio de nombres frc (C++)

source: When using RobotBuilder to create a C++ robot program, extensions will generate code prepended with the ``frc::`` namespace which will not compile.
es_mx: Cuando se utiliza RobotBuilder para crear un programa de robot en C++ , las extensiones generarán código puesto con el espacio de nombres ``frc::`` que no se compilará.

source: **Workaround**: After generating C++ robot code with RobotBuilder, where appropriate, replace ``frc::`` with the correct namespace for that device.
es_mx: **Solución alterna:** Después de generar código de robot en C++ con RobotBuilder, cuando corresponda, reemplace ``frc::`` por el espacio de nombres correcto para ese dispositivo.

source: This issue is being tracked by WPILib in `RobotBuilder#194 <https://github.com/wpilibsuite/RobotBuilder/issues/194>`__.
es_mx: Este problema está siendo revisado por WPILib en `RobotBuilder#194 <https://github.com/wpilibsuite/RobotBuilder/issues/194>`__.

source: Fixed in 2020.1.2
es_mx: Resuelto en 2020.1.2

source: WPILib Projects created with 2020.1.1 have a project version of Beta2020-2
es_mx: WPILib Projects creados con 2020.1.1 tienen una versión de proyecto de Beta2020-2

source: Any projects created have a project version of `Beta2020-2` set in wpilib_preferences.json. This is not an issue, everything will still work properly. This will be fixed and update your projects in the 2nd release.
es_mx: Todos los proyectos creados tienen una versión de proyecto de `Beta2020-2` establecida en wpilib_preferences.json. Esto no es un problema, todo seguirá funcionando correctamente. Esto se corregirá y actualizará sus proyectos en la segunda versión.

source: PathWeaver "Build Paths" Doesn't Work
es_mx: PathWeaver "Build Paths" No funcionan

source: The "Build Paths" button in PathWeaver currently doesn't work due to HAL usage reporting in the kinematics classes. This will be resolved in the 2nd release. See `this page <https://github.com/wpilibsuite/PathWeaver/issues/157>`_ for more info on this error.
es_mx: El botón "Build Paths" en PathWeaver actualmente no funciona debido a los informes de uso de HAL en las clases de cinemática. Esto se resolverá en la versión 2. Consulte `esta página <https://github.com/wpilibsuite/PathWeaver/issues/157>`_ para obtener más información sobre este error.
