Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-overview/new-for-2020.po
Languages: es_mx

source: New for 2020
es_mx: Nuevo para 2020

source: A number of improvements have been made to FRC Control System software for 2020. This article will describe and provide a brief overview of the new changes and features as well as a more complete changelog for C++/Java WPILib changes.
es_mx: Se han realizado una serie de mejoras en el software FRC Control System para 2020. Este artículo describirá y proporcionará una breve descripción general de los nuevos cambios y características, así como un registro de cambios más completo para los cambios de C++/Java WPILib.

source: Due to internal GradleRIO changes, it is necessary to update previous years projects. After :doc:`Installing WPILib for 2020 </docs/getting-started/getting-started-frc-control-system/wpilib-setup>`, any 2019 projects must be :doc:`imported </docs/software/wpilib-overview/importing-gradle-project>` to be compatible.
es_mx: Debido a los cambios internos de GradleRIO, es necesario actualizar los proyectos de años anteriores. Después de :doc:`Instalar WPILib para 2020</docs/getting-started/getting-started-frc-control-system/wpilib-setup>`, cualquier proyecto de 2019 debe :doc:`importarse</docs/software/wpilib-overview/importing-gradle-project>` para ser compatible.

source: Major Features - All Languages
es_mx: Características principales - Todos los lenguajes

source: **Addressable LEDs** - The roboRIO FPGA has been enhanced to be able to control individually addressable LEDs (WS2812 or compatible protocol) from the roboRIO PWM ports (non-MXP). Teams can connect the signal line of these LEDs directly to the roboRIO PWM signal line and control them from APIs in all three languages. Depending on the length of the LED string and whether any servos are also being powered from the PWM ports, teams may be able to power the string directly from the PWM port or may need to use an external supply.
es_mx: **LEDs direccionables** El roboRIO FPGA se ha mejorado para poder controlar los LED direccionables individualmente (WS2812 o protocolo compatible) desde los puertos roboRIO PWM (no MXP). Los equipos pueden conectar la línea de señal de estos LED directamente a la línea de señal roboRIO PWM y controlarlos desde las API en los tres lenguajes. Dependiendo de la longitud de la cadena de LED y si los servos también se alimentan desde los puertos PWM, los equipos pueden alimentar la cadena directamente desde el puerto PWM o pueden necesitar un suministro externo.

source: **Duty Cycle Encoder** - The roboRIO FPGA has been enhanced to be able to decode the signals from Duty Cycle encoders (this includes devices like the US Digital MA3, CTRE Mag Encoder, and REV Robotics Through Bore Encoder). Teams can connect these devices to the DIO ports on the roboRIO and access the encoder data via APIs in all three languages.
es_mx: **Codificador de ciclo de trabajo** - El RoboRIO FPGA ha sido mejorado para poder decodificar las señales de los codificadores de ciclo de trabajo (esto incluye dispositivos como el US Digital MA3, CTRE Mag Encoder y REV Robotics Through Bore Encoder). Los equipos pueden conectar estos dispositivos a los puertos DIO en el roboRIO y acceder a los datos del codificador a través de las API en los tres lenguajes.

source: **CAN Bus Internal Restructure** - The internal implementation of the CAN bus has changed to reduce the latency incurred by CAN bus calls from robot programs. Team programs, particularly those with many CAN calls, should see reduced and more consistent loop timing with the new implementation. No team action is needed to take advantage of this change, the changes are limited to internal implementation. Users may notice changes in how some tools like the CTRE Phoenix Tuner work as a consequence of the restructure.
es_mx: **Reestructuración interna del bus CAN** - La implementación interna del bus CAN ha cambiado para reducir la latencia en la que incurren las llamadas de bus CAN desde programas de robots. Los programas de equipo, especialmente aquellos con muchas llamadas CAN, deben ver un tiempo de bucle reducido y más coherente con la nueva implementación. No se necesita ninguna acción de equipo para aprovechar este cambio, los cambios se limitan a la implementación interna. Los usuarios pueden notar cambios en la forma en que algunas herramientas como el sintonizador CTRE Phoenix funcionan como consecuencia de la reestructuración.

source: **Control Packet Caching** - A change has been made to the internals of how control packet data (such as Joystick data, current mode, etc.) is retrieved, resulting in reduced latency in these calls. The user-facing API has not changed, users will see this benefit without making any changes to their programs.
es_mx: **Almacenamiento en caché de paquetes de control** - Se ha realizado un cambio en los elementos internos de cómo se recuperan los datos del paquete de control (como los datos de Joystick, el modo actual, etc.), lo que resulta en una latencia reducida en estas llamadas. La API orientada al usuario no ha cambiado, los usuarios verán esta ventaja sin realizar ningún cambio en sus programas.

source: **Documentation** - If you're on this page, you're likely aware that the software documentation has moved from Screensteps to this new FRC-Docs page. This open source documentation, hosted on Read the Docs, allows for a greater number of contributors (including community contribution) as well as new features such as testable example code (to ensure example code remains correct as library changes are made), better support for localization, and more. For the 2020 season, KOP part documentation can still be found on `Screensteps <https://wpilib.screenstepslive.com/s/4485>`__
es_mx: ** Documentación **: si está en esta página, es probable que sepa que la documentación del software se ha movido de Screensteps a esta nueva página de documentos de FRC. Esta documentación de código abierto, alojada en Read the Docs, permite un mayor número de contribuyentes (incluida la contribución de la comunidad), así como nuevas características como el código de ejemplo comprobable (para garantizar que el código de ejemplo permanezca correcto a medida que se realizan cambios en la biblioteca), mejor soporte para localización y más. Para la temporada 2020, la documentación de la pieza KOP todavía se puede encontrar en `Screensteps <https://wpilib.screenstepslive.com/s/4485>`__

source: Major Features - C++/Java
es_mx: Características principales - C++/Java

source: More complete details on all of these changes can be found in the changelog below (under **WPILib**).
es_mx: Los detalles más completos sobre todos estos cambios se pueden encontrar en el registro de cambios a continuación (en **WPILib**).

source: **Command Based Framework Rewrite** - A new version of the Command Based framework has been written from the ground up based on the years of experience with the previous framework. Both frameworks will be available as options in 2020 and have been split out as "vendor libraries" (though they are still included in the WPILib installer) in order to reduce the chances of mixing the two which will not work correctly.
es_mx: **Reescritura del marco basado en comandos**: Una nueva versión del marco basado en comandos se ha escrito desde cero basándose en los años de experiencia con el marco anterior. Ambos marcos estarán disponibles como opciones en 2020 y se han dividido como "bibliotecas de proveedores" (aunque todavía están incluidos en el instalador de WPILib) para reducir las posibilidades de mezclar los dos que no funcionarán correctamente.

source: **PID Controller Rewrite** - A new synchronous PID controller class has been written that is structured in a way that makes it simpler to compose with other higher level classes such as filters, motion profiles, kinematics and more. The new PID Controller is located in a new package to maintain separation from the existing implementation.
es_mx: **Reescritura del controlador PID** - Se ha escrito una nueva clase de controlador PID sincrónico que está estructurada de una manera que facilita la composición con otras clases de nivel superior, como filtros, perfiles de movimiento, cinemática y más. El nuevo controlador PID se encuentra en un nuevo paquete para mantener la separación de la implementación existente.

source: **High level controls & Trajectory generation** - A number of new classes have been added to assist teams with higher level controls including kinematics, odometry, and trajectory generation. In addition to the characterization GUI mentioned below this should allow teams a much easier entry to high level control of mechanisms included drivetrains (with smooth trajectories), arms, and elevators.
es_mx: **Controles de alto nivel y generación de trayectoria**: Se han agregado varias clases nuevas para ayudar a los equipos con controles de nivel más alto, como cinemática, odometría y generación de trayectoria. Además de la GUI de caracterización que se menciona a continuación, esto debería permitir a los equipos una entrada mucho más fácil al control de alto nivel de los mecanismos incluidos los trenes de transmisión (con trayectorias suaves), los brazos y los elevadores.

source: **Robot Characterization Tool** - This new tool helps teams characterize their mechanical systems (currently supports drivetrains, elevators, and arms) to help tune control loops. Combined with the new controls classes this should enable teams to follow an end-to-end solution for autonomous trajectory following.
es_mx: **Herramienta de caracterización de robots** - Esta nueva herramienta ayuda a los equipos a caracterizar sus sistemas mecánicos (actualmente admite transmisiones, elevadores y brazos) para ayudar a ajustar los bucles de control. En combinación con las nuevas clases de controles, esto debería permitir a los equipos seguir una solución de extremo a extremo para el seguimiento autónomo de la trayectoria.

source: **Simulation GUI** - A basic simulation GUI has been implemented allowing teams to visualize outputs and control basic inputs when simulating code on their desktop. While vendor support at Kickoff is expected to be limited, we hope this will expand in the future.
es_mx: **GUI de simulación** - Se ha implementado una GUI de simulación básica que permite a los equipos visualizar salidas y controlar entradas básicas al simular código en su escritorio. Si bien se espera que el soporte de proveedores en Kickoff sea limitado, esperamos que esto se expanda en el futuro.

source: There are many changes and additions to the main WPILib library for 2020. Most notably, there is a new version of the command-based framework with several major enhancements, a new (synchronous) PIDController, a GUI simulator, and kinematics classes have been added for closed loop driving. The full change log can be read below.
es_mx: Hay muchos cambios y adiciones a la biblioteca WPILib principal para 2020. En particular, hay una nueva versión del marco basado en comandos con varias mejoras importantes, un nuevo PIDController (sincrónico), un simulador de interfaz gráfica de usuario y clases cinemáticas se han agregado para la conducción de bucle cerrado. El registro de cambios completo se puede leer a continuación.

source: The command-based framework has been rewritten. The design rationale behind the rewrite can be found `here <https://github.com/wpilibsuite/design-docs/blob/master/CommandRewriteDesignDoc.md>`__. The new version of the framework is located in the ``frc2`` namespace (C++) and the ``edu.wpi.first.wpilibj2`` package (Java).
es_mx: El marco basado en comandos ha sido reescrito. La lógica del diseño detrás de la reescritura se puede encontrar `aquí <https://github.com/wpilibsuite/design-docs/blob/master/CommandRewriteDesignDoc.md>`__. La nueva versión del marco se encuentra en el espacio de nombres ``frc2`` (C++) y el paquete ``edu.wpi.first.wpilibj2`` (Java).

source: The command-based frameworks are now separate vendor libraries, rather then built into WPILib itself.
es_mx: Los marcos basados ​​en comandos ahora son bibliotecas de proveedores separadas, en lugar de integrarse en WPILib.

source: LinearDigitalFilter has been renamed to LinearFilter, and now has a ``Calculate()`` method which returns the filtered value.
es_mx: LinearDigitalFilter ha cambiado de nombre a LinearFilter, y ahora tiene un método ``Calculate ()`` que devuelve el valor filtrado.

source: Takes a double in the ``Calculate()`` method instead of a ``PIDSource`` in the constructor
es_mx: Toma un doble en el método ``Calculate()`` en lugar de un ``PIDSource`` en el constructor

source: ``PIDGet()`` was replaced with ``Calculate()``
es_mx: ``PIDGet()`` fue reemplazado por ``Calculate()``

source: Both of these changes make it easy to compose the LinearFilter class with the new PIDController class
es_mx: Ambos cambios facilitan la composición de la clase LinearFilter con la nueva clase PIDController

source: More details about the new LinearFilter can be found in :ref:`this article <docs/software/advanced-controls/filters/linear-filter:Linear Filters>`
es_mx: Se pueden encontrar más detalles sobre el nuevo LinearFilter en :ref:`este artículo <docs/software/advanced-controls/filters/linear-filter:Linear Filters>`

source: PIDController has been rewritten; the old PIDController along with PIDSource and PIDOutput have been deprecated. The new version of PIDController is located in the ``frc2`` namespace (C++) and the ``edu.wpi.first.wpilibj2`` package (Java) while the deprecated version remains in the old namespace and package.
es_mx: PIDController ha sido reescrito; el antiguo PIDController junto con PIDSource y PIDOutput han dejado de usar. La nueva versión de PIDController se encuentra en el espacio de nombres ``frc2`` (C++) y el paquete ``edu.wpi.first.wpilibj2`` (Java), mientras que la versión en desuso permanece en el antiguo espacio de nombres y paquete.

source: The new PIDController no longer runs asynchronously in a separate thread. This eliminates a major source of bugs for teams. Instead, teams should run the controller as part of their main periodic TimedRobot loop by calling ``Calculate()`` and passing the result to the motor’s ``Set()`` function. Note this means that the controller will run at the TimedRobot periodic rate.
es_mx: El nuevo PIDController ya no se ejecuta de forma asíncrona en un hilo separado. Esto elimina una fuente importante de errores para los equipos. En cambio, los equipos deben ejecutar el controlador como parte de su ciclo principal TimedRobot periódico llamando a ``Calculate()`` y pasando el resultado a la función ``Set()`` del motor. Tenga en cuenta que esto significa que el controlador se ejecutará a la velocidad periódica TimedRobot.

source: Input range was replaced with ``EnableContinuousInput()`` and output range was replaced with integrator range. If it’s necessary to clamp inputs or outputs to a range, use ``std::clamp()`` or ``wpiutil.MathUtils.clamp()`` on either the input or output of ``Calculate()`` as appropriate. To deal with steady-state error, use ProfiledPIDController instead of reducing the output range or having an integral term.
es_mx: El rango de entrada se reemplazó con ``EnableContinuousInput()'' y el rango de salida se reemplazó con el rango integrador. Si es necesario sujetar entradas o salidas a un rango, use ``std::clamp()`` o ``wpiutil.MathUtils.clamp()`` en la entrada o salida de ``Calculate()`` como apropiado. Para lidiar con el error de estado estable, use ProfiledPIDController en lugar de reducir el rango de salida o tener un término integral.

source: ``PIDSource`` is no longer used. Instead, pass the sensor value directly to ``Calculate()``.
es_mx: `` PIDSource`` ya no se usa. En su lugar, pase el valor del sensor directamente a ``Calcular()``.

source: ``PIDOutput`` is no longer used. Instead, call ``Set()`` with the output of ``Calculate()``.
es_mx: ``PIDOutput`` ya no se usa. En su lugar, llame a ``Set()`` con la salida de ``Calculate()``.

source: Percent tolerance has been removed. Absolute tolerance is provided via ``SetTolerance()``.
es_mx: El porcentaje de tolerancia ha sido eliminado. La tolerancia absoluta se proporciona a través de ``SetTolerance()``.

source: More details about the new PIDController can be found in :ref:`this article <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.
es_mx: Se pueden encontrar más detalles sobre el nuevo PIDController en :ref:`este artículo <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.

source: Added kinematics classes for Swerve, Mecanum, and DifferentialDrive. These classes can be used to implement closed loop driving of these drive types.
es_mx: Se agregaron clases de cinemática para Swerve, Mecanum y DifferentialDrive. Estas clases se pueden usar para implementar la conducción en bucle cerrado de estos tipos de unidades.

source: Added odometry classes for Swerve, Mecanum, and DifferentialDrive. These are needed for closed loop feedback control on global pose (as opposed to just PID on the two drivetrain sides, which can accrue error since there are multiple ending positions a robot can be in for a given set of encoder measurements)
es_mx: Se agregaron clases de odometría para Swerve, Mecanum y DifferentialDrive. Estos son necesarios para el control de retroalimentación de bucle cerrado en pose global (en lugar de solo PID en los dos lados del tren de transmisión, lo que puede generar un error ya que hay múltiples posiciones finales en las que puede estar un robot para un conjunto dado de mediciones de codificador)

source: Add RamseteController for closed loop feedback control on global pose for unicycles (the DifferentialDriveKinematics class can convert the chassis speeds to that of a differential drive)
es_mx: Se agregó RamseteController para el control de retroalimentación de bucle cerrado en pose global para monociclos (la clase DifferentialDriveKinematics puede convertir las velocidades del chasis a las de una unidad diferencial)

source: (C++) Add frc2::Timer which is unit safe
es_mx: (C++) Agregue frc2::Timer que es seguro para la unidad

source: Real-time trajectory generation for 2 DOF trajectories (e.g., x and y position for a drivetrain)
es_mx: Generación de trayectoria en tiempo real para 2 trayectorias DOF ​​(por ejemplo, posición "x" y "y" para una transmisión)

source: Added a PortForwarding class to allow forwarding ports from a remote, to a client. This can be used when connecting to the roboRIO from USB and needing to access Ethernet content.
es_mx: Se agregó una clase PortForwarding para permitir el reenvío de puertos desde un remoto a un cliente. Esto se puede usar cuando se conecta al roboRIO desde USB y necesita acceder al contenido de Ethernet.

source: Added an interactive GUI for desktop simulation of robot code. The GUI provides DS-like controls for operating mode and joystick input and provides live display/control of virtual hardware inputs and outputs.
es_mx: Se agregó una GUI interactiva para la simulación de escritorio del código del robot. La GUI proporciona controles similares a DS para el modo de funcionamiento y la entrada del joystick y proporciona visualización / control en vivo de las entradas y salidas de hardware virtual.

source: Removed SampleRobot
es_mx: SampleRobot removido

source: Made null checks on Java parameters more descriptive
es_mx: Las comprobaciones nulas de los parámetros de Java son más descriptivas

source: Removed deprecated LiveWindow functions
es_mx: Se eliminaron las funciones obsoletas de LiveWindow

source: Deprecated frc/WPILib.h. Instead, include only what you use.
es_mx: En desuso frc/WPILib.h. En su lugar, incluya solo lo que usa.

source: Removed deprecated shim header files for wpilibc and llvm.
es_mx: Se eliminaron los archivos de encabezado shim obsoletos para wpilibc y llvm.

source: Added low-level geometry classes: Pose2d, Rotation2d, Transform2d, Translation2d
es_mx: Se agregaron clases de geometría de bajo nivel: Pose2d, Rotation2d, Transform2d, Translation2d

source: Added C++ units library. This library provides type safety, which makes it impossible to mix up units (e.g. pass seconds as meters) and also provides automatic unit conversion. The units can be specified in literals using a suffix, e.g. ``1.0_s`` for 1 second.
es_mx: Biblioteca de unidades C++ agregada. Esta biblioteca proporciona seguridad de tipo, lo que hace que sea imposible mezclar unidades (por ejemplo, pasar segundos como metros) y también proporciona conversión automática de unidades. Las unidades se pueden especificar en literales utilizando un sufijo, p.``1.0_s`` por 1 segundo.

source: Added Java units utility functions for unit conversions. This provides a set of common unit conversions (e.g. feet to meters). Unlike C++, the Java library does not provide type safety; this was done for performance reasons.
es_mx: Se agregaron funciones de utilidad de unidades Java para conversiones de unidades. Esto proporciona un conjunto de conversiones de unidades comunes (por ejemplo, pies a metros). A diferencia de C ++, la biblioteca Java no proporciona seguridad de tipo; Esto se hizo por razones de rendimiento.

source: Added TrapezoidProfile class for 1 degree-of-freedom (DOF) trajectories
es_mx: Se agregó la clase TrapezoidProfile para trayectorias de 1 grado de libertad (DOF)

source: Added ProfiledPIDController class. Given a goal, this class constrains the setpoint movement over time to a max velocity and acceleration.
es_mx: Se agregó la clase ProfiledPIDController. Dado un objetivo, esta clase limita el movimiento del punto de referencia a lo largo del tiempo a una velocidad y aceleración máximas.

source: Moved the CircularBuffer/circular_buffer classes from wpilib to wpiutil
es_mx: Se movieron las clases CircularBuffer/circular_buffer de wpilib a wpiutil

source: Deprecated the GearTooth class. Based on usage reporting, no teams have used this class in the last several years. The Counter class can be used directly instead.
es_mx: Se dejó de utilizar la clase GearTooth. Según los informes de uso, ningún equipo ha utilizado esta clase en los últimos años. La clase Counter se puede usar directamente en su lugar.

source: Deprecated the Filter class. Since PIDSource is deprecated, it no longer serves a purpose. Teams should use the derived classes of Filter directly rather than using polymorphism.
es_mx: Se dejó de utilizar la clase Filter. Dado que PIDSource no se usa, ya no tiene un propósito. Los equipos deben usar las clases derivadas de Filter directamente en lugar de usar polymorphism.

source: Added the PWMSparkMax class for PWM control of the REV Robotics SPARK MAX Motor Controller
es_mx: Se agregó la clase PWMSparkMax para el control PWM del controlador de motor REV Robotics SPARK MAX

source: Simplified the Sendable interface and deprecated SendableBase. The name and subsystem have been removed from individual objects, and instead this data is stored in a new singleton class, SendableRegistry. Much of LiveWindow has been refactored into SendableRegistry.
es_mx: Se simplificó la interfaz Sendable y SendableBase obsoleta. El nombre y el subsistema han sido eliminados de objetos individuales, y en su lugar estos datos se almacenan en una nueva clase individual, SendableRegistry. Gran parte de LiveWindow se ha refactorizado en SendableRegistry.

source: In C++, a new CRTP helper class, SendableHelper, has been added to provide move and destruction functionality.
es_mx: En C++, se ha agregado una nueva clase auxiliar CRTP, SendableHelper, para proporcionar funcionalidad de movimiento y destrucción.
