Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-overview/new-for-2020.po
Languages: es_mx

source: Shims for GetName, SetName, GetSubsystem, and SetSubsystem have been added to Command and Subsystem (both old and new), and also to SendableHelper to prevent code breakage.
es_mx: Shims para GetName, SetName, GetSubsystem y SetSubsystem se han agregado a Command y Subsystem (tanto antiguos como nuevos) y también a SendableHelper para evitar la interrupción del código.

source: Update to GCC 7, and use C++17
es_mx: Actualice a GCC 7 y use C++17La

source: Use OS for serial port instead of the NI driver
es_mx: Use el sistema operativo para el puerto serie en lugar del controlador NI

source: IterativeRobot template has been removed
es_mx: La plantilla IterativeRobot ha sido eliminada

source: Add support for Addressable LEDs, such as WS2812's and NeoPixels
es_mx: Se agregó soporte para LEDs direccionables, como WS2812 y NeoPixels

source: Add support for DutyCycle inputs, such as the absolute output on many FRC encoders
es_mx: Se agregó soporte para las entradas de DutyCycle, como la salida absoluta en muchos codificadores FRC

source: Eigen has been added to C++, and EJML has been added to Java to support linear algebra and matrix calculations. These are included by default, with no need to add anything to your robot project to use them.
es_mx: Eigen se ha agregado a C ++ y EJML se ha agregado a Java para admitir álgebra lineal y cálculos matriciales. Estos se incluyen de forma predeterminada, sin necesidad de agregar nada a su proyecto de robot para usarlos.

source: Jackson has been added to Java for JSON support. C++ support already existed with json library in the wpi header root. These can be used with no need to add anything to your robot project.
es_mx: Jackson ha sido agregado a Java para soporte JSON. El soporte C++ ya existía con la biblioteca json en la raíz del encabezado wpi. Se pueden usar sin necesidad de agregar nada a su proyecto de robot.

source: The location that maven artifacts are published has changed to: https://frcmaven.wpi.edu/artifactory/release/
es_mx: La ubicación donde se publican los artefactos de Maven ha cambiado a: https://frcmaven.wpi.edu/artifactory/release/

source: Ignore whitespace and capitalization for remotely defined settings
es_mx: Se ignoran espacios en blanco y mayúsculas para configuraciones definidas de forma remota

source: Components in grids can now have location specified remotely
es_mx: Los componentes de las cuadrículas ahora pueden tener una ubicación especificada de forma remota

source: Upper and lower bounds on graph X and Y axis can now be manually specified
es_mx: Los límites superior e inferior en el eje X y Y del gráfico ahora se pueden especificar manualmente

source: Small numbers will properly be shown in number fields using scientific notation.
es_mx: Los números pequeños se mostrarán correctamente en los campos numéricos usando notación científica.

source: Allow widget titles to be hidden
es_mx: Se permiten que los títulos de los widgets se oculten

source: Added a documentation link in the about dropdown
es_mx: Se agregó un enlace de documentación en el menú desplegable Acerca de

source: FRC Raspberry Pi Image
es_mx: Imagen de FRC Raspberry Pi

source: Updated to work on Raspberry Pi 4
es_mx: Actualizado para trabajar en Raspberry Pi 4

source: Updated to use Raspbian Buster
es_mx: Actualizado para usar Raspbian Buster

source: Added CPU temperature to system status screen
es_mx: Temperatura de CPU agregada a la pantalla de estado del sistema

source: Properly parses special characters in MJPEG urls
es_mx: Se analiza correctamente los caracteres especiales en las URL de MJPEG

source: Updated to output WPILib splines
es_mx: Actualizado a las splines de salida WPILib

source: Now shows an error alert when configuration screen is invalid
es_mx: Ahora muestra una alerta de error cuando la pantalla de configuración no es válida

source: Fixed the initial settings dialog (it was too small on some platforms)
es_mx: Se corrigió el diálogo de configuración inicial (era demasiado pequeño en algunas plataformas)

source: Fixed array editor
es_mx: Arreglado el editor de matrices

source: Fixed JRE slowdown when using ``concat()`` on Strings.
es_mx: Se corrigió la desaceleración de JRE cuando se usa ``concat()`` en Strings.

source: Fixed JRE slowdown on garbage collection.
es_mx: Se corrigió la desaceleración de JRE en la recolección de basura.

source: Fixed cscore compatibility with OpenCV 4 (mainly useful for coprocessors)
es_mx: Se corrigió la compatibilidad de cscore con OpenCV 4 (principalmente útil para coprocesadores)

source: Fixed setting exposure on PS3eye cameras
es_mx: Configuración fija de exposición en cámaras PS3eye

source: WPILib All in One Installer
es_mx: Instalador todo en uno WPILib

source: Use ``wpilib\2020\`` instead of ``frc2020\``. This prevents cluttering the user’s home directory when installing alongside previous years’ installation.
es_mx: Use ``wpilib\2020\'' en lugar de ``frc2020\''. Esto evita el desorden en el directorio de inicio del usuario cuando se instala junto con la instalación de años anteriores.

source: Fixed an issue where shortcuts would get created for installed tools, even if it was unchecked.
es_mx: Se solucionó un problema por el cual se creaban accesos directos para las herramientas instaladas, incluso si no estaba marcada.

source: Installing for **All Users** will now create shortcuts for all users, instead of only the current one.
es_mx: La instalación para **Todos los usuarios** ahora creará accesos directos para todos los usuarios, en lugar de solo el actual.

source: Update to latest Visual Studio Code and C++/Java extensions
es_mx: Actualización a las últimas extensiones de Visual Studio Code y C++/Java

source: Visual Studio Code Extension
es_mx: Extensión de Visual Studio Code

source: Added a 2019 to 2020 project importer
es_mx: Se agregó un importador de proyectos de 2019 a 2020

source: Add a window for a simple way to grab all project information
es_mx: Se agregó una ventana para una forma simple de obtener toda la información del proyecto

source: Add built in way to open and display API docs
es_mx: Se agregó una forma integrada para abrir y mostrar documentos de API

source: Use individual includes instead of wpilib.h for C++
es_mx: Use inclusiones individuales en lugar de wpilib.h para C ++

source: Add export of PWMSparkMax, PWMTalonFX, PWMVenom
es_mx: Se agregó la exportación de PWMSparkMax, PWMTalonFX, PWMVenom

source: Extensions are now stored in ~/wpilib/2020/Robotbuilder/extensions
es_mx: Las extensiones ahora se almacenan en ~/wpilib/2020/Robotbuilder/extensions

source: GUI for defining Command Groups was removed for maintainability reasons. Commands can be added in VS Code.
es_mx: La GUI para definir grupos de comandos se eliminó por razones de mantenimiento. Se pueden agregar comandos en VS Code.

source: Robot Characterization
es_mx: Caracterización del robot

source: Introduced the robot characterization toolsuite.
es_mx: Se introdujo la herramienta de caracterización de robots.
