Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-overview/what-*-wpilib.po
Languages: es_mx, fr_ca

source: What is WPILib?
es_mx: ¿Qué es WPILib?
fr_ca: La WPILib: qu'est-ce que c'est?

source: The WPI Robotics Library (WPILib) is the standard software library provided for teams to write code for their FRC robots. A `software library <https://en.wikipedia.org/wiki/Library_(computing)>`__ is a collection of code that can be imported into and used by other software. WPILib contains a set of useful classes and subroutines for interfacing with various parts of the FRC control system (such as sensors, motor controllers, and the driver station), as well as an assortment of other utility functions.
es_mx: WPI Robotics Library (WPILib) es la biblioteca de software estándar proporcionada para que los equipos escriban código para sus robots FRC. Una `librería de software <https://en.wikipedia.org/wiki/Library_(computing)>`__ es una colección de código que puede ser importado y utilizado por otro software. WPILib contiene un conjunto de clases útiles y subrutinas para interactuar con varias partes del sistema de control FRC (como sensores, controladores de motor y la driver station), así como una variedad de otras funciones de utilidad.
fr_ca: La WPI Robotics Library (WPILib) est la bibliothèque logicielle de référence fournie pour que les équipes soient en mesure de programmer leurs robots en FRC. Une `bibliothèque logicielle <https://fr.wikipedia.org/wiki/Biblioth%C3%A8que_logicielle>`__ est une collection de routines qui peuvent être déjà compilées et prêtes à être utilisées par des programmes. la WPILib contient un ensemble de classes et de routines utiles pour réaliser des interfaces de programmation avec les différents dispositifs du système de contrôle FRC (tels que les capteurs, les contrôleurs de moteur, et la station de pilotage) mais également un éventail d'autres logiciels utilitaires.

source: Supported languages
es_mx: Lenguajes soportados
fr_ca: Langages disponibles

source: There are two versions of WPILib, one for each of the two officially-supported text-based languages: WPILibJ for java, and WPILibC for C++. A considerable effort is made to maintain feature-parity between these two languages - library features are not added unless they can be reasonably supported for both Java and C++, and when possible the class and method names are kept identical or highly-similar. While unofficial community-built support is available for some other languages, notably `python <https://robotpy.readthedocs.io/en/stable/>`__, this documentation will only cover Java and C++. Java and C++ were chosen for the officially-supported languages due to their appropriate level-of-abstraction and ubiquity in both industry and high-school computer science classes.
es_mx: Hay dos versiones de WPILib, una para cada uno de los dos lenguajes basados en texto admitidos oficialmente: WPILibJ para java y WPILibC para C++. Se hace un esfuerzo considerable para mantener la paridad de características entre estos dos lenguajes. Ninguna característica en las librerías es añadida hasta que sea razonablemente compatible con Java y C++, y cuando sea posible los nombres de clase y método se mantienen idénticos o muy similares. Aunque el soporte no oficial creado por la comunidad está disponible para algunos otros lenguajes, en particular `python <https://robotpy.readthedocs.io/en/stable/>`__, esta documentación solo cubrirá Java y C++. Java y C++ fueron elegidos para los lenguajes oficialmente soportados debido a su nivel adecuado de abstracción y ubicuidad tanto en la industria como en las clases de ciencias de la computación de la escuela secundaria.
fr_ca: Il existe deux versions de la WPILib, une pour chacun des deux langages de programmation basés sur du texte officiellement supportés: WPILibJ pour java, et WPILibC pour C++. Un effort considérable est déployé afin de maintenir la parité des fonctions entre ces deux langages, les fonctionnalités ne sont pas ajoutées aux librairies des deux langages à moins que celles-ci ne soient raisonnablement supportées à la fois par Java et C++, et autant que possible, les noms de classes et de méthodes sont identiques or grandement semblables. Même si d'autres langages de programmation basés sur le texte, notamment `python <https://robotpy.readthedocs.io/en/stable/>`__, bénéficient du soutien officieux de la communauté, la présente documentation couvre Java et C++ uniquement. Java et C++ ont été désignés comme langages officiellement supportés à cause de leur niveau approprié d'abstraction et leur omniprésence aussi bien dans l'industrie que dans les cours d'informatique au niveau académique.

source: In general, C++ offers better high-end performance, at the cost of increased user effort (memory must be handled manually, and the C++ compiler does not do much to ensure user code will not crash at runtime). Java offers lesser performance, but much greater convenience. New/inexperienced users are strongly encouraged to use Java.
es_mx: En general, C++ ofrece un mejor rendimiento de gama alta, a costa de un mayor esfuerzo del usuario (la memoria debe controlarse manualmente y el compilador de C++ no hace mucho para garantizar que el código de usuario no se bloqueará en tiempo de ejecución). Java ofrece un menor rendimiento, pero mucha mayor comodidad. Se recomienda encarecidamente a los usuarios nuevos/inexpertos que utilicen Java.
fr_ca: En général, C++ offre une meilleure performance en bout de ligne, au prix d'un effort accrus du programmeur (la mémoire doit être gerée manuellement, et le compilateur C++ ne fait rien pour s'assurer que le programme ne crashera pas pendant l'exécution). Java offre moins de performance, mais est beaucoup plus convient. Les programmeurs nouveaux/novices sont fortement encouragés à utiliser Java.

source: Source code and documentation
es_mx: Código Fuente y documentación
fr_ca: Code source et documentation

source: WPILib is an open-source library - the entirety of its source code is available online on the WPILib Github Page:
es_mx: WPILib es una biblioteca de código abierto - la totalidad de su código fuente está disponible en línea en la página WPILib Github:
fr_ca: La WPILib est une librairie à code source libre- l'intégralité de son code source est disponible en ligne dans son dépôt Github:

source: `Official WPILib github <https://github.com/wpilibsuite/allwpilib>`__
es_mx: `WPILib github oficial <https://github.com/wpilibsuite/allwpilib>`__
fr_ca: `Dépôt officiel github de la WPILib <https://github.com/wpilibsuite/allwpilib>`__

source: The Java and C++ source code can be found in the WPILibJ and WPILibC source directories:
es_mx: El código fuente de Java y C++ se puede encontrar en los directorios de origen WPILibJ y WPILibC:
fr_ca: Les codes sources en Java ou en C++ se trouvent dans les répertoires des sources WPILibJ et WPILibC:

source: `Java source code <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibj/src/main/java/edu/wpi/first/wpilibj>`__
es_mx: `Código fuente Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibj/src/main/java/edu/wpi/first/wpilibj>`__
fr_ca: `Code source en Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibj/src/main/java/edu/wpi/first/wpilibj>`__

source: `C++ source code <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibc/src/main/native/cpp>`__
es_mx: `Código fuente C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibc/src/main/native/cpp>`__
fr_ca: `Code source en C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibc/src/main/native/cpp>`__

source: While users are strongly encouraged to read the source code to resolve detailed questions about library functionality, more-concise documentation can be found on the official documentation pages for WPILibJ and WPILibC:
es_mx: Aunque se recomienda encarecidamente a los usuarios que lean el código fuente para resolver preguntas detalladas sobre la funcionalidad de la biblioteca, la documentación más concisa se puede encontrar en las páginas oficiales de documentación de WPILibJ y WPILibC:
fr_ca: Bien que les usagers soient fortement encouragés à lire le code source pour avoir des réponses à des questions plus précises liées aux fonctionnalités de la bibliothèque, une documentation plus concise est disponible dans les pages de la documentation officielle pour WPILibJ et pour WPILibC:

source: `Java documentation <https://first.wpi.edu/FRC/roborio/release/docs/java/>`__
es_mx: `Documentación Java <https://first.wpi.edu/FRC/roborio/release/docs/java/>`__
fr_ca: `Documentation Java <https://first.wpi.edu/FRC/roborio/release/docs/java/>`__

source: `C++ documentation <https://first.wpi.edu/FRC/roborio/release/docs/cpp/>`__
es_mx: `Documentación C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/>`__
fr_ca: `Documentation C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/>`__
