Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-overview/wpilib-commands-vscode.po
Languages: es_mx, fr_ca

source: WPILib Commands in Visual Studio Code
es_mx: Comandos WPILib en Visual Studio Code
fr_ca: Commandes WPILib sous Visual Studio Code

source: This document contains a complete list of the commands provided by the WPILib VS Code Extension and what they do.
es_mx: Este documento contiene una lista completa de los comandos dados por la extensión de WPILib en VS Code y sus funciones.
fr_ca: Ce document contient une liste complète des commandes fournies par l’extension *WPILib VS Code Extension* et ce qu’elles font.

source: To access these commands, press Ctrl+Shift+P to open the Command Palette, then begin typing the command name as shown here to filter the list of commands. Click on the command name to execute it.
es_mx: Para acceder a estos comandos, presione Ctrl+Shift+P para abrir la paleta de comandos, después empiece escribiendo el nombre del comando como se muestra para filtrar la lista de comandos. Dé clic en el nombre del comando para ejecutarlo.
fr_ca: Pour accéder à ces commandes, appuyez sur Ctrl+Maj+P pour ouvrir la palette *Command Palette*, puis commencez à taper le nom de la commande comme illustré ici pour filtrer la liste des commandes. Cliquez sur le nom de la commande pour l’exécuter.

source: **WPILib: Build Robot Code** - Builds open project using GradleRIO
es_mx: **WPILib: Build Robot Code** - Construye un proyecto abierto con GradleRIO
fr_ca: **WPILib: Build Robot Code** - Construit un projet ouvert à l’aide de GradleRIO

source: **WPILib: Create Project** - Create a new robot project
es_mx: **WPILib: Create Proyecto** - Crea un nuevo proyecto de robot
fr_ca: **WPILib: Create Project** - Crée un nouveau projet de robot

source: **WPILib C++: Refresh C++ Intellisense** - Force an update to the C++ Intellisense configuration.
es_mx: **WPILib C++: Refrresh C++ Intellisense** - Fuerza una actualización de la configuración de C++ Intellisense.
fr_ca: **WPILib C++: Refresh C++ Intellisense** - Force une mise à jour de la configuration C++ Intellisense.

source: **WPILib C++: Select current C++ toolchain** - Select the toolchain to use for Intellisense (i.e. desktop vs. roboRIO vs...). This is the same as clicking the current mode in the bottom right status bar.
es_mx: **WPILib C++: Select current C++ toolchain*** - Selecciona la cadena de herramientas que se utilizará para Intellisense (es decir, desktop vs. roboRIO vs...). Esto es lo mismo que hacer clic en el modo actual en la barra de estado inferior derecha.
fr_ca: **WPILib C++: Select current C++ toolchain** - Sélectionne la chaîne d’outils à utiliser pour Intellisense (c.-à-d. bureau vs roboRIO vs...). C'est la même chose que de cliquer sur le mode actuel dans la barre d’état en bas à droite.

source: **WPILib: Cancel currently running tasks** - Cancel any tasks the WPILib extension is currently running
es_mx: **WPILib: Cancel currently running tasks** - Cancela las tareas que la extensión WPILib está ejecutando actualmente
fr_ca: **WPILib: Cancel currently running tasks** - Annule toutes les tâches que l’extension WPILib exécute actuellement

source: **WPILib: Change Auto Save On Deploy Setting** - Change whether files are saved automatically when doing a Deploy. This defaults to Enabled.
es_mx: **WPILib: Change Auto Save On Deploy Setting** - Cambia si los archivos se guardan automáticamente al hacer un Deploy. Este valor predeterminado es Enabled.
fr_ca: **WPILib: Change Auto Save On Deploy Setting** - Modifie si les fichiers sont enregistrés automatiquement ou non lors d’un déploiement. La valeur par défaut est Enabled..

source: **WPILib: Change Auto Start RioLog on Deploy Setting** - Change whether RioLog starts automatically on deploy. This defaults to Enabled.
es_mx: **WPILib: Change Auto Start RioLog on Deploy Setting** - Cambia si RioLog se inicia automáticamente al iniciar. El valor predeterminado es Habilitado.
fr_ca: **WPILib: Change Auto Start RioLog on Deploy Setting** - Modifie si RioLog démarre automatiquement ou non lors du déploiement. La valeur par défaut est Enabled.

source: **WPILib: Change Desktop Support Enabled Setting** - Change whether building robot code on Desktop is enabled. Enable this for test and simulation purposes. This defaults to Desktop Support off.
es_mx: **WPILib: Change Desktop Support Enabled Setting** - Cambia si la creación de código de robot en el escritorio está habilitada. Habilite esto para fines de prueba y simulación. Este valor predeterminado es desactivado.
fr_ca: **WPILib: Change Desktop Support Enabled Setting** - Modifie si la création de code robot sur le Bureau est activée. Activez ce paramètre à des fins de test et de simulation. Par défaut la prise en charge du bureau n'est pas activée.

source: **WPILib: Change Language Setting** - Change whether the currently open project is C++ or Java.
es_mx: **WPILib: Change Language Setting** - Cambia si el proyecto abierto actualmente es C++ o Java.
fr_ca: **WPILib: Change Language Setting** - Cette commande permet de modifier le langage du projet actuellement ouvert s'il est C++ ou Java.

source: **WPILib: Change Run Commands in Online Mode Setting** - Change whether GradleRIO is running in Online Mode (will attempt to automatically pull dependencies from online). Defaults to disabled (offline mode).
es_mx: **WPILib: Change Run Commands in Online Mode Setting** - Cambia si GradleRIO se está ejecutandose en modo en línea (intentará extraer automáticamente las dependencias de la red). El valor predeterminado es deshabilitado (modo fuera de línea).
fr_ca: **WPILib: Change Run Commands in Online Mode Setting** - Modifie si GradleRIO s’exécute en mode Online Mode (essayez de retirer automatiquement les dépendances en ligne) ou non. Par défaut, ce paramètre est configuré à DIsabled (mode hors connexion).

source: **WPILib: Change Skip Tests On Deploy Setting** - Change whether to skip tests on deploy. Defaults to disabled (tests are run on deploy)
es_mx: **WPILib: Change Skip Tests On Deploy Setting** - Cambia omitir las pruebas en el deploy. El valor predeterminado es deshabilitado (las pruebas se ejecutan en el despliegue).
fr_ca: **WPILib: Change Skip Tests On Deploy Setting** - Cette commande permet d'ignorer ou non les tests lors du déploiement. Par défaut, ce paramètre est configuré à *Disabled* (les tests sont exécutés sur le déploiement)

source: **WPILib: Change Stop Simulation on Entry Setting** - Change whether to stop robot code on entry when running simulation. Defaults to disabled (don't stop on entry).
es_mx: **WPILib: Change Stop Simulation on Entry Setting** - Cambia si se debe detener el código del robot en la entrada al ejecutar la simulación. El valor predeterminado es deshabilitado (no se detiene al entrar).
fr_ca: **WPILib: Change Stop Simulation on Entry Setting** - Configure l’arrêt ou non du code robot à l’entrée lors de l’exécution de la simulation. Par défaut, le paramètre est configuré sur Disabled (ne vous arrêtez pas à l’entrée).

source: **WPILib: Check for WPILib Updates** - Check for an update to the WPILib extensions
es_mx: **WPILib: Check for WPILib Updates** - Busca actualizaciones para las extensiones de WPILib
fr_ca: **WPILib: Check for WPILib Updates** - Recherche une mise à jour des extensions WPILib

source: **WPILib: Create a new class/command** - Clicking this command in the palette will not do anything. This command is triggered by right-clicking on the desired folder in the Navigation Pane and selecting the appropriate option.
es_mx: **WPILib: Create a new class/command** - Hacer clic en este comando no hará nada. Este comando se activa haciendo clic derecho en la carpeta deseada en el Panel de navegación y seleccionando la opción adecuada.
fr_ca: **WPILib: Create a new class/command** - En cliquant sur cette commande dans la palette ne fera rien. Cette commande est déclenchée en cliquant avec le bouton droit sur le dossier d'intérêt dans le volet de navigation et en sélectionnant l’option appropriée.

source: **WPILib: Debug Robot Code** - Build and deploy robot code to roboRIO in debug mode and start debugging
es_mx: **WPILib: Debug Robot Code** - Comstruye y despliega el código de robot en la roboRIO en modo de depuración y comienza a depurar
fr_ca: **WPILib: Debug Robot Code** - Permet de construire et déployer du code robot sur le roboRIO en mode débogage et commencer le débogage

source: **WPILib: Deploy Robot Code** - Build and deploy robot code to roboRIO
es_mx: **WPILib: Deploy Robot Code** - Construye y despliega el código de robot a la roboRIO
fr_ca: **WPILib: Deploy Robot Code** - Permet de construire et déployer du code robot pour roboRIO

source: **WPILib: Import a WPILib Eclipse Project** - Open a wizard to help you create a new VS Code project from an existing WPILib Eclipse project from a previous season.
es_mx: **WPILib: Import a WPILib Eclipse Project** - Abre un asistente para ayudar a crear un nuevo proyecto de VS Code a partir de un proyecto WPILib Eclipse existente de una temporada anterior.
fr_ca: **WPILib: Import a WPILib Eclipse Project** - Ouvre un Assistant pour vous aider à créer un nouveau projet de code VS à partir d’un projet WPILib Eclipse existant d’une saison précédente.

source: **WPILib: Import a WPILib 2019 Project** - Open a wizard to help you create a new project from a existing VS Code Gradle project from 2019
es_mx: **WPILib: Import a WPILib 2019 Project** - Abre un asistente para ayudar a crear un nuevo proyecto a partir de un proyecto existente de VS Code Gradle a partir de 2019
fr_ca: **WPILib: Import a WPILib 2019 Project** - Ouvre un assistant pour vous aider à créer un nouveau projet à partir d’un projet VS Code Gradle existant de 2019

source: **WPILib: Install tools from GradleRIO** - Install the WPILib Java tools (e.g. SmartDashboard, Shuffleboard, etc.). Note that this is done by default by the offline installer
es_mx: **WPILib: Install tools from GradleRIO** - Instala las herramientas Java WPILib (por ejemplo, SmartDashboard, Shuffleboard, etc.). Tenga en cuenta que esto se hace de forma predeterminada por el instalador sin conexión
fr_ca: **WPILib: Install tools from GradleRIO** - Installe les outils Java WPILib (p. ex. SmartDashboard, Shuffleboard, etc.). Notez que cela se fait par défaut par l’installateur hors connexion

source: **WPILib: Manage Vendor Libraries** - Install/update 3rd party libraries
es_mx: **WPILib: Manage Vendor Libraries** - Instala/actualiza bibliotecas de un 3°
fr_ca: **WPILib: Manage Vendor Libraries** - Installer/mettre à jour des bibliothèques tierces

source: **WPILib: Open WPILib Command Palette** - This command is used to open a WPILib Command Palette (equivalent of hitting Ctrl+Shift+P and typing WPILib)
es_mx: **WPILib: Open WPILib Command Palette** - Este comando se utiliza para abrir una paleta de comandos WPILib (equivalente a pulsar Ctrl+Mayús+P y escribir WPILib).
fr_ca: **WPILib: Open WPILib Command Palette** - Cette commande est utilisée pour ouvrir une palette de commandes WPILib (équivalent de faire Ctrl+Maj+P et de taper WPILib)

source: **WPILib: Open WPILib Help** - This opens a simple page which links to the WPILib documentation (this site)
es_mx: **WPILib: Open WPILib Help** - Abre una página sencilla que se enlaza con la documentación de WPILib (este sitio)
fr_ca: **WPILib: Open WPILib Help** - Cette commande ouvre une page simple qui se connecte à la documentation WPILib (ce site)

source: **WPILib: Reset Ask for WPILib Updates Flag** - This will clear the flag on the current project, allowing you to re-prompt to update a project to the latest WPILib version if you previously chose to not update.
es_mx: **WPILib: Reset Ask for WPILib Updates Flag** - Esto borrará la marca en el proyecto actual, lo que le permite volver a solicitar actualizar un proyecto a la última versión de WPILib si anteriormente eligió no actualizar.
fr_ca: **WPILib: Reset Ask for WPILib Updates Flag** - Cette commande effacera l’indicateur du projet en cours, ce qui vous permettra de rélancer l'invite afin de mettre à jour un projet à la dernière version WPILib si vous avez précédemment choisi de ne pas mettre à jour.

source: **WPILib: Run a command in Gradle** - This lets you run an arbitrary command in the GradleRIO command environment
es_mx: **WPILib: Run a command in Gradle** - Esto le permite ejecutar un comando arbitrario en el entorno de comandos GradleRIO
fr_ca: **WPILib: Run a command in Gradle** - Cette commande vous permet d’exécuter une commande arbitraire dans l’environnement de commande GradleRIO

source: **WPILib: Set Team Number** - Used to modify the team number associated with a project. This is only needed if you need to change the team number from the one initially specified when creating the project.
es_mx: **WPILib: Set Team Number** - Se utiliza para modificar el número de equipo asociado a un proyecto. Esto solo es necesario si necesita cambiar el número de equipo del especificado inicialmente al crear el proyecto.
fr_ca: **WPILib: Set Team Number** - Cette commande est utilisée pour modifier le numéro d’équipe associé à un projet. Cette opération n’est nécessaire que si vous devez modifier le numéro d’équipe de celui initialement spécifié lors de la création du projet.

source: **WPILib: Set VS Code Java Home to FRC Home** - Set the VS Code Java Home variable to point to the Java Home discovered by the FRC extension. This is needed if not using the offline installer to make sure the intellisense settings are in sync with the WPILib build settings.
es_mx: **WPILib: Set VS Code Java Home to FRC Home** - Establece la variable VS Code Java Home para que apunte a Java Home descubierto por la extensión FRC. Esto es necesario si no se utiliza el instalador sin conexión para asegurarse de que la configuración de intellisense está sincronizada con la configuración de compilación de WPILib.
fr_ca: **WPILib: Set VS Code Java Home to FRC Home** - Cette commande configure la variable VS Code Java Home pour pointer vers l'emplacement de Java découverte par l’extension FRC. Cette opération est nécessaire si vous n’utilisez pas l’installateur hors connexion pour vous assurer que les paramètres intellisense sont synchronisés avec les paramètres de construction de WPILib.

source: **WPILib: Show Log Folder** - Shows the folder where the WPILib extension stores internal logs. This may be useful when debugging/reporting an extension issue to the WPILib developers
es_mx: **WPILib: Show Log Folder** - Muestra la carpeta donde la extensión WPILib almacena los registros internos. Esto puede ser útil al informar de un problema de extensión a los desarrolladores de WPILib
fr_ca: **WPILib: Show Log Folder** - Affiche le dossier où l’extension WPILib stocke les journaux internes. Cela peut être utile lors du débogage/signalement d’un problème d’extension aux développeurs WPILib

source: **WPILib: Simulate Robot Code on Desktop** - This builds the current robot code project on your PC and starts it running in simulation. This requires Desktop Support to be set to Enabled.
es_mx: **WPILib: Simulate Robot Code on Desktop** - Esto construye el proyecto del código de robot actual en su computadora y lo inicia ejecutándose en simulación. Esto requiere que el soporte técnico de escritorio se establezca en Habilitado.
fr_ca: **WPILib: Simulate Robot Code on Desktop** - Cette commande perment de construire le projet actuel de code robot sur votre PC et d'en lancer la simulation. Cette opétation nécessite de configurer *Desktop Support* sur Enabled.

source: **WPILib: Start RioLog** - This starts the RioLog display used to view console output from a robot program
es_mx: **WPILib: Start RioLog** - Esto inicia la pantalla RioLog utilizada para ver la salida de la consola de un programa de robot
fr_ca: **WPILib: Start RioLog** - Cette commande démarre l’affichage RioLog utilisé pour afficher la sortie de la console à partir d’un programme de robot

source: **WPILib: Start Tool** - This allows you to launch WPILib tools (e.g. SmartDashboard, Shuffleboard, etc.) from inside VS Code
es_mx: **WPILib: Start Tool** - Esto le permite iniciar las herramientas WPILib (por ejemplo, SmartDashboard, Shuffleboard, etc.) desde dentro de VS Code
fr_ca: **WPILib: Start Tool** - Cette commande vous permet de lancer des outils WPILib (par exemple SmartDashboard, Shuffleboard, etc.) à partir de VS Code

source: **WPILib: Test Robot Code** - This builds the current robot code project and runs any created tests. This requires Desktop Support to be set to Enabled.
es_mx: **WPILib: Test Robot Code** - Esto compila el proyecto de código de robot actual y ejecuta las pruebas creadas. Esto requiere que el soporte técnico de escritorio se establezca en Habilitado.
fr_ca: **WPILib: Test Robot Code** - Cette commande construit le projet actuel de code robot et exécute tous les tests créés. Cette opération nécessite que Desktop Support soit configuré sur Enabled.

source: **WPILib: Open Project Information** - Opens a widget with project information (Project version, extension version, etc.)
es_mx: **WPILib: Open Project Information** - Abre un widget con información del proyecto (versión del proyecto, versión de extensión, etc.)
fr_ca: **WPILib: Open Project Information** - Ouvre un widget avec des informations de projet (version project, version d’extension, etc.)
