Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/layouts-with-code/configuring-widgets.po
Languages: fr_ca, tr_tr

source: Configuring widgets
fr_ca: Configuration des widgets
tr_tr: Widget'ları yapılandırma

source: Robot programs can specify exactly which widget to use to display a data point, as well as how that widget should be configured. As there are too many widgets to be listed here, consult the docs for details.
fr_ca: Les programmes de robot peuvent spécifier exactement quel widget utiliser pour afficher un point de données, ainsi que la façon dont ce widget doit être configuré. Comme il y a trop de widgets pour être listés ici, consultez la documentation pour plus de détails.
tr_tr: Robot programları, bir veri noktasını görüntülemek için hangi parçacığın kullanılacağını ve bu parçacığın nasıl yapılandırılması gerektiğini tam olarak belirleyebilir. Burada listelenemeyecek kadar çok widget olduğundan, ayrıntılar için dokümanlara bakın.

source: Specifying a widget
fr_ca: Spécification d'un widget
tr_tr: Bir widget belirleme

source: Call `withWidget` after `add` in the call chain:
fr_ca: Appelez `withWidget` après` add` dans la chaîne d'invocation:
tr_tr: Çağrı zincirinde "add" dan sonra "withWidget" ı arayın:

source: In this example, we configure the "Max Speed" widget to use a slider to modify the values instead of a basic text field.
fr_ca: Dans cet exemple, nous configurons le widget "Max Speed" pour utiliser un curseur pour modifier les valeurs au lieu d'un champ de texte de base.
tr_tr: Bu örnekte, "Maksimum Hız" widget'ını, temel bir metin alanı yerine değerleri değiştirmek için bir kaydırıcı kullanacak şekilde yapılandırıyoruz.

source: Setting widget properties
fr_ca: Définition des propriétés du widget
tr_tr: Widget özelliklerini ayarlama

source: Since the maximum speed only makes sense to be a value from 0 to 1 (full stop to full speed), a slider from -1 to 1 can cause problems if the value drops below zero. Fortunately, we can modify that using the ``withProperties`` method
fr_ca: Étant donné que la vitesse maximale est significative seulement entre les valeurs 0 à 1 (arrêt complet à pleine vitesse), un curseur de -1 à 1 peut provoquer des problèmes si la valeur tombe en dessous de zéro. Heureusement, nous pouvons modifier cela en utilisant la méthode ``withProperties``
tr_tr: Maksimum hızın yalnızca 0 ile 1 arasında bir değer olması mantıklı olduğundan (tam durmadan tam hıza), -1'den 1'e bir kaydırıcı, değer sıfırın altına düşerse sorunlara neden olabilir. Neyse ki, bunu `` withProperties '' yöntemini kullanarak değiştirebiliriz

source: Notes
fr_ca: Remarques
tr_tr: Notlar

source: Widgets can be specified by name; however, names are case- and whitespace-sensitive ("Number Slider" is different from "Number slider" and "NumberSlider"). For this reason, it is recommended to use the built in widgets class to specify the widget instead of by raw name. However, a custom widget can only be specified by name or by creating a custom ``WidgetType`` for that widget.
fr_ca: Les widgets peuvent être spécifiés par leur nom; cependant, les noms sont sensibles à la casse et aux espaces ("Number Slider" est différent de "Number slider" et "NumberSlider"). Pour cette raison, il est recommandé d'utiliser la classe de widgets intégrée pour spécifier le widget plutôt que par nom brut. Cependant, un widget personnalisé ne peut être spécifié que par son nom ou en créant un ``WidgetType`` personnalisé pour ce widget.
tr_tr: Widget'lar isme göre belirtilebilir; ancak, adlar büyük / küçük harfe ve boşluklara duyarlıdır ("Number Slider-Sayı Kaydırıcısı", "Number slider" ve "NumberSlider" ndan farklıdır). Bu nedenle, widget'ı ham ad yerine belirtmek için yerleşik widget sınıfının kullanılması önerilir. Ancak, özel bir pencere öğesi yalnızca adıyla veya o pencere öğesi için özel bir `` WidgetType '' oluşturularak belirtilebilir.

source: Widget property names are neither case-sensitive nor whitespace-sensitive ("Max" and "max" are the same). Consult the documentation on the widget in the BuiltInWidgets class for details on the properties of that widget.
fr_ca: Les noms de propriété de widget ne sont ni sensibles à la casse ni sensibles aux espaces ("Max" et "max" sont identiques). Consultez la documentation sur le widget dans la classe BuiltInWidgets pour plus de détails sur les propriétés de ce widget.
tr_tr: Widget özellik adları, ne büyük / küçük harfe ne de boşluklara duyarlıdır ("Maks" ve "maks" aynıdır). Söz konusu pencere aracının özellikleriyle ilgili ayrıntılar için BuiltInWidgets sınıfındaki pencere aracının belgelerine bakın.
