Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/layouts-with-code/sending-data.po
Languages: es_mx, fr_ca, tr_tr

source: Sending data
es_mx: Enviando datos
fr_ca: Envoi de données
tr_tr: Veri gönderme

source: Unlike SmartDashboard, data cannot be sent directly to Shuffleboard without first specifying what tab the data should be placed in.
es_mx: A diferencia de SmartDashboard, los datos no se pueden enviar directamente a Shuffleboard sin antes especificar en qué pestaña se deben colocar los datos.
fr_ca: Contrairement à SmartDashboard, les données ne peuvent pas être envoyées directement à Shuffleboard sans spécifier au préalable dans quel onglet les données doivent être placées.
tr_tr: SmartDashboard'dan farklı olarak, veriler ilk önce verilerin hangi sekmeye yerleştirilmesi gerektiği belirtilmeden doğrudan Shuffleboard'a gönderilemez.

source: Sending simple data
es_mx: Envío de datos simples
fr_ca: Envoi de données simples
tr_tr: Basit Veri gönderme

source: Sending simple data (numbers, strings, booleans, and arrays of these) is done by calling ``add`` on a tab. This method will set the value if not already present, but will not overwrite an existing value.
es_mx: El envío de datos simples (números, cadenas, valores booleanos y matrices de estos) se realiza llamando ``add`` en una pestaña. Este método establecerá el valor si aún no está presente, pero no sobrescribirá un valor existente.
fr_ca: L'envoi de données simples (nombres, chaînes de caractères, booléens et tableaux de ces types) se fait en invoquant ``add`` sur un onglet. Cette méthode définira la valeur si elle n'est pas déjà présente, mais n'écrasera pas une valeur existante.
tr_tr: Basit verilerin (sayılar, dizeler, mantıksallar ve bunların dizileri) gönderilmesi, bir sekmede ``add`` çağrısı yapılarak yapılır. Bu yöntem, zaten mevcut değilse değeri ayarlayacak, ancak mevcut bir değerin üzerine yazmayacaktır.

source: If data needs to be updated (for example, the output of some calculation done on the robot), call ``getEntry()`` after defining the value, then update it when needed or in a ``periodic`` function
es_mx: Si los datos deben actualizarse (por ejemplo, la salida de algún cálculo realizado en el robot), llame a ``getEntry()`` después de definir el valor, luego actualice cuando sea necesario o en una función ``periódica``
fr_ca: Si les données doivent être mises à jour (par exemple, la sortie de certains calculs effectués sur le robot), appelez ``getEntry()`` après avoir défini la valeur, puis mettez-la à jour lorsque nécessaire ou dans une fonction ``periodic``
tr_tr: Verilerin güncellenmesi gerekiyorsa (örneğin, robot üzerinde yapılan bazı hesaplamaların çıktısı), değeri tanımladıktan sonra `` getEntry ()``çağrısı yapın, ardından gerektiğinde veya ``periodic`` bir işlevde güncelleyin.

source: Making choices persist between reboots
es_mx: Hacer que las elecciones persistan entre reinicios
fr_ca: Rétention des choix entre les redémarrages
tr_tr: Yeniden başlatmalar arasında seçimlerin sürekliliğini sağlamak

source: When configuring a robot from the dashboard, some settings may want to persist between robot or driverstation reboots instead of having drivers remember (or forget) to configure the settings before each match.
es_mx: Al configurar un robot desde el tablero, es posible que algunos ajustes persistan entre los reinicios del robot o de la estación del conductor en lugar de que los conductores recuerden (u olviden) configurar los ajustes antes de cada partido.
fr_ca: Lors de la configuration d'un robot à partir du tableau de bord, on peut avoir besoin de retenir certain paramètres entre les redémarrages du robot ou de la station de pilotage au lieu de s'en remettre aux pilotes pour se souvenir (ou oublier) de configurer les paramètres avant chaque match.
tr_tr: Bir robotu kontrol panelinden yapılandırırken, bazı ayarlar, sürücülerin her maçtan önce ayarları yapılandırmayı hatırlamasını (veya unutmasını) yerine, robot veya sürücü istasyonunun yeniden başlatmaları arasında kalmasını isteyebilir.

source: Simply using `addPersistent` instead of `add` will make the value saved on the roboRIO and loaded when the robot program starts.
es_mx: Simplemente usando `addPersistent` en lugar de` add` hará que el valor se guarde en el roboRIO y se cargue cuando se inicie el programa del robot.
fr_ca: La simple utilisation de `addPersistent` au lieu de `add` enregistrera la valeur sur le roboRIO et elle sera chargée au démarrage du programme du robot.
tr_tr: Basitçe "add" yerine "addPersistent" kullanmak, değerin roboRIO'ya kaydedilmesini ve robot programı başladığında yüklenmesini sağlayacaktır.

source: This does not apply to sendable data such as choosers or motor controllers.
es_mx: Esto no se aplica a los datos que se pueden enviar como selectores o controladores de motor.
fr_ca: Cela ne s'applique pas aux données transmissibles telles que les sélecteurs ou les contrôleurs de moteur.
tr_tr: Bu, seçiciler veya motor kontrolörleri gibi gönderilebilir veriler için geçerli değildir.

source: Sending sensors, motors, etc
es_mx: Envío de sensores, motores, etc.
fr_ca: Envoi de capteurs, moteurs, etc.
tr_tr: Sensör, motor vb. Gönderme

source: Analogous to ``SmartDashboard.putData``, any ``Sendable`` object (most sensors, motor controllers, and SendableChoosers) can be added to any tab
es_mx: De manera análoga a ``SmartDashboard.putData``, cualquier objeto ``Sendable`` (la mayoría de los sensores, controladores de motor y SendableChoosers) se pueden agregar a cualquier pestaña
fr_ca: Analogue à ``SmartDashboard.putData``, n’importe quel objet ``Sendable`` (la plupart des capteurs, contrôleurs de moteurs et SendableChoosers) peut être ajouté à n’importe quel onglet
tr_tr: ``SmartDashboard.putData`` ya benzer şekilde, herhangi bir ``Sendable-Gönderilebilir`` nesne (çoğu sensör, motor kontrol cihazı ve SendableChoosers) herhangi bir sekmeye eklenebilir
