Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/layouts-with-code/using-tabs.po
Languages: tr_tr

source: Using tabs
tr_tr: Sekmeleri kullanma

source: Shuffleboard is a tabbed interface. Each tab organizes widgets in a logical grouping. By default, Shuffleboard has tabs for the legacy SmartDashboard and LiveWindow - but new tabs can now be created in Shuffleboard directly from a robot program for better organization.
tr_tr: Shuffleboard sekmeli bir arayüzdür. Her sekme, widget'ları mantıksal bir gruplamada düzenler. Varsayılan olarak, Shuffleboard'un eski SmartDashboard ve LiveWindow için sekmeleri vardır - ancak artık daha iyi bir organizasyon için Shuffleboard'da doğrudan bir robot programından yeni sekmeler oluşturulabilir.

source: Creating a new tab
tr_tr: Yeni bir sekme oluşturmak

source: Creating a new tab is as simple as calling a single method on the Shuffleboard class, which will create a new tab on Shuffleboard and return a handle for adding your data to the tab. Calling getTab multiple times with the same tab title will return the same handle each time.
tr_tr: Yeni bir sekme oluşturmak, Shuffleboard sınıfında tek bir yöntemi çağırmak kadar basittir; bu, Shuffleboard'da yeni bir sekme oluşturur ve verilerinizi sekmeye eklemek için bir tutamaç döndürür. GetTab'ın aynı sekme başlığıyla birden çok kez çağrılması, her seferinde aynı tanıtıcıyı döndürür.

source: Selecting a tab
tr_tr: Sekmeyi seç

source: This method lets a tab be selected by title. This is case-sensitive (so "Tab Title" and "Tab title" are two individual tabs), and only works if a tab with that title exists at the time the method is called, so calling ``selectTab("Example")``\ will only have an effect if a tab named "Example" has previously been defined.
tr_tr: Bu yöntem, bir sekmenin başlığa göre seçilmesine izin verir. Bu, büyük / küçük harfe duyarlıdır (bu nedenle "Tab Title" ve "Tab title" iki ayrı sekmedir) ve yalnızca yöntem çağrıldığında bu başlığa sahip bir sekme varsa çalışır, bu nedenle "selectTab" ("Example") `\ yalnızca daha önce "Example" adlı bir sekme tanımlanmışsa etkili olacaktır.

source: This method can be used to select any tab in Shuffleboard, not just ones created by the robot program.
tr_tr: Bu yöntem, yalnızca robot programı tarafından oluşturulanları değil, Shuffleboard'daki herhangi bir sekmeyi seçmek için kullanılabilir.

source: Caveats
tr_tr: Uyarılar

source: Tabs created from a robot program differ in a few important ways from normal tabs created from the dashboard:
tr_tr: Bir robot programından oluşturulan sekmeler, kontrol panelinden oluşturulan normal sekmelerden birkaç önemli yönden farklılık gösterir:

source: Not saved in the Shuffleboard save file
tr_tr: Shuffleboard kayıt dosyasına kaydedilmedi

source: No support for autopopulation
tr_tr: Otopopülasyon desteği yok

source: Users are expected to specify the tab contents in their robot program
tr_tr: Kullanıcıların robot programlarında sekme içeriklerini belirtmeleri beklenir

source: Have a special color to differentiate from normal tabs
tr_tr: Normal sekmelerden ayırt etmek için özel bir renge sahip olun
