Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/smartdashboard/test-mode-and-live-window/pid-tuning-with-smartdashboard.po
Languages: es_mx, fr_ca, tr_tr

source: PID Tuning with SmartDashboard
es_mx: Sintonizar un PID con SmartDashboard
fr_ca: Réglage des paramètres PID avec SmartDashboard
tr_tr: SmartDashboard ile PID Ayarı

source: The PID (Proportional, Integral, Differential) is an algorithm for determining the motor speed based on sensor feedback to reach a setpoint as quickly as possible. For example, a robot with an elevator that moves to a predetermined position should move there as fast as possible then stop without excessive overshoot leading to oscillation. Getting the PID controller to behave this way is called "tuning". The idea is to compute an error value that is the difference between the current value of the mechanism feedback element and the desired (setpoint) value. In the case of the arm, there might be a potentiometer connected to an analog channel that provides a voltage that is proportional to the position of the arm. The desired value is the voltage that is predetermined for the position the arm should move to, and the current value is the voltage for the actual position of the arm.
es_mx: Un PID (Proporcional, Integral, Diferencial) es un algoritmo para determinar la velocidad de un motor basado en la retroalimentación de sensores, para alcanzar el punto de control lo más rápido posible. Por ejemplo, un robot con un elevador que se mueve a una determinada posición debería moverse lo más rápido posible y luego detenerse sin excederse, para no generar oscilaciones. Conseguir que el controlador PID se comporte de esta forma se llama “sintonizar”. La idea es calcular un valor de error que sea la diferencia entre el valor actual del elemento del mecanismo de retroalimentación y el valor deseado (punto de control). En caso de ser un brazo, puede que exista un potenciómetro conectado al canal análogo que provea de un voltaje proporcional a la posición del brazo. El valor deseado es el voltaje predeterminado a la posición a la que se moverá el brazo, y el valor actual es el voltaje para la posición actual del brazo.
fr_ca: Le PID (Proportionnel, Intégral, Dérivé) est un algorithme permettant de déterminer, par exemple, la vitesse d'un moteur en se servant d'une boucle de rétroaction à partir du signal d'un capteur pour atteindre une valeur désirée, la cible, le plus rapidement possible. Ainsi, un robot avec un mécanisme élévateur qui se déplace vers une position prédéterminée devrait s’y rendre aussi vite que possible, puis s’arrêter sans dépassement excessif conduisant à une oscillation. C'est par réglage du PID de l'élévateur qu'on peut arriver à ce résultat. L’idée derrière le PID est de calculer, pour un paramètre donné, la position d'un bras par exemple, une valeur d’écart qui est la différence entre la valeur actuelle de l’élément de rétroaction du mécanisme et la valeur souhaitée (cible). Dans le cas du bras, l'élément de rétroaction peut être un potentiomètre relié à un canal analogique qui fournit une tension qui est proportionnelle à la position du bras. La valeur souhaitée est la tension prédéterminée du potentiomètre pour que le bras se trouve à la position voulue, et la valeur actuelle est la tension correspondant à la position réelle du bras au moment précis où la mesure est prise.
tr_tr: PID (Orantılı, İntegral, Diferansiyel), bir ayar noktasına mümkün olan en hızlı şekilde ulaşmak için sensör geri bildirimine dayalı olarak motor hızını belirleyen bir algoritmadır. Örneğin, önceden belirlenmiş bir konuma hareket eden bir asansöre sahip bir robot, orada olabildiğince hızlı hareket etmeli ve ardından salınıma yol açan aşırı aşma olmadan durmalıdır. PID denetleyicinin bu şekilde davranmasını sağlamak "ayarlama" olarak adlandırılır. Buradaki fikir, mekanizma geri besleme elemanının mevcut değeri ile istenen (ayar noktası) değeri arasındaki fark olan bir hata değerini hesaplamaktır. Kol durumunda, kolun pozisyonuyla orantılı bir voltaj sağlayan bir analog kanala bağlı bir potansiyometre olabilir. İstenilen değer, kolun hareket etmesi gereken konum için önceden belirlenmiş voltajdır ve mevcut akım değeri, kolun gerçek konumu için olan voltajdır.

source: Finding the setpoint values with LiveWindow
es_mx: Encontrar los valores de los puntos de control con LiveWindow
fr_ca: Détermination des valeurs cibles avec LiveWindow
tr_tr: LiveWindow ile ayar noktası değerlerini bulma

source: Create a PID Subsystem for each mechanism with feedback. The PID Subsystems contain the actuator (motor) and the feedback sensor (potentiometer in this case). You can use Test mode to display the subsystem sensors and actuators. Using the slider manually adjust the actuator to each desired position. Note the sensor values (2) for each of the desired positions. These will become the setpoints for the PID controller.
es_mx: Cree un subsistema PID por cada mecanismo con retroalimentación. Los subsistemas PID contienen el actuador (motor) y el sensor de retroalimentación (potenciómetro, en este caso). Puede usar el modo de prueba para visualizar los sensores y actuadores del subsistema. Utilice manualmente el intensificador para ajustar el actuador a la posición que desee. Note que los valores del sensor (2) para cada posición deseada. Estos valores se convertirán en los puntos de control de los controladores PID.
fr_ca: Créez un sous-système PID pour chaque mécanisme pourvu d'une boucle de rétroaction. Les sous-systèmes PID contiennent un actionneur (moteur) et un capteur de rétroaction (potentiomètre dans le cas présent). Vous pouvez utiliser le mode Test pour afficher les valeurs des capteurs et actionneurs du sous-système. À l’aide du curseur, contrôlez manuellement l’actionneur à chaque position souhaitée. Notez les valeurs du capteur (2) pour chacune des positions prédéterminées. Celles-ci serviront de cibles pour le contrôleur PID.
tr_tr: Her mekanizma için geri bildirimli bir PID Alt Sistemi oluşturun. PID Alt Sistemleri, aktüatörü (motor) ve geri bildirim sensörünü (bu durumda potansiyometre) içerir. Alt sistem sensörlerini ve aktüatörleri görüntülemek için Test modunu kullanabilirsiniz. Kaydırıcıyı kullanarak aktüatörü istenen her konuma manuel olarak ayarlayın. İstenen konumların her biri için sensör değerlerini (2) not edin. Bunlar, PID kontrolörü için ayar noktaları olacaktır.

source: Viewing the PIDController in LiveWindow
es_mx: Visualizar el controlador PID en LiveWindow
fr_ca: Affichage du PIDController dans LiveWindow
tr_tr: PIDController'ı LiveWindow'da görüntüleme

source: In Test mode, the PID Subsystems display their P, I, and D parameters that are set in the code. The P, I, and D values are the weights applied to the computed error (P), sum of errors over time (I), and the rate of change of errors (D). Each of those terms is multiplied by the weights and added together to form the motor value. Choosing the optimal P, I, and D values can be difficult and requires some amount of experimentation. The Test mode on the robot allows the values to be modified, and the mechanism response observed.
es_mx: En el modo de prueba, los subsistemas PID se muestran con sus parámetros P, I, y D por separado. Los valores P, I y D son los pesos aplicados al error calculado (P), la suma de los errores en razón al tiempo (I), y la tasa de cambio de los errores (D). Cada uno de estos términos es multiplicado por los pesos y se añaden juntos para formar el valor del motor. Escoger los valores óptimos para P, I y D puede ser una tarea difícil y requiere cierta experiencia. El modo de prueba permite modificar estos valores, y observar el mecanismo de respuesta.
fr_ca: En mode Test, les sous-systèmes PID affichent leurs paramètres P, I et D qui ont été définies dans le code. Les valeurs P, I et D sont les poids appliqués à l’écart calculé (P), la somme des écarts au fil du temps (I) et le taux de changement des écarts (D). Chacun de ces termes est multiplié par le poids correspondant et, additionnés ensemble, ils forment la valeur envoyée au moteur. Choisir les valeurs optimales de P, I et D peut être difficile et nécessite beaucoup d’essais et erreurs. En opérant le robot en mode Test, on peut modifier ces valeurs et observer la réponse du mécanisme.
tr_tr: Test modunda, PID Alt Sistemleri kodda ayarlanan P, I ve D parametrelerini görüntüler. P, I ve D değerleri, (P) hesaplanan hataya uygulanan ağırlıklar, (I) zaman içindeki hataların toplamı ve (D) hataların değişim oranıdır. Bu terimlerin her biri ağırlıklarla çarpılır ve motor değerini oluşturmak için toplanır. En uygun P, I ve D değerlerini seçmek zor olabilir ve bir miktar deneme gerektirir. Robot üzerindeki Test modu, değerlerin değiştirilmesine ve mekanizma yanıtının gözlemlenmesine izin verir.

source: The enable option does not affect the `PIDController <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__ introduced in 2020, as the controller is updated every robot loop. See the example :ref:`here <docs/software/wpilib-tools/shuffleboard/advanced-usage/shuffleboard-tuning-pid:Enable Functionality in the New PIDController>` on how to retain this fuctionality.
es_mx: La opción de activación no afecta al `PIDController <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__ introducido en 2020, ya que el controlador se actualiza en cada bucle del robot. Vea el ejemplo :ref:`aquí <docs/software/wpilib-tools/shuffleboard/advanced-usage/shuffleboard-tuning-pid:Enable Functionality in the New PIDController>` sobre cómo conservar esta funcionalidad.
fr_ca: L'option enable n'affecte pas le `PIDController <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__ introduit en 2020, car le contrôleur est mis à jour à chaque boucle de robot. Voir l'exemple :ref:`ici <docs/software/wpilib-tools/shuffleboard/advanced-usage/shuffleboard-tuning-pid:Enable Functionality in the New PIDController>` pour savoir comment conserver cette fonctionnalité.
tr_tr: Etkinleştirme seçeneği, denetleyici her robot döngüsünde güncellendiği için 2020'de tanıtılan `PIDController <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>` __ 'ı etkilemez. Bu işlevselliğin nasıl korunacağına ilişkin örneğe bakın : ref: `burada <docs/software/wpilib-tools/shuffleboard/advanced-usage/shuffleboard-tuning-pid:Enable Functionality in the New PIDController>`.

source: Tuning the PIDController
es_mx: Sintonizar el controlador PID
fr_ca: Réglage du Contrôleur PID
tr_tr: PIDController'ı Ayarlama

source: Tuning the PID controller can be difficult and there are many articles that describe techniques that can be used. It is best to start with the P value first. To try different values fill in a low number for P, enter a setpoint determined earlier in this document, and note how fast the mechanism responds. If it responds too slowly, perhaps never reaching the setpoint, increase P. If it responds too quickly, perhaps oscillating, reduce the P value. Repeat this process until you get a response that is as fast as possible without oscillation. It's possible that having a P term is all that's needed to achieve adequate control of your mechanism. Further information is located in the :doc:`/docs/software/advanced-controls/introduction/tuning-pid-controller` document.
es_mx: Sincronizar el controlador PID puede resultar complicado y existen muchos artículos que describen técnicas útiles para dicha tarea. Lo mejor es comenzar con el valor de P. Para probar diferentes valores, comience con números pequeños para P, registre el punto de control establecido anteriormente en este documento y preste atención a qué tan rápida es la respuesta del mecanismo. Si tarda mucho tiempo en responder, tal vez nunca alcance a llegar al punto de control, y es necesario aumentar el valor de P. Si responde demasiado pronto, puede generarse oscilaciones y es recomendable reducir el valor de P. Repita este proceso hasta que consiga una respuesta rápida y sin oscilaciones. Es posible que el mecanismo sólo necesite del término P para tener un control adecuado de su mecanismo. Puede encontrar más información en el documento :doc:`/docs/software/advanced-controls/introduction/tuning-pid-controller` .
fr_ca: Le réglage d'un contrôleur PID peut s'avérer ardu et, pour y parvenir, il existe beaucoup d’articles qui décrivent des techniques pouvant être utilisées. Il est conseillé de commencer par régler la valeur P d’abord. Pour tester différentes valeurs, commencez par donner à P une valeur faible, ensuite entrez la cible déterminée plus tôt dans ce document et notez la rapidité avec laquelle le mécanisme réagit. S’il réagit trop lentement, ou s'il atteint jamais la cible, il faut alors augmenter P. S’il réagit trop rapidement, ou si le mécanisme oscille, dans ce cas, il faut réduire la valeur de P. Répétez ce processus jusqu’à ce que vous obteniez une réponse aussi rapide que possible sans oscillation. Il peut arriver que, pour votre contrôleur PID, le terme P soit suffisant pour un contrôle adéquat de votre mécanisme. De plus amples informations se trouvent dans le document :doc:`/docs/software/advanced-controls/introduction/tuning-pid-controller`.
tr_tr: PID denetleyicisini ayarlamak zor olabilir ve kullanılabilecek teknikleri açıklayan birçok makale vardır. İlk önce P değeriyle başlamak en iyisidir. Farklı değerleri denemek için P için düşük bir sayı girin, bu belgede daha önce belirlenen bir ayar noktası bulun ve mekanizmanın ne kadar hızlı tepki verdiğine dikkat edin. Çok yavaş yanıt verirse, belki de ayar noktasına asla ulaşmazsa, P'yi artırın. Çok hızlı yanıt verirse, belki de salınım yaparsa, P değerini azaltın. Salınım olmadan olabildiğince hızlı yanıt alana kadar bu işlemi tekrarlayın. Bir P terimine sahip olmak, mekanizmanız üzerinde yeterli kontrol elde etmek için gereken tek şey olabilir. Daha fazla bilgi: doc: `/ docs / software / advanced-controls / Introduction / tuning-pid-controller` dokümanında bulunmaktadır.

source: Once you have determined P, I, and D values they can be inserted into the program. You'll find them either in the properties for the PIDSubsystem in RobotBuilder or in the constructor for the PID Subsystem in your code.
es_mx: Una vez que ha determinado los valores de P, I y D estos pueden añadirse a su código. Puede encontrarlos en las propiedades de sus subsistemas PID en RobotBuilder o en el constructor del subsistema PID dentro de su código.
fr_ca: Une fois que vous avez déterminé les valeurs de P, I et D, elles peuvent alors être insérées dans votre programme. Plus précisément soit dans les propriétés du PIDSubsystem dans RobotBuilder, soit dans le constructeur du sous-système PID dans votre programme du robot.
tr_tr: P, I ve D değerlerini belirledikten sonra bunlar programa eklenebilir. Bunları ya RobotBuilder'daki PIDSubsystem'in özelliklerinde ya da kodunuzdaki PID Alt Sisteminin yapıcısından bulacaksınız.

source: The F (feedforward) term is used for controlling velocity with a PID controller.
es_mx: El término F (avance) es utilizado para controlar la velocidad con el controlador PID.
fr_ca: Le terme F (feedforward) est utilisé pour le contrôle de la vitesse avec un contrôleur PID.
tr_tr: F (ileri besleme) terimi, bir PID kontrolörü ile hızı kontrol etmek için kullanılır.

source: More information can be found at :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
es_mx: Para más información, consulte :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
fr_ca: Plus d'informations peuvent être trouvées à :ref: `docs/software/advanced-controls /controllers/pidcontroller: PID Control in WPILib`.
tr_tr: Daha fazla bilgi şu adreste bulunabilir :ref: `docs / software / advanced-controls / controllers / pidcontroller: PID Control in WPILib`.
