Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/actuators/addressable-leds.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Addressable LEDs
es_mx: LED direccionables
fr_ca: Les LEDs adressables
tr_tr: Adreslenebilir LED'ler
zh_cn: 可寻址 LED

source: LED strips have been commonly used by teams for several years for a variety of reasons. They allow teams to debug robot functionality from the audience, provide a visual marker for their robot, and can simply add some visual appeal. WPILib has an API for controlling WS2812 LEDs with their data pin connected via PWM.
es_mx: Las tiras de LED han sido utilizadas comúnmente por los equipos durante varios años por una variedad de razones. Permitir a los equipos depurar la funcionalidad del robot de la audiencia, proporcionar un marcador visual para su robot, y simplemente puede agregar un poco de atractivo visual. WPILib tiene una API para controlar WS2812 LED con su pin de datos conectado a través de PWM.
fr_ca: Les bandes LED sont couramment utilisées par les équipes depuis plusieurs années pour diverses raisons. Ils permettent aux équipes de déboguer la fonctionnalité du robot, de fournir un marqueur visuel pour un mécanisme ou tout simplement ajouter un attrait visuel pour les spectateurs. WPILib dispose d'une API pour contrôler les LED WS2812 avec leur broche de données connectée via PWM.
tr_tr: LED şeritler, çeşitli nedenlerle birkaç yıldır ekipler tarafından yaygın olarak kullanılmaktadır. Ekiplerin, izleyicilerden robot işlevlerinde hata ayıklamasına, robotları için görsel bir işaretçi sağlamasına ve sadece biraz görsel çekicilik katmasına olanak tanır. WPILib, WS2812 LED'leri PWM aracılığıyla bağlı veri pinleri ile kontrol etmek için bir API'ye sahiptir.
zh_cn: 出于多种原因，LED 灯带在近几年来被各个队伍广泛使用。LED 灯带可以让队伍能够通过观察 LED 灯调试机器人的各项功能，为他们的机器人提供一个视觉标记，并且可增添一些视觉上的吸引力。 WPILib 有一个用于控制 WS2812 LED 的 API ，其数据线通过 PWM 连接。

source: Instantiating the AddressableLED Object
es_mx: Crear instancias del objeto LED direccionable
fr_ca: Instanciation de l'objet adressableLED
tr_tr: AddressableLED Nesnesini Örnekleme
zh_cn: 实例化 AddressableLED 对象

source: You first create an ``AddressableLED`` object that takes the PWM port as an argument. It *must* be a PWM header on the roboRIO. Then you set the number of LEDs located on your LED strip, with can be done with the ``setLength()`` function.
es_mx: Primero crea un objeto ``AddressableLED`` que toma el puerto PWM como argumento. Deberá ser un encabezado PWM a la roboRIO. Luego configura el número de LED ubicados en su LED strip, con se puede hacer con la función ``setLength()``.
fr_ca: Vous créez d'abord un objet ``AddressableLED`` qui prend le port PWM comme argument. Ça doit être *obligatoirement* une sortie PWM sur le roboRIO. Ensuite, vous définissez le nombre de LED situées sur votre bande de LED, par l'entremise de la fonction ``setLength()``.
tr_tr: Önce PWM bağlantı noktasını argüman olarak alan bir ``AddressableLED`` nesnesi oluşturun. RoboRIO'da bir PWM bağlantısı *olmalıdır*. Ardından, LED şeridinizde bulunan LED'lerin sayısını ``setLength()`` işlevi ile yapabilirsiniz.
zh_cn: 首先，创建一个 AddressableLED 对象，并将 PWM 端口作为构造函数的参数。这个端口必须是 roboRIO 上的 PWM 接口。然后，可以通过该 setLength() 功能设置 LED 灯带上的 LED 数量。

source: It is important to note that setting the length of the LED header is an expensive task and it's **not** recommended to run this periodically.
es_mx: Es importante tener en cuenta que configurar la longitud del encabezado del LED es una tarea costosa y no se recomienda ejecutar esto periódicamente.
fr_ca: Il est important de noter que le réglage de la longueur décrit ci-haut est une tâche relativement longue à exécuter pour le roboRIO, et il n'est **pas** recommandé de l'exécuter périodiquement.
tr_tr: LED başlığının uzunluğunun ayarlanmasının pahalı bir iş olduğunu ve bunu periyodik olarak yapmanızın **tavsiye edilmediğini** unutmamak önemlidir.
zh_cn: 要注意，设置 LED 的接头长度是一项耗时耗计算量的任务，不建议其在循环中运行。

source: After the length of the strip has been set, you'll have to create an ``AddressableLEDBuffer`` object that takes the number of LEDs as an input. You'll then call ``myAddressableLed.setData(myAddressableLEDBuffer)`` to set the led output data. Finally, you can call ``myAddressableLed.start()`` to write the output continuously. Below is a full example of the initialization process.
es_mx: Después de que se haya establecido la longitud de la tira, tendrá que crear un objeto ``AddressableLEDBuffer`` que toma la cantidad de LED como entrada. Entonces llamarás a ``myAddressableLed.setData(myAddressableLEDBuffer)`` para establecer los datos de salida del led. Finalmente puedes llamar ``myAddressableLed.start()`` para escribir la salida continuamente. A continuación, se muestra un ejemplo completo del proceso de inicialización
fr_ca: Une fois la longueur de la bande définie, vous devrez créer un objet ``AddressableLEDBuffer`` qui prendra le nombre de LED comme entrée. Vous appellerez ensuite ``myAddressableLed.setData(myAddressableLEDBuffer)`` pour définir les données correspondant à chaque LED. Enfin, vous pouvez appeler ``myAddressableLed.start()`` pour écrire la sortie en continu. Voici un exemple complet du processus d'initialisation.
tr_tr: Şeridin uzunluğu ayarlandıktan sonra, LED'lerin sayısını girdi olarak alan bir ``AddressableLEDBuffer`` nesnesi oluşturmanız gerekecektir. Daha sonra led çıkış verilerini ayarlamak için ``myAddressableLed.setData(myAddressableLEDBuffer)`` çağrısı yapacaksınız. Son olarak, çıktıyı sürekli yazmak için ``myAddressableLed.start()`` çağrısı yapabilirsiniz. Aşağıda, başlatma sürecinin tam bir örneği bulunmaktadır.
zh_cn: 设置灯带的长度后，您必须创建一个 "AddressableLEDBuffer" 对象，该对象将 LED 的数量作为输入。然后，您可以调用 "myAddressableLed.setData(myAddressableLEDBuffer)" 以设置 LED 的输出数据。最后，您可以调用 "myAddressableLed.start()" 以连续输入输出。以下是初始化过程的完整示例。

source: C++ does not have an AddressableLEDBuffer, and instead uses an Array.
es_mx: C++ no tiene un AddressableLEDBuffer, y en su lugar usa una matriz.
fr_ca: C++ ne supporte pas un AddressableLEDBuffer et utilise à la place un tableau.
tr_tr: C ++ 'da AddressableLEDBuffer yoktur ve bunun yerine bir Array-dizi kullanır.
zh_cn: C++ 没有 AddressableLEDBuffer 类，而是使用 Array 。

source: Setting the Entire Strip to One Color
es_mx: Configuración de toda la tira a un color
fr_ca: Définition de la bande entière sur une seule couleur
tr_tr: Tüm Şeridi Tek Renge Ayarlama
zh_cn: 将整个灯带设置成单色

source: Color can be set to an individual led on the strip using two methods. ``setRGB()`` which takes RGB values as an input and ``setHSV()`` which takes HSV values as an input.
es_mx: El color se puede ajustar a un led individual en la tira usando dos métodos. ``setRGB()`` el cual toma los valores RGB como entrada y ``setHSV()`` el cual toma los valores HSV como entrada.
tr_tr: Renk, iki yöntem kullanılarak şerit üzerindeki ayrı bir led olarak ayarlanabilir. RGB değerlerini girdi olarak alan ``setRGB()`` ve HSV değerlerini giriş olarak alan ``setHSV()``.
zh_cn: 可以使用两种方法将颜色设置为条带上的单个 LED ：``setRGB()``，即接受 RGB 值作为输入；``setHSV()``，接受 HSV 值作为输入。

source: Using RGB Values
es_mx: Usando valores RGB
fr_ca: Utilisation des valeurs RGB
tr_tr: RGB Değerlerini Kullanma
zh_cn: 使用 RGB 值

source: RGB stands for Red, Green, and Blue. This is a fairly common color model as it's quite easy to understand. LEDs can be set with the ``setRGB`` method that takes 4 arguments: index of the LED, amount of red, amount of green, amount of blue. The amount of Red, Green, and Blue are integer values between 0-255.
es_mx: RGB significa rojo, verde y azul. Este es un modelo de color bastante común, ya que es bastante fácil comprender. Los LED se pueden configurar con el método ``setRGB`` que toma 4 argumentos: índice del LED, cantidad de rojo, cantidad de verde, cantidad de azul. La cantidad de rojo, verde y azul son valores enteros entre 0-255.
fr_ca: RGB signifie rouge, vert et bleu. Il s'agit d'un modèle de couleur assez courant car il est assez facile à comprendre. Les LED peuvent être réglées avec la méthode ``setRGB`` qui prend 4 arguments: index (ou position de la LED sur la bande), valeur pour le rouge, valeur pour le vert, valeur pour le bleu. Les valeurs de rouge, vert et bleu sont des entiers compris entre 0 et 255.
tr_tr: RGB, Kırmızı, Yeşil ve Mavi anlamına gelir. Bu, anlaşılması oldukça kolay olduğu için oldukça yaygın bir renk modelidir. LED'ler, 4 argüman alan ``setRGB`` yöntemi ile ayarlanabilir: LED'in indeksi, kırmızı miktarı, yeşil miktarı, mavi miktarı. Kırmızı, Yeşil ve Mavi miktarı 0-255 arasındaki tam sayılardır.
zh_cn: RGB 指红、绿、蓝。这是一个相当常见的色彩模型，因为它很容易理解。可以使用带有4个参数的 ``setRGB`` 方法设置 LED ：LED 的索引，红色量，绿色量，蓝色量。红色，绿色和蓝色的量是一个介于 0-255 之间的整数值。

source: Using HSV Values
es_mx: Usando valores HSV
fr_ca: Utilisation des valeurs HSV
tr_tr: HSV Değerlerini Kullanma
zh_cn: 使用 HSV 值

source: HSV stands for Hue, Saturation, and Value. Hue describes the color or tint, saturation being the amount of gray, and value being the brightness. In WPILib, Hue is an integer from 0 - 180. Saturation and Value are integers from 0 - 255. If you look at a color picker like `Google's <https://www.google.com/search?q=color+picker>`_, Hue will be 0 - 360 and Saturation and Value are from 0% to 100%. This is the same way that OpenCV handles HSV colors. Make sure the HSV values entered to WPILib are correct, or the color produced might not be the same as was expected.
es_mx: HSV significa Hue, Saturación y Valor. El tono describe el color o tinte, siendo la saturación la cantidad de gris y el valor es el brillo. En WPILib, Hue es un número entero de 0 a 180. La saturación y el valor son enteros del 0 al 255. Si observa un selector de color como el de Google's <https://www.google.com/search?q=color+picker>`_, el tono será 0 - 360 y la saturación y el valor son del 0% al 100%. Esta es la misma manera que OpenCV maneja los colores HSV. Asegúrese de que los valores de HSV ingresados ​​en WPILib sean correctos, o el color producido podría no ser el mismo que se esperaba.
fr_ca: HSV signifie Hue, Saturation et Value, ou Teinte, Saturation et Valeur. La teinte correspond à la couleur, la saturation étant la quantité de gris et la valeur étant la luminosité. Dans WPILib, Hue est un entier compris entre 0 et 180. Saturation et Value sont des nombres entiers compris entre 0 et 255. Si vous regardez un sélecteur de couleurs comme `celui de Google <https://www.google.com/search?q=color+picker>`_, La teinte sera de 0 à 360 et la saturation et la valeur de 0% à 100%. C'est de la même façon qu'OpenCV gère les couleurs HSV. Assurez-vous que les valeurs HSV saisies dans WPILib sont correctes, sinon la couleur pourrait différer de celle attendue.
tr_tr: HSV, Ton, Doygunluk ve Değer anlamına gelir. Ton, rengi veya tonu, doygunluk gri miktarını ve değeri parlaklık olarak tanımlar. WPILib'de Hue, 0 - 180 arasında bir tam sayıdır. Doygunluk ve Değer, 0 - 255 arası tam sayılardır. `Google'ın <https://www.google.com/search?q=color+picker>`_ gibi bir renk seçiciye bakarsanız, Ton 0 - 360 olacaktır ve Doygunluk ve Değer %0 -%100 arasındadır. Bu, OpenCV'nin HSV renklerini işlediği yolla aynıdır. WPILib'e girilen HSV değerlerinin doğru olduğundan emin olun, aksi takdirde üretilen renk beklendiği gibi aynı olmayabilir.
zh_cn: HSV 中的 H 代表色相，S 代表饱和度，V 代表亮度值。色相描述颜色或色调，饱和度表示灰度，亮度值表示亮度。在 WPILib 中，色相是0到180之间的整数。饱和度和值是0到255之间的整数。如果您使用像 `Google's <https://www.google.com/search?q=color+picker>`_ 的颜色选择器，色相将是0到360，饱和度和值是0％至100％。这与 OpenCV 处理 HSV 颜色的方式相同。确保输入到 WPILib 的 HSV 值正确，否则产生的颜色可能与预期的颜色不同。

source: LEDs can be set with the ``setHSV`` method that takes 4 arguments: index of the LED, hue, saturation, and value. An example is shown below for setting the color of an LED strip to red (hue of 0).
es_mx: Los LED se pueden configurar con el método setHSV que toma 4 argumentos: índice del LED, tono, saturación y valor. A continuación, se muestra un ejemplo para configurar el color de una tira de LED en rojo (matiz de 0).
fr_ca: Les LED peuvent être réglées avec la méthode ``setHSV`` qui prend 4 arguments: index de la LED, Hue, Saturation et Value. Un exemple est illustré ci-dessous pour définir la couleur d'une bande LED sur rouge (teinte de 0).
tr_tr: LED'ler, 4 bağımsız değişken alan ``setHSV`` yöntemiyle ayarlanabilir: LED'in dizini, renk tonu, doygunluk ve değer. Bir LED şeridin rengini kırmızıya (0 tonu) ayarlamak için aşağıda bir örnek gösterilmiştir.
zh_cn: 可以使用带有4个参数的方法 ``setHSV`` 设置LED：LED的索引，色相，饱和度和亮度值。下面展示了将LED灯条的颜色设置为红色 (色相为0) 的示例。

source: Creating a Rainbow Effect
es_mx: Crea un efecto arcoíris
fr_ca: Création d'un effet arc-en-ciel
tr_tr: Gökkuşağı Etkisi Yaratmak
zh_cn: 创建彩虹效果

source: The below method does a couple of important things. Inside of the *for* loop, it equally distributes the hue over the entire length of the strand and stores the individual LED hue to a variable called ``hue``. Then the for loop sets the HSV value of that specified pixel using the ``hue`` value.
es_mx: El siguiente método hace un par de cosas importantes. Dentro del bucle *for*, distribuye equitativamente el tono en toda la longitud del hilo y almacena el tono LED individual en un variable llamada ``tonalidad``. Luego, el bucle for establece el valor HSV de ese píxel especificado utilizando el tono valor.
fr_ca: La méthode ci-dessous fait plusieurs opérations. À l'intérieur de la boucle *for*, la teinte (ou Hue) est distribuée de façon uniforme sur la bande de LED et stocke la teinte individuelle des LED dans une variable appelée ``hue``. Ensuite, la boucle *for* définit la valeur HSV de ce pixel spécifié en utilisant la valeur ``hue``.
tr_tr: Aşağıdaki yöntem birkaç önemli şey yapar. *For* döngüsünün içinde, tonu telin tüm uzunluğu boyunca eşit olarak dağıtır ve ayrı LED tonunu ``hue`` adı verilen bir değişkene kaydeder. Daha sonra for döngüsü, ``hue`` değerini kullanarak belirtilen pikselin HSV değerini ayarlar.
zh_cn: 下面的方法可以做到一些重要的功能。在 *for* 循环内部，它将色相均匀地分布在整个灯带的长度上，并将各个 LED 色相存储到名为的变量 ``hue`` 中。然后 for 循环使用该 ``hue`` 值设置该指定像素的 HSV 值。

source: Moving outside of the for loop, the ``m_rainbowFirstPixelHue`` then iterates the pixel that contains the "initial" hue creating the rainbow effect. ``m_rainbowFirstPixelHue`` then checks to make sure that the hue is inside the hue boundaries of 180. This is because HSV hue is a value from 0-180.
es_mx: Moviéndose fuera del bucle for, ``m_rainbowFirstPixelHue`` luego itera el píxel que contiene el tono "inicial" que crea el efecto arcoíris. ``m_rainbowFirstPixelHue`` luego verifica para asegurarse de que el tono está dentro de los límites de tono de 180. Esto se debe a que el tono HSV es un valor de 0-180.
fr_ca: À l'extérieur de la boucle *for*, le ``m_rainbowFirstPixelHue`` itère ensuite le pixel qui contient la teinte "initiale" créant l'effet arc-en-ciel. ``m_rainbowFirstPixelHue`` vérifie ensuite pour s'assurer que la teinte est à l'intérieur des limites de teinte de 180. En effet, la teinte HSV est une valeur de 0 à 180.
tr_tr: For döngüsünün dışına çıkan ``m_rainbowFirstPixelHue``, daha sonra gökkuşağı efektini oluşturan "initial" renk tonunu içeren pikseli yineler. ``m_rainbowFirstPixelHue`` daha sonra tonun 180 ton sınırları içinde olup olmadığını kontrol eder. Bunun nedeni HSV tonunun 0-180 arası bir değer olmasıdır.
zh_cn: 循环之外，``m_rainbowFirstPixelHue`` 迭代包含 “初始” 色调的像素，从而创建彩虹效果。然后 ``m_rainbowFirstPixelHue`` 检查色相是否位于0-180范围内。这是因为HSV色相的值介于0至180之间。

source: It's good robot practice to keep the ``robotPeriodic()`` method as clean as possible, so we'll create a method for handling setting our LED data. We'll call this method ``rainbow()`` and call it from ``robotPeriodic()``.
es_mx: Es una buena práctica de robots mantener el método ``robotPeriodic()`` lo más limpio posible, así que crearemos un método para manejar la configuración de nuestros datos LED. Llamaremos a este método ``rainbow()`` y llamarlo desde ``robotPeriodic()``.
fr_ca: C'est une bonne pratique de programmation de garder la méthode ``robotPeriodic()`` aussi claire et concise que possible, nous allons donc créer une méthode pour gérer la configuration de nos données LED. Nous appellerons cette méthode ``rainbow()`` et l'appellerons de ``robotPeriodic()``.
tr_tr: ``robotPeriodic()`` yöntemini olabildiğince temiz tutmak iyi bir robot uygulamasıdır, bu nedenle LED verilerimizi ayarlamak için bir yöntem oluşturacağız. Bu yönteme ``rainbow()``diyeceğiz ve onu ``robotPeriodic()`` den çağıracağız.
zh_cn: 最好让机器人的 ``robotPeriodic()`` 方法尽可能简洁，因此，我们将创建了一种可以设定 LED 参数的方法。此方法名为 ``rainbow()`` ，需要从 ``robotPeriodic()`` 中调用它。

source: Now that we have our ``rainbow`` method created, we have to actually call the method and set the data of the LED.
es_mx: Ahora que hemos creado nuestro método de arco iris, tenemos que llamar al método y establecer los datos del LED.
fr_ca: Maintenant que nous avons créé notre méthode rainbow(), nous devons l'appeler et définir les données qui iront à la bande de LED.
tr_tr: Artık ``rainbow`` yöntemimizi oluşturduğumuza göre, aslında yöntemi çağırmalı ve LED'in verilerini ayarlamalıyız.
zh_cn: 现在我们已经创建了我们的 ``rainbow()`` 方法，我们需要真正调用此方法并为 LED 设定参数。

source: Color can be set to an individual led on the strip using two methods.``setRGB`` which takes RGB values as an input and ``setHSV()`` which takes HSV values as an input.
fr_ca: La couleur peut être réglée sur la bande en utilisant deux méthodes: ``setRGB`` qui prend les valeurs RGB (Rouge, Vert et Bleu) comme entrée et ``setHSV()`` qui prend les valeurs HSV (Hue, Saturation et Value) comme entrée.
