Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/actuators/overview.po
Languages: tr_tr, zh_cn

source: Actuator Overview
tr_tr: Aktüatöre Genel Bakış
zh_cn: 执行器概述

source: This section discusses the control of motors and pneumatics through motor controllers, solenoids and pneumatics, and their interface with C++ and Java WPILib.
tr_tr: Bu bölümde motor kontrolörleri, solenoidler ve pnömatikler aracılığıyla motorların ve pnömatiklerin kontrolünü ve bunların C ++ ve Java WPILib ile arayüzlerini anlatılmaktadır.
zh_cn: 本节讨论通过速度控制器，电磁阀和气缸控制电机和气动装置，以及它们在 C++ 和 Java WPILib 中的接口。

source: Motor Controllers
tr_tr: Motor Kontrolörleri
zh_cn: 电机控制器

source: A motor controller is responsible on your robot for making motors move. For brushed DC motors such as CIMs or 775s, the motor controller regulates the voltage that the motor receives, much like a light bulb. For brushless motor controllers such as the Spark MAX, the controller regulates the power delivered to each "phase" of the motor.
tr_tr: Robotunuzdan motorları hareket ettirmek için bir motor kontrolörü sorumludur. CIM'ler veya 775'ler gibi fırçalanmış DC motorlar için motor kontrolörü, tıpkı bir ampul gibi motorun aldığı voltajı düzenler. Spark MAX gibi fırçasız motor denetleyicileri için denetleyici, motorun her "phase-fazına" iletilen gücü düzenler.
zh_cn: 速度控制器负责驱动机器人的电机。对于 CIM 和 775 等有刷直流电机，速度控制器调节电机的接收的电压，就像灯泡一样。对于 Spark MAX 等无刷电机，控制器调节电机各个相位的功率。

source: Another name for a motor controller is a speed controller.
tr_tr: Bir motor kontrolörü için başka bir isim, hız kontrol cihazıdır.
zh_cn: 电机控制器也被叫做速度控制器

source: One can make a quick, non-competition-legal motor controller by removing the motor from a cordless BRUSHED drill and attaching PowerPoles or equivalents to the motor's leads. Make sure that the voltage supplied by the drill will not damage the motor, but note that the 775 is fine at up to 24 volts.
tr_tr: Motoru kablosuz FIRÇALI bir matkaptan çıkararak ve motorun uçlarına PowerPoles veya eşdeğerlerini takarak hızlı, rekabete aykırı bir motor kontrolörü yapılabilir. Matkap tarafından sağlanan voltajın motora zarar vermeyeceğinden emin olun, ancak 775'in 24 volta kadar iyi durumda olduğunu unutmayın.
zh_cn: 我们可以手工制作一个速度快但不合法的电机控制器：将电机从一个无线有刷钻取下，之后将 PowerPole 或类似产品连接到电机的引线头。确保由电钻提供的电压不会损坏电机，但注意，775 可以承受最高24伏电压。

source: Connecting a BRUSHLESS motor controller straight to power, such as to a conventional brushed motor controller, will destroy the motor!
tr_tr: FIRÇASIZ bir motor kontrol cihazını, geleneksel bir fırçalı motor sürücü gibi doğrudan güce bağlamak, motora zarar verir!
zh_cn: 若无刷电机控制器如传统的有刷电机控制器一样被直接连接到电源，电机将完全损坏！

source: FRC Legal Motor Controllers
tr_tr: FRC Yasal Motor Sürücüler
zh_cn: FRC 允许使用的电机控制器

source: Motor controllers come in lots of shapes, sizes and feature sets. This is the full list of FRC\ |reg| Legal motor controllers as of January 2020:
tr_tr: Motor kontrolörleri birçok şekil, boyut ve özellik setine sahiptir. Bu, FRC \ | reg | 'in tam listesidir. Ocak 2020 itibariyle yasal motor kontrolörleri:
zh_cn: 电机控制器具有多种形状，尺寸和功能。以下是截至2020年1月的 FRC 合法电机控制器的完整列表：

source: DMC 60/DMC 60c Motor Controller (P/N: 410-334-1, 410-334-2)
tr_tr: DMC 60/DMC 60c Motor Sürücü (P/N: 410-334-1, 410-334-2)
zh_cn: DMC 60/DMC 60c 电机控制器 (P/N: 410-334-1, 410-334-2)

source: Jaguar Motor Controller (P/N: MDL-BDC, MDL-BDC24, and 217-3367) connected to PWM only
tr_tr: Yalnızca PWM'ye bağlı Jaguar Motor Sürücü (P/N: MDL-BDC, MDL-BDC24 ve 217-3367)
zh_cn: Jaguar 电机控制器 (P/N: MDL-BDC, MDL-BDC24, and 217-3367) 仅可连接PWM

source: Nidec Dynamo BLDC Motor with Controller to control integral actuator only (P/N 840205-000, am-3740)
tr_tr: Yalnızca entegre aktüatörü kontrol etmek için sürücülü Nidec Dynamo BLDC Motor (P/N 840205-000, am-3740)
zh_cn: 带控制器的 Nidec Dynamo BLDC 电机 (P/N 840205-000, am-3740) 仅控制一体式执行器

source: SD540 Motor Controller (P/N: SD540x1, SD540x2, SD540x4, SD540Bx1, SD540Bx2, SD540Bx4, SD540C)
tr_tr: SD540 Motor Sürücü (P/N: SD540x1, SD540x2, SD540x4, SD540Bx1, SD540Bx2, SD540Bx4, SD540C)
zh_cn: SD540 电机控制器 (P/N: SD540x1, SD540x2, SD540x4, SD540Bx1, SD540Bx2, SD540Bx4, SD540C)

source: Spark Motor Controller (P/N: REV-11-1200)
tr_tr: Spark Motor Sürücü (P/N: REV-11-1200)
zh_cn: Spark 电机控制器 (P/N: REV-11-1200)

source: Spark MAX Motor Controller (P/N: REV-11-2158)
tr_tr: Spark MAX Motor Sürücü (P/N: REV-11-2158)
zh_cn: Spark MAX 电机控制器 (P/N: REV-11-2158)

source: Talon FX Motor Controller (P/N: 217-6515, 19-708850, am-6515, am-6515_Short) for controlling integral Falcon 500 only
tr_tr: Talon FX Motor Sürücü (P/N: 217-6515, 19-708850, am-6515, am-6515_Short) dahili Falcon 500 kontrolü için
zh_cn: Talon FX 电机控制器 (P/N: 217-6515, 19-708850, am-6515, am-6515_Short) 仅用于控制一体式 Falcon 500

source: Talon Motor Controller (P/N: CTRE_Talon, CTRE_Talon_SR, and am-2195)
tr_tr: Talon Motor Sürücü (P/N: CTRE_Talon, CTRE_Talon_SR, and am-2195)
zh_cn: Talon 电机控制器 (P/N: CTRE_Talon, CTRE_Talon_SR, and am-2195)

source: Talon SRX Motor Controller (P/N: 217-8080, am-2854, 14-838288)
tr_tr: Talon SRX Motor Sürücü (P/N: 217-8080, am-2854, 14-838288)
zh_cn: Talon SRX 电机控制器 (P/N: 217-8080, am-2854, 14-838288)

source: Victor 884 Motor Controller (P/N: VICTOR-884-12/12)
tr_tr: Victor 884 Motor Sürücü (P/N: VICTOR-884-12/12)
zh_cn: Victor 884 电机控制器 (P/N: VICTOR-884-12/12)

source: Victor 888 Motor Controller (P/N: 217-2769)
tr_tr: Victor 888 Motor Sürücü (P/N: 217-2769)
zh_cn: Victor 888 电机控制器 (P/N: 217-2769)

source: Victor SP Motor Controller (P/N: 217-9090, am-2855, 14-868380)
tr_tr: Victor SP Motor Sürücü (P/N: 217-9090, am-2855, 14-868380)
zh_cn: Victor SP 电机控制器 (P/N: 217-9090, am-2855, 14-868380)

source: Victor SPX Motor Controller (P/N: 217-9191, 17-868388, am-3748)
tr_tr: Victor SPX Motor Sürücü (P/N: 217-9191, 17-868388, am-3748)
zh_cn: Victor SPX 电机控制器 (P/N: 217-9191, 17-868388, am-3748)

source: Venom Motor with Controller (P/N BDC-10001) for controlling integral motor only​
tr_tr: Motor Sürücülü Venom Motor (P / N BDC-10001) sadece entegre motoru kontrol etmek için
zh_cn: 带控制器的 Venom 电机 (P/N BDC-10001) 仅用于控制一体式电机

source: Pneumatics
tr_tr: Pnömatik
zh_cn: 气动装置

source: Pneumatics are a quick and easy way to make something that's in one state or another using compressed air. For information on operating pneumatics, see :doc:`pneumatics`.
tr_tr: Pnömatik, basınçlı hava kullanarak bir şeyi yapmanın hızlı ve kolay bir yoludur. Pnömatik çalıştırma hakkında bilgi için, :doc:`pneumatics` dosyasına bakınız.
zh_cn: 气动装置可利用压缩空气使装置快速简便地在两种状态中切换。有关操作气动装置的信息，请参阅《操作气缸》章节。

source: FRC Legal Pneumatics controllers
tr_tr: FRC Yasal Pnömatik kontrolörleri
zh_cn: FRC 允许使用的气动控制器

source: Pneumatics Control Module (P/N: am-2858, 217-4243)
zh_cn: 气动控制模块 (P/N: am-2858, 217-4243)

source: Relays
tr_tr: Röleler
zh_cn: 继电器

source: A relay controls power to a motor or custom electronics in an On/Off fashion.
tr_tr: Bir röle, bir motora veya özel elektroniğe giden gücü Açık / Kapalı şeklinde kontrol eder.
zh_cn: 继电器控制电动机的电源或以开/关的形式设定电子设备。

source: FRC Legal Relay Modules
tr_tr: FRC Yasal Röle Modülleri
zh_cn: FRC 合规继电器模块

source: Spike H-Bridge Relay (P/N: 217-0220 and SPIKE-RELAY-H)
tr_tr: Spike H-Bridge Röle (P/N: 217-0220 and SPIKE-RELAY-H)
zh_cn: Spike H-Bridge 继电器 (P/N: 217-0220 and SPIKE-RELAY-H)

source: Automation Direct Relay (P/N: AD-SSR6M12-DC200D, AD-SSR6M25-DC200D, AD-SSR6M40-DC200D)
tr_tr: Automation Direct Röle (P/N: AD-SSR6M12-DC200D, AD-SSR6M25-DC200D, AD-SSR6M40-DC200D)
zh_cn: Automation Direct 继电器 (P/N: AD-SSR6M12-DC200D, AD-SSR6M25-DC200D, AD-SSR6M40-DC200D)
