Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/actuators/pneumatics.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Operating pneumatic cylinders
es_mx: Operación de los cilindros neumáticos
fr_ca: Utilisation des vérins pneumatiques
tr_tr: Pnömatik silindirlerin çalıştırılması
zh_cn: 使用气缸

source: Using the FRC Control System to control Pneumatics
es_mx: Usando el control del sistema FRC para controlar neumáticos
fr_ca: Utilisation du système de contrôle FRC pour contrôler la pneumatique
tr_tr: Pnömatiği kontrol etmek için FRC Kontrol Sistemini kullanma
zh_cn: 使用 FRC 控制系统控制气动装置

source: The Pneumatics Control Module (PCM) is a CAN-based device that provides complete control over the compressor and up to 8 solenoids per module. The PCM is integrated into WPILib through a series of classes that make it simple to use. The closed loop control of the Compressor and Pressure switch is handled by the PCM hardware and the Solenoids are handled by the upgraded Solenoid class that now controls the solenoid channels on the PCM. An additional PCM module can be used where the modules corresponding solenoids are differentiated by the module number in the constructors of the Solenoid and Compressor classes.
es_mx: El módulo de control de neumáticos (Pneumatics Control Module, PCM) es un dispositivo basado en CAN que proporciona un completo control sobre el compresor y hasta 8 solenoides por módulo. El PCM está integrada con la WPILib que lanza de una serie de pasos que facilitan su uso. El control de bucle cerrado de el compresor y el interruptor de presión son manejados por el hardware PCM y los solenoides son manejados por la clase de solenoide mejorada que ahora controla los canales de solenoide en el PCM. Se puede usar un módulo PCM adicional donde los solenoides correspondientes de los módulos se diferencian por el número de módulo en los constructores del solenoide y las clases de compresor
fr_ca: Le module de commande pneumatique (PCM) est un dispositif CAN qui fournit un contrôle complet sur le compresseur et supporte jusqu'à 8 solénoïdes par module. Le PCM est intégré à WPILib via une série de classes qui le rendent simple à utiliser. Le contrôle en boucle fermée du compresseur et de son pressostat (interrupteur activé lorsque la pression atteint un certain niveau) est géré par le circuit électronique du PCM et les solénoïdes sont gérés par la classe Solenoid (nouvelle version) qui contrôle désormais les canaux du solénoïde sur le PCM. Un module PCM supplémentaire peut être rajouté, il faut alors que les modules solénoïdes correspondants soient différenciés par l'entremise du numéro de module dans les constructeurs des classes Solénoïde et Compresseur.
tr_tr: Pnömatik Kontrol Modülü (PCM), kompresör ve modül başına 8 adede kadar solenoid üzerinde tam kontrol sağlayan CAN tabanlı bir cihazdır. PCM, kullanımını kolaylaştıran bir dizi class aracılığıyla WPILib'e entegre edilmiştir. Kompresör ve Basınç anahtarının kapalı döngü kontrolü PCM donanımı tarafından gerçekleştirilir ve Solenoidler, artık PCM'deki solenoid kanallarını kontrol eden yükseltilmiş Solenoid sınıfı tarafından yönetilir. Solenoidlere karşılık gelen modüllerin Solenoid ve Kompresör sınıflarının üreticilerindeki modül numarasıyla farklılaştığı durumlarda ek bir PCM modülü kullanılabilir.
zh_cn: 气动控制模块 (PCM) 是基于 CAN 的设备，可对空气压缩机进行完全控制，每个模块最多可控制8个电磁阀。PCM 通过一系列易于使用的类被集成到 WPILib 中。 空气压缩机和压力开关的闭环控制由 PCM 硬件处理，电磁阀由已升级的 Solenoid 类处理，该类现在控制 PCM 上的电磁阀通道。可以使用额外的 PCM 模块，在 Solenoid 和 Compressor 类的构造函数中，对应的电磁阀模块通过模块编号来区分。

source: The Pneumatics Control Module from CTR Electronics is responsible for regulating the robot's pressure using a pressure switch and a compressor and switching solenoids on and off. The PCM communicates with the roboRIO over CAN. For more information, see `FRC Control System Hardware Overview`
es_mx: El módulo de control neumático de CTR Electrónicos es responsable de regular la presión del robot usando un interruptor de presión y un compresor activando y desactivando los solenoides. El PCM se comunica con el roboRIO a través de CAN. Para obtener más información, consulte `FRC Control System Hardware Overview`
fr_ca: Le module de commande pneumatique de CTR Electronics est chargé de réguler la pression du robot à l'aide d'un pressostat et d'un compresseur et de mettre en marche et d'arrêter les solénoïdes. Le PCM communique avec le roboRIO via le bus CAN. Pour plus d'informations, voir «Présentation du matériel du système de contrôle FRC»
tr_tr: CTR Electronics'in Pneumatics Control Module, bir basınç anahtarı ve bir kompresör kullanarak robotun basıncını düzenlemekten ve solenoidleri açıp kapatmaktan sorumludur. PCM, CAN üzerinden roboRIO ile iletişim kurar. Daha fazla bilgi için, bkz. `FRC Control System Hardware Overview`
zh_cn: CTR Electronics 的气动控制模块使用压力开关和压缩机以及打开和关闭电磁阀来调节机器的气压。PCM 通过 CAN 与 roboRIO 通信。有关更多信息，参见 FRC 控制系统硬件概述。

source: PCM Module Numbers
es_mx: Números de módulo PCM
fr_ca: Numéros de module PCM
tr_tr: PCM Modül Numaraları
zh_cn: PCM 模块编号

source: PCM Modules are identified by their Node ID. The default Node ID for PCMs is 0. If using a single PCM on the bus it is recommended to leave it at the default Node ID.
es_mx: Los módulos PCM se identifican por su ID de nodo. La ID de nodo predeterminada para PCM es 0. Si usa un PCM único en el puerto se recomienda dejarlo en la ID de nodo predeterminada.
fr_ca: Les modules PCM sont identifiés par leur numéro ID de nœud. L'ID de nœud par défaut pour les PCM est 0. Si vous utilisez un seul PCM sur le bus, il est recommandé de le laisser à l'ID de nœud par défaut (valeur 0).
tr_tr: PCM Modülleri, Node ID-Bağlantı Kimlikleri ile tanımlanır. PCM'ler için varsayılan Node ID 0'dır. Veri yolunda tek bir PCM kullanıyorsanız, bunu varsayılan Düğüm Kimliğinde bırakmanız önerilir.
zh_cn: PCM 模块由其节点 ID 标识。PCM 的默认节点 ID 为 0。如果在总线上使用单个 PCM，建议保留其默认节点 ID 。

source: Generating and Storing Pressure
es_mx: Generando y almacenando presión
fr_ca: Génération et stockage de la pression
tr_tr: Basınç Oluşturma ve Saklama
zh_cn: 产生和存储气压

source: In FRC\ |reg|, pressure is created using a pneumatic compressor and stored in pneumatic tanks. The compressor doesn't necessarily have to be on the robot, but must be powered by the robot's PCM(s). The "Closed Loop" mode on the Compressor is enabled by default, and it is *not* recommended that teams change this setting. When closed loop control is enabled the PCM will automatically turn the compressor on when the pressure switch is closed (below the pressure threshold) and turn it off when the pressure switch is open (~120PSI). When closed loop control is disabled the compressor will not be turned on. Using a Compressor, users can query the status of the compressor. The state (currently on or off), pressure switch state, and compressor current can all be queried from the Compressor object.
es_mx: En FRC\ |reg|, la presión se crea utilizando un compresor neumático y se almacena en tanques neumáticos. El compresor no necesariamente tiene que estar en el robot, sino que debe estar alimentado por el/los PCM(s) del robot. El modo "Closed Loop" en el compresor está habilitado de forma predeterminada, y no es recomendado que los equipos cambien esta configuración. Cuando el control de bucle cerrado está habilitado, el PCM podrá encender automáticamente el compresor cuando el interruptor de presión esté cerrado (debajo del límite de presión) y apagarse cuando el interruptor de presión esté abierto (~120PSI). Cuando el control de bucle esté cerrado se deshabilita el compresor y no se encenderá. Usando un compresor, los usuarios pueden consultar el estado del compresor. El estado (actualmente encendido o apagado), estado del interruptor de presión y la corriente del compresor se puede consultar desde el objeto Compresor.
fr_ca: En FRC\ |reg|, la pression est créée à l’aide d’un compresseur pneumatique et stockée dans des réservoirs pneumatiques. Le compresseur n’a pas nécessairement besoin d’être sur le robot, mais doit être alimenté par le.s modules PCM du robot. Le mode "boucle fermée" sur le compresseur est activé par défaut, et il n'est *pas* recommandé que les équipes modifient cette configuration. Lorsque le contrôle en boucle fermée est activé, le PCM allume automatiquement le compresseur lorsque l’interrupteur de pression est fermé (en dessous du seuil de pression) et l’éteint lorsque l’interrupteur de pression est ouvert (~120PSI). Lorsque le contrôle de la boucle fermée est désactivé, le compresseur ne sera pas allumé. À l’aide d'un objet Compressor, les utilisateurs peuvent vérifier l’état du compresseur. L’état (actuellement allumé ou éteint), l’état de l’interrupteur de pression et le courant du compresseur peuvent tous être accessibles à partir de l’objet Compressor.
tr_tr: FRC \ |reg| 'te, basınç pnömatik kompresör kullanılarak oluşturulur ve pnömatik tanklarda depolanır. Kompresörün mutlaka robot üzerinde olması gerekmez, ancak robotun PCM (ler) i tarafından çalıştırılmalıdır. Kompresördeki "Closed Loop-Kapalı Döngü" modu varsayılan olarak etkindir ve ekiplerin bu ayarı değiştirmesi *not-önerilmez*. Kapalı döngü kontrolü etkinleştirildiğinde, PCM, basınç anahtarı kapatıldığında (basınç eşiğinin altında) kompresörü otomatik olarak açar ve basınç anahtarı açıkken (~ 120PSI) kapatır. Kapalı döngü kontrolü devre dışı bırakıldığında, kompresör açılmayacaktır. Kullanıcılar bir Kompresör kullanarak kompresörün durumunu sorgulayabilir. Durum (şu anda açık veya kapalı), basınç anahtarı durumu ve kompresör akımının tümü Kompresör nesnesinden sorgulanabilir.
zh_cn: 在 FRC\ |reg| 中，压缩气体需使用压缩机产生，并存储在气罐中。压缩机不一定必须在机器上，但必须由机器的 PCM(s) 供电。默认情况下压缩机的"闭环"模式是开启的，我们不建议队伍修改此设置。当启用闭环控制时，PCM 将在压力开关关闭 (低于压力阈值时) 自动打开压缩机，并在压力开关打开(~120PSI) 时关闭压缩机。禁用闭环控制时，压缩机将不会开启。通过使用 Compressor 对象，用户可以查询压缩器的状态。可以从 Compressor 对象查询压缩机状态 (当前为开或关) 、压力开关状态和压缩机电流。

source: The Pneumatics Control Module from Cross the Road Electronics allows for integrated closed loop control of a compressor. Creating any instance of a Solenoid or Double Solenoid object will enable the Compressor control on the corresponding PCM. The Compressor object is only needed if you want the ability to turn off the compressor or query compressor status.
es_mx: El módulo de control neumático de Cross the Road Electronics permite la integración del control de circuito cerrado de un compresor. Crear cualquier instancia de un solenoide o solenoide doble. El objeto habilitará el control del compresor en el PCM correspondiente. El objeto compresor solo es necesario si desea la opción de apagar el compresor o consultar el estado del compresor.
fr_ca: Le module de contrôle pneumatique de CTR Electronics permet un contrôle intégré en boucle fermée d'un compresseur. La création d'une instance d'un objet solénoïde ou double solénoïde active le contrôle du compresseur sur le PCM correspondant. L'objet Compressor n'est nécessaire que si vous souhaitez vouloir désactiver le compresseur ou interroger l'état du compresseur.
tr_tr: Cross the Road Electronics'in Pneumatics Control Modulü, bir kompresörün entegre kapalı döngü kontrolüne izin verir. Solenoid veya Double Solenoid nesnesinin herhangi bir örneğini oluşturmak, karşılık gelen PCM'de Kompresör kontrolünü etkinleştirecektir. Compressor objesi yalnızca, kompresörü kapatma veya kompresör durumunu sorgulama yeteneğini istiyorsanız gereklidir.
zh_cn: CTRE 的气动模组允许对整体的闭环控制。创建任何一个单电磁阀或者多电磁阀的实例时都会使得压缩器对 PCM 进行反应。只有当需要关掉压缩器或者查询其状态时才需要调用压缩器。

source: Solenoid control
es_mx: Control del solenoide
fr_ca: Contrôle solénoïde
tr_tr: Solenoid kontrolü
zh_cn: 电磁阀控制

source: FRC teams use solenoids to preform a variety of tasks, from shifting gearboxes to operating robot mechanisms. A solenoid is a valve used to electronically switch a pressurized air line "on" or "off". For more information on solenoids, see `this wikipedia article <https://en.wikipedia.org/wiki/Solenoid_valve>`__. Solenoids are controlled by a robot's Pneumatics Control Module, or PCM, which is in turn connected to the robot's roboRIO via CAN. The easiest way to see a solenoid's state is via the small red LED (which indicates if the valve is "on" or not), and solenoids can be manually actuated when un-powered with the small button adjacent to the LED.
es_mx: Los equipos de FRC usan solenoides para realizar una variedad de tareas, desde cambiar las cajas de cambios hasta operar Mecanismos del robot. Un solenoide es una válvula que se usa para cambiar electrónicamente una línea de aire presurizado "encendido o apagado". Para obtener más información sobre solenoides, consulte este artículo de Wikipedia <https://en.wikipedia.org/wiki/Solenoid_valve>`__ . Los solenoides son controlados por el Módulo de control neumático de un robot, o PCM, que a su vez está conectado al roboRIO del robot a través del CAN. La forma más fácil de ver el estado de un solenoide es a través del pequeño LED rojo (que indica si la válvula está "encendida" o no), y los solenoides pueden activarse manualmente cuando sin energía con el pequeño botón adyacente al LED.
fr_ca: Les équipes FRC utilisent des solénoïdes pour effectuer une variété de tâches, allant du changement de boîte de vitesses à l'utilisation de mécanismes de robot. Un solénoïde est une vanne utilisée pour "activer" ou "désactivé" électroniquement une conduite d'air sous pression. Pour plus d'informations sur les solénoïdes, voir `cet article wikipedia <https://en.wikipedia.org/wiki/Solenoid_valve>`__. Les solénoïdes sont contrôlés par le module de commande pneumatique d'un robot, ou PCM, qui est à son tour connecté au roboRIO du robot via CAN. La façon la plus simple de voir l'état d'un solénoïde est via la petite LED rouge (qui indique si la vanne est "allumée" ou non), et les solénoïdes peuvent être actionnés manuellement lorsqu'ils ne sont pas alimentés avec le petit bouton adjacent à la LED.
tr_tr: FRC takımları, vites değiştirmeden robot mekanizmalarının çalıştırılmasına kadar çeşitli görevleri gerçekleştirmek için solenoidleri kullanır. Solenoid, basınçlı bir hava hattını elektronik olarak "açmak-on" veya "kapatmak-off" için kullanılan bir valftir. Solenoidler hakkında daha fazla bilgi için, şu `wikipedia makalesine bakın <https://en.wikipedia.org/wiki/Solenoid_valve>`__. Solenoidler, robotun roboRIO'suna CAN aracılığıyla bağlanan bir robotun Pneumatics Control Module veya PCM tarafından kontrol edilir. Bir solenoidin durumunu görmenin en kolay yolu, küçük kırmızı LED'dir (bu, valfin "açık" olup olmadığını gösterir) ve solenoidler, LED'in yanındaki küçük düğme ile güç kesildiğinde manuel olarak çalıştırılabilir.
zh_cn: 从变速箱换挡到操作机器人机构，FRC 队伍使用电磁阀执行各种各样的任务。电磁阀是一种将加压空气管路“打开”或“关闭”的电动阀门。有关电磁阀的更多信息，请参阅 '这篇维基百科文章< https://en.wikipedia.org/wiki/Solenoid_valve > ' __。电磁阀由机器人的气动控制模块 (PCM) 控制，后者又通过 CAN 连接到机器人的 roboRIO。 查看电磁阀状态最简单的方法是通过其上的红色 LED 指示灯 (指示阀门是否打开)。电磁阀在不通电时可以用LED灯旁的按钮来手动启动。

source: Single acting solenoids apply or vent pressure from a single output port. They are typically used either when an external force will provide the return action of the cylinder (spring, gravity, separate mechanism) or in pairs to act as a double solenoid. A double solenoid switches air flow between two output ports (many also have a center position where neither output is vented or connected to the input). Double solenoid valves are commonly used when you wish to control both the extend and retract actions of a cylinder using air pressure. Double solenoid valves have two electrical inputs which connect back to two separate channels on the solenoid breakout.
es_mx: Los solenoides de acción simple aplican o descargan la presión de un solo puerto de salida. Son típicamente utilizados cuando una fuerza externa proporcionará la acción de retorno del cilindro (resorte, gravedad, mecanismo separado) o en pares para actuar como un doble solenoide. El doble solenoide intercambia el flujo de aire entre dos puertos de salida (muchos también tienen una posición central donde ninguna salida está ventilada o conectada a la entrada). Las válvulas solenoides doble se usan comúnmente cuando desea controlar las acciones de extensión y retracción de un cilindro utilizando presión de aire. Las válvulas de solenoides doble tienen dos entradas eléctricas que se conectan a dos canales separados en La ruptura del solenoide.
fr_ca: Les solénoïdes à simple effet appliquent ou purgent la pression à partir d'un seul orifice de sortie. Ils sont généralement utilisés soit lorsqu'une force externe fournira l'action de retour du cylindre (ressort, gravité, mécanisme séparé) ou lorsque utilisés en paires pour agir comme un double solénoïde. Un double solénoïde commute le flux d'air entre deux ports de sortie (beaucoup ont également une position centrale où aucune sortie n'est ventilée ou connectée à l'entrée). Les doubles solénoïdes sont couramment utilisées lorsque vous souhaitez contrôler les actions d'extension et de rétraction d'un vérin à l'aide de la pression d'air. Les doubles solénoïdes ont deux entrées électriques qui se connectent à deux canaux séparés sur le PCM.
tr_tr: Tek etkili solenoidler, tek bir çıkış portundan basınç uygular veya tahliye eder. Tipik olarak, bir dış kuvvetin silindirin geri dönüş hareketini sağlaması durumunda (yay, yerçekimi, ayrı mekanizma) veya çiftler halinde bir double solenoid olarak hareket etmek için kullanılırlar. Double solenoid, iki çıkış portu arasındaki hava akışını değiştirir (çoğu aynı zamanda, iki çıkışında havalandırılmadığı veya girişe bağlı olmadığı bir merkez konuma sahiptir). Double solenoid valfler, hava basıncını kullanarak bir silindirin hem uzatma hem de geri çekme hareketlerini kontrol etmek istediğinizde yaygın olarak kullanılır. Double solenoid valfler, solenoid devresi üzerindeki iki ayrı kanala bağlanan iki elektrik girişine sahiptir.
zh_cn: 单控电磁阀从单个输出口施加或排出压力。它们通常在有外力使气缸 (如弹簧，自身重力，独立机构) 回复时使用，或者成对使用以充当双控电磁阀。双电磁阀可在两个输出口之间切换气流（许多电磁阀还有中心位置状态，既不输出排气也不与输入端连接）。当你需要通过气压控制气缸的伸出和缩回动作时，通常使用双电磁阀。双控电磁阀有两个电力输入，它们分别连接到电磁阀上两个独立的通道。

source: PCM Modules are identified by their CAN Device ID. The default CAN ID for PCMs is 0. If using a single PCM on the bus it is recommended to leave it at the default CAN ID. This ID can be changed with the Phoenix Tuner application, in addition to other debug information. Instructions to download Phoenix Tuner can be found `here <https://github.com/CrossTheRoadElec/Phoenix-Releases/blob/master/README.md>`__ and the installer files can be found `here <https://github.com/CrossTheRoadElec/Phoenix-Releases/releases/latest>`__. For more information about setting PCM CAN ID see this important :ref:`notice <docs/zero-to-robot/step-2/index:Step 2: Installing Software>`.
es_mx: Los módulos PCM se identifican por su ID de dispositivo CAN. El ID de CAN predeterminado para PCM es 0. Si utiliza un solo PCM en el bus, se recomienda dejarlo en el ID de CAN predeterminado. Esta ID se puede cambiar con la aplicación Phoenix Tuner, además de información de depuración. Las instrucciones para descargar Phoenix Tuner se pueden encontrar `aquí <https://github.com/CrossTheRoadElec/Phoenix-Releases/blob/master/README.md>`__ y los archivos para instalarse pueden encontrarse `aquí <https://github.com/CrossTheRoadElec/Phoenix-Releases/releases/latest>`__. Para obtener más información sobre cómo configurar el ID de CAN de PCM, consulte esta importante :ref:`nota <docs/zero-to-robot/step-2/index:Step 2: Installing Software>`.
fr_ca: Les modules PCM sont identifiés par leur ID (numéro d'identification dans le réseau CAN) de périphérique CAN. L’ID CAN par défaut pour les PCM est 0. Si vous utilisez un seul PCM dans le bus, il est recommandé de le laisser à l’ID CAN par défaut. Cet ID peut être modifié avec l’application Phoenix Tuner, laquelle vous donne accès à d’autres informations de débogage. Les instructions pour télécharger Phoenix Tuner peuvent être trouvées `ici <https://github.com/CrossTheRoadElec/Phoenix-Releases/blob/master/README.md>`__ et les fichiers d’installation peuvent être trouvés `ici <https://github.com/CrossTheRoadElec/Phoenix-Releases/releases/latest>`__. Pour plus d’informations sur la configuration du PCM CAN ID, consulter cet important :ref:`document <docs/zero-to-robot/step-2/index:Step 2: Installing Software>`.
tr_tr: PCM Modülleri, CAN Cihaz Kimlikleri ile tanımlanır. PCM'ler için varsayılan CAN ID'si 0'dır. Veriyolunda tek bir PCM kullanılıyorsa, bunu varsayılan CAN ID'de bırakmanız önerilir. Bu kimlik, diğer hata ayıklama yazılımlarına ek olarak Phoenix Tuner uygulamasıyla değiştirilebilir. Phoenix Tuner'ı indirme talimatları `buradadır <https://github.com/CrossTheRoadElec/Phoenix-Releases/blob/master/README.md>`__ ve yükleme dosyaları `burada <https://github.com/CrossTheRoadElec/Phoenix-Releases/releases/latest>`__ bulunabilir. PCM CAN Kimliği ayarlama hakkında daha fazla bilgi için şu önemli noktaya bakın :ref:`not<docs/zero-to-robot/step-2/index:Step 2: Installing Software>`.
zh_cn: PCM 模块由其 CAN 设备 ID 标识。PCM 的默认 CAN ID 为 0。如果在总线上使用单个 PCM 口，建议保留其默认 CAN ID。和其他调试信息一样，可以使用 Phoenix Tuner 程序更改此ID。下载 Phoenix Tuner 的说明可以在这里找到' here < https://github.com/CrossTheRoadElec/Phoenix-Releases/blob/master/README.md > ' __，安装文件可以在这里找到 ' here < https://github.com/CrossTheRoadElec/Phoenix-Releases/releases/latest > ' __。有关设置 PCM CAN ID 的更多信息，参见 :ref: ' notice <docs/zero-to-robot/ Step -2/index:Step 2: install Software> '。

source: Single Solenoids in WPILib
es_mx: Solenoides individuales en WPILib
fr_ca: Solénoïdes simples dans WPILib
tr_tr: WPILib'de Tekli Solenoidler
zh_cn: WPILib 中的单电磁阀

source: Single solenoids in WPILib are controlled using the Solenoid class. To construct a Solenoid object, simply pass the desired port number (assumes CAN ID 0) or CAN ID and port number to the constructor. To set the value of the solenoid call set(true) to enable or set(false) to disable the solenoid output.
es_mx: Los solenoides individuales en WPILib se controlan utilizando la clase Solenoide. Para construir un objeto solenoide, simplemente pase el número de puerto deseado (supone CAN ID 0) o CAN ID y número de puerto al constructor. Para establecer el valor del selenoide llame set(true) para habilitar o set(false) para deshabilitar la salida del solenoide.
fr_ca: Les solénoïdes simples dans WPILib sont contrôlés à l'aide de la classe Solenoid. Pour construire un objet Solenoid, il suffit de transmettre le numéro de port souhaité (en supposant CAN ID 0) ou CAN ID et le numéro de port au constructeur. Pour régler la valeur d'un solénoïde, faire set(true) pour activer ou set(false) pour désactiver le solénoïde.
tr_tr: WPILib'deki tekli solenoidler Solenoid sınıfı kullanılarak kontrol edilir. Bir Solenoid nesnesi oluşturmak için, yapıcıya istenen port numarasını (CAN ID 0 varsayılır) veya CAN ID ve port numarasını iletmeniz yeterlidir. Solenoid çağrı setinin değerini (true) etkinleştirmek veya devre dışı bırakmak için (false) ayarlamak için.
zh_cn: WPILib 中，单个电磁阀使用 Solenoid 类进行控制。要构造 Solenoid 对象，只需将其端口号 (若 CAN ID 为 0) 或将 CAN ID 和端口号传递给构造函数。要设置电磁阀的值，请调用 set(true) 启用或 set(false) 禁用电磁阀输出。

source: Double Solenoids in WPILib
es_mx: Solenoides dobles en WPILib
fr_ca: Solénoïdes doubles dans WPILib
tr_tr: WPILib'de Double Solenoidler
zh_cn: WPILib 中的双控电磁阀
