Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/actuators/pneumatics.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Double solenoids are controlled by the DoubleSolenoid class in WPILib. These are constructed similarly to the single solenoid but there are now two port numbers to pass to the constructor, a forward channel (first) and a reverse channel (second). The state of the valve can then be set to kOff (neither output activated), kForward (forward channel enabled) or kReverse (reverse channel enabled). Additionally, the PCM CAN ID can be passed to the DoubleSolenoid if teams have a non-standard PCM CAN ID.
es_mx: Los solenoides dobles están controlados por la clase DoubleSolenoid en WPILib. Estos son construidos de manera similar al solenoide único, pero ahora hay dos números de puerto para pasar al constructor, un canal directo (primero) y un canal inverso (segundo). El estado de la válvula se puede configurar a kOff (ninguna salida activada), kForward (canal de avance habilitado) o kReverse (reversa canal habilitado). Además, la ID CAN de PCM se puede pasar al DoubleSolenoid si los equipos tienen una ID CAN PCM no estándar.
fr_ca: Les solénoïdes doubles sont contrôlés par la classe DoubleSolenoid dans WPILib. Ceux-ci sont construits de manière similaire au solénoïde simple, mais il y a maintenant deux numéros de port à transmettre au constructeur, un canal direct (premier) et un canal inverse (second). L'état de la vanne peut ensuite être réglé sur kOff (aucune sortie activée), kForward (canal direct activé) ou kReverse (canal inverse activé). De plus, l'ID CAN PCM peut être transmis au DoubleSolenoid s'il est différent de la valeur par défaut.
tr_tr: Çift solenoidler, WPILib'de DoubleSolenoid sınıfı tarafından kontrol edilir. Bunlar, tekli solenoide benzer şekilde yapılandırılır, ancak şimdi devreye geçecek iki port numarası vardır, bir ileri kanal (first) ve bir ters kanal (second). Valf durumu daha sonra kOff (hiçbir çıkış etkinleştirilmedi), kForward (ileri kanal etkin) veya kReverse (ters kanal etkin) olarak ayarlanabilir. Ek olarak, ekiplerin standart olmayan bir PCM CAN ID'si varsa PCM CAN ID, DoubleSolenoid'e geçirilebilir.
zh_cn: 双控电磁阀由 WPILib 中的 DoubleSolenoid 类控制。它们的构造类似于单控电磁阀，但是现在有两个端口号可以传递给构造函数，即正向通道 (第一个)和反向通道 (第二个)。然后可以将阀的状态设置为 kOff (均未激活输出)， kForward (启用正向通道) 或 kReverse (启用反向通道)。此外，如果队伍使用非标准的 PCM CAN ID，可以将 PCM CAN ID 传递给 DoubleSolenoid 对象。

source: Toggling Solenoids
es_mx: Alternando Solenoides
fr_ca: Basculement de Solénoïdes
tr_tr: Solenoidlerin Değiştirilmesi
zh_cn: 切换电磁阀

source: Solenoids can be switched from one output to the other (known as toggling) by using the `.toggle()` method.
es_mx: Los solenoides se pueden cambiar de una salida a otra (conocido como alternar) usando el método `.toggle ()`.
tr_tr: Solenoidler, ".toggle ()" metodu kullanılarak bir çıkıştan diğerine (geçiş olarak bilinir) değiştirilebilir.
zh_cn: 电磁阀可以通过 .toggle() 方法切换 (也叫做toggling) 气压输出端

source: Since a DoubleSolenoid defaults to off you will have to set it before it can be toggled.
es_mx: Dado que un Doble Solenoide está desactivado de forma predeterminada, tendrá que configurarlo antes de poder alternarlo.
fr_ca: Étant donné qu’un DoubleSolenoid (double électrovanne) est par défaut désactivé vous devrez le régler avant qu’il puisse être basculé.
tr_tr: Bir DoubleSolenoid varsayılan olarak kapalı olduğundan, değiştirilmeden önce onu ayarlamanız gerekecektir.
zh_cn: 因为一个 DoubleSolenoid 对象预设值为关闭，所以需要在初始化时进行设置以切换电磁阀。

source: Pressure Transducers
es_mx: Transductores de presión
fr_ca: Capteurs de pression
tr_tr: Basınç Dönüştürücüler
zh_cn: 压力传感器

source: One can connect a pressure transducer to measure the pressure stored in a pneumatic system. These transducers connect to the Analog Input ports on the roboRIO, and can be read by the AnalogInput or AnalogPotentiometer classes in WPILib.
es_mx: Se puede conectar un transductor de presión para medir la presión almacenada en un sistema neumático. Estos transductores se conectan a los puertos de entrada analógica en la roboRIO y pueden ser leídos por las clases AnalogInput o AnalogPotentiometer en WPILib.
fr_ca: On peut connecter un capteur de pression afin de mesurer la pression de l'air emmagasiné dans un système pneumatique. Ces capteurs se connectent aux ports d’entrée analogiques du roboRIO et peuvent être lus par les classes AnalogInput ou AnalogPotentiomètre de la WPILib.
tr_tr: Pnömatik bir sistemde depolanan basıncı ölçmek için bir basınç dönüştürücü bağlanabilir. Bu dönüştürücüler roboRIO'daki Analog Giriş bağlantı noktalarına bağlanır ve WPILib'deki AnalogInput veya AnalogPotentiometer sınıfları tarafından okunabilir.
zh_cn: 连接压力传感器可以测量存储在气动系统中的压力。这些传感器连接到 roboRIO 上的模拟输入端口，并且可以由 WPILib 中的 AnalogInput 或 AnalogPotentiometer 类读取。
