Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/actuators/wpi-drive-classes.po
Languages: tr_tr, zh_cn

source: Many teams also like to ramp the joysticks inputs over time to promote a smooth acceleration and reduce jerk. This can be accomplished with a :ref:`Slew Rate Limiter <docs/software/advanced-controls/filters/slew-rate-limiter:Slew Rate Limiter>`.
zh_cn: 许多团队还喜欢随着时间的推移逐渐增加操纵杆的输入量，以促进平稳的加速并减少颠簸。这可以通过:ref:`转换速率限制器 <docs/software/advanced-controls/filters/slew-rate-limiter:Slew Rate Limiter>`来实现。

source: This article describes conventions and defaults used by the WPILib Drive classes (DifferentialDrive, MecanumDrive, and KilloughDrive). For further details on using these classes, see the subsequent articles.
tr_tr: Bu makalede, WPILib Drive sınıfları (DifferentialDrive, MecanumDrive ve KilloughDrive) tarafından kullanılan kurallar ve varsayılanlar açıklanmaktadır. Bu sınıfların kullanımına ilişkin daha fazla ayrıntı için sonraki makalelere bakın.

source: By default, the class inverts the motor outputs for the right side of the drivetrain. Generally this will mean that no inversion needs to be done on the individual SpeedController objects. To disable this behavior, use the setRightSideInverted() method.
tr_tr: Varsayılan olarak, sınıf, aktarma organının sağ tarafı için motor çıkışlarını ters çevirir. Genel olarak bu, bağımsız SpeedController nesnelerinde ters çevirmenin yapılmasına gerek olmadığı anlamına gelir. Bu davranışı devre dışı bırakmak için setRightSideInverted() yöntemini kullanın.

source: Squaring Inputs & Input Deadband
tr_tr: Girişleri ve Giriş Ölü Bantını'nın Karesinin alınması

source: By default, the Differential Drive class applies an input deadband of .02. This means that input values with a magnitude below .02 (after any squaring as described above) will be set to 0. In most cases these small inputs result from imperfect joystick centering and are not sufficient to cause drivetrain movement, the deadband helps reduce unnecessary motor heating that may result from applying these small values to the drivetrain. To change the deadband, use the setDeadband() method.
tr_tr: Varsayılan olarak, Differential Drive sınıfı, .02.'lik bir giriş ölü bandı uygular. Bu, .02.'nin altında bir büyüklükteki giriş değerlerinin (yukarıda açıklandığı gibi herhangi bir kareleme işleminden sonra) 0 olarak ayarlanacağı anlamına gelir. Çoğu durumda, bu küçük girişler, mükemmel olmayan kumanda kolu merkezlemesinden kaynaklanır ve aktarma organları hareketine neden olmak için yeterli değildir, ölü bant, gereksiz bu küçük değerlerin aktarma organlarına uygulanmasından kaynaklanabilecek motor ısınmasını engeller. Ölü bandı değiştirmek için setDeadband() yöntemini kullanın.

source: The purpose of the Motor Safety mechanism is the same as the purpose of a watchdog timer, to disable mechanisms which may cause harm to themselves, people or property if the code locks up and does not properly update the actuator output. Motor Safety breaks this concept out on a per actuator basis so that you can appropriately determine where it is necessary and where it is not. Examples of mechanisms that should have motor safety enabled are systems like drive trains and arms. If these systems get latched on a particular value they could cause damage to their environment or themselves. An example of a mechanism that may not need motor safety is a spinning flywheel for a shooter. If this mechanism gets latched on a particular value it will simply continue spinning until the robot is disabled. By default Motor Safety is enabled for RobotDrive objects and disabled for all other speed controllers and servos.
tr_tr: Motor Safety mekanizmasının amacı, bir watchdog timet zamanlayıcısının amacı ile aynıdır, eğer kod kilitlenirse ve aktüatör çıkışını düzgün şekilde güncellemiyorsa kendilerine, insanlara veya etrafa zarar verebilecek mekanizmaları devre dışı bırakmaktır. Motor Güvenliği, nerede gerekli ve nerede gerekli olmadığını uygun şekilde belirleyebilmeniz için bu konsepti aktüatör bazında ayırır. Motor güvenliğinin etkinleştirilmesi gereken mekanizma örnekleri, aktarma organları ve kollar gibi sistemlerdir. Bu sistemler belirli bir değerde kilitlenirse çevrelerine veya kendilerine zarar verebilirler. Motor güvenliğine ihtiyaç duymayabilecek bir mekanizma örneği, bir atıcı için dönen bir serbest teker olabilİr. Bu mekanizma belirli bir değere kilitlenirse, robot devre dışı bırakılıncaya kadar dönmeye devam edecektir. Varsayılan olarak, RobotDrive nesneleri için Motor Safety etkinleştirilir ve diğer tüm hız kontrolörleri ve servolar için devre dışı bırakılır.

source: The Motor Safety feature operates by maintaining a timer that tracks how long it has been since the feed() method has been called for that actuator. Code in the Driver Station class initiates a comparison of these timers to the timeout values for any actuator with safety enabled every 5 received packets (100ms nominal). The set() methods of each speed controller class and the set() and setAngle() methods of the servo class call feed() to indicate that the output of the actuator has been updated.
tr_tr: Motor Safety özelliği, o aktüatör için feed() yöntemi çağrıldıktan sonra ne kadar zaman geçtiğini izleyen bir zamanlayıcıyı tutarak çalışır. Driver Station sınıfındaki kod, alınan her 5 pakette (100ms nominal) güvenliği etkinleştirilmiş herhangi bir aktüatör için bu zamanlayıcıların zaman aşımı değerleriyle bir karşılaştırmas başlatır. Her hız denetleyici sınıfının set() yöntemleri ve servo sınıfı çağrının set() ve setAngle() yöntemleri, aktüatör çıkışının güncellendiğini belirtmek için feed() çağırır.

source: The Motor Safety interface of speed controllers can be interacted with by the user using the following methods:
tr_tr: Hız kontrol cihazlarının Motor Safety arayüzü, aşağıdaki yöntemler kullanılarak kullanıcı tarafından etkileşime girebilir:

source: Using the DifferentialDrive class to control Differential Drive (WCD) robots
tr_tr: Diferansiyel Sürüş (WCD) robotlarını kontrol etmek için DifferentialDrive sınıfını kullanma

source: WPILib provides separate Robot Drive classes for the most common drive train configurations (differential, mecanum, and Killough). The DifferentialDrive class handles the differential drivetrain configuration. These drive bases typically have two or more in-line traction or omni wheels per side (e.g., 6WD or 8WD) and may also be known as "skid-steer", "tank drive", or "West Coast Drive". The Kit of Parts drivetrain is an example of a differential drive. There are methods to control the drive with 3 different styles ("Tank", "Arcade", or "Curvature"), explained in the article below.
tr_tr: WPILib, en yaygın aktarma organı konfigürasyonları (diferansiyel, mecanum ve Killough) için ayrı Robot Drive sınıfları sağlar. DifferentialDrive sınıfı, diferansiyel aktarma konfigürasyonunu yönetir. Bu tahrik tabanları tipik olarak her tarafta iki veya daha fazla sıralı çekiş veya omni tekerleğe sahiptir (örneğin, 6WD veya 8WD) ve ayrıca "skid-steer", "tank drive" veya "West Coast Drive" olarak da bilinebilirler. Kit of Parts aktarma organı, diferansiyel sürücüye bir örnektir. Sürücüyü aşağıdaki makalede açıklanan 3 farklı stille ("Tank", "Arcade" veya "Curvature") kontrol etmenin yöntemleri vardır.

source: Many FRC drivetrains have more than 1 motor on each side. In order to use these with DifferentialDrive, the motors on each side have to be collected into a single SpeedController, using the SpeedControllerGroup class. The examples below show a 4 motor (2 per side) drivetrain. To extend to more motors, simply create the additional controllers and pass them all into the SpeedController group constructor (it takes an arbitrary number of inputs).
tr_tr: Çoğu FRC aktarma organlarının her iki tarafında 1'den fazla motor bulunur. Bunları DifferentialDrive ile kullanmak için, her iki taraftaki motorların SpeedControllerGroup sınıfı kullanılarak tek bir SpeedController'da toplanması gerekir. Aşağıdaki örnekler 4 motorlu (her tarafta 2 adet) aktarma organını göstermektedir. Daha fazla motora genişletmek için, basitçe ek kontrolörler oluşturun ve hepsini SpeedController grup oluşturucuya girin (gerekli sayıda giriş gerektirir).
