Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-preferences.po
Languages: es_mx, fr_ca, tr_tr

source: Setting global preferences for Shuffleboard
es_mx: Establecer preferencias globales para el Shuffleboard
fr_ca: Réglage global des préférences de Shuffleboard
tr_tr: Shuffleboard için genel tercihleri ayarlama

source: There are a number of settings that set the way Shuffleboard looks and behaves. Those are on the Shuffleboard Preferences pane that can be accessed from the File menu.
es_mx: Hay una serie de ajustes que establecen la forma en que Shuffleboard se ve y se comporta. Están en el panel de Preferencias de Shuffleboard al que se puede acceder desde el menú archivo.
fr_ca: Il existe un certain nombre de réglages qui contrôlent l'apparence et le comportement de Shuffleboard. On peut y accéder dans le menu "File", sous le panneau "Preferences".
tr_tr: Shuffleboard'un görünüşünü ve davranışını belirleyen bir dizi ayar vardır. Bunlar, dosya menüsünden erişilebilen Shuffleboard Tercihleri bölmesindedir.

source: Setting the theme
es_mx: Estableciendo el tema
fr_ca: Réglage du thème
tr_tr: Temayı Belirleme

source: Shuffleboard supports two themes, Material Dark and Material Light and the setting depends on your preferences. This uses css styles that apply to the entire application and can be changed any time.
es_mx: Los Shuffleboard soportan dos temas, Material Dark y Material Light y el ajuste depende de tus preferencias. Esto utiliza estilos css que se aplican a toda la aplicación y que se pueden cambiar en cualquier momento.
fr_ca: Shuffleboard supporte deux thèmes selon votre préférence : "Material Dark" et "Material Light". Les feuilles de style en cascade, css ou Cascading Style Sheets, sont appliquées sur l'application entière et peuvent être modifiées à tout moment.
tr_tr: Shuffleboard iki temayı destekler: Material Dark ve Material Light ve ayar tercihlerinize bağlıdır. Bu, tüm uygulama için geçerli olan ve herhangi bir zamanda değiştirilebilen css stillerini kullanır.

source: Setting the default tile size
es_mx: Estableciendo el tamaño de los tiles por defecto
fr_ca: Réglage de la taille par défaut des vignettes
tr_tr: Varsayılan Döşeme Boyutunu Ayarlama

source: Shuffleboard positions tiles on a grid when you are adding or moving them yourself or when they are auto-populated. You can set the default tile size when for each tab or it can be set globally for all the tabs created after the default setting is changed. Finer resolution in the grid results in finer control over placement of tiles. This can be set in the Shuffleboard Preferences window as shown below.
es_mx: Los Shuffleboards colocan los tiles/teselas en una cuadrícula cuando los agrega o mueve usted mismo o cuando se auto-poblan. Puede establecer el tamaño de los tiles por defecto para cada ficha o puede establecerse globalmente para todas las fichas creadas después de cambiar la configuración por defecto. Una resolución más fina en la cuadrícula da como resultado un control más fino sobre la colocación de los tiles. Esto se puede establecer en la ventana de Preferencias de Shuffleboard como se muestra a continuación.
fr_ca: Shuffleboard positionne les vignettes sur une grille lorsqu'on les ajoute, les déplace, ou lorsqu'elles sont automatiquement générées. Vous pouvez choisir une taille par défaut pour chaque onglet, ou l'appliquer à tous les onglets nouvellement créés. Une résolution plus fine permet un placement plus précis des vignettes. Ceci est configurable dans la fenêtre des préférences ci-dessous.
tr_tr: Shuffleboard, karoları kendiniz eklerken veya taşırken ya da otomatik olarak doldurulduğunda bir ızgara üzerinde konumlandırır. Her sekme için varsayılan döşeme boyutunu ayarlayabilirsiniz veya varsayılan ayar değiştirildikten sonra oluşturulan tüm sekmeler için global olarak ayarlanabilir. Izgaradaki daha ince çözünürlük, karoların yerleştirilmesi üzerinde daha iyi kontrol sağlar. Bu, aşağıda gösterildiği gibi Shuffleboard Tercihleri penceresinde ayarlanabilir.

source: Working with the layout save files
es_mx: Trabajando con los archivos de guardado del diseño
fr_ca: Travailler avec les sauvegardes de la disposition des vignettes
tr_tr: Düzen ile çalışma dosyaları kaydetme

source: Shuffleboard will default to saving your layout when you exit the application. You can also save it explicitly using the File / Save and File / Save as... menu options. The preferences window has options to cause the previous layout to be automatically applied when Shuffleboard starts. In addition, Shuffleboard will always display a "Save layout" window to remind you to save the layout. You can choose to turn off the automatic prompt on exit, but be sure to save the layout manually in this case so you don't loose your changes.
es_mx: Shuffleboard se encargará de guardar el diseño cuando salga de la aplicación. También puede guardarla explícitamente mediante las opciones de menú Archivo / Guardar y Archivo / Guardar como.... La ventana de preferencias tiene opciones para que la disposición anterior se aplique automáticamente cuando se inicie Shuffleboard. Además, Shuffleboard siempre mostrará una ventana "Guardar diseño" para recordarle que debe guardar el diseño. Puede elegir desactivar el aviso automático al salir, pero asegúrese de guardar la distribución manualmente en este caso para no perder los cambios.
fr_ca: La disposition des vignettes est sauvegardée par défaut lors de la fermeture de Shuffleboard. Mais cette sauvegarde peut aussi être effectuée directement à l'aide des options "File / Save" et "File / Save as". Au démarrage de l'application, la disposition précédente est chargée automatiquement à l'aide d'une option dans la fenêtre des préférences. De plus, à chaque fermeture de l'application, la fenêtre "Save layout" vous rappellera d'effectuer une sauvegarde. Si vous désactivez ce rappel à l'aide de l'option, n'oubliez pas alors d'effectuer la sauvegarde manuellement pour ne pas perdre vos changements.
tr_tr: Shuffleboard, uygulamadan çıktığınızda varsayılan olarak düzeninizi kaydedecektir. Ayrıca Dosya / Kaydet ve Dosya / Farklı Kaydet ... menü seçeneklerini kullanarak da açıkça kaydedebilirsiniz. Tercihler penceresi, Shuffleboard başladığında önceki düzenin otomatik olarak uygulanmasını sağlayacak seçeneklere sahiptir. Ayrıca Shuffleboard, düzeni kaydetmenizi hatırlatmak için her zaman bir "Düzeni kaydet" penceresi görüntüler. Çıkışta komut istemini kapatmayı seçebilirsiniz, ancak bu durumda düzeni manuel olarak kaydettiğinizden emin olun, böylece değişikliklerinizi kaybetmezsiniz.

source: Setting the team number
es_mx: Fijando el número de equipo
fr_ca: Configuration du numéro d'équipe
tr_tr: Takım numarasının belirlenmesi

source: In order for Shuffleboard to be able to find your NetworkTables server on your robot, specify your team number in the "NetworkTables" tab on the Preferences pane. If you're running Shuffleboard with a running Driver Station, the Server field will be auto-populated with the correct information. If you're running on a computer without the Driver Station, you can manually enter your team number or the robotRIO network address.
es_mx: Para que Shuffleboard pueda encontrar su servidor de NetworkTables en su robot, especifique su número de equipo en la pestaña "NetworkTables" del panel de Preferencias. Si está ejecutando Shuffleboard con una estación de controladora en funcionamiento, el campo Servidor se rellenará automáticamente con la información correcta. Si está ejecutando en un ordenador sin la Estación del controlador, puede introducir manualmente su número de equipo o la dirección de red del robotRIO.
fr_ca: Pour permettre à Shuffleboard de se connecter au serveur des NetworkTables de votre robot, il est nécessaire de lui indiquer le bon numéro d'équipe à l'aide de l'onglet "NetworkTables" dans le panneau de préférences. Si votre Shuffleboard a été lancé par Driver Station, ce dernier remplira automatiquement cette information via le champ "Server". Si vous roulez Shuffleboard sans Driver Station, vous pouvez entrer soit votre numéro d'équipe, soit l'adresse réseau du roboRIO.
tr_tr: Shuffleboard'un robotunuzda NetworkTables sunucunuzu bulabilmesi için, takım numaranızı tercihler bölmesindeki "Ağ Tabloları" sekmesinde belirtin. Shuffleboard'u çalışan bir Driver Station ile çalıştırıyorsanız, Sunucu alanı doğru bilgilerle otomatik olarak doldurulacaktır. Driver Station olmadan bir bilgisayarda çalışıyorsanız, ekip numaranızı veya robotRIO ağ adresini manuel olarak girebilirsiniz.
