Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-recording.po
Languages: es_mx, fr_ca, tr_tr

source: Recording and Playback
es_mx: Grabaciones y Playback
fr_ca: Enregistrement et lecture
tr_tr: Kayıt ve Oynatma

source: Shuffleboard can log all widget updates during a session. Later the log file can be "played back" to see what happened during a match or a practice run. This is especially useful if something doesn't operate as intended during a match and you want to see what happened. Each recording is captured in a recording file.
es_mx: La Shuffleboard puede cargar todas las actualizaciones de los widgets durante una sesión. Después el archivo cargar puede repetirse para ver que sucedió durante un partido o una práctica. Esto es especialmente útil si algo no funciona como se desea durante un partido y usted quiere ver que sucedió. Cada grabación es guardada en un archivo de grabación.
fr_ca: Shuffleboard peut enregistrer toutes les mises à jour de widget au cours d’une session. Plus tard, le fichier journal peut être "rejoué" pour voir ce qui s’est passé pendant un match ou une pratique. Ceci est particulièrement utile si quelque chose ne fonctionne pas comme prévu pendant un match et que vous voulez voir ce qui s’est passé. Chaque enregistrement est consigné dans un fichier d’enregistrement.
tr_tr: Shuffleboard, bir oturum sırasında tüm widget güncellemelerini günlüğe kaydedebilir. Daha sonra bir maç veya antrenman sırasında ne olduğunu görmek için günlük dosyası "played back-oynatılabilir". Bu, özellikle bir maç sırasında amaçlandığı gibi çalışmıyorsa ve ne olduğunu görmek istiyorsanız kullanışlıdır. Her kayıt bir kayıt dosyasına kaydedilir.

source: Creating a Recording
es_mx: Crear una Grabación
fr_ca: Création d’un enregistrement
tr_tr: Bir Kayıt Oluşturma

source: When shuffleboard starts it begins recording to all the NetworkTables values are recorded and continues until stopped by hitting the record/stop button in the recorder controls as shown below. If a new recording is desired, such as when a new piece of code or mechanical system is being tested, stop the current recording if it is running, and click the record button. Click the button again to stop recording and close the recording file. If the button is round (as shown) then click it to start a recording. If the button is a square, then a recoding is currently running so click it to stop the recording.
es_mx: Cuando Shuffleboard comienza a grabar a todos los valores de NetworkTables se registran y continúa hasta que se detiene pulsando el botón de grabación / parada en los controles de la grabadora como se muestra a continuación. Si se desea realizar una nueva grabación, como cuando se está probando una nueva pieza de código o sistema mecánico, detenga la grabación actual si se está ejecutando, y haga clic en el botón de grabación. Vuelva a hacer clic en el botón para detener la grabación y cerrar el archivo de grabación. Si el botón es redondo (como se muestra), haga clic en él para iniciar una grabación. Si el botón es un cuadrado, entonces se está ejecutando una grabación, así que haga clic en él para detener la grabación.

source: Playing a Recording
es_mx: Reproducir una Grabación
fr_ca: Lecture d’un enregistrement
tr_tr: Bir Kaydın Oynatılması

source: Previous recordings can be played back by:
es_mx: Grabaciones previas pueden volver a reproducirse haciendo:
fr_ca: Les enregistrements antérieurs peuvent être rejoués ainsi :
tr_tr: Önceki kayıtlar şu şekilde oynatılabilir:

source: Selecting the "Recording" menu then click "Load playback".
es_mx: Seleccionar el menú "Recording" después dé click en "Load playback".
fr_ca: Sélectionnez le menu "Recording" puis cliquez sur "Load playback".
tr_tr: "Recording-Kayıt" menüsünü seçin ve ardından "Load playback-Oynatmayı yükle" ye tıklayın.

source: Choose a recording from the from the directory shown. Recordings are grouped by date and the file names are the time the recording was made to help identify the correct one. Select the correct recording from the list.
es_mx: Elija una grabación del directorio mostrado. Las grabaciones son agrupadas por fecha y los nombres de los archivos son la fecha en la cual se grabó, para ayudar a identificar la correcta. Seleccione la grabación correcta de la lista.
fr_ca: Choisissez un enregistrement dans le répertoire affiché. Les enregistrements sont regroupés par date et les noms de fichier correspondent à l’heure à laquelle l’enregistrement a été effectué pour ainsi aider à en identifier le bon. Dans la liste, sélectionnez l’enregistrement.
tr_tr: Gösterilen dizinden bir kayıt seçin. Kayıtlar tarihe göre gruplanır ve dosya adları, doğru olanı belirlemeye yardımcı olmak için kaydın yapıldığı zamandır. Listeden doğru kaydı seçin.

source: Controlling the Playback
es_mx: Controlar el Playback
fr_ca: Commandes de lecture
tr_tr: Oynatmayı Kontrol Etme

source: Selecting the recoding file will begin playback of that file. While the recording is playing the recording controls will show the current time within the recording as well as the option to loop the recording while watching it. When the recording is being played back the "transport" controls will allow the playback to be controlled.
es_mx: Al seleccionar el archivo empezará la repetición de ese. Mientras el archivo se reproduce los controles de grabación mostrarán el tiempo actual dentro de la grabación también la opción de loop the recording while watching it/repetir la grabación mientras se escucha. Cuando la grabación se está reproduciendo de los controles de “transport” permitirá que el playback sea controlado.
fr_ca: La sélection du fichier d'enregistrement lancera la lecture de ce fichier. Pendant que la lecture est en cours, un compteur horaire permet d'en suivre la progression. Il existe également une option de lecture en boucle. L'interface du lecteur comprend également des commandes qui offrent un contrôle plus précis de la lecture de l’enregistrement.
tr_tr: Kaydedilen dosyanın seçilmesi, o dosyanın oynatılmasına başlayacaktır. Kayıt oynatılırken kayıt kontrolleri, kayıt içindeki geçerli zamanı ve kaydı izlerken döngü seçeneğini gösterecektir. Kayıt oynatılırken "transport-taşıma" kontrolleri oynatmanın kontrol edilmesine izin verecektir.

source: The controls work as follows:
es_mx: Los controles trabajan de la siguiente manera:
fr_ca: Les commandes fonctionnent de la manière suivante :
tr_tr: Kontroller şu şekilde çalışır:

source: The left double-arrow button backs up the playback to the last changed data point
es_mx: El botón izquierdo con una doble flecha respalda el playback al último punto de datos
fr_ca: Le bouton double flèche gauche ramène la lecture à la dernière donnée modifiée.
tr_tr: Sol çift ok düğmesi, oynatmayı son değiştirilen veri noktasına yedekler

source: The play/pause controls starts and stops the playback
es_mx: Los controles play/pause empiezan y paran el playback
fr_ca: Les commandes play/pause démarrent et arrêtent la lecture
tr_tr: Oynatma / duraklatma kontrolleri oynatmayı başlatır ve durdurur

source: The square stop button stops playback and resumes showing current robot values
es_mx: El botón cuadrado de stop detiene el playback y continúa mostrando los valores del robot en ese momento
fr_ca: De forme carrée, le bouton d’arrêt met fin à la lecture et Shuffleboard bascule en mode affichage des valeurs actuelles du robot
tr_tr: Kare durdurma düğmesi oynatmayı durdurur ve mevcut robot değerlerini göstermeye devam eder

source: The right double-arrow skips forward to the next changed data value
es_mx: El botón derecho con una doble flecha se salta al siguiente valor de datos que cambia
fr_ca: La double flèche droite avance la lecture vers la modification de donnée suivante
tr_tr: Sağdaki çift ok, bir sonraki değiştirilmiş veri değerine atlar

source: The slider allows for direct positioning to any point in time to view different parts of the recording
es_mx: La barra de desplazamiento permite posicionarse directamente en cualquier punto para ver diferentes partes de la grabación
fr_ca: La barre de défilement permet de se positionner à n'importe quel moment afin d'afficher différentes parties de l'enregistrement
tr_tr: Kaydırıcı, kaydın farklı bölümlerini görüntülemek için zamandaki herhangi bir noktaya doğrudan konumlandırmaya izin verir

source: The loop switch turns on playback looping, that is, the playback will run over and over until stopped
es_mx: El switch de repetición habilita que siga funcionando playback, eso significa, que el playback se repetirá una y otra vez hasta que lo detenga
fr_ca: Ce bouton glisseur permet de passer à la lecture en boucle jusqu'à interruption.
tr_tr: Döngü anahtarı, oynatma döngüsünü açar, yani oynatma, durdurulana kadar tekrar tekrar çalışır.

source: The time shows the current point within the recording and the total time of the recording
es_mx: El tiempo muestra el punto actual de la grabación y la duración total de esta
fr_ca: L’indicateur horaire montre le temps écoulé depuis le commencement de la lecture de l’enregistrement et la durée totale de l’enregistrement
tr_tr: Zaman, kayıt içindeki mevcut noktayı ve toplam kayıt süresini gösterir

source: Converting to Different File Formats
es_mx: Convertir a Diferentes Tipos de Archivos
fr_ca: Conversion en différents formats de fichier
tr_tr: Farklı Dosya Biçimlerine Dönüştürme

source: Shuffleboard recordings are in a custom binary format for efficiency. To analyze recorded data without playing it back through the app, Shuffleboard supports data converters to convert the recordings to an arbitrary format. Only a simple CSV converter is shipped with the app, but teams can write custom converters and include them in Shuffleboard plugins.
es_mx: Las grabaciones de la Shuffleboard están en un formato predeterminado por eficiencia. Para analizar datos grabados sin tener que repetirlo a través de la app. La Shuffleboard proporciona convertidores de datos para convertir grabaciones a cualquier formato. Solamente un simple convertidor CSV es enviado con la app. Pero los equipos pueden desarrollar convertidores e incluirlos en los plugins de la Shuffleboard.
fr_ca: Les enregistrements de Shuffleboard sont dans un format binaire par souci d’efficacité. Pour analyser les données enregistrées sans les lire à travers l’application, Shuffleboard prend en charge des convertisseurs de données afin de convertir les enregistrements en un format de votre choix. Seul un convertisseur CSV élémentaire est fourni avec l’application, mais les équipes peuvent écrire des convertisseurs personnalisés et les inclure dans les plugins de Shuffleboard.
tr_tr: Shuffleboard kayıtları, verimlilik için özel bir ikili formattadır. Shuffleboard, kaydedilen verileri uygulama aracılığıyla oynatmadan analiz etmek için, kayıtları rastgele bir biçime dönüştürmek için veri dönüştürücüleri destekler. Uygulamayla birlikte yalnızca basit bir CSV dönüştürücü gönderilir, ancak ekipler özel dönüştürücüler yazabilir ve bunları Shuffleboard eklentilerine dahil edebilir.

source: Multiple recordings can be converted at once. Individual files can be selected with the "Add Files" button, or all recording files in a directory can be selected at once with the "Add Directory" button.
es_mx: Varias grabaciones se pueden convertirse a la vez. Los archivos individuales pueden ser seleccionados con el botón “Add files”, o todos los archivos de grabaciones en un directorio pueden seleccionarse al mismo tiempo con el botón “Add directory”.
fr_ca: Plusieurs enregistrements peuvent être convertis à la fois. Les fichiers individuels peuvent être sélectionnés à l'aide du bouton "Add Files", ou tous les fichiers d’un répertoire peuvent être conjointement sélectionnés à l'aide du bouton "Add Directory".
tr_tr: Birden fazla kayıt aynı anda dönüştürülebilir. "Add Files-Dosya Ekle" butonu ile tek tek dosyalar seçilebilir veya bir dizindeki tüm kayıt dosyaları "Add Directory-Dizin Ekle" butonu ile bir defada seçilebilir.

source: Converted recordings will be generated in the ``~/Shuffleboard/recordings`` directory, but can be manually selected with the "Change" button.
es_mx: Las grabaciones convertidas se generarán en el directorio ``~/Shuffleboard/recordings``, pero pueden ser seleccionados manualmente con el botón “Change”.
fr_ca: Les enregistrements convertis seront générés dans le répertoire ``~/Shuffleboard/recordings``, mais peuvent être sélectionnés manuellement à l'aide du bouton "Change".
tr_tr: Dönüştürülen kayıtlar ``~/Shuffleboard/recordings`` dizininde oluşturulur, ancak "Change-Değiştir" düğmesiyle manuel olarak seçilebilir.

source: Different converters can be selected with the dropdown in the top right. By default, only the CSV converter is available. Custom converters from plugins will appear as options in the dropdown.
es_mx: Los diferentes convertidores pueden seleccionarse con la herramienta dropdown en la esquina derecha superior. Por default, solamente el convertidor CSV está disponible. Los convertidores personalizados de plugins aparecerán como opciones en el drop dowm.
fr_ca: Différents convertisseurs peuvent être sélectionnés dans la liste déroulante en haut à droite. Par défaut, seul le convertisseur CSV est disponible. Les convertisseurs personnalisés des plugins apparaissent comme options dans la liste déroulante.
tr_tr: Sağ üstteki açılır menü ile farklı dönüştürücüler seçilebilir. Varsayılan olarak, yalnızca CSV dönüştürücü kullanılabilir. Eklentilerden özel dönüştürücüler, açılır menüde seçenekler olarak görünecektir.

source: Additional Notes
es_mx: Notas Adicionales
fr_ca: Notes supplémentaires
tr_tr: Ek Notlar

source: Graphs won't display properly while scrubbing the timeline but if it is playing through where the graph history can be captured by the graph then they will display as in the original run.
es_mx: Las gráficas no se mostraran de manera correcta mientras se esté depurando la línea del tiempo pero si se está reproduciendo a través de la gráfica puede capturar su historia por la gráfica entonces se mostrara en la presentación original.
fr_ca: Les graphiques ne s’affichent pas correctement lorsque le curseur temporel est manuellement déplacé, toutefois si ce déplacement passe par des points précis présents dans l'historique du graphique alors le graphique résultant correspondra à celui qu'on obtiendrait de la lecture originale.
tr_tr: Zaman çizelgesini fırçalarken grafikler düzgün görüntülenmez, ancak grafik geçmişinin grafik tarafından yakalanabileceği bir yerde oynatılıyorsa, orijinal çalışmada olduğu gibi görüntülenecektir.

source: When shuffleboard starts it begins recording to all the NetworkTable values are recorded and continues until stopped by hitting the record/stop button in the recorder controls as shown below. If a new recording is desired, such as when a new piece of code or mechanical system is being tested, stop the current recording if it is running, and click the record button. Click the button again to stop recording and close the recording file. If the button is round (as shown) then click it to start a recording. If the button is a square, then a recoding is currently running so click it to stop the recording.
fr_ca: Au démarrage de Shuffleboard l'enregistrement de toutes les valeurs contenues dans les NetworkTables débute et ce processus continue jusqu’à ce qu'on l'arrête en appuyant sur le bouton record/stop des commandes de l’enregistreur comme indiqué ci-dessous. Si un nouvel enregistrement est nécessaire, par exemple pour tester une nouvelle portion du code ou un nouveau mécanisme, il suffit d'arrêter l’enregistrement en cours et de cliquer sur le bouton d’enregistrement. Cliquez à nouveau sur le bouton pour arrêter l’enregistrement et fermer le fichier d’enregistrement. Si le bouton apparaît arrondi (tel qu'indiqué), cliquez dessus pour démarrer un enregistrement. Si le bouton apparaît sous la forme d'un carré, c'est le signe qu'un enregistrement est en cours d’exécution; pour l'arrêter, cliquez sur le bouton.
tr_tr: Shuffleboard paneli başladığında, tüm NetworkTable değerlerine kayıt yapmaya başlar ve aşağıda gösterildiği gibi kayıt cihazı kontrollerindeki kaydet / durdur düğmesine basılarak durdurulana kadar devam eder. Yeni bir kod parçası veya mekanik sistem test edilirken olduğu gibi yeni bir kayıt istenirse, çalışıyorsa mevcut kaydı durdurun ve kayıt düğmesine tıklayın. Kaydı durdurmak ve kayıt dosyasını kapatmak için düğmeye tekrar tıklayın. Düğme yuvarlaksa (gösterildiği gibi), kaydı başlatmak için tıklayın. Düğme bir kare ise, o anda bir kayıt çalışıyor demektir, bu nedenle kaydı durdurmak için tıklayın.
