Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-widgets.po
Languages: es_mx, fr_ca, tr_tr

source: Working with widgets
es_mx: Trabajar con Widgets
fr_ca: Utilisation de widgets
tr_tr: Widgets -Araçlar ile çalışma

source: The visual displays that you manipulate on the screen in Shuffleboard are called widgets. Widgets are generally automatically displayed from values that the robot program publishes with NetworkTables.
es_mx: Las unidades de visualización que usted manipula en la pantalla de la Shuffleboard son llamados widgets. Los Widgets son general y automáticamente desplegados de valores que el programa del robot publica con NetworkTables.
fr_ca: Les dispositifs d'affichage que vous manipulez à l'écran dans Shuffleboard sont appelés widgets. Les widgets sont généralement automatiquement affichés à partir de valeurs que le programme du robot publie dans NetworkTables.
tr_tr: Shuffleboard'da ekranda işlediğiniz görsel görüntülere widget denir. Widget'lar genellikle robot programının NetworkTables ile yayınladığı değerlerden otomatik olarak görüntülenir.

source: Moving widgets
es_mx: Mover widgets
fr_ca: Déplacement des widgets
tr_tr: Widget'ları taşıma

source: Widgets can be moved simply with drag and drop. Just move the cursor over the widget, left-click and drag it to the new position. When dragging you can only place widgets on grid squares and the size of the grid will effect the resolution of your display. When dragging a red or green outline will be displayed. Green generally means that there is enough room at the current location to drop the widget and red generally means that it will overlap or be too big to drop. In the example below a widget is being moved to a location where it doesn't fit.
es_mx: Los widgets pueden moverse simplemente al arrastrar y soltar. Solamente mueva el cursor sobre el widget, dé clic izquierdo y arrástrelo a su nueva posición. Cuando lo esté arrastrando solamente lo puede acomodar en recuadrados dentro de la cuadrícula y el tamaño de la cuadricula tendrá efecto en la resolución de tu visualización. Al arrastrarlos aparecerá una margen rojo o verde. El color verde generalmente significa que existe espacio suficiente en esa ubicación para soltar el widget y el rojo significa que el widget es muy grande para ese espacio. En el ejemplo de abajo, un widget está siendo movido a una ubicación donde no cabe.
fr_ca: Les widgets peuvent être déplacés simplement avec glisser et déposer. Il suffit de déplacer le curseur sur le widget, cliquez à gauche et faites-le glisser vers la nouvelle position. Lorsque vous faites glisser, vous ne pouvez placer les widgets que sur les carrés de grille et la taille de la grille aura un effet sur la résolution de votre affichage. Lors d'un déplacement, un contour rouge ou vert s’affiche. Vert signifie généralement qu’il y a assez de place à l’emplacement visé pour y déposer le widget et rouge signifie généralement qu’il y aura chevauchement ou sera trop grand pour l'y déposer. Dans l’exemple ci-dessous, un widget est déplacé vers un endroit qui ne lui convient pas.
tr_tr: Widget'lar sürükle ve bırak ile kolayca taşınabilir. İmleci widget'ın üzerine getirin, sol tıklayın ve yeni konuma sürükleyin. Sürüklerken yalnızca ızgara karelerine widget yerleştirebilirsiniz ve ızgaranın boyutu ekranınızın çözünürlüğünü etkiler. Sürüklerken kırmızı veya yeşil bir çerçeve görüntülenecektir. Yeşil genellikle, mevcut konumda widget'ı düşürmek için yeterli yer olduğu anlamına gelir ve kırmızı, genellikle üst üste geleceği veya düşemeyecek kadar büyük olacağı anlamına gelir. Aşağıdaki örnekte bir widget, sığmadığı bir konuma taşınmaktadır.

source: Resizing widgets
es_mx: Cambiar el tamaño de los widgets
fr_ca: Redimensionnement des widgets
tr_tr: Widget'ları yeniden boyutlandırma

source: Widgets can be resized by clicking and dragging the edge or corner of the widget image. The cursor will change to a resize-cursor when it is in the right position to resize the widget. As with moving widgets, a green or red outline will be drawn indicating that the widget can be resized or not. The example below shows a widget being resized to a larger area with the green outline indicating that there is no overlap with surrounding widgets.
es_mx: Los widgets pueden cambiar su tamaño al dar clic y arrastrar la esquina o borde de este. El cursor cambiará a cursor-cambia-tamaños cuando esté en la posición correcta para cambiar el tamaño del widget. Al igual que al mover el widget, un borde verde o rojo aparecerá indicando si el widget puede cambiar su tamaño o no. El ejemplo de abajo muestra un widget siendo cambiado de tamaño a un área más grande con el borde verde indicando que no se sobrepone con los widgets de alrededor.
fr_ca: Les widgets peuvent être redimensionnés en cliquant et en faisant glisser le bord ou le coin de l’image du widget. Le curseur se transforme en curseur de redimensionnement lorsqu’il est dans la bonne position pour redimensionner un widget. Comme pour le déplacement de widgets, un contour vert ou rouge sera dessiné indiquant que le widget peut être redimensionné ou non. L’exemple ci-dessous montre un widget en cours de redimensionnement à une zone plus grande avec le contour vert indiquant qu’il n’y a pas de chevauchement avec les widgets environnants.
tr_tr: Widget'lar, widget görüntüsünün kenarına veya köşesine tıklayıp sürüklenerek yeniden boyutlandırılabilir. İmleç, widget'ı yeniden boyutlandırmak için doğru konumda olduğunda yeniden boyutlandırma imlecine dönüşecektir. Hareketli widget'larda olduğu gibi, widget'ın yeniden boyutlandırılıp boyutlandırılamayacağını belirten yeşil veya kırmızı bir çerçeve çizilecektir. Aşağıdaki örnek, çevreleyen widget'larla hiçbir örtüşme olmadığını belirten yeşil çerçeve ile daha geniş bir alana yeniden boyutlandırılan bir widget'ı göstermektedir.

source: Changing the display type of widgets
es_mx: Cambiar el tipo de visualización de los widgets
fr_ca: Modification du type d’affichage des widgets
tr_tr: Widget'ların görüntülenme türünü değiştirme

source: Shuffleboard is very rich in display types depending on the data published from the robot. It will automatically choose a default display type, but you might want to change it depending on the application. To see what the possible displays are for any widget, right-click on the widget and select the "Show as..." and from the popup menu, choose the desired type. In the example below are two data values, one a number and the other a boolean. You can see the different types of display options that are available to each. The boolean value has only two possible values (true/false) it can be shown as a boolean box (the red/green color), or text, or a toggle button or toggle switch. The. number value can be displayed as a graph, number bar, number slider, dial, text, or a voltage view depending on the context of the value.
es_mx: La Shuffleboard tiene varios tipos de visualización dependiendo de los datos publicados del robot. Esta eligirá el tipo de visualización predeterminada, pero puede que usted quiera cambiarlo dependiendo de la aplicación. Para ver qué tipos de diseños están disponibles para cada widget, dé clic derecho en el widget y seleccione “Show as…”, y del menú emergenete seleccione el tipo que usted desee. En el ejemplo debajo hay dos tipos de valores de datos, uno numérico y otro booleano. Usted puede ver las diferentes opciones de tipos de visualización que están disponibles para cada uno. El valor booleano solo tiene dos posibles valores (verdadero / falso), puede mostrarse como un recuadro booleano (de color verde/ rojo), o texto, un botón o switch de activación. El valor numérico puede mostrarse como una gráfica, una tabla de números, una barra de números, dial, texto o una vista de voltaje dependiendo de su contexto.
fr_ca: Shuffleboard est très riche en types d’affichage pour les données publiées par le robot. Par défaut, un type d'affichage est choisi automatiquement mais vous pouvez par le modifier par la suite selon l’application. Pour voir les options d'affichage disponibles pour n’importe quel widget, cliquez avec le bouton droit sur le widget et sélectionnez "Show as..." et, dans le menu contextuel, choisissez le type souhaité. Dans l’exemple ci-dessous on trouve deux valeurs de données, l’une est numérique et l’autre est booléenne. Vous pouvez voir les différents types d’options d’affichage qui sont disponibles pour chacune. La donnée booléenne n’a que deux valeurs possibles (true/false) qui peut être affichée sous la forme d’une zone booléenne (de couleur rouge/verte), d’un texte ou d’un bouton à bascule ou d’un commutateur à bascule. La donnée numérique peut être affichée sous la forme d’un graphique, d’une échelle, d’un curseur, d’un cadran, d’un texte ou d’une vue de tension selon le contexte de la valeur.
tr_tr: Shuffleboard, robottan yayınlanan verilere bağlı olarak görüntü türleri açısından çok zengindir. Otomatik olarak varsayılan bir görüntü türü seçecektir, ancak uygulamaya bağlı olarak bunu değiştirmek isteyebilirsiniz. Herhangi bir widget için olası ekranların neler olduğunu görmek için, widget'ı sağ tıklayın ve "Farklı göster ..." seçeneğini seçin ve açılır menüden istediğiniz türü seçin. Aşağıdaki örnekte, biri sayı ve diğeri boole olmak üzere iki veri değeri bulunmaktadır. Her biri için mevcut olan farklı görüntüleme seçenekleri türlerini görebilirsiniz. Boole değerinin yalnızca iki olası değeri vardır (doğru / yanlış), bir boole kutusu (kırmızı / yeşil renk) veya metin veya bir geçiş düğmesi veya geçiş anahtarı olarak gösterilebilir. . sayı değeri, değerin bağlamına bağlı olarak bir grafik, sayı çubuğu, sayı kaydırıcısı, kadran, metin veya voltaj görünümü olarak görüntülenebilir.

source: Changing the title of widgets
es_mx: Cambiar el nombre de los widgets
fr_ca: Modification du titre des widgets
tr_tr: Widget'ların başlığını değiştirme

source: You can change the title of widgets by double-clicking in their title bar and editing the title to the new value. If a widget is contained in a layout, then right-click on the widget and select the properties. From there you can change the widget title that is displayed.
es_mx: Usted puede cambiar el nombre del widget dando doble clic en la barra de título y editandolo a un nuevo valor. Si el widget está contenido en un diseño, entonces dé clic derecho en el widget y seleccione properties. Desde ahí usted puede cambiar el título del widget que se muestra.
fr_ca: Vous pouvez modifier le titre des widgets en double-cliquant dans leur barre de titre et en modifiant le titre à la nouvelle valeur. Si un widget est contenu dans une mise en page, cliquez avec le bouton droit sur le widget et sélectionnez les propriétés. De là, vous pouvez modifier le titre du widget qui s’affiche.
tr_tr: Başlık çubuğuna çift tıklayarak ve başlığı yeni değerle düzenleyerek widget'ların başlığını değiştirebilirsiniz. Bir düzende bir pencere öğesi varsa, pencere aracına sağ tıklayın ve özellikleri seçin. Oradan, görüntülenen widget başlığını değiştirebilirsiniz.

source: Changing widget properties
es_mx: Cambiar las propiedades de los widgets
fr_ca: Modification les propriétés d'un widget
tr_tr: Widget özelliklerini değiştirme

source: You can change the appearance of a widget such as the range of values represented, colors or some other visual element. In cases where this is possible right-click on the widget and select "Edit properties" from the popup menu. In this boolean value widget shown below, the widget title, true color and false color can all be edited.
es_mx: Usted puede cambiar la apariencia de un widget, como el rango de los valores representados, el color u otro elemento visual. En casos donde esto es posible dé clic derecho en el widget y seleccione “Edit properties” del menú. En este valor tipo boolean mostrado abajo, el nombre del widget, el color de verdadero y el color de falso pueden ser editados.
fr_ca: Vous pouvez modifier l’apparence d’un widget telle que la plage des valeurs représentées, les couleurs ou tout autre élément visuel. Dans les situations où cela est possible, cliquez avec le bouton droit sur le widget et sélectionnez "Edit properties" dans le menu contextuel. Dans le widget de valeur booléenne ci-dessous, le titre du widget, les couleurs correspondant aux états vrai et faux peuvent tous être modifiés.
tr_tr: Temsil edilen değerler aralığı, renkler veya başka bir görsel öğe gibi bir widget'ın görünümünü değiştirebilirsiniz. Bunun mümkün olduğu durumlarda, widget'a sağ tıklayın ve açılır menüden "Özellikleri düzenle" yi seçin. Aşağıda gösterilen bu boole değeri widget'ında, widget başlığı, gerçek renk ve yanlış renk düzenlenebilir.
