Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-tabs.po
Languages: tr_tr

source: Creating and manipulating tabs
tr_tr: Sekmeler Oluşturma ve Düzenleme

source: The tabbed layout the Shuffleboard uses help separate different "views" of your robot data and make the displays more useful. You might have a tab the has the display for helping debug the robot program and a different tab for use in competitions. There are a number of options that make tabs very powerful. You can control which data from NetworkTables or other sources appears in each of your tabs using the auto-populate options described later in this article.
tr_tr: Shuffleboard'un kullandığı sekmeli düzen, robot verilerinizin farklı "görünümlerini" ayırmanıza yardımcı olur ve ekranları daha kullanışlı hale getirir. Robot programında hata ayıklamaya yardımcı olmak için ekrana sahip bir sekmeniz ve yarışmalarda kullanmak için farklı bir sekmeniz olabilir. Sekmeleri çok güçlü kılan bir dizi seçenek vardır. Ağ Tablolarından veya diğer kaynaklardan hangi verilerin sekmelerinizin her birinde görüneceğini, bu makalenin sonraki bölümlerinde açıklanan otomatik doldurma seçeneklerini kullanarak denetleyebilirsiniz.

source: Default tabs
tr_tr: Varsayılan Sekmeler

source: When you open Shuffleboard for the first time there are two tabs, labeled SmartDashboard and LiveWindow. These correspond to the two views that SmartDashboard had depending on whether your robot is running in Autonomous/Teleop or Test mode. In shuffleboard both of these views are available any time.
tr_tr: Shuffleboard'u ilk kez açtığınızda, SmartDashboard ve LiveWindow etiketli iki sekme vardır. Bunlar, robotunuzun Otonom / Teleop veya Test modunda çalışmasına bağlı olarak SmartDashboard'un sahip olduğu iki görünüme karşılık gelir. Karıştırmalı tahtada bu görünümlerin her ikisi de her zaman kullanılabilir.

source: On the SmartDashboard tab all the values that are written using the SmartDashboard.putType() set of methods. On the LiveWindow tab all the autogenerated debugging values are shown.
tr_tr: SmartDashboard sekmesinde, SmartDashboard.putType() yöntem kümesi kullanılarak yazılan tüm değerler. LiveWindow sekmesinde, otomatik olarak oluşturulan tüm hata ayıklama değerleri gösterilir.

source: Switching between tabs
tr_tr: Sekmeler Arasında Geçiş Yapma

source: You can switch between tabs clicking on the tab label at the top of the window. In the case above, simply click on SmartDashboard or LiveWindow to see the values that are associated with each tab.
tr_tr: Pencerenin üst kısmındaki sekme etiketine tıklayarak sekmeler arasında geçiş yapabilirsiniz. Yukarıdaki durumda, her sekmeyle ilişkili değerleri görmek için SmartDashboard veya LiveWindow'a tıklamanız yeterlidir.

source: Adding tabs and deleting tabs
tr_tr: Sekmeler Eklemek ve Sekmeleri Silmek

source: You can add additional tabs by clicking on the plus(+) symbol just to the right of the last tab. Once you create a new tab you can set the label by double-clicking on the label in the tab and editing it. You can also right-click on the tab or use the Tab menu to bring up the tab preferences and from that window you can change the name by editing the Title field.
tr_tr: Son sekmenin hemen sağındaki artı (+) simgesine tıklayarak ek sekmeler ekleyebilirsiniz. Yeni bir sekme oluşturduğunuzda, sekmedeki etiketi çift tıklayıp düzenleyerek etiketi ayarlayabilirsiniz. Sekme tercihlerini getirmek için sekmeyi sağ tıklayabilir veya Sekme menüsünü kullanabilirsiniz ve bu pencereden Başlık alanını düzenleyerek adı değiştirebilirsiniz.

source: Setting the tab to auto-populate
tr_tr: Sekmeyi Otomatik Olarak Doldurulacak Şekilde Ayarlama

source: One of the most powerful features with tabs is to have them automatically populate new values based on a source prefix that is supplied in the tab Preferences pane. In the above example the Preferences pane has a Source prefix of "SmartDashboard/Shooter" and Auto populate is turned on. Any values that are written using the SmartDashboard class that specifies a sub-key of Shooter will automatically appear on that tab. Note: keys that match more than one Source prefix will appear in both tabs. Because those keys also start with SmartDashboard/ and that's the Source prefix for the default SmartDashboard tab, those widgets will appear in both panes. To only have values appear in one pane, you can use NetworkTables to write labels and values and use a different path that is not under SmartDashboard. Alternatively you could let everything appear in the SmartDashboard tab making it very cluttered, but have specific tabs for your needs that will be better filtered.
tr_tr: Sekmelerin en güçlü özelliklerinden biri, Tercihler bölmesinde sağlanan bir kaynak ön ekine göre yeni değerleri otomatik olarak doldurmalarıdır. Yukarıdaki örnekte Tercihler bölmesinde "SmartDashboard / Shooter" kaynak ön eki vardır ve Otomatik doldurma açıktır. Shooter'ın bir alt anahtarını belirten SmartDashboard sınıfı kullanılarak yazılan tüm değerler o sekmede otomatik olarak görünecektir. Not: Birden fazla Kaynak önekiyle eşleşen anahtarlar her iki sekmede de görünür. Bu tuşlar da SmartDashboard/ ile başladığından ve bu, varsayılan SmartDashboard sekmesi için Kaynak öneki olduğundan, bu widget'lar her iki bölmede de görünecektir. Değerlerin yalnızca bir bölmede görünmesini sağlamak için, NetworkTables'ı etiketler ve değerler yazmak ve SmartDashboard altında olmayan farklı bir yol kullanmak için kullanabilirsiniz. Alternatif olarak, her şeyin SmartDashboard sekmesinde görünmesine izin vererek onu çok karmaşık hale getirebilir, ancak ihtiyaçlarınız için daha iyi filtrelenecek özel sekmelere sahip olabilirsiniz.

source: Using the tab grid and spacing
tr_tr: Sekme Izgarasını Ve Aralığı Kullanma

source: Each tab can have it's own Tile size (number of pixels per large square). So some tabs might have coarser resolution for easier layout and others might have a fine grid. The Tile size in the Tab preferences overrides any global settings in the Shuffleboard preferences. In addition, you can specify the padding between the drawing in the widget and the edge of the of the widget. If you program user interfaces these parameters are usually referred to as horizontal and vertical gap (hgap, vgap).
tr_tr: Her sekmenin kendi döşeme boyutu olabilir (büyük kare başına piksel sayısı). Bu nedenle, bazı sekmelerin daha kolay düzen için daha kaba çözünürlüğü olabilir ve diğerlerinin ince bir ızgarası olabilir. sekme tercihlerindeki döşeme boyutu, Shuffleboard tercihlerindeki tüm genel ayarları geçersiz kılar. Ek olarak, widget'taki çizim ile widget'ın kenarı arasındaki dolguyu da belirleyebilirsiniz. Kullanıcı arayüzlerini programlarsanız, bu parametrelere genellikle yatay ve dikey boşluk (hgap, vgap) adı verilir.

source: Moving widgets between tabs
tr_tr: Widget'ları Sekmeler Arasında Taşıma

source: Currently there is no way to easily move widgets between tabs without deleting it from one tab and dragging the field from the sources hierarchy on the left into the new pane. We hope to have that capability in a subsequent update soon.
tr_tr: Şu anda, widget'leri bir sekmeden silmeden ve alanı soldaki kaynaklar hiyerarşisinden yeni bölmeye sürüklemeden sekmeler arasında kolayca taşımanın bir yolu yoktur. Bu özelliğe yakında bir sonraki güncellemede sahip olmayı umuyoruz.
