Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-displaying-data.po
Languages: es_mx, tr_tr

source: Displaying data from your robot
es_mx: Mostrando los datos de su robot
tr_tr: Robotunuzdan alınan verileri görüntüleme

source: Your robot can display data in regular operating modes like Teleop and Autonomous modes but you can also display the status and operate all the robot subsystems when the robot is switched to Test mode. By default you'll see two tabs when you start Shuffleboard, one for Teleop/Autonomous and another for Test mode. The currently selected tab is underlined as can be seen in the picture below.
es_mx: El robot puede mostrar datos en los modos de funcionamiento regulares como el Teleop y los modos autónomos, pero también puede mostrar el estado y operar todos los subsistemas del robot cuando éste se cambia al modo de prueba. De forma predeterminada, al iniciar Shuffleboard, verá dos pestañas, una para Teleop/Autónomo y otra para el modo Test. La pestaña actualmente seleccionada está subrayada, como se puede ver en la imagen siguiente.
tr_tr: Robotunuz verileri Teleop ve Otonom modları gibi normal çalışma modlarında görüntüleyebilir, ancak robot Test moduna geçirildiğinde durumu görüntüleyebilir ve tüm robot alt sistemlerini çalıştırabilirsiniz. Varsayılan olarak Shuffleboard'u başlattığınızda biri Teleop / Autonomous ve diğeri Test modu için olmak üzere iki sekme göreceksiniz. Şu anda seçili sekmenin altı çizilidir ve aşağıdaki resimde görüldüğü gibi.

source: Often debugging or monitoring the status of a robot involves writing a number of values to the console and watching them stream by. With Shuffleboard you can put values to a GUI that is automatically constructed based on your program. As values are updated, the corresponding GUI element changes value - there is no need to try to catch numbers streaming by on the screen.
es_mx: A menudo la depuración o la supervisión del estado de un robot implica escribir una serie de valores en la consola y verlos pasar. Con Shuffleboard puedes poner valores a un GUI que se construye automáticamente basado en tu programa. A medida que los valores se actualizan, el elemento correspondiente de la GUI cambia de valor - no hay necesidad de tratar de captar los números que pasan por la pantalla.
tr_tr: Genellikle bir robotun durumunun hata ayıklaması veya izlenmesi, konsola bir dizi değer yazmayı ve bunların akışını izlemeyi içerir. Shuffleboard ile, programınıza göre otomatik olarak oluşturulmuş bir GUI'ye değerler koyabilirsiniz. Değerler güncellendikçe, karşılık gelen GUI öğesi değeri değiştirir - ekranda akan sayıları yakalamaya gerek yoktur.

source: Displaying values in normal operating mode (autonomous or teleop)
es_mx: Visualización de los valores en el modo de funcionamiento normal (autónomo o teleoperado)
tr_tr: Değerleri normal çalışma modunda görüntüleme (otonom veya teleop)

source: You can write Boolean, Numeric, or String values to Shuffleboard by simply calling the correct method for the type and including the name and the value of the data, no additional code is required.
es_mx: Se pueden escribir valores booleanos, numéricos o de cadena en el Shuffleboard simplemente llamando al método correcto para el tipo e incluyendo el nombre y el valor de los datos, no se requiere ningún código adicional.
tr_tr: Boolean, Numeric veya String değerlerini, tür için doğru yöntemi çağırarak ve verilerin adını ve değerini dahil ederek Shuffleboard'a yazabilirsiniz, ek kod gerekmez.

source: Numeric types such as char, int, long, float or double call SmartDashboard.putNumber("dashboard-name", value).
es_mx: Tipos numéricos como char, int, long, float o doble llama SmartDashboard.putNumber("nombre de Dashboard", valor).
tr_tr: Char, int, long, float veya double call SmartDashboard.putNumber ("dashboard-name", value) gibi sayısal türler.

source: String types call SmartDashboard.putString("dashboard-name", value)
es_mx: Tipos de cadenas llama a SmartDashboard.putString("nombre de Dashboard", valor)
tr_tr: Dize türleri SmartDashboard.putString ("dashboard-name", value) çağırır.

source: Boolean types call SmartDashboard.putBoolean("dashboard-name", value)
es_mx: Tipos booleanos llama a SmartDashboard.putBoolean("nombre de Dashboard", valor)
tr_tr: Boole türleri SmartDashboard.putBoolean'ı ("dashboard-name", value) çağırır

source: Changing the display type of data
es_mx: Cambiar el tipo de datos de la pantalla
tr_tr: Verilerin görüntülenme türünü değiştirme

source: Depending on the data type of the values being sent to Shuffleboard you can often change the display format. In the previous example you can see that number values were displayed as either decimal numbers, a dial to better represent angles, and as a voltage view for the turret potentiometer. To set the display type right-click on the tile and select "Show as...". You can choose display types from the list in the popup menu.
es_mx: Dependiendo del tipo de datos de los valores que se envían a la Shuffleboard, a menudo se puede cambiar el formato de visualización. En el ejemplo anterior se puede ver que los valores numéricos se mostraron como números decimales, una manera para representar mejor los ángulos y como una vista de voltaje para el potenciómetro de la torreta. Para establecer el tipo de visualización, haga clic con el botón derecho del ratón en la ficha y seleccione "Mostrar como...". Puede elegir los tipos de visualización de la lista del menú emergente.
tr_tr: Shuffleboard'a gönderilen değerlerin veri türüne bağlı olarak ekran formatını sıklıkla değiştirebilirsiniz. Önceki örnekte, sayı değerlerinin ondalık sayılar, açıları daha iyi temsil eden bir kadran ve taret potansiyometresi için bir voltaj görünümü olarak görüntülendiğini görebilirsiniz. Görüntü türünü ayarlamak için döşemeye sağ tıklayın ve "Show as-Farklı göster ..." seçeneğini seçin. Açılır menüdeki listeden görüntüleme türlerini seçebilirsiniz.

source: Displaying data in Test mode
es_mx: Visualización de datos en el modo de prueba
tr_tr: Verileri Test modunda görüntüleme

source: You may add code to your program to display values for your sensors and actuators while the robot is in Test mode. This can be selected from the Driver Station whenever the robot is not on the field. The code to display these values is automatically generated by RobotBuilder or manually added to your program and is described in the next article. Test mode is designed to verify the correct operation of the sensors and actuators on a robot. In addition it can be used for obtaining setpoints from sensors such as potentiometers and for tuning PID loops in your code.
es_mx: Puede añadir código a su programa para mostrar los valores de sus sensores y actuadores mientras el robot está en modo de prueba. Esto puede seleccionarse desde la estación del conductor siempre que el robot no esté en el campo. El código para mostrar estos valores es generado automáticamente por RobotBuilder o añadido manualmente a su programa y se describe en el siguiente artículo. El modo de prueba está diseñado para verificar el correcto funcionamiento de los sensores y actuadores de un robot. Además, puede utilizarse para obtener puntos de ajuste de los sensores, como los potenciómetros, y para ajustar los bucles PID en su código.
tr_tr: Robot Test modundayken sensörleriniz ve aktüatörleriniz için değerleri görüntülemek için programınıza kod ekleyebilirsiniz. Bu, robot sahada olmadığında Sürücü İstasyonundan seçilebilir. Bu değerleri görüntüleyen kod, RobotBuilder tarafından otomatik olarak oluşturulur veya programınıza manuel olarak eklenir ve sonraki makalede açıklanmaktadır. Test modu, bir robot üzerindeki sensörlerin ve aktüatörlerin doğru çalıştığını doğrulamak için tasarlanmıştır. Ek olarak, potansiyometre gibi sensörlerden ayar noktaları elde etmek ve kodunuzdaki PID döngülerini ayarlamak için kullanılabilir.

source: Setting test mode
es_mx: Ajustar el modo de prueba
tr_tr: Test modunu ayarlama

source: Enable Test Mode in the Driver Station by clicking on the "Test" button and setting "Enable" on the robot. When doing this, Shuffleboard will display the status of any actuators and sensors used by your program organized by subsystem.
es_mx: Habilite el modo de prueba en la estación del conductor haciendo clic en el botón "Test" y configurando "Habilitar" en el robot. Al hacer esto, Shuffleboard mostrará el estado de los actuadores y sensores utilizados por su programa organizado por subsistema.
tr_tr: "Test" düğmesine tıklayarak ve robot üzerinde "Enable-Etkinleştir" ayarını yaparak Driver Station'da Test Modunu etkinleştirin. Bunu yaparken Shuffleboard, programınız tarafından kullanılan tüm aktüatörlerin ve sensörlerin durumunu alt sisteme göre düzenleyerek görüntüler.

source: Getting data from the Sources view
es_mx: Obtención de datos de la vista de Fuentes
tr_tr: Kaynaklar görünümünden veri alma

source: Normally :term:`NetworkTables` data automatically appears on one of the tabs and you just rearrange and use that data. Sometimes you might want to recover a value that was accidentally deleted from the tab or display a value that is not part of the SmartDashboard / NetworkTables key. For these cases the values can be dragged onto a pane from NetworkTables view under Sources on the left side of the window. Choose the value that you want to display and just drag it to the pane and it will be automatically created with the default type of widget for the data type.
es_mx: Normalmente los datos de :term:`NetworkTables` aparecen automáticamente en una de las pestañas y usted sólo tiene que reorganizar y utilizar esos datos. A veces puede querer recuperar un valor que se ha borrado accidentalmente de la pestaña o mostrar un valor que no forma parte de la clave SmartDashboard / NetworkTables. Para estos casos los valores pueden ser arrastrados a un panel de la vista de NetworkTables bajo Fuentes en el lado izquierdo de la ventana. Elija el valor que desea mostrar y simplemente arrástrelo al panel y se creará automáticamente con el tipo de widget por defecto para el tipo de datos.

source: Sometimes the Sources view is not visible on the left - it is possible to drag the divider between the tabbed panes and the Sources so the sources is not visible. If this happens move the cursor over the left edge and look for a divider resizing cursor, then left click and drag out the view. In the two images below you can see where to click and drag, and when finished the divider is as shown in the second image.
es_mx: A veces la vista de las Fuentes no es visible a la izquierda - es posible arrastrar el divisor entre los paneles con pestañas y las Fuentes para que las fuentes no sean visibles. Si esto sucede, mueva el cursor sobre el borde izquierdo y busque un cursor de cambio de tamaño del divisor, luego haga clic con el botón izquierdo y arrastre la vista. En las dos imágenes siguientes puede ver dónde hacer clic y arrastrar, y cuando termine el divisor es como se muestra en la segunda imagen.
tr_tr: Bazen Kaynaklar görünümü solda görünmez - bölücüyü sekmeli bölmeler ile Kaynaklar arasında sürükleyerek kaynakların görünmemesi mümkündür. Böyle bir durumda imleci sol kenarın üzerine getirin ve imleci yeniden boyutlandıran bölücü arayın, ardından sol tıklayın ve görünümü dışarı sürükleyin. Aşağıdaki iki resimde nereye tıklayıp sürükleyeceğinizi görebilirsiniz ve bittiğinde bölücü ikinci resimde gösterildiği gibidir.
