Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-tour.po
Languages: es_mx, tr_tr

source: Tour of Shuffleboard
es_mx: Guía por Shuffleboard
tr_tr: Shuffleboard Turu

source: Shuffleboard is a dashboard for FRC\ |reg| based on newer technologies such as JavaFX that are available to Java programs. It is designed to be used for creating dashboards for C++ and Java programs. If you've used SmartDashboard in the past then you are already familiar with many of the features of Shuffleboard since they fundamentally work the same way. But Shuffleboard has many features that aren't in SmartDashboard. Here are some of the highlights:
es_mx: La Shuffleboard es una dashboard para equipos de FRC\ |reg| basada en nuevas tecnologías como JavaFX que están disponibles para programas de Java. Está diseñada para crear dashboards para programas de C++ y Java. Si ya ha usado la SmartDashboard antes, entonces ya estará familiarizado con muchas de las funciones de la Shuffleboard, ya que trabajan fundamentalmente igual. Sin embargo, la Shuffleboard tiene muchas funciones que la SmartDashboard no tiene. Aquí hay algunos ejemplos:
tr_tr: Shuffleboard, FRC için bir panodur \ | reg | Java programlarında bulunan JavaFX gibi daha yeni teknolojileri temel alır. C ++ ve Java programları için gösterge tabloları oluşturmak için kullanılmak üzere tasarlanmıştır. Geçmişte SmartDashboard kullandıysanız, temelde aynı şekilde çalıştıkları için Shuffleboard'un birçok özelliğini zaten biliyorsunuzdur. Ancak Shuffleboard, SmartDashboard'da olmayan birçok özelliğe sahiptir. İşte bazı önemli noktalar:

source: Graphics is based on **JavaFX**, the Java graphics standard. Each of the components has an associated style sheet so it becomes possible to have different "skins" or "themes" for Shuffleboard. We supply default light and dark themes.
es_mx: Los gráficos están basados en **JavaFX**, el estándar de gráficas de Java. Cada uno de sus componentes tiene una hoja de estilos asociada, entonces se vuelve posible tener diferentes “diseños” o “temas” para la Shuffleboard. Nosotros proporcionamos los temas claro y oscuro de manera predeterminada.
tr_tr: Grafikler, Java grafik standardı olan ** JavaFX ** 'e dayanmaktadır. Bileşenlerin her birinin ilişkili bir stil sayfası vardır, böylece Shuffleboard için farklı "dış görünümlere" veya "temalara" sahip olmak mümkün hale gelir. Varsayılan açık ve koyu temalar sağlıyoruz.

source: Shuffleboard supports **multiple sheets for the display of your data**. In fact you can create a new sheet (shown as a tab in the Shuffleboard window) and indicate if and which data should be autopopulated on it. By default there is a Test tab and a SmartDashboard tab that are autopopulated as data arrives. Other tabs might be for robot debugging vs. driving.
es_mx: La Shuffleboard soporta **múltiples páginas para la mostrar tus datos**. De hecho, usted puede crear una nueva página (mostrada como una pestaña en la ventana de la Shuffleboard) e indicar si y cuales datos deben auto completar en esta. De manera predeterminada hay una pestaña de Test y una pestaña de SmartDashboard que se auto completan a medida que los datos llegan. Otras ventanas pueden ser para la depuración del robot vs. driving.
tr_tr: Shuffleboard, verilerinizin görüntülenmesi için ** birden çok sayfayı destekler **. Aslında yeni bir sayfa oluşturabilir (Shuffleboard penceresinde sekme olarak gösterilir) ve üzerinde hangi verilerin otomatik olarak doldurulup doldurulmayacağını ve hangi verilerin otomatik olarak doldurulacağını belirtebilirsiniz. Varsayılan olarak, veriler geldiğinde otomatik olarak doldurulan bir Test sekmesi ve bir SmartDashboard sekmesi vardır. Diğer sekmeler, sürüşe karşı robot hata ayıklaması olabilir.

source: Graphical **display elements (widgets) are laid out on a grid** to keep the interface clean and easy to read. You can change the grid size to have more or less resolution in your layouts and visual cues are provided to help you change your layout using drag and drop. Or you can choose to turn off the grid lines although the grid layout is preserved.
es_mx: Los **elementos de visualización gráfica (widgets) son mostrados en una cuadrícula** para mantener la interfaz ordenada y que sea fácil de leer. Puede cambiar el tamaño de la cuadrícula para que tenga una mayor o menor resolución en sus diseños y se proporcionan señales visuales para ayudarle a cambiar el diseño usando arrastrar y soltar. O usted puede elegir quitar las líneas de la cuadrícula, sin embargo el diseño de esta se mantendrá.
tr_tr: Arayüzü temiz ve okunması kolay tutmak için grafik ** görüntüleme öğeleri (widget'lar) bir ızgara ** üzerine yerleştirilmiştir. Izgara boyutunu düzenlerinizde daha fazla veya daha az çözünürlüğe sahip olacak şekilde değiştirebilirsiniz ve sürükle ve bırak kullanarak düzeninizi değiştirmenize yardımcı olmak için görsel ipuçları sağlanır. Veya ızgara düzeni korunmasına rağmen ızgara çizgilerini kapatmayı seçebilirsiniz.

source: Layouts are saved and the previous layout is instantiated by default when you run shuffleboard again.
es_mx: Los diseños son guardados y el diseño previo es instanciado de forma predeterminada cuando vuelva a iniciar la Shuffleboard.
tr_tr: Düzenler kaydedilir ve disk iteleme panosunu tekrar çalıştırdığınızda varsayılan olarak önceki düzen somutlaştırılır.

source: There is a **record and playback** feature that lets you review the data sent by your robot program after it finishes. That way you can carefully review the actions of the robot if something goes wrong.
es_mx: Existe la función de **record and playback**, grabar y repetir, que le permite revisar los datos enviados por el programa de su robot después que termina. De esta manera usted puede revisar detalladamente las acciones del robot si algo va mal.
tr_tr: Robot programınız tarafından gönderilen verileri tamamlandıktan sonra incelemenizi sağlayan bir ** record and playback-kayıt ve oynatma ** özelliği vardır. Bu şekilde, bir şeyler ters giderse robotun hareketlerini dikkatlice gözden geçirebilirsiniz.

source: **Graph widgets are available for numeric data** and you can drag data onto a graph to see multiple points at the same time and on the same scale.
es_mx: **Los widgets gráficos están disponibles para datos numéricos** y usted puede arrastrar los datos dentro de una gráfica para ver varios puntos al mismo tiempo y en la misa escala.
tr_tr: ** Grafik widget'ları sayısal veriler için kullanılabilir ** ve birden çok noktayı aynı anda ve aynı ölçekte görmek için verileri grafiğe sürükleyebilirsiniz.

source: You can extend Shuffleboard by writing your own widgets that are specific to your team's requirements. Documentation on extending it are on the `Shuffleboard GitHub Wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__.
es_mx: Puede ampliar Shuffleboard escribiendo sus propios widgets que sean específicos para los requisitos de su equipo. La documentación sobre cómo extenderla se encuentra en el `Shuffleboard GitHub Wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__.
tr_tr: Ekibinizin gereksinimlerine özel kendi widget'larınızı yazarak Shuffleboard'u genişletebilirsiniz. Genişletme belgeleri, `Shuffleboard GitHub Wiki'de <https://github.com/wpilibsuite/shuffleboard/wiki>`__.

source: **Sources area:** Here are data sources from which you can choose values from NetworkTables or other sources to display by dragging a value into one of the tabs
es_mx: **Área de orígenes:** Aquí están las fuentes de datos, usted puede elegir valores de Network – Tables o de otras fuentes para mostrar al arrastrar un valor dentro uno de las pestañas.
tr_tr: ** Sources area-Kaynaklar alanı: ** Burada, bir değeri sekmelerden birine sürükleyerek görüntülemek için NetworkTables veya diğer kaynaklardan değerler seçebileceğiniz veri kaynakları verilmiştir.

source: **Tab panes:** This is where you data is displayed from the robot or other sources. In this example it is Test-mode subsystems that are shown here in the LiveWindow tab. This area can show any number of tabbed windows, and each window has it's own set of properties like grid size and auto-populate.
es_mx: **Paneles de pestañas:** Aquí es donde sus datos son mostrados desde el robot u otras fuentes. En este ejemplo se muestran los subsistemas de Test-mode en la pestaña de LiveWindow. Este área puede mostrar cualquier número de ventanas, y cada ventana tiene su propio conjunto de propiedades, como el tamaño de la cuadrícula y la función auto completar.
tr_tr: ** Tab panes-Sekme bölmeleri: ** Burası, robottan veya diğer kaynaklardan gelen verilerinizin görüntülendiği yerdir. Bu örnekte, burada LiveWindow sekmesinde gösterilen Test modu alt sistemleridir. Bu alan, herhangi bir sayıda sekmeli pencere gösterebilir ve her pencere, ızgara boyutu ve otomatik doldurma gibi kendi özellik kümesine sahiptir.

source: **Record/playback controls:** set of media-like controls where you can playback the current session to see historical data
es_mx: **Controles de Record /Playback:** conjunto de controles donde usted puede repetir la sesión actual para ver el historial de datos.
tr_tr: **Kayıt / oynatma kontrolleri: ** Geçmiş verileri görmek için mevcut oturumu oynatabileceğiniz ortam benzeri kontroller seti

source: Starting Shuffleboard
es_mx: Iniciar la Shuffleboard
tr_tr: Shuffleboard'u Başlatma

source: You can start Shuffleboard in one of four ways:
es_mx: Usted puede iniciar la Shuffleboard con una de cuatro maneras:
tr_tr: Shuffleboard'u dört yoldan biriyle başlatabilirsiniz:

source: You can automatically start it when the Driver Station starts by setting the "Dashboard Type" to Shuffleboard in the settings tab as shown in the picture above.
es_mx: Puede iniciarla automáticamente cuando la Driver Station inicia al configurar el “Dashboard Type” seleccionando la opción Shuffleboard en la pestaña de configuraciones, como se muestra en la foto de arriba.
tr_tr: Driver Station başladığında, yukarıdaki resimde gösterildiği gibi ayarlar sekmesinde "Dashboard Type" öğesini Shuffleboard olarak ayarlayarak otomatik olarak başlatabilirsiniz.

source: You can run it by double-clicking the Shuffleboard icon on the Windows Desktop.
es_mx: Puede iniciarla al dar doble click en el ícono de Shuffleboard en el Escritorio de Windows.
tr_tr: Windows Masaüstündeki Shuffleboard simgesine çift tıklayarak çalıştırabilirsiniz.

source: You can run it by double-clicking on the shuffleboard.XXX file (where XXX is ``.vbs`` on Windows and ``.py`` on Linux or macOS) in ``~/WPILib/YYYY/tools/`` (where YYYY is the year and ~ is ``C:\Users\Public`` on Windows). This is useful on a development system that does not have the Driver Station installed such as a macOS or Linux system.
es_mx: Puede ejecutarlo haciendo doble clic en el archivo shuffleboard.XXX (donde XXX es ``.vbs`` en Windows y ``.py`` en Linux o macOS) en ``~/WPILib/YYYY/tools/`` (donde YYYY es el año y ~ es ``C:\Users\Public`` en Windows). Esto es útil en un sistema de desarrollo que no tiene la Driver Station instalada, como un sistema macOS o Linux.
tr_tr: ``~/ WPILib / YYYY / tools /`` dizininde shuffleboard. XXX dosyasına (Windows'ta XXX `` .vbs`` ve Linux veya macOS'ta`` .py`` olduğu) çift tıklayarak çalıştırabilirsiniz. (YYYY yılıdır ve ~ Windows'ta ``C: \ Users \ Public`` şeklindedir). Bu, macOS veya Linux sistemi gibi Driver Station'ın kurulu olmadığı bir geliştirme sisteminde kullanışlıdır.

source: You can start it from the command line by typing the command: ``shuffleboard`` on Windows or ``python shuffleboard.py`` on macOS or Linux from ``~/WPILib/YYYY/tools`` directory (where YYYY is the year and ~ is ``C:\Users\Public`` on Windows). This is often easiest on a a development system that doesn't have the Driver Station installed.
es_mx: Puede iniciarla desde la línea de comando al escribir el comando: ``shuffleboard`` en Windows o ``python shuffleboard.py`` en macOS o Linux desde el directorio ``~/WPILib/YYYY/tools`` (donde YYYY es el año y ~ es``C:\Users\Public`` en Windows). Esto es lo más fácil en un sistema operativo que no tiene la Driver Station instalada.
tr_tr: Komut satırından Windows'ta ``shuffleboard`` veya macOS veya Linux'ta `` ~ / WPILib / YYYY / tools`` dizininden (YYYY yıl ve ~ Windows'ta `` C: \ Users \ Public``). Bu, Driver Station yüklü olmayan bir geliştirme sisteminde genellikle en kolayıdır.

source: The ``.vbs`` (Windows) and ``.py`` (macOS/Linux) scripts help launch the tools using the correct JDK.
es_mx: Los scripts ``.vbs`` (Windows) y ``.py`` (macOS/Linux) ayudan a iniciar las herramientas utilizando el JDK correcto.
tr_tr: ".vbs`` (Windows) ve ``.py `` (macOS / Linux) komut dosyaları, doğru JDK kullanılarak araçların başlatılmasına yardımcı olur.

source: Getting robot data onto the dashboard
es_mx: Ingresar datos del robot en la Dashboard.
tr_tr: Robot verilerini kontrol paneline alma

source: The easiest way to get data displayed on the dashboard is simply to use methods in the SmartDashboard class. For example to write a number to Shuffleboard write:
es_mx: La manera más fácil de obtener datos mostrados en la dashboard es simplemente usar los métodos en la clase SmartDashboard. Por ejemplo, para escribir un número en la Shuffleboard escriba:
tr_tr: Gösterge tablosunda görüntülenen verileri almanın en kolay yolu, SmartDashboard sınıfındaki yöntemleri kullanmaktır. Örneğin Shuffleboard'a bir sayı yazmak için şunu yazın:

source: to see a field displayed with the label "Joystick X value" and a value of the X value of the joystick. Each time this line of code is executed, a new joystick value will be sent to Shuffleboard. Remember: you must write the joystick value whenever you want to see an updated value. Executing this line once at the start of the program will only display the value once at the time the line of code was executed.
es_mx: para ver un campo desplegado con la etiqueta “ Joystick X value” y un valor del valor X del joystick. Cada vez que esta línea de código es ejecutada, un nuevo valor del Joystick será enviado a la Shuffleboard. Recuerde: debe escribir el valor del joystick cuando quiera ver un valor actualizado. Al ejecutar esta línea una vez al inicio del programa solo mostrará el valor una vez al momento en que la línea de código fue ejecutada.
tr_tr: "Joystick X value" etiketi ve joystick'in X değeri değeri ile görüntülenen bir alanı görmek için. Bu kod satırı her yürütüldüğünde, Shuffleboard'a yeni bir joystick değeri gönderilecektir. Unutmayın: Güncellenmiş bir değer görmek istediğinizde joystick değerini yazmalısınız. Programın başlangıcında bu satırı bir kez çalıştırmak, değeri kod satırının çalıştırıldığı anda yalnızca bir kez görüntüleyecektir.
