Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-lists.po
Languages: es_mx, tr_tr

source: Working with Lists
es_mx: Trabajando con Listas
tr_tr: Listelerle Çalışma

source: Lists are sets of tiles that are be logically grouped together in a vertical layout. When tiles are added to a list,it becomes visually obvious that the tiles are related in function. In addition tiles in lists take up less screen space than the same tiles directly on the desktop because tiles in a list don't display the dark window title, but instead display a smaller textual label documenting the contents of the list.
es_mx: Las listas son conjuntos de teselas/tiles que se agrupan lógicamente en una disposición vertical. Cuando se añaden teselas a una lista, se hace visualmente obvio que las tiles están relacionadas en función. Además, las teselas de las listas ocupan menos espacio en la pantalla que las mismas tiles directamente en el escritorio porque las teselas de una lista no muestran el título de la ventana oscura, sino que muestran una etiqueta textual más pequeña que documenta el contenido de la lista.
tr_tr: Listeler, mantıksal olarak dikey bir düzende birlikte gruplanan döşeme kümeleridir. Bir listeye döşemeler eklendiğinde, döşemelerin işlev açısından ilişkili olduğu görsel olarak açık hale gelir. Buna ek olarak, listelerdeki döşemeler, doğrudan masaüstündeki aynı döşemelerden daha az ekran alanı kaplar çünkü bir listedeki döşemeler karanlık pencere başlığını göstermez, bunun yerine listenin içeriğini belgeleyen daha küçük bir metin etiketi görüntüler.

source: Creating a list
es_mx: Creando una lista
tr_tr: Bir liste oluşturmak

source: A list can be created by: 1. Right-clicking on the first tile that should go into the list. 2. Select the "Add to new layout..." option from the popup menu. 3. A new list will be created called "List" and the tile will be at the top of it. Notice that tiles in lists do not have the window title at the top, but instead have the text that was in the window title.
es_mx: Una lista puede ser creada: 1. Haciendo clic con el botón derecho del ratón en el primer azulejo que debe ir en la lista. 2. Seleccionar la opción "Añadir a la nueva disposición..." del menú emergente. 3. Se creará una nueva lista llamada "Lista" y el tile estará en la parte superior de la misma. Note que las teselas de las listas no tienen el título de la ventana en la parte superior, sino que tienen el texto que estaba en el título de la ventana.
tr_tr: Bir liste şu şekilde oluşturulabilir: 1. Listeye girmesi gereken ilk döşemeye sağ tıklayın. 2. Açılır menüden "Add to new layout-Yeni düzene ekle ..." seçeneğini seçin. 3. "List-Liste" adında yeni bir liste oluşturulacak ve döşeme en üstünde olacaktır. Listelerdeki kutucukların üstte pencere başlığına sahip olmadığına, bunun yerine pencere başlığındaki metne sahip olduğuna dikkat edin.

source: Adding tiles to a list
es_mx: Agregar tiles/teselas a una lista
tr_tr: Bir listeye karo ekleme

source: Add tiles to a list layout by: 1. identify the list and the tile to be added. 2. Drag the new tile onto the list. 3. The tile will be added to the list. If there is no room as the list is currently sized, the tile will be added off the end of the list and a vertical scrollbar will be added if it's not already there.
es_mx: Agregar tiles a un diseño de lista por: 1. Identificar la lista y el tile que se va a añadir. 2. 3. Arrastrar la nueva tesela a la lista. 3. La tesela se añadirá a la lista. Si no hay espacio en la lista, el tile/tesela se añadirá al final de la lista y se añadirá una barra de desplazamiento vertical si no está ya allí.
tr_tr: Bir liste düzenine döşemeleri şu şekilde ekleyin: 1. Eklenecek döşemeyi ve listeyi tanımlayın. 2. Yeni döşemeyi listeye sürükleyin. 3. Döşeme listeye eklenecektir. Liste şu anda boyutlandırıldığı için oda yoksa, döşeme listenin sonuna eklenecek ve zaten orada değilse dikey bir kaydırma çubuğu eklenecektir.

source: Rearranging tiles in a list
es_mx: Reorganizar tiles en una lista
tr_tr: Bir listedeki kutucukları yeniden düzenleme

source: Tiles in a list can be rearranged by right-clicking on the tile to be moved and selecting:
es_mx: Los tiles/teselas de una lista se pueden reorganizar haciendo clic con el botón derecho del ratón en el tile que se va a mover y seleccionar:
tr_tr: Bir listedeki döşemeler, taşınacak döşemeye sağ tıklayarak ve aşağıdakiler seçilerek yeniden düzenlenebilir:

source: "Move up" to move the tile before the previous tile
es_mx: "Mover arriba" para mover el tile anterior al anterior
tr_tr: Döşemeyi önceki döşemeden önce taşımak için "Move up-Yukarı taşı"

source: "Move down" to move the tile after the next tile
es_mx: "Mover hacia abajo" para mover el tile después de la siguiente tile/tesela
tr_tr: Döşemeyi bir sonraki döşemeden sonra taşımak için "Move down-Aşağı taşı"

source: "Send to top" to move the tile to the top of the list
es_mx: "Enviar a la cima" para mover el tile a la cima de la lista
tr_tr: Parçayı listenin en üstüne taşımak için "Send to top-Başa gönder"

source: "Send to bottom" to move the tile to the bottom of the list
es_mx: "Enviar al fondo" para mover el tile/tesela al final de la lista
tr_tr: Döşemeyi listenin en altına taşımak için "Send to bottom-En alta gönder"

source: "Remove from list" to delete the tile from the list.
es_mx: "Eliminar de la lista" para eliminar el tile/tesela de la lista.
tr_tr: Döşemeyi listeden silmek için "Remove from list-Listeden kaldır".

source: Renaming a list
es_mx: cambiando el nombre de una lista
tr_tr: Listeyi yeniden adlandırma

source: You can rename a list by double-clicking on the list title and changing the name. Click outside fo the title to save the changes
es_mx: Puedes cambiar el nombre de una lista haciendo doble clic en el título de la lista y cambiando el nombre. Haga clic fuera del título para guardar los cambios
tr_tr: Liste başlığına çift tıklayarak ve adını değiştirerek listeyi yeniden adlandırabilirsiniz. Değişiklikleri kaydetmek için başlığın dışına tıklayın
