Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-graphs.po
Languages: es_mx

source: Working with Graphs
es_mx: Trabajando con gráficos

source: With Shuffleboard you can graph numeric values over time. Graphs are very. useful to see how sensor or motor values are changing as your robot is operating. For example the sensor value can be graphed in a PID loop to see how it is responding during tuning.
es_mx: Con Shuffleboard se pueden graficar valores numéricos a lo largo del tiempo. Los gráficos son muy útiles para ver cómo cambian los valores de los sensores o motores mientras el robot está operando. Por ejemplo, el valor del sensor se puede graficar en un bucle PID para ver cómo está respondiendo durante la sintonización.

source: To create a graph, choose a numeric value and right-click in the heading and select "Show as..." and then choose graph
es_mx: Para crear un gráfico, elija un valor numérico y haga clic con el botón derecho del ratón en el encabezado y seleccione "Mostrar como..." y luego elija el gráfico

source: The graph widget shows line plots of the value that you selected. It will automatically set the scale and the default time interval that the graph will show will be 30 seconds. You can change that in the setting for the graph (see below).
es_mx: El widget de gráficos muestra gráficos lineales del valor que has seleccionado. Establecerá automáticamente la escala y el intervalo de tiempo por defecto que mostrará el gráfico será de 30 segundos. Puedes cambiar esto en la configuración del gráfico (ver más abajo).

source: Adding Additional Data Values
es_mx: Adición de valores de datos adicionales

source: For related values it is often desirable to show multiple values on the same graph. To do that, simply drag additional values from the NetworkTables source view (left side of the Shuffleboard window) and drop it onto the graph and that value will be added as shown below. You can continue to drag additional values onto the graph.
es_mx: Para los valores relacionados, a menudo es deseable mostrar múltiples valores en el mismo gráfico. Para ello, simplemente arrastre valores adicionales desde la vista de origen de NetworkTables (lado izquierdo de la ventana de Shuffleboard) y suéltelos en el gráfico y ese valor se añadirá como se muestra a continuación. Puede continuar arrastrando valores adicionales al gráfico.

source: You can resize the graph vertically to view the legend if it is not displayed as shown in the image below. The legend shows all the sources that are used in the plot.
es_mx: Puede cambiar el tamaño del gráfico verticalmente para ver la leyenda si no se muestra como se muestra en la imagen de abajo. La leyenda muestra todas las fuentes que se utilizan en el gráfico.

source: Setting Graph Properties
es_mx: Configuración de las propiedades de los gráficos

source: You can set the number of seconds that are shown in the graph by changing the "Visible time" in the graph widget properties. To access the properties, right-click on the graph and select "Edit properties".
es_mx: Puedes establecer el número de segundos que se muestran en el gráfico cambiando el "Tiempo visible" en las propiedades del widget del gráfico. Para acceder a las propiedades, haz clic con el botón derecho del ratón en el gráfico y selecciona "Editar propiedades".

source: In addition to setting the visible time the graph can selectively turn sources on and off by turning the switch on and off for each of the sources shown in the properties window (see below).
es_mx: Además de establecer el tiempo visible, el gráfico puede encender y apagar selectivamente las fuentes al encender y apagar el interruptor para cada una de las fuentes que se muestran en la ventana de propiedades (véase más abajo).
