Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-faq.po
Languages: es_mx, tr_tr

source: Shuffleboard FAQ, issues, and bugs
es_mx: Preguntas frecuentes, problemas y errores de Shuffleboard
tr_tr: Shuffleboard SSS, sorunlar ve hatalar

source: Shuffleboard as well as most of the other control system components were developed with Java 11 and will not work with Java 8. Be sure before reporting problems that your computer has Java 11 installed and is set as the default Java Environment.
es_mx: El Shuffleboard así como la mayoría de los otros componentes del sistema de control fueron desarrollados con Java 11 y no funcionarán con Java 8. Asegúrate antes de reportar problemas que tu computadora tiene Java 11 instalado y esté configurado con Java Environment que tiene por defecto.
tr_tr: Shuffleboard ve diğer kontrol sistemi bileşenlerinin çoğu Java 11 ile geliştirilmiştir ve Java 8 ile çalışmayacaktır. Sorunları bildirmeden önce bilgisayarınızda Java 11'in kurulu olduğundan ve varsayılan Java Ortamı olarak ayarlandığından emin olun.

source: Frequently Asked Questions
es_mx: Preguntas frecuentes
tr_tr: Sıkça Sorulan Sorular

source: How do I report issues, bugs or feature requests with Shuffleboard?
es_mx: ¿Cómo puedo informar de problemas, errores o solicitudes de funciones con Shuffleboard?
tr_tr: Shuffleboard ile sorunları, hataları veya özellik isteklerini nasıl bildirebilirim?

source: Bugs, issues, and feature requests can be added on the Shuffleboard GitHub page by creating an issue. We will try to address them as they are entered into the system. Please try to look at existing issues before creating new ones to make sure you aren't duplicating something that has already been reported or work that is planned. You can find the issues on the `Shuffleboard GitHub page <https://github.com/wpilibsuite/shuffleboard>`__.
tr_tr: Hatalar, sorunlar ve özellik istekleri Shuffleboard GitHub sayfasına bir sorun oluşturarak eklenebilir. Sisteme girdiklerinde onları ele almaya çalışacağız. Önceden bildirilmiş bir şeyi veya planlanan işi kopyalamadığınızdan emin olmak için yenilerini oluşturmadan önce lütfen mevcut sorunlara bakmayı deneyin. Sorunları, Shuffleboard GitHub sayfasında <https://github.com/wpilibsuite/shuffleboard> "__ bulabilirsiniz..

source: How can I add my own widgets or other extensions to Shuffleboard?
es_mx: ¿Cómo puedo añadir mis propios widgets u otras extensiones a Shuffleboard?
tr_tr: Shuffleboard'a kendi widget'larımı veya diğer uzantılarımı nasıl ekleyebilirim?

source: The `Shuffleboard wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__ has a large amount of documentation on extending the program with custom plugins. In the future we will be posting a sample plugin project that can be used for additional custom widgets, but for now the wiki documentation is complete.
es_mx: El `Shuffleboard wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__ tiene una gran cantidad de documentación sobre la ampliación del programa con plugins personalizados. En el futuro publicaremos un proyecto de plugin de muestra que puede ser usado para widgets personalizados adicionales, pero por ahora la documentación del wiki está completa.
tr_tr: `Shuffleboard wiki <https://github.com/wpilibsuite/shuffleboard/wiki>" __, programı özel eklentilerle genişletme konusunda çok sayıda belgeye sahiptir. Gelecekte, ek özel widget'lar için kullanılabilecek örnek bir eklenti projesi yayınlayacağız, ancak şimdilik wiki belgeleri tamamlandı.

source: How can I build Shuffleboard from the source code?
es_mx: ¿Cómo puedo construir el Shuffleboard desde el código fuente?
tr_tr: Shuffleboard'u kaynak koddan nasıl oluşturabilirim?

source: You can get the source code by downloading, cloning, or forking the repository on the GitHub site. To build and run Shuffleboard from the source, make sure that the current directory is the top level source code and use one of these commands:
es_mx: Puedes obtener el código fuente descargándolo, clonándolo o bifurcando el depósito en el sitio de GitHub. Para construir y ejecutar Shuffleboard desde el código fuente, asegúrate de que el directorio actual es el código fuente de nivel superior y utiliza uno de estos comandos:
tr_tr: Kaynak kodunu GitHub sitesinde indirerek, klonlayarak veya öğrenerek elde edebilirsiniz. Shuffleboard'u kaynaktan derleyip çalıştırmak için, geçerli dizinin en üst düzey kaynak kodu olduğundan emin olun ve şu komutlardan birini kullanın:

source: Application
es_mx: Aplicación
tr_tr: Uygulama

source: Command (for Windows systems run the gradlew.bat file)
es_mx: Comando (para los sistemas de Windows ejecute el archivo gradlew.bat)
tr_tr: Komut (Windows sistemleri için gradlew.bat dosyasını çalıştırın)

source: Running Shuffleboard
es_mx: Correr Shuffleboard
tr_tr: Shuffleboard'u Çalıştırma

source: ./gradlew :app:run
tr_tr: ./gradlew: app: çalıştır

source: Building the APIs and utility classes for plugin creation
es_mx: Construir las API y las clases de utilidad para la creación de plugins
tr_tr: Eklenti oluşturma için API'leri ve yardımcı program sınıflarını oluşturma

source: Building the complete application jar file
es_mx: Construyendo el archivo completo de la aplicación
tr_tr: Eksiksiz jar uygulama dosyasını oluşturma

source: Bugs, issues, and feature requests can be added on the Shuffleboard Github page by creating an issue. We will try to address them as they are entered into the system. Please try to look at existing issues before creating new ones to make sure you aren't duplicating something that has already been reported or work that is planned. You can find the issues on the `Shuffleboard GitHub page <https://github.com/wpilibsuite/shuffleboard>`__.
es_mx: Los errores, problemas y solicitudes de características pueden ser añadidos en la página de Shuffleboard Github creando un problema. Intentaremos solucionarlos a medida que se introduzcan en el sistema. Por favor, intenta mirar los problemas existentes antes de crear otros nuevos para asegurarte de que no estás duplicando algo que ya ha sido reportado o un trabajo que está planeado. Puedes encontrar los problemas en la `Página de Shuffleboard GitHub <https://github.com/wpilibsuite/shuffleboard>`__.
