Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/networktables/client-side-program.po
Languages: es_mx, fr_ca, zh_cn

source: Creating a client-side program
es_mx: Creando un programa personalizado
fr_ca: Création d'un programme côté client
zh_cn: 创建客户端程序

source: If all you need to do is have your robot program communicate with GRIP or a dashboard running on the Driver Station laptop, then the previous examples of writing robot programs are sufficient. But if you would like to write some custom client code that would run on the drivers station or on a coprocessor then you need to know how to build :term:`NetworkTables` programs for those (non-roboRIO) platforms.
es_mx: Si todo lo que necesitas es que tu programa de robot se comunique con GRIP o con un dashboard que se ejecute en la laptop de la Driver Station, entonces los ejemplos anteriores de escritura de programas de robot son suficientes. Pero si quieres escribir algún código de cliente personalizado que se ejecute en la estación de controladores o en un coprocesador, entonces necesitas saber cómo construir programas :term:`NetworkTables` para esas plataformas (que no son de RoboRIO).
fr_ca: Si tout ce que vous avez à faire est de faire communiquer votre programme de robot avec GRIP ou un tableau de bord fonctionnant sur l'ordinateur portable de Driver Station, les exemples précédents d'écriture de programmes de robot sont suffisants. Mais si vous souhaitez écrire un code client personnalisé qui s'exécuterait sur la station de pilotes ou sur un coprocesseur, vous devez savoir comment construire des programmes avec des :term:`NetworkTables` pour ces plates-formes (non roboRIO).
zh_cn: 如果您要做的只是让机器人程序与GRIP或在机器操控台笔记本电脑上运行的仪表板通信，那么前面编写机器人程序的示例就足够了。但是，如果您想编写一些可在驱动程序站或协处理器上运行的自定义客户端代码，则需要知道如何为那些（非roRIO）平台构建NetworkTables程序。

source: A basic client program looks like the following example.
es_mx: Un programa personalizado básico es como el siguiente ejemplo.
fr_ca: Un programme client de base ressemble à l'exemple suivant.
zh_cn: 基本的客户端程序如下例所示。

source: In this example an instance of NetworkTables is created and a NetworkTableEntry if created to reference the values of "x" and "y" from a table called "datatable".
es_mx: En este ejemplo una instancia de una Tabla de Enrutamiento es creada y una entrada de Tabla de Enrutamiento es creada para referenciar valores de “x” y “y” de una tabla llamada “datatable”.
fr_ca: Dans cet exemple, une instance de NetworkTables est créée et un NetworkTableEntry s'il est créé pour référencer les valeurs de "x" et "y" à partir d'une table appelée "datatable".
zh_cn: 在本例中，创建了网络表实例，并创建了网络表条目来引用名为“datatable”的表中的“x”和“y”值。

source: Then this instance is started as a NetworkTables client with the team number (the roboRIO is always the server). Additionally, if the program is running on the Driver Station computer, by using the startDSClient() method, NetworkTables will get the robot IP address from the Driver Station.
es_mx: A continuación, esta instancia se inicia como cliente de NetworkTables con el número de equipo (el roboRIO es siempre el servidor). Además, si el programa se ejecuta en la Driver Station, mediante el método startDSClient(), NetworkTables obtendrá la dirección IP del robot de la Driver Station.
fr_ca: Ensuite, cette instance est démarrée en tant que client NetworkTables avec le numéro d'équipe (le roboRIO est toujours le serveur). De plus, si le programme est en cours d'exécution sur l'ordinateur de Driver Station, en utilisant la méthode startDSClient (), NetworkTables obtiendra l'adresse IP du robot à partir de Driver Station.
zh_cn: 然后，该实例作为具有组号的NetworkTables客户端启动（roboRIO始终是服务器）。此外，如果程序在机器操控台计算机上运行，则使用startDSClient（）方法，NetworkTables将从机器操控台获取机械手IP地址。

source: Then this sample program simply loops once a second and gets the values for x and y and prints them on the console. In a more realistic program, the client might be processing or generating values for the robot to consume.
es_mx: Luego este programa de muestra simplemente se repite una vez por segundo y obtiene los valores de “x” y “y” y los captura en la consola. En un programa más realista, el cliente podría estar procesando o generando valores para que el robot los consuma.
fr_ca: Ensuite, ce programme boucle simplement une fois par seconde et obtient les valeurs de x et y et les imprime sur la console. Dans un programme plus réaliste, le client pourrait traiter ou générer des valeurs calculés de ces lectures et les retourner au robot.
zh_cn: 然后，此示例程序简单地每秒循环一次，获取x和y的值并将其打印在控制台上。在现实的程序中，客户端可能正在处理或生成供机器人使用的值。

source: Building the program
es_mx: Compilando el programa
fr_ca: La construction du programme
zh_cn: 构建程序

source: When building and running the program you will need some additional libraries to include with your client-side program. These are:
es_mx: Al compilar y ejecutar el programa usted requerirá algunas librerías adicionales a incluir en su programa client-side. Son las siguientes:
fr_ca: Lors de la création et de l'exécution du programme, vous aurez besoin de bibliothèques supplémentaires à inclure dans votre programme côté client. Ceux-ci sont:
zh_cn: 在构建和运行程序时，您的客户端程序需要包含一些额外的库。下面列出了这些库：

source: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/ntcore/ntcore-java/ (ntcore Java files)
es_mx: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/ntcore/ntcore-java/ (archivos ntcore de Java)
zh_cn: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/ntcore/ntcore-java/（ntcore Java文件）

source: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/ntcore/ntcore-jni/ (ntcore native libs for all desktop platforms)
es_mx: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/ntcore/ntcore-jni/ (ntcore native librerías para todas las plataformas de escritorio)
fr_ca: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/ntcore/ntcore-jni/ (bibliothèques natives ntcore pour toutes les plates-formes de bureau)
zh_cn: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/ntcore/ntcore-jni/（适用于所有台式机平台的ntcore原生库）

source: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/wpiutil/wpiutil-java/ (wpiutil Java files)
es_mx: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/wpiutil/wpiutil-java/ (archivos wpiutil de Java)
zh_cn: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/wpiutil/wpiutil-java/（wpiutil Java文件）

source: The desktop platform jar is for Windows, macOS, and Linux.
es_mx: La aplicación jar de escritorio es para Windows, macOS, and Linux.
fr_ca: Le fichier JAR fonctionne sous Windows, macOS et Linux.
zh_cn: 桌面平台的jar包适用于Windows，macOS和Linux。

source: Building using Gradle
es_mx: Compilando usando using Gradle
fr_ca: Construire avec Gradle
zh_cn: 使用Gradle构建

source: The dependencies above can be added to the ``dependencies`` block in a ``build.gradle`` file. The ``ntcore-java`` and ``wpiutil-java`` libraries are required at compile-time and the JNI dependencies are required at runtime. The JNI dependencies for all supported platforms should be added to the ``build.gradle`` if cross-platform support for the application is desired.
es_mx: Las dependencias de arriba pueden ser añadidas al bloque de dependencias en un archivo de complilación gradle. Las liberias ntcore-java and wpiutil-java son requeridas en compile-time y las dependencias JNI son requeridas en el runtime. Las dependencias JNI para todas las plataformas deberán ser añadidas al build-gradle si el soporte de la multiplataforma para la aplicación es deseada.
fr_ca: Les dépendances ci-dessus peuvent être ajoutées au bloc ``dependencies`` dans un fichier ``build.gradle``. Les librairies ``ntcore-java`` et ``wpiutil-java`` sont requises au moment de la compilation et les dépendances JNI sont requises au moment de l'exécution. Les dépendances JNI pour toutes les plates-formes prises en charge doivent être rajoutées au ``build.gradle`` si une prise en charge multiplateforme de l'application est souhaitée.
zh_cn: 以上依赖项可被添加到build.gradle文件中的dependencies块中。在编译时需要ntcore-java和wpiutil-java库，而在运行时则需要JNI依赖项。如果需要对应用程序的跨平台支持，则应将所有受支持平台的JNI依赖项添加到build.gradle中。

source: First, the FRC\ |reg| Maven repository should be added to the ``repositories`` block. Note that this is not required if you are using the GradleRIO plugin with your application.
es_mx: Primero, el repositorio FRC\ |reg| Maven debe ser añadido al bloque ``repositories``. Nota, esto no es requerido si se esta usando el plugin GradleRIO en la aplicación.
fr_ca: Tout d’abord, le repertoire Maven FRC\ |reg| doit être ajouté au bloc ``repositories``. Notez que cela n’est pas nécessaire si vous utilisez le plugin GradleRIO avec votre application.
zh_cn: 首先，FRC® Maven存储库应被添加到repositories块中。请注意，如果您在应用程序中使用GradleRIO插件，则不必这样做。

source: Then, the dependencies can be added to the ``dependencies`` block. Here, ``VERSION`` should be replaced with the latest version number of the following dependencies. This usually corresponds to the version number of the latest WPILib release.
es_mx: Entonces, las dependencias pueden ser añadidas al bloque de dependencias. La versión deberá ser reemplazada con el número de versión más actualizada. Esto usualmente corresponde al número de versión más actualizada de WPILib.
fr_ca: Ensuite, les dépendances peuvent être ajoutées au bloc ``dependencies``. Ici, ``VERSION`` doit être remplacé par le dernier numéro de version des dépendances suivantes. Cela correspond généralement au numéro de version de la dernière version de WPILib.
zh_cn: 然后，可以将依赖项添加到dependencies块中。每一个依赖项的“VERSION”应替换为该依赖项的最新版本号。这通常与最新的WPILib版本的版本号一致。
