Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/networktables/networktables-intro.po
Languages: es_mx, fr_ca, zh_cn

source: What is NetworkTables
es_mx: ¿Qué es una Tabla de Enrutamiento?
fr_ca: Que sont les NetworkTables?
zh_cn: 什么是网络表

source: :term:`NetworkTables` is an implementation of a distributed "dictionary". That is named values are created either on the robot, driver station, or potentially an attached coprocessor, and the values are automatically distributed to all the other participants. For example, a driver station laptop might receive camera images over the network, perform some vision processing algorithm, and come up with some values to sent back to the robot. The values might be an X, Y, and Distance. By writing these results to NetworkTables values called "X", "Y", and "Distance" they can be read by the robot shortly after being written. Then the robot can act upon them.
es_mx: :term:`NetworkTables` es una implementación de un "diccionario" distribuido. Es decir, los valores con nombre se crean en el robot, en la Driver Station o, potencialmente, en un coprocesador conectado, y los valores se distribuyen automáticamente a todos los demás participantes. Por ejemplo, una Driver Station puede recibir imágenes de la cámara a través de la red, realizar algún algoritmo de procesamiento de la visión y obtener algunos valores para enviarlos al robot. Los valores podrían ser un X, Y, y la distancia. Escribiendo estos resultados en valores de NetworkTables llamados "X", "Y", y "Distancia" pueden ser leídos por el robot poco después de ser escritos. Entonces el robot puede actuar sobre ellos.
fr_ca: Les :term:`NetworkTables` sont une implémentation d'un" dictionnaire "distribué. Les valeurs nommées sont créées sur le robot, le poste de pilotage ou éventuellement un coprocesseur connecté, et les valeurs sont automatiquement distribuées à tous les autres participants. Par exemple, un ordinateur portable de poste de pilotage peut recevoir des images de caméra sur le réseau, exécuter un algorithme de traitement de la vision et proposer des valeurs à renvoyer au robot. Les valeurs peuvent être X, Y et Distance. En écrivant ces résultats dans des valeurs NetworkTables appelées «X», «Y» et «Distance», ils peuvent être lus par le robot peu de temps après avoir été écrits. Ensuite, le robot peut agir sur eux.
zh_cn: 网络表是分布式“字典”的实现。即在机器人，驾驶员站或可能的附加协处理器上创建命名值，并将这些值自动分发给所有其他参与方。例如，一个驾驶台笔记本电脑可能会通过网络接收相机图像，执行一些视觉处理算法，并计算出返回机器人的值。这些值可能是“X”，“Y”和“Distance”。通过将这些结果写入网络表值“ X”，“ Y”和“ Distance”，它们可以在写入后不久由机器人读取，此后机器人可对它们进行操作。

source: NetworkTables can be used by programs on the robot in either C++, Java or LabVIEW and is built into each version of WPILib.
es_mx: Las tablas de enrutamiento pueden ser usadas por programas en el robot ya sea C++, Java o LabView e integradas en cada versión de WPILib.
fr_ca: Les NetworkTables peuvent être utilisées par des programmes écrits en C++, Java ou LabVIEW à bord du robot.
zh_cn: 网络表可以由C ++，Java或LabVIEW中的机械手程序使用，它内置于WPILib的每个版本。

source: NetworkTables organization
es_mx: Organización de NetworkTables
fr_ca: L'organisation des NetworkTables
zh_cn: 网络表结构

source: Data is organized in NetworkTables in a hierarchy much like a directory on disk with folders and files. For any instance of NetworkTables there can be multiple values and subtables that may be nested in whatever way fits the data organization desired. Subtables actually are represented as a long key with slashes (/) separating the nested subtable and value key names. Each value has a key associated with it that is used to retrieve the value. For example, you might have a table called **datatable** as shown in the following examples. Within a **datatable** there are two keys, X and Y and their associated values. The OutlineViewer is a good utility for exploring the values stored in NetworkTables while a program is running.
es_mx: En una tabla de enrutamiento los datos están organizados en una jerarquía parecida a un directorio en un disco con carpetas y archivos. En cualquier instancia de la tabla de enrutamiento puede haber múltiples valores y subtablas que pueden ser anidadas de cualquier forma deseada que se acomode a la organización de los datos. Las subtablas son representadas por paréntesis con diagonal (/) separando la subtabla anidada y los valores de los índices. Cada valor tiene un índice asociado con el que es usado para obtener el valor. Por ejemple, usted podría tener una tabla llamada DataTable como se muestra en los siguientes ejemplos. Dentro de la DataTable se tienen 2 índices, X y Y con sus valores asociados. El OutlineViewer es una buena herramienta para explorar los valores guardados en la tabla de enrutamiento mientras el programa está en ejecución.
fr_ca: Les données sont organisées dans les NetworkTables dans une hiérarchie un peu comme un répertoire sur disque avec des dossiers et des fichiers. Pour toute instance de NetworkTables, il peut y avoir plusieurs valeurs et sous-tables qui peuvent être imbriquées de la manière qui convient le mieux pour une organisation de données souhaitée. Les sous-tables sont en fait représentées comme une clé longue (long key) avec des barres obliques (/) séparant les noms de clé de sous-table et de valeur imbriqués. Chaque valeur est associée à une clé qui est utilisée pour récupérer la valeur. Par exemple, vous pouvez avoir une table appelée **datatable** comme indiqué dans les exemples suivants. Dans un **datatable**, il y a deux clés, X et Y et leurs valeurs associées. L'utilitaire OutlineViewer est un bon outil pour explorer les valeurs stockées dans NetworkTables pendant l'exécution d'un programme.
zh_cn: 数据在网络表中按层次结构进行组织，类似磁盘上带有文件夹和文件的目录。对于网络表的任何实例，可以存在多个值和子表，它们可以以适合所需数据组织的任何方式嵌套。子表实际上表示为长键，带有斜杠（/）分隔嵌套的子表和值键名称。每个值都有一个与之关联的键，用于检索该值。例如，您可能有一个名为datatable的表，如以下示例所示。在datatable中，有两个键“X”和“Y”，及其关联的值。 OutlineViewer是一个很好的实用程序，可以用于在程序运行时浏览存储在网络表中的值。

source: Data types for NetworkTables are either boolean, numeric, or string. Numeric values are written as double precision values. In addition you can have arrays of any of those types to ensure that multiple data items are delivered consistently. There is also the option of storing raw data which can be used for representing structured data.
es_mx: Los tipos de datos para las tablas de enrutamiento son booleanos, numéricos o de cadena. Los valores numéricos son escritos como valores de doble precisión. Adicionalmente usted puede tener arreglos de cualquiera de esos tipos para asegurar que elementos de múltiples datos son entregados consecuentemente. También existe la opción de almacenar datos sin procesar que pueden ser usados para representar datos estructurados.
fr_ca: Les types de données pour NetworkTables sont soit booléens, numériques ou chaîne. Les valeurs numériques sont écrites sous forme de valeurs à double précision. En outre, vous pouvez disposer de tableaux de n'importe lequel de ces types pour garantir que plusieurs éléments de données sont fournis de manière cohérente. Il existe également la possibilité de stocker des données brutes qui peuvent être utilisées pour représenter des données structurées.
zh_cn: 网络表的数据类型为布尔，数字或字符串。数值写为双精度值。此外，您可以使用任何这些类型的数组，以确保多个数据项被连贯地传递。您还可以选择存储原始数据，它能被用于表示结构化数据。

source: There are some default tables that are created automatically when the program starts up:
es_mx: Hay algunas tablas predeterminadas que son creadas automáticamente cuando inicia el programa:
fr_ca: Certaines tables par défaut sont créées automatiquement au démarrage du programme:
zh_cn: 一些默认表会在程序启动时自动创建：

source: Table name
es_mx: Nombre de la Tabla
fr_ca: Nom de table
zh_cn: 表名

source: Use
es_mx: Uso
fr_ca: Utilité
zh_cn: 用途

source: Used to store values written to the SmartDashboard or Shuffleboard using the ``SmartDashboard.put()`` set of methods.
es_mx: Usada para guardas valores escritos en la SmartDashboard o Shuffleboard usando el conjunto de métodos ``SmartDashboard.put()``.
fr_ca: Utilisé pour stocker les valeurs écrites sur le SmartDashboard ou le Shuffleboard à l'aide de l'ensemble de méthodes ``SmartDashboard.put()``.
zh_cn: 用于存储使用SmartDashboard.put()方法集写入SmartDashboard或Shuffleboard的值。

source: Used to store Test mode (Test on the Driver Station) values. Typically these are Subsystems and the associated sensors and actuators.
es_mx: Usada para guardar valores del Modo de prueba (Modo de la driver station). Normalmente estos son subsistemas y los sensores y actuadores asociados.
fr_ca: Utilisé pour stocker les valeurs du mode Test (Test sur le Driver Station). Il s'agit généralement de sous-systèmes et des capteurs et actionneurs associés.
zh_cn: 用于存储测试模式（在驱动程序站上测试）值。这些通常是子系统以及关联的传感器和执行器。

source: Information about the currently running match that comes from the Driver Station and the Field Management System
es_mx: Información acerca del partido en ejecución que viene de la driver station y el Field Management System.
fr_ca: Informations sur le match en cours d'exécution provenant de Driver Station et du Field Management System
zh_cn: 来自 Driver Station 和现场管理系统的有关当前进行的比赛的信息

source: Writing a simple NetworkTables program
es_mx: Escribir un programa sencillo de NetworkTables
fr_ca: Écrire un programme simple avec les NetworkTables
zh_cn: 编写一个简单的网络表程序

source: The NetworkTables classes are instantiated automatically when your program starts. To access the instance of NetworkTables do call methods to read and write the getDefault() method can be used to get the default instance.
es_mx: Las clases de una tabla de enrutamiento se instancian automáticamente cuando el programa inicia. Para acceder a la instancia de la Tabla de Enrutamiento, llame a los métodos read y write de getDefault() que pueden ser usado para obtener la instancia predeterminada.
fr_ca: Les classes NetworkTables sont instanciées automatiquement au démarrage de votre programme. L'accès à l'instance de NetworkTables implique l'appel de méthodes pour lire et écrire; la méthode ``getDefault()`` peut être utilisée pour obtenir l'instance par défaut.
zh_cn: 程序启动时，将自动实例化网络表类。要访问网络表实例，请使用方法读取和写入。可以使用getDefault()方法来获取默认实例。

source: The values for X and Y can be easily viewed using the OutlineViewer program that shows the NetworkTables hierarchy and all the values associated with each key.
es_mx: Los valores para X y Y pueden ser vistos fácilmente usando el OutlineViewer que muestra la jerarquía de la Tabla de Enrutamiento y todos los valores asociados con cada índice.
fr_ca: Les valeurs de X et Y peuvent être facilement visualisées à l'aide du programme OutlineViewer qui montre la hiérarchie NetworkTables et toutes les valeurs associées à chaque clé.
zh_cn: 使用OutlineViewer程序可以轻松查看“X”和“Y”的值，该程序显示了网络表的层次结构以及所有相关的键值对。

source: Actually NetworkTables has a flat namespace for the keys. Having tables and subtables is an abstraction to make it easier to organize your data. So for a table called "SmartDashboard" and a key named "xValue", it is really a single key called "/SmartDashboard/xValue". The hierarchy is not actually represented in the distributed data, only keys with prefixes that are the contained table.
es_mx: En realidad NetworkTables tiene un espacio de nombres plano para las claves. Tener tablas y subtablas es una abstracción para facilitar la organización de los datos. Así que para una tabla llamada "SmartDashboard" y una clave llamada "xValue", es realmente una sola clave llamada "/SmartDashboard/xValue". La jerarquía no está realmente representada en los datos distribuidos, sólo claves con prefijos que son la tabla contenida.
fr_ca: En fait, les NetworkTables ont un espace de noms sans hiérarchie pour les clés. Avoir des tableaux et des sous-tableaux est une abstraction pour faciliter l'organisation de vos données. Donc pour une table appelée "SmartDashboard" et une clé nommée "xValue", il s'agit en réalité d'une seule clé appelée "/ SmartDashboard / xValue". La hiérarchie n'est pas réellement représentée dans les données distribuées, seulement les clés avec des préfixes qui sont la table contenue.
zh_cn: 对于键来说，网络表的命名空间实际上是扁平的。“表”和“子表”是一种抽象概念，使您更容易组织数据。对于名为“SmartDashboard”的表和名为“ xValue”的键，它实际上只是一个名为“/SmartDashboard/xValue”的键。分布式数据实际上并未表示层次结构，它仅存储了键，以包含该键的表的名称作为前缀。
