Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/networktables/reading-array-values-published-by-networktables.po
Languages: fr_ca, zh_cn

source: Reading array values published by NetworkTables
fr_ca: Lecture des valeurs de tableau publiées par NetworkTables
zh_cn: 读取网络表发布的数组值

source: This article describes how to read values published by :term:`NetworkTables` using a program running on the robot. This is useful when using computer vision where the images are processed on your driver station laptop and the results stored into NetworkTables possibly using a separate vision processor like a raspberry pi, or a tool on the robot like GRIP, or a python program to do the image processing.
fr_ca: Cet article décrit comment lire les valeurs publiées par les :term:`NetworkTables` à l'aide d'un programme exécuté sur le robot. Ceci est utile lors de l'utilisation de la vision par ordinateur où les images sont traitées sur votre ordinateur portable de la station de pilote et les résultats étant stockés dans NetworkTables via un processeur de vision séparé comme un raspberry pi, ou un outil sur le robot comme GRIP, ou un programme python pour faire le traitement d'image.
zh_cn: 本文介绍如何使用机器人上运行的程序读取NetworkTables发布的值。在使用机器操控台的笔记本电脑上使用计算机视觉处理图像，以及在使用单独的视觉处理器（例如，树莓派）或机器人上的工具（例如GRIP）或Python程序来执行图像处理，并把处理的结果储存在NetworkTables中，本文的内容会很有用。

source: Very often the values are for one or more areas of interest such as goals or game pieces and multiple instances are returned. In the example below, several x, y, width, height, and areas are returned by the image processor and the robot program can sort out which of the returned values are interesting through further processing.
fr_ca: Très souvent, les valeurs concernent un ou plusieurs domaines d'intérêt tels que les objectifs ou les pièces de jeu et plusieurs instances sont renvoyées. Dans l'exemple ci-dessous, plusieurs valeurs de x, y, largeur, hauteur et zones sont envoyés par le processeur d'image et le programme du robot peut trier les valeurs qui sont intéressantes grâce à un traitement plus poussé.
zh_cn: 通常，这些值是针对一个或多个感兴趣区域（例如目标或游戏片段）的，并且会返回多个实例。在下面的示例中，图像处理器返回了多个x，y，宽度，高度和区域，并且机器人程序可以通过进一步的处理来找出返回的值中哪些是有趣的。

source: Verify the NetworkTables keys being published
fr_ca: Vérifiez les clés NetworkTables en cours de publication
zh_cn: 验证发布的网络表密钥

source: Image of OutlineViewer with the NetworkTables keys
fr_ca: Image de OutlineViewer avec les clés NetworkTables

source: You can verify the names of the NetworkTables keys used for publishing the values by using the Outline Viewer application. It is a Java program in your user directory in the wpilib/<YEAR>/tools folder. The application is started by selecting the "WPILib" menu in Visual Studio Code then Start Tool then "OutlineViewer". In this example, with the image processing program running (GRIP) you can see the values being put into NetworkTables.
fr_ca: Vous pouvez vérifier les noms des clés NetworkTables utilisées pour publier les valeurs à l'aide de l'application Outline Viewer. Il s'agit d'un programme Java dans votre répertoire utilisateur dans le dossier wpilib/<YEAR>/tools. L'application est démarrée en sélectionnant le menu "WPILib" dans Visual Studio Code puis "Start Tool" puis "OutlineViewer". Dans cet exemple, avec le programme de traitement d'image en cours d'exécution (GRIP), vous pouvez voir les valeurs mises dans NetworkTables.
zh_cn: 您可以使用Outline Viewer应用程序来验证用于发布值的网络表键的名称。它是用户目录下wpilib/<YEAR>/tools文件夹中的一个Java程序。可通过在Visual Studio Code中选择“ WPILib”菜单，然后依次单击“启动工具”和“ OutlineViewer”来启动应用程序。在此示例中，在运行图像处理程序（GRIP）的情况下，您可以看到值被添加到网络表中。

source: In this case the values are stored in a table called GRIP and a sub-table called myContoursReport. You can see that the values are in brackets and there are 2 values in this case for each key. The NetworkTables key names are centerX, centerY, area, height and width.
fr_ca: Dans ce cas, les valeurs sont stockées dans une table appelée GRIP et une sous-table appelée myContoursReport. Vous pouvez voir que les valeurs sont entre crochets et il y a 2 valeurs dans ce cas pour chaque clé. Les noms de clé NetworkTables sont centerX, centerY, area, height et width.
zh_cn: 在这种情况下，这些值存储在一个名为GRIP的表和一个名为myContoursReport的子表中。您可以看到每个键对应一个有着2个值的列表。网络表的键名为centerX，centerY，area，height和width。

source: Both of the following examples are extremely simplified programs that just illustrate the use of NetworkTables. All the code is in the robotInit() method so it's only run when the program starts up. In your programs, you would more likely get the values in code that is evaluating which direction to aim the robot in a command or a control loop during the autonomous or teleop periods.
fr_ca: Les deux exemples suivants sont des programmes simples qui illustrent l'utilisation de NetworkTables. Tout le code est dans la méthode ``robotInit()``, il n'est donc exécuté qu'au démarrage du programme. Dans vos programmes, vous obtiendrez plus probablement les valeurs dans le code qui gère vers quelle direction le robot doit viser pour atteindre une cible, ou une boucle de contrôle pendant les périodes autonome ou téléopérée.
zh_cn: 下面的两个示例都是高度简化的程序，仅说明了网络表的用法。所有代码都在robotInit()方法中，因此仅在程序启动时运行。在您的程序中，这些值的获取大多会在比赛的自动阶段或手动阶段，使机器人瞄向一个方向的指令或控制循环中进行。

source: Writing a program to access the keys
fr_ca: Écrire un programme pour accéder aux clés
zh_cn: 编写程序以获取键

source: The steps to getting the values and, in this program, printing them are:
fr_ca: Les étapes pour obtenir les valeurs et aussi les imprimer sont les suivantes:
zh_cn: 获取值并在此程序中打印它们的步骤是：

source: Declare the table variable that will hold the instance of the subtable that have the values.
fr_ca: Déclarer la variable de table qui contiendra l'instance de la sous-table contenant les valeurs.
zh_cn: 声明表变量，该变量将保存具有值的子表的实例。

source: Initialize the subtable instance so that it can be used later for retrieving the values.
fr_ca: Initialiser l'instance de sous-table afin qu'elle puisse être utilisée plus tard pour récupérer les valeurs.
zh_cn: 初始化子表实例，以便以后可用于检索值。

source: Read the array of values from NetworkTables. In the case of a communicating programs, it's possible that the program producing the output being read here might not yet be available when the robot program starts up. To avoid issues of the data not being ready, a default array of values is supplied. This default value will be returned if the NetworkTables key hasn't yet been published. This code will loop over the value of areas every 20ms.
fr_ca: Lisez le tableau de valeurs de NetworkTables. Dans le cas d'un programme communicant, il est possible que le programme produisant la sortie lue ici ne soit pas encore disponible au démarrage du programme du robot. Pour éviter que les données ne soient prêtes, un tableau de valeurs par défaut est fourni. Cette valeur par défaut sera renvoyée si la clé NetworkTables n'a pas encore été publiée. Ce code boucle sur la valeur des zones toutes les 20 ms.
zh_cn: 从NetworkTables中读取值的数组。在通讯程序中，当机器人程序启动时，在此处输出的程序可能无法被读取。为避免数据未准备就绪的问题，提供了一个默认值数组。如果尚未发布网络表密钥，则将返回此默认值。该代码将每20ms遍历一次Area的值。

source: Program output
fr_ca: Les sorties du programme
zh_cn: 程序输出

source: Image of Riolog showing the values
fr_ca: Image de Riolog montrant des valeurs

source: In this case the program is only looking at the array of areas, but in a real example all the values would more likely be used. Using the Riolog in VS Code or the Driver Station log you can see the values as they are retrieved. This program is using a sample static image so they areas don't change, but you can imagine with a camera on your robot, the values would be changing constantly.
fr_ca: Dans ce cas, le programme ne regarde seulement que le tableau des zones, mais dans un exemple réel, toutes les valeurs seraient plus susceptibles d'être utilisées. En utilisant le Riolog dans VS Code ou le journal (log) du Driver Station, vous pouvez voir les valeurs au fur et à mesure qu'elles sont récupérées. Ce programme utilise un exemple d'image statique afin que les zones ne changent pas, mais vous pouvez imaginer qu'avec une caméra sur votre robot, les valeurs changeraient constamment.
zh_cn: 在这种情况下，程序仅查看关于areas数组，但在实际示例中，更可能所有值都会被使用。使用VS Code中的Riolog或Driver Station日志，您可以看到被检索的值。该程序使用的是示例静态图像，因此区域数值不会改变。但是您可以想象在机器人上安装摄像头后，值会不断变化。
