Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview-dashboard/driver-station-labview-dashboard.po
Languages: tr_tr, zh_cn

source: FRC LabVIEW Dashboard
tr_tr: FRC LabVIEW Kontrol Paneli
zh_cn: FRC LabVIEW 仪表盘

source: The Dashboard application installed and launched by the FRC\ |reg| Driver Station is a LabVIEW program designed to provide teams with basic feedback from their robot, with the ability to expand and customize the information to suit their needs. This Dashboard application uses Network Tables and contains a variety of tools that teams may find useful.
tr_tr: FRC\ |reg| tarafından yüklenen ve başlatılan Dashboard uygulaması Driver Station, ekiplere robotlarından temel geri bildirim sağlamak ve bilgileri ihtiyaçlarına göre genişletme ve özelleştirme yeteneği sağlamak için tasarlanmış bir LabVIEW programıdır. Bu Dashboard uygulaması Ağ Tablolarını kullanır ve ekiplerin yararlı bulabileceği çeşitli araçlar içerir.

source: LabVIEW Dashboard
tr_tr: LabVIEW Kontrol Paneli
zh_cn: LabVIEW 仪表盘

source: The Dashboard is broken into two main sections. The left pane is for displaying a camera image. The right pane contains:
tr_tr: Gösterge Panosu iki ana bölüme ayrılmıştır. Sol bölme, bir kamera görüntüsünü görüntülemek içindir. Sağ bölme şunları içerir:
zh_cn: 仪表板分为两个主要部分。左侧窗格用于显示相机图像。右窗格包含：

source: Drive tab that contains indicators for joystick and drive motor values (hooked up by default when used with LabVIEW robot code), a gyro indicator, an Autonomous selection text box, a connection indicator and some controls and indicators for the camera
tr_tr: Kumanda kolu ve sürücü motor değerleri için göstergeler (LabVIEW robot kodu ile kullanıldığında varsayılan olarak bağlanır), bir cayro göstergesi, bir Otonom seçim metin kutusu, bir bağlantı göstergesi ve kamera için bazı kontroller ve göstergeler içeren sürücü sekmesi
zh_cn: 自动阶段驱动选项卡，包含操纵杆和驱动电机值的指示灯 (与 LabVIEW 机器人代码一起使用时默认两者关联) 、陀螺仪指示灯、自主选择文本框、连接指示灯以及相机的一些控件和指示灯

source: Basic tab that contains some default controls and indicators
tr_tr: Bazı varsayılan kontrolleri ve göstergeleri içeren temel sekme
zh_cn: 基本选项卡，包含默认控件和指示器的

source: Camera tab that contains a secondary camera viewer, similar to the viewer in the left pane
tr_tr: Sol bölmedeki izleyiciye benzer ikincil bir kamera görüntüleyici içeren kamera sekmesi
zh_cn: 摄影机选项卡，包含辅助摄影机查看器，类似于左窗格中的查看器

source: Custom tab for customizing the dashboard using LabVIEW
tr_tr: Kontrol panelini LabVIEW kullanarak özelleştirmek için özel sekme
zh_cn: 自定义选项卡，用于使用 LabVIEW 自定义仪表盘

source: Test tab for use with Test Mode in the LabVIEW framework
tr_tr: LabVIEW çerçevesinde Test Modu ile kullanım için Test sekmesi
zh_cn: 测试选项卡，与 LabVIEW 框架中的测试模式一起使用

source: Commands tab for use with the new LabVIEW C&C Framework
tr_tr: Yeni LabVIEW C&C Framework ile kullanım için Komutlar sekmesi
zh_cn: 命令选项卡，用于新 LabVIEW C&C 框架

source: Checklist tab that can be used to create task lists to complete before and/or between matches
tr_tr: Eşleşmelerden önce ve / veya eşleşmeler arasında tamamlamak üzere görev listeleri oluşturmak için kullanılabilen kontrol listesi sekmesi
zh_cn: 检查表选项卡，可用于创建任务列表，以便在匹配之前和/或之间完成

source: Variables tab that displays the raw Network Tables variables in a tree view format
tr_tr: Ham Ağ Tabloları değişkenlerini ağaç görünümü biçiminde görüntüleyen Değişkenler sekmesi

source: The LabVIEW Dashboard also includes Record/Playback functionality, located in the bottom right. More detail about this feature is included below under `Record/Playback`_.
tr_tr: LabVIEW Dashboard ayrıca sağ altta bulunan Kayıt / Oynatma işlevini de içerir. Bu özellikle ilgili daha fazla ayrıntı aşağıda `Record/Playback - Kayıt / Oynatma`_altında verilmiştir.
zh_cn: LabVIEW 仪表盘还包括记录/回放功能，位于右下角。有关此功能的更多详细信息，请参见下面的 `Record/Playback`_ 部分。

source: Camera Image and Controls
tr_tr: Kamera Görüntüsü ve Kontrolleri
zh_cn: 摄像机图像和控制

source: The left pane is used to display a video feed from an Axis camera or USB camera located on the robot. For instructions on setting up the Axis Camera to work with this display :ref:`see here <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>`. There are also some controls and indicators related to the camera below the tab area:
tr_tr: Sol bölme, robotta bulunan bir Axis kamerasından veya USB kameradan bir video beslemesini görüntülemek için kullanılır. Axis Kamerasını bu ekranla çalışmak üzere ayarlama talimatları için: ref: `buraya bakın <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>`. Sekme alanının altında kamerayla ilgili bazı kontroller ve göstergeler de vardır:
zh_cn: 左窗格用于显示来自机器人上的 Axis 摄像头或 USB 摄像头的视频馈送。有关如何设置轴相机以使用此显示器的说明，请参见此处 :ref:`<docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>`。选项卡区域下方还有一些与摄像头相关的控件和指示灯：

source: Camera Image Display
tr_tr: Kamera Görüntü Ekranı
zh_cn: 摄像机图像显示

source: Mode Selector - This drop-down allows you to select the type of camera display to use. The choices are Camera Off, USB Camera SW (software compression), USB Camera HW (hardware compression) and IP Camera (Axis camera). Note that the IP Camera setting will not work when your PC is connected to the roboRIO over USB.
tr_tr: Mode Selector-Mod Seçici - Bu açılır menü, kullanılacak kamera ekranı türünü seçmenize olanak tanır. Seçenekler, Kamera Kapalı, USB Kamera Yazılımı (yazılım sıkıştırma), USB Kamera HW (donanım sıkıştırması) ve IP Kamera (Eksen kamera) şeklindedir. Bilgisayarınız USB üzerinden roboRIO'ya bağlandığında IP Kamera ayarının çalışmayacağını unutmayın.
zh_cn: 模式选择器-此下拉列表允许您选择要使用的相机显示类型。这些选项包括摄像头关闭、USB 摄像头 SW (软件压缩)、USB 摄像头 HW (硬件压缩) 和 IP 摄像头 (Axis摄像头) 。请注意，当您的电脑通过 USB 连接到 roboRIO 时，IP 摄像头设置将不起作用。

source: Camera Settings - This control allows you to change the resolution, framerate and compression of the image stream to the dashboard, click the control to pop-up the configuration.
tr_tr: Camera Settings-Kamera Ayarları - Bu kontrol, kontrol panelindeki görüntü akışının çözünürlüğünü, kare hızını ve sıkıştırmasını değiştirmenize olanak tanır, yapılandırmayı açmak için kontrole tıklayın.
zh_cn: 相机设置 - 此控件允许您更改图像流的分辨率、帧速率，或将图片馈送压缩到仪表板。单击该控件以弹出配置。

source: Bandwidth Indicator - Indicates approximate bandwidth usage of the image stream. The indicator will display green for "safe" bandwidth usage, yellow when teams should use caution and red if the stream bandwidth is beyond levels that will work on the competition field.
tr_tr: Bant Genişliği Göstergesi - Görüntü akışının yaklaşık bant genişliği kullanımını gösterir. Gösterge, "safe-güvenli" bant genişliği kullanımı için yeşil, takımların dikkatli kullanması gerektiğinde sarı, akış bant genişliği yarışma alanında çalışacak seviyelerin ötesinde ise kırmızı renkte görüntülenecektir.
zh_cn: 带宽指示器 - 指示图像流的近似带宽使用情况。指示灯将显示绿色表示 "安全" 带宽使用，黄色表示团队应谨慎使用，红色表示图像流带宽超出赛场可能的带宽条件。

source: Framerate - Indicates the approximate received framerate of the image stream.
tr_tr: Framerate-Kare Hızı - Görüntü akışının yaklaşık alınan kare hızını gösterir.
zh_cn: 帧速率 - 表示图像流的近似接收帧速率。

source: The bandwidth indicator indicates the combined bandwidth for all camera streams open.
tr_tr: Bant genişliği göstergesi, açık olan tüm kamera akışları için birleşik bant genişliğini gösterir.
zh_cn: 带宽指示器显示所有打开的相机流的组合带宽

source: Drive
tr_tr: Sürüş
zh_cn: 驱动

source: The center pane contains a section that provides feedback on the joysticks and drive commands when used with the LabVIEW framework and a section that displays the NetworkTables status and autonomous selector:
tr_tr: Orta bölme, LabVIEW çerçevesiyle kullanıldığında kumanda çubukları ve sürücü komutları hakkında geri bildirim sağlayan bir bölüm ve NetworkTables durumunu ve otonom seçiciyi görüntüleyen bir bölüm içerir:
zh_cn: 自动阶段中间窗格包含一个提供与 LabVIEW 框架一起使用时操纵杆和驱动器命令反馈的部分，以及一个用于显示 NetworkTables 状态和自动选择器的部分:

source: Displays X,Y and Throttle information and button values for up to 2 joysticks when using the LabVIEW framework
tr_tr: LabVIEW çerçevesini kullanırken 2 adede kadar kumanda kolu için X, Y ve Gaz Kelebeği bilgilerini ve düğme değerlerini görüntüler
zh_cn: 使用 LabVIEW 框架时，最多显示2个操纵手柄的 X 、Y 、油门信息以及按钮值

source: Displays values being sent to motor controllers when using LabVIEW framework
tr_tr: LabVIEW çerçevesi kullanılırken motor kontrolörlerine gönderilen değerleri görüntüler
zh_cn: 显示使用 LabVIEW 框架时发送给电机控制器的值

source: Displays a connection indicator for the NetworkTables (NT) data from the robot
tr_tr: Robottan Ağ Tabloları (NT) verileri için bir bağlantı göstergesi görüntüler

source: Displays a Gyro value
tr_tr: Bir Gyro değeri görüntüler
zh_cn: 显示陀螺值

source: Displays a text box that can be used to select Autonomous modes. Each language's code templates have examples of using this box to select from multiple autonomous programs.
tr_tr: Otonom modları seçmek için kullanılabilecek bir metin kutusu görüntüler. Her dilin kod şablonlarında, birden çok özerk program arasından seçim yapmak için bu kutuyu kullanma örnekleri vardır.
zh_cn: 显示一个可用于选择自动阶段模式的文本框。每种语言的代码模板都有使用这个框从多个自动阶段程序中选择的例子。

source: These indicators (other than the Gyro) are hooked up to appropriate values by default when using the LabVIEW framework. For information on using them with C++/Java code see :doc:`using-the-labview-dashboard-with-c++-java-code`.
tr_tr: Bu göstergeler (Gyro dışında) LabVIEW çerçevesi kullanılırken varsayılan olarak uygun değerlere bağlanır. Bunları C ++ / Java koduyla kullanma hakkında bilgi için bkz: doc: `using-the-labview-dashboard-with-c ++ - java-code`.
zh_cn: 在使用LabVIEW框架时，这些指示器（除了陀螺仪）默认连接到适当的值。有关使用C++和java代码的信息，请参见用C++／java代码使用LabVIEW仪表板

source: Basic
tr_tr: Temel
zh_cn: 基本要求

source: The Basic tab contains a variety of pre-populated bi-directional controls/indicators which can be used to control the robot or display information from the robot. The SmartDashboard key names associated with each item are labeled next to the indicator with the exception of the Strings which follow the same naming pattern and increment from DB/String 0 to DB/String 4 on the left and DB/String 5 to DB/String 9 on the right. The LabVIEW framework contains an example of reading from the Buttons and Sliders in Teleop. It also contains an example of customizing the labels in Begin. For more detail on using this tab with C++\Java code, see :doc:`using-the-labview-dashboard-with-c++-java-code`.
tr_tr: Temel sekmesi, robotu kontrol etmek veya robottan bilgileri görüntülemek için kullanılabilen önceden doldurulmuş çeşitli çift yönlü kontroller / göstergeler içerir. Her bir öğeyle ilişkili SmartDashboard anahtar adları, aynı adlandırma modelini izleyen ve soldaki DB / String 0'dan DB / String 4'e ve DB / String 5'ten DB / String'e kadar olan Dizeler haricinde göstergenin yanında etiketlenir. Sağda 9. LabVIEW çerçevesi, Teleop'taki Düğmeler ve Kaydırıcılardan bir okuma örneği içerir. Ayrıca, Başlangıçta etiketlerin özelleştirilmesine ilişkin bir örnek içerir. Bu sekmeyi C ++ \ Java koduyla kullanma hakkında daha fazla ayrıntı için, bakınız: doc: `using-the-labview-dashboard-with-c ++ - java-code`.
zh_cn: “基本”选项卡包含各种预填充的双向控件/指示器，可用于控制机器人或显示来自机器人的信息。与每个项目相关联的SmartDashboard键名称都标记在指示器旁边，但遵循相同命名模式并从左侧的DB/String 0到DB/String 4递增，右侧的DB/String 5到DB/String 9递增的字符串除外。LabVIEW框架包含一个从Teleop中的按钮和滑块读取的示例。它还包含一个在Begin中自定义标签的示例。有关使用C++ java代码使用此选项卡的更多细节，请参见使用C++或java代码使用LabVIEW仪表板

source: Camera
tr_tr: Kamera
zh_cn: 摄像机

source: The left pane can only display a single camera output, so use the camera tab on the right pane to display a second camera output if needed.
tr_tr: Sol bölme yalnızca tek bir kamera çıkışı görüntüleyebilir, bu nedenle gerekirse ikinci bir kamera çıkışı görüntülemek için sağ bölmedeki kamera sekmesini kullanın.
zh_cn: 提示：左侧窗格只能显示一个摄影机输出，因此如果需要，请使用右侧窗格上的“摄影机”选项卡显示第二个摄影机输出。

source: The camera tab is used to display a video feed from an Axis camera or USB camera located on the robot. For instructions on setting up the Axis Camera to work with this display :ref:`see here <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>`. There are also some controls and indicators related to the camera below the tab area:
tr_tr: Kamera sekmesi, robotta bulunan bir Axis kamerasından veya USB kameradan bir video beslemesini görüntülemek için kullanılır. Axis Kamerasını bu ekranla çalışmak üzere ayarlama talimatları için :ref:`see here <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>`. Sekme alanının altında kamerayla ilgili bazı kontroller ve göstergeler de vardır:
zh_cn: 摄像头选项卡用于显示来自机器人上的Axis摄像头或USB摄像头的视频。有关如何设置轴相机以使用此显示器的说明，请参见此处。选项卡区域下方还有一些与摄像头相关的控件和指示灯：

source: Custom
tr_tr: Custom-Özel
zh_cn: 海关

source: The Custom tab allows you to add additional controls/indicators to the dashboard using LabVIEW without removing any existing functionality. To customize this tab you will need to create a Dashboard project in LabVIEW.
tr_tr: Özel sekmesi, mevcut herhangi bir işlevi kaldırmadan LabVIEW kullanarak kontrol paneline ek kontroller / göstergeler eklemenizi sağlar. Bu sekmeyi özelleştirmek için LabVIEW'de bir Gösterge Tablosu projesi oluşturmanız gerekir.
zh_cn: 自定义选项卡允许您使用LabVIEW向仪表板添加其他控件/指示器，而无需删除任何现有功能。要自定义此选项卡，您需要在LabVIEW中创建一个仪表板项目。

source: Test
tr_tr: Test-Ölçek
zh_cn: 试验

source: The Test tab is for use with Test mode for teams using LabVIEW (Java and C++ teams should use SmartDashboard or Shuffleboard when using Test Mode). For many items in the libraries, Input/Output info will be populated here automatically. All items which have ** next to them are outputs that can be controlled by the dashboard. To control an output, click on it to select it, drag the slider to set the value then press and hold the green button to enable the output. As soon as the green button is released, the output will be disabled. This tab can also be used to run and monitor tests on the robot. An example test is provided in the LabVIEW framework. Selecting this test from the dropdown box will show the status of the test in place of the slider and enable controls.
tr_tr: Test sekmesi, LabVIEW kullanan ekipler için Test moduyla kullanım içindir (Java ve C ++ ekipleri Test Modunu kullanırken SmartDashboard veya Shuffleboard kullanmalıdır). Kitaplıklardaki birçok öğe için Giriş / Çıkış bilgileri burada otomatik olarak doldurulacaktır. Yanlarında ** bulunan tüm öğeler, kontrol paneli tarafından kontrol edilebilen çıktılardır. Bir çıkışı kontrol etmek için, üzerine tıklayarak seçin, değeri ayarlamak için kaydırıcıyı sürükleyin ve ardından çıkışı etkinleştirmek için yeşil düğmeye basılı tutun. Yeşil düğme serbest bırakılır bırakılmaz, çıktı devre dışı bırakılacaktır. Bu sekme, robot üzerinde testleri çalıştırmak ve izlemek için de kullanılabilir. LabVIEW çerçevesinde örnek bir test sağlanmıştır. Açılır kutudan bu testin seçilmesi, kaydırıcı yerine testin durumunu gösterecek ve kontrolleri etkinleştirecektir.
zh_cn: 测试标签用于使用LabVIEW的团队测试模式（java和C++团队在使用测试模式时应该使用StaskDeSoad或SuffLeBoad）。对于库中的许多项，输入/输出信息将在此处自动填充。旁边有**的所有项目都是可由仪表板控制的输出。要控制输出，请单击它以选中它，拖动滑块以设置值，然后按住绿色按钮以启用输出。一旦松开绿色按钮，输出将被禁用。此选项卡还可用于运行和监视robot上的测试。LabVIEW框架中提供了一个示例测试。从下拉框中选择此测试将代替滑块和启用控件显示测试的状态。

source: Commands
tr_tr: Commands-Komutlar
zh_cn: 指令

source: The Commands tab can be used with the Robot in Test mode to see which commands are running and to manually run commands for test purposes.
tr_tr: Komutlar sekmesi, hangi komutların çalıştığını görmek ve test amacıyla komutları manuel olarak çalıştırmak için Robot Test modundayken kullanılabilir.
zh_cn: 命令选项卡可用于测试模式下的Robot，以查看正在运行的命令，并手动运行用于测试目的的命令。

source: Checklist
tr_tr: Checklist-Kontrol listesi
zh_cn: 检查表

source: The Checklist tab can be used by teams to create a list of tasks to perform before or between matches. Instructions for using the Checklist tab are pre-populated in the default checklist file.
tr_tr: Kontrol listesi sekmesi, takımlar tarafından maçlardan önce veya maçlar arasında gerçekleştirilecek bir görev listesi oluşturmak için kullanılabilir. Kontrol Listesi sekmesini kullanma talimatları, varsayılan kontrol listesi dosyasında önceden doldurulmuştur.
zh_cn: 团队可以使用Checklist选项卡创建在比赛之前或比赛之间要执行的任务列表。使用检查表选项卡的说明预先填充在默认检查表文件中。

source: Variables
tr_tr: Variables-Değişkenler
zh_cn: 变量

source: The Variables tab of the left pane shows all Network Tables variables in a tree display. The Variable Name (Key), Value and data type are shown for each variable. Information about the Network Tables bandwidth usage is also displayed in this tab. Entries will be shown with black diamonds if they are not currently synced with the robot.
tr_tr: Sol bölmenin Değişkenler sekmesi, bir ağaç görünümündeki tüm Ağ Tabloları değişkenlerini gösterir. Değişken Adı (Key-Anahtar), Değer ve veri türü her değişken için gösterilir. Ağ Tabloları bant genişliği kullanımıyla ilgili bilgiler de bu sekmede görüntülenir. Şu anda robot ile senkronize edilmemişlerse girişler siyah elmaslarla gösterilecektir.

source: Record/Playback
tr_tr: Record/Playback-Kayıt/Oynatma
zh_cn: 记录/回放

source: The LabVIEW Dashboard includes a Record/Playback feature that allows you to record video and Network Tables data (such as the state of your Dashboard indicators) and play it back later.
tr_tr: LabVIEW Dashboard, video ve Ağ Tabloları verilerini (örneğin Dashboard göstergelerinizin durumu) kaydetmenize ve daha sonra kayıttan yürütmenize olanak tanıyan bir Kayıt/Oynatma özelliği içerir.

source: Recording
tr_tr: Recording-Kayıt
zh_cn: 记录

source: To begin recording, click the red circular Record button. The background of the right pane will turn red to indicate you are recording. To stop recording, press the red square Stop button.
tr_tr: Kayda başlamak için kırmızı dairesel Kayıt düğmesini tıklayın. Sağ bölmenin arka planı kayıt yaptığınızı belirtmek için kırmızıya dönecektir. Kaydı durdurmak için kırmızı kare Durdur düğmesine basın.
zh_cn: 要开始录制，请单击红色圆形录制按钮。右窗格的背景将变为红色，表示您正在录制。要停止录制，请按红色的“停止”按钮。

source: Playback
tr_tr: Playback-Geri çalma
zh_cn: 回放

source: To play a recording back, click the green triangle Play button. The background of the right pane will begin pulsing green and playback controls will appear at the bottom of the camera pane.
tr_tr: Bir kaydı oynatmak için yeşil üçgen Oynat düğmesine tıklayın. Sağ bölmenin arka planı yeşil renkte yanıp sönmeye başlayacak ve kamera bölmesinin altında kayıttan yürütme kontrolleri görünecektir.
zh_cn: 要回放录音，请单击绿色三角形播放按钮。右窗格的背景将开始呈绿色脉冲，播放控件将出现在摄影机窗格的底部。

source: File Selector - The dropdown allows you to select a log file to play back. The log files are named using the date and time and the dropdown will also indicate the length of the file. Selecting a logfile will immediately begin playing that file.
tr_tr: Dosya Seçici - Açılır menü, oynatılacak bir günlük dosyası seçmenize olanak tanır. Günlük dosyaları, tarih ve saat kullanılarak adlandırılır ve açılır menü ayrıca dosyanın uzunluğunu gösterir. Bir günlük dosyası seçmek, o dosyayı hemen oynatmaya başlayacaktır.
zh_cn: 文件选择器-下拉列表允许您选择要播放的日志文件。日志文件使用日期和时间命名，下拉列表还将指示文件的长度。选择一个日志文件将立即开始播放该文件。

source: Play/Pause button - This button allows you to pause and resume playback of the log file.
tr_tr: Oynat / Duraklat düğmesi - Bu düğme, günlük dosyasının oynatılmasını duraklatmanıza ve devam ettirmenize olanak tanır.
zh_cn: 播放/暂停按钮-此按钮允许您暂停和恢复日志文件的播放。

source: Playback Speed - This dropdown allows you to adjust playback speed from 1/10 speed to 10x speed, the default is real-time (1x)
tr_tr: Oynatma Hızı - Bu açılır menü, oynatma hızını 1/10 hızdan 10x hıza ayarlamanıza olanak tanır, varsayılan gerçek zamanlıdır (1x)
zh_cn: 播放速度-此下拉菜单允许您将播放速度从1/10速度调整为10倍速度，默认值为实时（1x）

source: Time Control Slider - This slider allows you to fast-forward or rewind through the logfile by clicking on the desired location or dragging the slider.
tr_tr: Zaman Kontrol Kaydırıcısı - Bu kaydırıcı, istenen konuma tıklayarak veya kaydırıcıyı sürükleyerek günlük dosyasında hızlı ileri veya geri sarmanıza olanak tanır.
zh_cn: 时间控制滑块-此滑块允许您通过单击所需位置或拖动滑块在日志文件中快进或快退。

source: Settings - With a log file selected, this dropdown allows you to rename or delete a file or open the folder containing the logs in Windows Explorer (Typically ``C:\Users\Public\Documents\FRC\Log Files\Dashboard``)
tr_tr: Ayarlar - Bir günlük dosyası seçiliyken, bu açılır menü bir dosyayı yeniden adlandırmanıza veya silmenize veya günlükleri içeren klasörü Windows Gezgini'nde (Typically ``C:\Users\Public\Documents\FRC\Log Files\Dashboard``) açmanıza olanak tanır.
zh_cn: 设置-选中日志文件后，此下拉列表允许您重命名或删除文件，或在Windows资源管理器中打开包含日志的文件夹（通常是C:\Users\Public\Documents\FRC\log Files\Dashboard）

source: The Dashboard application installed and launched by the FRC\ |reg| Driver Station is a LabVIEW program designed to provide teams with basic feedback from their robot, with the ability to expand and customize the information to suit their needs. This Dashboard application uses :term:`NetworkTables` and contains a variety of tools that teams may find useful.
zh_cn: 由FRC \ | reg |安装并启动的Dashboard应用程序。 Driver Station是一个LabVIEW程序，旨在为团队提供来自其机器人的基本反馈，并能够扩展和自定义信息以满足他们的需求。此Dashboard应用程序使用NetworkTables术语，并包含各种团队可能发现有用的工具。

source: Variables tab that displays the raw NetworkTables variables in a tree view format
zh_cn: 变量选项卡以树视图格式显示原始NetworkTables变量

source: Displays a connection indicator for the NetworkTables data from the robot
zh_cn: 显示来自机械手的NetworkTables数据的连接指示器

source: The Variables tab of the left pane shows all NetworkTables variables in a tree display. The Variable Name (Key), Value and data type are shown for each variable. Information about the NetworkTables bandwidth usage is also displayed in this tab. Entries will be shown with black diamonds if they are not currently synced with the robot.
zh_cn: 左窗格的“变量”选项卡以树状显示形式显示所有NetworkTables变量。显示每个变量的变量名称（键），值和数据类型。此选项卡中还将显示有关NetworkTables带宽使用情况的信息。如果当前未与机器人同步，则条目将显示为黑色菱形。

source: The LabVIEW Dashboard includes a Record/Playback feature that allows you to record video and NetworkTables data (such as the state of your Dashboard indicators) and play it back later.
zh_cn: LabVIEW仪表板包含“记录/播放”功能，可用于记录视频和NetworkTables数据（例如，仪表板指示器的状态）并在以后播放。
