Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview-dashboard/using-the-labview-dashboard-with-c++-java-code.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Using the LabVIEW Dashboard with C++/Java Code
es_mx: Usando la Dashboard de LabVIEW con código C++/Java
fr_ca: Utilisation du Dashboard LabVIEW avec du code C++/Java
tr_tr: LabVIEW Kontrol Panelini C++/Java Koduyla Kullanma
zh_cn: 用 C++ / Java 代码使用 LabVIEW 仪表板

source: The default LabVIEW Dashboard utilizes Network Tables to pass values and is therefore compatible with C++ and Java robot programs. This article covers the keys and value ranges to use to work with the Dashboard.
es_mx: La Dashboard de LabVIEW predeterminado utiliza tablas de red para pasar valores y por lo tanto, es compatible con los programas de robot C++ y Java. Este artículo cubre las claves y los rangos de valores que se deben usar para trabajar con la Dashboard.
fr_ca: Le Dashboard LabVIEW par défaut utilise les Network Tables pour transmettre des valeurs et est donc compatible avec les programmes de robots écrits en C++ et Java. Cet article couvre les clés et les plages de valeurs à utiliser pour travailler avec le Dashboard.
tr_tr: Varsayılan LabVIEW Dashboard, değerleri geçirmek için Ağ Tablolarını kullanır ve bu nedenle C++ ve Java robot programları ile uyumludur. Bu makale, Gösterge Tablosu ile çalışmak için kullanılacak anahtarları ve değer aralıklarını kapsar.

source: Drive Tab
es_mx: Pestaña Drive
fr_ca: Onglet Drive
tr_tr: Drive Sekmesi
zh_cn: 驱动器选项卡

source: The :guilabel:`Select Autonomous...` dropdown can be used so show the available autonomous routines and choose one to run for the match.
es_mx: Se puede utilizar el menú desplegable :guilabel:`Select Autonomous...` para mostrar las rutinas autónomas disponibles y elegir una para ejecutar en el partido.
fr_ca: Le menu déroulant :guilabel:`Select Autonomous ...` peut être utilisé pour afficher les routines autonomes disponibles et en choisir une pour le match.
tr_tr: :guilabel:`Select Autonomous...` açılır menüsü kullanılabilir, böylece mevcut otonom rutinleri gösterin ve maç için koşmak için birini seçin.
zh_cn: :guilabel:`Select Autonomous...` 下拉列表可以用来显示并选择在比赛中运行的可用自动程序。

source: Sending to the "Gyro" network table entry will populate the gyro here.
es_mx: El envío a la entrada de la tabla de red "Gyro" llenará el gyro aquí.
fr_ca: L'envoi à l'entrée de la Network Table "Gyro" remplira le gyroscope ici.
tr_tr: "Gyro" ağ tablosuna gönderme girişi burada jiroskopu dolduracaktır.

source: There are four outputs that show the motor power to the drivetrain. This is configured for 2 motors per side and a tank style drivetrain. This is done by setting "RobotDrive Motors" like the example below.
es_mx: Hay cuatro salidas que muestran la potencia del motor a la transmisión. Está configurado para 2 motores por lado y una transmisión estilo tanque. Esto se hace configurando "RobotDrive Motors" como en el ejemplo siguiente.
fr_ca: Il y a quatre sorties qui indiquent la puissance du moteur délivré à la boîte de vitesses. Ceci est configuré pour 2 moteurs par côté et une transmission de type Tank. Cela se fait en paramétrant "RobotDrive Motors" comme dans l'exemple ci-dessous.
tr_tr: Motor gücünü aktarma sistemine gösteren dört çıkış vardır. Bu, her tarafta 2 motor ve bir tank tarzı aktarma organı için yapılandırılmıştır. Bu, aşağıdaki örnek gibi "RobotDrive Motorları" ayarlanarak yapılır.
zh_cn: 共有四个输出显示传动系的电机功率。传动系每侧配置2个电机，并被配置为坦克式驱动。如下面的示例所示，这是通过设置 "RobotDrive Motors" 来实现的。

source: Basic Tab
es_mx: Pestaña basica
fr_ca: Onglet Basic
tr_tr: Temel Sekme
zh_cn: 基本选项卡

source: The Basic tab uses a number of keys in the a "DB" sub-table to send/receive Dashboard data. The LED's are output only, the other fields are all bi-directional (send or receive).
es_mx: La pestaña Basic utiliza un número de teclas en la sub-tabla "DB" para enviar/recibir datos de la Dashboard. Los LED´s son sólo de salida, los otros campos son todos bidireccionales (enviar o recibir).
fr_ca: L’onglet Basic utilise un certain nombre de clés dans le sous-tableau "DB" pour envoyer/recevoir des données du Dashboard. Les DEL sont des sorties seulement, les autres champs sont tous bi-directionnels (envoyer ou recevoir).
tr_tr: Temel sekmesi, Gösterge Tablosu verilerini göndermek/almak için "DB" alt tablosundaki bir dizi anahtar kullanır. LED'ler yalnızca çıkış verir, diğer alanların tümü çift yönlüdür (gönderme veya alma).
zh_cn: "基本" 选项卡使用 "DB" 子表中的多个键来发送/接收仪表板数据。LED 仅输出，其他字段均为双向 (发送或接收)。

source: Strings
fr_ca: Les chaînes de caractères
tr_tr: Teller
zh_cn: 字符串

source: The strings are labeled top-to-bottom, left-to-right from "DB/String 0" to "DB/String 9". Each String field can display at least 21 characters (exact number depends on what characters). To write to these strings:
es_mx: Los strings están etiquetadas de arriba a abajo, de izquierda a derecha de "DB/String 0" a "DB/String 9". Cada campo de un string puede mostrar al menos 21 caracteres (el número exacto depende de qué caracteres). Para escribir a estas cadenas:
fr_ca: Les chaînes de caractères sont étiquetées de haut en bas, de gauche à droite de "DB/String 0" à "DB/String 9". Chaque champ de chaîne de caractères peut afficher au moins 21 caractères (le nombre exact dépend des caractères). Pour écrire dans ces chaînes :
tr_tr: Dizeler, "DB/String 0" dan "DB/String 9" a, soldan sağa, yukarıdan aşağıya etiketlenir. Her Dize alanı en az 21 karakter görüntüleyebilir (tam sayı hangi karaktere bağlıdır). Bu dizelere yazmak için:
zh_cn: 字符串从上到下、从左到右标记为 "DB/String 0" 到 "DB/String 9" 。每个字符串字段至少可以显示21个字符 (确切的个数取决于显示的字符类型) 。要写入这些字符串：

source: To read string data entered on the Dashboard:
es_mx: Para leer los datos tipo string ingresados en la Dashboard:
fr_ca: Pour lire les données des chaînes de caractères saisies sur le Dashboard :
tr_tr: Gösterge Paneline girilen dizi verilerini okumak için:
zh_cn: 要读取在仪表板上输入的字符串数据：

source: Buttons and LEDs
es_mx: Botones y LEDs
fr_ca: Boutons et DELS
tr_tr: Düğmeler ve LED'ler
zh_cn: 按钮和LED

source: The Buttons and LEDs are boolean values and are labeled top-to-bottom from "DB/Button 0" to "DB/Button 3" and "DB/LED 0" to "DB/LED 3". The Buttons are bi-directional, the LEDs are only able to be written from the Robot and read on the Dashboard. To write to the Buttons or LEDs:
es_mx: Los botones y LEDs son valores booleanos y están etiquetados de arriba a abajo de "DB/Button 0" a "DB/Button 3" y "DB/LED 0" a "DB/LED 3". Los botones son bidireccionales, los LEDs sólo son capaces de ser escritos desde el robot y leidos en la Dashboard. Para escribir a los botones o LEDs:
fr_ca: Les boutons et les DEL sont des valeurs booléennes et sont étiquetés de haut en bas de "DB/Button 0" à "DB/Button 3" et "DB/LED 0" à "DB/LED 3". Les boutons sont bi-drectionnels, les DEL ne peuvent être écrites qu’à partir du robot et lues à partir du Dashboard. Pour écrire aux boutons ou dels :
tr_tr: Düğmeler ve LED'ler boole değerlerdir ve yukarıdan aşağıya "DB/Düğme 0" ila "DB/Düğme 3" ve "DB/LED 0" ila "DB/LED 3" olarak etiketlenmiştir. Düğmeler çift yönlüdür, LED'ler yalnızca Robot'tan yazılabilir ve Gösterge Tablosunda okunabilir. Düğmelere veya LED'lere yazmak için:
zh_cn: 按钮和LED为布尔值，从上到下标记为 "DB/Button 0" 到 "DB/Button 3" 和 "DB/LED 0" 到 "DB/LED 3"。按钮是双向的，LED只能从机器人写入并在仪表板上读取。要写入按钮或LED：

source: To read from the Buttons: (default value is false)
es_mx: Para leer desde los botones: (el valor predeterminado es falso)
fr_ca: Pour lire à partir des boutons : (la valeur par défaut est false)
tr_tr: Düğmelerden okumak için: (varsayılan değer yanlıştır)
zh_cn: 从按钮读取 (默认值为否)：

source: Sliders
fr_ca: Curseurs
tr_tr: Kaydırıcılar
zh_cn: 滑条

source: The Sliders are bi-directional analog (double) controls/indicators with a range from 0 to 5. To write to these indicators:
es_mx: Los sliders o controles deslizantes son controles/indicadores analógicos bidireccionales (dobles) con un rango de 0 a 5. Para escribir a estos indicadores:
fr_ca: Les curseurs sont des contrôles/indicateurs analogiques bi-directionnels (double) dont la plage varie de 0 à 5. Pour écrire des valeurs à ces indicateurs :
tr_tr: Kaydırıcılar, 0 ila 5 aralığında iki yönlü analog (çift) kontroller/göstergelerdir. Bu göstergelere yazmak için:
zh_cn: 滑块是双向模拟 (双) 控制/指示器，范围从0到5。要写入这些指示器：

source: To read values from the Dashboard into the robot program: (default value of 0.0)
es_mx: Para leer valores de una Dashboard dentro del robot: (valor predeterminado de 0.0)
fr_ca: Pour lire des valeurs à partir du Dashboard dans le programme robot: (valeur par défaut de 0.0)
tr_tr: Gösterge Panosundaki değerleri robot programına okumak için: (varsayılan değer 0,0)
zh_cn: 将仪表板中的值读入机器人程序：(默认值为0.0)

source: The default LabVIEW Dashboard utilizes :term:`NetworkTables` to pass values and is therefore compatible with C++ and Java robot programs. This article covers the keys and value ranges to use to work with the Dashboard.
zh_cn: 默认的LabVIEW仪表板利用NetworkTables来传递值，因此与C ++和Java机器人程序兼容。本文介绍了用于仪表板的键和值范围。

source: Sending to the "Gyro" NetworkTables entry will populate the gyro here.
zh_cn: 发送到“陀螺仪” NetworkTables条目将在此处填充陀螺仪。
