Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/telemetry/datalog.po
Languages: tr_tr

source: On-Robot Telemetry Recording Into Data Logs
tr_tr: Telemetrinin Robot İçerisindeki Veri Günlüklerinde Saklanması

source: By default, no telemetry data is recorded (saved) on the robot. The ``DataLogManager`` class provides a convenient wrapper around the lower-level ``DataLog`` class for on-robot recording of telemetry data into data logs. The WPILib data logs are binary for size and speed reasons. In general, the data log facilities provided by WPILib have minimal overhead to robot code, as all file I/O is performed on a separate thread--the log operation consists of mainly a mutex acquisition and copying the data.
tr_tr: Varsayılan olarak hiçbir telemetri verisi robot içerisinde kaydedilmemektedir. ``DataLogManager`` sınıfı, daha düşük düzeydeki telemetri verilerinin robot içerisindeki veri günlüğünde saklanması adına ``DataLog`` sınıfı için elverişli bir sarıcı sağlamaktadır. WPILib veri günlükleri boyut ve hız sebeplerinden ötürü binom şeklindedir. Genellikle WPILib tarafından sağlanan veri günlüğü kolaylıkları robot kodu üzerine az miktarda ek yük bindirmektedir. Bunun sebebi tüm dosya Giridi-Çıktıları ayrı bir iş parçacığında gerçekleştirilmesi yüzünden kayıt işleminin birçok mutex - karşılıklı dışlama edinimi ve veri kopyalamasından oluşmasıdır

source: Structure of Data Logs
tr_tr: Veri Günlüklerinin Yapısı

source: Similar to NetworkTables, data logs have the concept of entries with string identifiers (keys) with a specified data type. Unlike NetworkTables, the data type cannot be changed after the entry is created, and entries also have metadata--an arbitrary (but typically JSON) string that can be used to convey additional information about the entry such as the data source or data schema. Also unlike NetworkTables, data log operation is unidirectional--the ``DataLog`` class can only write data logs (it does not support read-back of written values) and the ``DataLogReader`` class can only read data logs (it does not support changing values in the data log).
tr_tr: NetworkTables'a benzer bir şekilde veri günlükleri de özel bir veri türüne sahip dizgi tanıtıcılara (anahtarlara) sahip girişler kavramına sahiptir. NetworkTables'ın aksine veri türünün girişi gerçekleştirildikten sonra veri türü değiştirilmez ve girişler üstverilere de sahiptir. Rastgele (ancak genelde JSON) bir dizi girişiyle ilgili veri kaynağı veya veri şeması gibi ek bilgilerin görüntülenebilmektedir. Ayrıca NetworkTables'ın aksine veri kayıt işlemi tek yönlüdür: ``DataLog`` sınıfı yalnızca veri günlükleri yazabilir (yazılan değerlerin yeniden okunmasını desteklememektedir), ``DataLogReader`` sınıfı yalnızca veri günlüklerini okuyabilir (veri günlüğündeki verilerin değiştirilmesini desteklememektedir).

source: Data logs consist of a series of timestamped records. Control records allow starting, finishing, or changing the metadata of entries, and data records record data value changes. Timestamps are stored in integer microseconds; when running on the RoboRIO, the FPGA timestamp is used (the same timestamp returned by ``Timer.getFPGATimestamp()``).
tr_tr: Veri günlükleri bir dizi zaman bilgisine sahip kayıtlardan oluşmaktadır. Kontrol kayıtları girişlere dair üstverilerin başlatılması, sonlandırılması veya değiştirilmesine olanak tanımaktadır ve veri günlükleri, veri değerlerinde yapılan değişiklikleri kaydetmektedir. Zaman bilgileri tamsayı olan mikro saniye cinsinde saklanmaktadır, günlükler RoboRIO'da çalıştırılırken (``Timer.getFPGATimestamp()`` tarafıdan döndürülen zaman bilgisiyle aynı) FPGA zaman bilgisi kullanılmaktadır.

source: For more information on the details of the data log file format, see the `WPILib Data Log File Format Specification <https://github.com/wpilibsuite/allwpilib/blob/main/wpiutil/doc/datalog.adoc>`__.
tr_tr: Veri günlüğü dosya biçimine dair daha ayrıntılı bilgi için bkz. `WPILib Veri Günlüğü Dosya Biçimi Özellikleri <https://github.com/wpilibsuite/allwpilib/blob/main/wpiutil/doc/datalog.adoc>`__.

source: Standard Data Logging using DataLogManager
tr_tr: DataLogManager ile Standart Veri Kaydı

source: The ``DataLogManager`` class (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/DataLogManager.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_data_log_manager.html>`__, :external:py:class:`Python <wpilib.DataLogManager>`) provides a centralized data log that provides automatic data log file management. It automatically cleans up old files when disk space is low and renames the file based either on current date/time or (if available) competition match number. The data file will be saved to a USB flash drive in a folder called ``logs`` if one is attached, or to ``/home/lvuser/logs`` otherwise.
tr_tr: ``DataLogManager`` sınıfı (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/DataLogManager.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_data_log_manager.html>`__, :external:py:class:`Python <wpilib.DataLogManager>`) kendiliğinden veri günlüğü dosya yönetimi sunan merkezi bir veri günlüğü sağlamaktadır. Disk alanı azaldığında sınıf kendiliğinden eski dosyaları temizlemekte ve dosyayı ya o anki tarih/saat ya da (eğer mevcutsa) yarışma müsabaka numarası olarak yeniden adlandırmaktadır. Veri dosyası, bir USB flaş bellek bağlıysa bellekte ``logs`` adında bir klasörde, aski takdirde ``/home/lvuser/logs`` konumunda saklanacaktır.

source: USB flash drives need to be formatted as FAT32 to work with the roboRIO. NTFS or exFAT formatted drives will not work. Flash drives of 32GB or smaller are recommended, as Windows doesn't format drives larger then 32GB with FAT32.
tr_tr: USB flaş bellekleri roboRIO ile çalışabilmeleri için FAT32 şeklinde biçimlendirilmelidir. NTFS veya exFAT şeklinde biçimlendirilmiş bellekler çalışmayacaktır. Windows, 32GB üstündeki bellekleri FAT32 ile biçimlendirmediği için 32GB ve altında depolama alanına sahip bellekler tavsiye edilmektedir.

source: Log files are initially named ``FRC_TBD_{random}.wpilog`` until the DS connects. After the DS connects, the log file is renamed to ``FRC_yyyyMMdd_HHmmss.wpilog`` (where the date/time is UTC). If the :term:`FMS` is connected and provides a match number, the log file is renamed to ``FRC_yyyyMMdd_HHmmss_{event}_{match}.wpilog``.
tr_tr: Kayıt dosyaları DS bağalanana kadar başta ``FRC_TBD_{random}.wpilog`` şeklinde adlandırılmaktadır. DS bağlandıktan sonra kayıt dosyası (tarih/saatin UTC olduğu) ``FRC_yyyyMMdd_HHmmss.wpilog`` şeklinde yeniden adlandırılmaktadır. :term:`FMS` bağlı ve bir müsabaka numarası sağlıyorsa, kayıt dosyası ``FRC_yyyyMMdd_HHmmss_{etkinlik}_{müsabaka}.wpilog`` şeklinde yeniden adlandırılmaktadır.

source: On startup, all existing log files where a DS has not been connected will be deleted. If there is less than 50 MB of free space on the target storage, ``FRC_`` log files are deleted (oldest to newest) until there is 50 MB free OR there are 10 files remaining.
tr_tr: Başlatılma sırasında bir DS'in bağlanmadığı varolan tüm kayıt dosyaları silinecektir. Hedef depolama alanında 50 MB'dan az boş alan bulunuyorsa, ``FRC_`` kayıt dosyaları (eskiden yeniye olacak şekilde) 50 MB boş alan VEYA 10 tane dosya geriye kalana kadar silinecektir.

source: The most basic usage of DataLogManager only requires a single line of code (typically this would be called from ``Robot`` constructor). This will record all NetworkTables changes to the data log.
tr_tr: DataLogManager'ın en temel kullanımı yalnızca tek bir kod satırı gerektirmektedir (normalde bu satır ``Robot`` constructor'ı tarafından çağırılmaktadır). Bu işlem tüm NetworkTables değişikliklerini veri günlüğüne kaydedecektir.

source: DataLogManager provides a convenience function (``DataLogManager.log()``) for logging of text messages to the ``messages`` entry in the data log. The message is also printed to standard output, so this can be a replacement for ``System.out.println()``.
tr_tr: DataLogManager, mesajlaşmaların veri günlüğüne ``messages`` girişi altında kaydedilmesine olanak tanıyan bir kolaylık işlevi (``DataLogManager.log()``) sağlamaktadır. Ayrıca mesajın standart çıkışa çıktısı alınmaktadır, yani bu fonksiyon ``System.out.println()``'in yerine geçebilmektedir.

source: DataLogManager also records the current roboRIO system time (in UTC) to the data log every ~5 seconds to the ``systemTime`` entry in the data log. This can be used to (roughly) synchronize the data log with other records such as DS logs or match video.
tr_tr: DataLogManager aynı zamanda (UTC olarak) anlık roboRIO sistem zamanını her ~5 saniyede bir veri günlüğündeki ``systemTime`` girişine kaydetmektedir. Bu kayıt veri günlüğünü (kabaca) DS günlükleri veya müsabaka videosu gibi diğer kayıtlarla senkronize etmek için kullanılabilmektedir.

source: For custom logging, the managed ``DataLog`` can be accessed via ``DataLogManager.getLog()``.
tr_tr: Özel veri kaydı için yönetilen ``DataLog``'a ``DataLogManager.getLog()`` ile erişilebilmektedir.

source: Logging Joystick Data
tr_tr: Kumanda Kolu Verilerinin Kaydı

source: DataLogManager by default does not record joystick data. The ``DriverStation`` class provides support for logging of DS control and joystick data via the ``startDataLog()`` function:
tr_tr: DataLogManager varsayılan olarak kumanda kolu verilerini kaydetmemektedir. ``DriverStation`` sınıfı, DS kontrol ve kumanda kolu verilerinin ``startDataLog()`` işlevi üzerinden kaydedilmesini desteklemektedir:

source: Custom Data Logging using DataLog
tr_tr: DataLog ile Özel Veri Kaydı

source: The ``DataLog`` class (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/util/datalog/DataLog.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classwpi_1_1log_1_1_data_log.html>`__, :external:py:class:`Python <wpiutil.log.DataLog>`) and its associated LogEntry classes (e.g. ``BooleanLogEntry``, ``DoubleLogEntry``, etc) provides low-level access for writing data logs.
tr_tr: ``DataLog`` sınıfı (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/util/datalog/DataLog.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classwpi_1_1log_1_1_data_log.html>`__, :external:py:class:`Python <wpiutil.log.DataLog>`) ve ilişkili LogEntry sınıfları (örn. ``BooleanLogEntry``, ``DoubleLogEntry`` vb.) veri günlüklerinin yazımı için alt düzeyli giriş sağlamaktadır.

source: Unlike NetworkTables, there is no change checking performed. **Every** call to a ``LogEntry.append()`` function will result in a record being written to the data log. Checking for changes and only appending to the log when necessary is the responsibility of the caller.
tr_tr: Bu durumda NetworkTables'ın aksine herhangi bir değişiklik kontrolü yapılmamaktadır. ``LogEntry.append()`` işlevine yapılan **her bir** çağrı veri günlüğüne bir kaydın yapılmasıyla sonuçlanacaktır. Değişiklikleri kontrol etmek ve günlüğe sadece gerektiği takdirde eklemeler yapmak, çağırıyı yapan kişinin sorumluluğudur.

source: The LogEntry classes can be used in conjunction with DataLogManager to record values only to a data log and not to NetworkTables:
tr_tr: Değerlerin NetworkTables yerine sadece bir veri günlüğüne kaydedilmesini sağlamak için LogEntry sınıfları DataLogManager ile birlikte kullanılabilmektedir:
