Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/telemetry/robot-telemetry-with-sendable.po
Languages: fr_ca, tr_tr

source: Robot Telemetry with Sendable
fr_ca: Télémesure du robot avec l'interface Sendable
tr_tr: Sendable ile Robot Telemetrisi

source: While the WPILib dashboard APIs allow users to easily send small pieces of data from their robot code to the dashboard, it is often tedious to manually write code for publishing telemetry values from the robot code's operational logic.
fr_ca: Alors que les API des dashboards de la WPILib permettent aux utilisateurs d’envoyer facilement de petites quantités de données de leur code robot vers le dashboard, il est souvent fastidieux d’écrire manuellement du code pour publier des valeurs de télémesure à partir de la logique opérationnelle du code robot.
tr_tr: WPILib gösterge paneli API'ları, kullanıcıların robot kodundan ufak verileri gösterge paneline göndermesine olanak tanıyor olsa da robotun işlemsel mantığından telemetri değerlerinin yayınlanması için elle kod yazmak uğraştırıcı bir işlemdir.

source: A cleaner approach is to leverage the existing object-oriented structure of user code to `declaratively <https://en.wikipedia.org/wiki/Declarative_programming>`__ mark important data fields for telemetry logging. The WPILib framework can then handle the tedious/tricky part of correctly reading from (and, potentially, *writing to*) those fields for you, greatly reducing the total amount of code the user has to write and improving readability.
fr_ca: Une approche plus propre consiste à tirer parti de la structure orientée objet existante du code utilisateur pour `de façon déclarative <https://en.wikipedia.org/wiki/Declarative_programming>`__ marquer des champs de données importantes pour la consignation des données issues de la télémesure. Le framework WPILib peut alors, à votre place, gérer la partie fastidieuse / délicate de la lecture correcte de (et, potentiellement, *de l’écriture dans*) ces champs, réduisant ainsi considérablement la quantité totale de code que l’utilisateur doit écrire et en améliorant la lisibilité.

source: WPILib provides this functionality with the ``Sendable`` interface. Classes that implement ``Sendable`` are able to register value listeners that automatically send data to the dashboard - and, in some cases, receive values back. These classes can be declaratively sent to any of the WPILib dashboards (as one would an ordinary data field), removing the need for teams to write their own code to send/poll for updates.
fr_ca: WPILib fournit cette fonctionnalité par l'intermédiaire de l’interface ``Sendable``. Les classes qui implémentent ``Sendable`` sont capables d’enregistrer des données issues des détecteurs de valeurs qui envoient automatiquement des données au dashboard et, dans certains cas, de recevoir des valeurs en retour. Ces classes peuvent être envoyées de manière déclarative à n’importe lequel des dashboards de la WPILib (comme on le ferait pour un champ de données ordinaire), éliminant ainsi la nécessité pour les équipes d’écrire leur propre code pour envoyer/sonder pour les mises à jour.
tr_tr: WPILib bu işlevselliği ``Sendable`` arayüzüyle sağlamaktadır. ``Sendable`` içeren sınıflar, kendiliğinden gösterge paneline veri gönderen, ve bazı durumlarda panelden geri veri alan, değer dinleyicilerini algılayabilmektedir. Bu sınıflar, takımların güncelleme göndermek/oylamak için kendi kodlarını yazma ihtiyacını ortadan kaldırarak, (sıradan bir veri alanı gibi) bildirimsel olarak herhangi bir WPILib gösterge paneline gönderilebilmektedir.

source: What is Sendable?
fr_ca: Qu’est-ce qu'un Sendable?
tr_tr: Sendable nedir?

source: ``Sendable`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/util/sendable/Sendable.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classwpi_1_1_sendable.html>`__) is an interface provided by WPILib to facilitate robot telemetry. Classes that implement ``Sendable`` can declaratively send their state to the dashboard - once declared, WPILib will automatically send the telemetry values every robot loop. This removes the need for teams to handle the iteration-to-iteration logic of sending and receiving values from the dashboard, and also allows teams to separate their telemetry code from their robot logic.
fr_ca: ``Sendable`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/util/sendable/Sendable.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classwpi_1_1_sendable.html>`__) est une interface fournie par la WPILib pour faciliter les opérations de télémesure sur des robots. Les classes qui implémentent l'interface ``Sendable`` peuvent envoyer de manière déclarative leur état au dashboard - une fois déclarée, la WPILib enverra automatiquement les valeurs de télémesure à chaque itération du code du robot. Cela élimine la nécessité pour les équipes de gérer, d’itération à itération, la logique d’envoi et de réception de valeurs à partir du dashboard, et permet également aux équipes de séparer leur code de télémesure de leur logique opétationnelle de robot.

source: Many WPILib classes (such as :ref:`Commands <docs/software/dashboards/shuffleboard/advanced-usage/shuffleboard-commands-subsystems:Commands and Subsystems>`) already implement ``Sendable``, and so can be sent to the dashboard without any user modification. Users are also able to easily extend their own classes to implement ``Sendable``.
fr_ca: De nombreuses classes de la WPILib (telles que :ref:`Commands <docs/software/dashboards/shuffleboard/advanced-usage/shuffleboard-commands-subsystems:Commands and Subsystems>`) implémentent déjà l'interface ``Sendable``, et peuvent donc être acheminées au dashboard sans aucune modification de la part de l’utilisateur. Les utilisateurs peuvent également étendre facilement leurs propres classes pour implémenter l'interface ``Sendable``.
tr_tr: (:ref:`Commands <docs/software/dashboards/shuffleboard/advanced-usage/shuffleboard-commands-subsystems:Commands and Subsystems>` gibi) birçok WPILib sınıfı çoktan ``Sendable`` içermektedir ve bu sebeple herhangi bir kullanıcı değişikliği olmadan gösterge paneline gönderilebilmektedir. Kullanıcılar aynı zamanda kendi sınıflarını ``Sendable`` içerecek şekilde genişletebilmektedir.

source: The ``Sendable`` interface contains only one method: ``initSendable``. Implementing classes override this method to perform the binding of in-code data values to structured `JSON <https://en.wikipedia.org/wiki/JSON>`__ data, which is then automatically sent to the robot dashboard via NetworkTables. Implementation of the ``Sendable`` interface is discussed in the :ref:`next article<docs/software/telemetry/writing-sendable-classes:Writing Your Own Sendable Classes>`.
fr_ca: L’interface ``Sendable`` ne contient qu’une seule méthode: ``initSendable``. Les classes implémentant l'interface ``Sendable`` remplacent cette méthode pour effectuer la correspondance des valeurs de données issues du code aux données structurées `JSON <https://en.wikipedia.org/wiki/JSON>`__ qui sont ensuite automatiquement envoyées au dashboard du robot via les NetworkTables. L’implémentation de l’interface ``Sendable`` est abordée dans le :ref:`prochain article<docs/software/telemetry/writing-sendable-classes:Writing Your Own Sendable Classes>`.

source: Sending a Sendable to the Dashboard
fr_ca: Acheminenement d’un objet Sendable au dashboard
tr_tr: Gösterge Paneline bir Sendable Gönderilmesi

source: Unlike simple data types, Sendables are automatically kept up-to-date on the dashboard by WPILib, without any further user code - "set it and forget it". Accordingly, they should usually be sent to the dashboard in an initialization block or constructor, *not* in a periodic function.
fr_ca: Contrairement aux types de données primitives, les objet de type Sendable sont automatiquement tenus à jour dans le dashboard par la WPILib, sans autre code utilisateur - "configurez-le et oubliez-le". En conséquence, ils doivent généralement être envoyés au dashboard à travers un bloc d’initialisation ou un constructeur, *pas* dans une méthode périodique.
tr_tr: Basit veri türlerinin aksinde Sendable'lar herhangi ek bir kullanıcı kodu olmadan, "kur ve unut" mantığıyla WPILib tarafından gösterge panelinde kendiliğinden güncellenmektedir. Bu doğrultuda Sendable'lar gösterge paneline periyodik bir fonksiyon yerine bir başlangıç bloku veya constructor içerisinde gönderilmelidir.

source: To send a ``Sendable`` object to the dashboard, simply use the dashboard's ``putData`` method. For example, an "arm" class that uses a :ref:`PID Controller <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>` can automatically log telemetry from the controller by calling the following in its constructor:
fr_ca: Pour envoyer un objet ``Sendable`` au dashboard, utilisez simplement la méthode ``putData`` du dashboard. Par exemple, une classe "arm" qui utilise un :ref:`contrôleur PID <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>` peut automatiquement consigner la télémesure du contrôleur en appelant ce qui suit dans son constructeur :
tr_tr: Gösterge paneline bir ``Sendable`` nesnesi göndermek için sadece gösterge panelinin ``putData`` metodunu kullanmanız yeterli olacaktır. Örneğin, :ref:`PID Kontrolörü <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>` kullanan bir "kol" sınıfı, aşağıdaki constructor'ı çağırarak kontrolörden gelen telemetri verilerini kendiliğinden kaydedebilmektedir:

source: Additionally, some ``Sendable`` classes bind setters to the data values sent *from the dashboard to the robot*, allowing remote tuning of robot parameters.
fr_ca: De plus, certaines classes ``Sendable`` lient les setters ou métodes de réglage aux valeurs des données envoyées *à partir du dashboard vers le robot*, permettant ainsi le réglage à distance des paramètres du robot.
tr_tr: Bunlara ek olarak bazı ``Sendable`` sınıfları, belirleyicileri *gösterge panelinden robota* gönderilen veri değerlerine bağlayabilmekte, böylece robot parametrelerinin uzaktan ayralanmasına olanak tanıyabilmektedir.

source: A cleaner approach is to leverage the existing object-oriented structure of user code to mark important data fields for telemetry logging in a :term:`declarative programming` style. The WPILib framework can then handle the tedious/tricky part of correctly reading from (and, potentially, *writing to*) those fields for you, greatly reducing the total amount of code the user has to write and improving readability.
tr_tr: Daha basit bir yaklaşım, :term:`declarative programming` - bildirimsel programlama tarzında telemetri veri kaydı adına önemli veri alanlarının işaretlenmesi için kullanıcı kodunun varolan nesne odaklı yapısından faydalanmaktır. Bunu takiben WPILib çerçevesi, kullanıcının yazması gereken toplam kod miktarını düşürüp kodun okunabilirliğini arttırarak, işlemin zorlayıcı/sıkıntılı kısmı olan veri alanlarının doğru bir şekilde okunması (ve bu alanlara yazım) işlemlerini sizin adınıza üstlenebilmektedir.

source: ``Sendable`` (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/util/sendable/Sendable.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classwpi_1_1_sendable.html>`__, :external:py:class:`Python <wpiutil.Sendable>`) is an interface provided by WPILib to facilitate robot telemetry. Classes that implement ``Sendable`` can declaratively send their state to the dashboard - once declared, WPILib will automatically send the telemetry values every robot loop. This removes the need for teams to handle the iteration-to-iteration logic of sending and receiving values from the dashboard, and also allows teams to separate their telemetry code from their robot logic.
tr_tr: ``Sendable`` (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/util/sendable/Sendable.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classwpi_1_1_sendable.html>`__, :external:py:class:`Python <wpiutil.Sendable>`), robot telemetrisinin kolaylaştırılması için WPILib tarafından sağalanan bir arayüzdür. ``Sendable`` içeren sınıflar bildirimsel bir şekilde durumlarını gösterge paneline aktarabilirler. Bu durumlar bir kez bildirildiklerinde WPILib telemetri değerlerini her bir robot döngüsüne kendiliğinden gönderecektir. Bu durum takımların döngüden döngüye gösterge paneline veri gönderme ve panelden veri alma mantığını yönetme ihtiyacını ortadan kaldırmakta ve takımlara telemetri kodunu robot mantığından ayırma olanağı tanımaktadır.

source: The ``Sendable`` interface contains only one method: ``initSendable``. Implementing classes override this method to perform the binding of in-code data values to structured :term:`JSON` data, which is then automatically sent to the robot dashboard via NetworkTables. Implementation of the ``Sendable`` interface is discussed in the :ref:`next article<docs/software/telemetry/writing-sendable-classes:Writing Your Own Sendable Classes>`.
tr_tr: ``Sendable`` arayüzü yalnızca bir metod içermektedir: ``initSendable``. Dahil edilen sınıflar, kod içerisindeki veri değerlerinin yapılandırılmış :term:`JSON` verilerine bağlanması için, bu metodu devre dışı bırakmaktadır. Bağlanılan veriler ardından NetworkTables üzerinden robot gösterge paneline kendiliğinden gönderilmektedir. ``Sendable`` arayüzünün nasıl dahil edildiği :ref:`bir sonraki yazıda<docs/software/telemetry/writing-sendable-classes:Writing Your Own Sendable Classes>` ele alınmaktadır.
