Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/system-identification/additional-utils.po
Languages: tr_tr

source: Additional Utilities and Tools
tr_tr: Ek Programlar ve Araçlar

source: This page mainly covers useful information about additional functionality that this tool provides.
tr_tr: Bu sayfa, temel olarak bu aracın sağladığı ek işlevler hakkında faydalı bilgiler içermektedir.

source: ImGui Tips
tr_tr: ImGui İpuçları

source: The following are essentially handy features that come with the ImGui framework that SysId uses:
tr_tr: Aşağıdakiler, SysId'in kullandığı ImGui çerçevesinin belli başlı kullanışlı özelliklerdir:

source: Showing and Hiding Plot Data
tr_tr: Grafik Verilerini Görüntülenmesi ve Gizlenmesi

source: To add or remove certain data from the plots, click on the color of the data that you would like to hide or remove.
tr_tr: Grafiklere belirli verileri eklemek veya grafiklerden belirli verileri çıkarmak için gizlemek veya kaldırmak istediğiniz verilerin rengine tıklayınız.

source: For example, if we want to hide sim data, we can click the green color box.
tr_tr: Örneğin bir simülasyon verisini gizlemek istiyorsak, yeşil renkli kutuya tıklayabiliriz.

source: Where one would need to click to hide sim data on an example plot
tr_tr: Örnek bir grafikte simülasyon verilerini gizlemek için tıklanması gereken yer

source: Picture of a plot after sim is hidden
tr_tr: Simülasyon gizlendikten sonra bir grafiğin resmi

source: Auto Sizing Plots
tr_tr: Grafiklerin Yeniden Boyutlandırılması

source: If you zoom in to plots and want to revert back to the normally sized plots, just double click on the plot and it will automatically resize it.
tr_tr: Grafikleri büyüttükten sonra grafiği normal boyutuna almak istiyorsanız, grafiğin üzerine çift tıklamanızla birlikte grafik kendiliğinden yeniden boyutlandırılacaktır.

source: Here is a plot that is zoomed in:
tr_tr: Büyütülmüş bir grafik aşağıdaki şekildedir:

source: Picture of a plot that is zoomed in
tr_tr: Büyütülmüş bir grafiğin resmi

source: After double clicking, it is automatically resized:
tr_tr: Çift tıklama ile grafik kendiliğinden yeniden ölçeklendirilmektedir:

source: Picture of the previously zoomed in plot that is resized
tr_tr: Önceden yakınlaştırılmış grafiğin yeniden ölçeklendirilmiş halinin resmi

source: Setting Slider Values
tr_tr: Kaydırıcı Değerlerinin Belirlenmesi

source: To set the value of a slider as a number rather than sliding the widget, you can CTRL + Click the slider and it will allow you to input a number.
tr_tr: Bir kaydırıcı değerini, kaydırıcıyı kaydırmak yerine sayı girerek belirlemek için kaydırıcıya CTRL + Sol Tıklayarak sayısal bir değer belirleyebilirsiniz.

source: Here is a regular slider:
tr_tr: Normal bir kaydırıcı aşağıdaki şekildedir:

source: Picture of a regular slider
tr_tr: Normal bir kaydırıcının resmi

source: Here is the input after double clicking the slider:
tr_tr: Kaydırıcıya çift tıklanıldıktan sonra girdi aşağıdaki şekildedir:

source: Picture of the slider as a number entry
tr_tr: Sayısal bir değer girişi yapılmış kaydırıcının resmi
