Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/system-identification/analyzing-gains.po
Languages: tr_tr

source: Analyzing Data
tr_tr: Verilerin Çözümlemesi

source: Feedforward Analysis
tr_tr: İleri Besleme Analizi

source: For information on what the calculated feedback gains mean, see :ref:`docs/software/advanced-controls/introduction/introduction-to-feedforward:The Permanent-Magnet DC Motor Feedforward Equation`. For information on using the calculated feedback gains in code, see :ref:`feedforward control <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`.
tr_tr: Hesaplanmış geri bildirim kazancının ne olduğuna dair bilgi için bkz. :ref:`docs/software/advanced-controls/introduction/introduction-to-feedforward:The Permanent-Magnet DC Motor Feedforward Equation`. Hesaplanmış geri bildirim kazancının kodlamadaki kullanımına dair bilgi için bkz. :ref:`feedforward control <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`.

source: Click the dropdown arrow on the :guilabel:`Feedforward` Section.
tr_tr: :guilabel:`Feedforward` Bölümündeki açılır liste okuna tıklayınız.

source: If you would like to change units, you will have to press the :guilabel:`Override Units` button and fill out the information on the popup.
tr_tr: Birim değiştirmek istiyorsanız, :guilabel:`Override Units` tuşuna basmanız ve açılır penceredeki gerekli bilgileri doldurmanız gerekecektir.

source: Analyzing data for feedforward
tr_tr: İleri besleme için veri çözümlemesi

source: The computed mechanism system parameters will then be displayed.
tr_tr: Bilgileri doldurduktan sonra hesaplanmış düzenek sistemi parametreleri görüntülenecektir.

source: Analysis coefficient results
tr_tr: Çözümleme katsayı sonuçları

source: Feedback Analysis
tr_tr: Geri Bildirim Çözümlemesi

source: These gains are, in effect, "educated guesses" - they are not guaranteed to be perfect, and should be viewed as a "starting point" for further tuning.
tr_tr: Bu kazanımlar gerçekte "bilgiye dayalı tahminlerdir", mükemmel olduklarının garantisi verilemez ve daha fazla ayarlama için bir "başlangıç noktası - starting point" olarak görülmelidirler.

source: To view the feedback constants, click on the dropdown arrow on the :guilabel:`Feedback` section.
tr_tr: Geri bildirim sabitlerini görüntülemek için :guilabel:`Feedback` bölümündeki açılır liste okuna tıklayınız

source: Feedback analysis pane
tr_tr: Geri bildirim çözümlemesi bölmesi

source: This view can be used to calculate optimal feedback gains for a PD or P controller for your mechanism (via :term:`LQR`).
tr_tr: Bu görünüm düzeneğinizde (:term:`LQR` aracılığıyla) PD - Orantısal Türevsel ve P - Orantısal denetleyiciler için en uygun geri bildirim kazançlarının hesaplanması için kullanılabilmektedir.

source: Enter Controller Parameters
tr_tr: Denetleyici Parametrelerini Girin

source: The "Spark Max" preset assumes that the user has configured the controller to operate in the units of analysis with the SPARK MAX API's position/velocity scaling factor feature.
tr_tr: "Spark Max" ön ayarı, kullanıcının denetleyiciyi SPARK MAX API'nin konum/hız ölçekleme katsayısı özelliği ile çözümleme birimlerinde çalışacak şekilde yapılandırdığını varsaymaktadır.

source: The calculated feedforward gains are *dimensioned quantities*. Unfortunately, not much attention is often paid to the units of PID gains in FRC\ |reg| controls, and so the various typical options for PID controller implementations differ in their unit conventions (which are often not made clear to the user).
tr_tr: Hesaplanan ileri besleme kazançları *boyutlandırılmış miktarlardır*. Ne yazık ki, FRC \ |reg| denetleyicilerindeki PID - Orantısal İntegral Türevsel kazançlarda kullanılan ölçü birimlerine pek dikkat edilmemektedir ve bu nedenle PID denetleyici uygulamalarına dair çeşitli tipik seçenekler, ölçüm birimlerinde (genellikle kullanıcıya açıkça belirtilmeyen bir şekilde) farklılık göstermektedir.

source: To specify the correct settings for your PID controller, use the following options.
tr_tr: PID denetleyicinizde doğru ayarları belirlemek için aşağıdaki seçenekleri kullanınız.

source: Picture of the controller settings
tr_tr: Denetleyici ayarlarının resmi

source: :guilabel:`Gain Settings Preset` This drop-down menu will auto-populate the remaining fields with likely settings for one of a number of common FRC controller setups. Note that some settings, such as post-encoder gearing, PPR, and the presence of a follower motor must still be manually specified (as the analyzer has no way of knowing these without user input), and that others may vary from the given defaults depending on user setup.
tr_tr: :guilabel:`Gain Settings Preset-Kazanç Ayarları Ön Ayarı` Bu açılır menü boş kalan alanları yaygın birkaç FRC denetleyici kurulumundan birine uygun ayarlarla kendiliğinden, veri ile, dolduracaktır. Kodlayıcı sonrası dişli düzeni, PPR ve takipçi motorun olup olmadığı gibi bazı ayarların (çözümleyicinin, kullanıcı girdisi olmadan bu ayarları tanıyamaması sebebiyle) elle belirlenmesi gerektiği ve diğer ayarların kullanıcının kurulumuna göre varsayılan ayarlardan farklı olabileceği göz önünde bulundurulmalıdır.

source: :guilabel:`Controller Period` This is the execution period of the control loop, in seconds. The default RIO loop rate is 50Hz, corresponding to a period of 0.02s. The onboard controllers on most "smart controllers" run at 1Khz, or a period of 0.001s.
tr_tr: :guilabel:`Controller Period`, Bu ayar denetleme döngüsünün saniye cinsinden yürütülme süresidir. Varsayılan RIO döngüsünün hızı 0.02 saniyelik bir aralığa karşılık gelen 50 Hz’dir. Çoğu "akıllı denetleyiciler"in üzerindeki tümleşik denetleyiciler 1 Khz'de, veya 0.001 saniyelik bir aralıkla, çalışmaktadır.

source: :guilabel:`Max Controller Output` This is the maximum value of the controller output, with respect to the PID calculation. Most controllers calculate outputs with a maximum value of 1, but Talon controllers have a maximum output of 1023.
tr_tr: :guilabel:`Max Controller Output` Bu ayar, denetleyici çıktısının PID hesaplamasına ilişkim en yüksek değeridir. Çoğu denetleyici çıktı değerlerini en büyük değer 1 olacak şekilde hesaplar, fakat Talon denetleyicilerinin en yüksek değeri 1023'dür.

source: :guilabel:`Time-Normalized Controller` This specifies whether the PID calculation is normalized to the period of execution, which affects the scaling of the D gain.
tr_tr: :guilabel:`Time-Normalized Controller` Bu ayar, D kazancının ölçeklendirilmesini etkileyen PID hesaplamasının yürütülme aralığına göre normalize edilip edilmediğini belirlemektedir.
