Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/trajectory-tutorial/characterizing-drive.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Step 1: Characterizing Your Robot Drive
es_mx: Paso 1: Caracterización de la conducción del robot
fr_ca: Étape 1 : Caractérisation de l'entraînement de votre robot
tr_tr: Adım 1: Robot Sürüşünüzü karakterize etmek
zh_cn: 步骤1: 描述你的机器人驱动器

source: For detailed instructions on using the FRC-Characterization tool, see its :ref:`dedicated documentation <docs/software/wpilib-tools/robot-characterization/introduction:Introduction to Robot Characterization>`.
es_mx: Para instrucciones detalladas sobre el uso de la herramienta de caracterización FRC, ver su :ref:`documentación dedicada <docs/software/wpilib-herramientas/robot-caracterización/introducción:Introducción a la Caracterización de los Robots>`.
fr_ca: Pour des instructions détaillées sur l’utilisation de l’outil FRC-Caractérisation, voir sa :ref:`documentation dédiée <docs/software/wpilib-tools/robot-characterization/introduction:Introduction to Robot Characterization>`.
tr_tr: FRC Karakterizasyon aracını kullanma hakkında ayrıntılı talimatlar için, bkz :ref:`konu ile ilgili dokümantasyon<docs/software/wpilib-tools/robot-characterization/introduction:Introduction to Robot Characterization>`.
zh_cn: 有关使用FRC角色化工具的详细说明，请参见 :ref:`dedicated documentation <docs/software/wpilib-tools/robot-characterization/introduction:Introduction to Robot Characterization>`。

source: The drive characterization process requires ample space for the robot to drive. Be sure to have *at least* a 10' stretch (ideally closer to 20') in which the robot can drive during the characterization routine.
es_mx: El proceso de caracterización de la unidad requiere un amplio espacio para que el robot la maneje. Asegúrese de tener *al menos* un tramo de 10' (idealmente más cercano a 20') en el que el robot pueda conducir durante la rutina de caracterización.
fr_ca: Mettre en oeuvre le processus de caractérisation de l'entraînement nécessite suffisamment d’espace pour que le robot se déplace. Assurez-vous d’avoir *au moins* un tronçon de 10' (idéalement plus proche de 20') dans lequel le robot peut se déplacer pendant la routine de caractérisation.
tr_tr: Sürücü karakterizasyon süreci, robotun hareket etmesi için geniş alan gerektirir. Karakterizasyon rutini sırasında robotun hareket edebileceği *en az * 10' uzatmaya (ideal olarak 20' ye yakın) sahip olduğunuzdan emin olun.
zh_cn: 驱动器表征过程需要足够的空间供机器人移动。确保至少有25.4厘米的空余空间（理想情况下接近50.8厘米），在表征过程中机器人可以在其中移动。

source: The characterization data for this tutorial has been generously provided by Team 5190, who generated it as part of a demonstration of this functionality at the 2019 North Carolina State University P2P Workshop.
es_mx: Los datos de caracterización para este tutorial han sido generosamente proporcionados por el Equipo 5190, que los generó como parte de una demostración de esta funcionalidad en el Taller P2P de la Universidad Estatal de Carolina del Norte en 2019.
fr_ca: Les données de caractérisation de ce didacticiel ont été généreusement fournies par l’Équipe 5190, qui les a générées dans le cadre d’une démonstration de cette fonctionnalité pour l'atelier 2019 North Carolina State University P2P Workshop.
tr_tr: Bu eğiticinin karakterizasyon verileri, 2019 North Carolina Eyalet Üniversitesi P2P Çalıştayında bu işlevselliğin gösteriminin bir parçası olarak onu oluşturan Team 5190 tarafından cömertçe sağlanmıştır.
zh_cn: 该教程的特征数据由5190团队慷慨提供，该团队在2019年北卡罗来纳州立大学P2P研讨会上演示了此功能，以作为其功能的一部分。

source: Before accurately following a path with a robot, it is important to have an accurate model for how the robot moves in response to its control inputs. Determining such a model is a process called "system identification." WPILib's FRC-Characterization is a tool for drive system identification.
es_mx: Antes de seguir con precisión una trayectoria con un robot, es importante tener un modelo exacto de cómo se mueve el robot en respuesta a sus entradas de control. Determinar tal modelo es un proceso llamado "identificación del sistema". La caracterización FRC de WPILib es una herramienta para la identificación de sistemas de accionamiento.
fr_ca: Avant de suivre une trajectoire avec précision à l'aide d'un robot, il est important d’avoir un modèle précis de la façon dont le robot se déplace en réponse à ses entrées de commandes. La détermination d’un tel modèle se fait à travers un processus appelé "identification du système". WPILib’s FRC-Caractérisation est un outil qui permet, entre autres choses, de faire l’identification du système d’entraînement.
tr_tr: Bir robotla bir yolu doğru bir şekilde takip etmeden önce, robotun kontrol girdilerine yanıt olarak nasıl hareket ettiğine dair doğru bir modele sahip olmak önemlidir. Böyle bir modelin belirlenmesi, "system identification-sistem tanımlama" adı verilen bir süreçtir. WPILib'in FRC-Karakterizasyonu, sürücü sistemi tanımlaması için bir araçtır.
zh_cn: 在令机器人准确地按照路径移动之前，重要的是要有一个能让机器人准确响应控制输入的移动模型。确定这样一个模型的过程称为“系统识别”。“WPILib的frc特性是一种用于驱动系统识别的工具。

source: Gathering the Data
es_mx: Recopilación de los datos
fr_ca: Collecte des données
tr_tr: Veri toplama
zh_cn: 收集数据

source: We begin by gathering our drive characterization data.
es_mx: Empezamos por reunir los datos de caracterización de conducción.
fr_ca: Nous commençons par recueillir nos données de caractérisation de l'entraînement.
tr_tr: Sürücü karakterizasyon verilerimizi toplayarak başlıyoruz.
zh_cn: 我们首先收集驱动器特性数据。

source: :ref:`Generate a robot project <docs/software/wpilib-tools/robot-characterization/generating-project:Generating a Project>`.
es_mx: :ref:`Generar un proyecto de robot <docs/software/wpilib-herramientas/robot-caracterización/generar-proyecto:Generar un proyecto>`.
fr_ca: :ref:`Générer un projet de robot <docs/software/wpilib-tools/robot-characterization/generating-project:Generating a Project>`.
tr_tr: :ref:`Bir rovot projesi üretmek<docs/software/wpilib-tools/robot-characterization/generating-project:Generating a Project>`.

source: Our example project uses the "simple" project type. Other project types (e.g. Talon and NEO) can be used without much difference; however, be *sure* to specify the required robot parameters correctly, regardless of project type!
es_mx: Nuestro proyecto de ejemplo utiliza el tipo de proyecto "simple". Otros tipos de proyectos (por ejemplo, Talon y NEO) pueden utilizarse sin mucha diferencia; sin embargo, ¡asegúrese de especificar correctamente los parámetros requeridos del robot, independientemente del tipo de proyecto!
fr_ca: Notre exemple de projet utilise le type de "simple" projet. D’autres types de projets (p. ex. Talon et NEO) peuvent être utilisés sans grande différence; cependant, *assurez-vous* de spécifier correctement les paramètres du robot requis, quel que soit le type de projet!
tr_tr: Örnek projemiz "simple" proje türünü kullanır. Diğer proje türleri (örneğin, Talon ve NEO) çok fazla fark olmadan kullanılabilir; ancak proje türünden bağımsız olarak gerekli robot parametrelerini doğru şekilde belirlediğinizden *emin olun*!
zh_cn: 我们的示例项目使用“simple”项目类型。其他项目类型(如Talon和NEO)可以使用，没有太大区别;但是，无论项目类型如何，一定要正确指定所需的机器人参数!

source: WPILib's trajectory library assumes units of meters are used universally for distance - accordingly, be certain that your robot's wheel diameter is specified in meters!
es_mx: La biblioteca de trayectoria de WPILib asume que las unidades de metros se usan universalmente para la distancia - por lo tanto, ¡asegúrate de que el diámetro de la rueda de tu robot esté especificado en metros!
fr_ca: La bibliothèque de trajectoire de WPILib suppose que les mètres sont les unités utilisées universellement pour la distance - en conséquence, assurez-vous que le diamètre de la roue de votre robot est spécifié en mètres!
tr_tr: WPILib'in yörünge kitaplığı, metre birimlerinin mesafe için evrensel olarak kullanıldığını varsayar - buna göre, robotunuzun tekerlek çapının metre cinsinden belirtildiğinden emin olun!
zh_cn: WPILib的轨迹库假定普遍使用米为单位的距离-因此，请确保您的机器人的车轮直径以米为单位指定！

source: :ref:`Deploy the robot project <docs/software/wpilib-tools/robot-characterization/deploying-project:Deploying a Project>`.
es_mx: :ref:`Desplegar el proyecto de robot <docs/software/wpilib-herramientas/robot-caracterización/Desplegar-proyecto:Desplegar un proyecto>`.
tr_tr: :ref:`Robot projesini yüklemek<docs/software/wpilib-tools/robot-characterization/deploying-project:Deploying a Project>`.

source: :ref:`Run the Characterization Routine <docs/software/wpilib-tools/robot-characterization/characterization-routine:Running the Characterization Routine>`.
es_mx: :ref:`Ejecución de la Rutina de Caracterización <docs/software/wpilib-herramientas/robot-caracterización/rutina de caracterización:Ejecución de la Rutina de Caracterización>`.
tr_tr: :ref:`Karakterizasyon Rutinini Çalıştır <docs/software/wpilib-tools/robot-characterization/characterization-routine:Running the Characterization Routine>`.

source: Analyzing the Data
es_mx: Análisis de los datos
fr_ca: Analyse des données
tr_tr: Veriti analiz etmek
zh_cn: 分析数据

source: Once the characterization routine has been run and the data file has been saved, it is time to :ref:`open it in the analysis pane <docs/software/wpilib-tools/robot-characterization/analyzing-data:Analyzing Data>`.
es_mx: Una vez que se ha ejecutado la rutina de caracterización y se ha guardado el archivo de datos, es el momento de :ref:`abrirlo en el panel de análisis <docs/software/wpilib-herramientas/robot-caracterización/análisis-datos:Análisis datos>`.
fr_ca: Une fois que la routine de caractérisation a été exécutée et que le fichier de données a été enregistré, il est temps d' :ref:`ouvrir celui-ci dans le volet d’analyse <docs/software/wpilib-tools/robot-characterization/analyzing-data:Analyzing Data>`.
tr_tr: Karakterizasyon rutini çalıştırıldıktan ve veri dosyası kaydedildikten sonra, sıra :ref:`analiz bölmesinde <docs/software/wpilib-tools/robot-characterization/analyzing-data:Analyzing Data>`.
zh_cn: 一旦运行了特性描述例程并保存了数据文件，就可以进行:ref:`open it in the analysis pane <docs/software/wpilib-tools/robot-characterization/analyzing-data:Analyzing Data>`

source: Checking Diagnostics
es_mx: Chequeo de Diagnósticos
fr_ca: Vérification des diagnostics
tr_tr: Teşhis Kontrolü
zh_cn: 检查诊断

source: Per the :ref:`FRC-Characterization guide <docs/software/wpilib-tools/robot-characterization/viewing-diagnostics:Viewing Diagnostics>`, we first view the diagnostics to ensure that our data look reasonable:
es_mx: Según la :ref:`FRC-Guía de Caracterización <docs/software/wpilib-herramientas/robot-caracterización/visualización-diagnóstico:Visualización de Diagnósticos>`, primero vemos los diagnósticos para asegurarnos de que nuestros datos se vean razonables:
fr_ca: Par le :ref:`guide FRC-Characterization <docs/software/wpilib-tools/robot-characterization/viewing-diagnostics:Viewing Diagnostics>`, nous examinons d’abord les diagnostics afin de nous assurer que nos données semblent raisonnables:
tr_tr: :ref:`FRC-Karakterizasyon kılavuzu <docs/software/wpilib-tools/robot-characterization/viewing-diagnostics:Viewing Diagnostics>` uyarınca, verilerimizin makul görünmesini sağlamak için önce tanılamayı inceliyoruz:
zh_cn: 根据:ref:`FRC-Characterization guide <docs/software/wpilib-tools/robot-characterization/viewing-diagnostics:Viewing Diagnostics>`，我们首先查看诊断以确保我们的数据看起来合理：

source: As our data look reasonably linear and our threshold seems to be set correctly, we may move on to the next step.
es_mx: Como nuestros datos se ven razonablemente lineales y nuestro umbral parece estar establecido correctamente, podemos pasar al siguiente paso.
fr_ca: Comme nos données paraissent raisonnablement linéaires et que notre seuil semble être fixé correctement, nous pouvons passer à l’étape suivante.
tr_tr: Verilerimiz makul derecede doğrusal göründüğünden ve eşik değerimiz doğru ayarlanmış gibi göründüğünden, bir sonraki adıma geçebiliriz.
zh_cn: 当我们的数据看起来相当线性并且阈值设置正确时，我们可以进入下一个步骤。

source: Record Feedforward Gains
es_mx: Registro de ganancias de compensación
fr_ca: Enregistrer les gains de commande Feedforward
tr_tr: İleri Bildirim Kazançlarını kaydetmek
zh_cn: 记录前馈增益

source: Feedforward gains do *not*, in general, transfer across robots. Do *not* use the gains from this tutorial for your own robot.
es_mx: Las ganancias de compensación no se transfieren, en general, a través de los robots. No uses las ganancias de este tutorial para tu propio robot.
fr_ca: Les gains de commande prédictive ou Feedforward ne se transfèrent *pas*, en général, entre les robots. Aussi, n’utilisez *pas* les gains de ce tutoriel pour votre propre robot.
tr_tr: Feedforward-İlerbesleme kazançları genel olarak robotlar arasında transfer *edilemez*. Bu eğitimden elde edilen kazançları kendi robotunuz için *kullanmayın*.
zh_cn: 一般来说，前馈增益不会在机器人之间转移。不要直接把本教程中的数据应用到自己的机器人上。

source: We now record the feedforward gains calculated by the tool:
es_mx: Ahora registramos las ganancias de compensación calculadas por la herramienta:
fr_ca: Nous enregistrons maintenant les gains de commande prédictive calculés par l’outil :
tr_tr: Şimdi araç tarafından hesaplanan ileribesleme kazançlarını kaydediyoruz:
zh_cn: 我们现在记录工具计算的前馈增益:

source: Since our wheel diameter was specified in meters, our feedforward gains are in the following units:
es_mx: Como el diámetro de nuestra rueda se especificó en metros, nuestras ganancias de compensación están en las siguientes unidades:
fr_ca: Puisque notre diamètre de roue a été spécifié en mètres, nos gains de prédiction sont dans les unités suivantes:
tr_tr: Tekerlek çapımız metre olarak belirtildiğinden, ileriye dönük kazançlarımız aşağıdaki birimlerdedir:
zh_cn: 由于我们的车轮直径以米为单位，我们的前馈增益的单位如下:

source: ``kV``: Volts * Seconds / Meters
es_mx: ``kV``: Volts * Segundos / Metros
zh_cn: kV:伏特*秒/米

source: ``kA``: Volts * Seconds^2 / Meters
es_mx: ``kV``: Volts * Segundos^2 / Metros
zh_cn: kA:伏*秒^2 /米

source: If you have specified your units correctly, your feedforward gains will likely be within an order of magnitude of the ones reported here (a possible exception exists for ``kA``, which may be vanishingly small if your robot is light). If they are not, it is possible you specified one of your drive parameters incorrectly when generating your robot project. A good test for this is to calculate the "theoretical" value of ``kV``, which is 12 volts divided by the theoretical free speed of your drivetrain (which is, in turn, the free speed of the motor times the wheel circumference divided by the gear reduction). This value should agree very closely with the ``kV`` measured by the tool - if it does not, you have likely made an error somewhere.
es_mx: Si ha especificado sus unidades correctamente, sus ganancias de compensación estarán probablemente dentro de un orden de magnitud de las reportadas aquí (existe una posible excepción para ``kA``, que puede ser muy pequeña si su robot es liviano). Si no lo son, es posible que haya especificado uno de sus parámetros de conducción de forma incorrecta al generar su proyecto de robot. Una buena prueba para esto es calcular el valor "teórico" de ``kV``, que es 12 voltios dividido por la velocidad libre teórica de su transmisión (que es, a su vez, la velocidad libre del motor multiplicada por la circunferencia de la rueda dividida por la reducción del engranaje). Este valor debe coincidir muy estrechamente con el ``kV`` medido por la herramienta - si no es así, es probable que hayas cometido un error en algún lugar.
fr_ca: Si vous avez correctement spécifié vos unités, vos gains de commande prédictive seront probablement dans un ordre de grandeur de ceux du présent tutoriel (une exception possible existe pour ``kA``, qui peut être beaucoup plus petite si votre robot est léger). Si ce n’est pas le cas, il est possible que vous ayiez incorrectement spécifié un de vos paramètres du système d'entraînement lors de la génération de votre projet de robot. Pour cela, un bon test est de calculer la valeur "théorique" de ``kV``, qui est de 12 volts divisé par la vitesse libre théorique de votre base pilotable (qui est, à son tour, la vitesse libre du moteur multipliée par la circonférence de la roue divisée par le rapport d'engrenage). Cette valeur devrait être très proche du '``kV`` mesuré par l’outil - si ce n’est pas le cas, vous avez probablement fait une erreur quelque part.
tr_tr: Birimlerinizi doğru bir şekilde belirlediyseniz, ileriye dönük kazanımlarınız muhtemelen burada bildirilenlerin büyüklüğü içinde olacaktır (``kA`` için olası bir istisna mevcuttur ve robotunuz hafifse kaybolacak kadar küçük olabilir). Değilse, robot projenizi oluştururken sürücü parametrelerinizden birini yanlış belirtmiş olabilirsiniz. Bunun için iyi bir test, 12 volt olan ``kV`` nin "teorik" değerini, aktarma sisteminizin teorik serbest hızına (bu da motorun serbest hızının tekerlek çevresi ile çarpılmasının dişli redüksiyonuna bölünmesine karşılık gelir) hesaplamaktır. Bu değer, alet tarafından ölçülen ``kV`` ile çok yakından uyuşmalıdır - eğer uymuyorsa, muhtemelen bir yerde bir hata yapmışsınızdır.
zh_cn: 如果你正确地指定了你的单位，你的前馈增益可能会在这里报告的一个数量级内(一个例外的“kA”可能存在，如果你的机器人很轻，它可能会小得难以察觉)。如果它们不是，则有可能是您在生成robot项目时指定的某个驱动器参数不正确。一个很好的测试方法是计算“kV”的“理论”值，即12伏电压除以传动系统的理论自由速度(反过来说，就是电机的自由速度乘以轮子的周长除以齿轮减速比)。这个值应该非常接近使用工具测量出的“kV”值-如果它们差距很大，你肯定在某处出错了。

source: Calculate Feedback Gains
es_mx: Cálculo de las ganancias de la retroalimentación
fr_ca: Calculer les gains de rétroaction
tr_tr: Geri besleme kazançlarını hesaplama
zh_cn: 计算反馈增益

source: Feedback gains do *not*, in general, transfer across robots. Do *not* use the gains from this tutorial for your own robot.
es_mx: Las ganancias de la retroalimentación no se transfieren, en general, a través de los robots. No uses las ganancias de este tutorial para tu propio robot.
fr_ca: Les gains de rétroaction ne se transfèrent *pas*, en général, entre les robots. Aussi, n’utilisez pas les gains de ce tutoriel pour votre propre robot.
tr_tr: Geribesleme kazanımları genel olarak robotlar arasında aktarılmaz. Bu eğitimde bahsedilen kazançları kendi robotunuz için *kullanmayın* .
zh_cn: 一般来说，反馈增益不会在机器人之间转移。不要直接把本教程中的数据应用到自己的机器人上。

source: We now :ref:`calculate the feedback gains <docs/software/wpilib-tools/robot-characterization/analyzing-feedback:Feedback Analysis>` for the PID control that we will use to follow the path. Trajectory following with WPILib's RAMSETE controller uses velocity closed-loop control, so we first select ``Velocity`` mode in the characterization tool:
es_mx: Ahora :ref:`calcularemos las ganancias de retroalimentación <docs/software/wpilib-herramientas/robot-caracterización/análisis-retroalimentacion:Analisis de Retroalimentación>` para el control PID que usaremos para seguir el camino. El seguimiento de la trayectoria con el controlador RAMSETE de WPILib utiliza un control de velocidad en bucle cerrado, por lo que primero seleccionamos el modo ``Velocidad`` en la herramienta de caracterización:
fr_ca: À présent nous :ref:`calculons les gains de rétroaction <docs/software/wpilib-tools/robot-characterization/analyzing-feedback:Feedback Analysis>` pour le contrôle PID que nous allons utiliser pour suivre la trajectoire. Le suivi de trajectoire à l'aide du contrôleur RAMSETE de WPILib utilise un contrôle de vitesse en boucle fermée, aussi nous sélectionnons d’abord le mode ``Velocity`` dans l’outil de caractérisation :
tr_tr: Şimdi yolu takip etmek için kullanacağımız PID kontrolü için :ref:`geri besleme kazanımlarını <docs/software/wpilib-tools/robot-characterization/analyzing-feedback:Feedback Analysis>` hesaplayacağız. WPILib'in RAMSETE denetleyicisi ile takip edilen yörünge, hız kapalı döngü kontrolünü kullanır, bu nedenle önce karakterizasyon aracında ``Velocity`` modunu seçeriz:
zh_cn: 现在，我们调用用于PID控制的 :ref:`calculate the feedback gains <docs/software/wpilib-tools/robot-characterization/analyzing-feedback:Feedback Analysis>` 。WPILib的RAMSETE控制器遵循的轨迹使用速度闭环控制，因此我们首先在特征化工具中选择“速度”模式：

source: Since we will be using the WPILib PIDController for our velocity loop, we furthermore select the ``WPILib (2020-)`` option from the drop-down "presets" menu. This is *very* important, as the feedback gains will not be in the correct units if we do not select the correct preset:
es_mx: Como usaremos el controlador PID WPILib para nuestro bucle de velocidad, seleccionaremos además la opción "WPILib (2020-)`` del menú desplegable "preestablecidos". Esto es *muy* importante, ya que las ganancias de retroalimentación no estarán en las unidades correctas si no seleccionamos el preestablecido correcto:
fr_ca: Puisque nous utiliserons lePIDController WPILib pour notre boucle de vitesse, nous sélectionnons en outre l’option ``WPILib (2020-)`` dans le menu déroulant "presets". Ceci est *très* important, car les gains de rétroaction ne seront pas dans les unités concordantes si nous ne sélectionnons pas le bon préréglage:
tr_tr: Hız döngümüz için WPILib PIDController'ı kullanacağımızdan, ayrıca açılır "presets" menüsünden ``WPILib (2020-)``seçeneğini seçiyoruz. Doğru ön ayarı seçmezsek geri bildirim kazanımları doğru birimlerde olmayacağından bu *çok* önemlidir:
zh_cn: 由于我们将在速度回路中使用WPILib PIDController，因此我们还从下拉式“预设”菜单中选择了“ WPILib（2020-）”选项。这非常重要，因为如果我们没有选择正确的预设，反馈增益的单位会出错：

source: Finally, we calculate and record the feedback gains for our control loop. Since it is a velocity controller, only a P gain is required:
es_mx: Finalmente, calculamos y registramos las ganancias de retroalimentación para nuestro bucle de control. Como es un controlador de velocidad, sólo se requiere una ganancia P:
fr_ca: Enfin, nous calculons et enregistrons les gains de rétroaction pour notre boucle de contrôle. Puisqu’il s’agit d’un contrôleur de vitesse, seul un gain P est requis :
tr_tr: Son olarak, kontrol döngümüz için geri bildirim kazanımlarını hesaplıyor ve kaydediyoruz. Hız kontrolörü olduğundan, sadece bir P kazancı gereklidir:
zh_cn: 最后，我们计算并记录控制回路的反馈增益。由于它是一个速度控制器，只需要一个P增益:

source: Assuming we have done everything correctly, our proportional gain will be in units of Volts * Seconds / Meters. Thus, our calculated gain means that, for each meter per second of velocity error, the controller will output an additional 8.5 volts.
es_mx: Asumiendo que hemos hecho todo correctamente, nuestra ganancia proporcional será en unidades de Voltios * Segundos / Metros. Así, nuestra ganancia calculada significa que, por cada metro por segundo de error de velocidad, el controlador emitirá 8,5 voltios adicionales.
fr_ca: En supposant que nous avons tout fait correctement, notre gain proportionnel sera en unités de Volts * Seconds / Meters. Ainsi, notre gain calculé signifie que, pour chaque mètre par seconde d’erreur de vitesse, le contrôleur sortira 8,5 volts supplémentaires.
tr_tr: Her şeyi doğru yaptığımızı varsayarsak, orantılı kazancımız Volt * Saniye / Metre cinsinden olacaktır. Bu nedenle, hesapladığımız kazancımız, her bir metre / saniye hız hatası için kontrolörün ek olarak 8,5 volt vereceği anlamına gelir.
zh_cn: 假设我们已正确完成所有操作，则比例增益将以伏特*秒/米为单位。因此，我们计算出的增益意味着，对于每秒每米的速度误差，控制器将额外输出8.5伏。

source: |Feedforward Gains|
tr_tr: |Feedforward Gains-İleribesleme kazançları|

source: |Feedback Gains|
tr_tr: |Feedback Gains-Geribesleme kazançları|

source: ``kS``: Volts
zh_cn: ``kS``: 伏特
