Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/trajectory-tutorial/creating-drive-subsystem.po
Languages: es_mx, tr_tr, zh_cn

source: Step 3: Creating a Drive Subsystem
es_mx: Paso 3: creación de un subsistema de desplazamiento o drive
tr_tr: 3. Adım: Bir Sürücü Alt Sistemi Oluşturma
zh_cn: 步骤3：创建驱动器子系统

source: Now that our drive is characterized, it is time to start writing our robot code *proper*. As mentioned before, we will use the :ref:`command-based <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` framework for our robot code. Accordingly, our first step is to write a suitable drive :ref:`subsystem <docs/software/commandbased/subsystems:Subsystems>` class.
es_mx: Ahora que nuestra unidad está caracterizada, es hora de comenzar a escribir nuestro código de robot *adecuadamente*. Como se mencionó anteriormente, utilizaremos el Framework :ref:`command-based <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` para nuestro código de robot. En consecuencia, nuestro primer paso es escribir una clase adecuada :ref:`subsistema <docs/software/commandbased/subsystems:Subsystems>` .
tr_tr: Artık sürücümüzün özelliği belirlendiğine göre, robot kodumuzu *doğru* yazmaya başlamanın zamanı geldi. Daha önce de belirtildiği gibi, robot kodumuz için :ref:`komut tabanlı <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` çerçevesini kullanacağız. Buna göre, ilk adımımız uygun bir sürücü yazmaktır :ref:`subsystem<docs/software/commandbased/subsystems:Subsystems>` 'sınıfı.
zh_cn: 既然我们的驱动器已经有了特征，是时候开始编写适当的机器人代码了。如前所述，我们将使用:ref:`command-based <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`的框架来编写我们的机器人代码。因此，我们的第一步是编写一个合适的驱动器 :ref:`subsystem <docs/software/commandbased/subsystems:Subsystems>` 类。

source: The full drive class from the RamseteCommand Example Project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) can be seen below. The rest of the article will describe the steps involved in writing this class.
es_mx: La clase de drive completa del RamseteCommand Example Project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) se puede ver a continuación. El resto del artículo describirá los pasos necesarios para escribir esta clase.
zh_cn: 可以在下面看到RamseteCommand示例项目的完整驱动器类（Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand> __，C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand> __）。本文的其余部分将描述编写此类的步骤。

source: Configuring the Drive Encoders
es_mx: Configuración de los codificadores de unidad
tr_tr: Drive-Sürüş Kodlayıcılarını-Encoder Yapılandırma
zh_cn: 配置驱动器编码器

source: The drive encoders measure the rotation of the wheels on each side of the drive. To properly configure the encoders, we need to specify two things: the ports the encoders are plugged into, and the distance per encoder pulse. Then, we need to write methods allowing access to the encoder values from code that uses the subsystem.
es_mx: Los codificadores de transmisión miden la rotación de las ruedas en cada lado de la transmisión. Para configurar correctamente los codificadores, necesitamos especificar dos cosas: los puertos a los que están conectados los codificadores y la distancia por pulso del codificador. Luego, necesitamos escribir métodos que permitan el acceso a los valores del codificador desde el código que usa el subsistema.
tr_tr: Sürücü encoderleri, sürücünün her iki yanındaki tekerleklerin dönüşünü ölçer. Kodlayıcıları doğru şekilde yapılandırmak için iki şeyi belirtmemiz gerekir: kodlayıcıların takılı olduğu bağlantı noktaları ve kodlayıcı darbesi başına mesafe. Ardından, alt sistemi kullanan koddan kodlayıcı değerlerine erişime izin veren yöntemler yazmamız gerekir.
zh_cn: 驱动器编码器测量驱动器两侧的车轮旋转。为了正确配置编码器，我们需要指定两件事：编码器插入的端口以及每个编码器脉冲的距离。然后，我们需要编写允许从使用子系统的代码访问编码器值的方法。

source: Encoder Ports
es_mx: Puertos del codificador
tr_tr: Encoder Portları
zh_cn: 编码器端口

source: The encoder ports are specified in the encoder's constructor, like so:
es_mx: Los puertos del codificador se especifican en el constructor del codificador, así:
tr_tr: Kodlayıcı bağlantı noktaları, kodlayıcının constructtor'ında şu şekilde belirtilir:
zh_cn: 编码器端口在编码器的构造函数中指定，如下所示：

source: Encoder Distance per Pulse
es_mx: Distancia del codificador por pulso
tr_tr: Darbe Başına Enkoder Mesafesi
zh_cn: 每个脉冲的编码器距离

source: The distance per pulse is specified by calling the encoder's ``setDistancePerPulse`` method. Note that for the WPILib Encoder class, "pulse" refers to a full encoder cycle (i.e. four edges), and thus will be 1/4 the value that was specified in the FRC-Characterization config. Remember, as well, that the distance should be measured in meters!
es_mx: La distancia por pulso se especifica llamando al método ``setDistancePerPulse`` del codificador. Tenga en cuenta que para la clase de codificador WPILib, "pulso" se refiere a un ciclo de codificador completo (es decir, cuatro bordes) y, por lo tanto, será 1/4 del valor que se especificó en la configuración de caracterización de FRC. Recuerde también que la distancia debe medirse en metros!
tr_tr: Darbe başına mesafe, kodlayıcının ``setDistancePerPulse`` yöntemi çağrılarak belirlenir. WPILib Encoder sınıfı için "pulse", tam bir kodlayıcı döngüsüne (yani dört kenar) karşılık gelir ve bu nedenle FRC-Karakterizasyon yapılandırmasında belirtilen değerin 1/4'ü olacaktır. Ayrıca mesafenin metre cinsinden ölçülmesi gerektiğini de unutmayın!
zh_cn: 通过调用编码器的setDistancePerPulse方法指定每个脉冲的距离。请注意，对于WPILib编码器类，“脉冲”是指完整的编码器周期（即四个边沿），因此将是FRC字符配置中指定的值的1/4。还要记住，距离应以米为单位！

source: Encoder Accessor Method
es_mx: Método de acceso del codificador
tr_tr: Encoder Accessor Erişimci Yöntemi
zh_cn: 编码器访问器方法

source: To access the values measured by the encoders, we include the following method:
es_mx: Para acceder a los valores medidos por los codificadores, incluimos el siguiente método:
tr_tr: Kodlayıcılar tarafından ölçülen değerlere erişmek için aşağıdaki yöntemi dahil ediyoruz:
zh_cn: 要访问编码器测量的值，我们包括以下方法：

source: The returned velocities **must** be in meters! Because we configured the distance per pulse on the encoders above, calling ``getRate()`` will automatically apply the conversion factor from encoder units to meters. If you are not using WPILib's ``Encoder`` class, you must perform this conversion either through the respective vendor's API or by manually multiplying by a conversion factor.
es_mx: ¡Las velocidades devueltas **deben** estar en metros! Dado que hemos configurado la distancia por pulso en los codificadores anteriormente, al llamar a ``getRate()`` se aplicará automáticamente el factor de conversión de las unidades del codificador a metros. Si no estás usando la clase ``Encoder`` de WPILib, debes realizar esta conversión a través de la API del proveedor respectivo o multiplicando manualmente por un factor de conversión.
zh_cn: 返回速度**必须**用米!因为我们在上面的编码器上配置了每个脉冲的距离，调用' ' getRate() ' '将自动应用从编码器单位到米的转换因子。如果你没有使用WPILib的' ' Encoder ' '类，你必须通过相应供应商的API或者手动乘以一个转换因子来执行这个转换。

source: We wrap the measured encoder values in a ``DifferentialDriveWheelSpeeds`` object for easier integration with the ``RamseteCommand`` class later on.
es_mx: Envolvemos los valores medidos del codificador en un objeto ``DifferentialDriveWheelSpeeds`` para facilitar la integración con la clase ``RamseteCommand`` más adelante.
tr_tr: Ölçülen kodlayıcı değerlerini daha sonra ``RamseteCommand`` sınıfıyla daha kolay entegrasyon için bir ``DifferentialDriveWheelSpeeds`` nesnesine bağlıyoruz.
zh_cn: 我们将测量的编码器值包装在“ DifferentialDriveWheelSpeeds”对象中，以便稍后与“ RamseteCommand”类更轻松地集成。

source: Configuring the Gyroscope
es_mx: Configurar el giroscopio
tr_tr: Jiroskopu Yapılandırma
zh_cn: 配置陀螺仪

source: The gyroscope measures the rate of change of the robot's heading (which can then be integrated to provide a measurement of the robot's heading relative to when it first turned on). In our example, we use the `Analog Devices ADXRS450 FRC Gyro Board <https://www.analog.com/en/landing-pages/001/first.html>`__, which has been included in the kit of parts for several years:
es_mx: El giroscopio mide la tasa de cambio del rumbo del robot (que luego se puede integrar para proporcionar una medida del rumbo del robot en relación con la primera vez que se encendió). En nuestro ejemplo, utilizamos el `Analog Devices ADXRS450 FRC Gyro Board <https://www.analog.com/en/landing-pages/001/first.html>`__, que se ha incluido en el kit de piezas durante varios años:
tr_tr: Jiroskop, robotun yönünün değişim oranını ölçer (daha sonra, robotun yönünün ilk açıldığı zamana göre bir ölçümünü sağlamak için entegre edilebilir). Örneğimizde, birkaç yıldır parça kitinde bulunan `Analog Devices ADXRS450 FRC Gyro Board <https://www.analog.com/en/landing-pages/001/first.html>` __ 'ı kullanıyoruz:
zh_cn: 陀螺仪测量机器人的航向变化率（然后可以将其集成以提供相对于机器人首次开启时的机器人航向的测量值）。在我们的示例中，我们使用了`Analog Devices ADXRS450 FRC陀螺仪板<https://www.analog.com/en/landing-pages/001/first.html>`__，它已包含在零件套件中已有多年了：

source: Gyroscope Accessor Method
es_mx: Método de acceso al giroscopio
tr_tr: Jiroskop Accessor Yöntemi
zh_cn: 陀螺仪访问器方法

source: To access the current heading measured by the gyroscope, we include the following method:
es_mx: Para acceder al rumbo actual medido por el giroscopio, incluimos el siguiente método:
tr_tr: Jiroskop tarafından ölçülen varolan yönelim yönüne erişmek için aşağıdaki yöntemi dahil ediyoruz:
zh_cn: 要访问由陀螺仪测量的当前航向，我们包括以下方法：

source: Configuring the Odometry
es_mx: Configuración de la odometría
tr_tr: Odemetriyi yapılandırma
zh_cn: 配置里程表

source: Now that we have our encoders and gyroscope configured, it is time to set up our drive subsystem to automatically compute its position from the encoder and gyroscope readings.
es_mx: Ahora que tenemos nuestros codificadores y giroscopio configurados, es hora de configurar nuestro subsistema de transmisión para calcular automáticamente su posición a partir de las lecturas del codificador y del giroscopio.
tr_tr: Artık kodlayıcılarımızı ve jiroskopumuzu yapılandırdığımıza göre, konumunu kodlayıcı ve jiroskop okumalarından otomatik olarak hesaplamak için sürücü alt sistemimizi kurmanın zamanı geldi.
zh_cn: 现在我们已经配置了编码器和陀螺仪，是时候设置驱动子系统以根据编码器和陀螺仪的读数自动计算其位置了。

source: First, we create a member instance of the ``DifferentialDriveOdometry`` class:
es_mx: Primero, creamos una instancia de miembro de la clase ``DifferentialDriveOdometry``:
tr_tr: İlk olarak, ``DifferentialDriveOdometry`` sınıfınına üye bir örneğini oluşturuyoruz:
zh_cn: 首先，我们创建“DifferentialDriveOdometry”类的成员实例：

source: Updating the Odometry
es_mx: Actualización de la odometría
tr_tr: Odemetriyi Güncelleme
zh_cn: 更新里程表

source: The odometry class must be regularly updated to incorporate new readings from the encoder and gyroscope. We accomplish this inside the subsystem's ``periodic`` method, which is automatically called once per main loop iteration:
es_mx: La clase de odometría debe actualizarse periódicamente para incorporar nuevas lecturas del codificador y el giroscopio. Logramos esto dentro del método ``periódico`` del subsistema, que se llama automáticamente una vez por iteración del ciclo principal:
tr_tr: Odometri sınıfı, kodlayıcı ve jiroskoptan gelen yeni okumaları dahil etmek için düzenli olarak güncellenmelidir. Bunu, her main loop yinelemesinde otomatik olarak bir kez çağrılan alt sistemin ``periodic`` yöntemi içinde gerçekleştiriyoruz:
zh_cn: 必须定期更新测距类，以结合来自编码器和陀螺仪的新读数。我们在子系统的“定期”方法中完成此操作，该方法在每次主循环迭代时自动调用一次：

source: Odometry Accessor Method
es_mx: Método de acceso de odometría
tr_tr: Odometri Accessor Yöntemi
zh_cn: 测程法访问器方法

source: To access the robot's current computed pose, we include the following method:
es_mx: Para acceder a la pose calculada actual del robot, incluimos el siguiente método:
tr_tr: Robotun mevcut hesaplanan pozuna-konumuna erişmek için aşağıdaki yöntemi ekliyoruz:
zh_cn: 为了访问机器人当前计算的位置，我们包括以下方法:

source: Voltage-Based Drive Method
es_mx: Método de accionamiento basado en voltaje
tr_tr: Voltaj tabanlı Sürüş Methodu
zh_cn: 基于电压的驱动方法

source: Finally, we must include one additional method - a method that allows us to set the voltage to each side of the drive using the ``setVoltage()`` method of the ``SpeedController`` interface. The default WPILib drive class does not include this functionality, so we must write it ourselves:
es_mx: Finalmente, debemos incluir un método adicional: un método que nos permite establecer el voltaje a cada lado del variador usando el método ``setVoltage()`` de la interfaz ``SpeedController``. La clase de unidad WPILib predeterminada no incluye esta funcionalidad, por lo que debemos escribirla nosotros mismos:
tr_tr: Son olarak, ``SpeedController`` arayüzünün ``setVoltage()`` yöntemini kullanarak sürücünün her iki tarafına voltajı ayarlamamıza olanak tanıyan bir ek yöntem eklemeliyiz. Varsayılan WPILib sürücü sınıfı bu işlevselliği içermez, bu yüzden kendimiz yazmalıyız:
zh_cn: 最后，我们必须包括一个附加方法-一种方法，该方法允许我们使用SpeedController接口的setVoltage（）方法设置驱动器两侧的电压。缺省的WPILib驱动器类不包含此功能，因此我们必须自己编写：

source: It is very important to use the ``setVoltage()`` method rather than the ordinary ``set()`` method, as this will automatically compensate for battery "voltage sag" during operation. Since our feedforward voltages are physically-meaningful (as they are based on measured characterization data), this is essential to ensuring their accuracy.
es_mx: Es muy importante utilizar el método ``setVoltage()`` en lugar del método ``set()`` ordinario, ya que esto compensará automáticamente la "caída de voltaje" de la batería durante el funcionamiento. Dado que nuestros voltajes de alimentación directa son físicamente significativos (ya que se basan en datos de caracterización medidos), esto es esencial para garantizar su precisión.
tr_tr: Normal ``set()`` yönteminden ziyade ``setVoltage()`` yöntemini kullanmak çok önemlidir, çünkü bu, çalışma sırasında pil "voltaj düşüşünü" otomatik olarak telafi edecektir. İleri besleme gerilimlerimiz fiziksel olarak anlamlı olduğundan (ölçülen karakterizasyon verilerine dayandıkları için), bu, doğruluklarını sağlamak için çok önemlidir.
zh_cn: 使用setVoltage（）方法而不是普通的set（）方法非常重要，因为这将在运行期间自动补偿电池的“电压骤降”。由于我们的前馈电压在物理上有意义（因为它们基于测得的特性数据），因此对于确保其准确性至关重要。

source: The full drive class from the RamseteCommand Example Project (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) can be seen below. The rest of the article will describe the steps involved in writing this class.
tr_tr: RamseteCommand Örnek Projesindeki tam sürücü sınıfı (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) aşağıda görülebilir. Makalenin geri kalanı bu sınıfı yazmanın adımlarını anlatacak.
