Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/trajectory-tutorial/entering-constants.po
Languages: es_mx, tr_tr, zh_cn

source: Step 2: Entering the Calculated Constants
es_mx: Paso 2: Introducción de las constantes calculadas
tr_tr: 2. Adım : Hesaplanan Sabitleri Girme
zh_cn: 步骤2：输入计算的常数

source: In C++, it is important that the feedforward constants be entered as the correct unit type. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
es_mx: En C++, es importante que las constantes feedforward se ingresen como el tipo de unidad correcto. Para obtener más información sobre las unidades C++, consulte :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
tr_tr: C++ 'da, ileri besleme sabitlerinin doğru birim türü olarak girilmesi önemlidir. C++ birimleri hakkında daha fazla bilgi için bakınız: :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
zh_cn: 在C ++中，输入前馈常数作为正确的单位类型非常重要。有关C ++单元的更多信息，请参见 :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`。

source: Now that we have our characterization constants, it is time to place them in our code. The recommended place for this is the ``Constants`` file of the :ref:`standard command-based project structure <docs/software/commandbased/structuring-command-based-project:Constants>`.
es_mx: Ahora que tenemos nuestras constantes de caracterización, es hora de colocarlas en nuestro código. El lugar recomendado para esto es el archivo ``Constantes`` de la :ref:`estructura estándar de proyectos basada en comandos <docs/software/commandbased/structuring-command-based-project:Constants>`.
tr_tr: Artık karakterizasyon sabitlerimize sahip olduğumuza göre, bunları kodumuza yerleştirmenin zamanı geldi. Bunun için önerilen yer :ref:`standard command-based komut-tabanlı proje yapısı structure <docs/software/commandbased/structuring-command-based-project:Constants>` ın ``Constants`` dosyasıdır.
zh_cn: 现在我们已经有了表征常数，是时候把它们放到代码中了。该常量文件建议放置的位置是 :ref:`standard command-based project structure <docs/software/commandbased/structuring-command-based-project:Constants>`。

source: The relevant parts of the constants file from the RamseteCommand Example Project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) can be seen below.
es_mx: Las partes relevantes del archivo de constantes del proyecto de ejemplo RamseteCommand (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) pueden verse a continuación.
tr_tr: RamseteCommand Örnek Projesindeki sabitler dosyasının ilgili kısımları (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>` __) aşağıda görülebilir.
zh_cn: 可以在下面看到RamseteCommand示例项目（Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__）中常量文件的相关部分。

source: Feedforward/Feedback Gains
es_mx: Ganancias de Feedforward/Feedback
tr_tr: Feedforward / İleri Bildirim Kazançları
zh_cn: 前馈/反馈增益

source: Firstly, we must enter the feedforward and feedback gains which we obtained from the characterization tool.
es_mx: En primer lugar, debemos ingresar las ganancias de feedforward y feedback que obtuvimos de la herramienta de caracterización.
tr_tr: Öncelikle, karakterizasyon aracından elde ettiğimiz ileri besleme ve geri bildirim kazanımlarını girmeliyiz.
zh_cn: 首先，我们必须输入从表征工具获得的前馈和反馈增益。

source: Feedforward and feedback gains do *not*, in general, transfer across robots. Do *not* use the gains from this tutorial for your own robot.
es_mx: Las ganancias de feedforward y feedback, en general, *no* se transfieren entre robots. *No* use las ganancias de este tutorial para su propio robot.
tr_tr: Feedforward ve feedback kazançları genel olarak robotlar arasında transfer *edilemez*. Bu eğitimden elde edilen kazançları kendi robotunuz için *kullanmayın*.
zh_cn: 前馈和反馈增益通常不会在机器人之间传递。 不要将本教程中的收益用于你自己的机器人。

source: DifferentialDriveKinematics
zh_cn: 差动驱动运动学

source: Additionally, we must create an instance of the ``DifferentialDriveKinematics`` class, which allows us to use the trackwidth (i.e. horizontal distance between the wheels) of the robot to convert from chassis speeds to wheel speeds. As elsewhere, we keep our units in meters.
es_mx: Además, debemos crear una instancia de la clase ``DifferentialDriveKinematics``, que nos permite usar el ancho de vía (es decir, la distancia horizontal entre las ruedas) del robot para convertir las velocidades del chasis a las velocidades de las ruedas. Como en otros lugares, mantenemos nuestras unidades en metros.
tr_tr: Ek olarak, şasi hızlarından tekerlek hızlarına dönüştürmek için robotun iz genişliğini (yani tekerlekler arasındaki yatay mesafe) kullanmamıza izin veren ``DifferentialDriveKinematics`` sınıfının bir örneğini oluşturmalıyız. Diğer yerlerde olduğu gibi, birimlerimizi metre cinsinden tutuyoruz.
zh_cn: 此外，我们必须创建``DifferentialDriveKinematics''类的实例，该实例允许我们使用机器人的履带宽度（即车轮之间的水平距离）将底盘速度转换为车轮速度。与其他地方一样，我们的单位以米为单位。

source: Max Trajectory Velocity/Acceleration
es_mx: Velocidad máxima de la trayectoria/Aceleración
tr_tr: Maksimum Yörünge Hızı / İvme
zh_cn: 最大轨迹速度/加速度

source: We must also decide on a nominal max acceleration and max velocity for the robot during path-following. The maximum velocity value should be set somewhat below the nominal free-speed of the robot. Due to the later use of the ``DifferentialDriveVoltageConstraint``, the maximum acceleration value is not extremely crucial.
es_mx: También debemos decidir sobre una aceleración máxima nominal y una velocidad máxima para el robot durante el seguimiento de la trayectoria. El valor de velocidad máxima debe establecerse algo por debajo de la velocidad libre nominal del robot. Debido al uso posterior del ``DifferentialDriveVoltageConstraint``, el valor máximo de aceleración no es extremadamente crucial.
tr_tr: Ayrıca yol izleme sırasında robot için nominal bir maksimum ivme ve maksimum hıza da karar vermeliyiz. Maksimum hız değeri, robotun nominal serbest hızının biraz altında ayarlanmalıdır. Daha sonra ``DifferentialDriveVoltageConstraint`` kullanımı nedeniyle, maksimum hızlanma değeri çok önemli değildir.
zh_cn: 我们还必须确定跟随路径时机器人的标称最大加速度和最大速度。最大速度值应设置为略低于机器人的额定自由速度。由于后来使用了``DifferentialDriveVoltageConstraint''，因此最大加速度值并不是非常关键。

source: Ramsete Parameters
es_mx: Parámetros de Ramsete
tr_tr: Ramsete Parametreleri
zh_cn: 斜拉参数

source: Finally, we must include a pair of parameters for the RAMSETE controller. The values shown below should work well for most robots, provided distances have been correctly measured in meters - for more information on tuning these values (if it is required), see :ref:`docs/software/advanced-controls/trajectories/ramsete:Constructing the Ramsete Controller Object`.
es_mx: Finalmente, debemos incluir un par de parámetros para el controlador RAMSETE. Los valores que se muestran a continuación deberían funcionar bien para la mayoría de los robots, siempre que las distancias se hayan medido correctamente en metros; para obtener más información sobre cómo ajustar estos valores (si es necesario), consulte :ref:`docs/software/advanced-controls/trajectories/ramsete:Constructing the Ramsete Controller Object`.
tr_tr: Son olarak, RAMSETE denetleyicisi için bir çift parametre eklemeliyiz. Aşağıda gösterilen değerler, mesafelerin metre cinsinden doğru bir şekilde ölçülmüş olması koşuluyla çoğu robot için iyi çalışmalıdır - bu değerlerin ayarlanması hakkında daha fazla bilgi için (gerekliyse), bakınız :ref:`docs/software/advanced-controls/trajectories/ramsete:Constructing the Ramsete Controller Object`.
zh_cn: 最后，我们必须包括RAMSETE控制器的一对参数。下面所示的值对于大多数机器人应该工作得很好，假设距离已经正确地测量了米-有关调整这些值的更多信息(如果需要的话), 请参见：:ref:`docs/software/advanced-controls/trajectories/ramsete:Constructing the Ramsete Controller Object`。
