Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/trajectory-tutorial/trajectory-tutorial-overview.po
Languages: fr_ca, tr_tr, zh_cn

source: Trajectory Tutorial Overview
fr_ca: Aperçu du didacticiel de trajectoire
tr_tr: Yörünge Eğiticisine Genel Bakış
zh_cn: 轨迹教程概述

source: Todo
fr_ca: À faire
tr_tr: Yapılacaklar
zh_cn: 待完成工作

source: add pathweaver stuff once it is available
fr_ca: ajouter du matériel relatif à pathweaver une fois qu’il est disponible
tr_tr: kullanılabilir olduğunda pathweaver öğeleri ekleyin
zh_cn: 添加可用的pathweaver内容

source: Before following this tutorial, it is helpful (but not strictly necessary) to have a baseline familiarity with WPILib's :ref:`PID control <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`, :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`, and :ref:`trajectory <docs/software/advanced-controls/trajectories/index:Trajectory Generation and Following with WPILib>` features.
fr_ca: Avant de suivre ce tutoriel, il est utile (mais pas strictement nécessaire) d’avoir une familiarité de base avec les fonctionnalités de la WPILib :ref:`PID control <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`, :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`, et :ref:`trajectory <docs/software/advanced-controls/trajectories/index:Trajectory Generation and Following with WPILib>`.
tr_tr: Bu öğreticiyi takip etmeden önce, WPILib'in temel bilgilerine sahip olmak yararlıdır (ancak kesinlikle gerekli değildir) :ref:`PID control <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`, :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` ve :ref:`trajectory <docs/software/advanced-controls/trajectories/index:Trajectory Generation and Following with WPILib>` 'özellikleri gibi.
zh_cn: 在学习本教程之前，对WPILib的:ref:`PID control <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`, :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`, 和 :ref:`trajectory <docs/software/advanced-controls/trajectories/index:Trajectory Generation and Following with WPILib>`特性有一个基本的了解是有帮助的(但不是严格必要的)。

source: The robot code in this tutorial uses the :ref:`command-based <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` framework. The command-based framework is strongly recommended for beginning and intermediate teams.
fr_ca: Le code robot de ce didacticiel utilise l'environnement de développement orienté Commandes :ref:`command-based <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`. Cet environnement de développement est fortement recommandé pour les équipes de recrues et intermédiaires.
tr_tr: Bu öğreticideki robot kodu :ref:`command-based <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` framework-çerçevesini kullanır. Komut tabanlı çerçeve, başlangıç ve orta seviye ekipler için şiddetle tavsiye edilir.
zh_cn: 本教程中的机器人代码使用 :ref:`command-based <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`的框架。强烈建议初级和中级团队使用基于指令的框架。

source: The goal of this tutorial is to provide "end-to-end" instruction on implementing a trajectory-following autonomous routine for a differential-drive robot. By following this tutorial, readers will learn how to:
fr_ca: L’objectif de ce didacticiel est de fournir des instructions de bout en bout sur la mise en œuvre d’une routine autonome de suivi de trajectoire pour un robot à entraînement différentiel. En suivant ce didacticiel, les lecteurs apprendront à :
tr_tr: Bu öğreticinin amacı, diferansiyel tahrikli bir robot için yörüngeyi izleyen otonom bir rutinin uygulanmasına ilişkin "uçtan uca" talimat sağlamaktır. Bu öğreticiyi takip ederek okuyucular şunları öğreneceklerdir:
zh_cn: 本教程的目标是提供“端到端”的指令来实现差动机器人的轨迹跟踪自主程序。通过学习本教程，读者将学习如何:

source: Accurately characterize their robot's drivetrain to obtain accurate feedforward calculations and approximate feedback gains.
fr_ca: Caractériser avec précision la base pilotable de leur robot pour obtenir des calculs précis pour la commande prédictive et des gains approximatifs pour les boucles de rétroaction .
tr_tr: Doğru ileri besleme hesaplamaları ve yaklaşık geri bildirim kazançları elde etmek için robotlarının aktarma organlarını doğru şekilde karakterize edin.
zh_cn: 精确地描述机器人的传动系统以获得精确的前馈计算和近似反馈增益。。

source: Configure a drive subsystem track the robot's pose using WPILib's odometry library.
fr_ca: Configurer un sous-système de déplacement de manière à suivre la pose du robot à l’aide de la librairie odométrie de WPILib.

source: Generate a simple trajectory through a set of waypoints using WPILib's ``TrajectoryGenerator`` class.
fr_ca: Générer une trajectoire simple à travers un ensemble de points de passage à l’aide de la classe ``TrajectoryGenerator`` de WPILib.
tr_tr: WPILib'in ``TrajectoryGenerator`` sınıfını kullanarak bir dizi ara nokta üzerinden basit bir yörünge oluşturun.
zh_cn: 使用WPILib的‘轨迹生成器’类通过一组路径点生成一个简单的轨迹。

source: Follow the generated trajectory in an autonomous routine using WPILib's ``RamseteCommand`` class with the calculated feedforward/feedback gains and pose.
fr_ca: Suivez la trajectoire générée dans une routine autonome à l’aide de la classe ``RamseteCommand`` de WPILib avec les gains de commande prédictive/rétroaction calculés et la pose.
tr_tr: Hesaplanan ileri / geri bildirim kazançları ve pozuyla WPILib'in ``RamseteCommand`` sınıfını kullanarak otonom bir rutinde oluşturulan yörüngeyi izlemek.
zh_cn: 使用WPILib的“RamseteCommand”类与计算的前馈/反馈增益和姿态在一个自主程序中跟踪生成的轨迹。

source: This tutorial is intended to be approachable for teams without a great deal of programming expertise. While the WPILib library offers significant flexibility in the manner in which its trajectory-following features are implemented, closely following the implementation outlined in this tutorial should provide teams with a relatively-simple, clean, and repeatable solution for autonomous movement.
fr_ca: Ce didacticiel est destiné à être accessible aux équipes n'ayant pas beaucoup d’expertise en programmation. Bien que la logithèque WPILib offre une flexibilité significative dans la manière dont ses fonctionnalités de suivi de trajectoire sont implémentées, suivre de près l'implémentation décrite dans ce didacticiel devrait fournir aux équipes une solution relativement simple, propre et reproductible pour les mouvements autonomes.
tr_tr: Bu eğitim, çok fazla programlama uzmanlığı olmayan ekipler için ulaşılabilir olması amaçlanmıştır. WPILib kitaplığı, yörünge izleme özelliklerinin uygulanma biçiminde önemli bir esneklik sunarken, bu öğreticide özetlenen uygulamayı yakından takip etmek, ekiplere otonom hareket için nispeten basit, temiz ve tekrarlanabilir bir çözüm sunmalıdır.
zh_cn: 本教程的目的是让不具备大量编程专业知识的团队能够使用。虽然WPILib库在其轨迹跟踪特性的实现方式上提供了很大的灵活性，但密切遵循本教程中概述的实现应该能为团队提供一个相对简单、干净和可重复的自主移动解决方案。

source: The full robot code for this tutorial can be found in the RamseteCommand Example Project (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__).
fr_ca: Le programme robot complet de ce didacticiel se trouve dans l'exemple de projet RamseteCommand (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__).

source: Why Trajectory Following?
fr_ca: Pourquoi le suvi de trajectoire?
tr_tr: Neden Trajectory-Yörünge İzleme?
zh_cn: 为什么需要轨迹跟踪？

source: FRC games often feature autonomous tasks that require a robot to effectively and accurately move from a known starting location to a known scoring location. Historically, the most common solution for this sort of task in FRC has been a "drive-turn-drive" approach - that is, drive forward by a known distance, turn by a known angle, and drive forward by another known distance.
fr_ca: Les jeux FRC comportent souvent des tâches en mode autonome qui demandent qu'un robot se déplace efficacement et avec précision d’un emplacement de départ connu vers un lieu de pointage connu. Historiquement, la solution la plus courante pour ce genre de tâches en FRC a été une approche du genre "avance-tourne-avance-avance" - c’est-à-dire, aller de l’avant sur une distance connue, tourner d'un angle connu, et aller de l’avant sur une autre distance connue.

source: While the "drive-turn-drive" approach is certainly functional, in recent years teams have begun tracking smooth trajectories which require the robot to drive and turn at the same time. While this is a fundamentally more-complicated technical task, it offers significant benefits: in particular, since the robot no longer has to stop to change directions, the paths can be driven much faster, allowing a robot to score more game pieces during the autonomous period.
fr_ca: Bien que l’approche "avance-tourne-avance" » soit certainement fonctionnelle, ces dernières années, les équipes ont commencé à suivre les trajectoires lisses qui exigent que le robot avance et tourne en même temps. Bien qu’il s’agisse, sur le plan technique, d’une tâche fondamentalement plus compliquée, elle offre néamoins des avantages significatifs : en particulier, puisque le robot n’a plus à s’arrêter pour changer de direction, les tronçons peuvent être conduits beaucoup plus rapidement, permettant ainsi à un robot de marquer plus de pièces de jeu pendant la période autonome.
tr_tr: "Drive-turn-drive" yaklaşımı kesinlikle işlevsel olsa da, son yıllarda ekipler robotun aynı anda sürmesini ve dönmesini gerektiren yumuşak yörüngeleri izlemeye başladılar. Bu, temelde daha karmaşık bir teknik görev olsa da, önemli faydalar sağlar: özellikle, robotun artık yön değiştirmek için durması gerekmediğinden, yollar çok daha hızlı sürülebilir ve bir robotun otonom sırasında daha fazla oyun parçası atmasına izin verir.
zh_cn: 虽然“驾驶-转弯-驱动”的方法确实有效，但近年来，研究团队已经开始跟踪要求机器人同时驾驶和转弯的平滑轨迹。虽然这是一个更加复杂的技术任务，但它提供了显著的好处:特别是，由于机器人不再需要停下来改变方向，路径可以更快地驱动，让机器人在自动阶段获得更多的游戏得分。

source: Beginning in 2020, WPILib now supplies teams with working, advanced code solutions for trajectory generation and tracking, significantly lowering the "barrier-to-entry" for this kind of advanced and effective autonomous motion.
fr_ca: À partir de 2020, WPILib fournit désormais aux équipes des solutions sous forme de codes fonctionnels et avancés pour la génération et le suivi des trajectoires, abaissant considérablement le "barrière à l’entrée" pour ce type de déplacement autonome à la fois avancé et efficace.
tr_tr: 2020'den başlayarak, WPILib artık ekiplere yörünge oluşturma ve izleme için çalışan, gelişmiş kod çözümleri sağlıyor ve bu tür gelişmiş ve etkili otonom hareket için "giriş engelini" önemli ölçüde azaltıyor.
zh_cn: 从2020年开始，WPILib现在为团队提供可行的、先进的轨迹生成和跟踪代码解决方案，大大降低了这种先进、有效的自动阶段“进入障碍”。

source: Required Equipment
fr_ca: Équipement requis
tr_tr: Gerekli Ekipman
zh_cn: 所需设备

source: To follow this tutorial, you will need ready access to the following materials:
fr_ca: Pour suivre ce didacticiel, vous aurez besoin d’un accès facile aux documents suivants:
tr_tr: Bu eğiticiyi takip etmek için aşağıdaki materyallere hazır erişime ihtiyacınız olacak:
zh_cn: 要遵循本教程，您需要立即访问以下材料：

source: A differential-drive robot (such as the `AndyMark AM14U4 <https://www.andymark.com/products/am14u4-kit-of-parts-chassis>`__), equipped with:
fr_ca: Un robot à entraînement différentiel (tel que `AndyMark AM14U4 <https://www.andymark.com/products/am14u4-kit-of-parts-chassis>`__), équipé de:
tr_tr: Aşağıdakilerle donatılmış diferansiyel tahrikli bir robot (örneğin, `AndyMark AM14U4 <https://www.andymark.com/products/am14u4-kit-of-parts-chassis>`__):
zh_cn: 差动驱动机器人（例如， `AndyMark AM14U4 <https://www.andymark.com/products/am14u4-kit-of-parts-chassis>`__），配备：

source: Quadrature encoders for measuring the wheel rotation of each side of the drive.
fr_ca: Encodeurs en quadrature pour mesurer la rotation des roues de chaque côté de l’entraînement.
tr_tr: Sürücünün her iki tarafının tekerlek dönüşünü ölçmek için Quadrature kodlayıcılar.
zh_cn: 正交编码器测量车轮旋转的每一边的驱动器。

source: A gyroscope for measuring robot heading.
fr_ca: Gyroscope pour mesurer l'orienatation du robot.
tr_tr: Robotun yönünü ölçmek için bir jiroskop.
zh_cn: 用于测量机器人航向的陀螺仪。

source: A driver-station computer configured with:
fr_ca: Un ordinateur de pilotage configuré avec :
tr_tr: Aşağıdakilerle yapılandırılmış bir sürücü istasyonu bilgisayarı:
zh_cn: 操控站计算机配置为:

source: :ref:`The FRC-Characterization Toolsuite <docs/software/wpilib-tools/robot-characterization/introduction:Installing and Launching the Toolsuite>`.
fr_ca: :ref:`Suite logicielle de caractérisation FRC <docs/software/wpilib-tools/robot-characterization/introduction:Installing and Launching the Toolsuite>`.
tr_tr: :ref:`FRC-Karakterizasyon Araç Takımı <docs/software/wpilib-tools/robot-characterization/introduction:Installing and Launching the Toolsuite>`.

source: The full robot code for this tutorial can be found in the RamseteCommand Example Project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__).
tr_tr: Bu öğretici için tam robot kodu, RamseteCommand Örnek Projesinde (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>` __) bulunabilir.
zh_cn: 本教程的完整机器人代码可以在RamseteCommand示例项目（Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__）中找到。

source: FRC\ |reg| games often feature autonomous tasks that require a robot to effectively and accurately move from a known starting location to a known scoring location. Historically, the most common solution for this sort of task in FRC has been a "drive-turn-drive" approach - that is, drive forward by a known distance, turn by a known angle, and drive forward by another known distance.
tr_tr: FRC \ |reg| oyunlar genellikle bir robotun bilinen bir başlangıç konumundan bilinen bir puanlama konumuna etkili ve doğru bir şekilde hareket etmesini gerektiren otonom görevler içerir. Tarihsel olarak, FRC'de bu tür bir görev için en yaygın çözüm, bir "git-dön-git" yaklaşımı olmuştur - yani, bilinen bir mesafeyle ileri git, bilinen bir açıyla dön ve bilinen başka bir mesafeden ileriye git.
zh_cn: FRC\ |reg| 游戏通常以自主任务为特色，要求机器人有效且准确地从已知的起始位置移动到已知的得分位置。从历史上看，FRC中这类任务最常见的解决方案是“drive-turn-drive”方法——也就是说，以已知的距离向前行驶，以已知的角度转弯，再以已知的距离向前行驶。

source: Configure a drive subsystem to track the robot's pose using WPILib's odometry library.
zh_cn: 使用WPILib的里程表库，配置驱动器子系统以跟踪机器人的位置。
