Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/system-identification/additional-utils.po
Languages: fr_ca

source: Additional Utilities and Tools
fr_ca: Utilitaires et outils supplémentaires

source: This page mainly covers useful information about additional functionality that this tool provides.
fr_ca: Cette page couvre principalement des informations utiles relatives aux fonctionnalités supplémentaires fournies par cet outil.

source: JSON Converters
fr_ca: Convertisseurs JSON

source: There are a two JSON Utility tools that can be used in the :guilabel:`JSON Converters` tab: FRC-Char Converter and JSON to CSV Converter.
fr_ca: Il existe deux utilitaires JSON qui peuvent être utilisés dans l’onglet :guilabel:`JSON Converters` : le convertisseur FRC-Char Converter et le convertisseur JSON en CSV (JSON to CSV Converter).

source: Picture of the json converters
fr_ca: Image des convertisseurs json

source: The FRC-Char Converter reads in an FRC-Char JSON and converts it into a SysId JSON that the tool can read.
fr_ca: Le convertisseur FRC-Char lit un fichier JSON FRC-Char et le convertit en un fichier JSON SysId que l’outil peut lire.

source: The JSON to CSV Converter takes a SysId JSON and outputs a CSV file. If the JSON had Drivetrain Mechanism data, the columns are: ``Timestamp (s)``, ``Test``, ``Left Volts (V)`` , ``Right Volts (V)``, ``Left Position ({0})``, ``Right Position ({units})``, ``Left Velocity ({units}/s)``, ``Right Velocity ({units}/s)``, ``Gyro Position (deg)``, ``Gyro Rate (deg/s)``. If the JSON had General Mechanism data, the CSV has the following columns: ``Timestamp (s)``, ``Test``, ``Volts (V)``, ``Position({units})``, ``Velocity ({units}/s)``.
fr_ca: Le convertisseur JSON en CSV prend un SysId JSON et génère un fichier CSV. Si le JSON avait des données sur le mécanisme correspond au Drivetrain, les colonnes sont les suivantes : ``Timestamp (s)``, ``Test``, ``Left Volts (V)`` , ``Right Volts (V)``, ``Left Position ({0})``, ``Right Position ({units})``, ``Left Velocity ({units}/s)``, ``Right Velocity ({units}/s)``, ``Gyro Position (deg)``, ``Gyro Rate (deg/s)``. Si le JSON avait des données relatives à un mécanisme en général, le CSV comporte les colonnes suivantes: ``Timestamp (s)``, ``Test``, ``Volts (V)``, ``Position({units})``, ``Velocity ({units}/s)``.

source: ImGui Tips
fr_ca: Conseils relatifs au framework ImGui

source: The following are essentially handy features that come with the ImGui framework that SysId uses:
fr_ca: Les fonctionnalités suivantes sont essentiellement très pratiques avec le framework ImGui utilisé par SysId:

source: Showing and Hiding Plot Data
fr_ca: Affichage et masquage des données de tracé

source: To add or remove certain data from the plots, click on the color of the data that you would like to hide or remove.
fr_ca: Pour ajouter ou supprimer certaines données des tracés, cliquez sur la couleur des données que vous souhaitez masquer ou supprimer.

source: For example, if we want to hide sim data, we can click the green color box.
fr_ca: Par exemple, si nous voulons masquer les données de simulation, nous pouvons cliquer sur la boîte de couleur verte.

source: Where one would need to click to hide sim data on an example plot
fr_ca: Où il faudrait cliquer pour masquer les données sim sur un exemple de tracé

source: Picture of a plot after sim is hidden
fr_ca: Image d’un tracé après que la simulation ait été masquée

source: Auto Sizing Plots
fr_ca: Redimensionnement automatique des tracés

source: If you zoom in to plots and want to revert back to the normally sized plots, just double click on the plot and it will automatically resize it.
fr_ca: Si vous agrandissez les tracés et que vous souhaitez revenir aux tracés de taille normale, double-cliquez simplement sur le tracé et il se redimensionnera automatiquement.

source: Here is a plot that is zoomed in:
fr_ca: Voici un tracé qui est agrandi:

source: Picture of a plot that is zoomed in
fr_ca: Image d’un tracé agrandi

source: After double clicking, it is automatically resized:
fr_ca: Après double cliqué, il est automatiquement redimensionné:

source: Picture of the previously zoomed in plot that is resized
fr_ca: Image du tracé précédemment agrandi qui est redimensionné

source: Setting Slider Values
fr_ca: Définition des valeurs du curseur

source: To set the value of a slider as a number rather than sliding the widget, you can CTRL + Click the slider and it will allow you to input a number.
fr_ca: Pour définir la valeur d’un curseur en tant que nombre plutôt que de faire glisser le widget, vous pouvez faire CTRL+Click sur le curseur et vous pourrez alors saisir un nombre.

source: Here is a regular slider:
fr_ca: Voici un curseur régulier:

source: Picture of a regular slider
fr_ca: Image d’un curseur régulier

source: Here is the input after double clicking the slider:
fr_ca: Voici l’entrée après avoir double-cliqué sur le curseur:

source: Picture of the slider as a number entry
fr_ca: Image du curseur en tant qu’entrée numérique
