Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/system-identification/configuring-project.po
Languages: fr_ca

source: Configuring a Project
fr_ca: Configuration d’un projet

source: To use the toolsuite, we first need to configure the settings for your specific mechanism.
fr_ca: Pour utiliser la suite d’outils, nous devons d’abord configurer les paramètres spécifiques de votre mécanisme.

source: Configure Project Parameters
fr_ca: Configurer les paramètres du projet

source: In order to run on your robot, the tool must know some parameters about how your robot is set up.
fr_ca: Afin de fonctionner sur votre robot, l’outil doit connaître certains paramètres donnant des indications sur la façon dont votre robot est configuré.

source: First, you need to use the :guilabel:`Analysis Type` field to select the appropriate project config. ``General Mechanism`` is for non-drivetrain mechanisms (e.g. Simple Motor, Arm, Elevator), ``Drivetrain`` is for Drivetrain mechanisms, and ``Romi`` is for the Romi robots. This allows you to fill out the parameters specific to the type of system you are using.
fr_ca: Tout d’abord, vous devez utiliser le champ :guilabel:`Analysis Type` pour sélectionner la configuration appropriée de projet. ``General Mechanism`` correspond à tous les autres mécanismes sauf la transmission (par exemple, moteur simple, bras, élevateur), ``Drivetrain`` correspond aux mécanismes de transmission, et ``Romi`` est pour les robots Romi. Cela vous permet de remplir les paramètres spécifiques au type de système que vous utilisez.

source: Selecting the appropriate analysis type.
fr_ca: Sélection du type d’analyse approprié.

source: The rest of the Generator widget is focused on the proper settings based off of the analysis type:
fr_ca: Le reste du widget Generator se concentre sur les paramètres appropriés selon le type d’analyse:

source: Motor Controller Selection
fr_ca: Sélection du contrôleur de moteur

source: The :guilabel:`Motor / Motor Controller Selection` allows you to add ports for each motor controller that will be used. The :guilabel:`+` and :guilabel:`-` buttons let you add and remove ports respectively.
fr_ca: La sélection du contrôleur :guilabel:`Motor / Motor Controller Selection` vous permet d’ajouter des ports pour chaque contrôleur de moteur qui sera utilisé. Les boutons :guilabel:`+` et :guilabel:`-` vous permettent respectivement d’ajouter et de supprimer des ports.

source: If you are plugging in your encoders into motor controllers make sure that the motor controller type and port(s) are the first ones you specify.
fr_ca: Si vous branchez vos encodeurs dans des contrôleurs de moteur, assurez-vous que le type et le ou les ports du contrôleur de moteur sont les premiers que vous spécifiez.

source: Motor selection section.
fr_ca: Section de sélection du moteur.

source: Each motor port contains the following parts:
fr_ca: Chaque port de moteur comprend les parties suivantes:

source: :guilabel:`Motor Port` is where you add the port number for a specific controller
fr_ca: :guilabel:`Motor Port` est l’endroit où vous ajoutez le numéro de port d’un contrôleur spécifique

source: :guilabel:`Inverted` should be checked if the motorcontroller should be inverted
fr_ca: :guilabel:`Inverted` doit être coché si le contrôleur de moteur doit être inversé

source: :guilabel:`Motor Controller` is the type of motor controller that will be used.
fr_ca: :guilabel:`Motor Controller` est le type de contrôleur de moteur qui sera utilisé.

source: Encoder Selection
fr_ca: Sélection de l’encodeur

source: The :guilabel:`Encoder Selection` allows you to configure the encoders that will be used. The types of encoder you can use will vary with the first motor controller type specified (see note :ref:`above <docs/software/pathplanning/system-identification/configuring-project:Motor Controller Selection>`).
fr_ca: Le :guilabel:`Encoder Selection` vous permet de configurer les encodeurs qui seront utilisés. Les types d'encodeur que vous pouvez utiliser varient selon le premier type de contrôleur de moteur spécifié (voir la note :ref:`ci-dessus <docs/software/pathplanning/system-identification/configuring-project:Motor Controller Selection>`).

source: Encoder selection section.
fr_ca: Section de sélection de l’encodeur.

source: Encoder Types
fr_ca: Types d'encodeurs

source: **General Types** (consistent across all motor controller selections): ``roboRIO`` corresponds to any encoders that are plugged into the roboRIO, ``CANCoder`` corresponds to the CTRE CANCoder.
fr_ca: **Types généraux** (cohérents pour toutes les sélections de contrôleurs de moteur): ``roboRIO`` correspond à tous les encodeurs qui sont branchés sur le roboRIO, ``CANCoder`` correspond au CTRE CANCoder.

source: **TalonSRX**: ``Built-in`` corresponds to any quadrature encoder plugged into the encoder port, ``Tachometer`` corresponds to the CTRE Tachometer plugged into the encoder port.
fr_ca: **TalonSRX**: ``Built-in`` correspond à tout encodeur en quadrature branché sur le port d'encodeur, ``Tachometer`` correspond au Tachymètre CTRE branché sur le port d'encodeur.

source: **TalonFX**: ``Built-in`` corresponds to the integrated encoder on the TalonFX motor.
fr_ca: **TalonFX**: ``Built-in`` correspond à l'encodeur intégré sur le moteur TalonFX.

source: **Spark MAX**: ``Encoder Port`` refers to an encoder plugged into the `encoder port <https://docs.revrobotics.com/sparkmax/feature-description/encoder-port>`__, ``Data Port`` refers to an encoder plugged into the `data port <https://docs.revrobotics.com/sparkmax/feature-description/data-port>`__.
fr_ca: **Spark MAX**: ``Encoder Port`` fait référence à un encodeur branché sur le `port d'encodeur <https://docs.revrobotics.com/sparkmax/feature-description/encoder-port>`__, ``Data Port`` fait référence à un encodeur branché sur le `port de données <https://docs.revrobotics.com/sparkmax/feature-description/data-port>`__.

source: **Venom**: ``Built-in`` refers to an encoder plugged into the Venom's encoder port.
fr_ca: **Venom**: ``Intégré`` fait référence à un encodeur branché sur le port d'encodeur du Venom.

source: Encoder Settings
fr_ca: Paramètres pour encodeurs

source: Here are the following settings that can be configured (although the settings that are visible will vary by the previously selected encoder type):
fr_ca: Voici les paramètres suivants qui peuvent être configurés (bien que les paramètres visibles varient selon le type d’encodeur précédemment sélectionné):

source: Ports (either :guilabel:`A` and :guilabel:`B` or :guilabel:`CANCoder Port`
fr_ca: Ports (soit :guilabel:`A` et :guilabel:`B` ou :guilabel:`CANCoder Port`)

source: :guilabel:`Encoder Inverted` should be checked if a positive motor power doesn't correspond to a positive increase in encoder values
fr_ca: :guilabel:`Encoder Inverted` doit être coché si une valeur positive de l'alimentation du moteur ne correspond pas à une augmentation positive des valeurs de l'encodeur.

source: :guilabel:`Samples Per Average` is how many samples will be averaged per velocity measurement. A value greater than one can help reduce encoder noise and 5-10 is recommended for encoders with high CPR. Only mess with this setting if a previous run of SysId resulted in extremely noisy data.
fr_ca: :guilabel:`Samples Per Average` est le nombre d’échantillons qui seront utilisés pour établir la valeur moyenne par mesure de vitesse. Une valeur supérieure à un peut aider à réduire le bruit de l’encodeur et 5-10 est recommandé pour les encodeurs avec un CPR (Cycle Par Révolution) élevé. Ne jouez avec ce paramètre que si une exécution précédente de SysId a entraîné des données extrêmement bruyantes.

source: :guilabel:`Reduce Encoding` should be checked if using high resolution encoders (e.g. CTRE Mag Encoders or REV Through Bore Encoder) that are plugged into the roboRIO. Do note, that if this is checked, you will have to update your team's robot code to also reduce encoding.
fr_ca: :guilabel:`Reduce Encoding` doit être coché si vous utilisez des encodeurs avec une haute résolution (par exemple, des encodeurs CTRE Mag ou REV Through Bore Encoder) qui sont branchés sur le roboRIO. Notez que si ce paramètre est coché, vous devrez mettre à jour le code robot de votre équipe pour réduire également l’encodage.

source: :guilabel:`Time Measurement Window` is the period of time in milliseconds that the velocity measurement will be taken across. This setting can reduce measurement lag at the cost of possibly introducing more noise. Only modify this if data lag is impeding accurate control and data collection.
fr_ca: :guilabel:`Time Measurement Window` est la période de temps en millisecondes pendant laquelle la mesure de la vitesse sera effectuée. Ce réglage peut réduire le décalage de mesure au prix d’introduire éventuellement plus de bruit. Ne le modifiez que si le décalage des données entrave le contrôle et la collecte de données précis.

source: Encoder Parameters
fr_ca: Paramètres de l’encodeur

source: :guilabel:`Counts Per Revolution` is the encoder counts per revolution for your encoder which is generally specified on a datasheet. Common values include:
fr_ca: :guilabel:`Counts Per Revolution` est le nombre d'impulsions par tour pour votre encodeur qui est généralement spécifié sur une feuille de données. Les valeurs communes sont les suivantes:

source: CTRE Magnetic Encoder: 4096
fr_ca: Encodeur magnétique CTRE: 4096

source: Falcon 500 Integrated: 2048
fr_ca: Encodeur intégré Falcon 500: 2048

source: NEO (and NEO 550) Integrated Encoders (REV already handles this value): 1
fr_ca: Encodeurs intégrés NEO (et NEO 550) (REV gère déjà cette valeur): 1

source: :guilabel:`Gearing` is the gearing between the encoder and output shaft. For example, an magnetic encoder on a kit chassis would have a gearing of one as it is on a 1:1 ratio with the output shaft. However, if is was an integrated encoder in a motor that was in the gearbox, the gearing would be 10.71 (per Andymark) since there is now gearing between the encoder and the output shaft.
fr_ca: :guilabel:`Gearing` est le rapport d’engrenage entre l’encodeur et l’arbre de sortie. Par exemple, un encodeur magnétique sur un châssis AndyMark standard du kit de pièces aurait un rapport d'engrenage de 1 comme il l’est sur un rapport 1: 1 avec l’arbre de sortie. Cependant, s’il s’agissait d’un encodeur intégré dans un moteur qui se trouvait dans la boîte de d'engrenage, l’engrenage serait de 10.71 (par Andymark) puisqu’il y a maintenant un engrenage entre l’encodeur et l’arbre de sortie.

source: Encoder parameters section.
fr_ca: Section des paramètres de l’encodeur.

source: Gyro Parameters (Drivetrain Only)
fr_ca: Paramètres du gyro (Drivetrain uniquement)

source: :guilabel:`Gyro` lets you select the type of supported gyro. :guilabel:`Gyro Parameter` lets you configure additional settings needed to configure the previously specified gyro.
fr_ca: :guilabel:`Gyro` vous permet de sélectionner le type de gyroscope pris en charge. :guilabel:`Gyro Parameter` vous permet de configurer les paramètres supplémentaires nécessaires pour configurer le gyroscope spécifié précédemment.

source: Gyro configuration section.
fr_ca: Section de configuration du gyroscope.

source: Loading and Saving Configurations
fr_ca: Chargement et enregistrement des configurations

source: Once your robot configuration is set, you may save it to a location/name of your choice with the :guilabel:`Save` button:
fr_ca: Une fois la configuration de votre robot définie, vous pouvez l’enregistrer à l’emplacement/nom de votre choix à l’aide du bouton :guilabel:`Save`:

source: Saving the configuration file
fr_ca: Enregistrement du fichier de configuration

source: Accordingly, you can also load an existing config file with the :guilabel:`Load Config` button:
fr_ca: En conséquence, vous pouvez également charger un fichier de configuration existant avec le bouton :guilabel:`Load Config`:

source: Loading a saved configuration file
fr_ca: Chargement d’un fichier de configuration enregistré

source: Deploying Project
fr_ca: Déploiement du projet

source: Once your project has been configured, it's time to deploy the robot project to run the identification routine.
fr_ca: Une fois votre projet configuré, il est temps de déployer le projet de robot pour exécuter la routine d'identification.

source: Deploying the config file
fr_ca: Déploiement du fichier config

source: :guilabel:`Team/IP` is where you set your team number or IP. You can then deploy the code with the :guilabel:`Deploy` label.
fr_ca: :guilabel:`Team/IP` est l’endroit où vous définissez votre numéro d’équipe ou votre adresse IP. Vous pouvez ensuite déployer le code par l'intermédiaire de l’étiquette :guilabel:`Deploy`.
