Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/system-identification/identification-routine.po
Languages: fr_ca

source: Running the Identification Routine
fr_ca: Exécution de la routine d'identification

source: Once the code has been deployed, we can now run the system identification routine, and record the resulting data for analysis.
fr_ca: Une fois le code déployé, nous pouvons maintenant exécuter la routine d'identification du système et enregistrer les données résultantes pour analyse.

source: Ensure you have sufficient space around the robot before running any identification routine! The drive identification requires at least 10' of space, ideally closer to 20'. The robot drive can not be accurately characterized while on blocks.
fr_ca: Assurez-vous d'avoir suffisamment d'espace autour du robot avant d'exécuter toute routine d'identification ! L'identification du lecteur nécessite au moins 10' d'espace, idéalement près de 20'. L'entraînement du robot ne peut pas être caractérisé avec précision lorsqu'il est sur des blocs.

source: Connect to the Robot
fr_ca: Connexion au robot

source: Next, we must connect to the robot. Select "Client" at the top of the Logger window and enter your team number. To characterize a simulated robot program, you can type in ``localhost``. Finally, press the :guilabel:`Apply` button. The NetworkTables connection indicator will be visible next to the :guilabel:`Apply` button.
fr_ca: Ensuite, nous devons nous connecter au robot. Sélectionnez "Client" en haut de la fenêtre Logger et saisissez votre numéro d’équipe. Pour caractériser un programme de robot simulé, vous pouvez taper ``localhost``. Enfin, appuyez sur le bouton :guilabel:`Apply`. L’indicateur de connexion NetworkTables sera visible à côté du bouton :guilabel:`Apply`.

source: Connecting to the robot
fr_ca: Connexion au robot

source: If the tool does not seem to be successfully connecting, try rebooting the robot. Eventually, the status should change to :guilabel:`NT Connected`, indicating the tool is successfully communicating with the robot.
fr_ca: Si l’outil de caractérisation ne semble pas se connecter avec succès, essayez de redémarrer le robot. Éventuellement, l’état devrait changer pour :guilabel:`NT Connected`, indiquant que l’outil communique avec succès avec le robot.

source: Connected to the robot
fr_ca: Connecté au robot

source: Project Parameters
fr_ca: Paramètres du projet

source: Project Parameters section of the Logger window.
fr_ca: Section Paramètres du projet de la fenêtre Logger.

source: :guilabel:`Mechanism` controls what data is sampled and how gravity is expected to affect the analysis.
fr_ca: :guilabel:`Mechanism` contrôle quelles données sont échantillonnées et comment la gravité devrait affecter l'analyse.

source: :guilabel:`Unit Type` is the units you are using and the units that SysID will export the gains in.
fr_ca: :guilabel:`Unit Type` correspond aux unités que vous utilisez et aux unités dans lesquelles SysID exportera les gains.

source: :guilabel:`Units Per Rotation` defines anything that affects the change from rotations of the output shaft to the units selected above. As an example say you are using a KOP chassis and units of meters. The gearing is already accounted for in the generator. We have to take into account how our wheel will change the distance we have traveled per rotation. The standard chassis has 6" (0.1524 meters) diameter wheels, so to get the circumference we need to multiply by Pi. The calculation looks like:
fr_ca: :guilabel:`Units Per Rotation` définit tout ce qui affecte la conversion des rotations de l'arbre de sortie vers les unités sélectionnées ci-dessus. Par exemple, supposons que vous utilisez le châssis fourni dans le KOP et des unités exprimées en mètres. L’engrenage est déjà pris en compte dans le générateur. Nous devons tenir compte de la façon dont notre roue changera la distance que nous avons parcourue par rotation. Le châssis standard possède des roues de 6″ (0.1524 mètres) de diamètre, donc pour obtenir la circonférence, nous devons multiplier par Pi. Le calcul ressemble à:

source: Voltage Parameters
fr_ca: Paramètres de tension

source: Voltage Parameters section of the Logger window.
fr_ca: Section Paramètres de tension de la fenêtre Logger.

source: :guilabel:`Quasistatic Ramp Rate` controls how quickly the voltage will ramp up during the quasistatic tests. The goal here is to get the voltage ramped up enough that a trend emerges. If the amount of space you have to run the robot is small you might need to slightly increase this ramp rate.
fr_ca: :guilabel:`Quasistatic Ramp Rate` contrôle la vitesse à laquelle la tension augmentera pendant les tests quasistatiques. L'objectif ici est d'augmenter suffisamment la tension pour qu'une tendance se dégage. Si la quantité d'espace dont vous disposez pour faire fonctionner le robot est petite, vous devrez peut-être augmenter légèrement ce taux de rampe.

source: :guilabel:`Dynamic Step Voltage` is the voltage that will be applied immediately on start to determine how your robot accelerates. If your robot is short on space you should slightly reduce the voltage.
fr_ca: :guilabel:`Dynamic Step Voltage` est la tension qui sera appliquée immédiatement au démarrage pour déterminer comment votre robot accélère. Si votre robot manque d'espace, vous devez réduire légèrement la tension.

source: Running Tests
fr_ca: Exécution des tests

source: A standard motor identification routine consists of two types of tests:
fr_ca: Une routine d'identification de moteur standard consiste en deux types de tests :

source: **Quasistatic:** In this test, the mechanism is gradually sped-up such that the voltage corresponding to acceleration is negligible (hence, "as if static").
fr_ca: **Quasistatic:** Dans ce test, le mécanisme est progressivement accéléré de telle sorte que la tension correspondant à l’accélération est négligeable (par conséquent, "quasistatic").

source: **Dynamic:** In this test, a constant 'step voltage' is given to the mechanism, so that the behavior while accelerating can be determined.
fr_ca: **Dynamic:** Dans ce test, un 'échelon' de tension constante est envoyée au mécanisme, de sorte que le comportement en accélération peut être déterminé.

source: Each test type is run both forwards and backwards, for four tests in total, corresponding to the four buttons.
fr_ca: Chaque type de test est exécuté à la fois en marche avant et en marche arrière, pour un total de quatre tests, correspondant aux quatre boutons.

source: Quasistatic Forward, Quasistatic Backward, Dynamic Forward, Dynamic Backward buttons
fr_ca: Les boutons Quasistatic Forward, Quasistatic Backward, Dynamic Forward, Dynamic Backward

source: The tests can be run in any order, but running a "backwards" test directly after a "forwards" test is generally advisable (as it will more or less reset the mechanism to its original position).
fr_ca: Les tests peuvent être exécutés dans n’importe quel ordre, mais l’exécution d’un test "en arrière" immédiatement après un test "en avant" est généralement conseillé (car il réinitialisera plus ou moins le mécanisme à sa position d’origine).

source: Follow the instructions in the pop-up windows after pressing each test button.
fr_ca: Suivez les instructions dans les fenêtres contextuelles après avoir appuyé sur chaque bouton de test.

source: Track Width
fr_ca: Largeur de voie

source: You can determine the track width of the robot by selecting the :guilabel:`Drivetrain (Angular)` test. This will also provide angular Kv and Ka parameters.
fr_ca: Vous pouvez déterminer la largeur de voie du robot en sélectionnant le test :guilabel:`Drivetrain (Angular)`. Ce qui fournira également les paramètres angulaires Kv et Ka.

source: This test will spin your robot to determine an empirical trackwidth. It compares how far the wheel encoders drove against the reported rotation from the gyroscope. To get the best results your wheels should maintain contact with the ground.
fr_ca: Ce test fera tourner votre robot pour déterminer une mesure empirique de la largeur de voie. Il compare la distance parcourue par les encodeurs de roue par rapport à la mesure de rotation donnée par le gyroscope. Pour obtenir les meilleurs résultats, vos roues doivent maintenir le contact avec le sol.

source: For high-friction wheels (like pneumatic tires), the empirical trackwidth calculated by sysid may be significantly different from the real trackwidth (e.g., off by a factor of 2). The empirical value should be preferred over the real one in robot code.
fr_ca: Pour les roues qui ont un coefficient de frottement élevé (comme les pneumatiques), la largeur de voie empirique calculée par sysid peut être significativement différente de la largeur de voie réelle (par exemple, un facteur de 2). La valeur empirique doit être préférée à la valeur réelle dans le code du robot.

source: The entire routine should look something like this:
fr_ca: Toute la routine devrait ressembler à ceci:

source: After all four tests have been completed, you can select the folder location for the save file and click :guilabel:`Save`.
fr_ca: Une fois les quatre tests terminés, vous pouvez sélectionner l’emplacement du dossier pour le fichier de sauvegarde et cliquer sur :guilabel:`Save`.

source: Saving the test data
fr_ca: Enregistrement des données de test

source: This will save the data as a JSON file with the specified location/name. A timestamp (``%Y%m%d-%H%M``) will be appended to the chosen filename. Additionally, the name of the file saved will be shown in the :guilabel:`Program Log`.
fr_ca: Cela permettra d’enregistrer les données en tant que fichier JSON avec l’emplacement/nom spécifié. Une estampille temporelle (``%Y%m%d-%H%M``) sera ajoutée au nom de fichier. De plus, le nom du fichier enregistré sera affiché dans le journal :guilabel:`Program Log`.

source: The number of samples collected for each test will be displayed in the Program Log.
fr_ca: Le nombre d’échantillons prélevés pour chaque test sera affiché dans le journal du programme ou Program Log.
