Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/system-identification/introduction.po
Languages: fr_ca

source: Introduction to System Identification
fr_ca: Introduction à l'identification du système

source: What is "System Identification?"
fr_ca: Qu'est-ce que "l'identification du système ?"

source: `System identification <https://en.wikipedia.org/wiki/System_identification>`__ is the process of determining a mathematical model for the behavior of a system through statistical analysis of its inputs and outputs.
fr_ca: `Identification du système <https://en.wikipedia.org/wiki/System_identification>`__ est le processus de détermination d'un modèle mathématique pour le comportement d'un système par l'analyse statistique de ses entrées et de ses sorties.

source: This model is a rule describing how input voltage affects the way our measurements (typically encoder data) evolve in time. A "system identification" routine takes such a model and a dataset and attempts to fit parameters which would make your model most closely-match the dataset. Generally, the model is not perfect - the real-world data are polluted by both measurement noise (e.g. timing errors, encoder resolution limitations) and system noise (unmodeled forces acting on the system, e.g. vibrations). However, even an imperfect model is usually "good enough" to give us accurate :ref:`feedforward control <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` of the mechanism, and even to estimate optimal gains for :ref:`feedback control <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.
fr_ca: Ce modèle est une règle décrivant comment la tension d'entrée affecte la façon dont nos mesures (généralement les données du codeur) évoluent dans le temps. Une routine "d'identification du système" prend un tel modèle et un ensemble de données et tente d'ajuster les paramètres qui rendraient votre modèle le plus proche de l'ensemble de données. Généralement, le modèle n'est pas parfait - les données du monde réel sont polluées à la fois par le bruit de mesure (par exemple, les erreurs de synchronisation, les limitations de résolution de l'encodeur) et le bruit du système (forces non modélisées agissant sur le système, par exemple les vibrations). Cependant, même un modèle imparfait est généralement "assez bon" pour nous donner un :ref:`contrôle anticipé <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` précis du mécanisme, et même pour estimer le mécanisme optimal gains pour :ref:`contrôle de retour <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.

source: In FRC, the most common system that we're interested in characterizing is the `permanent-magnet DC motor <https://en.wikipedia.org/wiki/Brushed_DC_electric_motor#Permanent-magnet_motors>`__, which closely obeys the following "voltage-balance equation" (for more information, see `this paper <https://www.chiefdelphi.com/uploads/default/original/3X/f/7/f79d24101e6f1487e76099774e4ba60683e86cda.pdf>`__):
fr_ca: Dans FRC, le système le plus courant que nous souhaitons caractériser est le `moteur à courant continu à aimant permanent <https://en.wikipedia.org/wiki/Brushed_DC_electric_motor#Permanent-magnet_motors>`__, qui obéit étroitement à ce qui suit " équation d'équilibre de tension" (pour plus d'informations, voir `ce document <https://www.chiefdelphi.com/uploads/default/original/3X/f/7/f79d24101e6f1487e76099774e4ba60683e86cda.pdf>`__):

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the motor, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration (the "overdot" notation traditionally denotes the `derivative <https://en.wikipedia.org/wiki/Derivative>`__ with respect to time).
fr_ca: où :math:`V` est la tension appliquée, :math:`d` est le déplacement (position) du moteur, :math:`\dot{d}` est la vitesse, et :math:`\ddot{d}` est son accélération (dans cette notation le "point" représente traditionnellement la `dérivée <https://en.wikipedia.org/wiki/Derivative>`__ par rapport au temps).

source: We can interpret the coefficients in the above equation as follows:
fr_ca: Nous pouvons interpréter les coefficients de l'équation ci-dessus comme suit :

source: ``kS`` is the voltage needed to overcome the motor's static friction, or in other words to just barely get it moving; it turns out that this static friction (because it’s, well, static) has the same effect regardless of velocity or acceleration. That is, no matter what speed you’re going or how fast you're accelerating, some constant portion of the voltage you've applied to your motor (depending on the specific mechanism assembly) will be going towards overcoming the static friction in your gears, bearings, etc; this value is your kS. Note the presence of the `signum function <https://en.wikipedia.org/wiki/Sign_function>`__, because friction force always opposes the direction-of-motion.
fr_ca: ``kS`` est la tension nécessaire pour surmonter la friction statique du moteur, ou en d’autres termes pour à peine le faire bouger; il s’avère que cette friction statique (parce qu’elle est, bel et bien, statique) a le même effet indépendamment de la vitesse ou de l’accélération. Autrement dit, quelle que soit votre vitesse de fonctionnement ou avec quelle rapidité vous accélérez, une partie constante de la tension que vous avez appliquée à votre moteur (selon l’assemblage du mécanisme spécifique à caractériser) servira à surmonter la friction statique dans vos engrenages, roulements, etc; cette valeur est votre kS. Notez la présence de la `fonction signe <https://fr.wikipedia.org/wiki/Fonction_signe>`__, parce que la force de friction s’oppose toujours à la direction de mouvement.

source: ``kV`` describes how much voltage is needed to hold (or "cruise") at a given constant velocity while overcoming the `electromagnetic resistance in the motor <https://en.wikipedia.org/wiki/Counter-electromotive_force>`__ and any additional friction that increases with speed (known as `viscous drag <https://en.wikipedia.org/wiki/Drag_(physics)#Very_low_Reynolds_numbers:_Stokes'_drag>`__). The relationship between speed and voltage (at constant acceleration) is almost entirely linear (with FRC\ |reg| components, anyway) because of how permanent-magnet DC motors work.
fr_ca: ``kV`` décrit la quantité de tension nécessaire pour se maintenir (ou "croisière") à une vitesse constante donnée tout en surmontant la `résistance électromagnétique dans le moteur <https://en.wikipedia.org/wiki/Counter-electromotive_force>`__ et toute friction supplémentaire qui augmente avec la vitesse (connu sous le nom de `traînée visqueuse <https://en.wikipedia.org/wiki/Drag_(physics)#Very_low_Reynolds_numbers:_Stokes'_drag>`__). La relation entre la vitesse et la tension (à une accélération constante) est presque entièrement linéaire (avec les composants FRC\ |reg|, de toute façon) en raison de la manière dont fonctionnent les moteurs DC à aimant permanent.

source: ``kA`` describes the voltage needed to induce a given acceleration in the motor shaft. As with ``kV``, the relationship between voltage and acceleration (at constant velocity) is almost perfectly linear for FRC components.
fr_ca: ``kA`` décrit la tension nécessaire pour induire une accélération donnée dans l’arbre moteur. Comme pour ``kV``, la relation entre la tension et l'accélération (à vitesse constante) est quasiment parfaitement linéaire pour les composants FRC.

source: Once these coefficients have been determined (SysId uses an `ordinary least-squares regression <https://en.wikipedia.org/wiki/Linear_regression>`__), we can then take a given desired velocity and acceleration for the motor and calculate the voltage that should be applied to achieve it. This is very useful - not only for, say, following motion profiles, but also for making mechanisms more controllable in open-loop control, because your joystick inputs will more closely match the actual mechanism motion.
fr_ca: Une fois ces coefficients déterminés (SysId utilise une `régression des moindres carrés ordinaire <https://en.wikipedia.org/wiki/Linear_regression>`__), nous pouvons alors prendre une vitesse et une accélération souhaitées pour le moteur et calculer la tension qui doit être appliquée pour y parvenir. Ceci est très utile - non seulement pour, par exemple, suivre des profils de mouvement, mais également pour rendre les mécanismes plus contrôlables en boucle ouverte, car les entrées de votre joystick correspondront plus étroitement au mouvement réel du mécanisme.

source: Some of the tools in this toolsuite introduce additional terms into the above equation to account for known differences from the simple case described above - details for each tool can be found below:
fr_ca: Certains des outils de cette suite logicielle introduisent des termes supplémentaires dans l’équation ci-dessus pour tenir compte des différences connues par rapport au cas simple décrit ci-dessus - les détails pour chaque outil peuvent être trouvés ci-dessous:

source: The WPILib System Identification Tool (SysId)
fr_ca: L'outil d'identification du système WPILib (SysId)

source: The WPILib system identification tool consists of an application that runs on the user's PC and matching robot code that runs on the user's robot. The PC application will send control signals to the robot over NetworkTables, while the robot sends data back to the application. The application then processes the data and determines model parameters for the user's robot mechanism, as well as producing diagnostic plots. Data can be saved (in JSON format) for future use, if desired.
fr_ca: L'outil d'identification du système WPILib se compose d'une application qui s'exécute sur le PC de l'utilisateur et d'un code robot correspondant qui s'exécute sur le robot de l'utilisateur. L'application PC enverra des signaux de contrôle au robot via NetworkTables, tandis que le robot renverra des données à l'application. L'application traite ensuite les données et détermine les paramètres du modèle pour le mécanisme du robot de l'utilisateur, ainsi que la production de tracés de diagnostic. Les données peuvent être enregistrées (au format JSON) pour une utilisation future, si vous le souhaitez.

source: Included Tools
fr_ca: Outils inclus

source: With a bit of ingenuity, these tools can be used to accurately characterize a surprisingly large variety of robot mechanisms. Even if your mechanism does not seem to obviously match any of the tools, an understanding of the system equations often reveals that one of the included routines will do.
fr_ca: Avec un peu d'ingéniosité, ces outils peuvent être utilisés pour caractériser avec précision une variété étonnamment large de mécanismes de robots. Même si votre mécanisme ne semble évidemment correspondre à aucun des outils, une compréhension des équations du système révèle souvent que l'une des routines incluses fera l'affaire.

source: The System Identification toolsuite currently supports:
fr_ca: La suite d'outils d'identification du système prend actuellement en charge :

source: Simple Motor Setups
fr_ca: Configurations de simples moteurs

source: Drivetrains
fr_ca: Bases pilotables

source: Elevators
fr_ca: Élevateurs

source: Arms
fr_ca: Bras

source: Several of these options use identical robot-side code, and differ only in the analysis routine used to interpret the data.
fr_ca: Plusieurs de ces options utilisent un code côté robot identique et ne diffèrent que par la routine d'analyse utilisée pour interpréter les données.

source: Simple Motor Identification
fr_ca: Identification simple du moteur

source: The simple motor identification tool determines the best-fit parameters for the equation:
fr_ca: L'outil d'identification de moteur simple détermine les paramètres les mieux adaptés à l'équation :

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the drive, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration. This is the model for a permanent-magnet dc motor with no loading other than friction and inertia, as mentioned above, and is an accurate model for flywheels, turrets, and horizontal linear sliders.
fr_ca: où :math:`V` est la tension appliquée, :math:`d` est le déplacement (position) du variateur, :math:`\dot{d}` est sa vitesse, et :math:`\ddot{d}` est son accélération. Il s'agit du modèle pour un moteur à courant continu à aimant permanent sans charge autre que le frottement et l'inertie, comme mentionné ci-dessus, et ceci est un modèle précis pour les volants d'inertie, les tourelles et les curseurs linéaires horizontaux.

source: Drivetrain Identification
fr_ca: Identification de la base pilotable

source: The drivetrain identification tool determines the best-fit parameters for the equation:
fr_ca: L'outil d'identification de la base pilotable détermine les paramètres les mieux adaptés à l'équation :

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the drive, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration. This is the same modeling equation as is used in the simple motor identification - however, the drivetrain identification tool is specifically set up to run on differential drives, and will characterize each side of the drive independently if desired.
fr_ca: où :math:`V` est la tension appliquée, :math:`d` est le déplacement (position) du variateur, :math:`\dot{d}` est sa vitesse et :math:`\ddot{ d}` est son accélération. Il s'agit de la même équation de modélisation que celle utilisée dans l'identification simple du moteur - cependant, l'outil d'identification de la base pilotable est spécifiquement configuré pour fonctionner sur des entraînements différentiels et caractérisera chaque côté de l'entraînement indépendamment si vous le souhaitez.

source: The drivetrain identification tool can also determine the effective trackwidth of your robot using a gyro. More information on how to run the identification is available in the :ref:`track width identification <docs/software/pathplanning/system-identification/identification-routine:Running Tests>` article.
fr_ca: L'outil d'identification de la transmission peut également déterminer la largeur de voie effective de votre robot à l'aide d'un gyroscope. Plus d'informations sur la façon d'exécuter l'identification sont disponibles dans l'article :ref:`identification de la largeur de piste <docs/software/pathplanning/system-identification/identification-routine:Running Tests>`.

source: Elevator Identification
fr_ca: Identification d'élévateur

source: The elevator identification tool determines the best-fit parameters for the equation:
fr_ca: L'outil d'identification d'élévateur détermine les paramètres les mieux adaptés à l'équation :

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the drive, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration. The constant term (:math:`kG`) is added to correctly account for the effect of gravity.
fr_ca: où :math:`V` est la tension appliquée, :math:`d` est le déplacement (position) de l'entraînement, :math:`\dot{d}` est sa vitesse, et :math:`\ddot{d}` est son accélération. Le terme constant (:math:`kG`) est ajouté pour parfaitement tenir compte de l’effet de la gravité.

source: Arm Identification
fr_ca: Identification du bras

source: The arm identification tool determines the best-fit parameters for the equation:
fr_ca: L'outil d'identification de bras détermine les paramètres les mieux adaptés à l'équation :

source: where :math:`V` is the applied voltage, :math:`\theta` is the angular displacement (position) of the arm, :math:`\dot{\theta}` is its angular velocity, and :math:`\ddot{\theta}` is its angular acceleration. The cosine term (:math:`kG`) is added to correctly account for the effect of gravity.
fr_ca: où :math:`V` est la tension appliquée, :math:`\theta` est le déplacement angulaire (position) du bras, :math:`\dot{\theta}` est sa vitesse angulaire et :math: `\ddot{\theta}` est son accélération angulaire. Le terme cosinus (:math:`kG`) est ajouté pour tenir compte correctement de l'effet de la gravité.

source: Installing the System Identification Tool
fr_ca: Installation de l’outil d’identification du système

source: The system identification tool (also referred to as ``sysid``) is included with the WPILib Installer.
fr_ca: L’outil d’identification du système (également appelé ``sysid``) est inclus avec le programme d’installation de la WPILib.

source: The old Python characterization tool from previous years is no longer supported.
fr_ca: L’ancien outil de caractérisation programmé en Python des années précédentes n’est plus pris en charge.

source: Launching the System Identification Tool
fr_ca: Lancement de l’outil d’identification du système

source: The system identification tool can be opened from the ``Start Tool`` option in VS Code or by using the shortcut inside the WPILib Tools desktop folder (Windows).
fr_ca: L’outil d’identification du système peut être ouvert à partir de l’option ``Start Tool`` dans VS Code ou en utilisant le raccourci à l’intérieur du dossier de bureau WPILib Tools (Windows).
