Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-simulation/drivesim-tutorial/drivetrain-model.po
Languages: es_mx, fr_ca, tr_tr

source: Step 2: Creating a Drivetrain Model
es_mx: Paso 2: Creación del modelo de la cadena de transmisión
fr_ca: Étape 2: Création d'un modèle de transmission pour une base pilotable
tr_tr: 2. Adım: Aktarma Sistemi Modeli Oluşturmak

source: In order to accurately determine how your physical drivetrain will respond to given motor voltage inputs, an accurate model of your drivetrain must be created. This model is usually created by measuring various physical parameters of your real robot. In WPILib, this drivetrain simulation model is represented by the ``DifferentialDrivetrainSim`` class.
es_mx: Para determinar con precisión cómo responderá su tren motriz físico a las entradas de voltaje del motor dadas, se debe crear un modelo preciso de su tren motriz. Este modelo generalmente se crea midiendo varios parámetros físicos de su robot real. En WPILib, este modelo de simulación de transmisión está representado por la clase ``DifferentialDrivetrainSim``.
fr_ca: Afin de déterminer avec précision comment votre transmission physique répondra à des entrées de tension moteur données, un modèle précis de votre transmission doit être créé. Ce modèle est généralement créé en mesurant divers paramètres physiques de votre vrai robot. Dans WPILib, ce modèle de simulation de transmission est représenté par la classe ``DifferentialDrivetrainSim``.
tr_tr: Fiziksel aktarma sisteminizin belirli motor voltaj girdilerine nasıl tepki vereceğini doğru bir şekilde belirlemek için aktarma sisteminizin doğru bir modeli oluşturulmalıdır. Bu model genellikle gerçek robotunuzun çeşitli fiziksel parametreleri ölçülerek oluşturulmaktadır. WPILib'de, bu aktarma sistemi simülasyon modeli ``DifferentialDrivetrainSim`` sınıfı ile temsil edilmektedir.

source: Creating a ``DifferentialDrivetrainSim`` from Physical Measurements
es_mx: Creación de un ``DifferentialDrivetrainSim`` a partir de mediciones físicas
fr_ca: Création d'un ``DifferentialDrivetrainSim`` à partir de mesures physiques
tr_tr: Fiziksel Ölçümler Üzerinden ``DifferentialDrivetrainSim`` Oluşturulması

source: One way to creating a ``DifferentialDrivetrainSim`` instance is by using physical measurements of the drivetrain and robot -- either obtained through :term:`CAD` software or real-world measurements (the latter will usually yield better results as it will more closely match reality). This constructor takes the following parameters:
tr_tr: ``DifferentialDrivetrainSim`` örneği oluşturmanın bir yolu, ya :term:`CAD` yazılımı ya da gerçek dünya ölçümleri ile elde edilmiş aktarma sistemi ile robotun fiziksel ölçümlerini kullanmaktadır (gerçek dünya ölçümleri gerçeğe daha yakın olacağı için daha iyi sonuçlar verecektir). Bu constructor aşağıdaki parametreleri kabul etmektedir:

source: The type and number of motors on one side of the drivetrain.
es_mx: El tipo y número de motores en un lado de la cadena de transmisión
fr_ca: Le type et le nombre de moteurs d'un côté de la transmission.
tr_tr: Aktarma sisteminin bir tarafındaki motorların türü ve sayısı.

source: The gear ratio between the motors and the wheels as output :term:`torque` over input :term:`torque` (this number is usually greater than 1 for drivetrains).
tr_tr: Çıktı :term:`torque`'u bölü girdi :term:`torque`'u olarak motor ve tekerlekler arasındaki dişli oranı (aktarma sistemleri için bu sayı genellikle 1'den büyüktür).

source: The moment of inertia of the drivetrain (this can be obtained from a :term:`CAD` model of your drivetrain. Usually, this is between 3 and 8 :math:`kg m^2`).
tr_tr: Aktarma sisteminin eylemsizlik momenti (bu değer aktarma sisteminizin :term:`CAD` modeli üzerinden elde edilebilmektedir. Genellikle değer 3 ila 8 :math:`kg m^2`'dir).

source: The mass of the drivetrain (it is recommended to use the mass of the entire robot itself, as it will more accurately model the acceleration characteristics of your robot for trajectory tracking).
es_mx: La masa de la cadena de transmisión(se recomienda utilizar la masa de todo el robot, ya que modelará con mayor precisión las características de aceleración de su robot para el seguimiento de la trayectoria).
fr_ca: La masse de la transmission (il est recommandé d'utiliser la masse de l'ensemble du robot lui-même, car elle modélisera plus précisément les caractéristiques d'accélération de votre robot pour le suivi de trajectoire).
tr_tr: Aktarma sisteminin kütlesi (yörünge izleme için robotunuzun hızlanma özelliklerini daha doğru bir şekilde modelleyeceği için tüm robotun kütlesinin kullanılması tavsiye edilmektedir).

source: The radius of the drive wheels.
es_mx: El radio de las ruedas motrices
fr_ca: Le rayon des roues motrices.
tr_tr: Sürüş tekerleklerinin yarıçapı.

source: The track width (distance between left and right wheels).
es_mx: El ancho de la pista (distancia entre las ruedas izquierda y derecha).
fr_ca: La largeur de voie (distance entre les roues gauche et droite).
tr_tr: İz genişliği (sol ve sağ tekerlekler arasındaki mesafe).

source: Standard deviations of measurement noise: this represents how much measurement noise you expect from your real sensors. The measurement noise is an array with 7 elements, with each element representing the standard deviation of measurement noise in x, y, heading, left velocity, right velocity, left position, and right position respectively. This option can be omitted in C++ or set to ``null`` in Java if measurement noise is not desirable.
es_mx: Desviaciones estándar del ruido de medición: esto representa la cantidad de ruido de medición que espera de sus sensores reales. El ruido de medición es una matriz con 7 elementos, y cada elemento representa la desviación estándar del ruido de medición en x, y, rumbo, velocidad izquierda, velocidad derecha, posición izquierda y posición derecha, respectivamente. Esta opción puede omitirse en C++ o establecerse en ``null`` en Java si el ruido de medición no es deseable.
fr_ca: Les écarts types du bruit de mesure: cela représente le bruit de mesure que vous attendez de vos capteurs réels. Le bruit de mesure est un tableau avec 7 éléments, chaque élément représentant l'écart type du bruit de mesure en x, y, cap, vitesse gauche, vitesse droite, position gauche et position droite respectivement. Cette option peut être omise en C ++ ou définie sur ``null`` en Java si le bruit de mesure n'est pas souhaitable.
tr_tr: Ölçüm gürültüsünün standart sapmaları: Bu, gerçek sensörlerinizden ne kadar ölçüm gürültüsü beklediğinizi göstermektedir. Ölçüm gürültüsü sırasıyla x, y, yön, sol hız, sağ hız, sol konum ve sağ konumdaki ölçüm gürültüsünün standart sapmasını temsil eden 7 öğeli bir dizidir. Bu seçenek, C++'da tamamen çıkarılabilmekte veya Java'da ölçüm gürültüsü istenmiyorsa ``null`` olarak ayarlanabilmektedir

source: You can calculate the measurement noise of your sensors by taking multiple data points of the state you are trying to measure and calculating the standard deviation using a tool like Python. For example, to calculate the standard deviation in your encoders' velocity estimate, you can move your robot at a constant velocity, take multiple measurements, and calculate their standard deviation from the known mean. If this process is too tedious, the values used in the example below should be a good representation of average noise from encoders.
es_mx: Puede calcular el ruido de medición de sus sensores tomando múltiples puntos de datos del estado que está tratando de medir y calculando la desviación estándar usando una herramienta como Python. Por ejemplo, para calcular la desviación estándar en la estimación de velocidad de sus codificadores, puede mover su robot a una velocidad constante, tomar varias medidas y calcular su desviación estándar de la media conocida. Si este proceso es demasiado tedioso, los valores usados ​​en el siguiente ejemplo deberían ser una buena representación del ruido promedio de los codificadores.
fr_ca: Vous pouvez calculer le bruit de mesure de vos capteurs en prenant plusieurs points de données de l'état que vous essayez de mesurer et en calculant l'écart type à l'aide d'un outil comme Python. Par exemple, pour calculer l'écart type dans l'estimation de la vitesse de vos encodeurs, vous pouvez déplacer votre robot à une vitesse constante, prendre plusieurs mesures et calculer leur écart type par rapport à la moyenne connue. Si ce processus est trop fastidieux, les valeurs utilisées dans l'exemple ci-dessous doivent être une bonne représentation du bruit moyen des codeurs.
tr_tr: Ölçmeye çalıştığınız durumun birden fazla veri noktasını ele alıp Python gibi bir araç ile standart sapmayı hesaplayarak sensörünüzün ölçüm gürültüsünü hesaplayabilirsiniz. Örneğin, kodlayıcılarınızın hız tahminindeki standart sapmayı hesaplamak için, robotunuzu sabit bir hızda hareket ettirip, birden fazla ölçüm alıp bilinen aritmetik ortalamasından yola çıkarak tahminin standart sapmasını hesaplayabilirsiniz. Bu işlem çok zahmetliyse, aşağıdaki örnekte kullanılan değerler kodlayıcılardan gelen ortalama gürültünün iyi bir temsili olacaktır.

source: The standard deviation of the noise for a measurement has the same units as that measurement. For example, the standard deviation of the velocity noise has units of m/s.
es_mx: La desviación estándar del ruido para una medida tiene las mismas unidades que esa medida. Por ejemplo, la desviación estándar del ruido de velocidad tiene unidades de m / s.
fr_ca: L'écart type du bruit pour une mesure a les mêmes unités que cette mesure. Par exemple, l'écart type du bruit de vitesse a des unités de m
tr_tr: Bir ölçüm için gürültünün standart sapması, ölçümle aynı birimlere sahiptir. Örneğin, hız gürültüsünün standart sapması m/s biriminde hesaplanmaktadır.

source: It is very important to use SI units (i.e. meters and radians) when passing parameters in Java. In C++, the :ref:`units library <docs/software/basic-programming/cpp-units:The C++ Units Library>` can be used to specify any unit type.
es_mx: Es muy importante utilizar las unidades del SI (es decir, metros y radianes) al pasar los parámetros en Java. En C++, la :ref:`librería de unidades <docs/software/basic-programming/cpp-units:The C++ Units Library>` puede ser usada para especificar cualquier tipo de unidad.
fr_ca: Il est très important d'utiliser des unités SI (c'est-à-dire des mètres et des radians) lors du passage de paramètres en Java. En C ++, la :ref:`librairie d’unités <docs/software/basic-programming/cpp-units:The C++ Units Library>` peut être utilisée pour spécifier n'importe quel type d'unité.
tr_tr: Java'da parametreleri iletimi sırasında SI birimlerinin (yani metre ve radyanın) kullanımı çok önemlidir. C++ 'da, :ref:`birimler kütüphanesi <docs/software/basic-programming/cpp-units:The C++ Units Library>` herhangi bir birim türünü belirtmek için kullanılabilmektedir.

source: Creating a ``DifferentialDrivetrainSim`` from SysId Gains
fr_ca: Création d'un ``DifferentialDrivetrainSim`` à partir de SysId Gains
tr_tr: SysId Kazançları Üzerinden ``DifferentialDrivetrainSim`` Oluşturulması

source: You can also use the gains produced by :ref:`System Identification <docs/software/advanced-controls/system-identification/introduction:Introduction to System Identification>`, which you may have performed as part of setting up the trajectory tracking workflow outlined :ref:`here <docs/software/pathplanning/trajectory-tutorial/index:Trajectory Tutorial>` to create a simulation model of your drivetrain and often yield results closer to real-world behavior than the method above.
tr_tr: Bunlara ek olarak aktarma sisteminizin bir simülasyon modelini oluşturmak için :ref:`burada <docs/software/pathplanning/trajectory-tutorial/index:Trajectory Tutorial> belirtilen yörünge takibi iş akışı ayarının bir parçası olarak çoktan gerçekleştirmiş olabileceğiniz :ref:`Sistem Tespiti <docs/software/advanced-controls/system-identification/introduction:Introduction to System Identification>` tarafından oluşturulmuş kazançları da kullanabilirsiniz. Bu yöntem sıklıkla yukarıdakine kıyasla gerçek dünya davranışlarına daha yakın sonuçlar vermektedir.

source: You must need two sets of ``Kv`` and ``Ka`` gains from the identification tool -- one from straight-line motion and the other from rotating in place. We will refer to these two sets of gains as linear and angular gains respectively.
fr_ca: Vous devez avoir besoin de deux ensembles de gains ``Kv`` et ``Ka`` de l'outil d'identification - l'un provenant du mouvement en ligne droite et l'autre de la rotation sur place. Nous appellerons respectivement ces deux ensembles de gains gains linéaires et gains angulaires.
tr_tr: Tespit aracından, bir tanesi düz bir doğrunun hareketinden diğeriyse durduğu yerde dönüşten elde edilmiş, iki çift ``Kv`` ve ``Ka`` kazancı elde edilmiş olmalıdır. Bu iki kazanç çiftini sırasıyla doğrusal ve açısal olarak adlandıracağız.

source: This constructor takes the following parameters:
es_mx: Este constructor toma los siguientes parámetros:
fr_ca: Ce constructeur prend les paramètres suivants:
tr_tr: Bu constructor aşağıdaki parametreleri kabul etmektedir:

source: A linear system representing the drivetrain -- this can be created using the identification gains.
fr_ca: Un système linéaire représentant la transmission - cela peut être créé en utilisant les gains d'identification.
tr_tr: Aktarma sistemini temsil eden doğrusal bir sistem. Bu sistem tespit kazançları kullanılarak oluşturulabilmektedir.

source: The track width (distance between the left and right wheels).
es_mx: El ancho de la pista(distancia entre las ruedas izquierda y derecha).
fr_ca: La largeur de voie (distance entre les roues gauche et droite).
tr_tr: İz genişliği (sol ve sağ tekerlekler arasındaki mesafe).

source: Creating a ``DifferentialDrivetrainSim`` of the KoP Chassis
es_mx: Crear un ``DifferentialDrivetrainSim`` del chasis KoP
fr_ca: Création d’un ``DifferentialDrivetrainSim`` du châssis KoP
tr_tr: KoP Şasisi için ``DifferentialDrivetrainSim`` Oluşturulması.

source: The ``DifferentialDrivetrainSim`` class also has a static ``createKitbotSim()`` (Java) / ``CreateKitbotSim()`` (C++) method that can create an instance of the ``DifferentialDrivetrainSim`` using the standard Kit of Parts Chassis parameters. This method takes 5 arguments, two of which are optional:
es_mx: La clase ``DifferentialDrivetrainSim`` también tiene un método estático ``createKitbotSim()`` (Java) / ``CreateKitbotSim()`` (C++) que puede crear una instancia del ``DifferentialDrivetrainSim`` utilizando los parámetros estándar del Kit de Piezas Chasis. Este método toma 5 argumentos, dos de los cuales son opcionales:
fr_ca: La classe ``DifferentialDrivetrainSim`` renferme également une méthode statique ``createKitbotSim()`` (Java) / ``CreateKitbotSim()`` (C++) qui peut créer une instance du ``DifferentialDrivetrainSim`` en utilisant les paramètres standard du châssis du kit de pièces. Cette méthode accepte 5 arguments, dont deux sont facultatifs :
tr_tr: ``DifferentialDrivetrainSim`` sınıfı, standart Parça Kiti Şasi parametreleri kullanılarak ``DifferentialDrivetrainSim`` örneğini oluşturabilen statik bir ``createKitbotSim()`` (Java) / ``CreateKitbotSim()`` (C++) metoduna da sahiptir. Bu metod, ikisi isteğe bağlı, 5 bağımsız değişken kabul etmektedir:

source: The gear ratio between the motors and the wheels as output :term:`torque` over input :term:`torque` (this number is usually greater than 1 for drivetrains).
tr_tr: Çıktı :term:`torque`'u bölü girdi :term:`torque`'u olarak motor ve tekerlekler arasındaki dişli oranı (aktarma sistemleri için bu sayı genellikle 1'den büyüktür).

source: The diameter of the wheels installed on the drivetrain.
es_mx: El diámetro de las ruedas instaladas en el chasís.
fr_ca: Le diamètre des roues installées sur la base pilotable.
tr_tr: Aktarma sistemlerine takılı tekerleklerin çapı.

source: The moment of inertia of the drive base (optional).
es_mx: El momento de inercia de la base motriz (opcional).
fr_ca: Le moment d’inertie de la base d’entraînement (facultatif).
tr_tr: Sürüş tabanının eylemsizlik momenti (isteğe bağlı).

source: You can use the ``KitbotMotor``, ``KitbotGearing``, and ``KitbotWheelSize`` enum (Java) / struct (C++) to get commonly used configurations of the Kit of Parts Chassis.
es_mx: Puedes utilizar los enum (Java) / struct (C++) ``KitbotMotor``, ``KitbotGearing``, y ``KitbotWheelSize`` para obtener las configuraciones más utilizadas del Kit de Piezas Chasis.
fr_ca: Vous pouvez utiliser l'enum (Java) / struct (C++) ``KitbotMotor``, ``KitbotGearing``, et ``KitbotWheelSize`` pour obtenir des configurations couramment utilisées du châssis fourni dans le kit de pièces.
tr_tr: Parça Kiti Şasisinin yaygın olarak kullanılan yapılandırmalarını elde etmek için ``KitbotMotor``, ``KitbotGearing`` ve ``KitbotWheelSize`` enum (Java) / struct (C++) kullanabilirsiniz.

source: Constructing your ``DifferentialDrivetrainSim`` instance in this way is just an approximation and is intended to get teams quickly up and running with simulation. Using empirical values measured from your physical robot will always yield more accurate results.
es_mx: La construcción de su instancia ``DifferentialDrivetrainSim`` de esta manera es sólo una aproximación y está pensada para que los equipos se pongan en marcha rápidamente con la simulación. El uso de valores empíricos medidos a partir de su robot físico siempre dará resultados más precisos.
fr_ca: Construire votre instance ``DifferentialDrivetrainSim`` de cette façon n’est qu’une approximation et vise à permettre aux équipes de mettre en place et d'exécuter des simulations. L’utilisation de valeurs empiriques mesurées à partir de votre robot physique donnera toujours des résultats plus précis.
tr_tr: ``DifferentialDrivetrainSim`` örneğinizi bu şekilde oluşturmak yaklaşık bir öneriden ibarettir ve takımların hızlı bir şekilde simülasyon kullanmaya başlamasını sağlamayı amaçlamaktadır. Fiziksel robotunuzdan ölçülen deneysel değerleri kullanmak her zaman daha doğru sonuçlar verecektir.

source: One way to creating a ``DifferentialDrivetrainSim`` instance is by using physical measurements of the drivetrain and robot -- either obtained through CAD software or real-world measurements (the latter will usually yield better results as it will more closely match reality). This constructor takes the following parameters:
es_mx: Una manera de crear un ejemplo de ``DifferentialDrivetrainSim`` es utilizando las medidas físicas de la transmisión y del robot.--ya sea obtenido a través de software CAD o mediciones del mundo real (este último generalmente producirá mejores resultados ya que coincidirá más con la realidad). Este constructor tomará los siguientes parámetros:
fr_ca: Une façon de créer une instance ``DifferentialDrivetrainSim`` consiste à utiliser des mesures physiques de la transmission et du robot - obtenues via un logiciel de CAO ou des mesures réelles (ces dernières donneront généralement de meilleurs résultats car elles correspondront plus étroitement à la réalité). Ce constructeur prend les paramètres suivants:

source: The moment of inertia of the drivetrain (this can be obtained from a CAD model of your drivetrain. Usually, this is between 3 and 8 :math:`kg m^2`).
es_mx: El momento de inercia del tren motriz(Este puede ser obtenido por el modelo del CAD del tren motriz. Usualmente, se encuentra entre 3 y 8 :math:`kg m^2`).
fr_ca: Le moment d'inertie de la transmission (il peut être obtenu à partir d'un modèle CAO de votre transmission. Habituellement, il est compris entre 3 et 8 :math:`kg m^2`).

source: You can also use the gains produced by :ref:`System Identification <docs/software/pathplanning/system-identification/introduction:Introduction to System Identification>`, which you may have performed as part of setting up the trajectory tracking workflow outlined :ref:`here <docs/software/pathplanning/trajectory-tutorial/index:Trajectory Tutorial>` to create a simulation model of your drivetrain and often yield results closer to real-world behavior than the method above.
fr_ca: Vous pouvez également utiliser les gains produits par :ref:`System Identification <docs/software/pathplanning/system-identification/introduction:Introduction to System Identification>`, que vous avez pu effectuer dans le cadre de la mise en place du workflow de suivi de trajectoire décrit : ref:`here <docs/software/pathplanning/trajectory-tutorial/index:Trajectory Tutorial>` pour créer un modèle de simulation de votre transmission et donner souvent des résultats plus proches du comportement réel que la méthode ci-dessus.
