Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-simulation/drivesim-tutorial/updating-drivetrain-model.po
Languages: fr_ca

source: Step 3: Updating the Drivetrain Model
fr_ca: Étape 3: Mise à jour du modèle de transmission

source: Now that the drivetrain model has been made, it needs to be updated periodically with the latest motor voltage commands. It is recommended to do this step in a separate ``simulationPeriodic()`` / ``SimulationPeriodic()`` method inside your subsystem and only call this method in simulation.
fr_ca: Maintenant que le modèle de transmission a été créé, il doit être mis à jour périodiquement avec les dernières commandes de tension du moteur. Il est recommandé de faire cette étape dans une méthode séparée ``simulationPeriodic()`` / ``SimulationPeriodic()`` dans votre sous-système et d'appeler cette méthode uniquement en simulation.

source: If you are using the command-based framework, every subsystem that extends ``SubsystemBase`` has a ``simulationPeriodic()`` / ``SimulationPeriodic()`` which can be overridden. This method is automatically run only during simulation. If you are not using the command-based library, make sure you call your simulation method inside the overridden ``simulationPeriodic()`` / ``SimulationPeriodic()`` of the main ``Robot`` class. These periodic methods are also automatically called only during simulation.
fr_ca: Si vous utilisez le framework basé sur les commandes, chaque sous-système qui étend ``SubsystemBase`` possède un ``simulationPeriodic()`` / ``SimulationPeriodic()`` qui peut être remplacé. Cette méthode est exécutée automatiquement uniquement pendant la simulation. Si vous n'utilisez pas la librairie basée sur les commandes, assurez-vous d'appeler votre méthode de simulation dans la classe remplacée ``simulationPeriodic()`` / ``SimulationPeriodic()`` de la classe principale ``Robot``. Ces méthodes périodiques sont également appelées automatiquement uniquement lors de la simulation.

source: There are three main steps to updating the model:
fr_ca: La mise à jour du modèle comporte trois étapes principales:

source: Set the :term:`input` of the drivetrain model. These are the motor voltages from the two sides of the drivetrain.
fr_ca: Définissez l’ :term:`entrée` du modèle de transmission. Ce sont les tensions du moteur des deux côtés de la transmission.

source: Advance the model forward in time by the nominal periodic timestep (Usually 20 ms). This updates all of the drivetrain's states (i.e. pose, encoder positions and velocities) as if 20 ms had passed.
fr_ca: Avancez le modèle dans le temps du pas de temps périodique nominal (généralement 20 ms). Cela met à jour tous les états de la transmission (c'est-à-dire la pose, les positions de l'encodeur et les vitesses) comme si 20 ms s'étaient écoulés.

source: Update simulated sensors with new positions, velocities, and angles to use in other places.
fr_ca: Mettez à jour les capteurs simulés avec de nouvelles positions, vitesses et angles.

source: If the right side of your drivetrain is inverted, you MUST negate the right voltage in the ``SetInputs()`` call to ensure that positive voltages correspond to forward movement.
fr_ca: Si le côté droit de votre transmission est inversé, vous DEVEZ inverser le signe de la tension dans l'appel ``SetInputs()`` pour vous assurer que les tensions positives correspondent au mouvement vers l'avant.

source: Because the drivetrain simulator model returns positions and velocities in meters and m/s respectively, these must be converted to encoder ticks and ticks/s when calling ``SetDistance()`` and ``SetRate()``. Alternatively, you can configure ``SetDistancePerPulse`` on the encoders to have the ``Encoder`` object take care of this automatically -- this is the approach that is taken in the example above.
fr_ca: Étant donné que le modèle de simulateur de transmission renvoie respectivement les positions et les vitesses en mètres et en m/s, celles-ci doivent être converties en ticks d'encodeur lors de l'appel de ``SetDistance()`` et ``SetRate()``. Alternativement, vous pouvez configurer ``SetDistancePerPulse`` sur les encodeurs pour que l'objet ``Encoder`` s'en charge automatiquement - c'est l'approche qui est adoptée dans l'exemple ci-dessus.

source: Now that the simulated encoder positions, velocities, and gyroscope angles have been set, you can call ``m_leftEncoder.GetDistance()``, etc. in your robot code as normal and it will behave exactly like it would on a real robot. This involves performing odometry calculations, running velocity PID feedback loops for trajectory tracking, etc.
fr_ca: Maintenant que les positions, les vitesses et les angles du gyroscope simulés ont été définis, vous pouvez appeler ``m_leftEncoder.GetDistance()``, etc. dans le code de votre robot comme d'habitude et il se comportera exactement comme il le ferait sur un vrai robot. Cela implique d'effectuer des calculs d'odométrie, des boucles de rétroaction PID de vitesse pour le suivi de trajectoire, etc.
