Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/running-a-benchtop/creating-benchtop-test-program-labview.po
Languages: es_mx, tr_tr

source: Creating your Benchtop Test Program (LabVIEW)
es_mx: Creando tu prototipo de programa de prueba (LabVIEW)
tr_tr: (LabVIEW) Masaüstü test programını yaratmak

source: This document covers how to create, build and load an FRC LabVIEW program onto a roboRIO. Before beginning, make sure that you have installed LabVIEW for FRC and the FRC Driver Station and that you have configured and imaged your roboRIO as described previously.
es_mx: Este documento cubre el cómo crear, construir y cargar un programa FRC LabVIEW a una roboRIO. Antes de empezar, asegúrese de tener instalado LabVIEW para FRC y el FRC Driver Station y que lo haya configurado y construido la imagen a tu roboRIO como fue descrito anteriormente.
tr_tr: Bu belge, bir FRC LabVIEW programının nasıl yaratılacağını, oluşturulacağını ve bir roboRIO'ya nasıl yükleneceğini kapsar. Başlamadan önce, FRC için LabVIEW ve FRC Driver Station kurduğunuzdan ve roboRIO'nuzun bir görüntüsünü daha önce açıklandığı gibi yapılandırdığınızdan emin olun.

source: Creating a Project
es_mx: Creando un proyecto
tr_tr: Proje yaratmak

source: Launch LabVIEW and click the FRC roboRIO Robot Project link in the Projects window to display the Create New FRC Robot Project dialog box.
es_mx: Abra LabVIEW y haga clic al FRC roboRIO Robot Project link en la pestaña de proyectos para mostrar la caja de dialogo Create New FRC Robot Project
tr_tr: LabVIEW'i başlatın ve Yeni FRC Robot Projesi Oluştur iletişim kutusunu görüntülemek için Projeler penceresindeki FRC roboRIO Robot Projesi bağlantısına tıklayın.

source: Configuring Project
es_mx: Configurando el proyecto
tr_tr: Projeyi yapılandırma

source: Fill in the Create New FRC Project Dialog:
es_mx: Rellene la casilla Create New FRC Project:
tr_tr: Yeni FRC projesi oluşturmak için iletişim kutusunu doldurun:

source: Pick a name for your project
es_mx: Escoja un nombre para su proyecto
tr_tr: Projeniz için isim seçin

source: Select a folder to place the project in.
es_mx: Seleccione la carpeta donde quiera guardar su proyecto
tr_tr: Projeyi yerleştirmek için bir klasör seçin

source: Enter your team number
es_mx: Escriba el número de su equipo
tr_tr: Takım numaranızı girin

source: Select a project type. If unsure, select Arcade Drive - roboRIO.
es_mx: Seleccione el tipo de proyecto. Si no está seguro, seleccione Arcade Drive – roboRIO
tr_tr: Bir proje türü seçin. Eğer emin değilseniz Arcade Drive - roboRIO seçin.

source: Click Finish
es_mx: Dé clic a Finish
tr_tr: Bitiri seçin

source: Running the Program
es_mx: Ejecutando el programa
tr_tr: Programı çalıştırmak

source: In the Project Explorer window, double-click the Robot Main.vi item to open the Robot Main VI.
es_mx: En la página Project Explorer, dé doble clic en Robot Main.vi para abrir Robot Main VI.
tr_tr: Proje Gezgini penceresinde, Robot Ana VI'yı açmak için Robot Main.vi öğesine çift tıklayın.

source: Click the Run button (White Arrow on the top ribbon) of the Robot Main VI to deploy the VI to the roboRIO. LabVIEW deploys the VI, all items required by the VI, and the target settings to memory on the roboRIO. If prompted to save any VIs, click Save on all prompts.
es_mx: Dé clic en el botón Run (Flecha blanca en la parte de arriba) del Robot Main VI para desplegar el VI a la roboRIO. LabVIEW inicia el VI, todo lo necesario para el VI, y los ajustes de destino a la memoria en la roboRIO. Si quiere guardar algún VI, dé clic en Save all prompts.
tr_tr: VI'yı roboRIO'ya dağıtmak için Robot Ana VI'nın Çalıştır düğmesine (üst şeritte Beyaz Ok) tıklayın. LabVIEW VI'yı, VI'nın gerektirdiği tüm öğeleri ve hedef ayarları roboRIO'daki belleğe dağıtır. Herhangi bir VI'yı kaydetmeniz istenirse, tüm istemlerde Kaydet'i tıklayın.

source: Click the Abort button of the Robot Main VI. Notice that the VI stops. When you deploy a program with the Run button, the program runs on the roboRIO, but you can manipulate the front panel objects of the program from the host computer.
es_mx: Dé clic en el botón Abort del Robot Main VI. Note que el VI se detiene. Cuando inicia un programa con el botón Run, el programa inicia en la roboRIO, pero usted puede manipular los objetos del panel frontal del programa desde la computadora principal.
tr_tr: Robot Main VI'nın Abort butonuna tıklayın. VI'nın durduğuna dikkat edin. Çalıştır düğmesiyle bir programı dağıttığınızda, program roboRIO üzerinde çalışır, ancak programın ön panel nesnelerini ana bilgisayardan değiştirebilirsiniz.

source: A program deployed in this manner will not remain on the roboRIO after a power cycle. To deploy a program to run every time the roboRIO starts follow the next step, Deploying the program.
es_mx: Un programa iniciado de esa manera no se mantendrá en la roboRIO después de un reinicio. Para iniciar un programa que corra cada vez que la roboRIO se inicie seguir el siguiente paso, Desplegando el programa
tr_tr: Bu şekilde dağıtılan bir program, bir güç döngüsünden sonra roboRIO'da kalmayacaktır. Bir programı roboRIO her başladığında çalışacak şekilde dağıtmak için bir sonraki adım olan Programı Dağıtma'yı izleyin.

source: Deploying the program
es_mx: Desplegando el programa
tr_tr: Bu şekilde dağıtılan bir program, bir güç döngüsünden sonra roboRIO'da kalmayacaktır. Bir programı roboRIO onun için çalışacak şekilde dağıtmak için bir sonraki adım olan Programı Dağıtma'yı izleyin.

source: To run in the competition, you will need to deploy a program to your roboRIO. This allows the program to survive across reboots of the controller, but doesn't allow the same debugging features (front panel, probes, highlight execution) as running from the front panel. To deploy your program:
es_mx: Para participar en la competencia, necesitará desplegar un programa a su roboRIO. Esto le permite al programa sobrevivir a través de los reinicios del controlador, pero no le permite las mismas características de depuración (panel frontal, sondeos) al iniciarlo desde el panel frontal. Para desplegar su programa:
tr_tr: Yarışmaya katılmak için roboRIO'nuza bir program dağıtmanız gerekecek. Bu, programın denetleyicinin yeniden başlatılması sırasında hayatta kalmasını sağlar, ancak ön panelden çalıştırılanla aynı hata ayıklama özelliklerine (ön panel, sondalar, vurgu yürütme) izin vermez. Programınızı dağıtmak için:

source: In the Project Explorer, click the + next to Build Specifications to expand it.
es_mx: En el Project Explorer, dé clic en el + al lado de Build Specifications para expandirlo.
tr_tr: Proje Keşfinde, Genişletmek için Özellikler Oluştur'un yanındaki + işaretine tıklayın.

source: Right-click on FRC Robot Boot-up Deployment and select Build. Wait for the build to complete.
es_mx: Dé clic derecho en FRC Robot Boot-Up Deployement y seleccione Build. Espere a que se termine de construir.
tr_tr: FRC Robot Önyükleme Dağıtımı'na sağ tıklayın ve Oluştur'u seçin. Yapının tamamlanmasını bekleyin.

source: Right-click again on FRC Robot Boot-Up Deployment and select Run as Startup. If you receive a conflict dialog, click OK. This dialog simply indicates that there is currently a program on the roboRIO which will be terminated/replaced.
es_mx: Nuevamente dé clic derecho en FRC Robot Boot-Up Deployement y seleccione Run as Startup, si recibe un diálogo de conflicto dé clic en ok. Este dialogo simplemente indica que hay actualmente un programa en la roboRIO el cual va a ser terminado/remplazado.
tr_tr: FRC Robot Önyükleme Dağıtımına tekrar sağ tıklayın ve Başlangıç Olarak Çalıştır'ı seçin. Çakışan bir iletişim kutusu alırsanız, Tamam'a tıklayın. Bu iletişim kutusu, roboRIO'da şu anda sonlandırılacak / değiştirilecek bir program olduğunu gösterir.

source: Either check the box to close the deployment window on successful completion or click the close button when the deployment completes.
es_mx: Seleccione la caja para cerrar la ventana de despliegue en una exitosa terminación o dé clic en el botón de cerrar cuando el despliegue termine.
tr_tr: Başarılı bir şekilde tamamlandığında dağıtım penceresini kapatmak için kutuyu işaretleyin veya dağıtım tamamlandığında kapat düğmesini tıklayın.

source: The roboRIO will automatically start running the deployed code within a few seconds of the dialog closing.
es_mx: La roboRIO automáticamente empezará a correr el código desplegado en unos cuantos segundos después de que el diálogo se cierre.
tr_tr: RoboRIO, iletişim kutusu kapandıktan sonra birkaç saniye içinde konuşlandırılan kodu otomatik olarak çalıştırmaya başlayacaktır.
