Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/running-a-benchtop/creating-benchtop-test-program-cpp-java.po
Languages: tr_tr

source: Creating your Benchtop Test Program (C++/Java)
tr_tr: Deneme Robotu Test Programınızı Oluşturma (C ++/Java)

source: Once everything is installed, we're ready to create a robot program. WPILib comes with several templates for robot programs. Use of these templates is highly recommended for new users; however, advanced users are free to write their own robot code from scratch. This article walks through creating a project from one of the provided examples which has some code already written to drive a basic robot.
tr_tr: Her şey kurulduktan sonra, bir robot programı oluşturmaya hazırız. WPILib, robot programları için çeşitli şablonlarla birlikte gelir. Bu şablonların kullanımı yeni kullanıcılar için şiddetle tavsiye edilir; ancak, ileri düzey kullanıcılar kendi robot kodlarını sıfırdan yazmakta özgürdür. Bu makale, temel bir robotu çalıştırmak için önceden yazılmış kodların bulunduğu örneklerden yola çıkarak bir proje oluşturmayı anlatır.

source: Creating a New WPILib Project
tr_tr: Yeni bir WPILib Projesi Oluşturma

source: Bring up the Visual Studio Code command palette with :kbd:`Control+Shift+P`:
tr_tr: Visual Studio Code komut paletini şu şekilde getirin :kbd:`Control+Shift+P`:

source: |Command Palette|
tr_tr: |Command Palet|

source: Then, type "WPILib" into the prompt. Since all WPILib commands start with "WPILib," this will bring up the list of WPILib-specific VS Code commands:
tr_tr: Ardından, komut istemi satırına "WPILib" yazın. Tüm WPILib komutları "WPILib" ile başladığından, bu, WPILib'e özgü VS Code komutlarının listesini getirecektir:

source: |WPILib Commands|
tr_tr: |WPILib Komutları|

source: Now, select the "Create a new project" command:
tr_tr: Şimdi, "Create a new project" komutunu seçin:

source: |Create New Project|
tr_tr: |Yeni Proje Oluşturmak|

source: This will bring up the "New Project Creator Window:"
tr_tr: Bu, "New Project Creator Window:" getirecektir:

source: |New Project Creator|
tr_tr: |New Project Creator - Yeni Proje Oluşturucu|

source: The elements of the New Project Creator Window are explained below:
tr_tr: New Project Creator Penceresinin öğeleri aşağıda açıklanmıştır:

source: **Project Type**: The kind of project we wish to create. For this example, select **Example**
tr_tr: **Project Type**: Oluşturmak istediğimiz proje türü. Bu örnek için **Example** seçin

source: **Language**: This is the language (C++ or Java) that will be used for this project.
tr_tr: **Language**: Bu proje için kullanılacak dildir (C++ veya Java).

source: **Project Base**: This box is used to select the base class or example to generate the project from. For this example, select **Getting Started**
tr_tr: **Project Base**: Bu kutu, projenin oluşturulacağı base class veya örneği seçmek için kullanılır. Bu örnek için, **Getting Started** öğesini seçin.

source: **Project Location**: This determines the folder in which the robot project will be located.
tr_tr: **Project Location**: Robot projesinin konumlandırılacağı klasörü belirler.

source: **Create New Folder**: If this is checked, a new folder will be created to hold the project within the previously-specified folder. If it is *not* checked, the project will be located directly in the previously-specified folder. An error will be thrown if the folder is not empty and this is not checked.
tr_tr: **Create New Folder**: Bu işaretlenirse, projeyi önceden belirtilen klasör içinde tutmak için yeni bir klasör oluşturulur. *not* işaretli değilse, proje doğrudan önceden belirtilen klasörde yer alacaktır. Klasör boş değilse ve bu kontrol edilmezse bir hata atılacaktır.

source: **Project Name**: The name of the robot project. This also specifies the name that the project folder will be given if the Create New Folder box is checked.
tr_tr: **Project Name**: Robot projesinin adı. Bu ayrıca Create New Folder kutusu işaretlendiğinde proje klasörünün verileceği adı da belirtir.

source: **Team Number**: The team number for the project, which will be used for package names within the project and to locate the robot when deploying code.
tr_tr: **Team Number**: Proje içindeki paket isimleri için ve kodu dağıtırken robotu bulmak için kullanılacak takım numarası.

source: **Desktop Support**: Enables unit test and simulation. While WPILib supports this, third party software libraries may not. If libraries do not support desktop, then your code may not compile or may crash. It should be left unchecked unless unit testing or simulation is needed and all libraries support it. For this example, do not check this box.
tr_tr: **Desktop Support**: Birim testi ve simülasyonu etkinleştirir. WPILib bunu desteklerken, üçüncü parti yazılım kütüphaneleri desteklemeyebilir. Kütüphaneler masaüstünü desteklemiyorsa, kodunuz derlenmeyebilir veya çökebilir. Birim testi veya simülasyon gerekmedikçe ve tüm kütüphaneler bunu desteklemedikçe, işaretlenmeden bırakılmalıdır. Bu örnek için bu kutuyu işaretlemeyin.

source: Once all the above have been configured, click "Generate Project" and the robot project will be created.
tr_tr: Yukarıdakilerin tümü yapılandırıldıktan sonra, "Generate Project" u tıklayın ve robot projesi oluşturulacaktır.

source: Any errors in project generation will appear in the bottom right-hand corner of the screen.
tr_tr: Proje oluşturmadaki herhangi bir hata, ekranın sağ alt köşesinde görünecektir.

source: Opening The New Project
tr_tr: Yeni Projeyi Açmak

source: After successfully creating your project, VS Code will give the option of opening the project as shown below. We can choose to do that now or later by typing :kbd:`Ctrl-K` then :kbd:`Ctrl-O` (or just :kbd:`Command+O` on macOS) and select the folder where we saved our project.
tr_tr: Projenizi başarıyla oluşturduktan sonra VS Code, aşağıda gösterildiği gibi projeyi açma seçeneği sunacaktır. Bunu şimdi veya daha sonra şunu yazarak yapmayı seçebiliriz: :kbd:`Ctrl-K` sonra :kbd:`Ctrl-O` (veya macOS'ta sadece :kbd:`Command+O`) ve projeyi kaydettiğimiz klasörü seçebiliriz.

source: Once opened we will see the project hierarchy on the left. Double clicking on the file will open that file in the editor.
tr_tr: Açıldıktan sonra solda proje hiyerarşisini göreceğiz. Dosyaya çift tıklamak o dosyayı düzenleyicide açacaktır.

source: |Opened Robot Project|
tr_tr: |Açılmış Robot Projesi|

source: C++ Configurations (C++ Only)
tr_tr: C++ Yapılandırmaları (Yalnızca C++)

source: For C++ projects, there is one more step to set up IntelliSense. Whenever we open a project, we should get a pop-up in the bottom right corner asking to refresh C++ configurations. Click "Yes" to set up IntelliSense.
tr_tr: C++ projeleri için IntelliSense'i kurmak için bir adım daha vardır. Ne zaman bir proje açsak, sağ alt köşede C++ yapılandırmalarını yenilememizi isteyen bir açılır pencere alırız. IntelliSense'i kurmak için "Yes" i tıklayın.

source: |C++ Configurations|
tr_tr: |C++ Yapılandırmaları|

source: Our code needs to reference the components of WPILib that are used. In C++ this is accomplished using ``#include`` statements; in Java it is done with ``import`` statements. The program references classes for ``Joystick`` (for driving), ``PWMVictorSPX`` (for controlling motors), ``TimedRobot`` (the base class used for the example), ``Timer`` (used for autonomous), ``DifferentialDrive`` (for connecting the joystick control to the motors), and ``LiveWindow`` (C++ only).
tr_tr: Kodumuzun kullanılan WPILib öğelerine başvurması gerekir. C++ 'da bu, ``#include`` 'ifadeleri kullanılarak gerçekleştirilir; Java'da bu, ``import`` ifadeleriyle yapılır. Program, ``Joystick`` (sürüş için), ``PWMVictorSPX`` (motorları kontrol etmek için), ``TimedRobot`` (örnek için kullanılan base class), ``Timer`` (otonom için kullanılır. ), ``DifferentialDrive`` (joystick kontrolünü motorlara bağlamak için) ve ``LiveWindow`` (yalnızca C ++) sınıflarını referans alır.

source: Defining the variables for our sample robot
tr_tr: Örnek robotumuz için değişkenleri - variables tanımlama

source: The sample robot in our examples will have a joystick on USB port 0 for arcade drive and two motors on PWM ports 0 and 1. Here we create objects of type DifferentialDrive (m_robotDrive), Joystick (m_stick) and time (m_timer). This section of the code does three things:
tr_tr: Örneklerimizdeki deneme robotu, arcade sürücüsü için USB port 0'da bir joystick'e ve PWM portu 0 ve 1'de iki motora sahip olacaktır. Burada, DifferentialDrive (m_robotDrive), Joystick (m_stick) ve time (m_timer) tipi objeler oluşturuyoruz. Kodun bu bölümü üç şey yapar:

source: Defines the variables as members of our Robot class.
tr_tr: Değişkenleri Robot class - sınıfı üyeleri olarak tanımlar.

source: Initializes the variables.
tr_tr: Değişkenleri başlatır.

source: The variable initializations for C++ are in the ``private`` section at the bottom of the program. This means they are private to the class (``Robot``). The C++ code also sets the Motor Safety expiration to 0.1 seconds (the drive will shut off if we don't give it a command every .1 seconds) and starts the ``Timer`` used for autonomous.
tr_tr: C++ için değişken başlatmalar, programın altındaki ``private`` bölümdedir. Bu, class (``Robot``)'a özel oldukları anlamına gelir. C++ kodu ayrıca Motor Güvenliği sona erme süresini 0,1 saniyeye ayarlar (her .1 saniyede bir komut vermezsek sürücü kapanır) ve otonom için kullanılan ``Timer`` başlatır.

source: Robot Initialization
tr_tr: Robot Başlatma

source: The ``RobotInit`` method is run when the robot program is starting up, but after the constructor. The ``RobotInit`` for our sample program gets a pointer to the ``LiveWindow`` instance (this is used in the test method discussed below). This method is omitted from the code, meaning the default version will be run (if we wanted to run something here we could provide the code above to override the default).
tr_tr: ``RobotInit`` methodu, robot programı başlatıldığında, ancak constructor - kurucu işlemi sonrası çalıştırılır. Örnek programımız için ``RobotInit``, ``LiveWindow`` örneğine bir işaretçi alır (bu, aşağıda tartışılan test yönteminde kullanılır). Bu yöntem koddan çıkarılır, yani varsayılan sürüm çalıştırılır (burada bir şey çalıştırmak istersek, varsayılanı geçersiz kılmak için yukarıdaki kodu kullanabiliriz).

source: Simple Autonomous Example
tr_tr: Basit Autonomous - Otonom Örneği

source: The ``AutonomousInit`` method is run once each time the robot transitions to autonomous from another mode. In this program, we reset the ``Timer`` and then start it in this method.
tr_tr: ``AutonomousInit`` yöntemi, robot başka bir moddan otonom moda her geçişinde bir kez çalıştırılır. Bu programda ``Timer``ı sıfırlıyor ve ardından bu method ile başlatıyoruz.

source: ``AutonomousPeriodic`` is run once every period while the robot is in autonomous mode. In the ``TimedRobot`` class the period is a fixed time, which defaults to 20ms. In this example, the periodic code checks if the timer is less than 2 seconds and if so, drives forward at half speed using the ``ArcadeDrive`` method of the ``DifferentialDrive`` class. If more than 2 seconds has elapsed, the code stops the robot drive.
tr_tr: Robot otonom moddayken ``AutonomousPeriodic`` her periyotta bir kez çalıştırılır. ``TimedRobot`` sınıfında periyot, varsayılan olarak 20ms olan sabit bir zamandır. Bu örnekte, periyodik kod, zamanlayıcının 2 saniyeden az olup olmadığını kontrol eder ve öyleyse, ``DifferentialDrive`` sınıfının ``ArcadeDrive`` methodunu kullanarak yarı hızda ilerler. 2 saniyeden fazla bir süre geçtiyse, kod robot sürücüsünü durdurur.

source: Joystick Control for teleoperation
tr_tr: Teleop Mode için Joystick Kontrolü

source: Like in Autonomous, the Teleop mode has a ``TeleopInit`` and ``TeleopPeriodic`` function. In this example we don't have anything to do in ``TeleopInit``, it is provided for illustration purposes only. In ``TeleopPeriodic``, the code uses the ``ArcadeDrive`` method to map the Y-axis of the ``Joystick`` to forward/back motion of the drive motors and the X-axis to turning motion.
tr_tr: Autonomous modda olduğu gibi, Teleop modunda da bir ``TeleopInit`` ve ``TeleopPeriodic`` fonksiyonu vardır. Bu örnekte ``TeleopInit`` ile yapabileceğimiz bir şey yok, bu sadece örnekleme amacıyla sağlanmıştır. ``TeleopPeriodic`` de kod, ``Joystick`` in Y eksenini tahrik motorlarının ileri / geri hareketine ve X eksenini dönüş hareketine eşlemek için ``ArcadeDrive`` methodunu kullanır.

source: Test Mode is used for testing robot functionality. Similar to ``TeleopInit``, the ``TestPeriodic`` is provided here for example.
tr_tr: Test Mode, robot işlevselliğini test etmek için kullanılır. ``TeleopInit`` e benzer şekilde, ``TestPeriodic`` burada örnek olarak sağlanmıştır.

source: Deploying the Project to a Robot
tr_tr: Projeyi bir Robota Göndermek

source: Please see the instructions :ref:`here <docs/software/vscode-overview/deploying-robot-code:Building and Deploying Robot Code>` for deploying the program onto a robot.
tr_tr: Programı bir robota yüklemek için lütfen talimatlara bakın: ref: :ref:`burada<docs/software/vscode-overview/deploying-robot-code:Building and Deploying Robot Code>`.
