Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/running-a-benchtop/running-benchtop-test.po
Languages: tr_tr

source: Running your Benchtop Test Program
tr_tr: Benchtop Test Programınızı Çalıştırma

source: Overview
tr_tr: Genel Bakış

source: You should create and download a Benchtop Test Program as described for your programming language:
tr_tr: Programlama diliniz için açıklandığı şekilde bir Masaüstü Test Programı oluşturmalı ve indirmelisiniz:

source: Tethered Operation
tr_tr: Bağlı Operasyon

source: Running your benchtop testing program while tethered to the Driver Station via ethernet or USB cable will confirm the the program was successfully deployed and that the driver station and roboRIO are properly configured.
tr_tr: Ethernet veya USB kablosuyla Driver Station'a bağlıyken tezgah üstü test programınızı çalıştırmak, programın başarıyla dağıtıldığını ve sürücü istasyonu ve roboRIO'nun doğru şekilde yapılandırıldığını onaylayacaktır.

source: The roboRIO should be powered on and connected to the PC over Ethernet or USB.
tr_tr: RoboRIO'nun gücü açılmalı ve bilgisayara Ethernet veya USB üzerinden bağlanmalıdır.

source: Starting the FRC Driver Station
tr_tr: FRC Sürücü İstasyonunu Başlatma

source: The FRC Driver Station can be launched by double-clicking the icon on the Desktop or by selecting Start->All Programs->FRC Driver Station.
tr_tr: FRC Driver Station, Masaüstündeki simgeye çift tıklayarak veya Başlat-> Tüm Programlar-> FRC Driver Station seçilerek başlatılabilir.

source: Setting Up the Driver Station
tr_tr: Sürücü İstasyonunun Kurulması

source: The DS must be set to your team number in order to connect to your robot. In order to do this click the Setup tab then enter your team number in the team number box. Press return or click outside the box for the setting to take effect.
tr_tr: Robotunuza bağlanmak için DS, takım numaranıza ayarlanmalıdır. Bunu yapmak için Kurulum sekmesine tıklayın ve ardından takım numarası kutusuna takım numaranızı girin. Ayarın etkili olması için return tuşuna basın veya kutunun dışını tıklayın.

source: PCs will typically have the correct network settings for the DS to connect to the robot already, but if not, make sure your Network adapter is set to DHCP.
tr_tr: Bilgisayarlar, DS'nin robota zaten bağlanması için genellikle doğru ağ ayarlarına sahip olacaktır, ancak yoksa, Ağ adaptörünüzün DHCP'ye ayarlandığından emin olun.

source: Confirm Connectivity
tr_tr: Bağlantıyı Onaylayın

source: Tethered
tr_tr: Bağlı

source: Wireless
tr_tr: Kablosuz

source: Using the Driver Station software, click Diagnostics and confirm that the Enet Link (or Robot Radio led, if operating wirelessly) and Robot leds are green.
tr_tr: Driver Station yazılımını kullanarak Diagnostics'e tıklayın ve Enet Link'in (veya kablosuz çalışıyorsa Robot Radio ledinin) ve Robot ledlerinin yeşil olduğunu onaylayın.

source: Operate the Robot
tr_tr: Robotu Çalıştırın

source: Click the Operation Tab
tr_tr: İşlem Sekmesine tıklayın

source: Confirm that battery voltage is displayed
tr_tr: Pil voltajının görüntülendiğini onaylayın

source: Communications, Robot Code, and Joysticks indicators are green.
tr_tr: İletişim, Robot Kodu ve Joystick göstergeleri yeşildir.

source: Put the robot in Teleop Mode
tr_tr: Robotu Teleop Moduna getirin

source: Click Enable. Move the joysticks and observe how the robot responds.
tr_tr: Etkinleştir'i tıklayın. Kumanda kollarını hareket ettirin ve robotun nasıl tepki verdiğini gözlemleyin.

source: Click Disable
tr_tr: Devre Dışı Bırak'a tıklayın

source: Wireless Operation
tr_tr: Kablosuz Çalışma

source: Before attempting wireless operation, tethered operation should have been confirmed as described in `Tethered Operation`_. Running your benchtop testing program while connected to the Driver Station via WiFi will confirm that the access point is properly configured.
tr_tr: Kablosuz işlemi denemeden önce, bağlı işlemin `Tethered Operation`_ bölümünde açıklandığı gibi onaylanmış olması gerekir. Driver Station'a WiFi aracılığıyla bağlıyken masaüstü test programınızı çalıştırmak, erişim noktasının doğru şekilde yapılandırıldığını onaylayacaktır.

source: Configuring the Access Point
tr_tr: Access Point - Erişim Noktasını Yapılandırma

source: See the article :ref:`Programming your radio <docs/getting-started/getting-started-frc-control-system/radio-programming:Programming your Radio>` for details on configuring the robot radio for use as an access point.
tr_tr: Robot radyoyu erişim noktası olarak kullanmak üzere yapılandırmayla ilgili ayrıntılar için şu makaleye bakın :ref:`Robot Radyo programlama<docs/getting-started/getting-started-frc-control-system/radio-programming:Programming your Radio>`

source: After configuring the access point, connect the driver station wirelessly to the robot. The SSID will be your team number (as entered in the Bridge Configuration Utility). If you set a key when using the Bridge Configuration Utility you will need to enter it to connect to the network. Make sure the computer network adapter is set to DHCP ("Obtain an IP address automatically").
tr_tr: Erişim noktasını yapılandırdıktan sonra, driver station'ı kablosuz olarak robota bağlayın. SSID, ekip numaranız olacaktır (Bridge Configuration Utility Programında girildiği gibi). Bridge Configuration Utility Programını kullanırken bir anahtar ayarlarsanız, ağa bağlanmak için bu anahtarı girmeniz gerekecektir. Bilgisayar ağ adaptörünün DHCP'ye ayarlandığından emin olun ("Otomatik olarak bir IP adresi al").

source: You can now confirm wireless operation using the same steps in **Confirm Connectivity** and **Operate the Robot** above.
tr_tr: Artık, yukarıdaki **Bağlantıyı Onayla** ve **Robotu Çalıştırma** bölümlerindeki aynı adımları kullanarak kablosuz çalışmayı onaylayabilirsiniz.
