Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/wpilibpi/image-thresholding.po
Languages: tr_tr, zh_cn

source: Thresholding an Image
tr_tr: Bir Görüntüyü Eşikleme
zh_cn: 阈值图像

source: In order to turn a colored image, such as the one captured by your camera, into a binary image, with the target as the "foreground", we need to threshold the image using the hue, saturation, and value of each pixel.
tr_tr: Kameranız tarafından çekilmiş gibi renkli bir görüntüyü hedefin "foreground-ön plan" olduğu ikili bir görüntüye dönüştürmek için, her pikselin tonunu, doygunluğunu ve değerini kullanarak görüntüyü eşik yapmamız gerekir.
zh_cn: 为了将彩色图像，例如由您的相机捕获的图像，转换为以目标为“前景”的二进制图像，我们需要使用每个像素的色相，饱和度和值对图像进行阈值处理。

source: The HSV Model
tr_tr: HSV Modeli
zh_cn: HSV模型

source: Unlike RGB, HSV allows you to not only filter based on the colors of the pixels, but also by the intensity of color and the brightness.
tr_tr: RGB'den farklı olarak HSV, yalnızca piksellerin renklerine göre değil, aynı zamanda renk yoğunluğuna ve parlaklığa göre de filtre uygulamanıza olanak tanır.
zh_cn: 与RGB不同，HSV不仅可以根据像素的颜色进行过滤，还可以根据颜色的强度和亮度进行过滤。

source: Hue: Measures the color of the pixel.
tr_tr: Ton: Pikselin rengini ölçer.
zh_cn: 色相：测量像素的颜色。

source: Saturation: Measures the intensity of color of the pixel.
tr_tr: Doygunluk: Pikselin renk yoğunluğunu ölçer.
zh_cn: 饱和度：测量像素的颜色强度。

source: Value: Measures the brighness of the pixel.
tr_tr: Değer: Pikselin parlaklığını ölçer.
zh_cn: 值：测量像素的亮度。

source: You can use OpenCV to convert a BGR image matrix to HSV.
tr_tr: Bir BGR görüntü matrisini HSV'ye dönüştürmek için OpenCV'yi kullanabilirsiniz.
zh_cn: 您可以使用OpenCV将BGR图像矩阵转换为HSV。

source: OpenCV's hue range is from 1° to 180° instead of the common 1° to 360°. In order to convert a common hue value to OpenCV, divide by 2.
tr_tr: OpenCV'nin ton aralığı, ortak 1 ° ila 360 ° yerine 1 ° ila 180 ° arasındadır. Ortak bir ton değerini OpenCV'ye dönüştürmek için 2'ye bölün.
zh_cn: OpenCV的色相范围从1°到180°，而不是普通的1°到360°。为了将通用色相值转换为OpenCV，请除以2。

source: Thresholding
tr_tr: Thresholding-Eşik
zh_cn: 阈值

source: We will use this field image as an example for the whole process of image processing.
tr_tr: Bu alan görüntüsünü tüm görüntü işleme süreci için örnek olarak kullanacağız.
zh_cn: 我们将以现场图像为例来说明整个图像处理过程。

source: By thresholding the image using HSV, you can separate the image into the vision target (foreground), and the other things that the camera sees (background). The following code example converts a HSV image into a binary image by thresholding with HSV values.
tr_tr: Görüntüyü HSV kullanarak eşleyerek, görüntüyü hedef (ön plan) ve kameranın gördüğü diğer şeyler (arka plan) olarak ayırabilirsiniz. Aşağıdaki kod örneği, bir HSV görüntüsünü HSV değerleriyle eşikleyerek ikili görüntüye dönüştürür.
zh_cn: 通过使用HSV对图像进行阈值处理，可以将图像分为视觉目标（前景）和相机看到的其他物体（背景）。以下代码示例通过使用HSV值进行阈值处理将HSV图像转换为二进制图像。

source: These values may have to be tuned on an per-venue basis, as ambient lighting may differ across venues. It is recommended to allow editing of these values through NetworkTables in order to facilitate on-the-fly editing.
tr_tr: Ortam aydınlatması mekanlar arasında farklılık gösterebileceğinden, bu değerlerin mekana göre ayarlanması gerekebilir. Anında düzenlemeyi kolaylaştırmak için bu değerlerin NetworkTables aracılığıyla düzenlenmesine izin verilmesi önerilir.
zh_cn: 这些值可能必须在每个场所进行调整，因为不同场所的环境照明可能会有所不同。建议通过NetworkTables编辑这些值，以便于即时编辑。

source: After thresholding, your image should look like this.
tr_tr: Eşiklemeden sonra, görüntünüz böyle görünmelidir.
zh_cn: 阈值化后，您的图像应如下所示。

source: As you can see, the thresholding process may not be 100% clean. You can use morphological operations to deal with the noise.
tr_tr: Gördüğünüz gibi, eşikleme işlemi% 100 temiz olmayabilir. Gürültüyle başa çıkmak için morfolojik işlemleri kullanabilirsiniz.
zh_cn: 如您所见，阈值处理可能不是100％干净。您可以使用形态学运算来处理噪声。
