Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card.po
Languages: tr_tr, zh_cn

source: Installing the image to your MicroSD card
tr_tr: Görüntüyü MicroSD kartınıza yükleme
zh_cn: 将图形库安装到MicroSD卡上

source: Getting the FRC Raspberry PI image
tr_tr: FRC Raspberry PI görüntüsünü alma
zh_cn: 获得FRC树莓派的图形库

source: The image is stored on the GitHub release page for the WPILibPi `repository <https://github.com/wpilibsuite/WPILibPi/releases>`__.
tr_tr: Görüntü, WPILibPi `deposu <https://github.com/wpilibsuite/WPILibPi/releases>`__ için GitHub yayın sayfasında saklanır.
zh_cn: 该图像存储在WPILibPi`repository <https://github.com/wpilibsuite/WPILibPi/releases> __的GitHub发布页面上。

source: In addition to the instructions on this page, see the documentation on the GitHub web page (below).
tr_tr: Bu sayfadaki talimatlara ek olarak GitHub web sayfasındaki (aşağıda) belgelere bakın.
zh_cn: 除了这里的指示与介绍，还可以前往GitHub的网页上看Documentation。

source: The image is fairly large so have a fast internet connection when downloading it. Always use the most recent release from the top of the list of releases.
tr_tr: Görsel oldukça büyük olduğundan, indirirken hızlı bir internet bağlantısına sahip olun. Her zaman sürüm listesinin en üstündeki en son sürümü kullanın.
zh_cn: 由于图形库比较大，所以推荐在较快的网络下下载。永远要使用最新的发布版本(将会显示在列表的最顶端）。

source: Copy the image to your MicroSD card
tr_tr: Görüntüyü MicroSD kartınıza kopyalayın
zh_cn: 将图形库拷⻉贝到你的MicroSD卡上

source: Download and install Etcher (https://www.balena.io/etcher/) to image the micro SD card. The micro SD card needs to be at least 4 GB. Note: a micro SD to USB dongle such as https://www.amazon.com/gp/product/B0779V61XB works well for writing to micro SD cards.
tr_tr: Mikro SD kartın görüntüsünü almak için Etcher'ı (https://www.balena.io/etcher/) indirin ve yükleyin. Mikro SD kartın en az 4 GB olması gerekir. Not: https://www.amazon.com/gp/product/B0779V61XB gibi bir mikro SD'den USB'ye dongle, mikro SD kartlara yazmak için iyi çalışır.

source: Flash the MicroSD card with the image using Etcher by selecting the zip file as the source, your SD card as the destination and click "Flash". Expect the process to take about 3 minutes on a fairly fast laptop.
tr_tr: Kaynak olarak zip dosyasını, hedef olarak SD kartınızı seçerek ve "Flash" seçeneğine tıklayarak MicroSD kartını Etcher kullanarak görüntü ile flaşlayın. Oldukça hızlı bir dizüstü bilgisayarda işlemin yaklaşık 3 dakika sürmesini bekleyin.
zh_cn: 使用Etcher，选择好你的MicroSD卡所在的磁盘作为目标，并点击“Flash”来进行格式 化。预计整个过程将持续3分钟。

source: Testing the Raspberry PI
tr_tr: Raspberry PI Test Etme
zh_cn: 使⽤用树莓派进⾏行行测试

source: Put the micro SD card in a rPi 3 and apply power.
tr_tr: Mikro SD kartı bir rPi 3'e yerleştirin ve gücü uygulayın.
zh_cn: 将MicroSD卡插入树苺派3(简记为rPi 3），并插电。

source: Connect the rPi 3 ethernet to a LAN or PC. Open a web browser and connect to ``http://wpilibpi.local/`` to open the web dashboard. On the first bootup the filesystem will be writable, but later bootups will default to read only, so it's necessary to click the "writable" button to make changes.
tr_tr: rPi 3 ethernet'i bir LAN veya PC'ye bağlayın. Bir web tarayıcısı açın ve web panosunu açmak için ``http://wpilibpi.local/`` adresine bağlanın. İlk önyüklemede dosya sistemi yazılabilir olacaktır, ancak sonraki önyüklemeler varsayılan olarak salt okunur olacaktır, bu nedenle değişiklik yapmak için "writable-yazılabilir" düğmesine tıklamak gerekir.
zh_cn: 将rPi3 通过网线连接到LAN或者PC。打开网络浏览器并连接到``http://wpilibpi.local/``来打开web dashboard。在最开始，系统的启动文件系统都是可读写的，但是在将来其将默认变成只读。所以如果要进行任何形式的更改，需要点击“可写”按钮来完成操作。

source: Logging into the Raspberry PI
tr_tr: Raspberry PI'da oturum açma
zh_cn: 登录到树莓派

source: Most tasks with the rPi can be done from the web console interface. Sometimes for advanced use such as program development on the rPi it is necessary to log in. To log in, use the default Raspberry PI password: ::
tr_tr: rPi ile çoğu görev, web konsolu arayüzünden yapılabilir. Bazen rPi'de program geliştirme gibi gelişmiş kullanım için oturum açmak gerekir. Oturum açmak için varsayılan Raspberry PI şifresini kullanın: ::
zh_cn: 大多数rPi操作可以在网络终端界面完成，但是一些更高级的，比如程序开发则需要进行登录，若要登录，请使用树苺派的默认密码：
