Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/wpilibpi/morphological-operations.po
Languages: fr_ca, tr_tr, zh_cn

source: Morphological Operations
fr_ca: Opérations morphologiques
tr_tr: Morfolojik İşlemler
zh_cn: 形态学运算

source: Sometimes, after thresholding your image, you have unwanted noise in your binary image. Morphological operations can help remove that noise from the image.
fr_ca: Parfois, après avoir traité votre image avec un seuil (Threshold), vous avez du bruit indésirable dans l'image binaire résultante. Les opérations morphologiques peuvent aider à supprimer ce bruit.
tr_tr: Bazen, görüntünüzü eşledikten sonra, ikili görüntünüzde istenmeyen parazit olur. Morfolojik işlemler bu gürültüyü görüntüden çıkarmaya yardımcı olabilir.
zh_cn: 有时，在对图像进行阈值处理后，二进制图像中会出现不必要的噪点。形态学操作可以帮助去除图像中的噪点。

source: Kernel
fr_ca: Noyau (Kernel)
tr_tr: Çekirdek
zh_cn: 核心

source: The kernel is a simple shape where the origin is superimposed on each pixel of value 1 of the binary image. OpenCV limits the kernel to a NxN matrix where N is an odd number. The origin of the kernel is the center. A common kernel is
fr_ca: Le noyau est une forme simple où l'origine est superposée à chaque pixel de valeur 1 de l'image binaire. OpenCV limite le noyau à une matrice NxN où N est un nombre impair. L'origine du noyau est le centre. Un noyau commun est:
tr_tr: Çekirdek, başlangıç noktasının ikili görüntünün 1 değerinin her pikselinin üzerine yerleştirildiği basit bir şekildir. OpenCV, çekirdeği NxN matrisiyle sınırlar, burada N tek sayıdır. Çekirdeğin kökeni merkezdir. Ortak bir çekirdek
zh_cn: 核心是简单的形状，其中原点叠加在二进制图像值1的每个像素上。 OpenCV将内核限制为NxN矩阵，其中N为奇数。内核的起源是中心。一个常见的内核是

source: Different kernels can affect the image differently, such as only eroding or dilating vertically.
fr_ca: Différents noyaux peuvent affecter l'image différemment, tels que l'érosion ou la dilatation appliquée verticalement.
tr_tr: Farklı çekirdekler, görüntüyü farklı şekilde etkileyebilir, örneğin yalnızca dikey olarak aşındırma veya genişletme.
zh_cn: 不同的核心可以对图像产生不同的影响，例如仅侵蚀或垂直扩展。

source: For reference, this is our binary image we created:
fr_ca: Pour référence, voici notre image binaire que nous avons créée:
tr_tr: Referans için, oluşturduğumuz ikili imajımız:
zh_cn: 作为参考，这是我们创建的二进制映像：

source: Original binary image.
fr_ca: Image binaire d’origine.

source: Erosion
fr_ca: Érosion
tr_tr: Erozyon
zh_cn: 侵蚀

source: Erosion in computer vision is similar to erosion on soil. It takes away from the borders of foreground objects. This process can remove noise from the background.
fr_ca: L'érosion en vision par ordinateur est similaire à l'érosion sur le sol. Elle amenuise les rebords des objets de premier plan. Ce processus peut supprimer le bruit de l'arrière-plan.
tr_tr: Bilgisayarla görmedeki erozyon, topraktaki erozyona benzer. Ön plandaki nesnelerin sınırlarından uzaklaşır. Bu işlem arka plandaki gürültüyü ortadan kaldırabilir.
zh_cn: 计算机视觉中的侵蚀类似于土壤上的侵蚀。它消除了前景对象的边界。此过程可以消除背景噪音。

source: Image after erosion. Little spots have gone away and large spots reduced in size.
fr_ca: Image après érosion. Les petites taches ont disparu et les grandes taches ont été réduites en taille.

source: During erosion, if the superimposed kernel's pixels are not contained completely by the binary image's pixels, the pixel that it was superimposed on is deleted.
fr_ca: Pendant l'érosion, les pixels de l'image binaire qui ne sont pas superposés par les pixels du noyau sont supprimés.
tr_tr: Erozyon sırasında, üst üste binen çekirdeğin pikselleri tamamen ikili görüntünün pikselleri tarafından kapsanmazsa, üzerine bindirildiği piksel silinir.
zh_cn: 在腐蚀过程中，如果二进制图像的像素没有完全包含叠加的内核像素，则将其叠加的像素删除。

source: Dilation
fr_ca: Dilatation
tr_tr: Dilation-Genişleme
zh_cn: 扩张

source: Dilation is opposite of erosion. Instead of taking away from the borders, it adds to them. This process can remove small holes inside a larger region.
fr_ca: La dilatation est le contraire de l'érosion. Au lieu d'amenuiser les rebords, on les renforcit. Ce processus peut contribuer à supprimer de petits trous à l'intérieur d'une plus grande région.
tr_tr: Genleşme erozyonun tam tersidir. Sınırlardan uzaklaşmak yerine onlara katkıda bulunuyor. Bu işlem, daha geniş bir bölgedeki küçük delikleri kaldırabilir.
zh_cn: 扩张与侵蚀相反。它没有远离边界，反而增加了边界。此过程可以去除较大区域内的小孔。

source: Image after Dilation. All of the spots have grown larger.
fr_ca: Image après dilatation. Toutes les taches ont été agrandies.

source: During dilation, every pixel of every superimposed kernel is included in the dilation.
fr_ca: Pendant la dilatation, chaque pixel de chaque noyau superposé est inclus dans la dilatation.
tr_tr: Genişletme sırasında, üst üste binen her çekirdeğin her pikseli genişlemeye dahil edilir.
zh_cn: 在扩张过程中，每个叠加核的每个像素都包含在扩张中。

source: Opening
fr_ca: Ouverture
tr_tr: Opening-Açılış
zh_cn: 开放

source: Opening is erosion followed by dilation. This process removes noise without affecting the shape of larger features.
fr_ca: L'ouverture est une érosion suivie d'une dilatation. Ce processus supprime le bruit sans affecter la forme des entités plus grandes.
tr_tr: Açılma erozyon ve ardından genişlemedir. Bu işlem, daha büyük özelliklerin şeklini etkilemeden gürültüyü ortadan kaldırır.
zh_cn: 开放是侵蚀，然后是扩张。此过程可消除噪声，而不会影响较大特征的形状。

source: Image after Opening. It has removed most of the small artifacts but still keeps the large size of the larger elements.
fr_ca: Image après ouverture. Ce opération a supprimé la plupart des petits artefacts, mais conserve toujours la grande taille des éléments plus grands.

source: In this specific case, it is appropriate to do more iterations of opening in order to get rid of the pixels in the top right.
fr_ca: Dans ce cas précis, il convient de faire quelques itérations d'ouverture afin de se débarrasser des pixels en haut à droite.
tr_tr: Bu özel durumda, sağ üstteki piksellerden kurtulmak için daha fazla açma yinelemesi yapmak uygundur.
zh_cn: 在这种特定情况下，为了消除右上角的像素，应该进行更多次开放迭代。

source: Closing
fr_ca: Fermeture
tr_tr: Closing-Kapanış
zh_cn: 关闭

source: Closing is dilation followed by erosion. This process removes small holes or breaks without affecting the shape of larger features.
fr_ca: La fermeture est une dilatation suivie d'une érosion. Ce processus supprime les petits trous ou les ruptures sans affecter la forme des entités plus grandes.
tr_tr: Kapatma genişlemedir ve ardından erozyon meydana gelir. Bu işlem, daha büyük unsurların şeklini etkilemeden küçük delikleri veya kırılmaları giderir.
zh_cn: 关闭是扩张，然后是侵蚀。此过程可去除小孔或裂口，而不会影响较大特征的形状。

source: Little holes around the image have been removed but overall size of each object stayed roughly the same.
fr_ca: De petits trous autour de l’image ont été supprimés, mais la taille globale de chaque objet est restée à peu près la même.
