Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/wpilibpi/the-raspberry-pi-frc-console.po
Languages: fr_ca, tr_tr

source: The Raspberry PI
fr_ca: Le Raspberry PI
tr_tr: Raspberry PI

source: FRC Console
fr_ca: Console FRC
tr_tr: FRC Konsolu

source: The FRC\ |reg| image for the Raspberry PI includes a console that can be viewed in any web browser that makes it easy to:
fr_ca: L'image FRC\ |reg| pour le Raspberry PI comprend une console qui peut être affichée dans n'importe quel navigateur Web, ce qui permet de:
tr_tr: FRC \|reg| Raspberry PI görüntüsü, aşağıdakileri kolaylaştıran herhangi bir web tarayıcısında görüntülenebilen bir konsol içerir:

source: Look at the Raspberry PI status
fr_ca: Visualiser l'état du Raspberry PI
tr_tr: Raspberry PI durumuna bakın

source: View the status of the background process running the camera
fr_ca: Afficher l'état du processus d'arrière-plan exécutant la caméra
tr_tr: Kamerayı çalıştıran arka plan işleminin durumunu görüntüleyin

source: View or change network settings
fr_ca: Afficher ou modifier les paramètres réseau
tr_tr: Ağ ayarlarını görüntüleyin veya değiştirin

source: Look at each camera plugged into the rPI and add additional cameras
fr_ca: Regardez chaque caméra connectée au rPI et ajoutez des caméras supplémentaires
tr_tr: RPI'ye bağlı her kameraya bakın ve ek kameralar ekleyin

source: Load a new vision program onto the rPI
fr_ca: Charger un nouveau programme de vision sur le rPI
tr_tr: RPI'ye yeni bir görsel denetim programı yükleyin

source: Setting the rPI to be Read-Only vs. Writable
fr_ca: Définition du rPI en lecture seule ou en écriture
tr_tr: RPI'yı Salt Okunur ve Yazılabilir Olarak Ayarlama

source: The rPI is normally set to Read-Only which means that the file system cannot be changed. This ensures that if power is removed without first shutting down the rPi the file system isn't corrupted. When settings are changed (following sections), the new settings cannot be saved while the rPI file system is set as Read-Only. Buttons are provided that allow the file system to be changed from Read-Only to Writable and back whenever changes are made. If the other buttons that change information stored on the rPI cannot be press, check the Read-Only status of the system.
fr_ca: Le rPI est normalement défini en mode lecture-seulement (Read-Only), ce qui signifie que le système de fichiers ne peut pas être modifié. Cela garantit que si l'alimentation est interrompue sans d'abord arrêter le rPi, le système de fichiers n'est pas corrompu. Lorsque les paramètres sont modifiés (sections suivantes), les nouveaux paramètres ne peuvent pas être enregistrés lorsque le système de fichiers rPI est défini en lecture-seulement. Des boutons sont fournis pour permettre au système de fichiers de passer de lecture-seulement à écriture et inversement chaque fois que des modifications sont apportées. Si vous ne pouvez pas appuyer sur les autres boutons qui modifient les informations stockées sur le rPI, vérifiez l'état en lecture-seulement du système.
tr_tr: RPI normalde Read-Only-Salt Okunur olarak ayarlanır, bu da dosya sisteminin değiştirilemeyeceği anlamına gelir. Bu, rPi'yi kapatmadan güç kesilirse dosya sisteminin bozulmamasını sağlar. Ayarlar değiştirildiğinde (sonraki bölümler), rPI dosya sistemi Salt Okunur olarak ayarlandığında yeni ayarlar kaydedilemez. Dosya sisteminin Salt Okunur'dan Yazılabilir'e değiştirilmesine ve her değişiklik yapıldığında geri alınmasına izin veren düğmeler sağlanmıştır. RPI'da depolanan bilgileri değiştiren diğer düğmelere basılamıyorsa, sistemin Salt Okunur durumunu kontrol edin.

source: Status of the network connection to the rPI
fr_ca: État de la connexion réseau au rPI
tr_tr: RPI'ye ağ bağlantısının durumu

source: There is a label in the top right corner of the console that indicates if the rPi is currently connected. It will change from Connected to Disconnected if there is no longer a network connection to the rPi.
fr_ca: Il y a une icône dans le coin supérieur droit de la console qui indique si le rPi est actuellement connecté. Il passera de Connected à Disconnected s'il n'y a plus de connexion réseau au rPi.
tr_tr: Konsolun sağ üst köşesinde, rPi'nin şu anda bağlı olup olmadığını gösteren bir etiket vardır. Artık rPi'ye ağ bağlantısı yoksa, Bağlı'dan Bağlantı Kesildi'ye değişecektir.

source: System status
fr_ca: État du système
tr_tr: Sistem durumu

source: The system status shows what the CPU on the rPI is doing at any time. There are two columns of status values, on being a 1 second average and the other a 5 second average. Shown is:
fr_ca: L'état du système indique à tout moment ce que fait le CPU sur le rPI. Il y a deux colonnes de valeurs d'état, soit une tabulée à chaque seconde et l'autre tabulée sur une durée de 5 secondes. Voici ce qui est affiché:
tr_tr: Sistem durumu, rPI üzerindeki CPU'nun herhangi bir zamanda ne yaptığını gösterir. 1 saniyelik ortalama ve diğeri 5 saniyelik ortalama olmak üzere iki durum değerleri sütunu vardır. Gösterilen:

source: free and available RAM on the PI
tr_tr: PI'da ücretsiz ve kullanılabilir RAM

source: CPU usage for user processes and system processes as well as idle time.
tr_tr: Kullanıcı işlemleri ve sistem işlemleri için CPU kullanımı ve boşta kalma süresi.

source: And network bandwidth - which allows one to determine if the used camera bandwidth is exceeding the maximum bandwidth allowed in the robot rules for any year.
tr_tr: Ve ağ bant genişliği - kullanılan kamera bant genişliğinin herhangi bir yıl için robot kurallarında izin verilen maksimum bant genişliğini aşıp aşmadığını belirlemenize olanak tanır.

source: Vision Status
fr_ca: État de la vision
tr_tr: Vizyon Durumu

source: Network Settings
fr_ca: Paramètres réseau
tr_tr: Ağ ayarları

source: The rPI network settings have options to connect to the PI:
fr_ca: Les paramètres réseau rPI ont des options pour se connecter au PI:
tr_tr: RPI ağ ayarlarının PI'ya bağlanma seçenekleri vardır:

source: DHCP - the default name resolution usually used by the roboRIO. The default name is wpilibpi.local.
tr_tr: DHCP - genellikle roboRIO tarafından kullanılan varsayılan ad çözümlemesi. Varsayılan ad wpilibpi.local şeklindedir.

source: Static - where a fixed IP address, network mask, and router settings are filled in explicitly
fr_ca: Static - où une adresse IP fixe, un masque de réseau et des paramètres de routeur sont définis de façon explicite.
tr_tr: Statik - sabit bir IP adresi, ağ maskesi ve yönlendirici ayarlarının açıkça doldurulduğu yer

source: DHCP with Static Fallback - DHCP with Static Fallback - the PI will try to get an IP address via DHCP, but if it can't find a DHCP server, it will use the provided static IP address and parameters
fr_ca: DHCP with Static Fallback - le PI essaiera d'obtenir une adresse IP via DHCP, mais s'il ne trouve pas de serveur DHCP, il utilisera l'adresse IP statique et les paramètres fournis
tr_tr: Statik Geri Dönüşlü DHCP - Statik Geri Dönüşlü DHCP - PI, DHCP aracılığıyla bir IP adresi almaya çalışır, ancak bir DHCP sunucusu bulamazsa, sağlanan statik IP adresini ve parametreleri kullanır.

source: The picture above is showing the settings for both DHCP and Static IP Addressing. The mDNS name for the rPi should always work regardless of the options selected above.
fr_ca: L'image ci-dessus montre les paramètres pour DHCP et l'adressage IP statique. Le nom mDNS du rPi doit toujours fonctionner quelles que soient les options sélectionnées ci-dessus.
tr_tr: Yukarıdaki resim hem DHCP hem de Statik IP Adresleme için ayarları göstermektedir. RPi için mDNS adı, yukarıda seçilen seçeneklerden bağımsız olarak her zaman çalışmalıdır.

source: Vision Settings
fr_ca: Paramètres pour la vision
tr_tr: Görme Ayarları

source: The Vision Settings are to set the parameters for each camera and whether the rPI should be a NetworkTables client or server. There can only be one server on the network and the roboRIO is always a server. Therefor when connected to a roboRIO, the rPI should always be in client mode with the team number filled in. If testing on a desktop setup with no roboRIO or anything acting as a server then it should be set to Server (Client switch is off).
tr_tr: Görüş Ayarları, her kamera için parametreleri ve rPI'nın bir NetworkTables istemcisi mi yoksa sunucusu mu olması gerektiğini ayarlamak içindir. Ağda yalnızca bir sunucu olabilir ve roboRIO her zaman bir sunucudur. Bu nedenle, bir roboRIO'ya bağlandığında, rPI her zaman müşteri modunda olmalı ve ekip numarası doldurulmalıdır. RoboRIO'suz veya sunucu olarak işlev gören bir masaüstü kurulumunda test yapıyorsanız, Sunucu olarak ayarlanmalıdır (İstemci anahtarı kapalı) .

source: To view and manipulate all the camera settings click on the camera in question. In this case the camera is called "Camera rPi Camera 0" and clicking on the name reveals the current camera view and the associated settings.
fr_ca: Pour afficher et manipuler tous les paramètres de la caméra, cliquez sur la caméra en question. Dans ce cas, la caméra est appelée "Camera rPi Camera 0" et en cliquant sur le nom, le panorama vu par la caméra et ses paramètres associés sont affichés.
tr_tr: Tüm kamera ayarlarını görüntülemek ve değiştirmek için söz konusu kameraya tıklayın. Bu durumda, kamera "Camera rPi Camera 0" olarak adlandırılır ve ada tıklamak, mevcut kamera görünümünü ve ilgili ayarları ortaya çıkarır.

source: Manipulating the camera settings is reflected in the current camera view. The bottom of the page shows all the possible camera modes (combinations of Width, Height, and frame rates) that are supported by this camera.
fr_ca: La prise de vue de la caméra réflète la manipulation de ses paramètres. Le bas de la page affiche tous les modes de caméra possibles (combinaisons de largeur, hauteur et le taux de rafraichissement des images (frame rate)) pris en charge par cette caméra.
tr_tr: Kamera ayarlarının değiştirilmesi mevcut kamera görünümüne yansıtılır. Sayfanın alt kısmında bu kamera tarafından desteklenen tüm olası kamera modları (Genişlik, Yükseklik ve kare hızlarının kombinasyonları) gösterilmektedir.

source: If the camera image is not visible on the :guilabel:`Open Stream` screen then check the supported video modes at the bottom of the page. Then go back to 'Vision Settings' and click on the camera in question and verify that the pixel format, width, height, and FPS are listed in the supported video modes.
fr_ca: Si l’image de la caméra n’est pas visible sur l’écran :guilabel:`Open Stream`, vérifiez les modes vidéo pris en charge au bas de la page. Revenez ensuite aux paramètres 'Vision Settings' et cliquez sur la caméra en question et vérifiez que les paramètres format pixel, la largeur (width), la hauteur (height) et la fréquence de rafraîchissement de l'image (FPS) sont répertoriés dans les modes vidéo pris en charge.
tr_tr: Kamera görüntüsü :guilabel:`Open Stream` ekranında görünmüyorsa, sayfanın altındaki desteklenen video modlarını kontrol edin. Ardından 'Vision Settings' e geri dönün ve söz konusu kameraya tıklayın ve piksel formatı, genişlik, yükseklik ve FPS'nin desteklenen video modlarında listelendiğini doğrulayın.

source: Getting the current settings to persist over reboots
fr_ca: Obtention des paramètres actuels pour qu'ils persistent lors des redémarrages
tr_tr: Yeniden başlatmalarda devam etmek için mevcut ayarları alma

source: The rPi will load all the camera settings on startup. Editing the camera configuration in the above screen is temporary. To make the values persist click on the "Load Source Config From Camera" button and the current settings will be filled in on the camera settings fields. Then click "Save" at the bottom of the page. Note: you must set the file system Writeable in order to save the settings. *The Writeable button is at the top of the page.*
fr_ca: Le rPi chargera tous les paramètres de la caméra au démarrage. La modification de la configuration de la caméra dans l'écran ci-dessus est temporaire. Pour que les valeurs persistent, cliquez sur le bouton "Load Source Config From Camera" et les paramètres actuels seront chargés dans les champs des paramètres de la caméra. Cliquez ensuite sur "Save" en bas de la page. Remarque: vous devez définir le système de fichiers accessible en écriture (Writeable) pour enregistrer les paramètres. *Le bouton Writeable est en haut de la page.*
tr_tr: RPi, başlangıçta tüm kamera ayarlarını yükleyecektir. Yukarıdaki ekranda kamera yapılandırmasının düzenlenmesi geçicidir. Değerlerin kalıcı olmasını sağlamak için "Load Source Config From Camera-Kameradan Kaynak Yapılandırmasını Yükle" düğmesine tıklayın ve mevcut ayarlar kamera ayarları alanlarına girilecektir. Ardından sayfanın altındaki "Kaydet" i tıklayın. Not: Ayarları kaydetmek için Yazılabilir dosya sistemini ayarlamalısınız. * Yazılabilir düğmesi sayfanın en üstündedir. *

source: There are some commonly used camera settings values shown in the camera settings (above). These values Brightness, White Balance, and Exposure are loaded into the camera before the user JSON file is applied. So if a user JSON file contains those settings they will overwrite the ones from the text field.
fr_ca: Certaines valeurs de paramètres de caméra couramment utilisées sont indiquées dans les réglages (ci-dessus). Ces valeurs de luminosité, de balance des blancs et d'exposition sont chargées dans la caméra en premier, avant l'application du fichier utilisateur JSON. Donc, si un fichier utilisateur JSON contient aussi ces paramètres, ils viendront remplacer ceux définis auparavent.
tr_tr: Kamera ayarlarında (yukarıda) gösterilen yaygın olarak kullanılan bazı kamera ayarları değerleri vardır. Bu değerler Parlaklık, Beyaz Dengesi ve Pozlama, kullanıcı JSON dosyası uygulanmadan önce kameraya yüklenir. Dolayısıyla, bir kullanıcı JSON dosyası bu ayarları içeriyorsa, metin alanındakilerin üzerine yazacaktır.

source: Application
tr_tr: Uygulama

source: The Application tab shows the application that is currently running on the rPi.
fr_ca: L'onglet Application affiche l'application en cours d'exécution sur le rPi.
tr_tr: Uygulama sekmesi şu anda rPi'de çalışan uygulamayı gösterir.

source: Vision workflows
fr_ca: Implémentation des tâches pour la vision
tr_tr: Vision iş akışları

source: There is a sample vision program using OpenCV in each of the supported languages, C++, Java, or Python. Each sample program can capture and stream video from the rPi. In addition, the samples have some minimal OpenCV. They are all set up to be extended to replace the provided OpenCV sample code with the code needed for the robot application. The rPi Application tab supports a number of programming workflows:
fr_ca: Il existe un exemple de programme de vision utilisant OpenCV dans chacun des langages supportés, C++, Java ou Python. Chaque exemple de programme peut capturer et diffuser des vidéos à partir du rPi. De plus, les exemples ont quelques commandes OpenCV. Ils sont tous configurés pour être redéployé avec un code OpenCV amélioré par l'utilisateur et conforme à l'application du robot. L'onglet Application rPi prend en charge un certain nombre d'algorithmes de programmation:
tr_tr: Desteklenen dillerin her birinde, C ++, Java veya Python'da OpenCV kullanan örnek bir görme programı vardır. Her örnek program rPi'den video yakalayabilir ve yayınlayabilir. Ek olarak, örneklerde minimum düzeyde OpenCV bulunur. Bunların tümü, sağlanan OpenCV örnek kodunu robot uygulaması için gereken kodla değiştirmek üzere genişletilecek şekilde ayarlanmıştır. RPi Uygulaması sekmesi bir dizi programlama iş akışını destekler:

source: Stream one or more cameras from the rPi for consumption on the driver station computer and displayed using ShuffleBoard
fr_ca: Diffusez une ou plusieurs caméras à partir du rPi vers l'ordinateur du poste de conduite et les afficher à l'aide de ShuffleBoard
tr_tr: Sürücü istasyonu bilgisayarında tüketilmek üzere rPi'den bir veya daha fazla kamerayı yayınlayın ve ShuffleBoard kullanılarak görüntülenir

source: Edit and build one of the sample programs (one for each language: Java, C++ or Python) on the rPi using the included toolchains
fr_ca: Modifiez et créez l'un des exemples de programmes (un pour chaque langage: Java, C++ ou Python) sur le rPi en utilisant la chaîne d'outils fournie (éditeur, compilateur...)
tr_tr: Dahil edilen araç zincirlerini kullanarak rPi'de örnek programlardan birini (her dil için bir tane: Java, C ++ veya Python) düzenleyin ve oluşturun

source: Download a sample program for the chosen language and edit and build it on your development computer. Then upload that built program back to the rPi
fr_ca: Téléchargez un exemple source de programme (Java, C++ ou Python) et modifiez-le. Ensuite, compilez-le en vous servant de votre ordinateur de développement. Ensuite, téléchargez le fichier objet de ce programme sur le rPi
tr_tr: Seçilen dil için örnek bir program indirin ve onu geliştirme bilgisayarınızda düzenleyin ve oluşturun. Ardından bu yerleşik programı rPi'ye geri yükleyin

source: Do everything yourself using completely custom applications and scripts (probably based on one of the samples)
fr_ca: Concevez vos propres applications et scripts (en utilisant un ou plusieurs des exemples fournis comme référence)
tr_tr: Tamamen özel uygulamalar ve komut dosyaları kullanarak her şeyi kendiniz yapın (muhtemelen örneklerden birine göre)

source: The running application can be changed by selecting one of the choices in the drop-down menu. The choices are:
fr_ca: L'application en cours d'exécution peut être modifiée en sélectionnant l'un des choix dans le menu. Les choix sont:
tr_tr: Çalışan uygulama, açılır menüdeki seçeneklerden biri seçilerek değiştirilebilir. Seçenekler şunlardır:

source: Built-in multi camera streaming which steams whatever cameras are plugged into the rPi. The camera configuration including number of cameras can be set on the "Vision Settings" tab.
tr_tr: RPi'ye hangi kameralar takılı olursa olsun buharlaşan dahili çoklu kamera akışı. Kamera sayısını içeren kamera yapılandırması "Vision Settings-Görme Ayarları" sekmesinden ayarlanabilir.

source: Custom application which doesn't upload anything to the rPi and assumes that the developer wants to have a custom program and script.
fr_ca: Custom Application qui ne télécharge rien sur le rPi et suppose que le programmeur souhaite avoir un code et un script personnalisés.
tr_tr: RPi'ye hiçbir şey yüklemeyen ve geliştiricinin özel bir program ve komut dosyasına sahip olmak istediğini varsayan özel uygulama.

source: Java, C++ or Python pre-installed sample programs that can be edited into your own application.
fr_ca: Exemples de programmes préinstallés Java, C++ ou Python pouvant être modifiés dans votre propre application.
tr_tr: Kendi uygulamanıza düzenlenebilen önceden yüklenmiş Java, C ++ veya Python örnek programlar.

source: Java, C++, or Python uploaded program. Java programs require a ``.jar`` file with the compiled program and C++ programs require an rPi executable to be uploaded to the rPI.
fr_ca: Programme téléversé Java, C++ ou Python. Les programmes Java nécessitent un fichier ``.jar`` avec le programme compilé et les programmes C++ nécessitent un exécutable rPi pour être téléversé sur le rPI.
tr_tr: Java, C ++ veya Python yüklenmiş program. Java programları, derlenen programla birlikte bir ".jar '' dosyası gerektirir ve C ++ programları, rPI'nin rPI'ye yüklenmesini gerektirir.

source: When selecting one of the Upload options, a file chooser is presented where the jar, executable or Python program can be selected and uploaded to the rPi. In the following picture an Uploaded Java jar is chosen and the "Choose File" button will select a file and clicking on the "Save" button will upload the selected file.
tr_tr: Yükleme seçeneklerinden birini seçerken, jar, yürütülebilir veya Python programının seçilebildiği ve rPi'ye yüklenebildiği bir dosya seçici sunulur. Aşağıdaki resimde Yüklenmiş bir Java kavanozu seçilmiştir ve "Choose File-Dosya Seç" düğmesi bir dosya seçecek ve "Save-Kaydet" düğmesine tıklamak seçilen dosyayı yükleyecektir.

source: Note: in order to Save a new file onto the rPi, the file system has to be set writeable using the "Writable" button at the top left of the web page. After saving the new file, set the file system back to "Read-Only" so that it is protected against accidental changes.
fr_ca: Remarque: pour enregistrer un nouveau fichier sur le rPi, le système de fichiers doit être paramétrable en écriture à l'aide du bouton "Writable" en haut à gauche de la page Web. Après avoir enregistré le nouveau fichier, redéfinissez le système de fichiers sur "Read-Only" afin qu'il soit protégé contre les modifications accidentelles.
tr_tr: Not: rPi'ye yeni bir dosya kaydetmek için, dosya sistemi web sayfasının sol üst köşesindeki "Writable-Yazılabilir" düğmesi kullanılarak yazılabilir olarak ayarlanmalıdır. Yeni dosyayı kaydettikten sonra, yanlışlıkla değişikliklere karşı korunması için dosya sistemini tekrar "Read-Only-Salt Okunur" olarak ayarlayın.

source: Allows monitoring of the task which is running the camera code in the rPI, either one of the default programs or your own program in Java, C++, or Python. You can also enable and view the console output to see messages coming from the background camera service. In this case there are number of messages about being unable to connect to :term:`NetworkTables` (NT: connect()) because in this example the rPI is simply connected to a laptop with no NetworkTables server running (usually the roboRIO.)
fr_ca: Permet de surveiller la tâche qui exécute le code de la caméra dans le rPI, soit l'un des programmes par défaut, soit votre propre programme en Java, C ++ ou Python. Vous pouvez également activer et afficher la sortie de la console pour voir les messages provenant du service de caméra d'arrière-plan. Dans ce cas, il y a un certain nombre de messages sur l'impossibilité de se connecter aux :term:`NetworkTables` (NT: connect ()) car dans cet exemple, le rPI est simplement connecté à un ordinateur portable sans serveur NetworkTables en cours d'exécution (généralement le roboRIO.)
