Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/wpilibpi/using-the-raspberry-pi-for-frc.po
Languages: es_mx, tr_tr, zh_cn

source: Using the Raspberry Pi for FRC
es_mx: Uso de Raspberry Pi para FRC
tr_tr: Raspberry Pi'yi FRC için kullanma
zh_cn: 在FRC中运用树莓派

source: One of the most popular coprocessor choices is the Raspberry Pi because:
es_mx: Una de las opciones de coprocesador más populares es la Raspberry Pi porque:
tr_tr: En popüler yardımcı işlemci seçeneklerinden biri Raspberry Pi'dir çünkü:
zh_cn: 树苺派是最受欢迎的协同处理器之一，因为：

source: Low cost - around $35
es_mx: Bajo costo- alrededor de $ 35
tr_tr: Düşük maliyet - yaklaşık 35 ABD doları
zh_cn: 低成本：只需要35 USD左右

source: High availability - it's easy to find Raspberry Pis from a number of suppliers, including Amazon
es_mx: Alta disponibilidad: es fácil encontrar Raspberry Pis de varios proveedores, incluidos Amazon
tr_tr: Yüksek kullanılabilirlik - Raspberry Pis'i Amazon dahil birçok tedarikçiden bulmak kolaydır
zh_cn: 非常高的可用性：我们可以从很多不同的供应商中看到树苺派，包括亚马逊

source: Very good performance - the current Raspberry Pi 3b+ has the following specifications:
es_mx: Muy buen rendimiento -el Raspberry Pi 3b + actual tiene las siguientes especificaciones:
tr_tr: Çok iyi performans - mevcut Raspberry Pi 3b + aşağıdaki özelliklere sahiptir:
zh_cn: 非常好的性能：现在，Raspberry Pi 3b+有如下的性能参数：

source: Technical Specifications: - Broadcom BCM2837BO 64 bit ARMv8 QUAD Core A53 64bit Processor powered Single Board Computer run at 1.4GHz - 1GB RAM - BCM43143 WiFi on board - Bluetooth Low Energy (BLE) on board - 40 pin extended GPIO - 4 x USB2 ports - 4 pole Stereo output and Composite video port - Full size HDMI - CSI camera port for connecting the Raspberry - Pi camera - DSI display port for connecting the Raspberry - Pi touch screen display - MicroSD port for loading your operating system and storing data - Upgraded switched Micro USB power source (now supports up to 2.5 Amps.
es_mx: Especificaciones técnicas: - Broadcom BCM2837BO 64 bit ARMv8 QUAD Core A53 64bit Procesador alimentado por una sola placa computora que funciona a 1,4 GHz - 1 GB de RAM - BCM43143 WiFi a bordo - Bluetooth Low Energy (BLE) a bordo - GPIO extendido de 40 pines - 4 x puertos USB2 - Salida estéreo de 4 polos y puerto de video compuesto - HDMI de tamaño completo - Puerto de cámara CSI para Conexión de la Raspberry - Cámara Pi - Puerto de pantalla DSI para conectar la Raspberry - Pantalla táctil Pi - Puerto MicroSD para cargar su sistema operativo y almacenar datos: fuente de alimentación micro USB conmutada actualizada (ahora admite hasta 2.5 amperios.
tr_tr: Teknik Özellikler: - Broadcom BCM2837BO 64 bit ARMv8 QUAD Core A53 64bit İşlemciden güç alan, 1.4GHz'de çalışan Tek Kartlı Bilgisayar - 1GB RAM - BCM43143 Dahili WiFi - Dahili Bluetooth Düşük Enerji (BLE) - 40 pin genişletilmiş GPIO - 4 x USB2 bağlantı noktası - 4 kutuplu Stereo çıkış ve Kompozit video bağlantı noktası - Tam boyutlu HDMI - Rasberry bağlamak için CSI kamera bağlantı noktası - Pi kamera - Raspberry bağlamak için DSI ekran bağlantı noktası - Pi dokunmatik ekran görüntüsü - İşletim sisteminizi yüklemek ve verileri depolamak için MicroSD bağlantı noktası - Yükseltilmiş anahtarlı Mikro USB güç kaynağı (artık 2,5 Ampere kadar desteklemektedir.
zh_cn: 博通BCM2837BO 64位ARMv8四核A53处理器的64位驱动单板计算机运行 主频为1.4GHz 板载BCM43143无线网络板载蓝牙低功耗(BLE） 1GB内存40引脚扩展GPIO 4×USB2接口 4极立体声输出和复合视频端口全尺寸HDMI CSI摄像头端口用于连接树苺 PI摄像头 DSI显示端口用于连接树苺 PI 触 屏 显 示 器 MicroSD卡槽用于加载操作系统以及储存文件 升级切换微型USB电源(现在支持高达2.5安培）

source: Pre-built Raspberry Pi image
es_mx: Imagen de Raspberry Pi preconstruida
tr_tr: Önceden oluşturulmuş Raspberry Pi görüntüsü
zh_cn: 预先建⽴立树莓派图形库

source: To make using the Raspberry Pi as easy as possible for teams, there is a provided Raspberry Pi image. The image can be copied to a micro SD card, inserted into the Pi, and booted. By default it supports:
es_mx: Para hacer que el uso de la Raspberry Pi sea lo más fácil posible para los equipos, se proporciona una Raspberry Pi imagen. La imagen puede copiarse en una tarjeta micro SD, insertarse en el Pi y arrancarse. Por defecto admite:
tr_tr: Raspberry Pi'yi ekipler için olabildiğince kolaylaştırmak için sağlanan bir Raspberry Pi görüntüsü vardır. Görüntü bir mikro SD karta kopyalanabilir, Pi'ye takılabilir ve önyüklenebilir. Varsayılan olarak şunları destekler:
zh_cn: 为了确保树苺派对于队伍而言是非常简单的，在这里我们提供了树苺派的图形库。其可以被拷贝到一张MicroSD卡上，插入树苺派，然后启动。在默认情况下，它支持：

source: A web interface for configuring it for the most common functions
es_mx: Una configuración de interfaz web para las funciones más comunes
tr_tr: Bir web arayüzü en yaygın işlevleri yapılandırmak için
zh_cn: 一个网络界面来进行一些瞎础功能的配置

source: Supports an arbitrary number camera streams (defaults to one) that are published on the network interface
es_mx: Admite un número arbitrario de transmisiones de cámara (el valor predeterminado es uno) que se publican en la interfaz de red
tr_tr: Ağ arayüzünde yayınlanan rastgele sayıda kamera akışını (varsayılan olarak birdir) destekler
zh_cn: 支持在网络接口上设置任意个数摄像头的视屏流(默认情况下是一个）

source: OpenCV, :term:`NetworkTables`, Camera Server, and language libraries for C++, Java, and Python custom programs
es_mx: OpenCV, :term:`NetworkTables`, Camera Server y bibliotecas de lenguaje para programas personalizados en C++, Java y Python
zh_cn: OpenCV，Network Tables(网络表），Camera Server(摄像头服务器），以及c++， Java和Python自定义程序的语言库

source: If the only requirement is to stream one or more cameras to the network (and dashboard) then no programming is required and can be completely set up through the web interface.
es_mx: Si el único requisito es transmitir una o más cámaras a la red (y al dashboard) entonces no se requiere programación y se puede configurar completamente a través de la interfaz web.
tr_tr: Tek gereksinim ağa (ve kontrol paneline) bir veya daha fazla kamerayı yayınlamaksa, o zaman programlama gerekmez ve web arayüzü üzerinden tamamen kurulabilir.
zh_cn: 如果只是想将一个或者多个摄像头的视屏流上传到网络（或者仪表盘）的话，是不需要任何编程的，只需要在网络界面进行配置就可以了。

source: The next section discusses how to install the image onto a flash card and boot the Pi.
es_mx: La siguiente sección analiza cómo instalar la imagen en una tarjeta flash y arrancar la Pi.
tr_tr: Bir sonraki bölümde görüntünün bir flash karta nasıl yükleneceği ve Pi'nin nasıl başlatılacağı anlatılmaktadır.
zh_cn: 下一节讨论如何将映像安装到闪存卡上并启动Pi。
