Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/wpilibpi/using-a-coprocessor-for-vision-processing.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Using a Coprocessor for vision processing
es_mx: Uso de un coprocesador para el procesamiento de la visión
fr_ca: Utilisation d'un coprocesseur pour le traitement de la vision
tr_tr: Görme işleme için bir Yardımcı İşlemci kullanma
zh_cn: 使用协同处理器的视觉处理

source: Vision processing using libraries like OpenCV for recognizing field targets or game pieces can often be a CPU intensive process. Often the load isn't too significant and the processing can easily be handled by the roboRIO. In cases where there are more camera streams or the image processing is complex, it is desirable to off-load the roboRIO by putting the code and the camera connection on a different processor. There are a number of choices of processors that are popular in FRC\ |reg| such as the Raspberry PI, the intel-based Kangaroo, the LimeLight for the ultimate in simplicity, or for more complex vision code a graphics accelerator such as one of the nVidia Jetson models.
es_mx: El procesamiento de Visión utilizando librerías como OpenCV para reconocer objetivos de campo o piezas de juego a menudo puede ser un proceso intensivo de CPU. A menudo la carga no es demasiado significativa y el procesamiento puede ser manejado fácilmente por la roboRIO. En casos donde hay más transmisiones de cámara o el procesamiento de imágenes es complejo, es deseable quitar la roboRIO colocando el código y la conexión de la cámara en un procesador diferente. Hay varias opciones de procesadores que son populares en FRC\ |reg| como el Raspberry PI, el Kangaroo basado en inteligencia, la LimeLight para lo último en simplicidad, o para un código de visión más complejo, un acelerador de gráficos como uno de los modelos nVidia Jetson.
fr_ca: Le traitement de la vision à l'aide de bibliothèques comme OpenCV pour reconnaître des cibles de terrain ou des pièces de jeu peut souvent être un processus gourmand en ressources processeur. Souvent, la charge n'est pas trop importante et le traitement peut être facilement géré par le roboRIO. Dans les cas où il y a plus de flux de caméra ou où le traitement de l'image est complexe, il est souhaitable de décharger le roboRIO en plaçant le code et la connexion de la caméra sur un processeur différent. Il existe un certain nombre de choix de processeurs qui sont populaires dans FRC\ |reg| comme le Raspberry PI, le Kangaroo basé sur Intel, le LimeLight pour le summum de la simplicité, ou pour le code de vision plus complexe un accélérateur graphique tel que l'un des modèles nVidia Jetson.
tr_tr: Saha hedeflerini veya oyun parçalarını tanımak için OpenCV gibi kitaplıkları kullanan vision processing-görüntü işleme, genellikle CPU yoğun bir işlem olabilir. Çoğu zaman yük çok önemli değildir ve işlem roboRIO tarafından kolayca halledilebilir. Daha fazla kamera akışının olduğu veya görüntü işlemenin karmaşık olduğu durumlarda, kodu ve kamera bağlantısını farklı bir işlemciye koyarak roboRIO'nun yükünü boşaltmak istenir. FRC \ |reg| içinde popüler olan bir dizi işlemci seçeneği vardır. Raspberry PI, Intel tabanlı Kangaroo, en üst düzeyde basitlik için LimeLight veya daha karmaşık görüntü kodları için nVidia Jetson modellerinden biri gibi bir grafik hızlandırıcı gibi.
zh_cn: 使用诸如OpenCV之类的库进行视觉处理来识别目标或游戏作品通常会占用大量CPU资源。通常，负载并不是太重要，而且roboRIO可以轻松处理该处理。在摄像机流更多或图像处理复杂的情况下，最好通过将代码和摄像机连接放在不同的处理器上来卸载roboRIO。在FRC \ | reg |中有很多种处理器可供选择。例如Raspberry PI，基于Intel的袋鼠，LimeLight，以实现极致的简洁性，或者为更复杂的视觉代码提供图形加速器，例如nVidia Jetson型号之一。

source: Strategy
es_mx: Estrategia
fr_ca: Stratégie
tr_tr: Strateji
zh_cn: 策略

source: Generally the idea is to set up the coprocessor with the required software that generally includes:
es_mx: En general, la idea es configurar el coprocesador con el software requerido que generalmente incluye:
fr_ca: Généralement, l'idée est de configurer le coprocesseur avec le logiciel requis qui comprend généralement:
tr_tr: Genel olarak fikir, yardımcı işlemciyi genel olarak aşağıdakileri içeren gerekli yazılımla kurmaktır:
zh_cn: 我们需要一款对应的软件来设置我们的协同处理器，一般包括有：

source: OpenCV - the open source computer vision library
es_mx: OpenCV- la biblioteca de visión por computadora de código abierto
fr_ca: OpenCV - la librairie de vision par ordinateur
tr_tr: OpenCV - açık kaynak bilgisayar görme kitaplığı
zh_cn: OpenCV - 一个开源的计算机视觉库

source: :term:`NetworkTables` - to commute the results of the image processing to the roboRIO program
fr_ca: :term:`NetworkTables` - pour commuter les résultats du traitement d'image vers le programme roboRIO
zh_cn: 术语: Network tables（网络表） - 用于将图像处理的结果传输到RoboRIO的程序里

source: Camera server library - to handle the camera connections and publish streams that can be viewed on a dashboard
es_mx: Librería del Camera Sever- para manejar las conexiones de la cámara y publicar secuencias que pueden ser vistas en un dashboard
fr_ca: Bibliothèque de serveurs de caméras - pour gérer les connexions de caméras et publier des flux pouvant être affichés sur un tableau de bord
tr_tr: Kamera sunucusu kitaplığı - kamera bağlantılarını yönetmek ve bir panoda görüntülenebilen akışları yayınlamak için
zh_cn: Camera server library（摄像头服务器库） - 用于摄像头的连接与传输视频流以确保在控制面板上能看到视频

source: The language library for whatever computer language is used for the vision program
es_mx: La librería de idiomas para cualquier lenguaje de computadora utilizado para el programa de visión.
fr_ca: Les librairies associés au langage informatique utilisé pour le programme de vision
tr_tr: Görme programı için kullanılan bilgisayar dili için dil kitaplığı
zh_cn: 语言库（对应视觉程序的编程语言）

source: The actual vision program that does the object detection
es_mx: El programa de visión real que hace la detección de objetos.
fr_ca: Le programme spécifique de vision qui fait la détection d'objet
tr_tr: Nesne algılamayı gerçekleştiren gerçek görüş programı
zh_cn: 你的程序（能探测到物体的那种）

source: The coprocessor is connected to the roboRIO network by plugging it into the extra ethernet port on the network router or, for more connections, adding a small network switch to the robot. The cameras are plugged into the coprocessor, it acquires the images, processes them, and publishes the results, usually target location information, to NetworkTables so it is can be consumed by the robot program for steering and aiming.
fr_ca: Le coprocesseur est connecté au réseau roboRIO en le branchant sur le port Ethernet supplémentaire du routeur réseau ou, pour plus de connexions, en ajoutant un petit commutateur réseau (Switch) au robot. Les caméras sont connectées au coprocesseur, il acquiert les images, les traite et publie les résultats, généralement des informations de localisation de la cible, sur NetworkTables afin qu'elles puissent être utilisées par le programme du robot pour la direction et la visée.
zh_cn: 将协同处理器连接到RoboRIO的办法有两种。一，将协同处理器通过额外的以太网接口与路由器相连；二，若是要连接更多设备的话，可以在机器上添加一个小型的网络交换机。摄像头插入协同处理器后会获取图像、处理图像，最终将结果（通常是目标的地点信息）通过Network tables（网络表）传输到机器以便瞄准与控制方向。

source: Network diagram with the coprocessor and roboRIO on the same network.
fr_ca: Diagramme de réseau avec le coprocesseur et le roboRIO sur le même réseau.
zh_cn: 协处理器和 roboRIO 在同一网络上的网络图。

source: Streaming camera data to the dashboard
es_mx: Transmitir datos de la cámara al dashboard
fr_ca: Diffuser des données de la caméra vers le tableau de bord
tr_tr: Kamera verilerinin kontrol paneline aktarılması
zh_cn: 将视频流传输至控制面板

source: It is often desirable to simply stream the camera data to the dashboard over the robot network. In this case one or more camera connections can be sent to the network and viewed on a dashboard such as Shuffleboard or a web browser. Using Shuffleboard has the advantage of having easy controls to set the camera resolution and bit rate as well as integrating the camera streams with other data sent from the robot.
es_mx: A menudo es deseable simplemente transmitir los datos de la cámara al dashboard a través de la red del robot. En este caso, se pueden enviar una o más conexiones de cámara a la red y verlas en un dashboard de instrumentos como Shuffleboard o un navegador web. Usar Shuffleboard tiene la ventaja de tener controles sencillos para establecer la resolución de la cámara y la velocidad de bits, así como integrar las transmisiones de la cámara con otros datos enviados desde el robot.
fr_ca: Il est souvent souhaitable de simplement diffuser les données de la caméra sur le tableau de bord via le réseau du robot. Dans ce cas, une ou plusieurs connexions de caméra peuvent être envoyées au réseau et affichées sur un tableau de bord tel que Shuffleboard ou un navigateur Web. L'utilisation de Shuffleboard donne l'avantage d'avoir accès à des commandes faciles pour régler la résolution de la caméra et le débit binaire ainsi que d'intégrer les flux de caméra avec d'autres données envoyées par le robot.
tr_tr: Genellikle, kamera verilerinin robot ağı üzerinden kontrol paneline basitçe aktarılması arzu edilir. Bu durumda, bir veya daha fazla kamera bağlantısı ağa gönderilebilir ve Shuffleboard veya web tarayıcısı gibi bir kontrol panelinde görüntülenebilir. Shuffleboard'u kullanmak, kamera çözünürlüğünü ve bit hızını ayarlamak için kolay kontrollere sahip olmanın yanı sıra kamera akışlarını robottan gönderilen diğer verilerle entegre etme avantajına sahiptir.
zh_cn: 我们通常会简单地将摄像头的数据直接通过机器人的网络传到控制面板。使用以上方法，我们可以将一个或多个视频流传输到网络并且通过例如Shuffleboard或网页浏览器在控制面板上显示。使用Shuffleboard的好处有几点：1、便于调整摄像头的分辨率；2、便于调整摄像头的比特率；3、可以将视频流与其他数据一起传输给机器人。

source: It is also possible to process images and add annotation to the image, such as target lines or boxes showing what the image processing code has detected then send it forward to the dashboard to make it easier for operators to see a clear picture of what's around the robot.
es_mx: También es posible procesar imágenes y agregar anotaciones a la imagen, como líneas de destino o cuadros que muestran lo que ha detectado el código de procesamiento de imagen y luego enviarlo al dashboard para que sea más fácil para los operadores ver una imagen clara de lo que hay alrededor del robot.
fr_ca: Il est également possible de traiter des images et d'ajouter des annotations à l'image, telles que des lignes ou des boîtes cibles montrant ce que le code de traitement d'image a détecté, puis de l'envoyer vers le tableau de bord pour permettre aux opérateurs de voir plus clairement ce qui se trouve autour du robot.
tr_tr: Ayrıca görüntüleri işlemek ve görüntüye açıklama eklemek, örneğin görüntü işleme kodunun algıladıklarını gösteren hedef satırlar veya kutular gibi ek açıklama eklemek ve ardından operatörlerin etrafındakilerin net bir resmini görmesini kolaylaştırmak için gösterge panosuna iletmek de mümkündür. robot.
zh_cn: 同时，我们也可以在处理图像时添加注释并传输到控制面板，例如目标的线或是盒子，如此以便于操控手们看清机器人周围的情况。
