Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/wpilibpi/working-with-contours.po
Languages: fr_ca, tr_tr, zh_cn

source: Working with Contours
fr_ca: Traitements des contours
tr_tr: Konturlarla Çalışma
zh_cn: 使用轮廓

source: After thresholding and removing noise with morphological operations, you are now ready to use OpenCV's ``findContours`` method. This method allows you to generate contours based on your binary image.
fr_ca: Après avoir défini le seuil et éliminé le bruit avec des opérations morphologiques, vous êtes maintenant prêt à utiliser la méthode ``findContours`` d'OpenCV. Cette méthode vous permet de générer des contours en fonction de votre image binaire.
tr_tr: Morfolojik işlemlerle gürültüyü eşikledikten ve kaldırdıktan sonra, artık OpenCV'nin ``findContours`` yöntemini kullanmaya hazırsınız. Bu yöntem, ikili görüntünüze göre konturlar oluşturmanıza olanak tanır.
zh_cn: 在使用形态学操作对阈值进行处理并消除了噪声之后，您现在就可以使用OpenCV的“ findContours”方法了。此方法使您可以根据二进制图像生成轮廓。

source: Finding and Filtering Contours
fr_ca: Recherche et filtrage des contours
tr_tr: Konturları Bulma ve Filtreleme
zh_cn: 查找和过滤轮廓

source: In cases where there is only one vision target, you can just take the largest contour and assume that that is the target you are looking for. When there is more than one vision target, you can use size, shape, fullness, and other properties to filter unwanted contours out.
fr_ca: Dans les cas où il n'y a qu'une seule cible de vision, vous pouvez simplement prendre le plus grand contour et supposer que c'est la cible que vous recherchez. Lorsqu'il existe plusieurs cibles de vision, vous pouvez utiliser la taille, la forme, l'ampleur et d'autres propriétés pour filtrer les contours indésirables.
tr_tr: Tek bir görme hedefinin olduğu durumlarda, en büyük konturu alabilir ve aradığınız hedefin bu olduğunu varsayabilirsiniz. Birden fazla görme hedefi olduğunda, istenmeyen konturları filtrelemek için boyut, şekil, dolgunluk ve diğer özellikleri kullanabilirsiniz.
zh_cn: 在只有一个视觉目标的情况下，您可以采用最大轮廓，并假定这是您要寻找的目标。如果存在多个视觉目标，则可以使用大小，形状，饱和度和其他属性来滤除不需要的轮廓。

source: If you draw the contour you just found, it should look something like this:
fr_ca: Si vous dessinez le contour que vous venez de trouver, il devrait ressembler à ceci:
tr_tr: Yeni bulduğunuz konturu çizerseniz, şuna benzemelidir:
zh_cn: 如果绘制刚发现的轮廓，则外观应如下所示：

source: Retroreflective tape outlined in red by the image processing algorithm.
fr_ca: Bande rétroréfléchissante délimitée en rouge par l’algorithme de traitement d’image.

source: Extracting Information from Contours
fr_ca: Extraire des informations des contours
tr_tr: Konturlardan Bilgi Çıkarma
zh_cn: 从轮廓提取信息

source: Now that you've found the contour(s) that you want, you now want to get information about it, such as the center, corners, and rotation.
fr_ca: Maintenant que vous avez trouvé le (s) contour (s) que vous voulez, vous voulez maintenant obtenir des informations à ce sujet, telles que le centre, les coins et la rotation.
tr_tr: Artık istediğiniz kontur(ları) bulduğunuza göre, artık bununla ilgili merkez, köşeler ve dönüş gibi bilgiler almak istiyorsunuz.
zh_cn: 现在，您已经找到了所需的轮廓，现在想要获取有关轮廓的信息，例如中心，角和旋转。

source: Center
fr_ca: Centre
tr_tr: Merkez
zh_cn: 中心

source: Corners
fr_ca: Coins
tr_tr: Kornerler
zh_cn: 角

source: For more information on how you can use these values, see :ref:`docs/software/vision-processing/introduction/identifying-and-processing-the-targets:Measurements`
fr_ca: Pour plus d'informations sur la façon dont vous pouvez utiliser ces valeurs, voir: :ref:`docs/software/vision-processing/introduction/identifying-and-processing-the-targets:Measurements`
tr_tr: Bu değerleri nasıl kullanabileceğiniz hakkında daha fazla bilgi için bkz :ref:`docs/software/vision-processing/introduction/identifying-and-processing-the-targets:Measurements`
zh_cn: 有关如何使用这些值的更多信息，请参阅：docs / software / vision-processing / introduction / identification-and-processing-the-targets：Measurements

source: Publishing to NetworkTables
fr_ca: Publication sur NetworkTables
tr_tr: NetworkTables'da yayınlama
zh_cn: 发布到NetworkTables

source: You can use NetworkTables to send these properties to the Driver Station and the RoboRIO. Additional processing could be done on the Raspberry Pi, or the RoboRIO itself.
fr_ca: Vous pouvez utiliser NetworkTables pour envoyer ces propriétés au Driver Station et au RoboRIO. Un traitement supplémentaire peut être effectué sur le Raspberry Pi ou le RoboRIO lui-même.
tr_tr: Bu özellikleri Driver Station ve RoboRIO'ya göndermek için NetworkTables'ı kullanabilirsiniz. Raspberry Pi'de veya RoboRIO'nun kendisinde ek işlemler yapılabilir.
zh_cn: 您可以使用NetworkTables将这些属性发送到Driver Station和RoboRIO。可以在Raspberry Pi或RoboRIO本身上进行其他处理。

source: Rotation
tr_tr: Rotasyon
zh_cn: 旋转
