Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/old-commandbased/basics/adding-commands-subsystems.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Adding Commands and Subsystems to the Project
es_mx: Agregar Comandos y Subsistemas al Proyecto
fr_ca: Ajout de Commandes et de Sous-systèmes au projet
tr_tr: Projeye Komut ve Alt Sistemler Ekleme
zh_cn: 在项目中添加命令和子系统

source: This documentation describes the use of the legacy command-based library. While this documentation has been preserved to help teams that have yet to do so, teams are strongly encouraged to migrate to the :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
es_mx: Esta documentación describe el uso de la librería basada en comandos. Aún cuando esta documentación ha sido preservada para ayudar a los equipos que aún no lo hace, se le recomienda a todos los equipos emigrar a la :ref:`nueva librería basada en comandos <docs/software/commandbased/index:Command-Based Programming>`.
fr_ca: Cette documentation décrit l’utilisation de la bibliothèque patrimoniale de commande orientée. Bien que cette documentation ait été conservée pour aider les équipes qui ne l’ont pas encore fait, les équipes sont fortement encouragées à migrer vers la bibliothèque :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
tr_tr: Bu belge, eski komut tabanlı kitaplığın kullanımını açıklar. Bu belgeler henüz bunu yapmamış takımlara yardımcı olmak için korunmuş olsa da, ekiplerin :ref:`yeni komut tabanlı kitaplık <docs/software/commandbased/index:Command-Based Programming>` a geçmeleri şiddetle tavsiye edilir.
zh_cn: 本文档描述了旧版本基于命令的库的用法。尽管保留了该文档以帮助尚未这样做的团队，但强烈建议团队迁移到新的基于命令的库<docs/software/commandbased/index:Command-Based Programming>。

source: Commands and Subsystems each are created as classes. The plugin has built-in templates for both Commands and Subsystems to make it easier for you to add them to your program.
es_mx: Los comandos y los susbsistemas son creados como clases. El plugin tiene plantillas para ambos para facilitar el agregarlos al programa.
fr_ca: Les commandes et les sous-systèmes sont créés en tant que classes. Le plugin dispose de modèles intégrés pour les commandes et les sous-systèmes afin de vous en faciliter l’ajout à votre programme.
tr_tr: Komutlar ve Alt Sistemlerin her biri class olarak oluşturulur. Eklenti, programınıza eklemenizi kolaylaştırmak için hem Command hem de Subsystems için yerleşik şablonlara sahiptir.
zh_cn: 命令和子系统都作为一种类型创建。该插件具有用于命令和子系统的内置模板，您可以更轻松地将它们添加到程序中。

source: Adding Subsystems to the Project
es_mx: Agregar Subsistemas al Proyecto
fr_ca: Ajout de sous-systèmes au projet
tr_tr: Projeye Alt Sistemler Ekleme
zh_cn: 将子系统添加到项目

source: To add a subsystem, right-click on the desired folder and select **Create a new class/command** in the drop down menu. Then select **Subsystem (Old)** or **PID Subsystem (Old)**.
es_mx: Para agregar un subsistema, dé clic derecho en la carpeta deseada y seleccione **Create a new class/command** en el menú desplegable. Luego seleccione **Subsystem (Old)** o **PID Subsystem (Old)**.
fr_ca: Pour ajouter un sous-système, cliquez avec le bouton droit sur le dossier souhaité et sélectionnez **Create a new class/command** dans le menu déroulant. Sélectionnez ensuite **Subsystem (Old)** ou **PID Subsystem (Old)**.
tr_tr: Bir alt sistem eklemek için, istenen klasöre sağ tıklayın ve açılır menüden **Create a new class/command** seçeneğini seçin. Ardından **Subsystem (Old)** veya **PID Subsystem (Old)** seçeneğini seçin.
zh_cn: 要添加子系统，请右键单击所需的文件夹，然后在下拉菜单中选择**Create a new class/command**，然后选择** Subsystem（Old）**或**PID Subsystem（Old）**。

source: Naming the Subsystem
es_mx: Nombrar el Subsistema
fr_ca: Nommer le sous-système
tr_tr: Alt Sistemi-Subsystem Adlandırma
zh_cn: 命名子系统

source: Fill in a name for the subsystem. This will become the resultant class name for the subsystem so the name has to be a valid class name for your language.
es_mx: Asigna un nombre al subsistema. Se convertirá en el nombre de la clase para el subsistema así que tiene que ser un nombre de clase válido para su idioma.
fr_ca: Remplissez un nom pour le sous-système. Celui-ci deviendra le nom de classe résultant pour le sous-système de sorte que le nom doit être un nom de classe valide selon votre langage de programmation.
tr_tr: Alt sistem için bir ad girin. Bu, alt sistem için sonuçta ortaya çıkan sınıf adı olacaktır, bu nedenle adın diliniz için geçerli bir sınıf adı olması gerekir.
zh_cn: 填写子系统的名称。这将会是子系统的最终类名，因此该名称必须是有意义的类型名。

source: Subsystem Created in Project
es_mx: Subsistema creado en el proyecto
fr_ca: Sous-système créé dans le projet
tr_tr: Projede Oluşturulan Alt Sistem
zh_cn: 在项目中创建的子系统

source: You can see the new subsystem created in the Subsystems folder in the project. To learn more about creating subsystems, see the :doc:`Simple Subsystems <../subsystems/simple-subsystems>` article.
es_mx: Puede observar el nuevo subsistema creado en la carpeta Sybsystems en el proyecto. Para aprender más sobre crear subsistemas vea :doc:`Simple Subsystems <../subsystems/simple-subsystems>` article.
fr_ca: Vous pouvez voir le nouveau sous-système créé dans le dossier Subsystems dans le projet. Pour en savoir plus sur la création de sous-systèmes, voir l'article :doc:`Simple Subsystems <../subsystems/simple-subsystems>`.
tr_tr: Projedeki Subsystems klasöründe oluşturulan yeni alt sistemi görebilirsiniz. Alt sistemler oluşturma hakkında daha fazla bilgi edinmek için şu belgeye bakın: :doc:`Simple Subsystems <../subsystems/simple-subsystems>` makalesi.
zh_cn: 您可以在项目的Subsystems文件夹中看到创建的新子系统。要了解有关创建子系统的更多信息，请参见Simple Subsystems <../subsystems/simple-subsystems>文章。

source: Adding a Command to the Project
es_mx: Agregar un comando al proyecto
fr_ca: Ajout d’une commande au projet
tr_tr: Projeye Komut Ekleme
zh_cn: 在项目中添加命令

source: A command can be created for the project using steps similar to creating a subsystem. First right-click on the folder name in the project, then select **Create a new class/command** in the drop down menu. Then select **Command (Old)**, **Instant Command (Old)**, **TimedCommand (Old)**, **Command Group (Old)**:
es_mx: Un comando puede ser creado para el proyecto usando pasos muy similares como al crear un subsistema. Primero, dé clic derecho en el nombre de la carpeta del proyecto y luego seleccione **Create a new class/command** en el menú desplegable. A continuación seleccione **Command (Old)**, **Instant Command (Old)**, **TimedCommand (Old)**, **Command Group (Old)**:
fr_ca: Une commande peut être créée pour le projet à l’aide d’étapes similaires à la création d’un sous-système. Cliquez d’abord avec le bouton droit sur le nom du dossier dans le projet, puis sélectionnez **Create a new class/command** dans le menu déroulant. Sélectionnez ensuite **Command (Old)**, **Instant Command (Old)**, **TimedCommand (Old)**, **Command Group (Old)**:
tr_tr: Alt sistem oluşturmaya benzer adımlar kullanılarak proje için bir komut oluşturulabilir. Önce projedeki klasör adına sağ tıklayın, ardından açılır menüden **Create a new class/command** seçeneğini seçin. Ardından **Command (Old)**, **Instant Command (Old)**, **TimedCommand (Old)**, **Command Group (Old)** seçin:
zh_cn: 可以使用类似于创建子系统的步骤为项目创建一个命令。首先在项目中的文件夹名称上右击，然后在下拉菜单中选择“Create a new class/command”。选择“Command（Old）”，“ Instant Command（Old）”，TimedCommand（Old）”，“Command Group（Old）”：

source: **Command** - A basic command that operates on a subsystem
es_mx: **Command** - Un comando básico que opera en un subsistema
fr_ca: **Command** - Commande de base qui fonctionne sur un sous-système
tr_tr: **Command** - Bir alt sistem üzerinde çalışan temel bir komut
zh_cn: "Command"-在子系统上运行的基本命令

source: **Instant Command** - A command that runs and completes instantly
es_mx: **Instant Command** - Un comando que se ejecuta y completa instantáneamente.
fr_ca: **Instant Command** - Une commande qui s’exécute et se termine instantanément
tr_tr: **Instant Command** - Anında çalışan ve tamamlanan bir komut
zh_cn: "Instant Command"-立即运行并完成的命令

source: **Timed Command** - A command that runs for a specified time duration
es_mx: **Timed Command** - Un comando que se ejecuta por un tiempo específico
fr_ca: **Timed Command** - Une commande qui s’exécute pour une durée de temps spécifique
tr_tr: **Timed Command** - Belirli bir süre boyunca çalışan bir komut
zh_cn: "Timed Command"-在指定时间段内运行的命令

source: **Command Group** - A command that runs other commands
es_mx: **Command Group** - Un comando que ejecuta otros comandos
fr_ca: **Command Group** - Une commande qui exécute d'autres commandes
tr_tr: **Command Group-Komut Grubu** - Diğer komutları çalıştıran bir komut
zh_cn: "Command Group"-运行其他指令的指令

source: Set the Command Name
es_mx: Asignar el nombre del comando
fr_ca: Définir le nom de commande
tr_tr: Komut Adını Ayarlayın
zh_cn: 设置命令名称

source: Enter the Command name into the dialog box. This will be the class name for the Command so it must be a valid class name for your language.
es_mx: Escriba el nombre del comando en el cuadro de diálogo. Este será el nombre de la clase para el comando así que debe ser un nombre válido en su idioma.
fr_ca: Entrez le nom de commande dans la boîte de dialogue. Il s’agit du nom de classe de la Commande, il doit donc être un nom de classe valide selon votre langage de programmation.
tr_tr: İletişim kutusuna Command adını girin. Bu, komutun class adı olacaktır, bu nedenle diliniz için geçerli bir sınıf adı olmalıdır.
zh_cn: 在对话框中输入命令名称。这将是命令的类名，因此它必须是有意义的类型名。

source: Command Created in the Project
es_mx: Comando creado en el proyecto
fr_ca: Commande créée dans le projet
tr_tr: Projede Oluşturulan Komut
zh_cn: 在项目中创建的命令

source: You can see that the Command has been created in the Commands folder in the project in the Project Explorer window. To learn more about creating commands, see the :doc:`Creating Simple Commands article<../commands/creating-simple-commands>`.
es_mx: Puede ver que el Comando se ha creado en la carpeta Comandos del proyecto en la ventana Explorador de proyectos. Para obtener más información sobre la creación de comandos, consulte :doc:`Creating Simple Commands article<../commands/creating-simple-commands>`.
fr_ca: Vous pouvez voir que la Commande a été créée dans le dossier Commands du projet dans la fenêtre Project Explorer. Pour en savoir plus sur la création de commandes, voir l’article :doc:`Création de commandes simples <../commands/creating-simple-commands>`.
tr_tr: Komutun Project Explorer penceresindeki projede Command klasöründe oluşturulduğunu görebilirsiniz. Komut oluşturma hakkında daha fazla bilgi edinmek için şu belgeye bakın: :doc:`Basit Komutlar Oluşturma makalesi <../commands/creating-simple-commands>` .
zh_cn: 您可以在“项目资源管理器”窗口的项目的“命令”文件夹中看到该命令已经被创建了。要了解有关创建命令的更多信息，请参见 Creating Simple Commands<../commands/creating-simple-commands>。
