Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/old-commandbased/basics/convert-simple-auto-command-auto.po
Languages: es_mx, fr_ca, tr_tr

source: Converting a Simple Autonomous Program to Command-Based
es_mx: Convertir un programa autónomo simple a uno basado en comandos
fr_ca: Conversion d’un programme autonome simple en programme autonome ortienté commande
tr_tr: Basit Bir Otonom Programı Komut Tabanlıya Dönüştürme

source: This documentation describes the use of the legacy command-based library. While this documentation has been preserved to help teams that have yet to do so, teams are strongly encouraged to migrate to the :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
es_mx: Esta documentación describe el uso de la biblioteca dejada basada en comandos. Si bien esta documentación se ha conservado para ayudar a los equipos que aún no lo han hecho, se recomienda encarecidamente a los equipos que migren a la nueva biblioteca basada en comandos.
fr_ca: Cette documentation décrit l’utilisation de la bibliothèque patrimoniale orientée commande. Bien que cette documentation ait été conservée pour aider les équipes qui ne l’ont pas encore fait, les équipes sont fortement encouragées à migrer vers la :ref:`nouvelle bibliothèque de programmation orientée commande <docs/software/commandbased/index:Command-Based Programming>`.
tr_tr: Bu belge, eski komut tabanlı kütüphanenin kullanımını açıklar. Bu belgeler henüz bunu yapmamış takımlara yardımcı olmak için korunmuş olsa da, takımların :ref:`yeni komut-tabanlı kütüphane <docs/software/commandbased/index:Command-Based Programming>` e geçmeleri şiddetle tavsiye edilir.

source: This document describes how to rewrite a simple autonomous into a command based autonomous. Hopefully, going through this process will help those more familiar with the older simple autonomous method understand the command based method better. By re-writing it as a command based program, there are several benefits in terms of testing and reuse. For this example, all of the logic is abstracted out into functions primarily so that the focus of this example can be on the structure.
es_mx: Este documento describe cómo reescribir un autónomo simple en un autónomo basado en comandos. Con suerte, pasar por este proceso ayudará a aquellos más familiarizados con el método autónomo simple más antiguo a comprender mejor el método basado en comandos. Al volver a escribirlo como un programa basado en comandos, hay varios beneficios en términos de prueba y reutilización. Para este ejemplo, toda la lógica se abstrae en funciones principalmente para que el enfoque de este ejemplo pueda estar en la estructura.
fr_ca: Ce document décrit comment réécrire un simple autonome en autonome orienté commande. Espérons que passer à travers ce processus aidera ceux qui sont plus familiers avec l’ancienne architecture simple autonome simple à mieux comprendre la nouvelle architecture orientée commande. En le réécrivant comme un programme orienté commande, il y a plusieurs avantages en termes de test et de réutilisation. Pour cet exemple, toute la logique est principalement abstraite dans les fonctions de sorte que dans cet exemple, l'emphase est mise sur la structure.
tr_tr: Bu belge, basit bir otonomun komut tabanlı bir otonom haline nasıl yeniden yazılacağını açıklamaktadır. Umarım, bu süreçten geçmek, eski basit otonom yönteme daha aşina olanların komuta dayalı yöntemi daha iyi anlamalarına yardımcı olacaktır. Komut tabanlı bir program olarak yeniden yazmanın, test etme ve yeniden kullanma açısından birçok faydası vardır. Bu örnek için, tüm mantık öncelikli olarak işlevlere ayrılmıştır, böylece bu örneğin odak noktası yapı üzerinde olabilir.

source: Initial Autonomous Code
es_mx: Inicializar el código autónomo
fr_ca: Code autonome initial
tr_tr: Başlangıç Otonom Kodu

source: The code above aims a shooter, then it spins up a wheel and, finally, once the wheel is running at the desired speed, it shoots the frisbee. The code consists of three distinct actions: aim, spin up to speed and shoot the Frisbee. The first two actions follow a command pattern that consists of four parts:
es_mx: El código anterior apunta a un disparador, luego hace girar una rueda y, finalmente, una vez que la rueda funciona a la velocidad deseada, dispara al frisbee. El código consta de tres acciones distintas: apuntar, girar a toda velocidad y disparar al Frisbee. Las dos primeras acciones siguen un patrón de comando que consta de cuatro partes:
fr_ca: Le code ci-dessus pointe un tireur, puis il fait tourner une roue et, finalement, une fois que la roue tourne à la vitesse désirée, il tire le frisbee. Le code se compose de trois actions distinctes: viser, tourner à une vitesse et tirer le Frisbee. Les deux premières actions suivent un modèle de commande qui se compose de quatre parties :
tr_tr: Yukarıdaki kod, bir shooterı hedefler, ardından bir çarkı döndürür ve son olarak, tekerlek istenen hızda çalıştıktan sonra frizbiyi vurur. Kod üç farklı eylemden oluşur: nişan alma, hızlandırma için dönme ve Frizbi'yi vurma. İlk iki eylem, dört bölümden oluşan bir komut modelini izler:

source: Initialization: prepares for the action to be performed.
es_mx: Inicialización: se prepara para la acción a realizar.
fr_ca: Initialisation : se prépare à l’action à effectuer.
tr_tr: Initialization: gerçekleştirilecek eylem için hazırlar.

source: Condition: keeps the loop going while it is satisfied.
es_mx: Condición: mantiene el ciclo en marcha mientras está satisfecho.
fr_ca: Condition: maintient la boucle tant que la condition est remplie.
tr_tr: Condition-durum: Döngüyü tatmin ederken devam ettirir.

source: Execution: repeatedly updates the code to try to make the condition false.
es_mx: Ejecución: actualiza repetidamente el código para intentar que la condición sea falsa.
fr_ca: Exécution: met à jour le code de manière répétitive afin d'essayer de rendre la condition fausse.
tr_tr: Execution: koşulu false yapmak için kodu tekrar tekrar günceller.

source: End: performs any cleanup and final task before moving on to the next action.
es_mx: Fin: realiza cualquier tarea de limpieza y final antes de pasar a la siguiente acción.
fr_ca: Fin : effectue n’importe quelle tâche de nettoyage et de terminaison avant de passer à l’action suivante.
tr_tr: End: bir sonraki eyleme geçmeden önce herhangi bir temizleme ve son görevi gerçekleştirir.

source: The last action only has an explicit initialize, though depending on how you read it, it can implicitly end under a number of conditions. The most obvious one two in this case are when it's done shooting or when autonomous has ended.
es_mx: La última acción solo tiene una inicialización explícita, aunque dependiendo de cómo la lea, puede terminar implícitamente bajo una serie de condiciones. Los dos más obvios en este caso son cuando termina de disparar o cuando finaliza el periodo del autónomo
fr_ca: La dernière action n’a qu’une initialisation explicite, bien que selon la façon dont vous la lisez, elle peut implicitement se terminer dans un certain nombre de conditions. Les deux conditions les plus évidents dans ce cas sont quand le tir se termine ou quand l'autonome prend fin.
tr_tr: Son eylem yalnızca açık bir başlatmaya sahiptir, ancak onu nasıl okuduğunuza bağlı olarak bir dizi koşul altında örtülü olarak sona erebilir. Bu durumda en bariz olan ikisi, vuruş bittiğinde veya otonomun sona erdiği zamandır.

source: Rewriting it as Commands
es_mx: Reescribiendo a comando
fr_ca: Le réécrire sous forme de commandes
tr_tr: Command olarak Yeniden Yazmak

source: The same code can be rewritten as a ``CommandGroup`` that groups the three actions, where each action is written as it's own command. First, the command group will be written, then the commands will be written to accomplish the three actions. This code is pretty straightforward. It does the three actions sequentially, that is one after the other. Line 3 aims the robot, then line 4 spins the shooter up and, finally, line 5 actually shoots the frisbee. The ``addSequential()`` method sets it so that these commands run one after the other.
es_mx: El mismo código se puede reescribir como un ``CommandGroup`` que agrupa las tres acciones, donde cada acción se escribe como su propio comando. Primero, se escribirá el grupo de comandos, luego los comandos se escribirán para cumplir con estas tres acciones. Éste código es sencillo y directo. Realiza las tres acciones secuencialmente, una tras otra. La línea 3 apunta al robot, luego la linea 4 hace girar el disparador, y finalmente, la linea 5 dispara el frisbee. El método ``addSequential()`` lo establece para que estos comandos se ejecuten uno tras otro.
fr_ca: Le même code peut être réécrit en tant que ``CommandGroup`` qui regroupe les trois actions, où chaque action est écrite dans sa propre commande. Premièrement le groupe de commandes est écrit, puis des commandes sont écrites afin d'accomplir les trois actions. Ce code est assez simple. Il fait les trois actions séquentiellement, c’est-à-dire l’une après l’autre. La ligne 3 met le robot en joue, puis la ligne 4 fait tourner le tireur et, enfin, la ligne 5 tire réellement le frisbee. La méthode ``addSequential()`` configure le code de sorte que ces commandes s’exécutent l’une après l’autre.
tr_tr: Aynı kod, her eylemin kendi komutu olarak yazıldığı üç eylemi gruplayan bir ``CommandGroup`` olarak yeniden yazılabilir. Önce komut grubu yazılacak, ardından üç eylemi gerçekleştirmek için komutlar yazılacaktır. Bu kod oldukça basittir. Üç eylemi sırayla, yani birbiri ardına yapar. 3. satır robotu hedef alır, ardından 4. satır atıcıyı döndürür ve son olarak 5. satır aslında frizbiyi vurur. ``AddSequential()`` yöntemi, bu komutların arka arkaya çalışması için onu ayarlar.

source: The Aim Command
es_mx: El comando de apuntar
fr_ca: La Commande Aim
tr_tr: Aim - Nişan alma Komutu

source: As you can see, the command reflects the four parts of the action we discussed earlier. It also has the ``interrupted()`` method which will be discussed below. The other significant difference is that the condition in the ``isFinished()`` is the opposite of what you would put as the condition of the while loop, it returns true when you want to stop running the execute method as opposed to false. Initializing, executing and ending are exactly the same, they just go within their respective method to indicate what they do.
es_mx: Como puede ver, el comando refleja las cuatro partes de la acción que discutimos anteriormente. También tiene el método ``interrupted()`` que se discutirá a continuación. La otra diferencia significativa es que la condición ``isFinished()`` es lo contrario de lo que pondría como condición del ciclo while, devuelve verdadero cuando desea detener la ejecución del método de ejecución en lugar de falso. La inicialización, la ejecución y el final son exactamente lo mismo, solo van dentro de su método respectivo para indicar lo que hacen.
fr_ca: Comme vous pouvez le voir, la commande reflète les quatre parties de l’action dont nous avons discuté plus tôt. La commande renferme également la méthode ``interrupted()`` qui sera discutée ci-dessous. L’autre différence significative est que la condition dans la méthode ``isFinished()`` est le contraire de ce que vous mettez comme condition de la boucle while, il retourne TRUE lorsque vous voulez arrêter d’exécuter la méthode ``execute()`` par opposition à FALSE. Initialisation, l'exécution et la terminaison sont exactement les mêmes, elles sont juste placées dans leur méthode respective pour indiquer ce qu’elles font.
tr_tr: Gördüğünüz gibi, komut daha önce tartıştığımız eylemin dört bölümünü yansıtıyor. Ayrıca aşağıda tartışılacak olan ``interrupted()`` yöntemine de sahiptir. Diğer önemli fark, ``isFinished()`` içindeki koşul, while döngüsünün koşulu olarak koyduğunuz koşulun tersi olmasıdır; false yerine execute yöntemini çalıştırmayı durdurmak istediğinizde true döndürür. Başlatma, yürütme ve sonlandırma tamamen aynıdır, ne yaptıklarını belirtmek için kendi yöntemlerine girerler.

source: SpinUpShooter Command
es_mx: Comando SpinUpShooter
fr_ca: La commande SpinUpShooter
tr_tr: SpinUpShooter Komutu

source: The spin up shooter command is very similar to the Aim command, it's the same basic idea.
es_mx: El comando spin up shooter es muy similar al comando Aim command, es la misma idea básica.
fr_ca: La commande SpinUpShooter est très similaire à la commande Aim, c'est la même idée de base.
tr_tr: Atıcıyı döndürme-spin up shooter komutu, Aim komutuna çok benzer, aynı temel fikir.

source: Shoot Command
es_mx: Comando shoot
fr_ca: La commande Shoot
tr_tr: Shoot Komutu

source: The shoot command is the same basic transformation yet again, however it is set to end immediately. In CommandBased programming, it is better to have it's isFinished method return true when the act of shooting is finished, but this is a more direct translation of the original code.
es_mx: El comando de disparo es la misma transformación básica una vez más, sin embargo, está configurado para finalizar de inmediato. En la programación basada en comandos, es mejor que su método IsFinished vuelva verdadero cuando finalice el acto de disparo, pero esta es una traducción más directa del código original.
fr_ca: La commande Shoot est la même transformation de base une fois de plus, mais elle est configurée pour se terminer immédiatement. Dans la programmation orientée command, il est préférable d’avoir sa méthode ``isFinished()`` retourner VRAI lorsque l’action de tirer est terminée, mais il s’agit d’une traduction plus directe du code original.
tr_tr: Shoot komutu yine aynı temel dönüşümdür, ancak hemen bitmesi için ayarlanmıştır. Komut Tabanlı programlamada, isFinished yönteminin shoot eylemi tamamlandığında true dönmesi daha iyidir, ancak bu, orijinal kodun daha direkt bir çevirisidir.

source: Benefits of Command-Based
es_mx: Beneficios de los comandos
fr_ca: Benefices de la programmation orientée commande
tr_tr: Komut Tabanlı'nın Faydaları

source: Why bother re-writing the code as CommandBased? Writing the code in the CommandBased style offers a number of benefits:
es_mx: ¿Por qué molestarse en volver a escribir el código como CommandBased? Escribir el código en el estilo CommandBased ofrece una serie de beneficios:
fr_ca: Pourquoi s’embêter à ré-écrire le code comme programme orienté commande? L’écriture du code dans le style orienté commande offre un certain nombre d’avantages :
tr_tr: Neden kodu CommandBased olarak yeniden yazmakla uğraşasınız? Kodu CommandBased stilde yazmak bir dizi avantaj sunar:

source: **Re-Usability** - You can reuse the same command in teleop and multiple autonomous modes. They all reference the same code, so if you need to tweak it to tune it or fix it, you can do it in one place without having to make the same edits in multiple places.
es_mx: **Reutilización**- puede reutilizar el mismo comando en teleop y múltiples modos autónomos. Todos hacen referencia al mismo código, por lo que si necesita ajustarlo para ajustarlo o arreglarlo, puede hacerlo en un lugar sin tener que hacer las mismas ediciones en varios lugares.
fr_ca: **Réutilisabilité** - Vous pouvez réutiliser la même commande dans les Modes Téléop et plusieurs modes Autonomes. Ils font tous référence au même code, donc si vous avez besoin de le modifier pour le régler ou le corriger, vous pouvez le faire en un seul endroit sans avoir à faire les mêmes modifications à plusieurs endroits différents.
tr_tr: **Re-Usability** - Aynı komutu teleop ve birden çok otonom modda yeniden kullanabilirsiniz. Hepsi aynı koda başvurur, bu yüzden onu ayarlamak veya düzeltmek için ince ayar yapmanız gerekirse, birden çok yerde aynı düzenlemeleri yapmak zorunda kalmadan tek bir yerde yapabilirsiniz.

source: **Testability** - You can test each part using tools such as the ShuffleBoard to test parts of the autonomous. Once you put them together, you'll have more confidence that each piece works as desired.
es_mx: **Capacidad de prueba**- puede probar cada parte utilizando herramientas como el ShuffleBoard para probar partes del autónomo. Una vez que los haya reunido, tendrá más confianza en que cada pieza funciona según lo deseado.
fr_ca: **Testabilité** - Vous pouvez tester chaque portion du code à l’aide d’outils tels que le ShuffleBoard pour tester des parties de l’autonome. Une fois que vous les avez mises ensemble, vous aurez plus d'assurance que chaque portion du code fonctionne comme vous le souhaitez.
tr_tr: **Test edilebilirlik** - Otonom parçalarını test etmek için ShuffleBoard gibi araçları kullanarak her parçayı test edebilirsiniz. Onları bir araya getirdikten sonra, her bir parçanın istendiği gibi çalıştığına daha fazla güven duyacaksınız.

source: **Parallelization** - If you wanted this code to aim and spin up the shooter at the same time, it's trivial with CommandBased programming. Just use ``AddParallel()`` instead of ``AddSequential()`` when adding the Aim command and now aiming and spinning up will happen simultaneously.
es_mx: **Paralelización**- si desea que este código apunte y haga girar el tirador al mismo tiempo, es trivial con la programación CommandBased. Simplemente use ``AddParallel()`` en lugar de ``AddSequential()`` cuando agregue el comando Apuntar y ahora apuntará y girará simultáneamente.
fr_ca: **Parallélisation** - Si vous vouliez que ce code vise et fait tourner le tireur en même temps, c’est trivial avec la programmation orientée commande. Il suffit d’utiliser ``AddParallel()`` au lieu de ``AddSequential()`` lors de l’ajout de la commande Aim et, par la suite, viser et tourner se feront simultanément.
tr_tr: **Parallelization** - Bu kodun nişancıyı aynı anda hem hedefleyip hem de döndürmesini istiyorsanız, CommandBased programlamada çok kolaydır. Aim komutunu eklerken ``AddSequential()`` yerine ``AddParallel()`` kullanın ve şimdi nişan alma ve döndürme aynı anda gerçekleşecek.

source: **Interruptibility** - Commands are interruptible, this provides the ability to exit a command early, a task that is much harder in the equivalent while loop based code.
es_mx: **Interrumpibilidad**- los comandos son interrumpibles, esto proporciona la capacidad de salir de un comando antes, una tarea que es mucho más difícil en el equivalente mientras que el código basado en bucle.
fr_ca: **Interruptibilité** - Les commandes sont interrompues, ce qui permet de quitter une commande tôt, une tâche qui est beaucoup plus difficile dans un code équivalent qui ferait usage d'une boucle while.
tr_tr: **Interruptibility** - Commands lar kesilebilir, bu, bir komuttan erken çıkma yeteneği sağlar, bu, döngü tabanlı kodla eşdeğerde çok daha zor olan bir görevdir.
