Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/old-commandbased/basics/what-*-command-based.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: More complex commands can be built up from simpler commands. For example, shooting a disc may be a long sequence of commands that are executed one after another. Maybe some of these commands in the sequence can be executed concurrently. Command groups are commands, but instead of having an isFinished and execute method, they have a list of other commands to execute. This allows more complex operations to be built up out of simpler operations, a basic principle in programming. Each of the individual smaller commands can be easily tested first, then the group can be tested. More information on command groups can be found in the :doc:`Creating groups of commands article <../commands/creating-groups-commands>`.
es_mx: Se pueden construir comandos más complejos a partir de comandos más simples. Por ejemplo, lanzar un disco implica una larga secuencia de comandos que se ejecutan uno tras otro. Quizás algunos de estos comandos en la secuencia se puedan ejecutar al mismo tiempo. Los grupos de comandos son comandos, pero en lugar de tener los métodos isFinished y execute, tienen una lista de otros comandos para ejecutar. Esto permite construir operaciones más complejas a partir de operaciones más simples, un principio básico en programación. Cada uno de los comandos individuales más pequeños se puede probar primero fácilmente, luego se puede probar el grupo. Puede encontrar más información sobre los grupos de comandos en el :doc: `Artículo sobre creación de grupos de comandos <../commands/creating-groups-commands>`.
fr_ca: Des commandes plus complexes peuvent être construites à partir de commandes plus simples. Par exemple, tirer un disque peut être une longue séquence de commandes exécutées l’une après l’autre. Il se peut bien que certaines de ces commandes dans la séquence puissent être exécutées simultanément. Les groupes de commandes sont des commandes, mais au lieu d’avoir unes méthodes ``isFinished`` et ``execute()``, ils ont une liste d’autres commandes à exécuter. Cela permet de construire des opérations plus complexes à partir d’opérations plus simples, un principe de base dans la programmation. Chacune des commandes individuelles plus petites peut être facilement testée en premier, puis le groupe peut être testé. Vous trouverez plus d’informations sur les groupes de commandes dans l’article :doc:`Création de groupes de commandes <../commands/creating-groups-commands>`.
tr_tr: Daha basit komutlardan daha karmaşık komutlar oluşturulabilir. Örneğin, bir diskin çekilmesi, birbiri ardına yürütülen uzun bir komut dizisi olabilir. Belki sıradaki bu komutlardan bazıları eşzamanlı olarak yürütülebilir. Komut grupları komutlardır, ancak bir isFinished ve execute methoduna sahip olmak yerine, yürütülecek diğer komutların bir listesine sahiptirler. Bu, programlamada temel bir ilke olan daha basit işlemlerden daha karmaşık işlemlerin oluşturulmasına izin verir. Daha küçük komutların her biri önce kolayca test edilebilir, ardından grup test edilebilir. Komut grupları hakkında daha fazla bilgi şu belgede bulunabilir :doc:`Komut grupları oluşturma makalesi <../commands/creating-groups-commands>`.
zh_cn: 可以从更简单的指令构建更复杂的指令。例如，发射飞盘可能是一段很长的、顺序执行的指令序列。也许序列中的某些指令可以同时执行。指令组是一种指令，但是除了具有isFinished和execute方法外，它们还有一个其他要执行的指令列表。这样可以从简单的操作中构建更复杂的操作-一条编程的基本原则。每个较小的指令中都可以首先轻松地进行测试，然后再对该组进行测试。有关指令组的更多信息，请参见：创建指令组文章<../commands/creating-groups-commands>。
