Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/old-commandbased/basics/what-*-command-based.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: What is Command-Based Programming?
es_mx: ¿Qué es la programación a base de comandos?
fr_ca: Qu’est-ce que la programmation orientée Commande?
tr_tr: Komut Tabanlı Programlama nedir?
zh_cn: 什么是基于指令的编程？

source: This documentation describes the use of the legacy command-based library. While this documentation has been preserved to help teams that have yet to do so, teams are strongly encouraged to migrate to the :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
es_mx: Esta documentación describe el uso de la biblioteca heredada de base de comandos. Si bien esta documentación se ha conservado para ayudar a los equipos que aún no lo han hecho, se recomienda encarecidamente a los equipos que migren a :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
fr_ca: Cette documentation décrit l’utilisation de la bibliothèque patrimoniale commande orientée . Bien que cette documentation ait été conservée pour aider les équipes qui ne l'ont pas encore fait, les équipes sont fortement encouragées à migrer vers la bibliothèque :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
tr_tr: Bu belge, eski komut tabanlı kitaplığın kullanımını açıklar. Bu belgeler henüz bunu yapmamış tarkımlara yardımcı olmak için korunmuş olsa da, ekiplerin :ref:`yeni komut tabanlı kitaplık <docs/software/commandbased/index:Command-Based Programming>` ' a geçmeleri şiddetle tavsiye edilir.
zh_cn: 本文档描述了旧式基于指令的库的用法。尽管保留了该文档以帮助尚未这样做的团队，但强烈建议团队迁移到新的基于指令的库<docs/software/commandbased/index:Command-Based Programming>。

source: WPILib supports a method of writing programs called "Command-based programming". Command-based programming is a design pattern to help you organize your robot programs. Some of the characteristics of robot programs that might be different from other desktop programs are:
es_mx: WPILib admite un método de escritura de programas llamado "Programación basada en comandos". La programación basada en comandos es un patrón de diseño que le ayuda a organizar sus programas de robot. Algunas de las características de los programas de robots que pueden ser diferentes de otros programas de escritorio son:
fr_ca: WPILib prend en charge une méthode d’écriture de programmes appelée "Command-based programming" que nous appellerons "programmation orientée commande". La programmation orientée commande est un patron de conception dont le but est de vous aider à organiser vos programmes de robots. Voici quelques-unes des caractéristiques des programmes de robots qui pourraient être différents des autres programmes de bureau :
tr_tr: WPILib, "Komut tabanlı programlama" adı verilen bir program yazma yöntemini destekler. Komut tabanlı programlama, robot programlarınızı düzenlemenize yardımcı olacak bir tasarım modelidir. Diğer masaüstü programlarından farklı olabilecek robot programlarının bazı özellikleri şunlardır:
zh_cn: WPILib支持一种称为“基于命令编程”的编写程序的方法。基于命令的编程是一种设计模式，可帮助您编写机器人程序。与其他桌面程序可能不同的此程序的一些特征是：

source: Activities happen over time, for example a sequence of steps to shoot a Frisbee or raise an elevator and place a tube on a goal.
es_mx: Las actividades suceden con el tiempo, por ejemplo, una secuencia de pasos para disparar un Frisbee o subir un elevador y colocar un tubo en una portería.
fr_ca: Les activités se produisent au fil du temps, par exemple une séquence d’étapes pour tirer un Frisbee ou faire monter un élevateur et placer un tube sur un but.
tr_tr: Aktiviteler zamanla gerçekleşir, örneğin bir Frizbi vurmak veya bir asansörü kaldırmak ve bir hedefe tüp yerleştirmek için bir dizi adım.
zh_cn: 动作会按照顺序发生，例如射击飞盘或举起升降架并将管子放在球门上的一系列步骤。

source: These activities occur concurrently, that is it might be desirable for an elevator, wrist and gripper to all be moving into a pickup position at the same time to increase robot performance.
es_mx: Estas actividades ocurren al mismo tiempo, es decir, podría ser deseable que un elevador, muñeca y pinza se muevan a una posición para recoger al mismo tiempo para aumentar el rendimiento del robot.
fr_ca: Ces activités se produisent simultanément, c’est-à-dire qu’il pourrait être souhaitable qu’un élevateur, un poignet et une pince se dirigent tous en même temps vers une position de ramassage afin d'augmenter les performances du robot.
tr_tr: Bu faaliyetler eşzamanlı olarak gerçekleşir, yani robot performansını artırmak için asansörün, bileğin ve kavrayıcının hepsinin aynı anda toplama konumuna hareket etmesi istenebilir.
zh_cn: 这些动作同时进行，这可能是因为让升降机、腕部和抓手都同时移动到拾取位置是提高机器人的性能的一种好方式。

source: It is desirable to test the robot mechanisms and activities each individually to help debug your robot.
es_mx: Es deseable probar los mecanismos y actividades del robot de forma individual para ayudar a depurar su robot.
fr_ca: Il est souhaitable de tester, chacun individuellement, les mécanismes et les activités de votre robot pour aider à le déboguer.
tr_tr: Robotunuzun hatalarını gidermeye yardımcı olmak için robot mekanizmalarını ve etkinliklerini ayrı ayrı test etmeniz istenir.
zh_cn: 可取的是分别测试机器人的机制和动作，以帮助调试机器人。

source: Often the program needs to be augmented with additional autonomous programs at the last minute, perhaps at competitions, so easily extendable code is important.
es_mx: A menudo, el programa debe ampliarse con programas autónomos adicionales en el último minuto, tal vez en competencias, por lo que es importante un código fácilmente extensible.
fr_ca: Souvent, le programme doit être enrichi avec l'ajout de programmes autonomes supplémentaires à la dernière minute, peut-être même lors de compétitions, donc avoir un code facilement extensible est un facteur important.
tr_tr: Çoğunlukla programın son dakikada, belki de yarışmalarda ek otonom programlarla güçlendirilmesi gerekir, bu nedenle kolayca genişletilebilir kod önemlidir.
zh_cn: 通常，比赛的最后一刻程序中也可能需要添加其他自动程序，因此易于扩展的代码很重要。

source: Command-based programming supports all these goals easily to make the robot program much simpler than using some less structured technique.
es_mx: La programación a base de comandos admite todos estos objetivos fácilmente para hacer que el programa del robot sea mucho más simple que al usar alguna técnica menos estructurada.
fr_ca: La programmation orientée commande remplit facilement tous ces objectifs pour rendre le programme du robot beaucoup plus simple que l’utilisation d'une technique moins structurée.
tr_tr: Komuta dayalı programlama, robot programını daha az yapılandırılmış bir teknik kullanmaktan çok daha basit hale getirmek için tüm bu hedefleri kolayca destekler.
zh_cn: 基于指令的编程可以轻松支持所有这些目标，从而使机器人程序比其他一些结构较松散的技术方式更加简单。

source: Commands and Subsystems
es_mx: Comandos y Subsistemas
fr_ca: Commandes et sous-systèmes
tr_tr: Commands ve Subsystems
zh_cn: 指令和子系统

source: Programs based on the WPILib Command Template are organized around two fundamental concepts: **Subsystems** and **Commands**.
es_mx: Los programas basados en la plantilla de comandos WPILib se organizan en torno a dos conceptos fundamentales: ** Subsistemas ** y ** Comandos **.
fr_ca: Les programmes conçus sur le modèle de commande WPILib sont organisés autour de deux concepts fondamentaux : **Subsystems** ou**Sous-systèmes** et **Commands** ou**Commandes**.
tr_tr: WPILib Komut Şablonunu temel alan programlar iki temel kavram etrafında düzenlenmiştir: **Subsystems** ve **Commands**.
zh_cn: 基于WPILib指令模板的程序是围绕两个基本概念组织的：子系统和指令。

source: **Subsystems** - define the capabilities of each part of the robot and are subclasses of Subsystem.
es_mx: ** Subsistemas **: define las capacidades de cada parte del robot y son subclases de Subsystem.
fr_ca: **Subsystems** - définissent les fonctionnalités de chaque partie du robot et sont des sous-classes de la classe Subsystem.
tr_tr: **Subsystems** - robotun her bir parçasının yeteneklerini tanımlar ve Sunsystem'in alt sınıflarıdır.
zh_cn: **子系统**-定义机器人各个部分的功能，并且是Subsystem的子类。

source: **Commands** - define the operation of the robot incorporating the capabilities defined in the subsystems. Commands are subclasses of Command or CommandGroup. Commands run when scheduled or in response to buttons being pressed or virtual buttons from the SmartDashboard.
es_mx: ** Comandos **: define el funcionamiento del robot incorporando las capacidades definidas en los subsistemas. Los comandos son subclases de Command o CommandGroup. Los comandos se ejecutan cuando están programados o en respuesta a botones que se presionan o botones virtuales del SmartDashboard.
fr_ca: **Commands** - définissent le fonctionnement du robot en intégrant les fonctionnalités définies dans les sous-systèmes. Les commandes sont des sous-classes de Command ou CommandGroup. Les commandes s’exécutent lorsqu'elles sont planifiés ou en réponse à des boutons appuyés ou aux boutons virtuels du SmartDashboard.
tr_tr: **Commands** - alt sistemlerde tanımlanan yetenekleri içeren robotun çalışmasını tanımlar. Komutlar, Command veya CommandGroup'un alt sınıflarıdır. Komutlar programlandığında veya basılmakta olan düğmelere veya SmartDashboard'daki sanal düğmelere yanıt olarak çalışır.
zh_cn: **指令**-结合子系统中定义的功能来定义机器人的操作。指令是Command或CommandGroup的子类。指令在计划时或响应于被按下的按钮与SmartDashboard中的虚拟按钮而运行。

source: How Commands Work
es_mx: Cómo funcionan los comandos
fr_ca: Comment fonctionnent des Commandes
tr_tr: Komutlar Nasıl Çalışır?
zh_cn: 指令如何工作

source: Commands let you break up the tasks of operating the robot into small chunks. Each command has an execute() method that does some work and an isFinished() method that tells if it is done. This happens on every update from the driver station or about every 20ms. Commands can be grouped together and executed sequentially, starting the next one in the group as the previous one finishes.
es_mx: Los comandos le permiten dividir las tareas de operar el robot en pequeños bloques. Cada comando tiene un método execute() que hace algún trabajo y un método isFinished() que establece si está hecho. Esto sucede en cada actualización de la driver station o aproximadamente cada 20 ms. Los comandos se pueden agrupar y ejecutar secuencialmente, comenzando el siguiente en el grupo a medida que termina el anterior.
fr_ca: Les commandes vous permettent de diviser en petits morceaux les tâches responsables de l’exploitation du robot. Chaque commande dispose d’une méthode ``execute()`` qui effectue un certain travail et d’une méthode ``isFinished()`` qui indique si elle est effectuée. Cela se produit sur chaque mise à jour de la Driver Station ou environ tous les 20ms. Les commandes peuvent être regroupées et exécutées séquentiellement, en commençant la suivante dans le groupe au fur et à mesure que l'exécution de la précédente se termine.
tr_tr: Komutlar, robotu çalıştırma görevlerini küçük parçalara ayırmanıza izin verir. Her komutun bazı işleri yapan bir execute() yöntemi ve tamamlandığını söyleyen bir isFinished() yöntemi vardır. Bu, sürücü istasyonundan yapılan her güncellemede veya yaklaşık her 20 ms'de bir gerçekleşir. Komutlar birlikte gruplanabilir ve sırayla çalıştırılabilir, gruptaki bir sonrakinden bir önceki biterken başlayabilir.
zh_cn: 指令使您可以将操作机器人的任务分解成小块。每个指令都有一个执行某些工作的execute（）方法和一个告诉它是否完成的isFinished（）方法。这在驱动程序站的每次更新中或大约每20ms发生一次。可以将指令组合在一起并顺序执行，在上一个指令完成时从该组中的下一个指令开始。

source: Concurrency
es_mx: Concurrencia
fr_ca: Concurrence
tr_tr: Eşzamanlılık
zh_cn: 并发

source: Sometimes it is desirable to have several operations happening concurrently. In the previous example you might want to set the wrist position while the elevator is moving up. In this case, a command group can start a parallel command (or command group) running.
es_mx: A veces se desea tener varias operaciones ejecutandose al mismo tiempo. En el ejemplo pasado usted podría querer configurar la posición de la muñeca mientras el elevador se mueve hacia arriba. En este caso, un grupo de comandos puede hacer que un comando paralelo ( o grupo de comandos) comience a ejecutarse.
fr_ca: Parfois, il est souhaitable que plusieurs opérations se déroulent simultanément. Dans l’exemple précédent, vous pouvez définir la position du poignet pendant que l’élevateur se déplace vers le haut. Dans ce cas, un groupe de commandes peut démarrer une commande parallèle (ou un groupe de commandes) en cours d’exécution.
tr_tr: Bazen aynı anda birden fazla operasyon yapılması arzu edilir. Önceki örnekte, asansör yukarı hareket ederken bilek pozisyonunu ayarlamak isteyebilirsiniz. Bu durumda, bir komut grubu çalışan bir paralel komutu (veya komut grubunu) başlatabilir.
zh_cn: 有时希望同时执行多个操作。在上一个示例中，您可能想在升降机向上移动时设置手腕位置。在这种情况下，命令组可以启动并行命令（或命令组）的运行。

source: How It Works - Scheduling Commands
es_mx: Cómo funciona: programación de comandos
fr_ca: Comment ça marche - Planification des commandes
tr_tr: Nasıl Çalışır - Scheduling-Zamanlama Komutları
zh_cn: 工作原理-调度指令

source: There are three main ways commands are scheduled:
es_mx: Hay tres formas principales de programar los comandos:
fr_ca: Il y a trois façons principales dont les commandes sont planifiées :
tr_tr: Komutların programlanmasının üç ana yolu vardır:
zh_cn: 有三种主要的指令调度方式：

source: Manually, by calling the ``start()`` method on the command (:doc:`used for autonomous <../commands/running-commands-autonomous>`)
es_mx: Manualmente, llamando al método `` start() '' en el comando (: doc: `usado para autónomo <../commands/running-commands-autonomous>`)
fr_ca: Manuellement, en appelant la méthode ``start()`` sur la commande (:doc:`used for autonomous <../commands/running-commands-autonomous>`)
tr_tr: Manuel olarak, komutta ``start()`` yöntemini çağırarak ( :doc:`otonom için kullanılır <../commands/running-commands-autonomous>`)
zh_cn: 通过在指令（：doc：`用于自主<../commands/running-commands-autonomous>`）上手动调用start（）方法

source: Automatically by the scheduler based on :doc:`button/trigger actions <../commands/running-commands-joystick-input>` specified in the code (typically defined in the OI class but checked by the Scheduler).
es_mx: Automáticamente por el scheduler o planificador basado en :doc:`button/trigger actions <../commands/running-commands-joystick-input>` especificadas en el código (normalmente definido en la clase OI pero verificado por el planificador).
fr_ca: Automatiquement par le scheduler ou planificateur basé sur :doc:`button/trigger actions <../commands/running-commands-joystick-input>` spécifié dans le code (généralement défini dans la classe OI mais validé par le planificateur).
tr_tr: Otomatik olarak programlayıcı tarafından aşağıdakilere dayalı olarak :doc:`düğme/tetik eylemleri<../commands/running-commands-joystick-input>` kodda belirtilir (tipik olarak OI sınıfında tanımlanır, ancak Zamanlayıcı-Scheduler tarafından kontrol edilir).
zh_cn: 由调度程序根据代码中指定的按钮/触发动作<../commands/running-commands-joystick-input>自动进行（通常在OI类中定义，但由调度程序检查）。

source: Automatically when a previous command completes (:doc:`default commands <../commands/default-commands>` and :doc:`command groups <../commands/creating-groups-commands>`).
es_mx: Automáticamente cuando se completa un comando anterior (: doc: `comandos predeterminados <../commands/default-commands>` y: doc: `grupos de comandos <../commands/creating-groups-commands>`).
fr_ca: Automatiquement lorsqu’une commande précédente se termine (:doc:`default commands <../commands/default-commands>` et :doc:`command groups <../commands/creating-groups-commands>`).
tr_tr: Bir önceki komut tamamlandığında otomatik olarak ( :doc:`varsayılan komutlar <../commands/default-commands>` ve :doc:`komut grupları <../commands/creating-groups-commands>`).
zh_cn: 上一条指令完成时自动完成（：doc：`default指令<../commands/default-commands>`和：doc：`指令组<../commands/creating-groups-commands>`）。

source: Each time the driver station gets new data, the periodic method of your robot program is called. It runs a Scheduler that checks the trigger conditions to see if any commands need to be scheduled or canceled.
es_mx: Cada vez que la driver station obtiene nuevos datos se llama al método periódico del programa de su robot. Ejecuta un Programador que verifica las condiciones de activación para ver si es necesario programar o cancelar algún comando.
fr_ca: Chaque fois que la station de conduite reçoit de nouvelles données, la méthode périodique de votre programme de robot est appelée. Il exécute un planificateur (Scheduler) qui vérifie les conditions de déclenchement pour voir si des commandes doivent être planifiées ou annulées.
tr_tr: Sürücü istasyonu her yeni veri aldığında, robot programınızın periyodik yöntemi çağrılır. Herhangi bir komutun programlanması veya iptal edilmesi gerekip gerekmediğini görmek için tetikleme koşullarını kontrol eden bir Zamanlayıcı çalıştırır.
zh_cn: 每次驾驶员站获取新数据时，都会调用机器人程序的定期方法。它运行计划程序，该程序检查触发条件以查看是否需要计划或取消任何指令。

source: When a command is scheduled, the Scheduler checks to make sure that no other commands are using the same subsystems that the new command requires. If one or more of the subsystems is currently in use, and the current command is interruptible, it will be interrupted and the new command will be scheduled. If the current command is not interruptible, the new command will fail to be scheduled.
es_mx: Cuando se programa un comando, el Programador verifica que ningún otro comando esté usando los mismos subsistemas que requiere el nuevo comando. Si uno o más de los subsistemas están actualmente en uso, y el comando actual es interrumpible, se interrumpirá y se programará el nuevo comando. Si el comando actual no se puede interrumpir, el nuevo comando no se programará.
fr_ca: Lorsqu’une commande est planifiée, le planificateur vérifie qu’aucune autre commande n’utilise les mêmes sous-systèmes que la nouvelle commande. Si un ou plusieurs sous-systèmes sont actuellement en service et que la commande actuelle est interrompue, elle sera interrompue et la nouvelle commande sera planifiée. Si la commande actuelle n’est pas interrompue, la nouvelle commande ne sera pas planifiée.
tr_tr: Bir komut zamanlandığında, Scheduler, başka hiçbir komutun yeni komutun gerektirdiği alt sistemleri kullanmadığından emin olmak için denetler. Alt sistemlerden biri veya daha fazlası şu anda kullanımdaysa ve mevcut komut kesintiye uğrayabilirse, kesintiye uğrayacak ve yeni komut programlanacaktır. Mevcut komut kesilebilir değilse, yeni komut programlanamaz.
zh_cn: 计划命令后，计划程序会检查以确保没有其他命令正在使用新命令所需的子系统。如果正在使用一个或多个子系统的命令是可中断的，其将被中断并计划新命令。如果当前命令不可中断，则新命令将无法计划。

source: How It Works - Running Commands
es_mx: Cómo funciona: ejecución de comandos
fr_ca: Comment ça marche - Exécution des commandes
tr_tr: Nasıl Çalışır - Komutları Çalıştırma
zh_cn: 工作原理-运行指令

source: After checking for new commands, the scheduler proceeds through the list of active commands and calls the ``execute()`` and ``isFinished()`` methods on each command. Notice that the apparent concurrent execution is done without the use of threads or tasks which would add complexity to the program. Each command simply has some code to execute (execute method) to move it further along towards its goal and a method (isFinished) that determines if the command has reached the goal. The execute and isFinished methods are just called repeatedly.
es_mx: Después de comprobar si hay nuevos comandos, el programador procede a través de la lista de comandos activos y llama a los métodos `` execute() '' e `` isFinished() '' en cada comando. Observe que la aparente ejecución concurrente se realiza sin el uso de subprocesos o tareas que agregarían complejidad al programa. Cada comando simplemente tiene algún código para ejecutar (método de ejecución) para avanzar más hacia su objetivo y un método (isFinished) que determina si el comando ha alcanzado el objetivo. Los métodos execute e isFinished simplemente son llamados repetidamente.
fr_ca: Après vérification des nouvelles commandes, le planificateur passe en revue la liste des commandes actives et appelle, sur chaque commande, les méthodes ``execute()`` et ``isFinished()``. Notez que l’exécution simultanée apparente se fait sans l’utilisation de threads ou de tâches qui ajouteraient de la complexité au programme. Chaque commande a simplement du code à exécuter (méthode ``execute()``) pour la déplacer plus loin vers son objectif et une méthode (``isFinished()``) qui détermine si la commande a atteint l’objectif. Les méthodes ``execute()`` et ``isFinished()`` sont simplement appelées à plusieurs reprises.
tr_tr: Yeni komutları kontrol ettikten sonra, zamanlayıcı, etkin komutlar listesinde ilerler ve her komutta ``execute()`` ve ``isFinished()`` yöntemlerini çağırır. Görünür eşzamanlı yürütmenin programa karmaşıklık katacak iş parçacıkları veya görevler kullanılmadan yapıldığına dikkat edin. Her komutun basitçe, onu hedefine doğru ilerletmek için yürütmek için bir kodu (yürütme yöntemi) ve komutun hedefe ulaşıp ulaşmadığını belirleyen bir yöntem (isFinished) vardır. Execute ve isFinished yöntemleri sadece tekrar tekrar çağrılır.
zh_cn: 在检查了新指令之后，计划程序会继续浏览活动指令列表，并在每个指令上调用execute（）和isFinished（）方法。注意，明显的并发执行是在不使用线程或任务的情况下完成的，而线程或任务会增加程序的复杂性。每个指令仅包含一些要执行的代码（execute方法）以向其目标更进一步，还有一个确定该指令是否已达到目标的方法（isFinished）。execute和isFinished方法会这样重复调用。

source: Command Groups
es_mx: Grupos de comandos
fr_ca: Groupes de commandes
tr_tr: Komut Grupları - Command Groups
zh_cn: 指令组
