Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/filters/introduction.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Introduction to Filters
es_mx: Introducción a los Filtros
fr_ca: Introduction aux filtres
tr_tr: Filtrelere Giriş
zh_cn: 过滤器简介

source: Filters are some of the most common tools used in modern technology, and find numerous applications in robotics in both signal processing and controls. Understanding the notion of a filter is crucial to understanding the utility of the various types of filters provided by WPILib.
es_mx: Los filtros son unas de las herramientas más usadas en la tecnología moderna y encontrados en numerosas aplicaciones en la robótica tanto en procesamiento de señal y controles. Comprender la noción de un filtro es crucial para entender la utilidad de varios tipos de filtro proporcionados por WPILib.
fr_ca: Les filtres sont parmi les outils les plus couramment utilisés dans la technologie moderne et trouvent de nombreuses applications en robotique à la fois dans le traitement du signal et dans les commandes. La compréhension de la notion de filtre est cruciale pour comprendre l'utilité des différents types de filtres fournis par WPILib.
tr_tr: Filtreler, modern teknolojide kullanılan en yaygın araçlardan bazılarıdır ve hem sinyal işlemede hem de kontrollerde robotikte çok sayıda uygulama bulur. Bir filtre kavramını anlamak, WPILib tarafından sağlanan çeşitli filtre türlerinin faydasını anlamak için çok önemlidir.
zh_cn: 滤波器是现代技术中最常用的工具之一，在机器人的信号处理和控制的中有广泛的应用。理解过滤器的概念对于理解WPILib提供的各种类型的过滤器的实用性至关重要。

source: What Is a Filter?
es_mx: ¿Qué es un filtro?
fr_ca: Qu'est-ce qu'un filtre?
tr_tr: Filtre Nedir?
zh_cn: 什么是滤波器？

source: For the sake of this article, we will assume all data are single-dimensional time-series data. Obviously, the concepts involved are more general than this - but a full/rigorous discussion of signals and filtering is out of the scope of this documentation.
es_mx: Por el bien de este artículo, asumiremos que toda la información es una serie de datos temporales unidimensionales. Obviamente, los conceptos involucrados son más generales que esto – pero una discusión más a detalle y rigurosa de señales y filtrado esta fuera del alcance de esta documentación.
fr_ca: Pour les besoins de cette section, nous supposerons que toutes les données sont des données chronologiques unidimensionnelles. De toute évidence, les concepts impliqués sont plus généraux que cela - mais une discussion complète et rigoureuse des signaux et du filtrage sort du cadre de cette documentation.
tr_tr: Bu makalenin iyiliği için, tüm verilerin tek boyutlu zaman serisi verileri olduğunu varsayacağız. Açıkçası, ilgili kavramlar bundan daha geneldir - ancak sinyallerin ve filtrelemenin tam / titiz bir tartışması bu belgenin kapsamı dışındadır.
zh_cn: 为了本文的方便，我们将假定所有数据均为一维的时间序列数据。显然，滤波器的概念并非仅仅如此，但对信号和滤波完整，严格的讨论超出了本文档的讨论。

source: So, what exactly *is* a filter, then? Simply put, a filter is a mapping from a stream of inputs to a stream of outputs. That is to say, the value output by a filter (in principle) can depend not only on the *current* value of the input, but on *the entire set of past and future values* (of course, in practice, the filters provided by WPILib are implementable in real-time on streaming data; accordingly, they can only depend on the *past* values of the input, and not on future values). This is an important concept, because generally we use filters to remove/mitigate unwanted *dynamics* from a signal. When we filter a signal, we're interested in modifying *how the signal changes over time*.
es_mx: Entonces, ¿qué *es* exactamente un filtro? Simple, un filtro es un mapeo de flujo de entradas a un flujo de salidas. Eso es decir, el valor de salida de un filtro (en principio) puede depender no solo del valor *actual* de la entrada, sino también *en todo el conjunto de valores pasados y futuros* (por supuesto, en práctica, los filtros provistos por WPILib son implementables en transmisión de datos en tiempo real; por consiguiente, solamente pueden depender de valores *pasados* de la entrada, y no en valores futuros). Esto es un concepto importante, debido a que generalmente usamos los filtros para remover o mitigar *dinámicas* no deseadas en la señal. Cuando filtramos una señal, estamos interesados en modificar *como cambia la señal conforme al tiempo*.
fr_ca: Alors, c'est quoi un filtre? D'une façon simple, un filtre est une modélisation d'un flux d'entrées à un flux de sorties. C'est-à-dire que la valeur de sortie émise par un filtre peut dépendre (en principe) non seulement de la valeur *actuelle* de l'entrée, mais de *l'ensemble des valeurs passées et futures* (en pratique, les filtres fournis par WPILib utilisent des données en temps réel, par conséquant ils ne peuvent traiter que des valeurs *passées* de l'entrée, et non des valeurs futures). C'est un concept important, car généralement nous utilisons des filtres pour supprimer / atténuer la *dynamique* indésirable d'un signal. Lorsque nous filtrons un signal, nous souhaitons modifier *la façon dont le signal change au fil du temps*.
tr_tr: Öyleyse, tam olarak filtre *nedir* ? Basitçe ifade etmek gerekirse, bir filtre, bir giriş akışından bir çıkış akışına eşlemedir. Diğer bir deyişle, bir filtreden (prensip olarak) çıkan değer, yalnızca girdinin *mevcut* değerine değil, aynı zamanda *tüm geçmiş ve gelecekteki değerler kümesine* (tabii ki pratikte filtreler, WPILib tarafından sağlananlar gerçek zamanlı olarak akış verilerinde uygulanabilir; buna göre, bunlar yalnızca girdinin *geçmiş* değerlerine bağlı olabilir ve gelecekteki değerlere bağlı değildir) bağlı olabilir. Bu önemli bir kavramdır, çünkü genellikle bir sinyalden istenmeyen *dinamikleri* kaldırmak / azaltmak için filtreler kullanırız. Bir sinyali filtrelediğimizde, *sinyalin zaman içinde nasıl değiştiğini* kontrol etmekle ilgileniyoruz.
zh_cn: 那么，什么才是过滤器呢？简而言之，过滤器是从输入流到输出流的映射。也就是说，过滤器输出的值（原则上）不仅可以取决于输入的当前值，还可以取决于过去和将来的值的整个集合（当然，实际上，WPILib提供的滤波器只能数据流上实时实现；因此，它们只能取决于过去的输入值，而不能取决于将来的值）。这是一个重要的概念，因为通常我们使用滤波器来去除或减轻信号中不需要的动态特性。当我们过滤信号时，我们要修改信号随时间的变化。

source: Effects of Using a Filter
es_mx: Efectos Usando un Filtro
fr_ca: Effets de l'utilisation d'un filtre
tr_tr: Filtre Kullanmanın Etkileri
zh_cn: 使用滤波器的效果

source: Noise Reduction
es_mx: Reducción de Ruido
fr_ca: Réduction du bruit
tr_tr: Gürültü Azaltma
zh_cn: 降噪

source: One of the most typical uses of a filter is for noise reduction. A filter that reduces noise is called a *low-pass* filter (because it allows low frequencies to "pass through," while blocking high-frequencies). Most of the filters currently included in WPILib are effectively low-pass filters.
es_mx: Uno de los usos más usuales de los filtros es para la reducción de ruido. Un filtro que reduce el ruido se llama filtro *paso bajo* (debido a que permite que frecuencias bajas "pasen a través" de él mientras bloquea las frecuencias altas). La mayoría de los filtros incluidos en WPILib son filtros efectivos de bajo paso.
fr_ca: L'une des utilisations les plus courantes d'un filtre est la réduction du bruit. Un filtre qui réduit le bruit est appelé filtre *passe-bas* (car il permet aux basses fréquences de «passer» tout en bloquant les hautes fréquences). La plupart des filtres actuellement inclus dans WPILib sont effectivement des filtres passe-bas.
tr_tr: Bir filtrenin en tipik kullanımlarından biri gürültüyü azaltmaktır. Gürültüyü azaltan bir filtreye *alçak-geçiren* filtre denir (çünkü yüksek frekansları bloke ederken düşük frekansların "geçmesine" izin verir). Şu anda WPILib'de bulunan filtrelerin çoğu, etkili bir şekilde alçak geçiren filtrelerdir.
zh_cn: 滤波器最典型的用途之一就是降低噪声。降低噪声的滤波器称为低通滤波器（因为它允许低频“通过”，并阻止高频）。当前WPILib中包含的大多数滤波器实际上都是低通滤波器。

source: Rate Limiting
es_mx: Limitación de velocidad
fr_ca: Limitation du débit
tr_tr: Oran Sınırlama
zh_cn: 速率限制

source: Filters are also commonly used to reduce the rate at which a signal can change. This is closely related to noise reduction, and filters that reduce noise also tend to limit the rate of change of their output.
es_mx: Los filtros también se usan comúnmente para reducir la velocidad a la cual una señal cambia. Esto está estrechamente relacionado con la reducción de ruido, y los filtros que reducen el ruido también tienden a limitar la velocidad de cambia de su salida.
fr_ca: Les filtres sont également utilisés pour réduire la vitesse à laquelle un signal peut changer. Ceci est étroitement lié à la réduction du bruit, et les filtres qui réduisent le bruit ont également une tendance à limiter le taux de variation de leur sortie.
tr_tr: Filtreler ayrıca bir sinyalin değişme hızını azaltmak için de yaygın olarak kullanılır. Bu, gürültünün azaltılmasıyla yakından ilgilidir ve gürültüyü azaltan filtreler de çıktılarının değişim oranını sınırlama eğilimindedir.
zh_cn: 滤波器通常也用于降低信号变化的速率。这与降噪密切相关，并且降低噪声的滤波器也往往会限制信号变化的速率。

source: Edge Detection
es_mx: Detección de Borde
fr_ca: Détection des transitions (Edge)
tr_tr: Kenar algılama
zh_cn: 边缘探测

source: The counterpart to the low-pass filter is the high-pass filter, which only permits high frequencies to pass through to the output. High-pass filters can be somewhat tricky to build intuition for, but a common usage for a high-pass filter is edge-detection - since high-pass filters will reflect sudden changes in the input while ignoring slower changes, they are useful for determining the location of sharp discontinuities in the signal.
es_mx: La contraparte del filtro paso bajo es el filtro paso alto, el cual solamente permite que altas frecuencias pasen a través hacia la salida. Los filtros de paso alto suelen ser complicados para ser intuitivos, pero un uso común para estos filtros es la detección de bordes - debido a que los filtros paso alto reflejarán cambios repentinos en la entrada mientras ignoran los cambios más lentos o sutiles, estos filtros son útiles para determinar la ubicación de discontinuidades agudas en la señal.
fr_ca: Le pendant du filtre passe-bas est le filtre passe-haut, qui ne laisse passer que les hautes fréquences vers la sortie. Les filtres passe-haut peuvent être quelque peu difficiles à saisir à prime abord, mais une utilisation courante pour un filtre passe-haut est la détection de transitions - puisque les filtres passe-haut refléteront les changements soudains dans l'entrée tout en ignorant les changements plus lents, ils sont utiles pour déterminer l'emplacement des discontinuités nettes dans le signal.
tr_tr: Alçak geçiren filtrenin karşılığı, yalnızca yüksek frekansların çıkışa geçmesine izin veren yüksek geçiren filtredir. Yüksek geçiren filtrelerin sezgileri oluşturmak için biraz zor olabilir, ancak yüksek geçiren bir filtrenin yaygın bir kullanımı kenar algılamadır - yüksek geçiren filtreler, daha yavaş değişiklikleri göz ardı ederken girdideki ani değişiklikleri yansıtacağından, sinyaldeki keskin süreksizliklerin yerini belirlemek için yararlıdırlar.
zh_cn: 与低通滤波器相对应的是高通滤波器，它只允许高频通过输出。高通滤波器很难用直觉理解, 但它被普遍用于边缘检测, 因为高通滤波器将反映输入的突然变化而忽略慢变化, 可以用于决定大幅不连续的信号。

source: Phase Lag
es_mx: Retraso de Fase
fr_ca: Décalage de phase
tr_tr: Faz gecikmesi
zh_cn: 相位滞后

source: An unavoidable negative effect of a real-time low-pass filter is the introduction of "phase lag." Since, as mentioned earlier, a real-time filter can only depend on past values of the signal (we cannot time-travel to obtain the future values), the filtered value takes some time to "catch up" when the input starts changing. The greater the noise-reduction, the greater the introduced delay. This is, in many ways, *the* fundamental trade-off of real-time filtering, and should be the primary driving factor of your filter design.
es_mx: Un efecto negativo inevitable de un filtro paso bajo en tiempo real es la generación del "retraso de fase". Como, se mencionó antes, un filtro en tiempo real depende solamente en valores pasados de la señal (no podemos viajar en el tiempo para obtener futuros valores), al valor filtrado a veces le toma un tiempo en "alcanzar" cuando la entrada comience a cambiar. A mayor reducción del ruido, se genera un mayor retraso. Esto es, en muchos sentidos, *la* compensación del filtrado en tiempo real y deberá ser el factor principal de su diseño del filtro.
fr_ca: Un effet négatif inévitable d'un filtre passe-bas en temps réel est l'introduction du «retard de phase». Comme mentionné précédemment, un filtre en temps réel ne peut dépendre que des valeurs passées du signal (nous ne pouvons pas voyager dans le temps pour obtenir les valeurs futures), la valeur filtrée prend un certain retard sur la valeur de l'entrée, lorsque cette dernière commence à changer. Plus la réduction du bruit est importante, plus le retard introduit est important. C'est, à bien des égards, *le* compromis fondamental du filtrage en temps réel, et cela devrait être le principal facteur déterminant de la conception de votre filtre.
tr_tr: Gerçek zamanlı bir düşük geçiş filtresinin kaçınılmaz bir olumsuz etkisi, "faz gecikmesi" nin ortaya çıkmasıdır. Daha önce belirtildiği gibi, gerçek zamanlı bir filtre yalnızca sinyalin geçmiş değerlerine bağlı olabileceğinden (gelecekteki değerleri elde etmek için zamanda yolculuk yapamayız), filtrelenen değerin giriş değişmeye başladığında "yakalanması" biraz zaman alır. Gürültü azaltma ne kadar büyükse, eklenen gecikme o kadar büyük olur. Bu, birçok yönden, gerçek zamanlı filtrelemenin *temel* tan etkisidir ve filtre tasarımınızın birincil itici faktörü olmalıdır.
zh_cn: 实时低通滤波器不可避免的一个负面影响是“相位滞后”的引入。正如前面提到的，实时滤波器只能依赖于信号的过去值(我们不能通过时间旅行来获得未来值)，因此当输入开始变化时，滤波后的值需要一段时间才能“赶上”。降噪越大，引入的延迟就越大。在许多方面，这是实时过滤基本的权衡，并且应该是您的过滤器设计的主要考虑因素。

source: Interestingly, high-pass filters introduce a phase *lead*, as opposed to a phase lag, as they exacerbate local changes to the value of the input.
es_mx: De manera interesante, los filtros paso alto generan un *adelanto* de fase, opuesto al retraso de fase ya que exacerban los cambios locales en el valor de entrada.
fr_ca: Fait intéressant, les filtres passe-haut introduisent une *avance* de phase, plutôt qu'un retard de phase, car ils aggravent les changements locaux de la valeur de l'entrée.
tr_tr: İlginç bir şekilde, yüksek geçişli filtreler, giriş değerindeki yerel değişiklikleri şiddetlendirdiklerinden, bir faz gecikmesinin aksine bir faz *öncüsü* sunar.
zh_cn: 有趣的是，高通滤波器引入了相位超前，而不是相位滞后，因为它们加剧了输入值的局部变化。
