Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/filters/linear-filter.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Once your filter has been created, using it is easy - simply call the ``calculate()`` method with the most recent input to obtain the filtered output:
es_mx: Una vez que su filtro sea creado, usarlo es fácil – solamente llame el método ``calculate()`` con la entrada más reciente para obtener la salida filtrada.
fr_ca: Une fois votre filtre créé, son utilisation est simple - il suffit d'appeler la méthode ``calculate()`` avec l'entrée la plus récente pour obtenir la sortie filtrée:
tr_tr: Filtreniz oluşturulduktan sonra kullanımı kolaydır - filtrelenmiş çıktıyı elde etmek için en son girdiyle ``calculate()`` yöntemini çağırmanız yeterlidir:
zh_cn: 创建过滤器后，使用起来很容易-只需使用最新输入调用calculate（）方法即可获取过滤后的输出：

source: Linear filters are supported in WPILib through the ``LinearFilter`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/LinearFilter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1LinearFilter.html>`__).
tr_tr: Doğrusal filtreler, WPILib'de ``LinearFilter`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/LinearFilter.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1LinearFilter.html>` __) aracılığıyla desteklenir.
