Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/filters/linear-filter.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Linear Filters
es_mx: Filtros Lineales
fr_ca: Filtres linéaires
tr_tr: Doğrusal Filtreler
zh_cn: 线性滤波器

source: The first (and most commonly-employed) sort of filter that WPILib supports is a *linear filter* - or, more specifically, a linear time-invariant (LTI) filter.
es_mx: El primer tipo (y más comúnmente empleado) de filtros que WPILib admite es el filtro lineal o, más específicamente un filtro lineal invariante en el tiempo (LTI).
fr_ca: Le premier type de filtre (et le plus couramment utilisé) supporté par WPILib est un *filtre linéaire* - ou, plus précisément, un filtre linéaire invariable dans le temps (LTI).
tr_tr: WPILib'in desteklediği ilk (ve en yaygın kullanılan) filtre türü, *doğrusal bir filtre* veya daha spesifik olarak, doğrusal zamanla değişmeyen-linear time-invariant (LTI) filtredir.
zh_cn: WPILib支持的第一种(也是最常用的)过滤器是线性过滤器，或者更具体地说，线性定常(LTI)过滤器。

source: An LTI filter is, put simply, a weighted moving average - the value of the output stream at any given time is a localized, weighted average of the inputs near that time. The difference between different types of LTI filters is thus reducible to the difference in the choice of the weighting function (also known as a "window function" or an "impulse response") used. Mathematically, this kind of moving average is known as a `convolution <https://en.wikipedia.org/wiki/Convolution>`__.
es_mx: Un filtro LTI, básicamente, una media móvil ponderada – el valor del flujo de salida en un momento dado es localizado, un promedio ponderado de las entradas cercanas a ese momento. La diferencia entre los diferentes tipos de filtros LTI es, reducible a la diferencia en la elección de la función ponderada (también conocida como “función de ventana” o “respuesta de impulso”) usada. Matemáticamente, este tipo de media móvil es conocida como una `circunvolución <https://en.wikipedia.org/wiki/Convolution>`__.
fr_ca: Un filtre LTI est, en termes simples, une moyenne mobile pondérée - la valeur du flux de sortie à un moment donné est une moyenne localisée et pondérée des entrées près de ce moment. La différence entre les différents types de filtres LTI est se ramène au choix de la fonction de pondération (également appelée "fonction fenêtre" ou "réponse impulsionnelle") utilisée. Mathématiquement, ce type de moyenne mobile est connu sous le nom de `convolution <https://en.wikipedia.org/wiki/Convolution>`__.
tr_tr: Basitçe ifade etmek gerekirse, LTI filtresi ağırlıklı hareketli ortalamadır - herhangi bir zamanda çıktı akışının değeri, o zamana yakın girdilerin yerelleştirilmiş, ağırlıklı ortalamasıdır. Farklı tipte LTI filtreleri arasındaki fark, bu nedenle kullanılan ağırlıklandırma fonksiyonunun (aynı zamanda bir "pencere fonksiyonu" veya "dürtü tepkisi" olarak da bilinir) seçimindeki farka indirgenebilir. Matematiksel olarak, bu tür hareketli ortalama, `evrişim <https://en.wikipedia.org/wiki/Convolution>`__ olarak bilinir.
zh_cn: 简单地说，LTI滤波器是一个加权移动平均值——输出流在任何给定时间的值是在该时间附近输入的局部加权平均值。因此，不同类型LTI滤波器之间的差异可简化为使用的加权函数(也称为“窗口函数”或“脉冲响应”)选择上的差异。在数学上，这种移动平均线被称为卷积。`convolution <https://en.wikipedia.org/wiki/Convolution>`__.

source: There are two broad "sorts" of impulse responses: infinite impulse responses (IIR), and finite impulse responses (FIR).
es_mx: Hay dos amplios tipos de respuestas de impulso: respuesta infinita de impulsos (IIR) y respuesta finita de impulsos (FIR).
fr_ca: Il existe deux grandes "catégories" de réponses impulsionnelles: les réponses impulsionnelles infinies (IIR) et les réponses impulsionnelles finies (FIR).
tr_tr: impuls yanıtlarının iki geniş "sorts-türü" vardır: sonsuz dürtü yanıtları (IIR) ve sonlu dürtü yanıtları (FIR).
zh_cn: 有两种广义的脉冲响应:无限脉冲响应(IIR)和有限脉冲响应(FIR)。

source: Infinite impulse responses have infinite "support" - that is, they are nonzero over an infinitely-large region. This means, broadly, that they also have infinite "memory" - once a value appears in the input stream, it will influence *all subsequent outputs, forever*. This is typically undesirable from a strict signal-processing perspective, however filters with infinite impulse responses tend to be very easy to compute as they can be expressed by simple recursion relations.
es_mx: Las respuestas infinitas de impulsos tiene un "apoyo" infinito - esto es, ellas son distintas a cero en una región infinitamente grande. Esto significa, que también tienen "memoria" infinita – cuando un valor aparece en el flujo de entrada este influirá en todas las salidas subsecuentes, *para siempre*. Esto es típicamente indeseable desde una perspectiva estricta de procesamiento de señales, sin embargo los filtros con respuestas infinitas de impulsos tienden calcularse fácilmente, ya que se pueden expresar mediante relaciones de recursión simples.
fr_ca: Les réponses impulsionnelles infinies ont un "support" infini - c'est-à-dire qu'elles sont toutes non-égales à zéro sur une région infiniment grande. Cela signifie, en gros, qu'elles ont également une "mémoire" infinie - une fois qu'une valeur apparaît dans le flux d'entrée, elle influencera *toutes les sorties suivantes, pour toujours*. Ceci est généralement indésirable du point de vue strict du traitement du signal, cependant les filtres avec des réponses impulsionnelles infinies ont tendance à être très faciles à réaliser car ils peuvent être exprimés par de simples relations de récursivité.
tr_tr: Sonsuz dürtü tepkilerinin sonsuz "desteği" vardır - yani, sonsuz büyüklükte bir bölgede sıfırdan farklıdırlar. Bu, genel olarak, sonsuz "hafızaya" sahip oldukları anlamına gelir - giriş akışında bir değer göründüğünde, *sonraki tüm çıktıları sonsuza kadar* etkileyecektir. Bu, katı bir sinyal işleme perspektifinden tipik olarak istenmeyen bir durumdur, ancak sonsuz dürtü yanıtlarına sahip filtrelerin, basit özyineleme ilişkileri ile ifade edilebildikleri için hesaplanması çok kolay olma eğilimindedir.
zh_cn: 无限脉冲响应具有无限的“支持”——也就是说，它们在一个无穷大的区域上是非零的。广义上来说，这意味着它们也有无限的“内存”——一旦一个值出现在输入流中，它将永远影响所有后续输出。从严格的信号处理角度来看，这通常是不希望看到的，但是具有无限脉冲响应的滤波器往往非常容易计算，因为它们可以用简单的递归关系来表示。

source: Finite impulse responses have finite "support" - that is, they are nonzero on a bounded region. The "archetypical" FIR filter is a flat moving average - that is, simply setting the output equal to the average of the past n inputs. FIR filters tend to have more-desirable properties than IIR filters, but are more costly to compute.
es_mx: Las respuestas finitas de impulsos tiene un "apoyo" finito – es decir, las respuestas son distintas a cero en una región definida. El "arquetipo" del filtro FIR es un promedio móvil plano – es decir, configurando la salida igual al promedio de n entradas pasadas. Los filtros FIR tienden a tener propiedades más deseadas que los filtros IIR, pero son más complicados para calcular.
fr_ca: Les réponses impulsionnelles finies ont un "support" fini - c'est-à-dire qu'elles sont non-égales à zéro sur une région limitée. Le filtre FIR "typique " est une moyenne mobile plate - c'est-à-dire qu'il suffit de régler la sortie égale à la moyenne des n dernières entrées. Les filtres FIR ont tendance à avoir des propriétés plus souhaitables que les filtres IIR, mais leur calcul est plus long.
tr_tr: Sonlu dürtü yanıtlarının sonlu "desteği" vardır - yani, sınırlı bir bölgede sıfırdan farklıdırlar. "Arketipik" FIR filtresi düz hareketli bir ortalamadır - yani, basitçe çıktıyı son n girdinin ortalamasına eşit olarak ayarlamaktır. FIR filtreleri, IIR filtrelerinden daha çok istenen özelliklere sahip olma eğilimindedir, ancak hesaplamaları daha maliyetlidir.
zh_cn: 有限冲激响应具有有限的“支持”-也就是说，它们在有界区域上不为零。 “典型” FIR滤波器是一个固定的移动平均值-也就是说，只需将输出设置为等于过去n个输入的平均值即可。 FIR滤波器往往比IIR滤波器具有更理想的属性，但计算成本更高。

source: Linear filters are supported in WPILib through the ``LinearFilter`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/filter/LinearFilter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_linear_filter.html>`__).
fr_ca: Les filtres linéaires sont pris en charge par la WPILIb à via la classe ``LinearFilter`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/filter/LinearFilter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_linear_filter.html>`__).

source: Creating a LinearFilter
es_mx: Crear un Filtro Lineal
fr_ca: Création d'un LinearFilter
tr_tr: LinearFilter - Doğrusal Filtre Oluşturma
zh_cn: 创建一个LinearFilter

source: The C++ ``LinearFilter`` class is templated on the data type used for the input.
es_mx: La clase C++ ``LinearFilter`` se basa en el tipo de información usada en el entrada.
fr_ca: La classe C ++ ``LinearFilter`` est basée sur le type de données utilisé pour l'entrée.
tr_tr: C ++ ``LinearFilter`` sınıfı, girdi için kullanılan veri türüne göre şablonlanır.
zh_cn: c++``LinearFilter``类被模板化为用于输入的数据类型。

source: Because filters have "memory", each input stream requires its own filter object. Do *not* attempt to use the same filter object for multiple input streams.
es_mx: Debido a que los filtros tienen "memoria", cada flujo de entrada requiere su propio objeto de filtro. No intente usar el mismo objeto de filtro para múltiples flujos de entradas.
fr_ca: Étant donné que les filtres ont une «mémoire», chaque flux d'entrée nécessite son propre objet filtre. N'essayez *pas* d'utiliser le même objet de filtre pour plusieurs flux d'entrée.
tr_tr: Filtrelerin "belleği" olduğundan, her giriş akışı kendi filtre nesnesini gerektirir. Birden çok giriş akışı için aynı filtre nesnesini kullanmaya * çalışmayın *.
zh_cn: 因为过滤器有“内存”，所以每个输入流都需要它自己的过滤器对象。不要尝试对多个输入流使用相同的过滤器对象。

source: While it is possible to directly instantiate ``LinearFilter`` class to build a custom filter, it is far more convenient (and common) to use one of the supplied factory methods, instead:
es_mx: Mientras sea posible instanciar directamente la clase ``LinearFilter`` para construir un filtro personalizado, es mucho más conveniente (y común) usar uno de los Factory methods suministrados, en su lugar:
fr_ca: Bien qu'il soit possible d'instancier directement la classe ``LinearFilter`` pour créer un filtre personnalisé, il est beaucoup plus pratique (et courant) d'utiliser l'une des méthodes fournies dans WPIlib, à la place:
tr_tr: Özel bir filtre oluşturmak için `` LinearFilter '' sınıfını doğrudan somutlaştırmak mümkün olsa da, bunun yerine sağlanan fabrika yöntemlerinden birini kullanmak çok daha uygundur (ve yaygındır):
zh_cn: 虽然可以直接实例化“ LinearFilter”类以构建自定义过滤器，但使用提供的工厂模式之一要方便得多（并且更常见），而不是：

source: singlePoleIIR
fr_ca: Filtre singlePoleIIR
tr_tr: singlePoleIIR - tek Kutuplu IIR
zh_cn: 单极IIR

source: A graph with two peaks with the input closely following the target signal.
fr_ca: Un graphique avec deux pics avec l’entrée suivant de près le signal cible.

source: The ``singlePoleIIR()`` factory method creates a single-pole infinite impulse response filter (also known as `exponential smoothing <https://en.wikipedia.org/wiki/Exponential_smoothing>`__, on account of having an exponential impulse response). This is the "go-to," "first-try" low-pass filter in most applications; it is computationally trivial and works in most cases.
es_mx: El método de fábrica ``singlePoleIIR()`` crea un filtro monopolar de respuesta infinitas de impulsos (también conocido como `exponential smoothing <https://en.wikipedia.org/wiki/Exponential_smoothing>`__, teniendo en cuenta la respuesta de impulso exponencial). Este es el "para partir", "primer intento" en la mayoría de aplicaciones de filtro bajo paso; es computacionalmente trivial y trabaja en la mayoría de los casos.
fr_ca: La méthode ``singlePoleIIR ()`` crée un filtre de réponse impulsionnelle infinie unipolaire (également connu sous le nom de `lissage exponentiel <https://en.wikipedia.org/wiki/Exponential_smoothing>`__, en raison de sa réponse exponentielle à une impulsion). Il s'agit du filtre passe-bas "de premier choix" dans la plupart des applications; il est facile à réaliser et fonctionne dans la plupart des cas.
tr_tr: `` SinglePoleIIR () '' fabrika yöntemi, tek kutuplu bir sonsuz dürtü yanıtı filtresi oluşturur (üstel bir dürtü tepkisine sahip olduğu için `` üstel yumuşatma <https://en.wikipedia.org/wiki/Exponential_smoothing>`__, olarak da bilinir). Bu, çoğu uygulamada "go-to, gitme", " first-try, ilk deneme" düşük geçiş filtresidir; sayısal olarak önemsizdir ve çoğu durumda işe yarar.
zh_cn: singlePoleIIR（）工厂模式创建一个单极无限冲激响应滤波器（由于具有指数冲激响应，因此也称为“指数平滑 `exponential smoothing <https://en.wikipedia.org/wiki/Exponential_smoothing>`__,）。在大多数应用中，这是“首选”，“初试”低通滤波器。它在计算上是微不足道的，并且在大多数情况下都可以使用。

source: The "time constant" parameter determines the "characteristic timescale" of the filter's impulse response; the filter will cancel out any signal dynamics that occur on timescales significantly shorter than this. Relatedly, it is also the approximate timescale of the introduced :ref:`phase lag <docs/software/advanced-controls/filters/introduction:Phase Lag>`. The reciprocal of this timescale, multiplied by 2 pi, is the "cutoff frequency" of the filter.
es_mx: El parámetro de la "constante de tiempo" determina la "escala de tiempo característica" del impulso de respuesta del filtro; el filtro cancelará cualquier dinámica que ocurra en la escala de tiempo significativamente menor que esto. Relacionada, también está la escala de tiempo aproximada de la introducción del :ref:`phase lag <docs/software/advanced-controls/filters/introduction:Phase Lag>`. El recíproco de esta escala de tiempo, multiplicado por 2 pi, es la "frecuencia de corte" del filtro.
fr_ca: Le paramètre "time constant" détermine "l'échelle de temps caractéristique" de la réponse impulsionnelle du filtre; le filtre annulera toute dynamique de signal se produisant sur des échelles de temps significativement plus courtes que définie par ce paramètre. De même, c'est aussi l'échelle de temps approximative du :ref:`retard de phase <docs/software/advanced-controls/filters/introduction:Phase Lag>` généré. L'inverse de cette échelle de temps, multiplié par 2 pi, est la "fréquence de coupure" du filtre.
tr_tr: " time constant- zaman sabiti" parametresi, filtrenin dürtü yanıtının "karakteristik zaman ölçeğini" belirler; filtre, bundan önemli ölçüde daha kısa zaman ölçeklerinde meydana gelen sinyal dinamiklerini iptal edecektir. Benzer şekilde, aynı zamanda tanıtılan yaklaşık zaman ölçeğidir: ref: "faz gecikmesi <docs/software/advanced-controls/filters/introduction:Phase Lag>". 2 pi ile çarpılan bu zaman ölçeğinin tersi, filtrenin "cutoff frequency-kesme frekansı" dır.
zh_cn: 参数“时间常数”决定了滤波器的脉冲响应的“特征时间尺度”。滤波器将抵消在明显短于此的时间范围内发生的任何信号动态。相关地，它也是引入的相位滞后:ref:`phase lag <docs/software/advanced-controls/filters/introduction:Phase Lag>`的近似时间尺度 。该时间标度的倒数乘以2，即为滤波器的“截止频率”。

source: The "period" parameter is the period at which the filter's ``calculate()`` method will be called. For the vast majority of implementations, this will be the standard main robot loop period of 0.02 seconds.
es_mx: El parámetro "periodo" es el periodo en el cual el método ``calculate()`` del filtro será llamado. Para la mayoría de las implementaciones, esto será el periodo cíclico estándar de 0.02 segundos del main robot.
fr_ca: Le paramètre "période" est la période de temps entre les appels successifs de la méthode ``calculate()`` propre au filtre. Pour la grande majorité des implémentations, ce sera la période standard de boucle du robot principal, soit 20 mSec.
tr_tr: " period - dönem" parametresi, filtrenin ``calculate() `` yönteminin çağrılacağı dönemdir. Uygulamaların büyük çoğunluğu için bu, 0,02 saniyelik standart ana robot döngüsü süresi olacaktır. -
zh_cn: 参数“ period”是过滤器的calculate（）方法将被调用的时间段。对于绝大多数实施方式，这将是0.02秒的标准主机器人循环周期。

source: movingAverage
es_mx: Media Móvil
fr_ca: Filtre à moyenne mobile (movingAverage)
tr_tr: movingAverage - hareketliOrtalama
zh_cn: 移动平均值

source: The ``movingAverage`` factory method creates a simple flat moving average filter. This is the simplest possible low-pass FIR filter, and is useful in many of the same contexts as the single-pole IIR filter. It is somewhat more costly to compute, but generally behaves in a somewhat nicer manner.
es_mx: El método de fabrica de ``media móvil`` crea un filtro simple de media móvil plana. Este es el filtro paso bajo FIR más simple, y es útil en muchos contextos iguales como los filtros monopolar IIR. Es un poco más complicado de calcular, pero generalmente se comporta de una manera más suave.
fr_ca: La méthode ``movingAverage`` crée un simple filtre à moyenne mobile. Il s'agit du filtre FIR passe-bas le plus simple possible et il est utile dans bon nombre des mêmes contextes que le filtre IIR unipolaire. Il est un peu plus long à calculer, mais se comporte généralement de manière un peu plus agréable.
tr_tr: ``movingAverage`` fabrika yöntemi, basit bir düz hareketli ortalama filtre oluşturur. Bu, mümkün olan en basit düşük geçişli FIR filtresidir ve tek kutuplu IIR filtresiyle aynı bağlamların çoğunda kullanışlıdır. Hesaplamak biraz daha maliyetlidir, ancak genellikle biraz daha hoş bir şekilde davranır.
zh_cn: ``movingAverage''工厂模式创建一个简单的平面移动平均滤波器。这是最简单的低通FIR滤波器，在许多与单极IIR滤波器相同的环境中很有用。它的计算成本较高，但通常表现得更好。

source: The "taps" parameter is the number of samples that will be included in the flat moving average. This behaves similarly to the "time constant" above - the effective time constant is the number of taps times the period at which ``calculate()`` is called.
es_mx: El parámetro "taps" es el nombre de ejemplos que serán incluidos en la media móvil plana. Esto se comporta similarmente a la "constante de tiempo" anterior – se le llama constante de tiempo efectiva al número de fases de tiempo multiplicado por el periodo en cual ``calculate()`` es llamado.
fr_ca: Le paramètre "taps" est le nombre d'échantillons qui seront inclus dans la moyenne mobile. Cela se comporte de manière similaire au paramètre "time constant" ci-dessus - la constante de temps effective est le nombre d'échantillons multiplié par la période à laquelle ``calculate()`` est appelé (typiquement 20mSec).
tr_tr: "taps- vuruşlar" parametresi, düz hareketli ortalamaya dahil edilecek örneklerin sayısıdır. Bu, yukarıdaki "time constant-zaman sabiti" ne benzer şekilde davranır - etkin zaman sabiti, dokunma sayısı çarpı ``calculate()`` çağrısının yapıldığı sürenin sayısıdır.
zh_cn: “抽头”参数是将包含在固定移动平均值中的样本数。这与上面的“时间常数”类似-有效时间常数是抽头数乘以调用calculate（）的时间段。

source: highPass
fr_ca: Filter passe-haut (highPass)
tr_tr: highPass-yüksekGeçiş
zh_cn: 高通

source: A graph with two peaks except the highpass only shows the rate of change centered around 0.
fr_ca: Un graphique comportant deux pics excepté que le filtrage passe haut montre uniquement le taux de changement centré autour de 0.

source: The ``highPass`` factory method creates a simple first-order infinite impulse response high-pass filter. This is the "counterpart" to the `singlePoleIIR`_.
es_mx: El método de fábrica ``highPass`` crea un filtro simple de respuesta de impulso infinita de primer orden. Esto es la "contraparte" del IIR monopolar.
fr_ca: La méthode ``highPass`` crée un simple filtre passe-haut à réponse impulsionnelle infinie de premier ordre. C'est le "pendant" du `singlePoleIIR`_.
tr_tr: ``highPass-yüksekGeçiş`` fabrika yöntemi, basit bir birinci dereceden sonsuz dürtü tepkisi yüksek geçiren filtre oluşturur. Bu, "singlePoleIIR" nin "karşılığıdır".
zh_cn: highPass工厂模式创建一个简单的一阶无限冲激响应高通滤波器。这是“ singlePoleIIR” _的“对手”。

source: The "time constant" parameter determines the "characteristic timescale" of the filter's impulse response; the filter will cancel out any signal dynamics that occur on timescales significantly longer than this. Relatedly, it is also the approximate timescale of the introduced :ref:`phase lead <docs/software/advanced-controls/filters/introduction:Phase lag>`. The reciprocal of this timescale, multiplied by 2 pi, is the "cutoff frequency" of the filter.
es_mx: El parámetro de la "constante de tiempo" determina la "escala de tiempo característica" de la respuesta del impulso del filtro; el filtro cancelará cualquier dinámica de la señal que ocurra en la escala de tiempo significativamente más larga que esta. Relacionado, esta también es la escala de tiempo aproximada del :ref:`phase lead <docs/software/advanced-controls/filters/introduction:Phase lag>` introducida. El recíproco de esta escala de tiempo, multiplicado por 2 pi, es la "frecuencia de corte" del filtro.
fr_ca: Le paramètre "time constant" détermine "l'échelle de temps caractéristique" de la réponse impulsionnelle du filtre; le filtre annulera toute dynamique de signal qui se produit sur des échelles de temps beaucoup plus longues que définie par ce paramètre. De même, il s'agit également de la durée approximative de :ref:`l'avance de phase <docs/software/advanced-controls/filters/introduction:Phase lag>` généré. L'inverse de cette échelle de temps, multiplié par 2 pi, est la "fréquence de coupure" du filtre.
tr_tr: "time constant-zaman sabiti" parametresi, filtrenin dürtü yanıtının "characteristic timescale-karakteristik zaman ölçeğini" belirler; filtre, bundan önemli ölçüde daha uzun zaman ölçeklerinde meydana gelen sinyal dinamiklerini iptal edecektir. Benzer şekilde, bu aynı zamanda tanıtılan yaklaşık zaman ölçeğidir: ref: "faz kurşun <docs/software/advanced-controls/filters/introduction:Phase lag>". 2 pi ile çarpılan bu zaman ölçeğinin tersi, filtrenin " cutoff frequency-kesme frekansı" dır.
zh_cn: “时间常数”参数确定了滤波器的脉冲响应的“特征时间尺度”； 滤波器将消除在时间尺度上明显长于此的任何信号动态。相关地，它也是引入的相位超前 :ref:`phase lead <docs/software/advanced-controls/filters/introduction:Phase lag>`. 的近似时间表。该时间刻度的倒数乘以2 ，即为滤波器的“截止频率”

source: Using a LinearFilter
es_mx: Usando un filtro Lineal
fr_ca: Utilisation d'un LinearFilter
tr_tr: LinearFilter kullanma
zh_cn: 使用LinearFilter

source: In order for the created filter to obey the specified timescale parameter, its ``calculate()`` function *must* be called regularly at the specified period. If, for some reason, a significant lapse in ``calculate()`` calls must occur, the filter's ``reset()`` method should be called before further use.
es_mx: En orden para que el filtro creado obedezca el parámetro de tiempo de escala especificado, la función ``calculate()`` deberá ser llamada constantemente en el periodo especificado. Si, por alguna razón, un lapso significante en ``calculate()`` debe ocurrir, el método de ``reset()`` del filtro deberá ser llamado antes para su uso futuro.
fr_ca: Pour que le filtre créé obéisse au paramètre d'échelle de temps spécifié, et fonctionne correctement, sa fonction ``calculate()`` *doit* être appelée régulièrement à la période spécifiée. Si, pour une raison quelconque, une interruption significative des appels ``calculate()`` doit se produire, la méthode ``reset()`` du filtre doit être appelée avant de réutiliser le filtre.
tr_tr: Oluşturulan filtrenin belirtilen zaman ölçeği parametresine uyması için, `` calculate () '' işlevinin * belirtilen sürede düzenli olarak çağrılması gerekir *. Herhangi bir nedenle `` hesapla () '' çağrılarında önemli bir hata olması gerekiyorsa, filtrenin `` reset () '' yöntemi daha fazla kullanılmadan önce çağrılmalıdır.
zh_cn: 为了使创建的过滤器服从指定的时标参数，必须在指定时间段定期调用其calculate（）函数*。如果由于某种原因，必须在calculate（）调用中发生重大失误，则应在进一步使用之前调用过滤器的reset（）方法。
