Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/filters/median-filter.po
Languages: fr_ca, tr_tr, zh_cn

source: Median Filter
fr_ca: Filtre médian
tr_tr: Median Filtresi
zh_cn: 中值过滤器

source: A graph with two peaks with the input closely following the target signal.
fr_ca: Un graphique avec deux pics avec l’entrée suivant de près le signal cible.

source: A `robust <https://en.wikipedia.org/wiki/Robust_statistics>`__ alternative to the :ref:`moving-average filter <docs/software/advanced-controls/filters/linear-filter:movingAverage>` is the *median filter*. Where a moving average filter takes the arithmetic *mean* of the input over a moving sample window, a median filter (per the name) takes a median instead.
fr_ca: Une alternative `robuste à <https://en.wikipedia.org/wiki/Robust_statistics>`__ au :ref:`filtre à moyenne mobile <docs/software/advanced-controls/filters/linear-filter:movingAverage>` est le *filtre médian*. Lorsqu'un filtre à moyenne mobile prend la moyenne arithmétique de l'entrée sur une fenêtre d'échantillonnage mobile, un filtre médian (selon le nom) est alors crée.
tr_tr: `Güçlü <https://en.wikipedia.org/wiki/Robust_statistics>`__ bir alternatif :ref:`moving-average filter <docs/software/advanced-controls/filters/linear-filter:movingAverage>` *median filtresi* dir. Hareketli bir ortalama filtresinin, girdinin aritmetik *ortalamasını* hareketli bir örnek penceresi üzerinden aldığı durumlarda, bir median filtresi (ad başına) bunun yerine bir median alır.
zh_cn: 移动平均滤波器 :ref:`moving-average filter <docs/software/advanced-controls/filters/linear-filter:movingAverage>` 的一个粗略的 `robust <https://en.wikipedia.org/wiki/Robust_statistics>`__ 替代方法是中值滤波器。移动平均过滤器在移动样本窗口上取输入的算术平均值，而中值过滤器(按名字)取中值。

source: The median filter is most-useful for removing occasional outliers from an input stream. This makes it particularly well-suited to filtering inputs from distance sensors, which are prone to occasional interference. Unlike a moving average, the median filter will remain completely unaffected by small numbers of outliers, no matter how extreme.
fr_ca: Le filtre médian est très utile pour supprimer les valeurs aberrantes quelquefois occasionnelles d'un flux d'entrée. Cela le rend particulièrement bien adapté au filtrage des entrées des capteurs de distance, qui sont sujets à des interférences de temps à autre. Contrairement à une moyenne mobile, le filtre médian ne sera pas affecté par un petit nombre de valeurs aberrantes, aussi extrêmes soient-elles.
tr_tr: Median filtresi, bir giriş akışından ara sıra aykırı değerleri kaldırmak için çok kullanışlıdır. Bu, ara sıra parazitlere eğilimli olan mesafe sensörlerinden gelen girdileri filtrelemek için özellikle uygun hale getirir. Hareketli bir ortalamanın aksine; median filtresi, ne kadar aşırı olursa olsun, az sayıdaki aykırı değerlerden tamamen etkilenmeyecektir.
zh_cn: 中值滤波器最有用的是从输入流中删除偶尔的异常值。这使其特别适合于过滤来自距离传感器的输入，这些输入容易受到偶尔的干扰。与移动平均值不同，中值过滤器将完全不受少量异常值的影响，无论多么极端。

source: The median filter is supported in WPILib through the ``MedianFilter`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/development/java/edu/wpi/first/math/filter/MedianFilter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/development/cpp/classfrc_1_1_median_filter.html>`__).
fr_ca: Le filtre médian est pris en charge dans WPILib via la classe ``MedianFilter`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/development/java/edu/wpi/first/math/filter/MedianFilter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/development/cpp/classfrc_1_1_median_filter.html>`__).

source: Creating a MedianFilter
fr_ca: La création de MedianFilter
tr_tr: MedianFilter Oluşturma
zh_cn: 创建一个MedianFilter

source: The C++ ``MedianFilter`` class is templated on the data type used for the input.
fr_ca: La classe C++ ``MedianFilter`` est basée sur le type de données utilisé comme entrée.
tr_tr: C++ ``MedianFilter`` sınıfı, girdi için kullanılan veri türüne göre şablonlanır.
zh_cn: C ++``MedianFilter''类是用于输入的数据类型的模板。

source: Because filters have "memory", each input stream requires its own filter object. Do *not* attempt to use the same filter object for multiple input streams.
fr_ca: Étant donné que les filtres ont une «mémoire», chaque flux d'entrée nécessite son propre objet filtre. N'essayez *pas* d'utiliser le même objet filtre pour plusieurs flux d'entrée.
tr_tr: Filtrelerin "belleği" olduğundan, her giriş akışı kendi filtre nesnesini gerektirir. Birden çok giriş akışı için aynı filtre nesnesini kullanmaya *çalışmayın*.
zh_cn: 因为过滤器具有“内存”，所以每个输入流都需要其自己的过滤器对象。 *不要*尝试对多个输入流使用相同的过滤器对象。

source: Creating a ``MedianFilter`` is simple:
fr_ca: La création de ``MedianFilter`` est simple:
tr_tr: Bir ``MedianFilter`` oluşturmak basittir:
zh_cn: 创建一个MedianFilter很简单：

source: Using a MedianFilter
fr_ca: L'utilisation de MedianFilter
tr_tr: MedianFilter kullanma
zh_cn: 使用MedianFilter

source: Once your filter has been created, using it is easy - simply call the ``calculate()`` method with the most recent input to obtain the filtered output:
fr_ca: Une fois votre filtre créé, son utilisation est simple - il suffit d'appeler la méthode ``calculate()`` avec l'entrée la plus récente pour obtenir la sortie filtrée:
tr_tr: Filtreniz oluşturulduktan sonra kullanımı kolaydır - filtrelenmiş çıktıyı elde etmek için en son girdiyle ``calculate()`` yöntemini çağırmanız yeterlidir:
zh_cn: 创建过滤器后，使用起来很容易-只需使用最新输入调用calculate（）方法即可获取过滤后的输出：

source: The median filter is supported in WPILib through the ``MedianFilter`` class (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/MedianFilter.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1MedianFilter.html>`__).
tr_tr: Median filtresi, WPILib'de ``MedianFilter`` sınıfı (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/MedianFilter.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1MedianFilter.html>`__) aracılığıyla desteklenir.

source: The median filter is supported in WPILib through the ``MedianFilter`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/MedianFilter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1MedianFilter.html>`__).
zh_cn: WPILib通过MedianFilter类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/MedianFilter.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1MedianFilter.html>`__）支持中值过滤器。
