Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/filters/slew-rate-limiter.po
Languages: fr_ca

source: Slew Rate Limiter
fr_ca: Limiteur de la vitesse de balayage (Slew Rate)

source: A common use for filters in FRC\ |reg| is to soften the behavior of control inputs (for example, the joystick inputs from your driver controls). Unfortunately, a simple low-pass filter is poorly-suited for this job; while a low-pass filter will soften the response of an input stream to sudden changes, it will also wash out fine control detail and introduce phase lag. A better solution is to limit the rate-of-change of the control input directly. This is performed with a *slew rate limiter* - a filter that caps the maximum rate-of-change of the signal.
fr_ca: Une utilisation courante pour les filtres en FRC\ |reg| est d’adoucir le comportement des entrées de contrôle (par exemple, les entrées joystick de vos commandes de pilote). Malheureusement, un simple filtre passe-bas est mal adapté à ce travail; tandis qu’un filtre passe-bas adoucira la réponse d’un flux d’entrée aux changements soudains, il éliminera également les détails pour un contrôle fin et introduira un décalage de phase. Une meilleure solution consiste à limiter directement le taux de changement de l’entrée de contrôle. Ceci est effectué avec un *limiteur de la vitesse de balayage* - un filtre qui plafonne le taux maximum de changement du signal.

source: A slew rate limiter can be thought of as a sort of primitive motion profile. In fact, the slew rate limiter is the first-order equivalent of the :ref:`Trapezoidal Motion Profile <docs/software/advanced-controls/controllers/trapezoidal-profiles:Trapezoidal Motion Profiles in WPILib>` supported by WPILib - it is precisely the limiting case of trapezoidal motion when the acceleration constraint is allowed to tend to infinity. Accordingly, the slew rate limiter is a good choice for applying a de-facto motion profile to a stream of velocity setpoints (or voltages, which are usually approximately proportional to velocity). For input streams that control positions, it is usually better to use a proper trapezoidal profile.
fr_ca: Un limiteur de vitesse de balayage peut être considéré comme une forme primitive de profil de mouvement. En effet, le limiteur de vitesse de balayage est l'équivalent de premier ordre du :ref:`Profil de mouvement trapézoïdal <docs/software/advanced-controls/controllers/trapezoidal-profiles:Trapezoidal Motion Profiles in WPILib>` supporté par WPILib - il est précisément le cas limite du mouvement trapézoïdal lorsque la contrainte d'accélération peut tendre vers l'infini. Par conséquent, le limiteur de vitesse de balayage est un bon choix pour appliquer un profil de mouvement de facto à un flux de données de vitesse (ou voltages, qui s'apparente à la vitesse). Pour les flux d'entrée qui contrôlent les positions, il est généralement préférable d'utiliser un profil trapézoïdal approprié.

source: Slew rate limiting is supported in WPILib through the ``SlewRateLimiter`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/filter/SlewRateLimiter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_slew_rate_limiter.html>`__).
fr_ca: La limitation de la vitesse de balayage est prise en charge dans WPILib via la classe ``SlewRateLimiter`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/filter/SlewRateLimiter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_slew_rate_limiter.html>`__).

source: Creating a SlewRateLimiter
fr_ca: Création de SlewRateLimiter

source: The C++ ``SlewRateLimiter`` class is templated on the unit type of the input. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
fr_ca: La classe C++ ``SlewRateLimiter`` est basée sur le type d'unité de l'entrée. Pour plus d'informations sur les unités C++, voir :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.

source: Because filters have "memory", each input stream requires its own filter object. Do *not* attempt to use the same filter object for multiple input streams.
fr_ca: Étant donné que les filtres ont une «mémoire», chaque flux d'entrée nécessite son propre objet filtre. N'essayez *pas* d'utiliser le même objet de filtre pour plusieurs flux d'entrée.

source: Creating a SlewRateLimiter is simple:
fr_ca: La création de SlewRateLimiter est simple:

source: Using a SlewRateLimiter
fr_ca: Utilisation de SlewRateLimiter

source: Once your filter has been created, using it is easy - simply call the ``calculate()`` method with the most recent input to obtain the filtered output:
fr_ca: Une fois votre filtre créé, son utilisation est simple - il suffit d'appeler la méthode ``calculate()`` avec l'entrée la plus récente pour obtenir la sortie filtrée:

source: Using a SlewRateLimiter with DifferentialDrive
fr_ca: Utilisation de SlewRateLimiter avec la classe DifferentialDrive

source: A typical use of a SlewRateLimiter is to limit the acceleration of a robot's drive. This can be especially handy for robots that are very top-heavy, or that have very powerful drives. To do this, apply a SlewRateLimiter to a value passed into your robot drive function:
fr_ca: Une utilisation typique d’un SlewRateLimiter est de limiter l’accélération de l’entraînement d’un robot. Cela peut être particulièrement pratique pour les robots qui sont très lourds ou qui ont des entraînements très puissants. Pour ce faire, appliquez un SlewRateLimiter à une valeur passée dans votre fonction d'entraînement de robot :
