Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/glass/command-based-widgets.po
Languages: es_mx, fr_ca, tr_tr

source: Widgets for the Command-Based Framework
es_mx: Widgets para el marco de trabajo basado en comandos
fr_ca: Widgets pour l'infrastructure logicielle orientée commande
tr_tr: Komut Tabanlı Çerçeve için Araçlar

source: Glass also has several widgets that are specific to the :ref:`command-based framework <docs/software/commandbased/index:Command-Based Programming>`. These include widgets to schedule commands, view actively running commands on a specific subsystem, or view the state of the :ref:`command scheduler <docs/software/commandbased/command-scheduler:The Command Scheduler>`.
es_mx: Glass también tiene varios widgets que son específicos para el :ref:`command-based framework <docs/software/commandbased/index:Command-Based Programming>`. Estos incluyen widgets para programar comandos, ver los comandos que se están ejecutando activamente en un subsistema específico, o ver el estado del :ref:`command scheduler <docs/software/commandbased/command-scheduler:The Command Scheduler>`.
fr_ca: Glass a également plusieurs widgets spécifiques à :ref:`l’infrastructure logicielle orientée commande <docs/software/commandbased/index:Command-Based Programming>`. Ceux-ci incluent des widgets pour planifier les commandes, afficher les commandes en cours d'exécution sur un sous-système spécifique ou afficher l'état du :ref:`planificateur de commandes <docs/software/commandbased/command-scheduler:The Command Scheduler>`.
tr_tr: Glass'da ayrıca :ref:`komut temelli çerçeveye <docs/software/commandbased/index:Command-Based Programming>` özgü birkaç widget - araç bulunmaktadır. Bu araçlar, komutları zamanlamak, belirli bir alt sistemde aktif olarak çalışan komutları görüntülemek veya :ref:`komut zamanlayıcının <docs/software/commandbased/command-scheduler:The Command Scheduler>` durumunu görüntülemeyi sağlayan araçlar içermektedir.

source: Command Selector Widget
es_mx: Widget de selección de comandos
fr_ca: Widget de sélection de commandes
tr_tr: Command Selector Widget - Komut Seçici Araç

source: The :guilabel:`Command Selector` widget allows you to start and cancel a specific instance of a command (sent over NetworkTables) from Glass. For example, you can create an instance of ``MyCommand`` and send it to SmartDashboard:
es_mx: La :guilabel:`Command Selector` le permite iniciar y cancelar una instancia específica de un comando (enviado a través de NetworkTables) desde Glass. Por ejemplo, puede crear una instancia de ``MyCommand`` y enviarla a SmartDashboard:
fr_ca: Le widget :guilabel:`Command Selector` vous permet de démarrer et d'annuler une instance spécifique d'une commande (envoyée via NetworkTables) depuis Glass. Par exemple, vous pouvez créer une instance de ``MyCommand`` et l'envoyer à SmartDashboard:
tr_tr: :guilabel:`Komut Seçici` aracı, Glass'tan belirli bir komut örneğini (Ağ Tabloları üzerinden gönderilen) başlatmanıza ve iptal etmenize olanak tanımaktadır. Örneğin, bir``MyCommand`` oluşumu yaratabilir ve SmartDashboard'a gönderebilirsiniz:

source: The ``MyCommand`` instance can also be sent using a lower-level NetworkTables API or using the :ref:`Shuffleboard API <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>`. In this case, the ``SmartDashboard`` API was used, meaning that the :guilabel:`Command Selector` widget will appear under the ``SmartDashboard`` table name.
fr_ca: L'instance ``MyCommand`` peut également être envoyée en utilisant une API NetworkTables de niveau inférieur ou en utilisant :ref:`Shuffleboard API <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>`. Dans ce cas, l’API ``SmartDashboard`` a été utilisée, ce qui signifie que le widget :guilabel:`Command Selector` apparaîtra sous le nom de la table ``SmartDashboard``.
tr_tr: ``MyCommand`` oluşumu daha alt seviyedeki NetworkTables API veya :ref:`Shuffleboard API <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>` kullanılarak da iletilebilmektedir. Bu örnekte ``SmartDashboard`` API kullanılmıştır, diğer bir değişle :guilabel:`Komut Seçici` aracı, ``SmartDashboard`` tablo adı altında görüntülenebilecektir.

source: Command Selector widget showing that "MyCommand" is running with the option to cancel
fr_ca: Widget Command Selector montrant que "MyCommand" est en cours d’exécution avec l'option d’annuler
tr_tr: "MyCommand"in iptal et seçeneği ile çalıştığını gösteren Komut Seçici araç

source: The widget has two states. When the command is not running, a :guilabel:`Run` button will appear -- clicking it will schedule the command. When the command is running, a :guilabel:`Cancel` button, accompanied by :guilabel:`Running...` text, will appear (as shown above). This will cancel the command.
es_mx: El widget tiene dos estados. Cuando el comando no se está ejecutando, aparecerá el botón: guilabel: `Ejecutar`; al hacer clic en él, se programará el comando. Cuando el comando se está ejecutando, aparecerá un botón: guilabel: `Cancelar`, acompañado del texto: guilabel:` Ejecutando ... `(como se muestra arriba). Esto cancelará el comando.
fr_ca: Le widget a deux états. Lorsque la commande n'est pas en cours d'exécution, un bouton :guilabel:`Run` apparaît - en cliquant dessus, la commande sera programmée. Lorsque la commande est en cours d’exécution, un bouton :guilabel:`Cancel`, accompagné du texte :guilabel:`Running ...` apparaît (comme indiqué ci-dessus). Cela annulera la commande.
tr_tr: Araç iki duruma sahiptir. Komut çalışmadığında, bir :guilabel:`Run` düğmesi görünecektir - düğmeye tıklamak komutu zamanlayacaktır. Komut çalışırken, bir :guilabel:`Cancel` düğmesi ile birlikte :guilabel:`Running...` metni görünecektir (yukarıda gösterildiği gibi). Bu düğme, komutu iptal edecektir.

source: Subsystem Widget
es_mx: Widget de subsistema
fr_ca: Widget de sous-système
tr_tr: Subsystem Widget - Alt Sistem Aracı

source: The :guilabel:`Subsystem` widget can be used to see the default command and the currently scheduled command on a specific subsystem. If you are using the ``SubsystemBase`` base class, your subsystem will be automatically sent to NetworkTables over LiveWindow. To view this widget, look under the :guilabel:`LiveWindow` main table name in the :guilabel:`NetworkTables` menu.
es_mx: El widget :guilabel:`Subsistema` se puede utilizar para ver el comando por defecto y el comando actualmente programado en un subsistema específico. Si se utiliza la clase base ``BasedelSubsistema``, el subsistema se enviará automáticamente a las Tablas de Red a través de la Ventana en Vivo. Para ver este widget, busque bajo el nombre de la tabla principal :guilabel:`VentanaenVivo` en el menú :guilabel:`TablasdeRed`.
fr_ca: Le widget :guilabel:`Subsystem` peut être utilisé pour voir la commande par défaut et la commande actuellement programmée sur un sous-système spécifique. Si vous utilisez la classe de base ``SubsystemBase``, votre sous-système sera automatiquement envoyé à NetworkTables via LiveWindow. Pour afficher ce widget, regardez sous le nom de la table principale :guilabel:`LiveWindow` dans le menu :guilabel:` NetworkTables`.
tr_tr: :guilabel:`Alt sistem` aracı, varsayılan komutu ve belirli bir alt sistemde o anda zamanlanmış komutu görmek için kullanılabilmektedir. ``SubsystemBase`` temel sınıfını kullanıyorsanız, alt sisteminiz LiveWindow üzerinden NetworkTables'a otomatik olarak gönderilecektir. Bu aracı görüntülemek için :guilabel:`NetworkTables` menüsünde :guilabel:`LiveWindow`ana tablo adının altına doğru bakınız.

source: Subsystem widget showing the state of "DriveSubsystem". Default Command: "DefaultDrive". Current Command: "DriveDistance"
fr_ca: Widget Subsystem affichant l’état de "DriveSubsystem". Commande par défaut: "DefaultDrive". Commande actuelle: "DriveDistance"
tr_tr: "DriveSubsystem" durumunu gösteren alt sistem aracı. Varsayılan Komut: "DefaultDrive". Anlık Komut: "DriveDistance".

source: Command Scheduler Widget
es_mx: Widget del programador de comandos
fr_ca: Widget du planificateur de commandes
tr_tr: Command Scheduler Widget - Komut Zamanlayıcı Widget'ı

source: The :guilabel:`Command Scheduler` widget allows you to see all currently scheduled commands. In addition, any of these commands can be canceled from the GUI.
es_mx: El widget :guilabel:`Programador de comandos` permite ver todos los comandos programados actualmente. Además, cualquiera de estos comandos puede ser cancelado desde la GUI.
fr_ca: Le widget :guilabel:`Command Scheduler` vous permet de voir toutes les commandes actuellement programmées. De plus, n'importe laquelle de ces commandes peut être annulée à partir de l'interface graphique.
tr_tr: :guilabel:`Komut Zamanlayıcı` araç , anlık zamanlanmış tüm komutları görmenizi olanak tanımaktadır. Buna ek olarak, bu komutlardan herhangi biri kullanıcı arayüzü üzerinden iptal edilebilmektedir.

source: Scheduler widget. Scheduled commands are "DriveDistance" and "MyCommand". Both have the option to cancel.
fr_ca: Widget Scheduler ou Planificateur. Les commandes planifiées sont "DriveDistance" et "MyCommand". Les deux sont pourvues de l'option d’annuler.
tr_tr: Zamanlayıcı araç. Zamanlanan komutlar "DriveDistance" ve "MyCommand". Komutların ikisi de iptal eçme seçeneğine sahip.

source: The ``CommandScheduler`` instance is automatically sent to NetworkTables over LiveWindow. To view this widget, look under the :guilabel:`LiveWindow` main table name in the :guilabel:`NetworkTables` menu.
es_mx: La instancia de ``CommandScheduler`` se envía automáticamente a NetworkTables a través de LiveWindow. Para ver este widget, busque debajo del nombre de la tabla principal :guilabel:`LiveWindow` en el menú :guilabel:`NetworkTables`.
fr_ca: L'instance ``CommandScheduler`` est automatiquement envoyée à NetworkTables via LiveWindow. Pour afficher ce widget, regardez sous le nom de la table principale :guilabel:`LiveWindow` dans le menu :guilabel:`NetworkTables`.
tr_tr: ``CommandScheduler`` oluşumu, LiveWindow üzerinden NetworkTables'a otomatik olarak gönderilmektedir. Bu parçacığı görüntülemek için :guilabel:`NetworkTables` menüsünde :guilabel:`LiveWindow` ana tablo adının altına bakınız.
