Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/glass/field2d-widget.po
Languages: fr_ca, tr_tr

source: The Field2d Widget
fr_ca: Le widget Field2d
tr_tr: Field2d Widget - Aracı

source: Glass supports displaying your robot's position on the field using the :guilabel:`Field2d` widget. An instance of the ``Field2d`` class should be created, sent over NetworkTables, and updated periodically with the latest robot pose in your robot code.
fr_ca: Glass prend en charge l'affichage de la position de votre robot sur le terrain à l'aide du widget :guilabel:`Field2d`. Une instance de la classe ``Field2d`` doit être créée, envoyée via NetworkTables et mise à jour périodiquement avec la dernière pose de robot dans votre code.
tr_tr: Cam, robotunuzun sahadaki konumunu :guilabel:`Field2d` aracını kullanarak görüntülemeyi desteklemektedir. ``Field2d`` sınıfının bir örneği oluşturulmalı, NetworkTables üzerinden gönderilmeli ve robot kodunuzdaki en son robot pozuyla periyodik olarak güncellenmelidir.

source: Sending Robot Pose from User Code
fr_ca: Envoi de la pose du robot à partir du code utilisateur
tr_tr: Kullanıcı Kodundan Robot Pozunu Gönderme

source: To send your robot's position (usually obtained by :ref:`odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>` or a pose estimator), a ``Field2d`` instance must be created in robot code and sent over NetworkTables. The instance must then be updated periodically with the latest robot pose.
fr_ca: Pour envoyer la position de votre robot (généralement obtenue par :ref:`odométrie <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>` ou un estimateur de pose), une instance ``Field2d`` doit être créée dans le code du robot et envoyée via NetworkTables. L'instance doit ensuite être mise à jour périodiquement avec la dernière pose du robot.
tr_tr: Robotunuzun (genellikle :ref:`odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>` veya bir poz tahmincisi tarafından elde edilen) konumunu göndermek için, robot kodunda bir ``Field2d`` örneği oluşturulmalı ve örnek NetworkTables üzerinden gönderilmelidir. Örnek daha sonra en son robot pozuyla periyodik olarak güncellenmelidir.

source: The ``Field2d`` instance can also be sent using a lower-level NetworkTables API or using the :ref:`Shuffleboard API <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>`. In this case, the ``SmartDashboard`` API was used, meaning that the :guilabel:`Field2d` widget will appear under the ``SmartDashboard`` table name.
fr_ca: L'instance ``Field2d`` peut également être envoyée en utilisant une API NetworkTables de niveau inférieur ou en utilisant :ref:`Shuffleboard API <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>`. Dans ce cas, l'API ``SmartDashboard`` a été utilisée, ce qui signifie que le widget :guilabel:`Field2d` apparaîtra sous le nom de la table ``SmartDashboard``.
tr_tr: ``Field2d`` örneği daha alt seviyedeki NetworkTables API veya :ref:`Shuffleboard API <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>` kullanılarak da iletilebilmektedir. Bu örnekte ``SmartDashboard`` API kullanılmıştır, diğer bir değişle :guilabel:`Field2d` aracı, ``SmartDashboard`` tablo adı altında görüntülenebilecektir.

source: Sending Trajectories to Field2d
fr_ca: Envoi de trajectoires à Field2d
tr_tr: Field2d'ye Yörüngelerin Gönderilmesi

source: Visualizing your trajectory is a great debugging step for verifying that your trajectories are created as intended. Trajectories can be easily visualized in :ref:`Field2d <docs/software/dashboards/glass/field2d-widget:The Field2d Widget>` using the ``setTrajectory()``/``SetTrajectory()`` functions.
fr_ca: La visualisation de votre trajectoire est une excellente étape de débogage pour vérifier que vos trajectoires ont été créées comme prévu. Les trajectoires peuvent être facilement visualisées dans :ref:`Field2d <docs/software/dashboards/glass/field2d-widget:The Field2d Widget>` en faisant usage des fonctions ``setTrajectory()``/``SetTrajectory()``.
tr_tr: Yörüngenizi görüntülemek, yörüngelerin istediğiniz şekilde oluşturulduğunu doğrulamak için çok iyi bir hata ayıklama - debugging adımıdır. Yörüngeler :ref:`Field2d <docs/software/dashboards/glass/field2d-widget:The Field2d Widget>`'de ``setTrajectory()``/``SetTrajectory()`` işlevlerini kullanarak kolayca görselleştirilebilmektedir.

source: Viewing Trajectories with Glass
fr_ca: Affichage des trajectoires à l'aide de Glass
tr_tr: Glass ile Yörüngelerin Görüntülenmesi

source: The sent trajectory can be viewed with :ref:`Glass <docs/software/dashboards/glass/index:Glass>` through the dropdown :guilabel:`NetworkTables` -> :guilabel:`SmartDashboard` -> :guilabel:`Field2d`.
fr_ca: La trajectoire envoyée peut être visualisée avec :ref:`Glass <docs/software/dashboards/glass/index:Glass>` via la liste déroulante :guilabel:`NetworkTables` -> :guilabel:`SmartDashboard` -> :guilabel:`Field2d`.
tr_tr: İletilen yörünge :ref:`Glass <docs/software/dashboards/glass/index:Glass>` ile :guilabel:`NetworkTables` -> :guilabel:`SmartDashboard` -> :guilabel:`Field2d` açılır menülerini takip ederek görüntülenebilmektedir.

source: Picture containing Field2d and the generated trajectory
fr_ca: Image contenant Field2d et la trajectoire générée
tr_tr: Oluşturulan yörünge be Field2d'yi içeren bir resim

source: The above example which uses the RamseteController (`Java <https://github.com/wpilibsuite/allwpilib/blob/a610379965680a8f9214d5f0db3a8e1bc20d4712/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecontroller/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/a610379965680a8f9214d5f0db3a8e1bc20d4712/wpilibcExamples/src/main/cpp/examples/RamseteController/cpp/Robot.cpp>`__ / `Python <https://github.com/robotpy/examples/tree/2024.0.0b4/RamseteController>`__) will not show the sent trajectory until autonomous is enabled at least once.
tr_tr: RamseteController (`Java <https://github.com/wpilibsuite/allwpilib/blob/a610379965680a8f9214d5f0db3a8e1bc20d4712/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecontroller/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/a610379965680a8f9214d5f0db3a8e1bc20d4712/wpilibcExamples/src/main/cpp/examples/RamseteController/cpp/Robot.cpp>`__ / `Python <https://github.com/robotpy/examples/tree/2024.0.0b4/RamseteController>`__) kullanılan yukarıdaki örnekte iletilen yörünge otonom en az bir defa etkinleştirilmeden görünmeyecektir.

source: Viewing the Robot Pose in Glass
fr_ca: Affichage de la pose du robot dans Glass
tr_tr: Robot Pozunun Glass'da Görüntülenmesi

source: After sending the ``Field2d`` instance over NetworkTables, the :guilabel:`Field2d` widget can be added to Glass by selecting :guilabel:`NetworkTables` in the menu bar, choosing the table name that the instance was sent over, and then clicking on the :guilabel:`Field` button.
fr_ca: Après avoir envoyé l'instance ``Field2d`` sur NetworkTables, le widget :guilabel:`Field2d` peut être ajouté à Glass en sélectionnant :guilabel:`NetworkTables` dans la barre de menu, en choisissant le nom de la table sur laquelle l'instance a été envoyée, et puis en cliquant sur le bouton :guilabel:`Field`.
tr_tr: ``Field2d`` örneğini NetworkTables üzerinden gönderdikten sonra, menü çubuğunda: guilabel: `NetworkTables` seçilerek, örneğin gönderildiği tablo adı seçilerek : guilabel:` Field2d` widget'ı Glass'a eklenebilir ve ardından :guilabel:`Field` düğmesine tıklayın.

source: Once the widget appears, you can resize and place it on the Glass workspace as you desire. Right-clicking the top of the widget will allow you to customize the name of the widget, select a custom field image, select a custom robot image, and choose the dimensions of the field and robot.
fr_ca: Une fois que le widget apparaît, vous pouvez le redimensionner et le placer sur l'espace de travail Glass comme vous le souhaitez. Un clic droit en haut du widget vous permettra de personnaliser le nom du widget, de sélectionner une image de champ personnalisée, de sélectionner une image de robot personnalisée et de choisir les dimensions du champ et du robot.
tr_tr: Widget göründüğünde, onu yeniden boyutlandırabilir ve istediğiniz gibi Glass çalışma alanına yerleştirebilirsiniz. Widget'ın üst kısmına sağ tıklamak, widget'ın adını özelleştirmenize, özel bir alan görüntüsü seçmenize, özel bir robot görüntüsü seçmenize ve alan ile robotun boyutlarını seçmenize olanak tanır.

source: Selecting Field Image
tr_tr: Saha Görüntüsünün Seçilmesi

source: You can choose from an existing field layout using the :guilabel:`Image` drop-down. Or you can select a custom file by setting the :guilabel:`Image` to ``Custom`` and selecting :guilabel:`Choose JSON/image...`. You can choose to either select an image file or a PathWeaver JSON file as long as the image file is in the same directory. Choosing the JSON file will automatically import the correct location of the field in the image and the correct size of the field.
tr_tr: :guilabel:`Image` açılır listesi üzerinden var olan bir saha düzeni seçebilirsiniz ya da :guilabel:`Image`'ı ``Custom`` olarak ayarlayıp :guilabel:`Choose JSON/image...` seçeneğini işaretleyerek özel bir dosya seçebilirsiniz. Görüntü dosyası aynı dizinde olduğu sürece bir görüntü dosyası ya da bir PathWeaver JSON dosyasından birini kullanmayı seçebilirsiniz. JSON dosyasının seçilmesi görüntünün sahadaki doğru konumu ve sahanın doğru boyutunu kendi kendiliğinden içe aktaracaktır.

source: You can retrieve the latest field image and JSON files from `here <https://github.com/wpilibsuite/allwpilib/tree/main/fieldImages/src/main/native/resources/edu/wpi/first/fields>`__. This is the same image and JSON that are used when generating paths using :ref:`PathWeaver <docs/software/pathplanning/pathweaver/introduction:Introduction to PathWeaver>`.
tr_tr: En güncel saha görüntüsü ve JSON dosyalarına `buradan <https://github.com/wpilibsuite/allwpilib/tree/main/fieldImages/src/main/native/resources/edu/wpi/first/fields>`__. This is the same image and JSON that are used when generating paths using :ref:`PathWeaver <docs/software/pathplanning/pathweaver/introduction:Introduction to PathWeaver>` erişebilirsiniz.

source: Modifying Pose Style
fr_ca: Modification du style de pose
tr_tr: Poz Stilinin Değiştirilmesi

source: Poses can be customized in a plethora of ways by right clicking on the Field2d menu bar. Examples of customization are: line width, line weight, style, arrow width, arrow weight, color, etc.
fr_ca: Les Poses peuvent être personnalisées de nombreuses façons en cliquant avec le bouton droit de la souris sur la barre de menus Field2d. Exemples de personnalisation : largeur de la ligne, épaisseur de la ligne, style, largeur de la flèche, épaisseur de la flèche, couleur, etc.
tr_tr: Pozlalr Field2d menü çubuğuna sağ tıklanarak birçok farklı yöntemle özelleştirilebilmektedir. Özelleştirme örnekleri olarak çizgi genişliği, çizgi kalınlığı, stil, ok genişliği, ok kalınlığı, renk vb. verilebilmektedir.

source: Showcases the right click menu of field2d customization options
fr_ca: Présente le menu contextuel des options de personnalisation field2d
tr_tr: Field2d özelleştirme ayarlarının sağ tık menüsünün bir görüntüsü

source: One usage of customizing the pose style is converting the previously shown ``traj`` pose object to a line, rather than a list of poses. Click on the :guilabel:`Style` dropdown box and select :guilabel:`Line`. You should notice an immediate change in how the trajectory looks.
fr_ca: Une utilisation de la personnalisation du style de Pose consiste à convertir l’objet de Pose ``traj`` précédemment affiché en une ligne, plutôt qu’une liste de Poses. Cliquez sur la liste déroulante :guilabel:`Style` et sélectionnez :guilabel:`Line`. Vous devriez remarquer un changement immédiat dans l’apparence de la trajectoire.
tr_tr: Poz stilini değiştirmenin bir kullanımı önceden gösterilmiş ``traj`` poz nesnesini, bir poz listesi yerine, bir çizgiye dönüştürmektir. :guilabel:`Style` açılır listesine tıklayıp select :guilabel:`Line` seçeneğini seçiniz. Anında yörüngenin görünümünde bir değişiklik fark edeceksinizdir.

source: Selecting the "style" dropdown and then selecting "line".
fr_ca: En sélectionnant la liste déroulante "style", puis en sélectionnant "line".
tr_tr: "Style" açılır listesinden "line" seçeneğinin işaretlenmesi.

source: Now, uncheck the :guilabel:`Arrows` checkbox. This will cause our trajectory to look like a nice and fluid line!
tr_tr: Şimdi :guilabel:`Arrows` kutucuğuna tıklayarak işaretini kaldırınız. Bu yörüngemizin güzel ve akıcı bir görünüm kazanmasını sağlayacaktır.

source: Unchecked arrows checkbox to showcase fluid line.
fr_ca: Flèches décochées de la case pour mettre en valeur la ligne fluide.
tr_tr: Akıcı çizgiyi göstermek için işareti kaldırılmış bir arrows kutucuğu.

source: Viewing Pose Data with AdvantageScope
tr_tr: AdvantageScope ile Poz Verilerinin Görüntülenmesi

source: :ref:`AdvantageScope <docs/software/dashboards/advantagescope:AdvantageScope>` is an alternative option for viewing pose data from a ``Field2d`` object, including data recorded to a log file using :ref:`WPILib data logs <docs/software/telemetry/datalog:On-Robot Telemetry Recording Into Data Logs>`. Both 2D and 3D visualizations are supported. See the documentation for the `odometry <https://docs.advantagescope.org/tab-reference/odometry>`__ and `3D field <https://docs.advantagescope.org/tab-reference/3d-field>`__ tabs for more details.
tr_tr: :ref:`AdvantageScope <docs/software/dashboards/advantagescope:AdvantageScope>` ``Field2d`` nesnesinden gelen, :ref:`WPILib data logs <docs/software/telemetry/datalog:On-Robot Telemetry Recording Into Data Logs>` kullanılarak bir günlük dosyasına kaydedilmiş veriler de dahil olmak üzere, poz verilerini görüntülemek için kullanılabilecek başka bir seçenektir. Hem 2 hem de 3 boyutlu görselleştrime desteği bulunmaktadır. Daha fazla bilgi için bkz. `odometry <https://docs.advantagescope.org/tab-reference/odometry>`__ ve `3D field <https://docs.advantagescope.org/tab-reference/3d-field>`__ sekmeleri.

source: Screenshot of an AdvantageScope window displaying a robot and trajectory on a 3D field.
tr_tr: 3 boyutlu bir sahada robot yörüngesini görüntüleyen bir AdvantageScope penceresinin ekran görüntüsü.

source: The above example which uses the `RamseteController (Java) <https://github.com/wpilibsuite/allwpilib/blob/a610379965680a8f9214d5f0db3a8e1bc20d4712/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecontroller/Robot.java>`__/`RamseteController (C++) <https://github.com/wpilibsuite/allwpilib/blob/a610379965680a8f9214d5f0db3a8e1bc20d4712/wpilibcExamples/src/main/cpp/examples/RamseteController/cpp/Robot.cpp>`__ will not show the sent trajectory until autonomous is enabled at least once.
fr_ca: L’exemple ci-dessus qui utilise le contrôleur `RamseteController (Java) <https://github.com/wpilibsuite/allwpilib/blob/a610379965680a8f9214d5f0db3a8e1bc20d4712/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecontroller/Robot.java>`__/`RamseteController (C++) <https://github.com/wpilibsuite/allwpilib/blob/a610379965680a8f9214d5f0db3a8e1bc20d4712/wpilibcExamples/src/main/cpp/examples/RamseteController/cpp/Robot.cpp>`__ n’affichera pas la trajectoire envoyée tant que le mode autonome n’a pas été activé au moins une fois.

source: When selecting :guilabel:`Choose image...` you can choose to either select an image file or a PathWeaver JSON file as long as the image file is in the same directory. Choosing the JSON file will automatically import the correct location of the field in the image and the correct size of the field.
fr_ca: Lors de la sélection :guilabel:`Choose image...` vous pouvez choisir soit de sélectionner un fichier de type image, soit un fichier PathWeaver JSON tant que le fichier de type image est dans le même répertoire. Le choix du fichier JSON importera automatiquement l’emplacement adéquate de l'image du terrain de jeu et la taille exacte dudit terrain.

source: You can retrieve the latest field image and JSON files from `here <https://github.com/wpilibsuite/PathWeaver/tree/main/src/main/resources/edu/wpi/first/pathweaver>`__. This is the same image and JSON that are used when generating paths using :ref:`PathWeaver <docs/software/pathplanning/pathweaver/introduction:Introduction to PathWeaver>`.
fr_ca: Vous pouvez récupérer la dernière image du terrain et les fichiers JSON à partir `d’ici <https://github.com/wpilibsuite/PathWeaver/tree/main/src/main/resources/edu/wpi/first/pathweaver>`__. Il s’agit de la même image et du même fichier JSON que ceux utilisés lors de la génération de trajectoires à l’aide de :ref:`PathWeaver <docs/software/pathplanning/pathweaver/introduction:Introduction to PathWeaver>`.

source: Now, uncheck the :guilabel:`Arrows` checkbox. This will cause cause our trajectory to look like a nice and fluid line!
fr_ca: Maintenant, décochez la case :guilabel:`Arrows`. Cela donnera à notre trajectoire l'apparence d'une ligne agréable et fluide!
