Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/glass/introduction.po
Languages: tr_tr

source: Introduction to Glass
tr_tr: Glass'a Giriş

source: Glass is a new dashboard and robot data visualization tool. It supports many of the same :ref:`widgets <docs/software/wpilib-tools/robot-simulation/simulation-gui:Learning the Layout>` that the Simulation GUI supports, including robot pose visualization and advanced plotting. In its current state, it is meant to be used as a programmer's tool for debugging and not as a dashboard for competition use.
tr_tr: Glass, yeni bir kontrol paneli ve robot veri görselleştirme aracıdır. Robot poz görselleştirme ve gelişmiş çizim de dahil olmak üzere Simülasyon GUI'nin desteklediği ref: `widgets <docs/ oftware pilib-tools obot-simülasyon/ simülasyon-gui: Learning the Layout>` ın çoğunu destekler. Mevcut durumunda, rekabet kullanımı için bir gösterge tablosu olarak değil, hata ayıklama için bir programcının aracı olarak kullanılması amaçlanmıştır.

source: Opening Glass
tr_tr: Glass'ın Başlatılması

source: Glass can be launched by selecting the ellipsis menu (:guilabel:`...`) in VS Code, clicking on :guilabel:`Start Tool` and then choosing :guilabel:`Glass`.
tr_tr: Glass, VS Code'da (: guilabel: `...`) üç nokta menüsü seçilerek, :guilabel:`Start Tool`'a tıklanarak ve ardından :guilabel:`Glass` seçilerek başlatılabilmektedir.

source: You can also launch Glass directly by navigating to ``~/wpilib/YYYY/tools`` and running ``Glass.py`` (Linux and macOS) or by using the shortcut inside the WPILib Tools desktop folder (Windows).
tr_tr: Glass'ı ``~/wpilib/YYYY/tools``'a gidip ``Glass.py`` (Linux ve macOS) uygulamasını çalıştırarak veya WPILib Tools masaüstü dosyasındaki kısayolu kullanarak (Windows) doğrudan başlatabiilirsiniz

source: Changing View Settings
tr_tr: Görünüm Ayarlarının Değiştirilmesi

source: The :guilabel:`View` menu item contains :guilabel:`Zoom` and :guilabel:`Style` settings that can be customized. The :guilabel:`Zoom` option dictates the size of the text in the application whereas the :guilabel:`Style` option allows you to select between the ``Classic``, ``Light``, and ``Dark`` modes.
tr_tr: :guilabel:`View` menü öğesi :guilabel:`Zoom` ve :guilabel:`Style` özelleştirilebilir ayarlarını içermektedir. :guilabel:`Zoom` seçeneği, uygulamadaki metnin boyutunu belirlerken :guilabel:`Style` seçeneği, ``Classic`` - Klasik, ``Light`` - Aydınlık ve ``Dark`` - Karanlık modlarından birini seçmenize olanak tanımaktadır.

source: An example of the ``Dark`` style setting is below:
tr_tr: ``Dark`` stil ayarının bir örneği aşağıdadır:

source: Clearing Application Data
tr_tr: Uygulama Verilerinin Temizlenmesi

source: Application data for Glass, including widget sizes and positions as well as other custom information for widgets is stored in a ``glass.ini`` file. The location of this file varies based on your operating system:
tr_tr: Widget - araç boyutları ve bu araçların konumlarının yanı sıra araçlar için diğer özel bilgiler de dahil Glass uygulama verileri bir ``glass.ini`` dosyasında saklanmaktadır. Bu dosyanın konumu işletim sisteminize göre değişmektedir:

source: On Windows, the configuration file is located in ``%APPDATA%``.
tr_tr: Windows'da yapılandırma dosyası ``%APPDATA%`` içinde bulunmaktadır.

source: On macOS, the configuration file is located in ``~/Library/Preferences``.
tr_tr: MacOS'de konfigürasyon dosyası ``~/Library/Preferences`` içinde bulunmaktadır.

source: On Linux, the configuration file is located in ``$XDG_CONFIG_HOME`` or ``~/.config`` if the former does not exist.
tr_tr: Linux'da yapılandırma dosyası ``$XDG_CONFIG_HOME`` içerisinde eğer yoksa ``~/.config`` içerisinde bulunmaktadır.

source: The ``glass.ini`` configuration file can simply be deleted to restore Glass to a "clean slate".
tr_tr: ``glass.ini`` yapılandırma dosyası, Glass'ı "ilk haline" geri döndürmek için kolayca silinebilmektedir.
