Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/glass/mech2d-widget.po
Languages: fr_ca, tr_tr

source: The Mechanism2d Widget
fr_ca: Le widget Mechanism2d
tr_tr: Mechanism2d Aracı

source: Glass supports displaying stick-figure representations of your robot's mechanisms using the :guilabel:`Mechanism2d` widget. It supports combinations of ligaments that can rotate and / or extend or retract, such as arms and elevators and they can be combined for more complicated mechanisms. An instance of the ``Mechanism2d`` class should be created and populated, sent over NetworkTables, and updated periodically with the latest mechanism states in your robot code. It can also be used with the :doc:`Physics Simulation </docs/software/wpilib-tools/robot-simulation/physics-sim>` to visualize and program your robot's mechanisms before the robot is built.
fr_ca: Glass prend en charge l’affichage de représentations en forme de lignes droites des mécanismes de votre robot à l’aide du widget :guilabel:`Mechanism2d`. Il prend en charge les combinaisons de ligaments qui peuvent tourner et / ou s’étendre ou se rétracter, tels que les bras et les élevateurs et ils peuvent être combinés pour des mécanismes plus compliqués. Une instance de la classe ``Mechanism2d`` doit être créée et configuréé, envoyée via NetworkTables et mise à jour périodiquement selon les derniers états du mécanisme dans votre code robot. Il peut également être utilisé avec :doc:`Simulation physique </docs/software/wpilib-tools/robot-simulation/physics-sim>` pour visualiser et programmer les mécanismes de votre robot avant sa construction effective.
tr_tr: Glass, :guilabel:`Mechanism2d` aracını kullanarak robotunuzun düzeneklerinin çöp adam şeklinde temsillerini görüntüleme imkanı tanımaktadır. Araç, kollar ve asansörler gibi dönebilen ve / veya uzanıp geri çekilebilen bağ birleşimlerini desteklemektedir ve bu bağlar daha karmaşık düzenekler için birleştirilebilmektedir. ``Mechanism2d`` sınıfının örneği oluşturulmalı ve doldurulmalı, NetworkTables üzerinden iletilmeli ve düzenli aralıklarla robot kodunuzdaki en güncel düzenek durumları ile güncellenmelidir. Araç, :doc:`Physics Simulation </docs/software/wpilib-tools/robot-simulation/physics-sim>` ile birlikte, robotun inşaası öncesinde robotunuzun düzeneklerini görüntülemek ve programlamak için de kullanılabilmektedir.

source: Creating and Configuring the Mechanism2d Instance
fr_ca: Création et configuration de l’instance Mechanism2d
tr_tr: Mechanism2d Örneğinin Oluşturulması ve Yapılandırılması

source: The ``Mechanism2d`` object is the "canvas" where the mechanism is drawn. The root node is where the mechanism is anchored to ``Mechanism2d``. For a single jointed arm this would the pivot point. For an elevator, this would be where it's attached to the robot's base. To get a root node (represented by a ``MechanismRoot2d`` object), call ``getRoot(name, x, y)`` on the container ``Mechanism2d`` object. The name is used to name the root within NetworkTables, and should be unique, but otherwise isn't important. The ``x / y`` coordinate system follows the same orientation as ``Field2d`` - ``(0,0)`` is bottom left.
fr_ca: L’objet ''Mechanism2d'' est le « canevas » où le mécanisme est dessiné. Le nœud racine est l’endroit où le mécanisme est ancré à ``Mechanism2d``. Pour un seul bras articulé, ce serait le point de pivot. Pour un élevateur, ce serait l’endroit où il est attaché à la base du robot. Pour obtenir un nœud racine (représenté par un objet ``MechanismRoot2d`` object), invoquez la méthode ``getRoot(name, x, y)`` sur l’objet conteneur ``Mechanism2d``. Le nom est utilisé pour nommer la racine dans NetworkTables et doit être unique, mais n’est pas important. Le système de coordonnées ``x / y`` suit la même orientation que ``Field2d`` - ``(0,0)`` est en bas à gauche.
tr_tr: ``Mechanism2d`` nesnesi düzeneğin çizildiği "tuval"dir. Kök düğüm, düzeneğin ``Mechanism2d``'ye sabitlendiği yerdir. Tek eklemli bir kol için bu sabitleme yeri döngül noktadır. Bir asansör için sabitleme yeri, robotun temelinde tutturulduğu yer olacaktır. (Bir ``MechanismRoot2d`` nesnesi ile temsil edilen) kök düğüm elde etmek için ``Mechanism2d`` nesnesi kapsayıcısı içerisinde ``getRoot(name, x, y)``'yi çağırınız. İsim NetworkTables içerisinde kök düğümü isimlendirmek için kullanılmaktadır ve bu sebeple özgün olması haricinde pek de önemli değildir. ``x / y`` koordinat sistemi ``Field2d`` ile aynı yönü izlemektedir: ``(0,0)`` sol alttır.

source: In the examples below, an elevator is drawn, with a rotational wrist on top of the elevator. The full Mechanism2d example is available in `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mechanism2d/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/Mechanism2d/cpp/Robot.cpp>`__
fr_ca: Dans les exemples ci-dessous, un élevateur est dessiné, avec un poignet rotatif au dessus de celui-ci. L’exemple complet de Mechanism2d est disponible dans `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mechanism2d/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/Mechanism2d/cpp/Robot.cpp>`__
tr_tr: Aşağıdaki örneklerde, en üzerinde dönüşlü bir bilek bulunan, bir asansör çizilmiştir. Mechanism2d örneğinin tamamına `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mechanism2d/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/Mechanism2d/cpp/Robot.cpp>`__ üzerinden erişebilirsiniz.

source: Each ``MechanismLigament2d`` object represents a stage of the mechanism. It has a three required parameters, a name, an initial length to draw (relative to the size of the ``Mechanism2d`` object), and an initial angle to draw the ligament in degrees. Ligament angles are relative to the parent ligament, and follow math notation - the same as :ref:`Rotation2d <docs/software/advanced-controls/geometry/pose:Rotation>` (counterclockwise-positive). A ligament based on the root with an angle of zero will point right. Two optional parameters let you change the width (also relative to the size of the Mechanism2d object) and the color. Call ``append()``/``Append()`` on a root node or ligament node to add another node to the figure. In Java, pass a constructed ``MechanismLigament2d`` object to add it. In C++, pass the construction parameters in order to construct and add a ligament.
fr_ca: Chaque objet ``MechanismLigament2d`` représente un niveau du mécanisme. Il a trois paramètres requis, un nom, une longueur initiale à dessiner (par rapport à la taille de l’objet ``Mechanism2d``), et un angle initial pour dessiner le ligament en degrés. Les angles des ligaments sont relatifs au ligament parent et suivent une notation mathématique - la même que :ref:`Rotation2d <docs/software/advanced-controls/geometry/pose:Rotation>` (dans le sens inverse des aiguilles d’une montre, sens positif). Un ligament basé sur la racine avec un angle de zéro pointera vers la droite. Deux paramètres facultatifs vous permettent de modifier la largeur (également par rapport à la taille de l’objet Mechanism2d) et la couleur. Invoquez ``append()``/``Append()`` sur un nœud racine ou un nœud de ligament pour ajouter un autre nœud à la figure. En Java, passez un objet ``MechanismLigament2d`` déjà construit pour l’ajouter. En C++, passez les paramètres de construction afin de construire et d’ajouter un ligament.
tr_tr: Her bir ``MechanismLigament2d`` nesnesi düzeneğin bir aşamasını temsil etmektedir. Nesneler bir isim, (``Mechanism2d`` nesnesinin boyutuna oranla) bir ilk çizim uzunluğu ve bağın dereceler halinde çizilmesini sağlayacak bir ilk açı şeklinde gerekli üç parametreye sahiptir. Bağ açıları, ana bağa orantılı ve (saat yönünün tersine-pozitif) ref:`Rotation2d <docs/software/advanced-controls/geometry/pose:Rotation>` ile aynı matematiksel gösterimi izlemektedir. Açısı sıfır olan ve temelleri köke dayanan bir bağ sağa doğru bakacaktır. İki tercihi parametre, çizginin genişliği (ve ayrıca Mechanism2d nesnesine orantılı boyutu) ile rengini değiştirmeye olanak tanımaktadır. Şekle bir tane daha düğüm eklemek için bir kök düğüme veya bağ düğümüne ``append()``/``Append()`` çağırınız. Java'da şekil üzerine bağ eklemek için yapılı bir ``MechanismLigament2d`` nesnesi iletiniz. C++'daysa bir bağ oluşturmak ve bağı eklemek için yapı parametrelerini çalıştırınız.

source: Then, publish the ``Mechanism2d`` object to NetworkTables:
fr_ca: Ensuite, publiez l’objet ``Mechanism2d`` sur NetworkTables :
tr_tr: Ardından ``Mechanism2d`` nesnesini NetworkTables üzerinden yayınlayınız:

source: The ``Mechanism2d`` instance can also be sent using a lower-level NetworkTables API or using the :ref:`Shuffleboard API <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>`. In this case, the ``SmartDashboard`` API was used, meaning that the :guilabel:`Mechanism2d` widget will appear under the ``SmartDashboard`` table name.
fr_ca: L’instance ``Mechanism2d`` peut également être envoyée à l’aide d’une API NetworkTables de bas niveau ou à l’aide de l’API :ref:`Shuffleboard API <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>`. Dans ce cas, l’API ``SmartDashboard`` a été utilisée, ce qui signifie que le widget :guilabel:`Mechanism2d` apparaîtra sous le nom de la table ``SmartDashboard``.
tr_tr: ``Mechanism2d`` örneği daha alt seviyedeki NetworkTables API veya :ref:`Shuffleboard API <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>` kullanılarak da iletilebilmektedir. Bu örnekte ``SmartDashboard`` API kullanılmıştır, diğer bir değişle :guilabel:`Mechanism2d` aracı, ``SmartDashboard`` tablo adı altında görüntülenebilecektir.

source: To manipulate a ligament angle or length, call ``setLength()`` or ``setAngle()`` on the ``MechanismLigament2d`` object. When manipulating ligament length based off of sensor measurements, make sure to add the minimum length to prevent 0-length (and therefore invisible) ligaments.
fr_ca: Pour manipuler un angle ou une longueur de ligament, invoquer ``setLength()`` ou ``setAngle()`` sur l’objet ``MechanismLigament2d``. Lorsque vous manipulez la longueur des ligaments en fonction des mesures du capteur, assurez-vous d’ajouter la longueur minimale pour éviter les ligaments de longueur 0 (et donc invisibles).
tr_tr: Bağ açısı veya uzunluğunu değiştirmek için ``MechanismLigament2d`` nesnesine ``setLength()`` veya ``setAngle()`` komutlarını çağırınız. 0 uzunluk (ve bu sebeple görünmez) bağları önlemek için, sensör ölçülerinden yola çıkarak bağ uzunluğunu değiştirirken minimum uzunluk değerleri eklemeyi unutmayınız.

source: Viewing the Mechanism2d in Glass
fr_ca: Affichage de Mechanism2d sous Glass
tr_tr: Glass'da Mechanism2d'nin görüntülenmesi

source: After sending the ``Mechanism2d`` instance over NetworkTables, the :guilabel:`Mechanism2d` widget can be added to Glass by selecting :guilabel:`NetworkTables` in the menu bar, choosing the table name that the instance was sent over, and then clicking on the :guilabel:`Field` button.
fr_ca: Après avoir envoyé l’instance ``Mechanism2d`` à traver NetworkTables, le widget :guilabel:`Mechanism2d` peut être ajouté à Glass en sélectionnant :guilabel:`NetworkTables` dans la barre de menus, en choisissant le nom de la table sur laquelle l’instance a été envoyée, puis en cliquant sur le bouton :guilabel:`Field`.
tr_tr: ``Mechanism2d`` örneğini NetworkTables üzerinden gönderdikten sonra menü çubuğunda: guilabel: `NetworkTables` seçilip, örneğin gönderildiği tablo adı seçilerek ve ardından :guilabel:`Field` düğmesine tıklanarak :guilabel:`Mechanism2d` aracı Glass'a eklenebilmektedir.

source: Once the widget appears as shown below, you can resize and place it on the Glass workspace as you desire. Right-clicking the top of the widget will allow you to customize the name of the widget. As the wrist potentiometer and elevator encoder changes, the mechanism will update in the widget.
fr_ca: Une fois que le widget apparaît comme indiqué ci-dessous, vous pouvez le redimensionner et le placer sur l’espace de travail Glass comme vous le souhaitez. Un cliquant sur le bouton droit sur le haut du widget, vous pouver personnaliser le nom du widget. Au fur et à mesure que le potentiomètre du poignet et l’encodeur de l'élevateur changent, les paramètres du mécanisme se mettent à jour dans le widget.
tr_tr: Araç aşağıdaki gibi göründüğünde aracı yeniden boyutlandırıp istediğiniz gibi Glass çalışma alanına ekleyebilirsiniz. Aracın ismi, aracın üst kısmına sağ tıklanarak değiştirilebilmektedir. Bilek potansiyometresi ve asansör kodlayıcısı değiştikçe düzenek, aracı güncelleyecektir.

source: Viewing the Mechanism2d in AdvantageScope
tr_tr: AdvantageScope'da Mechanism2d'nin görüntülenmesi

source: :ref:`AdvantageScope <docs/software/dashboards/advantagescope:AdvantageScope>` is an alternative option for viewing a ``Mechanism2d`` object, including data recorded to a log file using :ref:`WPILib data logs <docs/software/telemetry/datalog:On-Robot Telemetry Recording Into Data Logs>`. Both 2D and 3D visualizations are supported. See the documentation for the `mechanism <https://docs.advantagescope.org/tab-reference/mechanism>`__ and `3D field <https://docs.advantagescope.org/tab-reference/3d-field>`__ tabs for more details.
tr_tr: :ref:`AdvantageScope <docs/software/dashboards/advantagescope:AdvantageScope>` ``Mechanism2d`` nesnesinden gelen, :ref:`WPILib data logs <docs/software/telemetry/datalog:On-Robot Telemetry Recording Into Data Logs>` kullanılarak bir günlük dosyasına kaydedilmiş veriler de dahil olmak üzere, poz verilerini görüntülemek için kullanılabilecek başka bir seçenektir. Hem 2 hem de 3 boyutlu görselleştrime desteği bulunmaktadır. Daha fazla bilgi için bkz. `mechanism <https://docs.advantagescope.org/tab-reference/mechanism>`__ ve `3D field <https://docs.advantagescope.org/tab-reference/3d-field>`__ sekmeleri.

source: Screenshot of an AdvantageScope window displaying a robot and mechanism in 3D.
tr_tr: 3 boyutlu bir şekilde robotu ve düzeneği görüntüleyen bir AdvantageScope penceresinin ekran görüntüsü.

source: Next Steps
fr_ca: Prochaines étapes
tr_tr: Sonraki Adımlar

source: As mentioned above, the Mechanism2d visualization can be combined with :doc:`Physics Simulation </docs/software/wpilib-tools/robot-simulation/physics-sim>` to help you program mechanisms before your robot is built. The ArmSimulation (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/ArmSimulation/cpp/Robot.cpp>`__ / `Python <https://github.com/robotpy/examples/blob/2024.0.0b4/ArmSimulation/robot.py>`__) and ElevatorSimulation (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/ElevatorSimulation/cpp/Robot.cpp>`__ / `Python <https://github.com/robotpy/examples/blob/2024.0.0b4/ElevatorSimulation/robot.py>`__) examples combine physics simulation and Mechanism2d visualization so that you can practice programming a single jointed arm and elevator without a robot.
tr_tr: Yukarıda da belirtildiği üzere robot inşaa edilmeden önce düzeneklerin programlaması için Mechanism2d görselleştirmesi :doc:`Physics Simulation </docs/software/wpilib-tools/robot-simulation/physics-sim>` ile birlikte kullanılabilmektedir. ArmSimulation - Kol Simülasyonu (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/ArmSimulation/cpp/Robot.cpp>`__ / `Python <https://github.com/robotpy/examples/blob/2024.0.0b4/ArmSimulation/robot.py>`__) ve ElevatorSimulation - Asansör Simülasyonu (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/ElevatorSimulation/cpp/Robot.cpp>`__ / `Python <https://github.com/robotpy/examples/blob/2024.0.0b4/ElevatorSimulation/robot.py>`__) örnekleri tek eklemli bir kol ve asansörün robotsuz programlama alıştırmaları yapabilmeniz için fizik simülasyonu ile Mechanism2d görselleştirmesini bir araya getirmektedir.

source: As mentioned above, the Mechanism2d visualization can be combined with :doc:`Physics Simulation </docs/software/wpilib-tools/robot-simulation/physics-sim>` to help you program mechanisms before your robot is built. The ArmSimulation (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/ArmSimulation/cpp/Robot.cpp>`__) and ElevatorSimulation (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/ElevatorSimulation/cpp/Robot.cpp>`__) examples combine physics simulation and Mechanism2d visualization so that you can practice programing a single jointed arm and elevator without a robot.
fr_ca: Comme mentionné ci-dessus, la visualisation de Mechanism2d peut être combinée avec :doc:`Simulation physique </docs/software/wpilib-tools/robot-simulation/physics-sim>` pour vous aider à programmer les mécanismes avant la construction de votre robot. Les exemples ArmSimulation (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armsimulation/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/ArmSimulation/cpp/Robot.cpp>`__) et ElevatorSimulation (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation/Robot.java>`__ / `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/ElevatorSimulation/cpp/Robot.cpp>`__) combinent la simulation physique et la visualisation Mechanism2d afin que vous puissiez vous entraîner à programmer un seul bras articulé et un élevateur sans un robot physique.
