Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/glass/widgets.po
Languages: es_mx, fr_ca, tr_tr

source: Glass Widgets
es_mx: Widgets de Glass
fr_ca: Widgets pour Glass
tr_tr: Glass Araçları

source: Specialized widgets are available for certain types that exist in robot code. These include objects that are manually sent over NetworkTables such as ``SendableChooser`` instances, or hardware that is automatically sent over :ref:`LiveWindow <docs/software/dashboards/smartdashboard/test-mode-and-live-window/displaying-LiveWindow-values:Displaying LiveWindow Values>`.
fr_ca: Des widgets spécialisés sont disponibles pour certains types qui existent dans le code du robot. Ceux-ci incluent des objets qui sont envoyés manuellement sur NetworkTables tels que les instances ``SendableChooser``, ou le matériel qui est automatiquement envoyé sur :ref:`LiveWindow <docs/software/dashboards/smartdashboard/test-mode-and-live-window/displaying -LiveWindow-values:Affichage des valeurs LiveWindow>`.
tr_tr: Robot kodundaki belirli türler için özel araçlar bulunmaktadır. Bu türler arasında ``SendableChooser`` örnekleri gibi NetworkTables üzerinden elle gönderilen nesneler veya :ref:`LiveWindow <docs/software/dashboards/smartdashboard/test-mode-and-live-window/displaying-LiveWindow-values:Displaying LiveWindow Values>` üzerinden kendi kendiliğinden gönderilen donanım bulunmaktadır.

source: Widget support in Glass is still in its infancy -- therefore, there are only a handful of widgets available. This list will grow as development work continues.
es_mx: El soporte de widgets en Glass está todavía en su infancia, por lo que sólo hay un puñado de widgets disponibles. Esta lista crecerá a medida que el trabajo de desarrollo continúe.
fr_ca: La prise en charge des widgets dans Glass en est encore à ses débuts - par conséquent, il n'y a qu'un petit ensemble de widgets disponibles. Cette liste augmentera au fur et à mesure que le travail de développement se poursuivra.
tr_tr: Glass'da widget - araç desteği henüz başlangıç aşamasındadır; bu nedenle, yalnızca birkaç araç mevcuttur. Geliştirme çalışmaları devam ettikçe bu araçların sayısı artacaktır.

source: A widget can be renamed by right-clicking on its header and specifying a new name.
es_mx: Un widget puede ser renombrado haciendo clic con el botón derecho del ratón en su cabecera y especificando un nuevo nombre.
fr_ca: Un widget peut être renommé en cliquant avec le bouton droit de la souris sur son en-tête et en spécifiant un nouveau nom.
tr_tr: Bir araç, başlığına sağ tıklanıp, yeni bir ad belirtilerek yeniden adlandırılabilmektedir.

source: Hardware Widgets
es_mx: Widgets del hardware
fr_ca: Widgets matériels (Hardware)
tr_tr: Donanım Araçları

source: Widgets for specific hardware (such as motor controllers) are usually available via LiveWindow. These can be accessed by selecting the :guilabel:`NetworkTables` menu option, clicking on :guilabel:`LiveWindow` and choosing the desired widget.
es_mx: Widgets de hardware en especifico (como controladores de motor) están disponibles usualmente por medio de LiveWindow. Se puede acceder a estos seleccionando la opción :guilabel:`NetworkTables` en el menú, haciendo clic en :guilabel:`LiveWindow` y escogiendo el widget deseado.
fr_ca: Les widgets pour un matériel spécifique (tels que les contrôleurs de moteur) sont généralement disponibles via LiveWindow. On peut y accéder en sélectionnant l'option de menu :guilabel:`NetworkTables`, en cliquant sur :guilabel:`LiveWindow` et en choisissant le widget souhaité.
tr_tr: (Motor kontrolörleri gibi) belirli donanımlar için geliştirilmiş araçlara genellikle LiveWindow aracılığıyla ulaşılabilmektedir. Bu araçlara: :guilabel: `NetworkTables` menü seçeneğinin seçilmesi, :guilabel:` LiveWindow`'a tıklanması ve istenen pencere öğesinin seçilmesi ile erişilebilmektedir.

source: The list of hardware (sent over LiveWindow automatically) that has widgets is below:
es_mx: La lista de hardware (enviada por LiveWindow automáticamente) que tiene widgets está en la parte de abajo:
fr_ca: La liste du matériel (Hardware), qui est envoyé sur LiveWindow automatiquement et qui a des widgets est ci-dessous:
tr_tr: Araçlara sahip (kendiliğinden LiveWindow üzerinden gönderilen) donanımın listesi aşağıdaki şekildedir:

source: ``SpeedController``
tr_tr: ``SpeedController-Hız kontrol devresi``

source: Here is an example of the widget for gyroscopes:
es_mx: Aquí está un ejemplo del widget para giroscopios:
fr_ca: Voici un exemple de widget pour gyroscopes:
tr_tr: Jiroskoplar için bir araç örneği aşağıdaki şekildedir:

source: Gyro widget with both text and dial visualizations of the current gyro angle. Current Gyro Angle in degrees is -60.9704.
tr_tr: Anlık gyro açısının hem metin hem de kadran görselleştirmeleri içeren bir Gyro aracı. Anlık Gyro Açısı -60.9704 derecedir.

source: Sendable Chooser Widget
es_mx: Widget de elección enviable
fr_ca: Widget Sélecteur envoyable
tr_tr: Sendable Chooser Widget - Gönderilebilir Seçici Aracı

source: The :guilabel:`Sendable Chooser` widget represents a ``SendableChooser`` instance from robot code. It is often used to select autonomous modes. Like other dashboards, your ``SendableChooser`` instance simply needs to be sent using a NetworkTables API. The simplest is to use something like ``SmartDashboard``:
es_mx: El widget :guilabel:`Sendable Chooser`` representa una instancia ``SendableChooser`` del código del robot. A menudo se utiliza para seleccionar modos autónomos. Como otros cuadros de mando, tu instancia "SendableChooser" simplemente necesita ser enviada usando una API de NetworkTables. Lo más simple es usar algo como ``SmartDashboard``:
fr_ca: Le widget :guilabel:`Sendable Chooser` représente une instance ``SendableChooser`` à partir du code du robot. Il est souvent utilisé pour sélectionner des modes autonomes. Comme les autres tableaux de bord, votre instance ``SendableChooser`` doit simplement être envoyée à l'aide d'une API NetworkTables. Le plus simple est d'utiliser quelque chose comme ``SmartDashboard``:
tr_tr: :guilabel:`Sendable Chooser` aracı, robot kodundan bir ``SendableChooser`` örneğini temsil etmektedir. Genellikle otonom modları seçmek için kullanılmaktadır. Diğer gösterge panelleri gibi, ``SendableChooser`` örneğinizin NetworkTables API kullanılarak gönderilmesi gerekmektedir. En basit seçenek ``SmartDashboard`` gibi bir şeyi kullanılmasıdır:

source: For more information on creating a ``SendableChooser``, please see :ref:`this document <docs/software/dashboards/smartdashboard/choosing-an-autonomous-program-from-smartdashboard:Setting up SendableChooser>`.
fr_ca: Pour plus d'informations sur la création d'un ``SendableChooser``, veuillez consulter :ref:`ce document <docs/software/dashboards/smartdashboard/choosing-an-autonomous-program-from-smartdashboard:Setting up SendableChooser>`.
tr_tr: ``SendableChooser`` oluşumuna dair daha fazla bilgi için :ref:`bu belgeyi <docs/software/dashboards/smartdashboard/choosing-an-autonomous-program-from-smartdashboard:Setting up SendableChooser>` inceleyiniz.

source: PID Controller Widget
es_mx: Widget de controlador PID
fr_ca: Widget de contrôleur PID
tr_tr: PID Kontrolör Aracı

source: This allows you to quickly tune P, I, and D values for various setpoints.
es_mx: Esto le permite ajustar rápidamente los valores P, I y D para varios puntos de ajuste.
fr_ca: Cela vous permet de régler rapidement les valeurs P, I et D pour divers points de consigne.
tr_tr: Bu araç, çeşitli ayar noktaları için P, I ve D değerlerini hızlı bir şekilde ayarlamanıza olanak tanımaktadır.

source: PID widget for the Elevator PID Controller. P = 3.0, I = 0.001, D = 0.050, Setpoint = 0.0.
tr_tr: Asansör PID Kontrolörü için PID aracı. P = 3.0, I = 0.001, D = 0.050, Ayar Noktası = 0.0.

source: FMSInfo Widget
fr_ca: Widget FMSInfo
tr_tr: FMSInfo Aracı

source: The :guilabel:`FMSInfo` widget is created by default when Glass connects to a robot. This widget displays basic information about the robot's enabled state, whether a Driver Station is connected, whether an :term:`FMS` is connected, the game-specific data, etc. It can be viewed by selecting the :guilabel:`NetworkTables` menu item and clicking on :guilabel:`FMSInfo`.
tr_tr: :guilabel:`FMSInfo` aracı, Glass bir robota bağlandığında varsayılan olarak olarak oluşturulmaktadır. Bu araç robotun etkin durumu, Driver Station - Sürücü İstasyonunun bağlı olup olmadığı, bir :term:`FMS`'in bağlı olup olmadığı, oyuna özel veriler vb. temel bilgileri görüntülemektedir. Araç, :guilabel:`NetworkTables` menü seçeneğinin seçilip, :guilabel:`FMSInfo`'ya tıklanarak görüntülenebilmektedir.

source: The :guilabel:`Sendable Chooser` widget will appear in the :guilabel:`NetworkTables` menu and underneath the main table name that the instance was sent over. From the example above, the main table name would be :guilabel:`SmartDashboard`.
es_mx: El widget :guilabel:`Seleccionador de envío` aparecerá en el menú :guilabel:`Tablas de red` y bajo el nombre de la tabla principal a la que se envió la instancia. En el ejemplo anterior, el nombre de la tabla principal sería :guilabel:`SmartDashboard`.
fr_ca: Le widget :guilabel:`Sendable Chooser` apparaîtra dans le menu :guilabel:`NetworkTables` et sous le nom de la table principale sur laquelle l'instance a été envoyée. Dans l'exemple ci-dessus, le nom de la table principale serait :guilabel:`SmartDashboard`.

source: The :guilabel:`PID Controller` widget allows you to quickly tune PID values for a certain controller. A ``PIDController`` instance must be sent using a NetworkTables API. The simplest is to use something like ``SmartDashboard``:
es_mx: El widget :guilabel:`PID Controller` le permite ajustar rápidamente los valores del PID para un determinado controlador. Una instancia de ``PIDController`` debe ser enviada utilizando una API de Tablas de Red. Lo más sencillo es utilizar algo como ``SmartDashboard``:
fr_ca: Le widget :guilabel:`PID Controller` vous permet de régler rapidement les valeurs PID pour un certain contrôleur. Une instance ``PIDController`` doit être envoyée à l'aide d'une API NetworkTables. Le plus simple est d'utiliser quelque chose comme ``SmartDashboard``:

source: The :guilabel:`FMSInfo` widget is created by default when Glass connects to a robot. This widget displays basic information about the robot's enabled state, whether a Driver Station is connected, whether an FMS is connected, the game-specific data, etc. It can be viewed by selecting the :guilabel:`NetworkTables` menu item and clicking on :guilabel:`FMSInfo`.
es_mx: El widget :guilabel:`FMSInfo` se crea por defecto cuando Glass se conecta a un robot. Este widget muestra información básica sobre el estado de activación del robot, si está conectado un Driver Station, si está conectado un FMS, los datos específicos del juego, etc. Se puede ver seleccionando el elemento de menú :guilabel:`Tablas de Red` y haciendo clic en :guilabel:`FMSInfo`.
fr_ca: Le widget :guilabel:`FMSInfo` est créé par défaut lorsque Glass se connecte à un robot. Ce widget affiche des informations de base sur l'état activé du robot, si une Driver Station est connectée, si un FMS est connecté, les données spécifiques au jeu, etc. Il peut être visualisé en sélectionnant l'élément de menu :guilabel:`NetworkTables` et en cliquant sur :guilabel:`FMSInfo`.

source: ``DigitalInput``
es_mx: "Entrada digital"

source: ``DigitalOutput``
es_mx: "Salida digital"
