Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/can-devices/can-addressing.po
Languages: es_mx, tr_tr

source: FRC CAN Device Specifications
es_mx: Especificaciones del dispositivo FRC CAN
tr_tr: FRC CAN Cihaz Özellikleri

source: Addressing
es_mx: Direccionamiento
tr_tr: adresleme

source: FRC CAN nodes assign arbitration IDs based on a pre-defined scheme that breaks the ID into 5 components:
es_mx: Los nodos FRC CAN asignan ID de arbitraje basados ​​en un esquema predefinido que divide la ID en 5 componentes:
tr_tr: FRC CAN düğümleri, ID'yi 5 bileşene bölen, önceden tanımlanmış bir şemaya dayalı olarak tanımlar:

source: Device Type
es_mx: Tipo de dispositivo
tr_tr: Cihaz Türü

source: This is a 5-bit value describing the type of device being addressed. A table of currently assigned device types can be found below. If you wish to have a new device type assigned from the ``Reserved`` pool, please submit a request to FIRST.
es_mx: Este es un valor de 5 bits que describe el tipo de dispositivo al que se dirige. Una tabla de los tipos de dispositivos asignados actualmente se puede encontrar a continuación. Si desea que se asigne un nuevo tipo de dispositivo del grupo ``Reservado``, envíe una solicitud a FIRST.
tr_tr: Bu, bahsedilen aygıtın türünü açıklayan 5 bitlik bir değerdir. Aşağıda yeni tanımlanmış cihaz türlerinin bir tablosu bulunmaktadır. ``Rezerve`` bölümünden yeni tür bir cihaz edinmek istiyorsanız, lütfen FIRST'ten talepte bulununuz.

source: Device Types
es_mx: Tipos de dispositivo
tr_tr: Cihaz Türleri

source: Broadcast Messages
es_mx: Mensajes de difusión
tr_tr: Yayın Mesajları - Broadcast

source: Robot Controller
es_mx: Controlador del robot
tr_tr: Robot Kontrolörü

source: Motor Controller
es_mx: Controlador del motor
tr_tr: Motor Kontrolörü

source: Relay Controller
es_mx: Controlador de relé
tr_tr: Röle Kontrolörü

source: Gyro Sensor
es_mx: Sensor giroscópico
tr_tr: Gyro Sensörü

source: Accelerometer
es_mx: Acelerómetro
tr_tr: İvmeölçer

source: Ultrasonic Sensor
es_mx: Sensor ultrasónico
tr_tr: Ultrasonik Sensör

source: Gear Tooth Sensor
es_mx: Sensor de dientes de engranaje
tr_tr: Dişli Sensörü

source: Power Distribution Module
es_mx: Módulo de distribución de energía
tr_tr: Güç Dağıtım Modülü - Power Distribution Module

source: Pneumatics Controller
es_mx: Controlador Neumático
tr_tr: Pnömatik Kontrolörü

source: Reserved
es_mx: Reservado
tr_tr: Rezerve

source: Firmware Update
es_mx: Actualización de firmware
tr_tr: Fabrika Yazılımı güncellemesi

source: Manufacturer
es_mx: Fabricante
tr_tr: Üretici firma

source: This is an 8-bit value indicating the manufacturer of the CAN device. Currently assigned values can be found in the table below. If you wish to have a manufacturer ID assigned from the ``Reserved``\ pool, please submit a request to FIRST.
es_mx: Este es un valor de 8 bits que indica el fabricante del dispositivo CAN. Los valores asignados actualmente se pueden encontrar en la tabla a continuación. Si desea que se asigne un ID de fabricante del grupo ``Reservado``, envíe una solicitud a FIRST.
tr_tr: Bu, CAN cihazının üreticisini belirten 8 bitlik bir değerdir. Şu anda atanan değerler aşağıdaki tabloda bulunabilir. ``Reserved`` havuzundan bir üretici kimliğinin atanmasını istiyorsanız, lütfen FIRST'a bir istek gönderin.

source: Broadcast
es_mx: Emisión
tr_tr: Yayın -Broadcast

source: Team Use
es_mx: Uso del equipo

source: API/Message Identifier
es_mx: API / Identificador de mensaje
tr_tr: API / Mesaj Tanımlayıcı

source: The API or Message Identifier is a 10-bit value that identifies a particular command or message type. These identifiers are unique for each Manufacturer + Device Type combination (so an API identifier that may be a "Voltage Set" for a Luminary Micro Motor Controller may be a "Status Get" for a CTR Electronics Motor Controller or ``Current Get`` for a CTR Power Distribution Module).
es_mx: El identificador de la API o del mensaje es un valor de 10 bits que identifica un comando o un tipo de mensaje particular. Estos identificadores son únicos para cada combinación de Fabricante + Tipo de Dispositivo (por lo que un identificador de API que puede ser un "Voltage Set" para un Luminary Micro Motor Controller puede ser un "Status Get" para un CTR Electronics Motor Controller o ``Current Get`` para un CTR Power Distribution Module).

source: The Message identifier is further broken down into 2 sub-fields: the 6-bit API Class and the 4-bit API Index.
es_mx: El identificador del mensaje se divide en 2 subcampos: la clase API de 6 bits y el índice API de 4 bits.
tr_tr: Mesaj tanımlayıcı 2 alt alana ayrılmıştır: 6 bit API Sınıfı ve 4 bit API Dizini-Index.

source: API Class
es_mx: Clase API
tr_tr: API Sınıfı

source: The API Class is a 6-bit identifier for an API grouping. Similar messages are grouped into a single API Class. An example of the API Classes for the Jaguar Motor Controller is shown in the table below.
es_mx: La clase API es un identificador de 6 bits para una agrupación API. Los mensajes similares se agrupan en una sola clase de API. En la tabla a continuación se muestra un ejemplo de las clases API para el controlador de motor Jaguar.
tr_tr: API Sınıfı, bir API gruplaması için 6 bitlik bir tanımlayıcıdır. Benzer mesajlar tek bir API Sınıfı altında gruplandırılır. Jaguar Motor Controller için API Sınıflarının bir örneği aşağıdaki tabloda gösterilmektedir.

source: Voltage Control Mode
es_mx: Modo de control de voltaje
tr_tr: Gerilim Kontrol Modu

source: Speed Control Mode
es_mx: Modo de control de velocidad
tr_tr: Hız Kontrol Modu

source: Voltage Compensation Mode
es_mx: Modo de compensación de voltaje
tr_tr: Gerilim Kompanzasyon Modu

source: Position Control Mode
es_mx: Modo de control de posición
tr_tr: Pozisyon Kontrol Modu

source: Current Control Mode
es_mx: Modo de control actual
tr_tr: Mevcut Kontrol Modu

source: Status
es_mx: Estado
tr_tr: Durum

source: Periodic Status
es_mx: Estado periódico
tr_tr: Periyodik Durum

source: Configuration
es_mx: Configuración
tr_tr: Yapılandırma

source: API Index
es_mx: Índice API
tr_tr: API Dizini

source: The API Index is a 4-bit identifier for a particular message within an API Class. An example of the API Index values for the Jaguar Motor Controller Speed Control API Class is shown in the table below.
es_mx: El índice API es un identificador de 4 bits para un mensaje en particular dentro de una clase API. En la tabla a continuación se muestra un ejemplo de los valores del índice API para la clase API de control de velocidad del controlador de motor Jaguar.
tr_tr: API Dizini, bir API Sınıfı içindeki belirli bir mesaj için 4 bitlik bir tanımlayıcıdır. Jaguar Motor Controller Hız Kontrolü API Sınıfı için API Dizini değerlerinin bir örneği aşağıdaki tabloda gösterilmektedir.

source: Enable Control
es_mx: Control Enable
tr_tr: Enable Control - Kontrolü Etkinleştir

source: Disable Control
es_mx: Control Disable
tr_tr: Disable Control - Kontrolü Devre Dışı Bırak

source: Set Setpoint
es_mx: Establecer punto de ajuste
tr_tr: Set Setpoint - Ayar Noktasını Ayarla

source: P Constant
es_mx: Constante P
tr_tr: P Sabiti

source: I Constant
es_mx: Constante I
tr_tr: I Sabiti

source: D Constant
es_mx: Constante D
tr_tr: D Sabiti

source: Set Reference
es_mx: Establecer referencia
tr_tr: Set Reference - Referans Ayarla

source: Trusted Set No Ack
es_mx: Confianza sin reconocimiento

source: Trusted Set Setpoint No Ack
es_mx: Punto de ajuste de confianza sin reconocimiento
tr_tr: Güvenilir Ayar Noktası No Ack

source: Set Setpoint No Ack
es_mx: Establecer punto de ajuste sin reconocimiento
tr_tr: Set Setpoint No Ack - Ayar Noktasını Ayarla Onay Yok

source: Device Number
es_mx: Número del dispositivo
tr_tr: Device NUmber - Cihaz numarası

source: Device Number is a 6-bit quantity indicating the number of the device of a particular type. Devices should default to device ID 0 to match other components of the FRC Control System. Device 0x3F may be reserved for device specific broadcast messages.
es_mx: Número de dispositivo es una cantidad de 6 bits que indica el número del dispositivo de un tipo particular. Los dispositivos deben tener el ID de dispositivo 0 para que coincida con otros componentes del sistema de control FRC. El dispositivo 0x3F puede reservarse para mensajes de difusión específicos del dispositivo.
tr_tr: Aygıt Numarası, belirli bir türdeki aygıtın numarasını gösteren 6 bitlik bir miktardır. Cihazlar, FRC Kontrol Sisteminin diğer bileşenleri ile eşleşmesi için varsayılan cihaz kimliği 0 olmalıdır. Cihaz 0x3F, cihaza özel yayın mesajları için ayrılabilir.

source: Protected Frames
es_mx: Marcos Protegidos
tr_tr: Protected Frames - Korumalı Çerçeveler

source: FRC CAN Nodes which implement actuator control capability (motor controllers, relays, pneumatics controllers, etc.) must implement a way to verify that the robot is enabled and that commands originate with the main robot controller (i.e. the roboRIO).
es_mx: Los nodos FRC CAN que implementan la capacidad de control del actuador (controladores de motor, relés, controladores neumáticos, etc.) deben implementar una forma de verificar que el robot esté habilitado y que los comandos se originen con el controlador principal del robot (es decir, el roboRIO).
tr_tr: Aktüatör kontrol yeteneğini uygulayan FRC CAN Düğümleri (motor kontrolörleri, röleler, pnömatik kontrolörleri vb.), Robotun etkinleştirildiğini ve komutların ana robot kontrolöründen (yani roboRIO) geldiğini doğrulamak için bir yol uygulamalıdır.

source: Broadcast messages are messages sent to all nodes by setting the device type and manufacturer fields to 0. The API Class for broadcast messages is 0. The currently defined broadcast messages are shown in the table below:
es_mx: Los mensajes de difusión son mensajes enviados a todos los nodos estableciendo el tipo de dispositivo y los campos del fabricante en 0. La clase de API para mensajes de difusión es 0. Los mensajes de difusión definidos actualmente se muestran en la tabla a continuación:
tr_tr: Yayın mesajları, cihaz türü ve üretici alanları 0 olarak ayarlanarak tüm düğümlere gönderilen mesajlardır. Yayın mesajları için API Sınıfı 0'dır. Şu anda tanımlanmış yayın mesajları aşağıdaki tabloda gösterilmektedir:

source: Description
es_mx: Descripción
tr_tr: Description - Açıklama

source: Disable
es_mx: Inhabilitar
tr_tr: Disable - Devre dışı bırak

source: System Halt
es_mx: Sistema detenido
tr_tr: System Halt - Sistem durdu

source: System Reset
es_mx: Reinicio de sistema

source: Device Assign
es_mx: Asignar dispositivo
tr_tr: Device Assign - Cihaz Atama

source: Device Query
es_mx: Consulta de dispositivo
tr_tr: Device Query - Cihaz Sorgusu

source: Sync
es_mx: Sincronizar

source: Update
es_mx: Actualizar
tr_tr: Update - Güncelleme

source: Firmware Version
es_mx: Versión de firmware
tr_tr: Firmware Sürümü

source: Enumerate
es_mx: Enumerar
tr_tr: Enumerate - Numaralandır

source: System Resume
es_mx: Reanudar sistema
tr_tr: System Resume - Sistem Devam Ettirme

source: Requirements for FRC CAN Nodes
es_mx: Requisitos para los nodos FRC CAN
tr_tr: FRC CAN Düğümleri için Gereksinimler

source: For CAN Nodes to be accepted for use in the FRC System, they must:
es_mx: Para que los nodos CAN sean aceptados para su uso en el sistema FRC, deben:
tr_tr: CAN Düğümlerinin FRC Sisteminde kullanım için kabul edilmesi için, aşağıdakileri yapmaları gerekir:

source: Communicate using Arbitration IDs which match the prescribed FRC format:
es_mx: Comuníquese utilizando ID de arbitraje que coincidan con el formato FRC prescrito:
tr_tr: Öngörülen FRC formatıyla eşleşen Arbitration ID Kimliklerini kullanarak iletişim kurun:

source: A valid, issued CAN Device Type (per Table 1 - CAN Device Types)
es_mx: Un tipo de dispositivo CAN emitido válido (según la Tabla 1 - Tipos de dispositivo CAN)
tr_tr: Geçerli, kullanılan bir CAN Cihaz Tipi (Tablo 1'e göre - CAN Cihaz Tipleri)

source: A valid, issued Manufacturer ID (per Table 2 - CAN Manufacturer Codes)
es_mx: Una ID de fabricante válida y emitida (según la Tabla 2 - Códigos de fabricante de CAN)
tr_tr: Geçerli, yayınlanmış bir Üretici Kimliği (Tablo 2'ye göre - CAN Üretici Kodları)

source: API Class(es) and Index(s) assigned and documented by the device manufacturer
es_mx: Clase(s) e índice(s) API asignados y documentados por el fabricante del dispositivo
tr_tr: API Sınıf (ları) ve Dizin (leri) Cihaz üreticisi tarafından atanır ve belgelendirilir.

source: A user selectable device number if multiple units of the device type are intended to co-exist on the same network.
es_mx: Un número de dispositivo seleccionable por el usuario si se pretende que varias unidades del tipo de dispositivo coexistan en la misma red.
tr_tr: Cihaz tipinin birden fazla biriminin aynı ağda birlikte var olması amaçlanıyorsa, kullanıcı tarafından seçilebilen bir cihaz numarası.

source: Support the minimum Broadcast message requirements as detailed in the Broadcast Messages section.
es_mx: Admite los requisitos mínimos de mensajes de transmisión como se detalla en la sección Mensajes de transmisión.
tr_tr: Yayın Mesajları bölümünde ayrıntılı olarak açıklanan minimum Yayın mesajı gereksinimlerini destekleyin.

source: Red alliance
es_mx: Alianza roja

source: Enabled
es_mx: Habilitado

source: Autonomous mode
es_mx: Modo autónomo

source: Test mode
es_mx: Modo de prueba

source: Tournament type
es_mx: Tipo de torneo

source: Time of day (year)
es_mx: Tiempo del día (año)

source: Time of day (month)
es_mx: Tiempo del día (mes)

source: Time of day (day)
es_mx: Tiempo del día (día)

source: Time of day (seconds)
es_mx: Tiempo del día (segundos)

source: Time of day (minutes)
es_mx: Tiempo del día (minutos)

source: Time of day (hours)
es_mx: Tiempo del día (horas)

source: Note that all fields except ``Enabled``, ``Autonomous mode``, ``Test mode``, and ``System watchdog`` will contain invalid values until an arbitrary time after the Driver Station connects.
es_mx: Tenga en cuenta que todos los campos excepto "Enabled", "Autonomous mode", "Test mode" y "System watchdog" contendrán valores no válidos hasta un tiempo arbitrario después de que se conecte la Driver Station.

source: Miscellaneous
tr_tr: Çeşitli

source: The API or Message Identifier is a 10-bit value that identifies a particular command or message type. These identifiers are unique for each Manufacturer + Device Type combination (so an API identifier that may be a “Voltage Set” for a Luminary Micro Motor Controller may be a “Status Get” for a CTR Electronics Motor Controller or ``Current Get`` for a CTR Power Distribution Module).
tr_tr: API veya Message Identifier, belirli bir komutu veya mesaj türünü tanımlayan 10 bitlik bir değerdir. Bu tanımlayıcılar, her Üretici + Cihaz Tipi kombinasyonu için benzersizdir (bu nedenle, bir Luminary Mikro Motor Kontrol Cihazı için bir “Voltage Set” olabilen bir API tanımlayıcısı, bir CTR Elektronik Motor Kontrol Cihazı için bir “Status Get” veya CTR Güç Dağıtım Modülü için ``Current Get`` olabilir.).

source: Ack
tr_tr: Ack - onay

source: Heartbeat
tr_tr: Heartbeat - Kalp atışı

source: Devices should disable immediately when receiving the Disable message (arbID 0), implementation of other broadcast messages is optional.
tr_tr: Devre dışı bırak mesajını (arbID 0) alırken cihazlar hemen devre dışı bırakılmalıdır, diğer yayın mesajlarının uygulanması isteğe bağlıdır.

source: If controlling actuators, utilize a scheme to assure that the robot is issuing commands, is enabled, and is still present
tr_tr: Aktüatörleri kontrol ediyorsa, robotun komutlar verdiğinden, etkinleştirildiğinden ve hala mevcut olduğundan emin olmak için bir şema kullanın
