Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/can-devices/power-distribution-module.po
Languages: fr_ca, tr_tr

source: Power Distribution Module
fr_ca: Module de distribution d'alimentation (PDP)
tr_tr: Güç Dağıtım Modülü - Power Distribution Module

source: The CTRE Power Distribution Panel (PDP) and Rev Power Distribution Hub (PDH) can use their CAN connectivity to communicate a wealth of status information regarding the robot's power use to the roboRIO, for use in user code. This has the capability to report current temperature, the bus voltage, the total robot current draw, the total robot energy use, and the individual current draw of each device power channel. This data can be used for a number of advanced control techniques, such as motor torque limiting and brownout avoidance.
fr_ca: Le panneau de distribution d'alimentation CTRE (PDP) et le concentrateur de distribution d'alimentation Rev (PDH) peuvent utiliser leur connectivité CAN pour communiquer une multitude d'informations d'état concernant la consommation d'énergie du robot au roboRIO, pour une utilisation dans le code utilisateur. Ceux-ci ont la capacité de signaler la température actuelle, la tension du bus, la consommation totale de courant du robot, la consommation totale d'énergie du robot et la consommation de courant individuelle de chaque canal d'alimentation pour chacun des composants. Ces données peuvent être utilisées dans un certain nombre de techniques de contrôle avancées, telles que la limitation du couple moteur et l'évitement des baisses de tension.

source: Creating a Power Distribution Object
fr_ca: Création d'un objet PowerDistribution
tr_tr: Güç Dağıtım Nesnesi Oluşturmak

source: To use the either Power Distribution module, create an instance of the :code:`PowerDistribution` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/PowerDistribution.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_power_distribution.html>`__). With no arguments, the Power Distribution object will be detected, and must use CAN ID of 0 for CTRE or 1 for REV. If the CAN ID is non-default, additional constructors are available to specify the CAN ID and type.
fr_ca: Pour utiliser l’un ou l’autre module de distribution de puissance, créez une instance de la classe :code:`PowerDistribution` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/PowerDistribution.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_power_distribution.html>`__). Sans arguments, l’objet :code:`PowerDistribution` sera détecté et doit utiliser l’ID CAN de 0 pour CTRE ou 1 pour REV. Si l’ID CAN n’est pas défini par défaut, des constructeurs supplémentaires sont disponibles pour spécifier l’ID et le type de CAN.

source: Note: it is not necessary to create a PowerDistribution object unless you need to read values from it. The board will work and supply power on all the channels even if the object is never created.
fr_ca: Remarque : il n'est pas nécessaire de créer un objet PowerDistribution, sauf si vous avez besoin d'en lire des valeurs. La carte fonctionnera et alimentera tous les canaux même si l'objet n'est jamais créé.
tr_tr: Nesneden değerlerin okunması gerekmedikçe Güç Dağıtım nesnesinin oluşturulması gerekli değildir. Pano, nesne hiç oluşturulmamış olsa bile, çalışacak ve tüm kanallara güç aktarabilecektir.

source: To enable voltage and current logging in the Driver Station, the CAN ID for the CTRE Power Distribution Panel *must* be 0, and for the REV Power Distribution Hub it *must* be 1.
fr_ca: Pour activer l’enregistrement de la tension et du courant dans l'application Driver Station, l’ID CAN du panneau de distribution d’alimentation CTRE *doit* être configuré avec la valeur 0, et pour le concentrateur de distribution d’alimentation REV, il *doit* être configuré avec la valeur 1.

source: Reading the Bus Voltage
fr_ca: Lecture de la tension sur le système électrique
tr_tr: Veriyolu Voltajının Okunması

source: Monitoring the bus voltage can be useful for (among other things) detecting when the robot is near a brownout, so that action can be taken to avoid brownout in a controlled manner. See the :doc:`roboRIO Brownouts document</docs/software/roborio-info/roborio-brownouts>` for more information.
fr_ca: La surveillance de la tension du système électrique peut être utile (entre autres) pour détecter quand la batterie du robot faiblit, et que la tension actuelle s'approche de la tension minimale d'opération. Des mesures de prévention peuvent être alors prises pour éviter la panne incontrôlée du robot. Voir le document :doc:`roboRIO Brownouts </docs/software/roborio-info/roborio-brownouts>` pour plus d'informations.
tr_tr: Veriyolu voltajının izlenmesi (diğer şeylerin yanı sıra) ani bir voltaj düşüklüğünü kontrollü bir şekilde önlemek için robotun bu ani düşüşe yakınlığını tespit etmek için yararlı olabilmektedir. Daha fazla bilgi için bkz. :doc:`roboRIO Brownouts document </docs/software/roborio-info/roborio-brownouts>`.

source: Reading the Temperature
fr_ca: Lecture de la température
tr_tr: Sıcaklığın Okunması

source: Monitoring the temperature can be useful for detecting if the robot has been drawing too much power and needs to be shut down for a while, or if there is a short or other wiring problem.
fr_ca: La surveillance de la température peut être utile pour détecter si le robot a consommé trop d'énergie et doit être mis à l'arrêt pendant un certain temps, ou encore, s'il y a un court-circuit ou un autre problème de câblage qui crée un surchauffement.
tr_tr: Sıcaklığın izlenmesi, robotun aşırı miktarda güç çekip çekmediğini ve bir süredir kapatılması gerekip gerekmediğini ya da kısa devre veya başka bir kablolama sorunu olup olmadığını tespit etmek için yararlı olabilmektedir.

source: Reading the Total Current, Power, and Energy
fr_ca: Lecture du courant total, de la puissance et de l'énergie
tr_tr: Anlık Akım, Güç ve Enerjinin Okuması

source: Monitoring the total current, power and energy can be useful for controlling how much power is being drawn from the battery, both for preventing brownouts and ensuring that mechanisms have sufficient power available to perform the actions required. Power is the bus voltage multiplied by the current with the units Watts. Energy is the power summed over time with units Joules.
fr_ca: La surveillance du courant total, de la puissance et de l’énergie peut être utile pour contrôler la quantité d’énergie tirée de la batterie, à la fois pour prévenir les pannes de courant et pour s’assurer que les mécanismes disposent d’une puissance suffisante pour effectuer les actions requises. La puissance est obtenue en multipliant la tension du bus par le courant et pour unité le Watt. L’énergie est la puissance additionnée dans le temps et a pour unité le Joule.

source: Reading Individual Channel Currents
fr_ca: Lecture des courants des canaux individuels
tr_tr: Her Bir Kanal Akımının Okunması

source: The PDP/PDH also allows users to monitor the current drawn by the individual device power channels. You can read the current on any of the 16 PDP channels (0-15) or 24 PDH channels (0-23). For example, to read the current on channel 0:
fr_ca: Le PDP/PDH permet également aux utilisateurs de lire le courant consommé par les canaux d'alimentation de chaque composant. Vous pouvez lire le courant de n'importe lequel des 16 canaux du PDP (0-15) ou des 24 canaux du PDH (0-23). Par exemple, pour lire le courant sur le canal 0:

source: Monitoring individual device current draws can be useful for detecting shorts or stalled motors.
fr_ca: La surveillance de la consommation de courant de chaque dispositif peut être utile pour détecter les courts-circuits ou les moteurs bloqués.
tr_tr: Cihazın çektiği her bir akımın izlenmesi, kısa devreleri veya durmuş motorları tespit etmek için faydalı olabilmektedir.

source: Using the Switchable Channel (PDH)
fr_ca: Utilisation du canal commutable (PDH)
tr_tr: Değiştirilebilir (PDH) Kanalının Kullanımı

source: The REV PDH has one channel that can be switched on or off to control custom circuits.
fr_ca: Le REV PDH est pourvu d’un canal qui peut être activé ou désactivé pour contrôler des circuits personnalisés.
tr_tr: REV PDH özel devrelerin kontrolü için açılıp kapanabilen bir kanala sahiptir.

source: The CTRE Power Distribution Panel (:term:`PDP`) and Rev Power Distribution Hub (:term:`PDH`) can use their :term:`CAN` connectivity to communicate a wealth of status information regarding the robot's power use to the roboRIO, for use in user code. This has the capability to report current temperature, the bus voltage, the total robot current draw, the total robot energy use, and the individual current draw of each device power channel. This data can be used for a number of advanced control techniques, such as motor :term:`torque` limiting and brownout avoidance.
tr_tr: CTRE Güç dağıtım Modülü - Power Distribution Panel (:term:`PDP`) ve Rev Güç Dağıtım Merkezi - Power Distribution Hub (:term:`PDH`) :term:`CAN` bağlanabilirlikleri sayesinde robotun güç kullanımına dair bol miktarda durum bilgisini kullanıcı kodunda kullanım için roboRIO'ya iletebilmektedir. Bu durum, anlık sıcaklık, veri yolu voltaj, robotun çektiği toplam akım, toplam robot enerji tüketimi ve her bir cihaz güç kanalından çekilen akıma dair bilgilendirmeye olanak tanımaktadır. Bu veriler, voltaj azalmasından kaçınmayı sınırlayan motor :term:`tork`u gibi, birçok gelişmiş kontrol yöntemleri için kullanılabilmektedir.

source: To use the either Power Distribution module, create an instance of the :code:`PowerDistribution` class (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/PowerDistribution.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_power_distribution.html>`__, :external:py:class:`Python <wpilib.PowerDistribution>`). With no arguments, the Power Distribution object will be detected, and must use CAN ID of 0 for CTRE or 1 for REV. If the CAN ID is non-default, additional constructors are available to specify the CAN ID and type.
tr_tr: İki Güç Dağıtım modülünden herhangi birini kullanmak için :code:`PowerDistribution` sınıfının (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/PowerDistribution.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_power_distribution.html>`__, :external:py:class:`Python <wpilib.PowerDistribution>`) bir oluşumunu yaratın. Hiçbir değişken olmadan Güç Dağıtım nesnesi algılanacaktır ve CTRE için CAN ID değeri 0 veya REV için CAN ID değeri 1 olması gerekmektedir. CAN ID varsayılanın dışındaysa CAN ID değeri ve türünü belirlemek için kullanılabilecek constructor'lar mevcuttur.

source: Monitoring the total current, power, and energy can be useful for controlling how much power is being drawn from the battery, both for preventing brownouts and ensuring that mechanisms have sufficient power available to perform the actions required. Power is the bus voltage multiplied by the current with the units Watts. Energy is the power summed over time with units Joules.
tr_tr: Anlık akım, güç ve enerjinin izlenmesi; hem ani voltaj düşüklüklerini önlemekte hem de düzeneğin gerekli eylemleri yerine getirecek miktarda enerjiye erişebilmesini sağlamak için aküden ne kadar güç alındığını izlemek adına faydalı olabilmektedir. Güç, Watt ile gösterilen, veri yolu voltajının akım değeriyle çarpımıdır. Enerji, Jul ile gösterilen, gücün belirli bir zaman içerisindeki toplamıdır.

source: The PDP/PDH also allows users to monitor the current drawn by the individual device power channels. You can read the current on any of the 16 PDP channels (0-15) or 24 PDH channels (0-23).
tr_tr: PDP/PDH kullanıcıların cihazın her bir güç kanalından çektiği akımın izlenmesine olanak tanımaktadır. (0-15) 16 PDP kanalı veya (0-23) 24 PDH kanalından herhangi birinin akım değerini okuyabilirsiniz.
