Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/can-devices/power-distribution-panel.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Power Distribution Panel
es_mx: Panel de distribución de energía
fr_ca: Panneau de distribution de Puissance (PDP)
zh_cn: 配电板

source: The Power Distribution Panel (PDP) can use its CAN connectivity to communicate a wealth of status information regarding the robot's power use to the roboRIO, for use in user code. The PDP has the capability to report its current temperature, the bus voltage, the total robot current draw, the total robot energy use, and the individual current draw of each device power channel. These data can be used for a number of advanced control techniques, such as motor torque limiting and brownout avoidance.
es_mx: El Panel de distribución de energía (PDP) puede usar su conectividad CAN para comunicar una gran cantidad de información de estado sobre el uso de energía del robot al roboRIO, para usar en el código de usuario. El PDP tiene la capacidad de informar su temperatura actual, el voltaje del bus, el consumo de corriente total del robot, el uso total de energía del robot y el consumo de corriente individual de cada canal de alimentación del dispositivo. Estos datos se pueden utilizar para una serie de técnicas de control avanzadas, como la limitación del torque del motor y evitar caídas de tensión.
fr_ca: Le panneau de distribution de puissance (PDP) peut utiliser le bus CAN pour communiquer une multitude d'informations d'état concernant la consommation d'énergie du robot au roboRIO, afin de permettre aux programmeurs de créer des programmes de robots plus performants. Le PDP a la capacité de mesurer sa température actuelle, la tension du bus, la consommation totale de courant du robot, la consommation totale d'énergie du robot et la consommation de courant individuelle de chaque canal d'alimentation de l'appareil. Ces données peuvent être utilisées pour un certain nombre de techniques de contrôle avancées, telles que la limitation du couple moteur et la bonne gestion du robot lorsqu'il y a des baisses de tension.
tr_tr: Power Distribution Panel (PDP), kullanıcı kodunda kullanılmak üzere robotun güç kullanımına ilişkin çok sayıda durum bilgisini roboRIO'ya iletmek için CAN bağlantısını kullanabilir. PDP, mevcut sıcaklığını, veriyolu voltajını, toplam robot akım çekişini, toplam robot enerji kullanımını ve her bir cihaz güç kanalının bireysel akım çekimini raporlama özelliğine sahiptir. Bu veriler, motor torku sınırlama ve voltaj düşmesini önleme gibi bir dizi gelişmiş kontrol tekniği için kullanılabilir.
zh_cn: 配电板（PDP）可以通过CAN连接将大量有关于机器人电源使用的状况反馈给RIO，以供用户编写代码。PDP可以反馈当前的温度、总线电压、总电流消耗、总电量消耗和每个设备的电流消耗。这些数据可以用于许多的高级技术，比如说转矩限制与避免电压降低.

source: Creating a PDP Object
es_mx: Creando un objeto PDP
fr_ca: Création d'un objet PDP
tr_tr: PDP Nesnesi Yaratma
zh_cn: 创建一个PDP对象

source: To use the PDP, create an instance of the :code:`PowerDistributionPanel` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/PowerDistributionPanel.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1PowerDistributionPanel.html>`__):
es_mx: Para utilizar el PDP, cree una instancia de la clase :code:`PowerDistributionPanel` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/PowerDistributionPanel.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1PowerDistributionPanel.html>`__):
fr_ca: Pour utiliser le PDP, créez une instance de la classe :code:`PowerDistributionPanel` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/PowerDistributionPanel.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1PowerDistributionPanel.html>`__):
tr_tr: PDP'yi kullanmak için şu öğenin bir örneğini oluşturun :code: `PowerDistributionPanel`sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/PowerDistributionPanel.html>`__, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1PowerDistributionPanel.html>` __):
zh_cn: 要使用PDP，请创建:code:`PowerDistributionPanel`类的实例 (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/PowerDistributionPanel.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1PowerDistributionPanel.html>`__):

source: Note: it is not necessary to create a PowerDistributionPanel object unless you need to read values from it. The board will work and supply power on all the channels even if the object is never created.
es_mx: Nota: no es necesario crear un objeto PowerDistributionPanel a menos que necesite leer valores de él. La placa funcionará y suministrará energía en todos los canales, incluso si el objeto nunca se crea.
fr_ca: Remarque: il n'est pas nécessaire de créer un objet PowerDistributionPanel, sauf si vous devez en lire les valeurs. La carte fonctionnera et alimentera tous les canaux même si l'objet n'a jamais été créé.
tr_tr: Not: Değerleri okumanız gerekmedikçe bir PowerDistributionPanel nesnesi oluşturmanız gerekmez. Nesne hiç yaratılmamış olsa bile pano çalışacak ve tüm kanallarda güç sağlayacaktır.
zh_cn: 注意：除非你想从PDP中读取数据，不然没有必要创建一个PDP对象。即使你从未创建过该对象，PDP也将在所有线路上工作并供电。

source: To enable voltage and current logging in the Driver Station, the CAN ID for the PDP *must* be 0.
es_mx: Para habilitar el registro de voltaje y corriente en la Driver Station, la ID de CAN para el PDP *debe* ser 0.
fr_ca: Pour activer l'enregistrement de la tension et du courant dans la Driver Station, l'ID CAN du PDP *doit* être à 0.
tr_tr: Sürücü İstasyonunda gerilim ve akım kaydını etkinleştirmek için, PDP * için CAN Kimliği * 0 olmalıdır.
zh_cn: 为了在驱动站中启动电流与电压的记录，PDP的CAN ID*必须*是0.

source: Reading the Bus Voltage
es_mx: Lectura del voltaje del bus
fr_ca: Lecture de la tension sur le système électrique
tr_tr: Veriyolu Voltajı-Bus Voltage Okuma
zh_cn: 读取总线电压

source: Monitoring the bus voltage can be useful for (among other things) detecting when the robot is near a brownout, so that action can be taken to avoid brownout in a controlled manner. See the :doc:`roboRIO Brownouts document</docs/software/roborio-info/roborio-brownouts>` for more information.
es_mx: Monitorear el voltaje del bus puede ser útil para (entre otras cosas) detectar cuando el robot está cerca de un apagón, de modo que se pueden tomar medidas para evitar el apagón de manera controlada. Consulte el documento :doc:`roboRIO Brownouts document</docs/software/roborio-info/roborio-brownouts>` para obtener más información.
fr_ca: La surveillance de la tension du système électrique peut être utile (entre autres) pour détecter quand la batterie du robot faiblit, et que la tension actuelle s'approche de la tension minimale d'opération. Des mesures de prévention peuvent être alors prises pour éviter la panne incontrôlée du robot. Voir le document :doc:`roboRIO Brownouts </docs/software/roborio-info/roborio-brownouts>` pour plus d'informations.
tr_tr: Veriyolu voltajının izlenmesi, (diğer şeylerin yanı sıra), robotun bir elektrik kesintisine yakın olduğunu tespit etmek için yararlı olabilir, böylece kontrollü bir şekilde kesintiyi önlemek için önlem alınabilir. Daha fazla bilgi için :doc:`roboRIO Brownouts document </docs/software/roborio-info/roborio-brownouts>` belgesine bakın.
zh_cn: 监测总电压对于检测机器人何时电量不足是很有用的（相比其他事情而言），由此我们可以采取措施，以受控的方式防止电量不足。有关更多信息，请参见:doc:`roboRIO限电文档</docs/software/roborio-info/roborio-brownouts>`。

source: Reading the Temperature
es_mx: Leyendo la temperatura
fr_ca: Lecture de la température
tr_tr: Sıcaklığın Okunması
zh_cn: 读取温度

source: Monitoring the temperature can be useful for detecting if the robot has been drawing too much power and needs to be shut down for a while, or if there is a short or other wiring problem.
es_mx: El monitoreo de la temperatura puede ser útil para detectar si el robot ha consumido demasiada energía y necesita apagarse por un tiempo, o si hay un problema de cableado corto u otro.
fr_ca: La surveillance de la température peut être utile pour détecter si le robot a consommé trop d'énergie et doit être mis à l'arrêt pendant un certain temps, ou encore, s'il y a un court-circuit ou un autre problème de câblage qui crée un surchauffement.
tr_tr: Sıcaklığın izlenmesi, robotun çok fazla güç çekip çekmediğini ve bir süredir kapatılması gerekip gerekmediğini veya kısa veya başka bir kablolama sorunu olup olmadığını tespit etmek için yararlı olabilir.
zh_cn: 监测温度对于检测机器人是否消耗了过多功率而需要停机一会或是存在短路或其他布线问题是很有用。

source: Reading the Total Current and Energy
es_mx: Lectura de la corriente total y la energía
fr_ca: Lecture du courant total et de l'énergie
tr_tr: Toplam Akımı ve Enerjiyi Okuma
zh_cn: 读取总电流和能量

source: Monitoring the total current and total energy (the total energy is simply the total current multiplied by the bus voltage) can be useful for controlling how much power is being drawn from the battery, both for preventing brownouts and ensuring that mechanisms have sufficient power available to perform the actions required.
es_mx: El monitoreo de la corriente total y la energía total (la energía total es simplemente la corriente total multiplicada por el voltaje del bus) puede ser útil para controlar la cantidad de energía que se extrae de la batería, tanto para evitar caídas de tensión como para garantizar que los mecanismos tengan suficiente energía disponible para realizar las acciones requeridas
fr_ca: La lecture du courant total et de l'énergie totale (l'énergie totale est simplement le courant total multiplié par la tension de la batterie) peut être utile pour contrôler la quantité d'énergie tirée de la batterie, à la fois pour éviter les baisses de tension et pour garantir que les mécanismes disposent d'une puissance suffisante pour effectuer les actions requises.
tr_tr: Toplam akımın ve toplam enerjinin izlenmesi (toplam enerji basitçe toplam akımın bara voltajıyla çarpımıdır), hem elektrik kesintilerini önlemek hem de mekanizmaların yeterli güce sahip olmasını sağlamak için bataryadan ne kadar güç çekildiğini kontrol etmek ve gerekli eylemleri gerçekleştirmek için yararlı olabilir.
zh_cn: 监测总电流与总能量（总能量即总电流乘以总电压）对于控制电量使用的多少很有用。这既可以检测电量不足，也可以确保电源有足够的电量来完成接下来的操作。

source: Reading Individual Channel Currents
es_mx: Lectura de corrientes de canales individuales
fr_ca: Lecture des courants des canaux individuels
tr_tr: Özel Kanal Akımlarını Okuma
zh_cn: 读取单个通道电流

source: The PDP also allows users to monitor the current drawn by the individual device power channels. For example, to read the current on channel 0:
es_mx: El PDP también permite a los usuarios monitorear la corriente consumida por los canales de alimentación del dispositivo individual. Por ejemplo, para leer la corriente en el canal 0:
fr_ca: Le PDP permet également aux utilisateurs de lire le courant consommé par les canaux d'alimentation de chaque dispositif. Par exemple, pour lire le courant sur le canal 0:
tr_tr: PDP ayrıca, kullanıcıların ayrı cihaz güç kanalları tarafından çekilen akımı izlemesine olanak tanır. Örneğin, 0 kanalındaki akımı okumak için:
zh_cn: PDP还允许使用者监测各条电路上的电流。例如:要读取线路0上的电流：

source: Monitoring individual device current draws can be useful for detecting shorts or stalled motors.
es_mx: El monitoreo de las corrientes de corriente de dispositivos individuales puede ser útil para detectar cortocircuitos o motores estancados.
fr_ca: La surveillance de la consommation de courant de chaque dispositif peut être utile pour détecter les courts-circuits ou les moteurs bloqués.
tr_tr: Cihazın ayrı ayrı akım çekimlerini izlemek, kısa devreleri veya durmuş motorları tespit etmek için faydalı olabilir.
zh_cn: 监测单条电路的电流对于检测短路或电机停转很有用。
