Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/can-devices/third-party-devices.po
Languages: fr_ca, tr_tr, zh_cn

source: Third-Party CAN Devices
fr_ca: Périphériques CAN provenant de tierce-partie
tr_tr: Üçüncü Taraf CAN Cihazları
zh_cn: 第三方CAN设备

source: A number of FRC\ |reg| vendors offer their own :term:`CAN` peripherals. As CAN devices offer expansive feature-sets, vendor CAN devices require similarly expansive code libraries to operate. As a result, these libraries are not maintained as an official part of WPILib, but are instead maintained by the vendors themselves. For a guide to installing third-party libraries, see :ref:`3rd Party Libraries <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>`
fr_ca: Un certain nombre de fournisseurs FRC\ |reg| proposent leurs propres périphériques :term:`CAN`. Comme les appareils CAN offrent un ensemble étendu de fonctionnalités, les appareils CAN des fournisseurs nécessitent des librairies de codes tout aussi étendues pour fonctionner. Par conséquent, ces librairies ne sont pas gérées en tant que partie officielle de WPILib, mais sont plutôt gérées par les fournisseurs eux-mêmes. Pour un guide sur l'installation de librairies tierces, consultez :ref:`3rd Party Libraries <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>`

source: A list of common third-party CAN devices from various vendors, along with links to corresponding external documentation, is provided below:
fr_ca: Une liste des périphériques CAN tiers courants de divers fournisseurs, ainsi que des liens vers la documentation externe correspondante, sont fournis ci-dessous:
tr_tr: Çeşitli satıcılardan ortak üçüncü taraf CAN cihazlarının bir listesi ve ilgili harici belgelere bağlantılar aşağıda verilmiştir:
zh_cn: 以下提供了来自各个供应商的一些常见的第三方CAN设备，以及连接外部文档的链接。

source: CTR Electronics (CTRE) offers several CAN peripherals with external libraries. General resources for all CTRE devices include:
fr_ca: CTR Electronics (CTRE) propose plusieurs périphériques CAN avec des bibliothèques externes. Les ressources générales pour tous les composants CTRE incluent :

source: `Phoenix Device Software Documentation <https://docs.ctr-electronics.com/>`__
fr_ca: `Documentation accompagnant l'utilitaire phoenix <https://docs.ctr-electronics.com/>`__

source: CTRE Motor Controllers
fr_ca: Contrôleurs de moteur CTRE
tr_tr: CTRE Motor Kontrolörleri
zh_cn: CTRE电机控制器

source: **Talon FX (with Falcon 500 Motor)**
fr_ca: **Talon FX (avec moteur Falcon 500)**
zh_cn: ** Talon FX（搭配Falcon 500马达）**

source: API Documentation (v5: `Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/motorcontrol/can/WPI_TalonFX.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_w_p_i___talon_f_x.html>`__ | Pro: `Java <https://api.ctr-electronics.com/phoenixpro/release/java/com/ctre/phoenixpro/hardware/TalonFX.html>`__, `C++ <https://api.ctr-electronics.com/phoenixpro/release/cpp/classctre_1_1phoenixpro_1_1hardware_1_1_talon_f_x.html>`__)
fr_ca: Documentation d’API (v5: `Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/motorcontrol/can/WPI_TalonFX.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_w_p_i___talon_f_x.html>`__ | Pro: `Java <https://api.ctr-electronics.com/phoenixpro/release/java/com/ctre/phoenixpro/hardware/TalonFX.html>`__, `C++ <https://api.ctr-electronics.com/phoenixpro/release/cpp/classctre_1_1phoenixpro_1_1hardware_1_1_talon_f_x.html>`__)

source: `Hardware User's Manual <https://store.ctr-electronics.com/content/user-manual/Falcon%20500%20User%20Guide.pdf>`__
fr_ca: `Manuel d’utilisation du matériel <https://store.ctr-electronics.com/content/user-manual/Falcon%20500%20User%20Guide.pdf>`__

source: Software Documentation (`v5 <https://v5.docs.ctr-electronics.com/en/stable/ch13_MC.html>`__, `Pro <https://pro.docs.ctr-electronics.com/en/stable/docs/api-reference/examples/quickstart.html>`__)
fr_ca: Documentation logicielle (`v5 <https://v5.docs.ctr-electronics.com/en/stable/ch13_MC.html>`__, `Pro <https://pro.docs.ctr-electronics.com/en/stable/docs/api-reference/examples/quickstart.html>`__)

source: API Documentation (`Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/motorcontrol/can/WPI_TalonSRX.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_w_p_i___talon_s_r_x.html>`__)
fr_ca: Documentation d’API (`Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/motorcontrol/can/WPI_TalonSRX.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_w_p_i___talon_s_r_x.html>`__)

source: `Hardware User's Manual <https://store.ctr-electronics.com/content/user-manual/Talon%20SRX%20User's%20Guide.pdf>`__
fr_ca: `Manuel d’utilisation du matériel <https://store.ctr-electronics.com/content/user-manual/Talon%20SRX%20User's%20Guide.pdf>`__

source: `Software Documentation <https://v5.docs.ctr-electronics.com/en/stable/ch13_MC.html>`__
fr_ca: `Documentation logicielle <https://v5.docs.ctr-electronics.com/en/stable/ch13_MC.html>`__

source: API Documentation (`Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/motorcontrol/can/WPI_VictorSPX.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_w_p_i___victor_s_p_x.html>`__)
fr_ca: Documentation d’API (`Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/motorcontrol/can/WPI_VictorSPX.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_w_p_i___victor_s_p_x.html>`__)

source: `Hardware User's Manual <https://store.ctr-electronics.com/content/user-manual/Victor%20SPX%20User's%20Guide.pdf>`__
fr_ca: `Manuel d’utilisation du matériel <https://store.ctr-electronics.com/content/user-manual/Victor%20SPX%20User's%20Guide.pdf>`__

source: CTRE Sensors
fr_ca: Capteurs CTRE
tr_tr: CTRE Sensörleri
zh_cn: CTRE 传感器

source: API Documentation (v5: `Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/sensors/WPI_CANCoder.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1sensors_1_1_w_p_i___c_a_n_coder.html>`__ | Pro: `Java <https://api.ctr-electronics.com/phoenixpro/release/java/com/ctre/phoenixpro/hardware/CANcoder.html>`__, `C++ <https://api.ctr-electronics.com/phoenixpro/release/cpp/classctre_1_1phoenixpro_1_1hardware_1_1_c_a_ncoder.html>`__)
fr_ca: Documentation d’API (v5: `Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/sensors/WPI_CANCoder.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1sensors_1_1_w_p_i___c_a_n_coder.html>`__ | Pro: `Java <https://api.ctr-electronics.com/phoenixpro/release/java/com/ctre/phoenixpro/hardware/CANcoder.html>`__, `C++ <https://api.ctr-electronics.com/phoenixpro/release/cpp/classctre_1_1phoenixpro_1_1hardware_1_1_c_a_ncoder.html>`__)

source: `Hardware User's Manual <https://store.ctr-electronics.com/content/user-manual/CANCoder%20User's%20Guide.pdf>`__
fr_ca: `Manuel d’utilisation du matériel <https://store.ctr-electronics.com/content/user-manual/CANCoder%20User's%20Guide.pdf>`__

source: Software Documentation (`v5 <https://v5.docs.ctr-electronics.com/en/stable/ch12a_BringUpCANCoder.html>`__, `Pro <https://pro.docs.ctr-electronics.com/en/stable/docs/api-reference/api-usage/index.html>`__)
fr_ca: Documentation logicielle (`v5 <https://v5.docs.ctr-electronics.com/en/stable/ch12a_BringUpCANCoder.html>`__, `Pro <https://pro.docs.ctr-electronics.com/en/stable/docs/api-reference/api-usage/index.html>`__)

source: API Documentation (v5: `Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/sensors/WPI_Pigeon2.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1sensors_1_1_w_p_i___pigeon2.html>`__ | Pro: `Java <https://api.ctr-electronics.com/phoenixpro/release/java/com/ctre/phoenixpro/hardware/Pigeon2.html>`__, `C++ <https://api.ctr-electronics.com/phoenixpro/release/cpp/classctre_1_1phoenixpro_1_1hardware_1_1_pigeon2.html>`__)
fr_ca: Documentation d’API (v5: `Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/sensors/WPI_Pigeon2.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1sensors_1_1_w_p_i___pigeon2.html>`__ | Pro: `Java <https://api.ctr-electronics.com/phoenixpro/release/java/com/ctre/phoenixpro/hardware/Pigeon2.html>`__, `C++ <https://api.ctr-electronics.com/phoenixpro/release/cpp/classctre_1_1phoenixpro_1_1hardware_1_1_pigeon2.html>`__)

source: `Hardware User's Manual <https://store.ctr-electronics.com/content/user-manual/Pigeon2%20User's%20Guide.pdf>`__
fr_ca: `Manuel d’utilisation du matériel <https://store.ctr-electronics.com/content/user-manual/Pigeon2%20User's%20Guide.pdf>`__

source: Software Documentation (`v5 <https://v5.docs.ctr-electronics.com/en/stable/ch11a_BringUpPigeon2.html>`__, `Pro <https://pro.docs.ctr-electronics.com/en/stable/docs/api-reference/api-usage/index.html>`__)
fr_ca: Documentation logicielle (`v5 <https://v5.docs.ctr-electronics.com/en/stable/ch11a_BringUpPigeon2.html>`__, `Pro <https://pro.docs.ctr-electronics.com/en/stable/docs/api-reference/api-usage/index.html>`__)

source: API Documentation (`Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/sensors/WPI_PigeonIMU.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1sensors_1_1_w_p_i___pigeon_i_m_u.html>`__)
fr_ca: Documentation d’API (`Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/sensors/WPI_PigeonIMU.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1sensors_1_1_w_p_i___pigeon_i_m_u.html>`__)

source: `Hardware User's Manual <https://store.ctr-electronics.com/content/user-manual/Pigeon%20IMU%20User's%20Guide.pdf>`__
fr_ca: `Manuel d’utilisation du matériel <https://store.ctr-electronics.com/content/user-manual/Pigeon%20IMU%20User's%20Guide.pdf>`__

source: `Software Documentation <https://v5.docs.ctr-electronics.com/en/stable/ch11_BringUpPigeon.html>`__
fr_ca: `Documentation logicielle <https://v5.docs.ctr-electronics.com/en/stable/ch11_BringUpPigeon.html>`__

source: API Documentation (`Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/CANifier.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1_c_a_nifier.html>`__)
fr_ca: Documentation d’API (`Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/CANifier.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1_c_a_nifier.html>`__)

source: `Hardware User's Manual <https://store.ctr-electronics.com/content/user-manual/CANifier%20User%27s%20Guide.pdf>`__
fr_ca: `Manuel d’utilisation du matériel <https://store.ctr-electronics.com/content/user-manual/CANifier%20User%27s%20Guide.pdf>`__

source: `Software Documentation <https://v5.docs.ctr-electronics.com/en/stable/ch12_BringUpCANifier.html>`__
fr_ca: `Documentation logicielle <https://v5.docs.ctr-electronics.com/en/stable/ch12_BringUpCANifier.html>`__

source: CTRE Other CAN Devices
fr_ca: CTRE - autres composants CAN

source: API Documentation (`Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/led/CANdle.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1led_1_1_c_a_ndle.html>`__)
fr_ca: Documentation d’API (`Java <https://api.ctr-electronics.com/phoenix/release/java/com/ctre/phoenix/led/CANdle.html>`__, `C++ <https://api.ctr-electronics.com/phoenix/release/cpp/classctre_1_1phoenix_1_1led_1_1_c_a_ndle.html>`__)

source: `Hardware User's Manual <https://store.ctr-electronics.com/content/user-manual/CANdle%20User's%20Guide.pdf>`__
fr_ca: `Manuel d’utilisation du matériel <https://store.ctr-electronics.com/content/user-manual/CANdle%20User's%20Guide.pdf>`__

source: `Software Documentation <https://v5.docs.ctr-electronics.com/en/stable/ch12b_BringUpCANdle.html>`__
fr_ca: `Documentation logicielle <https://v5.docs.ctr-electronics.com/en/stable/ch12b_BringUpCANdle.html>`__

source: REV Motor Controllers
fr_ca: Contrôleurs de moteur REV
tr_tr: REV Motor Kontrolörleri
zh_cn: REV电机控制器

source: Playing With Fusion (PWF) offers the Venom integrated motor/controller as well as a Time-of-Flight distance sensor:
fr_ca: Playing With Fusion (PWF) propose le moteur/contrôleur intégré Venom ainsi qu'un capteur de distance de temps de vol:
tr_tr: Playing With Fusion (PWF), Venom entegre motor / kontrol cihazının yanı sıra bir Uçuş Süresi mesafe sensörü sunar:
zh_cn: Playing With Fusion (PWF) 提供了Venom集成电机/控制器和飞行时间与距离传感器:

source: PWF Motor Controllers
fr_ca: Contrôleurs de moteur PWF
tr_tr: PWF Motor Kontrolörleri
zh_cn: PWF电机控制器

source: API Documentation (`Java <https://www.playingwithfusion.com/frc/2020/javadoc/com/playingwithfusion/package-summary.html>`__, `C++ <https://www.playingwithfusion.com/frc/2020/cppdoc/html/annotated.html>`__)
fr_ca: Documentation de l'API (`Java <https://www.playingwithfusion.com/frc/2020/javadoc/com/playingwithfusion/package-summary.html>`__, `C++ <https://www.playingwithfusion.com/frc/2020/cppdoc/html/annotated.html>`__)
tr_tr: API Belgeleri (`Java <https://www.playingwithfusion.com/frc/2020/javadoc/com/playingwithfusion/package-summary.html>` __, `C ++ <https://www.playingwithfusion.com/frc/2020/cppdoc/html/annotated.html>` __)
zh_cn: API 文档 (`Java <https://www.playingwithfusion.com/frc/2020/javadoc/com/playingwithfusion/package-summary.html>`__, `C++ <https://www.playingwithfusion.com/frc/2020/cppdoc/html/annotated.html>`__)

source: `Technical Manual <https://www.playingwithfusion.com/include/getfile.php?fileid=7086>`__
fr_ca: `Manuel technique <https://www.playingwithfusion.com/include/getfile.php?fileid=7086>`__
tr_tr: `Teknik Kılavuz <https://www.playingwithfusion.com/include/getfile.php?fileid=7086>` __
zh_cn: `技术手册<https://www.playingwithfusion.com/include/getfile.php?fileid=7086>`__

source: PWF Sensors
fr_ca: Capteurs PWF
tr_tr: PWF Sensörleri
zh_cn: PWF传感器

source: **Time of Flight Sensor**
fr_ca: **Capteur de temps de vol**

source: `Technical Manual <https://www.playingwithfusion.com/include/getfile.php?fileid=7091>`__
fr_ca: `Manuel technique <https://www.playingwithfusion.com/include/getfile.php?fileid=7091>`__
tr_tr: `Teknik Kılavuz <https://www.playingwithfusion.com/include/getfile.php?fileid=7091>` __
zh_cn: `技术手册<https://www.playingwithfusion.com/include/getfile.php?fileid=7091>`__

source: Redux Sensors
fr_ca: Capteurs Redux

source: `Technical Manual <https://docs.reduxrobotics.com/canandcoder/index.html>`__
fr_ca: `Manuel technique https://docs.reduxrobotics.com/canandcoder/index.html>`__

source: A number of FRC vendors offer their own CAN peripherals. As CAN devices offer expansive feature-sets, vendor CAN devices require similarly expansive code libraries to operate. As a result, these libraries are not maintained as an official part of WPILib, but are instead maintained by the vendors themselves. For a guide to installing third-party libraries, see :ref:`3rd Party Libraries <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>`
tr_tr: Bir dizi FRC satıcısı kendi CAN çevre birimlerini sunar. CAN cihazları geniş özellik setleri sunduğundan, satıcı CAN cihazlarının çalışması için benzer şekilde genişletilmiş kod kitaplıkları gerekir. Sonuç olarak, bu kitaplıklar WPILib'in resmi bir parçası olarak tutulmaz, bunun yerine satıcıların kendileri tarafından korunur. Üçüncü taraf kitaplıkların kurulmasına ilişkin bir kılavuz için bkz: ref: `3. Taraf Kitaplıkları <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>`

source: Cross-the-Road Electronics
tr_tr: Cross-the-Road Elektronik

source: Cross-the-Road Electronics (CTRE) offers several CAN peripherals with external libraries:
tr_tr: Cross-the-Road Electronics (CTRE), harici kitaplıklara sahip birkaç CAN çevre birimi sunar:

source: API Documentation (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_talon_s_r_x.html>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_talon_s_r_x.html>`__)
tr_tr: API Belgeleri (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_talon_s_r_x.html>` __, `C ++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_talon_s_r_x.html>` __)

source: `Technical Manual <https://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__
tr_tr: `Teknik Kılavuz <https://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>` __

source: API Documentation (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_victor_s_p_x.html>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_victor_s_p_x.html>`__)
tr_tr: API Belgeleri (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_victor_s_p_x.html>` __, `C ++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_victor_s_p_x.html>` __)

source: `Technical Manual <https://www.ctr-electronics.com/downloads/pdf/Victor%20SPX%20User's%20Guide.pdf>`__
tr_tr: `Teknik Kılavuz <https://www.ctr-electronics.com/downloads/pdf/Victor%20SPX%20User's%20Guide.pdf>` __

source: API Documentation(`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1sensors_1_1_pigeon_i_m_u.html>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1sensors_1_1_pigeon_i_m_u.html>`__)
tr_tr: API Belgeleri (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1sensors_1_1_pigeon_i_m_u.html>` __, `C ++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1sensors_1_1_pigeon_i_m_u.html>` __)

source: `Technical Manual <https://www.ctr-electronics.com/downloads/pdf/Pigeon%20IMU%20User's%20Guide.pdf>`__
tr_tr: `Teknik Kılavuz <https://www.ctr-electronics.com/downloads/pdf/Pigeon%20IMU%20User's%20Guide.pdf>` __

source: API Documentation (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1_c_a_nifier.html#ad9a05fae7065d3f39f7bc8a86f15b0a1>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1_c_a_nifier.html#a706308fce1dea96785bf3ac845bafc02>`__)
tr_tr: API Belgeleri (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1_c_a_nifier.html#ad9a05fae7065d3f39f7bc8a86f15b0a1>` __, `C ++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1_c_a_nifier.html#a706308fce1dea96785bf3ac845bafc02>` __)

source: `Technical Manual <https://www.ctr-electronics.com/downloads/pdf/CANifier%20User's%20Guide.pdf>`__
tr_tr: `Teknik Kılavuz <https://www.ctr-electronics.com/downloads/pdf/CANifier%20User's%20Guide.pdf>` __

source: REV Robotics
tr_tr: REV Robotik
zh_cn: REV机器人

source: REV Robotics currently offers the SPARK MAX motor controller, which has a similar feature-set to the Talon SRX.
tr_tr: REV Robotics şu anda Talon SRX'e benzer bir özellik setine sahip olan SPARK MAX motor kontrol cihazını sunmaktadır.
zh_cn: REV机器人当前提供SPARK MAX电机控制器，该控制器具有与Talon SRX类似的功能。

source: API Documentation (`Java <https://www.revrobotics.com/content/sw/max/sw-docs/java/com/revrobotics/CANSparkMax.html>`__, `C++ <https://www.revrobotics.com/content/sw/max/sw-docs/cpp/classrev_1_1_c_a_n_spark_max.html>`__)
tr_tr: API Belgeleri (`Java <https://www.revrobotics.com/content/sw/max/sw-docs/java/com/revrobotics/CANSparkMax.html>`__, `C ++ <https://www.revrobotics.com/content/sw/max/sw-docs/cpp/classrev_1_1_c_a_n_spark_max.html>` __)

source: `Technical Manual <https://www.revrobotics.com/sparkmax-users-manual/>`__
tr_tr: `Teknik Kılavuz <https://www.revrobotics.com/sparkmax-users-manual/>` __

source: Playing With Fusion
tr_tr: Fusion ile Oynamak

source: API Documentation(`Java <https://www.playingwithfusion.com/frc/2020/javadoc/com/playingwithfusion/package-summary.html>`__, `C++ <https://www.playingwithfusion.com/frc/2020/cppdoc/html/annotated.html>`__)
tr_tr: API Belgeleri (`Java <https://www.playingwithfusion.com/frc/2020/javadoc/com/playingwithfusion/package-summary.html>` __, `C ++ <https://www.playingwithfusion.com/frc/2020/cppdoc/html/annotated.html>` __)
zh_cn: API 文档(`Java <https://www.playingwithfusion.com/frc/2020/javadoc/com/playingwithfusion/package-summary.html>`__, `C++ <https://www.playingwithfusion.com/frc/2020/cppdoc/html/annotated.html>`__)

source: A number of FRC\ |reg| vendors offer their own CAN peripherals. As CAN devices offer expansive feature-sets, vendor CAN devices require similarly expansive code libraries to operate. As a result, these libraries are not maintained as an official part of WPILib, but are instead maintained by the vendors themselves. For a guide to installing third-party libraries, see :ref:`3rd Party Libraries <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>`
zh_cn: 许多的FRC\ |reg|供应商提供自己的CAN设备。因为CAN设备提供更多的功能，因此供应商的CAN设备也需要类似的扩展代码库才能运行。因此，这些代码库并不作为官方的部分经行更新，而是由各个供应商自己更新。有关安装第三方代码库的指导，请看:ref:`第三方库 <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>`

source: Cross-the-Road Electronics (CTRE) offers several CAN peripherals with external libraries. General resources for all CTRE devices include:
zh_cn: Cross-the-Road Electronics（CTRE）提供了几种带有扩展代码库的CAN设备：

source: `Phoenix Device Software Documentation <https://docs.ctre-phoenix.com/>`__
zh_cn: `Phoenix Device 软件文档 <https://docs.ctre-phoenix.com/>`__

source: `Phoenix Device Software Examples <https://github.com/CrossTheRoadElec/Phoenix-Examples-Languages>`__
zh_cn: `Phoenix Device 软件实例 <https://github.com/CrossTheRoadElec/Phoenix-Examples-Languages>`__
