Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/can-devices/using-can-devices.po
Languages: fr_ca, tr_tr

source: Using CAN Devices
fr_ca: Utilisation de périphériques CAN
tr_tr: CAN cihazlarını kullanmak

source: CAN has many advantages over other methods of connection between the robot controller and peripheral devices.
fr_ca: Le bus CAN présente de nombreux avantages par rapport aux autres méthodes de connexion entre le contrôleur de robot et les périphériques.
tr_tr: CAN, robot kontrolörü ve çevresel cihazlar arasındaki diğer bağlantı yöntemlerine göre birçok avantaja sahiptir.

source: CAN connections are daisy-chained from device to device, which often results in much shorter wire runs than having to wire each device to the RIO itself.
fr_ca: Les connexions CAN sont connectées en série d'un périphérique à l'autre, ce qui se traduit souvent par des câbles beaucoup plus courts en comparaison de câbler chaque périphérique directement au roboRIO.
tr_tr: CAN bağlantıları, cihazdan cihaza papatya dizimlidir, bu da genellikle her cihazı RIO'nun kendisine bağlamaktan çok daha kısa kablolarla sonuçlanır.

source: Much more data can be sent over a CAN connection than over a PWM connection - thus, CAN motor controllers are capable of a much more expansive feature-set than are PWM motor controllers.
fr_ca: Beaucoup plus de données peuvent être envoyées via une connexion CAN que via une connexion PWM - ainsi, les contrôleurs de moteur CAN sont capables d'un ensemble de fonctionnalités beaucoup plus étendu que les contrôleurs de moteur PWM.
tr_tr: CAN bağlantısı üzerinden bir PWM bağlantısından çok daha fazla veri gönderilebilir - bu nedenle CAN motor kontrolörleri, PWM motor kontrolörlerinden çok daha geniş bir özellik setine sahiptir.

source: CAN is bi-directional, so CAN motor controllers can send data back to the RIO, again facilitating a more expansive feature-set than can be offered by PWM Controllers.
fr_ca: Le CAN est bidirectionnel, de sorte que les contrôleurs de moteur CAN peuvent renvoyer des données au roboRIO, facilitant à nouveau un ensemble de fonctionnalités plus étendu que celui offert par les contrôleurs PWM.
tr_tr: CAN çift yönlüdür, bu nedenle CAN motor kontrolörleri verileri RIO'ya geri gönderebilir, bu da yine PWM kontrolörlerinin sunabileceğinden daha kapsamlı bir özellik seti olduğunu gösterir.

source: Supported CAN peripherals include:
fr_ca: Les périphériques CAN supportés par WPILib sont:
tr_tr: Desteklenen CAN çevre birimleri şunları içerir:

source: CAN speed controllers
fr_ca: Contrôleurs de vitesse CAN
tr_tr: CAN hız kontrolörleri

source: The Power Distribution Panel (PDP)
fr_ca: Le panneau de distribution d'alimentation (PDP)
tr_tr: Güç Dağıtım Paneli - Power Distribution Panel (PDP)

source: The Pneumatics Control Module (PCM)
fr_ca: Le module de commande pneumatique (PCM)
tr_tr: Pnömatik Kontrol Modülü (PCM)

source: For instructions on wiring CAN devices, see the relevant section of the :ref:`robot wiring guide <docs/getting-started/getting-started-frc-control-system/how-to-wire-a-robot:CAN Devices>`.
fr_ca: Pour obtenir des instructions sur le câblage des périphériques CAN, reportez-vous à la section appropriée du: ref: `guide de câblage du robot <docs / getting-started / getting-started-frc-control-system / how-to-wire-a-robot: CAN Devices> ".

source: CAN devices generally have their own WPILib classes. The following sections will describe the use of several of these classes.
fr_ca: Les périphériques CAN ont généralement leurs propres classes WPILib. Les sections suivantes décrivent l'utilisation de plusieurs de ces classes.
tr_tr: CAN cihazları genellikle kendi WPILib sınıflarına sahiptir. Aşağıdaki bölümler, bu sınıflardan birkaçının kullanımını açıklayacaktır.

source: For instructions on wiring CAN devices, see the relevant section of the :ref:`robot wiring guide <docs/zero-to-robot/step-1/how-to-wire-a-robot:CAN Devices>`.
tr_tr: CAN cihazlarının kablolanmasıyla ilgili talimatlar için: ref: `robot kablolama kılavuzu <docs / zero-to-robota / step-1 / how-to-a-robot: CAN Devices> 'ın ilgili bölümüne bakın.
