Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/introduction/control-system-basics.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Control System Basics
es_mx: Sistema Básico de Control
fr_ca: Les notions fondamentales d'un système de contrôle
tr_tr: Kontrol Sistemi Temelleri
zh_cn: 控制系统基础

source: This article is taken out of `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__ by Tyler Veness with permission.
es_mx: Este artículo es obtenido de `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__ por Tyler Veness con consentimiento.
fr_ca: Cet article est tiré de `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__ par Tyler Veness avec permission.
tr_tr: Bu makale Tyler Veness tarafından izniyle `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__ dan alınmıştır.
zh_cn: 本文摘自Tyler Veness的“ FRC控制工程<https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`。

source: Control systems are all around us and we interact with them daily. A small list of ones you may have seen includes heaters and air conditioners with thermostats, cruise control and the anti-lock braking system (ABS) on automobiles, and fan speed modulation on modern laptops. Control systems monitor or control the behavior of systems like these and may consist of humans controlling them directly (manual control), or of only machines (automatic control).
es_mx: Sistemas de control están alrededor de nosotros e interactuamos diariamente con ellos. Una pequeña lista de algunos que puede que haya visto incluyen calentadores y aires acondicionados con termostatos, control crucero y sistema antibloqueo de ruedas (Frenos ABS) en automóviles, la modulación de la velocidad de un ventilador en las laptops modernas. Monitores de sistemas de control o controlar el comportamiento de sistemas como estos puede consistir en humanos controlándolos directamente (control manual) o solo en máquinas (control automático).
fr_ca: Les systèmes de contrôle sont présents tout autour de nous et nous interagissons quotidiennement avec eux. Une petite liste de ceux que vous avez peut-être vus comprend: des radiateurs et des climatiseurs avec thermostats, un régulateur de vitesse pour une voiture, ou son système de freinage antiblocage (ABS), et la modulation de la vitesse du ventilateur sur les ordinateurs portables modernes. Les systèmes de contrôle surveillent ou contrôlent le comportement de systèmes comme ceux-ci et peuvent être activées par des opérateurs humains (contrôle manuel), ou uniquement par des machines (contrôle automatique).
tr_tr: Kontrol sistemleri her yerdedir ve onlarla her gün etkileşim halindeyiz. Görmüş olabileceklerinizin küçük bir listesi, termostatlı ısıtıcılar ve klimalar, hız kontrolünü ve otomobillerde kilitlenmeyi önleyici fren sistemini (ABS) ve modern dizüstü bilgisayarlarda fan hızı modülasyonunu içerir. Kontrol sistemleri, bu gibi sistemlerin davranışını izler veya kontrol eder ve onları doğrudan kontrol eden insanlardan (manuel kontrol) veya yalnızca makinelerden (otomatik kontrol) oluşabilir.
zh_cn: 控制系统无处不在，我们每天都与之互动。您可能会看到一小部分，包括带有恒温器的加热器和空调，巡航控制和汽车上的防抱死制动系统（ABS），以及现代笔记本电脑上的风扇速度调节。控制系统监视或控制此类系统的行为，并且可以由直接控制它们的人（手动控制）或仅由机器（自动控制）组成。

source: How can we prove closed-loop controllers on an autonomous car, for example, will behave safely and meet the desired performance specifications in the presence of uncertainty? Control theory is an application of algebra and geometry used to analyze and predict the behavior of systems, make them respond how we want them to, and make them robust to disturbances and uncertainty.
es_mx: ¿Como podemos comprobar un lazo cerrado de control en un carro autónomo? Por ejemplo, ¿se comportará de manera segura y cumplirá las especificaciones de rendimiento deseadas en presencia de alguna incertidumbre? La teoría de control es una aplicación del algebra y geometría usada para analizar y predecir el comportamiento de sistemas, haciendo que respondan como nosotros queremos haciéndolos robustos contra perturbaciones e incertidumbres.
fr_ca: Comment pouvons-nous prouver que les contrôleurs en boucle fermée sur une voiture autonome, par exemple, se comporteront en toute sécurité et répondront aux spécifications de performance souhaitées en présence d'incertitude? La théorie du contrôle est une application de l'algèbre et de la géométrie utilisée pour analyser et prédire le comportement des systèmes, les faire réagir comme nous le voulons et les rendre robustes aux perturbations et à l'incertitude.
tr_tr: Örneğin, otonom bir arabadaki kapalı döngü denetleyicilerin belirsizlik durumunda güvenli bir şekilde davranacağını ve istenen performans özelliklerini karşılayacağını nasıl kanıtlayabiliriz? Kontrol teorisi, sistemlerin davranışını analiz etmek ve tahmin etmek, onları istediğimiz şekilde yanıt vermelerini sağlamak ve onları gürültülere ve belirsizliğe karşı sağlam kılmak için kullanılan bir matematik ve geometri uygulamasıdır.
zh_cn: 例如，在存在不确定性的情况下，我们如何证明自动驾驶汽车上的闭环控制器能够安全运行并满足期望的性能规格?控制理论是一种代数和几何的应用，用来分析和预测系统的行为，使它们按照我们的要求做出反应，并使它们对干扰和不确定性具有鲁棒性。

source: Controls engineering is, put simply, the engineering process applied to control theory. As such, it's more than just applied math. While control theory has some beautiful math behind it, controls engineering is an engineering discipline like any other that is filled with trade-offs. The solutions control theory gives should always be sanity checked and informed by our performance specifications. We don't need to be perfect; we just need to be good enough to meet our specifications.
es_mx: Controles de ingeniería es, en pocas palabras, el proceso de ingeniería aplicado a la teoría del control. Como tal, es más que solo aplicar matemáticas. Mientras la teoría de control tiene una matemática hermosa detrás de ella, controles de ingeniería es una disciplina de la ingeniería así como cualquier otra está llena de compensaciones. Las soluciones de la teoría de control siempre deben ser verificadas e informadas por las especificaciones de rendimiento. No tiene que ser perfecto; solamente ser suficientemente bueno para alcanzar nuestras especificaciones.
fr_ca: L'ingénierie des contrôles est, en termes simples, le processus d'ingénierie appliqué à la théorie du contrôle. En tant que tel, c'est plus que des mathématiques appliquées. Alors que la théorie du contrôle a de belles mathématiques derrière elle, l'ingénierie des contrôles est une discipline d'ingénierie comme les autres qui est pleine de compromis. Les solutions que la théorie du contrôle donne doivent toujours être vérifiées et conformes à nos spécifications de performance. Nous n'avons pas besoin d'être parfaits; nous devons juste être assez bons pour répondre à nos spécifications.
tr_tr: Kontrol mühendisliği, basitçe ifade etmek gerekirse, kontrol teorisine uygulanan mühendislik sürecidir. Bu nedenle, uygulamalı matematikten daha fazlasıdır. Kontrol teorisinin arkasında güzel bir matematik bulunsa da, kontrol mühendisliği diğer herhangi bir mühendislik disiplini gibi değiş tokuşlarla doludur. Kontrol teorisinin verdiği çözüm her zaman mantık kontrolundan geçirilmeli ve performans özellikleri tarafından değerlendirilmelidir. Mükemmel olmamıza gerek yok; sadece şartnamelerimizi karşılayacak kadar iyi olmamız gerekiyor.
zh_cn: 简单来说，控制工程是应用于控制理论的工程过程。因此，它不仅仅是应用数学。虽然控制理论背后有一些漂亮的数学运算，但是控制工程学是一门工程学，就像其他任何取舍一样。控制理论给出的解决方案应始终通过我们的性能规格进行检查和了解。我们不需要完美；我们只需要能满足我们的规格即可。

source: Most resources for advanced engineering topics assume a level of knowledge well above that which is necessary. Part of the problem is the use of jargon. While it efficiently communicates ideas to those within the field, new people who aren't familiar with it are lost.
es_mx: La mayoría de los recursos para temas de ingeniería avanzada asumen un nivel de conocimientos muy superior al necesario. Parte del problema es el uso de términos. Mientras comunica eficientemente ideas a aquellos que están relacionados al tema, gente nueva no familiarizada al tema se pierde.
fr_ca: La plupart des ressources pour les sujets d'ingénierie avancée supposent un niveau de connaissances bien supérieur à ce qui est nécessaire. Une partie du problème est l'utilisation du jargon (langage technique). Bien que ce langage communique efficacement les idées à ceux qui travaillent dans ce domaine, les initiés qui ne le connaissent pas sont perdues.
tr_tr: İleri mühendislik konuları için çoğu kaynak, gerekli olanın çok üzerinde bir bilgi düzeyini varsayar. Sorunun bir kısmı, jargon kullanımıdır. Fikirleri sahadakilere verimli bir şekilde iletirken, bu jargona aşina olmayan insanlar konu içinde kaybolur.
zh_cn: 大多数高级工程主题的资源都需要具备一定的知识水平。部分问题在于术语的使用。虽然它能有效地与业内人士交流想法，但不熟悉它的新人却会迷失方向。

source: The system or collection of actuators being controlled by a control system is called the *plant*. A controller is used to drive the plant from its current state to some desired state (the reference). Controllers which don't include information measured from the plant's output are called open-loop controllers.
es_mx: El sistema o colección de actuadores siendo controlados por un sistema es llamado *Planta*. Un controlador es usado para manejar la planta de su estado actual a un estado deseado (referencia). Controladores que no incluyen información medida a la salida de la planta son llamados controladores de lazo abierto.
fr_ca: Le système ou la série de senseurs et actuateurs contrôlés par un système de commande est appelé *Usine*, (Plant, en anglais). Un contrôleur est utilisé pour amener l'état actuel de l'Usine à un état souhaité (la référence). Les contrôleurs qui n'incluent pas d'informations mesurées à partir de la sortie de l'Usine sont appelés contrôleurs en boucle ouverte.
tr_tr: Bir kontrol sistemi tarafından kontrol edilen aktüatör sistemi veya koleksiyonu, *plant-tesis* olarak adlandırılır. Plant-tesis mevcut durumundan istenen bir duruma (reference-referans) sürmek için bir kontrolör kullanılır. Plant-tesis çıktılarından ölçülen bilgileri içermeyen denetleyicilere açık döngü-open-loop denetleyiciler denir.
zh_cn: 由控制系统控制的执行器系统或集合称为“工厂”。控制器用于将设备从其当前状态驱动到某些所需状态（参考）。不包含开环控制器，即从工厂输出中测得的信息的控制器

source: Controllers which incorporate information fed back from the plant's output are called closed-loop controllers or feedback controllers.
es_mx: Controladores que incorporan una información entregada de la salida de la planta son llamados controladores de lazo cerrado o controladores de retroalimentación.
fr_ca: Les contrôleurs qui intègrent les informations renvoyées par la sortie de l'Usine sont appelés contrôleurs en boucle fermée ou contrôleurs de rétroaction.
tr_tr: Tesisin çıkışından geri beslenen bilgileri içeren denetleyicilere kapalı döngü - closed-loop denetleyiciler veya geri bildirim-feedback denetleyicileri denir.
zh_cn: 从工厂的输出反馈信息的控制器称为闭环控制器或反馈控制器。

source: A diagram of a basic feedback plant
fr_ca: Diagramme d’une usine de rétroaction de base

source: The input and output of a system are defined from the plant's point of view. The negative feedback controller shown is driving the difference between the reference and output, also known as the error, to zero.
es_mx: La entrada y salida de un sistema están definidos desde el punto de visto de la planta. La retroalimentación negativa del controlador mostrada es dada por la diferencia entre la referencia y la salida, también conocido como error, a cero.
fr_ca: L'entrée et la sortie d'un système sont définies du point de vue de l'installation. Le contrôleur de rétroaction négative illustré conduit à zéro la différence entre la référence et la sortie, également connue sous le nom d'erreur.
tr_tr: Bir sistemin girdi ve çıktıları plant bakış açısından tanımlanır. Gösterilen negatif geri besleme kontrolörü, hata olarak da bilinen referans ve çıkış arasındaki farkı sıfıra doğru sürüyor.
zh_cn: 从工厂的角度定义系统的输入和输出。所示的负反馈控制器将基准与输出之间的差（也称为误差）驱动为零。

source: What is Gain?
es_mx: ¿Qué es la ganancia?
fr_ca: Qu'est-ce que le gain?
tr_tr: Kazanç-Gain nedir?
zh_cn: 什么是增益？

source: *Gain* is a proportional value that shows the relationship between the magnitude of an input signal to the magnitude of an output signal at steady-state. Many systems contain a method by which the gain can be altered, providing more or less "power" to the system.
es_mx: La *ganancia* es un valor proporcional que muestra la relación entre la magnitud de una señal de entrada con la magnitud de una señal de salida a un estado estable. Muchos sistemas contienen un método con el cual la ganancia puede ser alterada, dando al sistema mayor o menos “poder”.
fr_ca: *Gain* est une valeur proportionnelle qui montre la relation entre l'amplitude d'un signal d'entrée et l'amplitude d'un signal de sortie à l'état stationnaire (Steady-state). De nombreux systèmes contiennent une méthode par laquelle le gain peut être modifié, fournissant plus ou moins de «puissance» au système.
tr_tr: *Kazanç-Gain*, sabit durumda bir giriş sinyalinin büyüklüğü ile bir çıkış sinyalinin büyüklüğü arasındaki ilişkiyi gösteren orantılı bir değerdir. Birçok sistem, sisteme az ya da çok "güç-power" sağlayan, kazancın değiştirilebileceği bir yöntem içerir.
zh_cn: *增益*是一个比例值，表示稳态时输入信号的大小与输出信号的大小之间的关系。许多系统包含一种方法，通过该方法可以更改增益，从而为系统提供或多或少的“功率”。

source: The figure below shows a system with a hypothetical input and output. Since the output is twice the amplitude of the input, the system has a gain of two.
es_mx: La siguiente figura muestra un sistema con una entrada y salida hipotética. Debido a que la salida es dos veces la amplitud de la entrada, es sistema tiene una ganancia de dos.
fr_ca: La figure ci-dessous montre un système avec une entrée et une sortie hypothétiques. Étant donné que la sortie est deux fois l'amplitude de l'entrée, le système a un gain de deux.
tr_tr: Aşağıdaki şekil varsayımsal bir girdi ve çıktıya sahip bir sistemi göstermektedir. Çıkış, girişin genliğinin iki katı olduğu için, sistemin kazancı ikidir.
zh_cn: 下图显示了一个具有假设输入和输出的系统。由于输出是输入幅度的两倍，因此系统的增益为2。

source: A system diagram with hypothetical input and output
fr_ca: Un diagramme du système avec entrée et sortie hypothétiques

source: Block Diagrams
es_mx: Diagramas de Bloque
fr_ca: Schémas fonctionnels
tr_tr: Blok Diyagramlar
zh_cn: 方框图

source: When designing or analyzing a control system, it is useful to model it graphically. Block diagrams are used for this purpose. They can be manipulated and simplified systematically.
es_mx: Cuando se diseñe o analice un sistema de control, es útil graficar el modelo. Los diagramas de bloques son usados para dicho propósito. Estos pueden modificarse sistemáticamente o simplificarse.
fr_ca: Lors de la conception ou de l'analyse d'un système de contrôle, il est utile de le modéliser graphiquement. Des schémas fonctionnels sont utilisés à cet effet. Ils peuvent être manipulés et simplifiés systématiquement.
tr_tr: Bir kontrol sistemini tasarlarken veya analiz ederken, onu grafiksel olarak modellemek faydalıdır. Bu amaçla blok diyagramlar kullanılır. Sistematik olarak manipüle edilebilir ve basitleştirilebilirler.
zh_cn: 在设计或分析控制系统时，以图形方式对建模很有用。框图用于此目的。它们可以被系统地操纵和简化。

source: A figure of a block diagram
fr_ca: Figure d’un schéma de principe

source: The open-loop gain is the total gain from the sum node at the input (the circle) to the output branch. this would be the system's gain if the feedback loop was disconnected. The feedback gain is the total gain from the output back to the input sum node. A sum node's output is the sum of its inputs.
es_mx: La ganancia de un circuito de lazo abierto es la ganancia total de la suma del nodo en la entrada (el circulo) a la línea de salida. Esto será la ganancia del sistema si el bucle de retroalimentación fuera desconectado. La retroalimentación de ganancia es la ganancia total del regreso de la salida a la suma del nodo de entrada. La salida de un nodo de suma es la suma de sus entradas.
fr_ca: Le gain en boucle ouverte est le gain total du nœud de somme à l'entrée (le cercle) vers la branche de sortie. ce serait le gain du système si la boucle de rétroaction était déconnectée. Le gain de rétroaction est le gain total de la sortie vers le nœud de somme d'entrée. La sortie d'un nœud de somme est calculée en additionnant toutes ses entrées.
tr_tr: Açık döngü-open-loop kazancı, girişteki (daire) toplam düğümünden çıkış dalına olan toplam kazançtır. Bu, geri besleme döngüsünün bağlantısı kesildiğinde sistemin kazancı olacaktır. Geri besleme kazancı, çıkıştan giriş toplam düğümüne geri gelen toplam kazançtır. Bir toplam düğümünün çıktısı, girdilerinin toplamıdır.
zh_cn: 开环增益是从输入（圆）处的求和节点到输出分支的总增益。如果断开反馈环路，这将是系统的增益。反馈增益是从输出返回到输入求和节点的总增益。总和节点的输出是其输入的总和。

source: The below figure is a block diagram with more formal notation in a feedback configuration.
es_mx: La siguiente figura es un diagrama de bloques con notación más formal en una configuración de retroalimentación.
fr_ca: La figure ci-dessous est un schéma illustrant une configuration de rétroaction, avec la bonne nomenclature.
tr_tr: Aşağıdaki şekil, geri besleme konfigürasyonunda daha resmi gösterime sahip bir blok diyagramdır.
zh_cn: 下图是在反馈配置中具有更正式表示法的框图。

source: An image of a block diagram with a more formal notation
fr_ca: Image d’un schéma de principe avec une notation plus formelle

source: :math:`\mp` means "minus or plus" where a minus represents negative feedback.
es_mx: :math:`\mp` significa “menos o más” donde menos presenta una retroalimentación negativa.
fr_ca: :math:`\mp` signifie "moins ou plus" où un signe moins représente une rétroaction négative.
tr_tr: :math:`\mp` "eksi veya artı" anlamına gelir; burada eksi, olumsuz geri bildirimi temsil eder.
zh_cn: ：math：`\ mp`表示“减号或加号”，其中减号表示负反馈。

source: Why Feedback Control?
es_mx: ¿Por qué Control de Retroalimentación?
fr_ca: Pourquoi le contrôle avec rétroaction?
tr_tr: Neden Geri Bildirim-Feedback Kontrolü?
zh_cn: 为什么要进行反馈控制？

source: Let's say we are controlling a DC brushed motor. With just a mathematical model and knowledge of all the current states of the system (i.e., angular velocity), we can predict all future states given the future voltage inputs. Why then do we need feedback control? If the system is disturbed in any way that isn't modeled by our equations, like a load was applied, or voltage sag in the rest of the circuit caused the commanded voltage to not match the applied voltage, the angular velocity of the motor will deviate from the model over time.
es_mx: Digamos que estamos controlando un motor DC de escobillas. Con solo un modelo matemático y conocimiento de todos los estados del sistema (p.ej., velocidad angular), podemos predecir todos los futuros estados dando el voltaje futuro en la entrada. Entonces ¿por qué necesitamos un control de retroalimentación? Si el sistema es perturbado de alguna manera que no está modelado por nuestras ecuaciones, por ejemplo una carga aplicada o una caída de voltaje en el resto del circuito que cause que el voltaje ordenado no coincida con el voltaje aplicado, la velocidad angular del motor se desviará del modelo conforme al tiempo.
fr_ca: Supposons que nous contrôlons un moteur à balais à courant-continu. Avec seulement un modèle mathématique et une connaissance de tous les états actuels du système (c'est-à-dire la vitesse angulaire), nous pouvons prédire l'ensemble des états futurs en fonction des entrées de tension. Pourquoi alors avons-nous besoin d'un contrôle avec rétroaction? Si le système est perturbé d'une manière qui n'est pas modélisée par nos équations, par exemple une charge est appliquée subitement à l'arbre du moteur, ou une chute de tension se produit ne correspondant pas à la tension appliquée, la vitesse angulaire du moteur va dévier avec le temps de sa valeur réelle.
tr_tr: Diyelim ki DC fırçalı bir motoru kontrol ediyoruz. Sadece matematiksel bir model ve sistemin tüm mevcut durumları (yani açısal hız) bilgisi ile, gelecekteki voltaj girişleri göz önüne alındığında gelecekteki tüm durumları tahmin edebiliriz. O halde neden geribildirim kontrolüne ihtiyacımız var? Sistem, bir yük uygulanmış gibi denklemlerimiz tarafından modellenmeyen herhangi bir şekilde bozulursa veya devrenin geri kalanındaki voltaj düşüşü, komut verilen voltajın uygulanan voltajla eşleşmemesine neden olursa, motorun açısal hızı zamanla modelden sapar.
zh_cn: 假设我们正在控制直流刷电机。只要有一个数学模型和系统当前所有状态的知识(即角速度)，我们就可以预测未来电压输入的所有状态。那么为什么我们需要反馈控制呢?如果系统以任何方式干扰,不是由我们的建模方程,像一个负载应用,或其他地区的电压凹陷吩咐电压不匹配引起的电路应用电压,随着时间的推移电动机的角速度会偏离模型。

source: To combat this, we can take measurements of the system and the environment to detect this deviation and account for it. For example, we could measure the current position and estimate an angular velocity from it. We can then give the motor corrective commands as well as steer our model back to reality. This feedback allows us to account for uncertainty and be robust to it.
es_mx: Para prevenir esto, podemos tomar medidas del sistema y el ambiente para detectar desviaciones y contar con ella. Por ejemplo, se puede medir la posición actual y estimar la velocidad angular de acuerdo a ella. Entonces podemos dar comandos correctivos al motor al mismo tiempo que regresamos el modelo a lo real. Esta retroalimentación nos permite contar con incertidumbre y ser robustos ante ella.
fr_ca: Pour lutter contre cela, nous pouvons prendre des mesures sur le système et son environnement pour détecter cette déviation et en tenir compte. Par exemple, nous pourrions mesurer la position actuelle et en estimer une vitesse angulaire. Nous pouvons alors donner des commandes correctives au moteur et ramener notre modèle à la réalité. Cette rétroaction nous permet de tenir compte de l'incertitude obtenir une robustesse contre les déviations.
tr_tr: Bununla mücadele etmek için, bu sapmayı tespit etmek ve hesaba katmak için sistemin ve çevrenin ölçümlerini alabiliriz. Örneğin, mevcut konumu ölçebilir ve ondan bir açısal hız tahmin edebiliriz. Daha sonra motora düzeltici komutlar verebilir ve modelimizi gerçeğe geri döndürebiliriz. Bu geri bildirim, belirsizliği hesaba katmamızı ve ona karşı uygun davranmamızı sağlar.
zh_cn: 为了解决这个问题，我们可以对系统和环境进行测量，以检测这种偏差并对其进行解释。例如，我们可以测量当前位置，并据此估计角速度。然后，我们可以给电机纠正命令，以及引导我们的模型回到现实。这种反馈让我们能够解释不确定性，并对其保持稳健。

source: Nomenclature
es_mx: Nomenclatura
tr_tr: Terminoloji - isimlendirme
zh_cn: 命名法
