Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/introduction/introduction-to-pid.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: The Integral integrates from time :math:`0` to the current time :math:`t`. we use :math:`\tau` for the integration because we need a variable to take on multiple values throughout the integral, but we can't use :math:`t` because we already defined that as the current time.
es_mx: La integral integra desde el tiempo :math:`0` hasta el tiempo :math:`t`. Usamos :math:`\tau` para la integración debido a que requerimos una variable que tome múltiples valores a través de la integral, pero no se podemos usar :math:`\t` debido a que ya la definimos como tiempo actual.
fr_ca: L'intégrale intègre de l'instant :math:`0` à l'instant actuel :math:`t`. Nous utilisons :math:`\tau` pour l'intégration parce que nous avons besoin d'une variable pour prendre plusieurs valeurs dans l'intégrale, mais nous ne pouvons pas utiliser :math:`t` parce que nous l'avons déjà défini comme l'instant actuel.
tr_tr: İntegral zaman :math:`0` dan şimdiki zaman :math:`t` ye kadar integral alır. Entegrasyon için :math:`\tau` kullanırız çünkü integral boyunca birden fazla değeri alacak bir değişkene ihtiyacımız vardır, ancak şunu kullanamayız :math:`t` çünkü bunu şimdiki zaman olarak tanımlamıştık.
zh_cn: 积分从时间:math:`0`到当前时间 :math:`t`进行积分。我们使用:math:`\tau`来进行积分，因为我们需要一个变量来在整个积分中采用多个值，但是不能使用:math:`t`来实现，因为我们已经将其定义为当前时间。

source: The below figure shows a block diagram for a :term:`system` controlled by a PI controller.
es_mx: La imagen a continuación muestra un diagrama de bloque para un :term:`sistema` controlado por un controlador PI.
fr_ca: La figure ci-dessous montre un schéma-bloc pour un :term:`Système` contrôlé par un contrôleur PI.
tr_tr: Aşağıdaki şekil, bir PI kontrolörü tarafından kontrol edilen bir :term:`system` için bir blok diyagramı gösterir.
zh_cn: 下图显示了由PI控制器控制的 :term:`system` 的框图。

source: Block diagram of a PI controller
fr_ca: Schéma-bloc d’un contrôleur PI

source: When the :term:`system` is close the :term:`setpoint` in steady-state, the proportional term may be too small to pull the :term:`output` all the way to the :term:`setpoint`, and the derivative term is zero. This can result in :term:`steady-state error` as shown in figure 2.4
es_mx: Cuando el :term:`sistema` está cerca del :term:`punto de referencia` en estado estable, el término proporcional puede ser muy pequeño para llevar la :term:`salida` hasta el :term:`punto de referencia`, y el término derivativo es cero. Esto pude resultar en un :term:`error de estado estable` como se muestra en la figura 2.4.
fr_ca: Lorsque le :term:`Système` s'approche du :term:`Point de consigne` en régime permanent, le terme proportionnel peut être trop petit pour faire converger la :term:`Sortie` jusqu'au :term:`Point de consigne`, et le terme dérivé est alors à zéro. Cela peut entraîner une :term:`erreur de régime permanent` comme le montre la figure 2.4
tr_tr: :term:`system` kararlı durumda :term:`setpoint` i kapattığında, oransal terim :term:`output` u :terim:`setpoint` na çekmek için çok küçük olabilir, ve türev terimi sıfırdır. Bu, şekil 2.4'te gösterildiği gibi :term:`steady-state error` ile sonuçlanabilir.
zh_cn: 当 :term:`system` 处于稳定状态时关闭系统 :term:`setpoint`时，比例项可能太小而无法将输出一直拉至 :term:`setpoint`，导数项为零。这可能导致 :term:`steady-state error` ，如图2.4所示。

source: PI controller with steady-state
fr_ca: Contrôleur PI en régime permanent

source: A common way of eliminating :term:`steady-state error` is to integrate the :term:`error` and add it to the :term:`control input`. This increases the :term:`control effort` until the :term:`system` converges. Figure 2.4 shows an example of :term:`steady-state error` for a flywheel, and figure 2.5 shows how an integrator added to the flywheel controller eliminates it. However, too high of an integral gain can lead to overshoot, as shown in figure 2.6.
es_mx: Una manera usual para eliminar el :term:`error de estado estable` es integrar el :term:`error` y sumarlo a la :term:`entrada de control`. Esto aumenta el :term:`esfuerzo de control` hasta que el sistema converja. La figura 2.4 muestra un ejemplo de un :term:`error de estado estable` de un volante y la figura 2.5 muestra como un integrador sumado al controlador del volante lo elimina. Sin embargo, una ganancia integral muy alta pude llevarlo a excederse, como se muestra en la figura 2.6.
fr_ca: Une façon courante d'éliminer :term:`l’erreur de régime permanent` consiste à intégrer l’ :term:`Erreur` et à l'ajouter à l’ :term:`Entrée contrôlée`. Cela augmente l’ :term:`effort de contrôle` jusqu'à ce que le :term:`Système` converge. La figure 2.4 montre un exemple de :term:`Erreur de régime permanent` pour un volant d'inertie, et la figure 2.5 montre comment un intégrateur ajouté au contrôleur du volant élimine cette erreur. Cependant, un gain intégral trop élevé peut entraîner un emballement du système, comme le montre la figure 2.6.
tr_tr: :term:`steady-state error` ı ortadan kaldırmanın yaygın bir yolu :term:`error` ifadesini entegre etmek ve bunu :term:`control input` ne eklemektir. Bu, :term:`system` yakınlaşana kadar :term:`control effort` artırır. Şekil 2.4, bir dönenteker için terim :term:`steady-state error` örneğini gösterir ve şekil 2.5, dönenteker kontrol cihazına eklenen bir entegratörün bunu nasıl ortadan kaldırdığını gösterir. Bununla birlikte, çok yüksek bir integral kazanım, şekil 2.6'da gösterildiği gibi, aşmaya neden olabilir.
zh_cn: 消除 :term:`steady-state error` 的常见方法是将 :term:`error` 积分，并将其添加到:term:`control input`中。这会增加 :term:`control effort` ，直到:term:`system` 收敛为止。图2.4显示了飞轮 :term:`steady-state error`的一个例子，图2.5显示了添加到飞轮控制器的积分器如何消除稳态误差。然而，过高的积分增益会导致超调，如图2.6所示。

source: Figure 2.6 and 2.6 graphs
fr_ca: Figure 2.6 et graphiques 2.6

source: PID Controller Definition
es_mx: Definición de Controlador PID
fr_ca: Définition du contrôleur PID
tr_tr: PID Denetleyici Tanımı
zh_cn: PID控制器定义

source: For information on using the WPILib provided PIDController, see the :ref:`relevant article <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.
es_mx: Para obtener información sobre el uso de WPILib proporcionada por PIDController, ver el :ref:`artículo relevante <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.
fr_ca: Pour plus d'informations sur l'utilisation du PIDController fourni par WPILib, voir :ref:`relevant article <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.
tr_tr: WPILib tarafından sağlanan PIDController'ı kullanma hakkında bilgi için bkz :ref:`ilgili makale <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.
zh_cn: 有关使用WPILib提供的PIDController的信息，请参见 :ref:`relevant article <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`。

source: When these terms are combined, one gets the typical definition for a PID controller.
es_mx: Cuando estos términos son combinados, uno obtiene la típica definición para un controlador PID.
fr_ca: Lorsque ces termes sont combinés, on obtient alors la définition typique d'un contrôleur PID.
tr_tr: Bu terimler birleştirildiğinde, bir PID denetleyicisinin tipik tanımını alır.
zh_cn: 将这些术语组合在一起，就可以得到PID控制器的典型定义。

source: where :math:`K_p` is the proportional gain, :math:`K_i` is the integral gain, :math:`K_d` is the derivative gain, :math:`e(t)` is the error at the current time :math:`t`, and :math:`\tau` is the integration variable.
es_mx: Donde :math:`K_p` es la ganancia proporcional, :math:`K_i` es la ganancia integral, :math:`K_d` es la ganancia derivativa, :math:`e(t)` es el error en el tiempo actual :math:`t` y :math:`\tau` es la variable de integración.
fr_ca: où :math:`K_p` est le gain proportionnel, :math:`K_i` est le gain intégral, :math:`K_d` est le gain dérivé, :math:`e(t)` est l'erreur au moment actuel :math:`t`, et :math:`\tau` est la variable d'intégration.
tr_tr: burada :math:`K_p` oransal kazançtır, :math:`K_i` integral kazançtır, :math:`K_d` türevsel kazançtır, :math:`e(t)` şu andaki hatadır :math:`t` ve :math:`\tau` entegrasyon değişkenidir.
zh_cn: 其中 :math:`K_p` 是比例增益，:math:`K_i` 是积分增益，:math:`K_d`是微分增益， :math:`e(t)` 是当前时间的误差。 :math:`t`和 :math:`\tau`是积分变量。

source: The below figure shows a block diagram for a PID controller.
es_mx: A continuación, se muestra un diagrama de bloques para un controlador PID.
fr_ca: La figure ci-dessous montre un schéma-bloc d'un contrôleur PID.
tr_tr: Aşağıdaki şekil, bir PID kontrolörü için bir blok diyagramı göstermektedir.
zh_cn: 下图显示了PID控制器的框图。

source: Block diagram of a PID controller
fr_ca: Schéma-bloc d'un contrôleur PID

source: Response Types
es_mx: Tipos de Respuesta
fr_ca: Types de réponse
tr_tr: Yanıt Türleri
zh_cn: 回应类型

source: A :term:`system` driven by a PID controller generally has three types of responses: underdamped, over-damped, and critically damped. These are shown in figure 2.8.
es_mx: Un :term:`sistema` manejado por un controlador PID generalmente tiene tres tipos de respuesta: subamortiguada, sobreamortiguada y críticamente amortiguada. Son mostradas en la figura 2.8.
fr_ca: Un :term:`Système` piloté par un contrôleur PID a généralement trois types de réponses: sous-amorti, sur-amorti et critique. Ces réponses sont illustrées à la figure 2.8.
tr_tr: PID denetleyicisi tarafından çalıştırılan :term:`system` genellikle üç tür yanıt içerir: yetersiz sönümlü, aşırı sönümlü ve kritik sönümlü. Bunlar şekil 2.8'de gösterilmektedir.
zh_cn: 由PID控制器驱动的 :term:`system` 通常具有三种类型的响应：欠阻尼，过阻尼和临界阻尼。这些如图2.8所示。

source: For the :term:`step responses <step response>` in figure 2.7, :term:`rise time` is the time the :term:`system` takes to initially reach the reference after applying the :term:`step input`. :term:`Settling time <settling time>` is the time the :term:`system` takes to settle at the :term:`reference` after the :term:`step input` is applied.
es_mx: En la figura 2.7 para las :term:`respuestas unitarias <step response>`, el :term:`tiempo de subida` es el tiempo que le toma al :term:`sistema` alcanzar inicialmente la referencia después de haber aplicado la :term:`entrada unitaria`. El :term:`tiempo de estabilización <settling time>` es el tiempo que le lleva al :term:`sistema` estabilizarse en la :term:`referencia` después de haber aplicado la :term:`entrada unitaria`.
fr_ca: Pour la :term:`Réponse à une transition<step response>` de la figure 2.7, :term:`Temps de montée` est le temps que le :term:`Système` prend pour atteindre initialement la référence après avoir appliqué une :term:`impulsion d'entrée`. Le :term:`Temps de destabilisation<settling time>` est le temps que prend le :term:`Système` pour atteindre la :term:`Référence` après l'application d'une :term:`impulsion d'entrée`.
tr_tr: Resim 2.7 de :term:`step responses <step response>` için; :term:`rise time`, :term:`system`in :term:`step input`u uyguladıktan sonra referansa ulaşmaya başlaması için gereken zamandır. :term:`Settling time <settling time>`:term:`system`in :term:`step input`u uyguladıktan sonra :term:`reference`a oturmaya başlaması için gereken zamandır.
zh_cn: 对于图2.7中的 :term:`step responses <step response>，:term:`rise time` 是指:term:`system`在应用 :term:`step input`后初始到达参考所花费的时间。:term:`Settling time<settling time>是指在应用:term:`step input` 之后，:term:`system` 在 :term:`reference` 考建立时所花费的时间。

source: An *underdamped* response oscillates around the :term:`reference` before settling. An *overdamped* response
es_mx: Una respuesta *subamortiguada* oscila alrededor de la :term:`referencia` antes de estabilizarse. Una respuesta *sobreamortiguada*
fr_ca: Une réponse *sous-amortie* oscille autour de la :term:`Référence` avant de se stabiliser. Une réponse *sur-amortie*
tr_tr: *Yetersiz sönümlenmiş-underdamped* bir yanıt, oturmadan önce :term:`reference` etrafında salınır. *Aşırı sönümlenmiş-overdamped* bir yanıt
zh_cn: 在建立之前，*衰减*的响应会在 :term:`reference` 附近振荡。 *过度*响应

source: PID controller response types
fr_ca: Types de réponse du contrôleur PID

source: is slow to rise and does not overshoot the :term:`reference`. A *critically damped* response has the fastest :term:`rise time` without overshooting the :term:`reference`.
es_mx: tarda en elevarse y no excede el valor de la :term:`referencia`. Una respuesta *críticamente amortiguada* tiene el :term:`tiempo de subida` más rápido sin exceder la :term:`referencia`.
fr_ca: est lente à augmenter et ne dépasse pas le :term:`Référence`. Une réponse *amortie de manière critique* a le :term:`temps de montée` le plus rapide, sans toutefois dépasser la :term:`Référence`.
tr_tr: yavaş yükselir ve :term:`reference` yi aşmaz. *Kritik olarak sönümlenen-critically damped* bir yanıt, :term:`reference` öğesini aşmadan en hızlı :term:`rise time` a sahipdir.
zh_cn: 上升缓慢，并且不会超出 :term:`reference`。 “临界阻尼”响应具有最快的 :term:`rise time` ，而不会超出 :term:`reference`。
