Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/introduction/introduction-to-pid.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Introduction to PID
es_mx: Introducción a PID
fr_ca: Une introduction aux PIDs
tr_tr: PID'ye Giriş
zh_cn: PID简介

source: The PID controller is a commonly used feedback controller consisting of proportional, integral, and derivative terms, hence the name. This article will build up the definition of a PID controller term by term while trying to provide some intuition for how each of them behaves.
es_mx: El controlador PID es usado comúnmente como un controlador de retroalimentación que consiste de términos proporcionales, integrales y derivativos, de ahí el nombre. Este articulo detallara la definición de un controlador PID término por término mientras trata de proporcionar alguna intuición de cómo se comporta cada uno de ellos.
fr_ca: Le contrôleur PID est un contrôleur de rétroaction couramment utilisé composé de termes proportionnels (P), intégraux (I) et dérivés (D), d'où le nom. Cet article va expliquer la définition d'un contrôleur PID un terme à la fois tout en essayant de fournir une certaine précision sur la façon dont chacun de ces termes se comporte.
tr_tr: PID-proportional-integral-derivative denetleyicisi, oransal, integral ve türev terimlerden oluşan yaygın olarak kullanılan bir geri bildirim denetleyicisidir. Bu makale, her birinin nasıl davrandığına dair bir sezgi sağlamaya çalışırken, bir PID denetleyicisinin terim tanımını oluşturacaktır.
zh_cn: PID控制器是一种常用的反馈控制器，由比例项，积分项和微分项组成，因此也称为名称。本文将逐项建立PID控制器项的定义，同时试图直观地反应它们各自的行为。

source: First, we'll get some nomenclature for PID controllers out of the way. The :term:`reference` is called the setpoint (the desired position) and the :term:`output` is called the :term:`process variable` (the measured position). Below are some common variable naming conventions for relevant quantities.
es_mx: Primero, tendremos algo de nomenclatura para los controladores PID. La referencia :term:`reference` es conocido como punto de consigna (la posición deseada) y la salida :term:`output` se le llama variable del proceso :term:`process variable` (la posición medido u obtenida). A continuación, se presenta algunas denominaciones de las variables más comunes.
fr_ca: Tout d'abord, commencons par la nomenclature pour les contrôleurs PID. La :term:`Référence` est appelée le point de consigne (la position souhaitée) et le :term:`Sortie` est appelée la :term:`variable du procédé` (la position mesurée). Vous trouverez ci-dessous quelques conventions de dénomination des variables courantes pour les éléments pertinents aux PIDs.
tr_tr: İlk olarak, PID denetleyicileri için bazı isimlendirmeleri tamamlayacağız. :term:`reference` ayar noktası (istenen konum) ve :term:`output` terimi :term:`process variable-süre. değişkeni` (ölçülen konum) olarak adlandırılır. Aşağıda, ilgili miktarlar için bazı yaygın değişken adlandırma kuralları verilmiştir.
zh_cn: 首先，我们将对PID控制器进行一些命名。 :term:`reference`被称为设定点（期望位置）， :term:`output` 被称为 :term:`process variable`（测量位置）。以下是有关数量的一些常见变量命名约定。

source: :term:`setpoint`
es_mx: :term:`punto de referencia`
fr_ca: :term:`Point de consigne`

source: :term:`control input`
es_mx: :term:`entrada de control`
fr_ca: :term:`Entrée Contrôlée`

source: :term:`error`
fr_ca: :term:`erreur`

source: :term:`output`
es_mx: :term:`salida`
fr_ca: :term:`Sortie`

source: The :term:`error` :math:`e(t)` is :math:`r(t) - y(t)`.
es_mx: El :term:`error` e(t) es :math:`r(t) - y(t)`.
fr_ca: The :term:`erreur` :math:`e(t)` est :math:`r(t) - y(t)`.
tr_tr: :term:`error` :math:`e(t)`, :math:`r(t) - y(t)` dır

source: For those already familiar with PID control, this book's interpretation won't be consistent with the classical intuition of "past", "present", and "future" error. We will be approaching it from the viewpoint of modern control theory with proportional controllers applied to different physical quantities we care about. This will provide a more complete explanation of the derivative term's behavior for constant and moving :term:`setpoints <setpoint>`.
es_mx: Para aquellos que ya estén familiarizados con el controlador PID, la interpretación de este libro no será consistente con la clásica intuición de error “pasado”, “presente” y “futuro”. Nos estaremos acercando a el desde el punto de vista de la teoría de control moderna con controladores proporcionales aplicados a diferentes propiedades físicas que nos interesan. Esto dará una explicación más completa del comportamiento de los términos derivativos para constantes y movimientos de los :term:`puntos de referencia<setpoint>`.
fr_ca: Pour ceux et celles qui connaissent déjà les contrôles PID, l'interprétation de cette section de la documentation ne sera pas cohérente avec la théorie classique des erreurs "passées", "présentes" et "futures". Nous l'aborderons du point de vue de la théorie moderne du contrôle avec des contrôleurs proportionnels appliqués aux différentes quantités physiques qui nous intéressent. Cela fournira une explication plus complète du comportement du paramètre "D", ou Dérivée, pour des :term:`points de consignes<setpoint>` constants ou variables.
tr_tr: PID kontrolüne zaten aşina olanlar için, bu içeriğin yorumlanması "geçmiş", "şimdiki zaman" ve "gelecek" hatalarının klasik düşünceler ile tutarlı olmayacaktır. Önem verdiğimiz farklı fiziksel büyüklüklere uygulanan orantılı kontrolörler için modern kontrol teorisinin bakış açısından yaklaşıyor olacağız. Bu, türev terimin sabit ve hareketli :term:`setpoints <setpoint>` ler için davranışının daha eksiksiz bir açıklamasını sağlayacaktır.
zh_cn: 对于那些已经熟悉PID控制的人来说，本书的解释与“过去”，“现在”和“未来”错误的经典直觉是不一致的。我们将从现代控制理论的观点着手，将比例控制器应用于我们所关心的不同物理量。这将为导数项对于常数和移动：term：`setpoints <setpoint>`的行为提供更完整的解释。

source: The proportional term drives the position error to zero, the derivative term drives the velocity error to zero, and the integral term accumulates the area between the :term:`setpoint` and :term:`output` plots over time (the integral of position :term:`error`) and adds the current total to the :term:`control input`. We'll go into more detail on each of these.
es_mx: El término proporcional lleva el error de posición a cero, el termino derivativo lleva el error de velocidad a cero y el término integral acumula el área entre el :term:`punto de referencia` y la :term:`salida` durante el tiempo (la integral del :term:`error` de posición) y suma el resultado de la :term:`entrada de control`. Iremos a mas detalles con cada uno de ellos.
fr_ca: Le terme proportionnel force l'erreur de positionnement vers zéro, le terme dérivé force l'erreur de vitesse vers zéro et le terme intégral accumule la zone entre les courbes :term:`Point de consigne` et :term:`Sortie` dans le temps (l'intégrale de la position :term:`Erreur`) et ajoute le total actuel à :term:`Entrée contrôlée`. Nous allons fournir plus de détails sur chacun de ces paramètres dans les prochaines lignes..
tr_tr: Orantısal terimi konum hatasını sıfıra, türev terimi hız hatasını sıfıra götürür ve integral terimi :term:`setpoint` ve :term:`output` grafikleri arasındaki alanı zaman içinde biriktirir ( :term:`error` konumunun integrali) ve mevcut toplamı :term:`control input` ne ekler. Bunların her biri hakkında daha fazla ayrıntıya gireceğiz.
zh_cn: 比例项将位置误差驱动为零，微分项将速度误差驱动为零，并且积分项会累积时间上的：term：`setpoint`和：term：`output之间的区域（位置的积分 :term:`error`），然后将电流总和添加到控制输入中。我们将对每一个进行更详细的介绍。

source: Proportional Term
es_mx: Término Proporcional
fr_ca: Paramètre P, ou Proportionnel
tr_tr: Proportional Term - Oransal terimi
zh_cn: 比例项

source: The *Proportional* term drives the position error to zero.
es_mx: El término proporcional lleva la posición de error a cero.
fr_ca: Le terme *proportionnel* force l'erreur de position vers zéro.
tr_tr: *Proportional-Orantılı* terimi, konum hatasını sıfıra götürür.
zh_cn: 比例项将位置误差驱动至零。

source: where :math:`K_p` is the proportional gain and :math:`e(t)` is the error at the current time :math:`t`.
es_mx: donde :math:`K_p` es la ganancia proporcional y :math:`e(t)` es el error en tiempo actual :math:`t`.
fr_ca: où :math:`K_p` est le gain proportionnel et :math:`e(t)` est l'erreur au moment actuel :math:`t`.
tr_tr: burada :math:`K_p` orantılı kazançtır ve :math:`e(t)` geçerli zamandaki :math:`t` hatadır.
zh_cn: 其中 :math:`K_p` 是成比例增益，:math:`e(t)` 是当前时间:math:`t`.的误差。

source: The below figure shows a block diagram for a :term:`system` controlled by a P controller.
es_mx: La imagen a continuación muestra un diagrama de bloques para un :term:`system` controlado por un controlador P.
fr_ca: La figure ci-dessous montre un schéma-bloc pour un :term:`Système` contrôlé seulement par le paramètre P.
tr_tr: Aşağıdaki şekil, bir P kontrolörü tarafından kontrol edilen bir :term:`system` için bir blok diyagramı göstermektedir.
zh_cn: 下图显示了由P控制器控制的：term：`system的框图。

source: Diagram with a P controller
fr_ca: Diagramme avec un contrôleur P

source: Proportional gains act like a "software-defined springs" that pull the :term:`system` toward the desired position. Recall from physics that we model springs as :math:`F = - kx` where :math:`F` is the force applied, :math:`k` is a proportional constant, and :math:`x` is the displacement from the equilibrium point. This can be written another way as :math:`F = k(0-x)` where :math:`0` is the equilibrium point. If we let the equilibrium point be our feedback controller's :term:`setpoint`, the equations have a one to one correspondence.
es_mx: La ganancia proporcional actúa como “un resorte definido por programa” que jala el :term:`system` a la posición deseada. Recordando de la física donde modelamos resortes como :math:`F = - kx` donde :math:`F` es la fuerza aplicada, :math:`k` es la constante proporcional y :math:`x` es el desplazamiento del punto de equilibrio. Esto puede ser escrito de otra manera :math:`F = k(0-x)` donde :math:`0` es el punto de equilibrio. Si permitimos que el punto de equilibrio sea nuestro :term:`punto de referencia` de la retroalimentación del controlador, la ecuación correspondería uno a uno.
fr_ca: Les gains proportionnels agissent comme des "ressorts définis par logiciel" qui tirent le :term:`Système` vers la position souhaitée. Les cours de Physique nous ont appris que nous modélisons les ressorts comme :math:`F = - kx` où :math:`F` est la force appliquée, :math:`k` est une constante proportionnelle, et :math:`x` est le déplacement à partir du point d'équilibre. Cela peut s'écrire d'une autre manière :math:`F = k (0-x)` où :math:`0` est le point d'équilibre. Si nous redéfinissons le point d'équilibre comme le :term:`Point de consigne` de notre contrôleur à rétroaction, les équations correspondent terme pour terme.
tr_tr: Orantılı kazançlar, :term:`system` i istenen konuma çeken "yazılım tanımlı yaylar" gibi hareket eder. Fizikten şunu hatırlayın yayı modellemek için :math:`F = - kx` burada :math:`F` uygulanan kuvvettir, :math:`k` is a orantısal bir sabit ve :math:`x` denge noktasından yer değiştirmedir. Bu başka bir şekilde yazılabilir :math:`F = k(0-x)` burada :math:`0` denge noktasıdır. Denge noktasının geri besleme denetleyicimizin :term:`setpoint` olmasına izin verirsek, denklemlerin bire bir karşılığı olur.
zh_cn: 比例增益就像“软件定义的弹簧”一样，将： :term:`system`拉向所需位置。从物理学中回想起，我们将弹簧建模为 :math:`F = - kx`，其中:math:`F`是施加的力， :math:`k`是比例常数，:math:`x` 是位移。从平衡点开始这可以用另一种方式写成：:math:`F = k(0-x)` 其中:math:`0` 是平衡点。如果我们将平衡点设为反馈控制器的：term：`setpoint`，则方程具有一对一的对应关系。

source: so the "force" with which the proportional controller pulls the :term:`system's <system>` :term:`output` toward the :term:`setpoint` is proportional to the :term:`error`, just like a spring.
es_mx: entonces la “fuerza” con la cual el controlador proporcional jala la :term:`salida` del :term:`system's<system>` hacia la :term:`referencia` es proporcional al :term:`error`, así como un resorte.
fr_ca: de sorte que la "force" avec laquelle le contrôleur proportionnel tire la :term:`Sortie` du :term:`Système<system>` vers le :term:`Point de consigne` est proportionnelle à l' :term:`Erreur`, tout comme un ressort.
tr_tr: dolayısıyla orantısal denetleyicinin :term:`systemin <system>` :term:`output` u : term:`setpoint` yönünde çektiği "kuvvet", bir yay gibi :term:`error` ile orantılıdır.
zh_cn: 因此，比例控制器将 :term:`system's 1` :term:`output`拉向 :term:`setpoint` 的“力”与 :term:`error`成正比，就像弹簧一样。

source: Derivative Term
es_mx: Término Derivativo
fr_ca: Paramètre D, ou dérivée
tr_tr: Derivative- Türev Terimi
zh_cn: 导数项

source: The *Derivative* term drives the velocity error to zero.
es_mx: El término *derivativo* lleva el error de velocidad a cero.
fr_ca: Le terme *dérivée* ramène l'erreur de vitesse vers zéro.
tr_tr: *Türev* terimi hız hatasını sıfıra çeker.
zh_cn: *导数*项将速度误差驱动为零。

source: where :math:`K_p` is the proportional gain, :math:`K_d` is the derivative gain, and :math:`e(t)` is the error at the current time :math:`t`.
es_mx: Donde :math:`K_p` es la ganancia proporcional, :math:`K_d` es la ganancia derivativa y :math:`e(t)` es el error en el tiempo actual :math:`t`.
fr_ca: où :math:`K_p` est le gain proportionnel, :math:`K_d` est le gain dérivé, et :math:`e (t)` est l'erreur au moment actuelle :math:`t`.
tr_tr: burada :math:`K_p` oransal kazançtır, :math:`K_d` türevsel kazançtır ve :math:`e(t)` şu andaki :math:`t` zamanındaki hatadır.
zh_cn: 其中 :math:`K_p`是比例增益，:math:`K_d`是微分增益，:math:`e(t)` 是当前时间 :math:`t`的误差。

source: The below figure shows a block diagram for a :term:`system` controlled by a PD controller.
es_mx: La figura a continuación muestra un diagrama de bloques para un sistema controlado por un controlador PD.
fr_ca: La figure ci-dessous montre un schéma-bloc pour un :term:`Système` contrôlé par un contrôleur PD.
tr_tr: Aşağıdaki şekil, bir PD kontrolörü tarafından kontrol edilen bir :term:`system` için bir blok diyagramı göstermektedir.
zh_cn: 下图显示了由PD控制器控制的：term：`system的框图。

source: Diagram with a PD controller
fr_ca: Diagramme avec un contrôleur

source: A PD controller has a proportional controller for position (:math:`K_p`) and a proportional controller for velocity (:math:`K_d`). The velocity :term:`setpoint` is implicitly provided by how the position :term:`setpoint` changes over time. To prove this, we will rearrange the equation for a PD controller.
es_mx: Un controlador PD tiene un controlador proporcional para la posición (:math:`K_p`) y un controlador proporcional para la velocidad (:math:`K_d`). El :term:`punto de referencia` de la velocidad es dada implícitamente conforme al cambio del :term:`punto de referencia` de la posición conforme al tiempo. Para comprobar esto, reacomodaremos la ecuación para un controlador PD.
fr_ca: Un contrôleur PD a un contrôleur proportionnel pour la position (:math:`K_p`) ET un contrôleur proportionnel pour la vitesse (:math:`K_d`). Le :term:`Point de consigne` de la vitesse est implicitement défini par la façon dont le :term:`Point de consigne` de la position change avec le temps. Pour le prouver, nous allons reformuler l'équation pour un contrôleur PD.
tr_tr: Bir PD denetleyicisinde konum için oransal bir denetleyici (:math:`K_p`) ve hız için oransal denetleyici (:math:`K_d`) bulunur. Hız ile ilgili :term:`setpoint` , örtülü olarak pozisyon :term:`setpoint` inin zaman içinde nasıl değiştiğiyle sağlanır. Bunu kanıtlamak için, bir PD kontrolörü için denklemi yeniden düzenleyeceğiz.
zh_cn: PD控制器具有用于位置的比例控制器(:math:`K_p`) 和用于速度的比例控制器 (:math:`K_d`)。速度:term:`setpoint`是由位置 :term:`setpoint` 随时间变化的方式隐式提供的。为了证明这一点，我们将重新排列PD控制器的公式。

source: where :math:`u_k` is the :term:`control input` at timestep :math:`k` and :math:`e_k` is the :term:`error` at timestep :math:`k`. :math:`e_k` is defined as :math:`e_k = r_k - x_k` where :math:`r_k` is the :term:`setpoint` and :math:`x_k` is the current :term:`state` at timestep :math:`k`.
es_mx: Donde :math:`u_k` es la :term:`entrada de control` en tiempo unitario :math:`k` y :math:`e_k` es el :term:`error` en un tiempo unitario :math:`k`. :math:`e_k` se define como :math:`e_k = r_k - x_k` donde :math:`r_k` es el valor del :term:`punto de referencia` y :math:`x_k` es el :term:`estado` en un tiempo unitario :math:`k`.
fr_ca: où :math:`u_k` est l’ :term:`Entrée contrôlée` au moment :math:`k` et :math:`e_k` est l’ :term:`Erreur` au moment :math:`k`. :math:`e_k` est défini comme :math:`e_k = r_k - x_k` où :math:`r_k` est le :term:`Point de consigne` et :math:`x_k` est l’ :term:`état` au moment :math:`k`.
tr_tr: burada math:`u_k`, timestep :math:`k` da :term:`control input` ve :math:`e_k`, timestep :math:`k`da :term:`error` ifade eder. :math:`e_k`, :math:`e_k = r_k - x_k` olarak tanımlanmıştır; burada :math:`r_k`, :term:`setpoint`dir ve :math:`x_k`, timestep :math:`k`.'da varolan :term:`state` durumudur.
zh_cn: 其中 :math:`u_k` 是在时间步长 :math:`k`的:term:`control input`， :math:`e_k` 是在时间步长:math:`k`的:term:`error` ， :math:`e_k` 被定义为:math:`e_k = r_k - x_k`，其中:math:`r_k` 为 :term:`setpoint`，:math:`x_k`为时间步长:math:`k`时的当前 :term:`state`。

source: Notice how :math:`\frac{r_k - r_{k-1}}{dt}` is the velocity of the :term:`setpoint`. By the same reason, :math:`\frac{x_k - x_{k-1}}{dt}` is the :term:`system's <system>` velocity at a given timestep. That means the :math:`K_d` term of the PD controller is driving the estimated velocity to the :term:`setpoint` velocity.
es_mx: Vea como :math:`\frac{r_k - r_{k-1}}{dt}` es la velocidad del :term:`punto de referencia`. Por la misma razón, :math:`\frac{x_k - x_{k-1}}{dt}` es la velocidad del :term:`sistema <system>` en un tiempo unitario. Esto significa que el término :math:`K_d` del controlador PD lleva la velocidad estimada al :term:`punto de referencia` de la velocidad.
fr_ca: Remarquez comment :math:`\frac {r_k - r_ {k-1}} {dt}` est la vitesse du :term:`Point de consigne`. Pour la même raison, :math:`\frac {x_k - x_ {k-1}} {dt}` est la vitesse :term:`Système<system>` à un moment donné. Cela signifie que le terme :math:`K_d` du contrôleur PD force la vitesse estimée vers la vitesse du :term:`Point de consigne`.
tr_tr: Nasıl olduğuna dikkat edin: :math:`\frac{r_k - r_{k-1}}{dt} , :term:`setpoint` in hızıdır. Aynı nedenden ötürü, :math:`\frac{x_k - x_{k-1}}{dt}`, :term:`systemin <system>` belirli bir zaman adımındaki hızıdır. Bu, PD kontrol cihazının :math:`K_d` teriminin, tahmini hızı :term:`setpoint` hızına sürdüğü anlamına gelir.
zh_cn: 注意:math:`\frac{r_k - r_{k-1}}{dt}`是：term：`setpoint`的速度的方式。出于相同的原因，:math:`\frac{x_k - x_{k-1}}{dt}` 是 :term:`system's 在给定时间步长下的速度。这意味着PD控制器的:math:`K_d`项将估计的速度驱动到:term:`setpoint` 速度。

source: If the :term:`setpoint` is constant, the implicit velocity :term:`setpoint` is zero, so the :math:`K_d` term slows the :term:`system` down if it's moving. This acts like a "software-defined damper". These are commonly seen on door closers, and their damping force increases linearly with velocity.
es_mx: Si el :term:`punto de referencia` es una constante, el :term:`punto de referencia` implícito de la velocidad es cero, entonces el término :math:`K_d` ralentiza el :term:`sistema` si no está variando. Esto actúa como un "amortiguador definido por programa". Estos son encontrados comúnmente en cierrapuertas y su velocidad de amortiguamiento aumenta linealmente con la velocidad.
fr_ca: Si le :term:`Point de consigne` est constant, le :term:`Point de consigne` vitesse est nécessairement zéro. Par conséquent, le terme :math:`K_d` ralentit le :term:`Système`, s'il est en déplacement. Ceci agit comme un "amortisseur défini par logiciel". On retrouve ces amortisseurs sur certaines portes industrielles, et ils sont utilisés pour qu'elles se ferment doucement. Leur force augmente linéairement avec la vitesse.
tr_tr: :term:`setpoint` sabitse, örtük hız :term:`setpoint` sıfırdır, dolayısıyla :math:`K_d` terimi :term:`system` i yavaşlatır. Bu, "yazılım tanımlı bir tampon" gibi davranır. Bunlar genellikle kapı kapatıcılarda görülür ve sönümleme kuvveti hız ile doğrusal olarak artar.
zh_cn: 如果：term：`setpoint`是常数，则隐式速度：term：`setpoint`为零，因此：math：`K_d`项在移动时会降低：term：`system的速度。这就像一个“软件定义的阻尼器”。这些通常在闭门器上看到，它们的阻尼力随速度线性增加。

source: Integral Term
es_mx: Término Integral
fr_ca: Paramètre I, ou Intégrale
tr_tr: İntegral Terimi
zh_cn: 积分项

source: Integral gain is generally not recommended for FRC\ |reg| use. There are better approaches to fix :term:`steady-state error` like using feedforwards or constraining when the integral control acts using other knowledge of the :term:`system`.
es_mx: La ganancia integral generalmente no se recomienda ser usada en FRC\ |reg|. Existen mejores formas para corregir el :term:`error en estado estable` por ejemplo usar la compensación o limitarlo cuando la integral de control actúe utilizando otro conocimiento del :term:`sistema`.
fr_ca: Le gain intégral n’est généralement pas recommandé pour une utilisation en FRC\ |reg|. Il existe de meilleures approches pour corriger :term:`l’erreur en régime permanent` comme l’utilisation de feedforwards ou la contrainte lorsque le contrôle intégral agit en utilisant d’autres connaissances du :term:`système`.
tr_tr: İntegral kazanç genellikle FRC \ |reg| için önerilmez kullanın. Düzeltmek için daha iyi yaklaşımlar vardır:term:`steady-state error` , ileri beslemeyi kullanmak veya integral kontrol, :term:`system` ile ilgili diğer bilgileri kullanarak hareket ettiğinde kısıtlama gibi.
zh_cn: 积分增益一般不推荐用于FRC。有更好的方法来修复 :term:`steady-state error` ，例如使用前馈或在积分控制使用 :term:`system`的其他知识进行操作时进行约束。

source: The *Integral* term accumulates the area between the :term:`setpoint` and :term:`output` plots over time (i.e., the integral of position :term:`error`) and adds the current total to the :term:`control input`. Accumulating the area between two curves is called integration.
es_mx: El término *Integral* acumula el área entre el punto de :term:`punto de referencia` y la :term:`salida` durante un tiempo (p. ej., la integral del :term:`error` de posición) y suma el total actual a la :term:`entrada de control`. La acumulación el área entre dos curvas es llamada integración.
fr_ca: Le terme *Integrale* accumule la zone entre les courbes :term:`Point de consigne` et la :term:`Sortie` dans le temps (c'est-à-dire l'intégrale de :term:`l'erreur` de position), et ajoute cette somme à :term:`l'Entrée contrôlée`. L'accumulation de l'aire entre deux courbes s'appelle intégration.
tr_tr: *Integral* terimi :term:`setpoint` ve :term:`output` grafikleri arasındaki alanı zaman içinde biriktirir (yani, pozisyon :term:`error` ların integrali) ve mevcut toplamı :term:`control input` a ekler. İki eğri arasındaki alanı biriktirmeye entegrasyon denir.
zh_cn: 将:term: ' setpoint '和:term: ' output '之间的面积随着时间累积(即position:term: ' error '的积分)，并将当前的总和加到:term: ' control input '。累积两条曲线之间的面积称为积分。

source: where :math:`K_p` is the proportional gain, :math:`K_i` is the integral gain, :math:`e(t)` is the error at the current time :math:`t`, and :math:`\tau` is the integration variable.
es_mx: Donde :math:`K_p` es la ganancia proporcional, :math:`K_i` es la ganancia integral, :math:`e(t)` es el error en el tiempo actual :math:`t` y :math:`\tau` es la integración de la variable.
fr_ca: où :math:`K_p` est le gain proportionnel, :math:`K_i` est le gain intégral, :math:`e (t)` est l'erreur au moment donné :math:`t`, et :math:`\tau` est la variable d'intégration.
tr_tr: burada :math:`K_p` oransal kazanç, :math:`K_i` integral kazançtır, :math:`e(t)` geçerli zamandaki hatadır :math:`t` ve :math:`\tau` entegrasyon değişkenidir.
zh_cn: 其中：math：`K_p`是比例增益，：math：`K_i`是积分增益，：math：`e（t）`是当前时间 :math:`t`的误差`和:math:`\tau` 是集成变量。
