Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/introduction/tuning-pid-controller.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Tuning a PID Controller
es_mx: Ajuste de un Controlador PID
fr_ca: Réglage d'un contrôleur PID
tr_tr: Bir PID Denetleyicisinin Ayarlanması
zh_cn: 调整PID控制器

source: These steps apply to position PID controllers. Velocity PID controllers typically don't need :math:`K_d`.
es_mx: Estos pasos aplican para controladores PID de posición. Controladores PID de velocidad normalmente no requieren :math:`K_d`.
fr_ca: Ces étapes s'appliquent aux contrôleurs PID de positionnement. Les contrôleurs PID de vitesse n'ont généralement pas besoin de :math:`K_d`.
tr_tr: Bu adımlar, PID kontrolörleri pozisyonlamak için geçerlidir. Hız PID denetleyicileri tipik olarak şunlara ihtiyaç duymazlar :math:`K_d`.
zh_cn: 这些步骤适用于位置PID控制器。速度PID控制器通常不需要:math:`K_d`。

source: Set :math:`K_p`, :math:`K_i`, and :math:`K_d` to zero.
es_mx: Ajustar :math:`K_p`, :math:`K_i`, y :math:`K_d` a cero.
fr_ca: Réglez :math:`K_p`, :math:`K_i` et :math:`K_d` à zéro.
tr_tr: :math:`K_p`, :math:`K_i`, ve :math:`K_d` yi sıfıra ayarla
zh_cn: 将 :math:`K_p`，:math:`K_i`和 :math:`K_d`设置为零。

source: Increase :math:`K_p` until the :term:`output` starts to oscillate around the :term:`setpoint`.
es_mx: Incrementar :math:`K_p` hasta que la :term:`salida` comience a oscilar entre el :term:`punto de referencia`.
fr_ca: Augmentez :math:`K_p` jusqu'à ce que la :term:`Sortie` commence à osciller autour du :term:`Point de consigne`.
tr_tr: :math:`K_p` yi, :term:`output` :term:`setpoint` etrafında salınmaya başlayana kadar artırın.
zh_cn: 增加:math:`K_p` 直到输出开始围绕 :term:`setpoint`振荡。

source: Increase :math:`K_d` as much as possible without introducing jittering in the :term:`system response`.
es_mx: Aumentar :math:`K_d` tanto como sea posible sin introducir jittering en :term:`system response`.
fr_ca: Augmentez :math:`K_d` autant que possible sans introduire d'oscillations (jitter) dans :term:`system response`.
tr_tr: :math:`K_d` yi :term:`system response` da titreşim oluşturmadan mümkün olduğunca çok arttırın.
zh_cn: 尽可能增加 :math:`K_d` ，而不会在 :term:`system response`中引入抖动。

source: Plot the position :term:`setpoint`, velocity :term:`setpoint`, measured position, and measured velocity. The velocity :term:`setpoint` can be obtained via numerical differentiation of the position :term:`setpoint` (i.e., :math:`v_{desired,k} = \frac{r_k - r_{k-1}}{\Delta t}`). Increase :math:`K_p` until the position tracks well, then increase :math:`K_d` until the velocity tracks well.
es_mx: Trace el :term:`punto de referencia` de la posición, el :term:`punto de referencia` de la velocidad, posición obtenida y velocidad obtenida. El :term:`punto de referencia` de la velocidad puede ser obtenida mediante la diferenciación numérica del :term:`punto de referencia` de la posición (p.ej., :math:`v_{desired,k} = \frac{r_k - r_{k-1}}{\Delta t}`). Aumente :math:`K_p` hasta que la posición siga bastante bien, luego incremente :math:`K_d` hasta que la velocidad siga bastante bien.
fr_ca: Tracez les graphiques suivants: :term:`Point de consigne` de la position, :term:`Point de consigne` de la vitesse, position mesurée et vitesse mesurée. Le :term:`Point de consigne` de la vitesse peut être obtenu par différenciation numérique du :term:`Point de consigne` de la position, (c'est-à-dire, :math:`v_{souhaitée,k} = \frac{r_k - r_{k-1}}{\Delta t}` ). Augmentez :math:`K_p` jusqu'à ce que la position suive bien, puis augmentez :math:`K_d` jusqu'à ce que la vitesse suive bien.
tr_tr: Pozisyon :term:`setpoint`, hız :term:`setpoint`, ölçülen konum ve ölçülen hızı çiziniz. Hız :term:`setpoint`, konum :term:`setpoint` in (örneğin, :math:`v_{desired,k} = \frac{r_k - r_{k-1}}{\Delta t}`) sayısal farklılaşması yoluyla elde edilebilir . :math:`K_p` yi konum iyi izlenene kadar arttırın, ardından hız iyi izlenene kadar :math:`K_d` artırın.
zh_cn: 标出位置 :term:`setpoint`、速度 :term:`setpoint`、测量位置和测量速度。通过对位置:term:`setpoint`的数值微分，可以得到速度:term:`setpoint` (i.e., :math:`v_{desired,k} = \frac{r_k - r_{k-1}}{\Delta t}`) 。增加:math:`K_p` 直到位置轨迹良好，然后增加 :math:`K_d`直到速度轨迹良好。

source: If the :term:`controller` settles at an :term:`output` above or below the :term:`setpoint`, one can increase :math:`K_i` such that the :term:`controller` reaches the :term:`setpoint` in a reasonable amount of time. However, a steady-state feedforward is strongly preferred over integral control (especially for PID control).
es_mx: Si el :term:`controlador` se estabiliza en una :term:`salida` por encima o debajo del :term:`punto de referencia`, uno puede incrementar :math:`K_i` hasta que el controlador alcance el :term:`punto de referencia` en una cantidad de tiempo razonable. Sin embargo, un estado estable de compensación es fuertemente preferido sobre un control integral (especialmente para un control PID).
fr_ca: Si la :term:`Sortie` du :term:`Contrôleur` se stabilise au-dessus ou en dessous du :term:`Point de consigne`, on peut augmenter :math:`K_i` de telle sorte que le :term:`Contrôleur` atteigne le :term:`Point de consigne` dans un délai raisonnable. Cependant, l'utilisation du mode "Feedforward" en régime permanent est fortement préférée à la commande intégrale (en particulier pour la commande PID).
tr_tr: Eğer :term:`controller` , :term`setpoint` in üstünde veya altında bir :term:`output` değerine yerleşirse, makul bir süre içinde :math:`K_i`, arttırılarak :term:`controller` :term:`setpoint`e ulaştırılır. Bununla birlikte, steady-state ileri beslemesi, integral kontrole göre (özellikle PID kontrolü için) kuvvetle tercih edilir.
zh_cn: 如果 :term:`controller` 控制器的输出稳定在 :term:`setpoint`之上或之下，则可以增加 :math:`K_i` 的值以使:term:`controller`控制器达到 :term:`setpoint` 在合理的时间内。但是，稳态积分前馈优于积分控制（尤其是对于PID控制）。

source: Adding an integral gain to the :term:`controller` is an incorrect way to eliminate :term:`steady-state error`. A better approach would be to tune it with an integrator added to the :term:`plant`, but this requires a :term:`model`. Since we are doing output-based rather than model-based control, our only option is to add an integrator to the :term:`controller`.
es_mx: Agregar una ganancia integral al :term:`controlador` es una manera incorrecta de eliminar el :term:`error de estado estable`. Un mejor enfoque sería ajustarlo con un integrador sumado a la :term:`planta`, pero esto requiere un :term:`modelo`. Como estamos haciendo un control basado en resultados en lugar de hacerlo basado en modelo, nuestra única opción es adicionar un integrador al :term:`controlador`.
fr_ca: L'ajout d'un gain intégral au :term:`Contrôleur` est une manière incorrecte d'éliminer l' :term:`erreur régime permanent`. Une meilleure approche serait de le régler avec un intégrateur ajouté à l' :term:`Usine`, mais cela nécessite un :term:`Modèle`. Puisque nous effectuons un contrôle basé sur la sortie plutôt que sur le modèle, notre seule option est d'ajouter un intégrateur au :term:`Contrôleur`.
tr_tr: :term:`controller` a integral kazanç eklemek, :term:`steady-state error" ı ortadan kaldırmanın yanlış bir yoludur. Daha iyi bir yaklaşım, onu :term:`plant` a eklenmiş bir entegratörle ayarlamak olacaktır, ancak bu bir :term:`model` gerektirir. Model tabanlı kontrol yerine çıktı bazlı kontrol yaptığımız için, tek seçeneğimiz :term:`controller` a bir entegratör eklemektir.
zh_cn: 向 :term:`controller`添加积分增益是消除 :term:`steady-state error`的不正确方法。更好的方法是使用添加到:term:`plant`的积分器对其进行调整，但这需要使用:term:`model`。由于我们正在执行基于输出的控制，而不是基于模型的控制，因此，我们唯一的选择是在 :term:`controller中添加一个积分器。

source: Beware that if :math:`K_i` is too large, integral windup can occur. Following a large change in :term:`setpoint`, the integral term can accumulate an error larger than the maximal :term:`control input`. As a result, the system overshoots and continues to increase until this accumulated error is unwound.
es_mx: REVISAR Tener cuidado si :math:`K_i` es muy grande, puede ocurrir un windup integral. Después de un gran cambio en el :term:`punto de referencia`, el término integral puede acumular un error mayor que la máxima :term:`entrada de control`. Como resultado, el sistema se excede y continúa incrementando hasta que este error acumulativo es desenrollado.
fr_ca: Sachez que si :math:`K_i` est trop grand, un emballement intégral peut se produire. Suite à un changement important du :term:`Point de consigne`, le terme intégral peut accumuler une erreur plus grande que l’ :term:`Entrée contrôlée` maximale. Par conséquent, le système dépasse les bornes et continue d'augmenter jusqu'à ce que cette erreur accumulée soit supprimée.
tr_tr: Dikkat edin :math:`K_i` çok büyükse, integral kapanma meydana gelebilir. :term:`set-point` ndaki büyük bir değişikliğin ardından, integral terim, maximal :term:`control input` nden daha büyük bir hata biriktirebilir. Sonuç olarak, sistem aşır ve bu birikmiş hata çözülene kadar artmaya devam eder.
zh_cn: 请注意，如果:math:`K_i` 过大，则会发生积分缠绕。:term:`setpoint`发生较大变化后，积分项会累积大于最大:term:`control input`的误差。结果，系统超调并继续增加，直到该累积的错误消失为止。

source: The :ref:`frc-characterization toolsuite <docs/software/pathplanning/robot-characterization/index:Robot Characterization>` can be used to model your system and give accurate Proportional and Derivative values. This is preferred over tuning the controller yourself.
fr_ca: La :ref:`frc-characterization toolsuite <docs/software/pathplanning/robot-characterization/index:Robot Characterization>` peut être utilisée pour modéliser votre système et donner des valeurs proportionnelles et dérivées précises. Ceci est préférable au réglage du contrôleur par vous-même.

source: Actuator Saturation
es_mx: Saturación del Actuador
fr_ca: Saturation de l'actionneur
tr_tr: Aktüatör Doygunluğu
zh_cn: 执行器饱和

source: A controller calculates its output based on the error between the :term:`reference` and the current :term:`state`. :term:`Plant <plant>` in the real world don't have unlimited control authority available for the controller to apply. When the actuator limits are reached, the controller acts as if the gain has been temporarily reduced.
es_mx: Un controlador calcula la salida en función del error entre el punto de :term:`referencia` y el :term:`estado` actual. Una :term:`Planta <plant>` en el mundo real no tiene autoridad ilimitada de control disponible para que el controlador la aplique. Cuando los límites del actuador son alcanzados, el controlador actúa como si la ganancia se hubiera reducido temporalmente.
fr_ca: Un contrôleur calcule sa sortie en fonction de l'erreur entre la :term:`Référence` et l’ :term:`état` actuel de :term:`l'Usine<plant>`. Dans une application réelle, nous n'avons pas un contrôle illimité disponible au contrôleur. Lorsque les limites de l'actionneur sont atteintes, le contrôleur agit comme si le gain avait été temporairement réduit.
tr_tr: Bir denetleyici, çıktısını :term:`reference` ile current :term:`state` arasındaki hataya göre hesaplar. :terim:`Plant <plant>` gerçek dünyadaki, denetleyicinin uygulayabileceği sınırsız denetim yetkisine sahip değildir. Aktüatör limitlerine ulaşıldığında, kontrolör kazanç geçici olarak düşürülmüş gibi davranır.
zh_cn: 控制器根据 :term:`reference` 和 :term:`state`之间的误差来计算其输出。现实世界中的 :term:`Plant 1`<plant>没有无限的控制权可用于控制器。当达到执行器极限时，控制器的作用就好像增益已暂时减小。

source: We'll try to explain this through a bit of math. Let's say we have a controller :math:`u = k(r - x)` where :math:`u` is the :term:`control effort`, :math:`k` is the gain, :math:`r` is the :term:`reference`, and :math:`x` is the current state. Let :math:`u_{max}` be the limit of the actuator's output which is less than the uncapped value of :math:`u` and :math:`k_{max}` be the associated maximum gain. We will now compare the capped and uncapped controllers for the same :term:`reference` and current :term:`state`.
es_mx: Trataremos de explicar esto a través de un poco de matemáticas. Digamos que tenemos un controlador :math:`u = k(r - x)` donde :math:`u` es el :term:`esfuerzo de control`, :math:`k` es la ganancia, :math:`r` es la :term:`referencia` y :math:`x` es el estado actual. Dejemos que :math:`u_{max}` sea el límite de la salida del actuador la cual es menor que el valor sin límites de :math:`u` y :math:`k_{max}` sea la ganancia máxima. Ahora compararemos el controlador limitado y el ilimitado para el mismo punto de :term:`referencia` y el :term:`estado` actual.
fr_ca: Nous allons essayer d'expliquer cela en utilisant un peu de mathématiques. Disons que nous avons un contrôleur :math:`u = k (r - x)` où :math:`u` est le :term:`effort de contrôle`, :math:`k` est le gain, :math:`r` est la :term:`Référence`, et :math:`x` est l'état actuel. Soit :math:`u_ {max}` la limite de la sortie de l'actionneur qui est inférieure à la valeur non plafonnée de :math:`u` et :math:`k_ {max}` le gain maximum associé. Nous allons maintenant comparer les contrôleurs plafonnés et non plafonnés pour les mêmes :term:`Référence` et :term:`état` courant.
tr_tr: Bunu biraz matematikle açıklamaya çalışacağız. Bir denetleyicimiz olduğunu varsayalım :math:`u = k(r - x)` burada :math:`u` :terim:`control effort`, :matematik:`k` kazançtır, :math:`r` :term:`reference` ve :math:`x` mevcut durumdur. Diyelim ki :math:`u_{max}` aktüatör çıkışının sınırlandırılmamış değerinden daha küçük olan :math:`u` ve :math:`k_{max}` ilişkili maksimum kazanç olsun. Şimdi aynı :term:`reference` ve geçerli :term:`state` için başlıklı ve başlıksız denetleyicileri karşılaştıracağız.
zh_cn: 我们将尝试通过一些数学来解释这一点。假设我们有一个控制器:math:`u = k(r - x)` 其中， :math:`u` 是:term:`control effort`，而:math:`k`是增益。 :math:`r` 是:term:`reference`，:math:`x`是当前状态。令 :math:`u_{max}` 是执行器输出的极限，该极限小于执行器的上限值，而:math:`u` 和 :math:`k_{max}` 是相关的最大增益。现在，我们将比较相同的 :term:`reference`和当前的 :term:`state`的有上限和无上限控制器

source: For the inequality to hold, :math:`k_{max}` must be less than the original value for :math:`k`. This reduced gain is evident in a :term:`system response` when there is a linear change in state instead of an exponential one as it approaches the :term:`reference`. This is due to the :term:`control effort` no longer following a decaying exponential plot. Once the :term:`system` is closer to the :term:`reference`, the controller will stop saturating and produce realistic controller values again.
es_mx: Para que la desigualdad se mantenga, :math:`k_{max}` debe ser menor que el valor original de :math:`k`. Esta ganancia reducida es evidente en la :term:`respuesta del sistema` cuando se tiene un cambio lineal en el estado en lugar de uno exponencial a medida que se va acercando a la :term:`referencia`. Esto se debe a que el :term:`esfuerzo de control` ya no sigue a un gráfico de decaimiento exponencial. Cuando el :term:`sistema` está cerca de la :term:`referencia`, el controlador dejará de saturarse y producirá valores reales nuevamente.
fr_ca: Pour que l'inégalité se maintienne, :math:`k_ {max}` doit être inférieur à la valeur d'origine pour :math:`k`. Ce gain réduit est évident dans la réponse du :term:`system` quand il y a un changement d'état linéaire au lieu d'un changement exponentiel à l'approche du terme :term:`Référence`. Cela est dû à :term:`l'effort de contrôle` ne suivant plus un tracé exponentiel amorti. Une fois que le :term:`Système` est plus proche de la :term:`Référence`, le contrôleur cessera de saturer et produira de nouveau des valeurs de contrôleur réalistes.
tr_tr: Eşitsizliğin tutulması için :math:`k_{max}`, :math:`k` için orijinal değerden daha küçük olmalıdır. Bu azalmış kazanç, :term:`reference` a yaklaştıkça üstel bir durum yerine doğrusal bir değişiklik olduğunda bir :terim:`system response` nda belirgindir. Bunun nedeni :term:`control effort` artık küçülen üstel bir grafiği takip etmiyor. :term:`system`, :term:`reference` öğesine yaklaştığında, denetleyici doygunluğu durdurur ve yeniden gerçekçi denetleyici değerleri üretir.
zh_cn: 为了保持不等式，:math:`k_{max}` 必须小于 :math:`k`的原始值。当状态出现线性变化而不是指数变化时，这种增益的减少在 :term:`system response` 中是明显的，因为它接近于 :term:`reference`。这是由于:term:`control effort` 不再遵循衰减的指数图。一旦 :term:`system` 更接近 :term:`reference`，控制器将停止饱和并再次产生逼真的控制器值。
