Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/introduction/2017-vision-examples.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: 2017 Vision Examples
es_mx: Ejemplos de visión 2017
fr_ca: Exemples de vision pour la saison 2017
tr_tr: 2017 Vision Örnekleri
zh_cn: 2017视觉程序示例

source: The 2017 LabVIEW Vision Example is included with the other LabVIEW examples. From the Splash screen, click Support->Find FRC\ |reg| Examples or from any other LabVIEW window, click Help->Find Examples and locate the Vision folder to find the 2017 Vision Example. The example images are bundled with the example.
es_mx: El ejemplo de Visión de 2017 de LabVIEW se incluye con los demás ejemplos de LabVIEW. Desde la pantalla de inicio, haga clic en Support->Find FRC\ |reg| Examples o desde cualquier otra ventana de LabVIEW, haga clic en Help->Find Examples y localice la carpeta Vision para encontrar el ejemplo de Visión 2017. Las imágenes se incluyen con el ejemplo.
fr_ca: L’exemple de vision en LabVIEW 2017 est inclus dans les autres exemples LabVIEW. Depuis la fenêtre d'accueil, cliquez sur Support->Find FRC\ |reg| Examples ou à partir de toute autre fenêtre LabVIEW, cliquez sur Help->Find Examples et localisez le dossier Vision pour trouver 2017 Vision Example. Les images d’exemple sont groupées avec l’exemple.
tr_tr: 2017 LabVIEW Vision Örneği diğer LabVIEW örnekleriyle birlikte verilmektedir. Açılış ekranından Destek-> FRC Bul \ | reg | Örneklerden veya başka herhangi bir LabVIEW penceresinden, Yardım-> Örnekler Bul'a tıklayın ve 2017 Vision Örneğini bulmak için Vision klasörünü bulun. Örnek görüntüler örnekle paketlenmiştir.
zh_cn: 其他LabVIEW范例随附2017 LabVIEW Vision范例。在启动屏幕上，单击支持->查找FRC \ | reg |。示例或在任何其他LabVIEW窗口中，单击帮助->查找示例，然后找到Vision文件夹以查找2017 Vision示例。示例图像与示例捆绑在一起。

source: We have provided a GRIP project and the description below, as well as the example images, bundled into a ZIP that `can be found on TeamForge <https://usfirst.collab.net/sf/frs/do/viewRelease/projects.wpilib/frs.sample_programs.2017_c_java_vision_sample>`_.
es_mx: Hemos proporcionado un proyecto GRIP y la descripción a continuación, así como las imágenes de ejemplo, incluido en un ZIP que pueden ser encontrado en TeamForge <https://usfirst.collab.net/sf/frs/do/viewRelease/projects.wpilib/frs.sample_programs.2017_c_java_vision_sample>`_.
fr_ca: Nous avons fourni un projet GRIP et la description ci-dessous, ainsi que les exemples d'images, regroupés dans un fichier ZIP qui `peut être trouvé sur TeamForge <https://usfirst.collab.net/sf/frs/do/viewRelease/projects.wpilib/frs.sample_programs.2017_c_java_vision_sample>`_.
tr_tr: Bir GRIP projesi ve aşağıdaki açıklamanın yanı sıra bir ZIP içine yerleştirilmiş örnek görseller sağladık. `TeamForge'da bulunabilir <https://usfirst.collab.net/sf/frs/do/viewRelease/projects.wpilib/frs.sample_programs.2017_c_java_vision_sample>`_.
zh_cn: 我们提供打包成ZIP文件的一个GRIP项目，其中包括项目描述以及示例图像。可以在TeamForge <https://usfirst.collab.net/sf/frs/do/viewRelease/projects.wpilib/frs.sample_programs.2017_c_java_vision_sample>中找到ZIP文件。

source: See :ref:`docs/software/vision-processing/grip/using-generated-code-in-a-robot-program:Using Generated Code in a Robot Program` for details about integrating GRIP generated code in your robot program.
es_mx: Consulte docs/software/vision-processing/grip/using-generated-code-in-a-robot-program:Using Generated Code in a Robot Program para obtener detalles sobre la integración de GRIP código generado en su programa de robot.
fr_ca: Voir :ref:`docs/software/vision-processing/grip/using-generated-code-in-a-robot-program:Using Generated Code in a Robot Program` pour plus de détails sur l'intégration du code généré par GRIP dans votre programme de robot.
tr_tr: GRIP tarafından oluşturulan kodu robot programınıza entegre etme hakkında ayrıntılar için :ref:`docs/software/vision-processing/grip/using-generated-code-in-a-robot-program:Using Generated Code in a Robot Program` bölümüne bakın.
zh_cn: 参见:ref: 'docs/software/vision-processing/grip/ use -generated-code in-a- Robot - Program:Using Generated Code in a Robot - Program '，了解如何在机器人程序中整合GRIP生成代码的详细信息。

source: The code generated by the included GRIP project will find OpenCV contours for green particles in images like the ones included in the Vision Images folder of this ZIP. From there you may wish to further process these contours to assess if they are the target. To do this:
es_mx: El código generado por el proyecto GRIP incluido encontrará contornos de OpenCV para partículas verdes en imágenes como las incluidas en la carpeta Vision Images de este ZIP. Desde allí es posible que usted desee seguir procesando estos contornos para evaluar si son el objetivo. Para hacer esto:
fr_ca: Le code généré par le projet GRIP inclus trouvera les contours OpenCV pour les particules vertes dans les images incluses dans le dossier Vision Images de ce ZIP. À partir de là, vous souhaiterez peut-être poursuivre le traitement de ces contours pour évaluer s'ils identifient correctement la cible. Pour faire cela:
tr_tr: Dahil edilen GRIP projesi tarafından oluşturulan kod, bu ZIP'ın Vision Images klasöründe bulunanlar gibi görüntülerde yeşil parçacıklar için OpenCV konturlarını bulacaktır. Oradan, hedef olup olmadıklarını değerlendirmek için bu konturları daha fazla işlemek isteyebilirsiniz. Bunu yapmak için:
zh_cn: 内置的GRIP项目生成的代码将使用OpenCV在图像中找到绿色物体的轮廓，就如此ZIP的Vision images文件夹中所包含的图像那样。之后，您可能希望进一步处理这些轮廓，以评估它们是否是目标。为此：

source: Use the boundingRect method to draw bounding rectangles around the contours
es_mx: Use el método boundingRect para dibujar rectángulos delimitadores alrededor de los contornos
fr_ca: Utilisez la méthode "boundingRect" pour dessiner des rectangles de délimitation autour des contours
tr_tr: Konturların etrafına sınırlayıcı dikdörtgenler çizmek için boundingRect yöntemini kullanın
zh_cn: 使用boundingRect方法在边缘轮廓周围绘制外接矩形

source: The LabVIEW example code calculates 5 separate ratios for the target. Each of these ratios should nominally equal 1.0. To do this, it sorts the contours by size, then starting with the largest, calculates these values for every possible pair of contours that may be the target, and stops if it finds a target or returns the best pair it found.
es_mx: El código de ejemplo de LabVIEW calcula 5 proporciones separadas para el objetivo. Cada una de estas proporciones deberían ser nominalmente iguales a 1.0. Para hacer esto, ordene los contornos por tamaño, luego comience con el más grande, calcule estos valores para cada posible par de contornos que pueden ser el objetivo, y se detiene si encuentra un objetivo o devuelve el mejor par que encontró.
fr_ca: L'exemple de code LabVIEW calcule 5 ratios distincts pour la cible. Chacun de ces ratios devrait être nominalement égal à 1.0. Pour ce faire, il trie les contours selon leur taille, puis en commençant par le plus grand, calcule ces valeurs pour chaque paire de contours qui peut être éventuellement la bonne cible et s'arrête s'il trouve la bonne cible ou renvoie la meilleure paire trouvée.
tr_tr: LabVIEW örnek kodu, hedef için 5 ayrı oran hesaplar. Bu oranların her biri nominal olarak 1.0'a eşit olmalıdır. Bunu yapmak için, konturları boyuta göre sıralar, ardından en büyüğünden başlayarak, hedef olabilecek her olası kontur çifti için bu değerleri hesaplar ve bir hedef bulursa veya bulduğu en iyi çifti döndürürse durur.
zh_cn: LabVIEW示例代码为此目标计算5个单独的比率。每个比率名义上应该等于1.0。为此，它按大小对轮廓进行排序，然后从最大的开始，对每一对可能是目标的轮廓进行值计算，并在找到目标或返回它找到的最佳对时停止。

source: In the formulas below, each letter refers to a coordinate of the bounding rect (H = Height, L = Left, T = Top, B = Bottom, W = Width) and the numeric subscript refers to the contour number (1 is the largest contour, 2 is the second largest, etc).
es_mx: En las fórmulas a continuación, cada letra se refiere a una coordenada del límite delimitador (H = Altura, L = Izquierda, T = Arriba, B = Abajo, W = Ancho) y el subíndice numérico se refiere al número del contorno (1 es el contorno más grande, 2 es el segundo más grande, etc).
fr_ca: Dans les formules ci-dessous, chaque lettre fait référence à une coordonnée du rectangle englobant (H = hauteur, L = gauche, T = haut, B = bas, W = largeur) et l'indice numérique fait référence au numéro de contour (1 est le plus grand contour, 2 est le deuxième plus grand, etc.).
tr_tr: Aşağıdaki formüllerde, her harf sınırlayıcı rektenin (H = Yükseklik, L = Sol, T = Üst, B = Alt, W = Genişlik) bir koordinatını ve sayısal alt simge kontur numarasını (1 en büyük kontur, 2 en büyük ikinci, vb.).
zh_cn: 下面公式中，每个字母代表外接矩形的一个指标(H =高，L=左，T=上，B=下，W=宽)，数字下标为等高值（1为最大轮廓，2为第二大轮廓，以此类推）。

source: Top height should be 40% of total height (4 in / 10 in):
es_mx: La altura superior debe ser del 40% de la altura total (4 in / 10 in):
fr_ca: La hauteur du haut doit être de 40% de la hauteur totale (4 pouces / 10 pouces):
tr_tr: Üst yükseklik, toplam yüksekliğin% 40'ı olmalıdır (4 inç / 10 inç):
zh_cn: 最大高度应占总高度的40%（4英寸/ 10英寸）：

source: Top of bottom stripe to top of top stripe should be 60% of total height (6 in / 10 in):
es_mx: La parte superior de la franja inferior a la parte superior de la franja superior debe ser el 60% de la altura total (6 in / 10 in):
fr_ca: Du haut de la bande inférieure au haut de la bande supérieure doit correspondre à 60% de la hauteur totale (6 pouces / 10 pouces):
tr_tr: Alt şeridin üstünden üst şeridin üstüne kadar toplam yüksekliğin% 60'ı olmalıdır (6 inç / 10 inç):
zh_cn: 底部边顶部至顶部边顶部应为总高度的60%（6 英寸/10 英寸）：

source: The distance between the left edge of contour 1 and the left edge of contour 2 should be small relative to the width of the 1st contour; then we add 1 to make the ratio centered on 1:
es_mx: La distancia entre el borde izquierdo del contorno 1 y el borde izquierdo del contorno 2 debe ser pequeño en relación con el ancho del primer contorno; luego agregamos 1 para hacer la relación centrada en 1:
fr_ca: La distance entre le bord gauche du contour 1 et le bord gauche du contour 2 doit être petite par rapport à la largeur du 1er contour; puis on ajoute 1 pour faire le rapport centré sur 1:
tr_tr: Kontur 1'in sol kenarı ile kontur 2'nin sol kenarı arasındaki mesafe, 1. konturun genişliğine göre küçük olmalıdır; daha sonra oranı 1'e ortalamak için 1 ekliyoruz:
zh_cn: 轮廓1左缘到轮廓2左缘的距离相对于第一个轮廓的宽度应较小;然后我们加1以使比值达到1：

source: The widths of both contours should be about the same:
es_mx: El ancho de ambos contornos debe ser aproximadamente el mismo:
fr_ca: Les largeurs des deux contours doivent être à peu près les mêmes:
tr_tr: Her iki konturun genişliği yaklaşık olarak aynı olmalıdır:
zh_cn: 两个轮廓的宽度应大致相同：

source: The larger stripe should be twice as tall as the smaller one
es_mx: La franja más grande debe ser dos veces más alta que la más pequeña.
fr_ca: La plus grande bande doit être deux fois plus haute que la plus petite
tr_tr: Büyük şerit, küçük şeritten iki kat daha uzun olmalıdır.
zh_cn: 较大的边应该是较小边的两倍高

source: Each of these ratios is then turned into a 0-100 score by calculating:
es_mx: Cada una de estas proporciones se convierte en una puntuación de 0-100 calculando:
fr_ca: Chacun de ces ratios est ensuite transformé en un score de 0 à 100 en calculant:
tr_tr: Bu oranların her biri daha sonra hesaplanarak 0-100 arasında bir puana dönüştürülür:
zh_cn: 然后通过计算，将每个比率转化为0-100分：

source: To determine distance, measure pixels from top of top bounding box to bottom of bottom bounding box:
es_mx: Para determinar la distancia, mida los píxeles desde la parte superior del cuadro delimitador superior hasta la parte inferior cuadro delimitador:
fr_ca: Pour déterminer la distance, mesurez les pixels du haut du cadre de délimitation supérieur au bas du cadre de délimitation inférieur:
tr_tr: Mesafeyi belirlemek için, üst sınırlayıcı kutunun üstünden alt sınırlayıcı kutunun altına kadar pikselleri ölçün:
zh_cn: 测量顶部外接矩形的顶部到底部外接矩形的底部的像素长度，来确定距离:

source: The LabVIEW example uses height as the edges of the round target are the most prone to noise in detection (as the angle points further from the camera the color looks less green). The downside of this is that the pixel height of the target in the image is affected by perspective distortion from the angle of the camera. Possible fixes include:
es_mx: El ejemplo de LabVIEW usa la altura ya que los bordes del objetivo redondo son los más propensos a ruido en la detección (a medida que el ángulo apunta más lejos de la cámara, el color se ve menos verde). La desventaja de esto es que la altura del píxel del objetivo en la imagen se ve afectada por la perspectiva distorsión desde el ángulo de la cámara. Las posibles soluciones incluyen:
fr_ca: L'exemple LabVIEW utilise la hauteur car les rebords de la cible ronde sont plus sujets au bruit lors de la détection (lorsque l'angle de la caméra s'éloigne de la normale de l'objet, les couleurs se distorsionnent et le vert de l'anneau lumineux s'estompe). L'inconvénient est que la hauteur de pixel de la cible dans l'image est affectée par la distorsion en perspective de l'angle de la caméra. Les correctifs possibles incluent:
tr_tr: LabVIEW örneği, yuvarlak hedefin kenarları algılamada parazite en yatkın olduğu için yüksekliği kullanır (açı kameradan uzaklaştıkça renk daha az yeşil görünür). Bunun dezavantajı, görüntüdeki hedefin piksel yüksekliğinin kamera açısından perspektif bozulmadan etkilenmesidir. Olası düzeltmeler şunları içerir:
zh_cn: LabVIEW的例子使用了高度来确定距离，因为圆形目标的边缘在检测中最容易产生噪声(因为角度点离摄像机越远，颜色看起来越不显绿)。这样做的缺点是，图像中目标的像素高度会受到相机角度的透视失真的影响。可能的方法包括：

source: Try using width instead
es_mx: Intentar usar ancho en su lugar
fr_ca: Essayez d'utiliser plutôt la largeur
tr_tr: Bunun yerine genişliği kullanmayı deneyin
zh_cn: 尝试使用宽度来代替

source: Empirically measure height at various distances and create a lookup table or regression function
es_mx: Medir empíricamente la altura a varias distancias y cree una tabla de búsqueda o función de regresión
fr_ca: Mesurer empiriquement la hauteur à différentes distances et créer une table de correspondance ou une fonction de régression
tr_tr: Yüksekliği çeşitli mesafelerde ampirik olarak ölçün ve bir arama tablosu veya regresyon işlevi oluşturun
zh_cn: 实地测量物体在不同距离时的高度，并创建一个查阅表或回归方程

source: Mount the camera to a servo, center the target vertically in the image and use servo angle for distance calculation (you'll have to work out the proper trig yourself or find a math teacher to help!)
es_mx: Montar la cámara en un servo, centre el objetivo verticalmente en la imagen y use el servo ángulo para el cálculo de la distancia (¡tendrá que calcular usted mismo el trigonometraje adecuado o encontrar un profesor de matemáticas para ayudar!)
fr_ca: Montez la caméra sur un servo-moteur, centrez la cible verticalement dans l'image et utilisez l'angle du servo pour le calcul de la distance (vous devrez déterminer vous-même le calcul trigonométrique approprié ou trouver un professeur de mathématiques pour vous aider!)
tr_tr: Kamerayı bir servoya monte edin, hedefi görüntüde dikey olarak ortalayın ve mesafe hesaplaması için servo açısını kullanın (uygun tetiği kendiniz hesaplamanız veya yardım etmesi için bir matematik öğretmeni bulmanız gerekir!)
zh_cn: 安装相机到一个伺服电机上，使目标在垂直方向上置中，并使用伺服电机的角度计算距离（你将不得不靠自己或者找数学老师帮助解决合适的三角问题！）

source: Correct for the perspective distortion using OpenCV. To do this you will need to `calibrate your camera with OpenCV <https://docs.opencv.org/3.4.6/d4/d94/tutorial_camera_calibration.html>`_. This will result in a distortion matrix and camera matrix. You will take these two matrices and use them with the undistortPoints function to map the points you want to measure for the distance calculation to the "correct" coordinates (this is much less CPU intensive than undistorting the whole image)
es_mx: Corregir la distorsión de perspectiva utilizando OpenCV. Para hacer esto necesitarás calibrar tu cámara con OpenCV <https://docs.opencv.org/3.4.6/d4/d94/tutorial_camera_calibration.html>_. Esto dará como resultado una matriz de distorsión y una matriz de cámara. Usted tomará estas dos matrices y las usará con la función undistortPoints para asignar los puntos que desea medir para el cálculo de la distancia a las coordenadas "correctas" (esto es mucho menos intensivo de CPU que distorsionar toda la imagen)
fr_ca: Corrigez la distorsion de perspective en utilisant OpenCV. Pour ce faire, vous devrez `calibrer votre caméra avec OpenCV <https://docs.opencv.org/3.4.6/d4/d94/tutorial_camera_calibration.html>`_. Il en résultera une matrice de distorsion et une matrice de caméra. Vous prendrez ces deux matrices et les utiliserez avec la fonction undistortPoints pour mapper les points que vous souhaitez mesurer pour le calcul de la distance aux coordonnées "correctes" (cela utilise moions de ressources CPU que de déformer l'image entière)
tr_tr: OpenCV kullanarak perspektif bozulmasını düzeltin. Bunu yapmak için, `calibrate your camera with OpenCV <https://docs.opencv.org/3.4.6/d4/d94/tutorial_camera_calibration.html>`_ ile kalibre etmeniz gerekir. Bu, bir distorsiyon matrisi ve kamera matrisi ile sonuçlanacaktır. Mesafe hesaplaması için ölçmek istediğiniz noktaları "correct-doğru" koordinatlarla eşlemek için bu iki matrisi alacak ve onları undistortPoints fonksiyonu ile kullanacaksınız (bu, tüm görüntünün bozulmasını bozmaktan çok daha az CPU yoğunlukludur)
zh_cn: 使用OpenCV校正透视失真。要做到这一点，你需要用OpenCV<https://docs.opencv.org/3.4.6/d4/d94/tutorial_camera_calibration.html>`来校准你的相机。这将生成一个变形矩阵和相机矩阵。您将使用这两个矩阵和undistortPoints方法来将您想要测量的点映射到“实际的”坐标（这比未失真的整个图像要少很多CPU消耗）
