Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/introduction/cameraserver-class.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Read and Process Video: CameraServer Class
es_mx: Vídeo de Lectura y Procesamiento: Clase de CameraServer
fr_ca: Lire et traiter la vidéo: classe CameraServer
tr_tr: Videoyu Okuyun ve İşleyin: CameraServer Sınıfı
zh_cn: 读取和处理视频：CameraServer类

source: Concepts
es_mx: Conceptos
tr_tr: Kavramlar
zh_cn: 概念

source: The cameras typically used in FRC\ |reg| (commodity USB and Ethernet cameras such as the Axis camera) offer relatively limited modes of operation. In general, they provide only a single image output (typically in an RGB compressed format such as JPG) at a single resolution and frame rate. USB cameras are particularly limited as only one application may access the camera at a time.
es_mx: La cámara usualmente usada en FRC\ |reg| (cámaras de USB Y Ethernet de consumo como el Axis cámara) ofrece modos de operación relativamente limitados. En general, te dan solo una imagen de salida (normalmente en formato comprimido RGB como JPG) en una simple resolución y cuadros por segundo. Las cámaras USB son particularmente limitadas ya que solo una aplicación puede acceder a la cámara a la vez.
fr_ca: Les caméras généralement utilisées en FRC\ |reg| (les caméras USB et Ethernet de base telles que la caméra Axis) offrent des modes de fonctionnement relativement limités. En général, elles ne fournissent qu’une seule sortie d’image (généralement dans un format compressé RGB tel que JPG) à une seule résolution et taux d’image. Les caméras USB sont particulièrement limitées car une seule application peut accéder à la caméra à la fois.
tr_tr: Genellikle FRC \ | reg | içinde kullanılan kameralar (Axis kamera gibi ticari USB ve Ethernet kameraları) nispeten sınırlı çalışma modları sunar. Genel olarak, tek bir çözünürlük ve kare hızında yalnızca tek bir görüntü çıkışı (tipik olarak JPG gibi bir RGB sıkıştırılmış biçimde) sağlarlar. Bir seferde yalnızca bir uygulama kameraya erişebileceğinden, USB kameralar özellikle sınırlıdır.
zh_cn: FRC \ | reg |中通常使用的摄像机（商品USB和以太网摄像机，例如Axis摄像机）提供相对有限的操作模式。通常，它们仅以单个分辨率和帧速率提供单个图像输出（通常以RGB压缩格式，例如JPG）输出。 USB相机受到特别限制，因为一次只能有一个应用程序可以访问相机。

source: CameraServer supports multiple cameras. It handles details such as automatically reconnecting when a camera is disconnected, and also makes images from the camera available to multiple "clients" (e.g. both your robot code and the dashboard can connect to the camera simultaneously).
es_mx: CameraServer soporta múltiples cámaras. Este cuenta con detalles como reconexión automática cuando la cámara se desconecta, también hace imágenes desde la disponibilidad de la cámara hacia múltiples “clientes” ( p.ej. El código del robot y su dashboard pueden conectarse simultáneamente).
fr_ca: CameraServer peut prendre en charge plusieurs caméras. Il gère des détails tels que la reconnexion automatique lorsqu'une caméra est déconnectée momentanément, et met également les images de la caméra à la disposition de plusieurs "clients" (par exemple, votre code de robot et le tableau de bord peuvent lire les images de la caméra même simultanément).
tr_tr: CameraServer birden fazla kamerayı destekler. Bir kameranın bağlantısı kesildiğinde otomatik olarak yeniden bağlanma gibi ayrıntıları yönetir ve ayrıca kameradaki görüntüleri birden çok "clients-istemciye" sunar (örneğin, hem robot kodunuz hem de kontrol paneliniz kameraya aynı anda bağlanabilir).
zh_cn: CameraServer支持多个摄像机。它处理诸如断开摄像机连接时自动重新连接之类的细节，并使来自摄像机的图像可供多个“客户端”使用（例如，您的机器人代码和仪表板都可以同时连接到摄像机）。

source: Camera Names
es_mx: Nombres de Cámaras
fr_ca: Nommer les caméras
tr_tr: Kamera Adları
zh_cn: 相机名称

source: Each camera in CameraServer must be uniquely named. This is also the name that appears for the camera in the Dashboard. Some variants of the CameraServer ``startAutomaticCapture()`` and ``addAxisCamera()`` functions will automatically name the camera (e.g. "USB Camera 0" or "Axis Camera"), or you can give the camera a more descriptive name (e.g. "Intake Cam"). The only requirement is that each camera have a unique name.
es_mx: Cada cámara en CameraServer debe tener un nombre exclusivo. Este es también el nombre que aparece en el Dashboard. Algunas variantes del CameraServer startAutomaticCapture() y addAxisCamera() nombrarán a la cámara automáticamente ( p.ej. “USB Camera 0” o “Axis Camera”), o puede dar un nombre más descriptivo a la cámara ( p.ej. “Intake Camera” ). El único requisito es que la cámara tenga su propio nombre.
fr_ca: Chaque caméra dans CameraServer doit porter un nom unique. C'est également le nom qui apparaît pour la caméra dans le tableau de bord. Certaines variantes des fonctions CameraServer ``startAutomaticCapture()`` et ``addAxisCamera()`` nommeront automatiquement la caméra (par exemple "USB Camera 0" ou "Axis Camera"), ou vous pouvez donner à la caméra un nom plus descriptif (par exemple "Cam d'admission"). La seule exigence est que chaque caméra ait un nom unique.
tr_tr: CameraServer'daki her kamera benzersiz bir şekilde adlandırılmalıdır. Bu aynı zamanda Panodaki kamera için görünen addır. CameraServer'ın `` startAutomaticCapture ()`` ve `` addAxisCamera ()`` işlevlerinin bazı varyantları, kamerayı otomatik olarak adlandırır (örneğin, "USB Kamera 0" veya "Eksen Kamera") veya kameraya daha açıklayıcı bir ad verebilirsiniz (örneğin "Giriş Kamı"). Tek şart, her kameranın benzersiz bir isme sahip olmasıdır.
zh_cn: CameraServer中的每个摄像机都必须唯一命名。这也是在仪表板中为相机显示的名称。 CameraServer的“ startAutomaticCapture（）”和“ addAxisCamera（）”函数的某些变体会自动命名相机（例如“ USB Camera 0”或“ Axis Camera”），或者您可以为相机指定一个更具描述性的名称（例如“进气凸轮”）。唯一的要求是每个摄像机都有一个唯一的名称。

source: USB Camera Notes
es_mx: Notas de Cámara USB
fr_ca: Remarques sur la caméra USB
tr_tr: USB Kamera Notları
zh_cn: USB相机注意事项

source: CPU Usage
es_mx: Uso de CPU
fr_ca: L'utilisation du processeur
tr_tr: CPU kullanımı
zh_cn: CPU使用率

source: The CameraServer is designed to minimize CPU usage by only performing compression and decompression operations when required and automatically disabling streaming when no clients are connected.
es_mx: La CameraServer está diseñada para minimizar el uso de CPU realizando solo comprensión y operaciones de descompresión cuando sea necesario y deshabilitar automáticamente la transmisión cuando no hay clientes conectados.
fr_ca: Le CameraServer est conçu pour minimiser l'utilisation du processeur en effectuant uniquement des opérations de compression et de décompression lorsque cela est nécessaire et en désactivant automatiquement le streaming lorsqu'aucun client n'est connecté.
tr_tr: CameraServer, yalnızca gerektiğinde sıkıştırma ve açma işlemlerini gerçekleştirerek ve hiçbir istemci bağlı değilken akışı otomatik olarak devre dışı bırakarak CPU kullanımını en aza indirecek şekilde tasarlanmıştır.
zh_cn: CameraServer旨在通过仅在需要时执行压缩和解压缩操作，并在未连接任何客户端时自动禁用流传输来最大程度地减少CPU使用率。

source: To minimize CPU usage, the dashboard resolution should be set to the same resolution as the camera; this allows the CameraServer to not decompress and recompress the image, instead, it can simply forward the JPEG image received from the camera directly to the dashboard. It's important to note that changing the resolution on the dashboard does *not* change the camera resolution; changing the camera resolution may be done by calling ``setResolution()`` on the camera object.
es_mx: Para minimizar el uso de CPU, la resolución de las dashboard debe establecerse en la misma resolución que la cámara; esto permite que CameraServer no se descomprima y recomprimir la imagen, en lugar, simplemente puede reenviar la imagen JPEG recibida desde la cámara directamente al dashboard. Es importante notar que cambiando la resolución en el dashboard no hace cambio en la resolución de la cámara; cambiando la resolución de la cámara puede ser hecho llamando setResolution() en el objeto de la cámara.
fr_ca: Pour minimiser l'utilisation du processeur, la résolution du tableau de bord doit être réglée sur la même résolution que la caméra; cela permet au CameraServer de ne pas décompresser et recompresser l'image, au lieu de cela, il peut simplement transmettre l'image JPEG reçue de la caméra directement au tableau de bord. Il est important de noter que la modification de la résolution sur le tableau de bord **ne change pas** la résolution de la caméra; changer la résolution de la caméra peut être fait en appelant ``setResolution()`` sur l'objet caméra.
tr_tr: CPU kullanımını en aza indirmek için, gösterge paneli çözünürlüğü kamera ile aynı çözünürlüğe ayarlanmalıdır; bu, CameraServer'ın görüntüyü açıp yeniden sıkıştırmamasına izin verir; bunun yerine, kameradan alınan JPEG görüntüsünü doğrudan kontrol paneline iletebilir. Kontrol panelindeki çözünürlüğün değiştirilmesinin kamera çözünürlüğünü * değiştirmediğini * unutmamak önemlidir; kamera çözünürlüğünü değiştirmek, kamera nesnesi üzerinde `` setResolution ()`` çağrısı yapılarak yapılabilir.
zh_cn: 为了最大程度地减少CPU使用率，仪表板分辨率应设置为与摄像头相同的分辨率。这使CameraServer无需解压缩和重新压缩图像，而是可以简单地将从照相机接收的JPEG图像直接转发到仪表板。请务必注意，更改仪表板上的分辨率不会更改相机分辨率；可以通过在相机对象上调用setResolution（）来更改相机分辨率。

source: USB Bandwidth
es_mx: Ancho de Banda de USB
fr_ca: Bande passante USB
tr_tr: USB Bant Genişliği
zh_cn: USB带宽

source: The roboRIO can only transmit and receive so much data at a time over its USB interfaces. Camera images can require a lot of data, and so it is relatively easy to run into this limit. The most common cause of a USB bandwidth error is selecting a non-JPEG video mode or running too high of a resolution, particularly when multiple cameras are connected.
es_mx: La RoboRIO solo puede transmitir y recibir cierta información al mismo tiempo sobre las interfaces de la USB. Las imágenes de la cámara requiere mucha información, y en sí es relativamente fácil reproducir las imágenes en estos límites. El error más común en el ancho de banda de USB es seleccionar un modo de video non-JPEG o corriendo una resolución muy alta, particularmente cuando múltiples cámaras están conectadas.
fr_ca: Le roboRIO ne peut transmettre et recevoir autant de données à la fois via ses interfaces USB. Les images de la caméra peuvent nécessiter beaucoup de données, et il est donc relativement facile de dépasser cette limite. La cause plus fréquente d'une erreur de bande passante USB est le choix d'un mode vidéo non JPEG ou une résolution trop élevée, en particulier lorsque plusieurs caméras sont connectées.
tr_tr: RoboRIO, USB arayüzleri üzerinden bir seferde yalnızca bu kadar çok veriyi iletebilir ve alabilir. Kamera görüntüleri çok fazla veri gerektirebilir ve bu nedenle bu sınıra uymak nispeten kolaydır. Bir USB bant genişliği hatasının en yaygın nedeni, JPEG olmayan bir video modu seçmek veya özellikle birden fazla kamera bağlıyken çok yüksek bir çözünürlük çalıştırmaktır.
zh_cn: roboRIO一次只能通过其USB接口发送和接收大量数据。相机图像可能需要大量数据，因此相对容易遇到此限制。 USB带宽错误的最常见原因是选择非JPEG视频模式或分辨率过高，尤其是在连接多台摄像机时。

source: Architecture
es_mx: Arquitectura
tr_tr: Mimari
zh_cn: 体系结构

source: The CameraServer consists of two layers, the high level WPILib **CameraServer class** and the low level **cscore library**.
es_mx: La CameraServer consiste en dos capas, el nivel alto WPILib CameraServer clase y el nivel bajo librería cscore.
fr_ca: Le CameraServer se compose de deux couches, la classe haut-niveau WPILib **CameraServer class** et la librairie de bas-niveau **cscore library**.
tr_tr: CameraServer iki katmandan oluşur; yüksek düzeyli WPILib **CameraServer class** ve düşük düzey **cscore library**.
zh_cn: CameraServer由两层组成，高层WPILib ** CameraServer类**和底层** cscore库**。

source: CameraServer Class
es_mx: Clase de CameraServer
fr_ca: Classe CameraServer
tr_tr: CameraServer Sınıfı
zh_cn: CameraServer类

source: The CameraServer class (part of WPILib) provides a high level interface for adding cameras to your robot code. It also is responsible for publishing information about the cameras and camera servers to NetworkTables so that Driver Station dashboards such as the LabVIEW Dashboard and Shuffleboard can list the cameras and determine where their streams are located. It uses a singleton pattern to maintain a database of all created cameras and servers.
es_mx: La clase de CameraServer ( parte de WPILib ) provisiona un alto nivel de interface para añadir cámaras al código del robot. También es responsable por publicar información sobre las cámaras y los servidores de cámaras a las NetworkTables para que las dashboards de la Driver Station como la LabVIEW, Dashboard y Shuffleboard pueden enlistar las cámaras y determinar dónde está localizada la transmisión de estas. Esto usa un patrón único para mantener una base de datos de todos los servidores y cámaras creadas.
fr_ca: La classe CameraServer (qui fait partie de WPILib) fournit une interface de haut niveau pour ajouter des caméras à votre code de robot. Elle est également responsable de la publication d'informations sur les caméras et les serveurs de caméras sur NetworkTables afin que les tableaux de bord de Driver Station tels que LabVIEW Dashboard et Shuffleboard puissent répertorier les caméras et déterminer l'emplacement de leurs flux. La classe utilise un modèle de type "singleton" (possédant un seul objet à la fois) pour maintenir une base de données de toutes les caméras et tous les serveurs créés.
tr_tr: CameraServer sınıfı (WPILib'in bir parçası), robot kodunuza kamera eklemek için yüksek düzeyde bir arayüz sağlar. Ayrıca, LabVIEW Dashboard ve Shuffleboard gibi Driver Station panolarının kameraları listeleyebilmesi ve akışlarının nerede konumlandığını belirleyebilmesi için, kameralar ve kamera sunucuları hakkındaki bilgileri NetworkTables'da yayınlamaktan sorumludur. Oluşturulan tüm kameraların ve sunucuların bir veritabanını korumak için tek bir model kullanır.
zh_cn: CameraServer类（WPILib的一部分）提供了一个高级接口，用于将摄像机添加到您的机器人代码中。它还负责将有关摄像机和摄像机服务器的信息发布到NetworkTables，以便LabVIEW Dashboard和Shuffleboard等Driver Station仪表板可以列出摄像机并确定其流的位置。它使用单例模式来维护所有创建的摄像机和服务器的数据库。

source: Some key functions in CameraServer are:
es_mx: Algunas funciones clave en la CameraServer son:
fr_ca: Certaines fonctions importantes de CameraServer:
tr_tr: CameraServer'daki bazı temel işlevler şunlardır:
zh_cn: CameraServer中的一些关键功能包括：

source: ``startAutomaticCapture()``: Add a USB camera (e.g. Microsoft LifeCam) and starts a server for it so it can be viewed from the dashboard.
es_mx: startAutomaticCapture(): Agregue una cámara USB ( p.ej. Microsoft LifeCam ) e inicie un servidor para que pueda verse desde el dashboard.
fr_ca: ``startAutomaticCapture()``: ajoute une caméra USB (par exemple Microsoft LifeCam) et lance un serveur pour qu'elle puisse être visualisée à partir du tableau de bord.
tr_tr: ``startAutomaticCapture ()`` : Bir USB kamera ekleyin (örn.Microsoft LifeCam) ve panodan görüntülenebilmesi için onun için bir sunucu başlatır.
zh_cn: ``startAutomaticCapture（）``：添加一个USB摄像头（例如Microsoft LifeCam）并为其启动服务器，以便可以从仪表板上对其进行查看。

source: ``addAxisCamera()``: Add an Axis camera. Even if you aren't processing images from the Axis camera in your robot code, you may want to use this function so that the Axis camera appears in the Dashboard's drop down list of cameras. It also starts a server so the Axis stream can still be viewed when your driver station is connected to the roboRIO via USB (useful at competition if you have both the Axis camera and roboRIO connected to the two robot radio Ethernet ports).
es_mx: addAxisCamera(): Agregue una cámara Axis. Aún cuando no esté procesando imágenes desde la cámara Axis al código del robot, usted querrá usar esta función para que aparezca la cámara Axis en la lista desplegable de cámaras del Dashboard. También inicia un servidor así que la transmisión de Axis pueda seguir siendo vista cuando el driver station está conectada a la RoboRIO via USB (es útil que en una competencia si tiene conectado la RoboRIO y una Cámara Axis a los dos puertos Ethernet del robot)
fr_ca: ``addAxisCamera()``: Ajoute une caméra Axis. Même si vous ne traitez pas les images de la caméra Axis dans votre code de robot, vous pouvez utiliser cette fonction pour que la caméra Axis apparaisse dans la liste déroulante des caméras du tableau de bord. Ceci démarre également un serveur afin que le flux Axis puisse toujours être affiché lorsque votre poste de pilotage est connecté au roboRIO via USB (utile en compétition si vous avez à la fois la caméra Axis et le roboRIO connectés aux deux ports Ethernet radio du robot).
tr_tr: ``addAxisCamera ()`` : Bir Axis kamerası ekleyin. Axis kamerasından görüntüleri robot kodunuzda işlemiyor olsanız bile, Axis kamerasının Dashboard'un açılır kamera listesinde görünmesi için bu işlevi kullanmak isteyebilirsiniz. Ayrıca bir sunucu başlatır, böylece sürücü istasyonunuz roboRIO'ya USB aracılığıyla bağlandığında Axis akışı hala görüntülenebilir (iki robot radyo Ethernet portuna hem Axis kamera hem de roboRIO bağlıysa rekabette yararlıdır).
zh_cn: ``addAxisCamera（）``：添加一个Axis相机。即使您没有在机器人代码中处理Axis相机的图像，也可能要使用此功能，以便Axis相机出现在“仪表板”的相机下拉列表中。它还会启动服务器，以便当驱动程序站通过USB连接到roboRIO时仍可以查看Axis流（如果将Axis摄像机和roboRIO都连接到两个机器人无线电以太网端口，则在竞争中很有用）。

source: ``getVideo()``: Get OpenCV access to a camera. This allows you to get images from the camera for image processing on the roboRIO (in your robot code).
es_mx: getVideo(): Obtenga acceso a OpenCV a la cámara. Esto le permite obtener las imágenes desde la cámara para el procesamiento de la imagen en la RoboRIO (en el código del robot).
fr_ca: ``getVideo()``: Obtenez l'accès OpenCV à une caméra. Cela vous permet d'obtenir des images de la caméra pour le traitement d'images sur le roboRIO (dans votre code de robot).
tr_tr: ``getVideo ()``: Bir kameraya OpenCV erişimi sağlayın. Bu, roboRIO'da (robot kodunuzda) görüntü işleme için kameradan görüntüler almanızı sağlar.
zh_cn: ``getVideo（）``：获取对摄像机的OpenCV访问。这使您可以从相机获取图像以在roboRIO上进行图像处理（在您的机器人代码中）。

source: ``putVideo()``: Start a server that you can feed OpenCV images to. This allows you to pass custom processed and/or annotated images to the dashboard.
es_mx: putVideo(): Inicie un servidor al que pueda alimentar imágenes de OpenCV. Esto le permite pasar imágenes personalizadas procesadas y/o anotadas en el dashboard.
fr_ca: ``putVideo()``: démarrez un serveur sur lequel vous pouvez fournir des OpenCV à ce serveur. Cela vous permet de passer des images traitées et/ou annotées personnalisées au tableau de bord.
tr_tr: ``putVideo ()``: OpenCV görüntülerini besleyebileceğiniz bir sunucu başlatın. Bu, özel işlenmiş ve / veya açıklamalı görüntüleri kontrol paneline iletmenize olanak tanır.
zh_cn: ``putVideo（）``：启动一个服务器，您可以向其中提供OpenCV图像。这使您可以将自定义处理和/或带注释的图像传递到仪表板。

source: cscore Library
es_mx: Librería cscore
fr_ca: Librairie cscore
tr_tr: cscore Kütüphanesi
zh_cn: cscore库

source: The cscore library provides the lower level implementation to:
es_mx: La librería cscore provisiona el menor nivel de implementación para:
fr_ca: La librairie cscore fournit l'implémentation de niveau bas pour:
tr_tr: Cscore kütüphanesi, aşağıdakilere daha düşük düzeyde uygulama sağlar:
zh_cn: cscore库提供了较低级别的实现：

source: Get images from USB and HTTP (e.g. Axis) cameras
es_mx: Obtener imágenes desde las cámaras USB y HTTP ( p.ej. Axis )
fr_ca: Obtenir des images de caméras USB et HTTP (par exemple Axis)
tr_tr: USB ve HTTP (örneğin Axis) kameralardan görüntüler alın
zh_cn: 从USB和HTTP（例如Axis）相机获取图像

source: Change camera settings (e.g. contrast and brightness)
es_mx: Cambiar la configuración de la cámara ( p.ej. contraste y brillo )
fr_ca: Modifier les paramètres de l'appareil photo (par exemple le contraste et la luminosité)
tr_tr: Kamera ayarlarını değiştirin (ör. Kontrast ve parlaklık)
zh_cn: 更改相机设置（例如对比度和亮度）

source: Change camera video modes (pixel format, resolution and frame rate)
es_mx: Cambiar los modos de vídeo de la cámara (formato del pixel, resolución y cuadros por segundo)
fr_ca: Changer les modes vidéo de la caméra (format pixel, résolution et fréquence d'images)
tr_tr: Kamera video modlarını değiştirin (piksel formatı, çözünürlük ve kare hızı)
zh_cn: 更改相机视频模式（像素格式，分辨率和帧频）

source: Act as a web server and serve images as a standard MJPEG stream
es_mx: Actuar como un servidor web y servir imágenes como una transmisión MJPEG estándar
fr_ca: Agir en tant que serveur Web et fournir des images en tant que flux MJPEG standard
tr_tr: Bir web sunucusu olarak hareket edin ve görüntüleri standart bir MJPEG akışı olarak sunun
zh_cn: 充当Web服务器并将图像作为标准MJPEG流提供

source: Convert images to/from OpenCV ``Mat`` objects for image processing
es_mx: Convertir imágenes a/desde objetos Mat OpenCV para el procesamiento de la imagen
fr_ca: Convertir des images vers/depuis des objets ``Mat`` OpenCV pour le traitement d'images
tr_tr: Görüntü işleme için görüntüleri OpenCV ``Mat`` nesnelere / nesnelere dönüştürün
zh_cn: 将图像与OpenCV``Mat''对象之间来回转换以进行图像处理

source: Sources and Sinks
es_mx: Fuentes y Receptores
fr_ca: Sources et Récepteurs
tr_tr: Kaynaklar ve Havuzlar
zh_cn: 来源和接收

source: The basic architecture of the cscore library is similar to that of MJPGStreamer, with functionality split between sources and sinks. There can be multiple sources and multiple sinks created and operating simultaneously.
es_mx: La arquitectura básica de la Librería cscore a la de MJPGStreamer, con funcionalidad dividida entre fuentes y receptores. Puede haber múltiples fuentes y múltiples receptores creado y operando simultáneamente.
fr_ca: L'architecture de base de la bibliothèque cscore est similaire à celle de MJPGStreamer, avec des fonctionnalités réparties entre les sources et les récepteurs. Il peut y avoir plusieurs Sources et plusieurs Récepteurs créés et fonctionnant simultanément.
tr_tr: Cscore kütüphanesinin temel mimarisi, işlevsellik kaynaklar ve havuzlar arasında bölünmüş olarak MJPGStreamer ile benzerdir. Aynı anda oluşturulan ve çalışan birden çok kaynak ve birden çok havuz olabilir.
zh_cn: cscore库的基本体系结构与MJPGStreamer相似，功能在源和接收器之间分配。可以创建多个源并同时创建多个接收器。
