Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/introduction/cameraserver-class.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: An object that generates images is a source and an object that accepts/consumes images is a sink. The generate/consume is from the perspective of the library. Thus cameras are sources (they generate images). The MJPEG web server is a sink because it accepts images from within the program (even though it may be forwarding those images on to a web browser or dashboard). Sources may be connected to multiple sinks, but sinks can be connected to one and only one source. When a sink is connected to a source, the cscore library takes care of passing each image from the source to the sink.
es_mx: Un objeto que genera imágenes es una fuente y un objeto que acepta / consume imágenes es un receptor. El generar / consumir es desde la perspectiva de la biblioteca. Por lo tanto, las cámaras son fuentes (generan imágenes). El servidor web MJPEG es un receptor porque acepta imágenes de dentro del programa (aunque puede reenviar esas imágenes a un navegador web o dashboard). Las fuentes pueden estar conectadas a múltiples receptores, pero los receptores pueden conectarse a uno y solo una fuente. Cuando un receptor se conecta a una fuente, la biblioteca cscore se encarga de pasar cada imagen desde la fuente al sumidero.
fr_ca: Un objet qui génère des images est une Source et un objet qui accepte/consomme des images est un Récepteur. La génération/consommation est du point de vue de la librairie. Les caméras sont donc des Sources (elles génèrent des images). Le serveur Web MJPEG est un Récepteur, car il accepte des images à partir du programme (même s'il peut transférer ces images vers un navigateur Web ou un tableau de bord). Les Sources peuvent être connectées à plusieurs Récepteurs, mais les Récepteurs peuvent être connectés à une seule et unique Source. Lorsqu'un Récepteur est connecté à une Source, la librairie cscore se charge de transmettre chaque image de la Source au Récepteur.
tr_tr: Görüntü üreten bir nesne bir kaynaktır ve görüntüleri kabul eden / tüketen bir nesne bir havuzdur. Üretme / tüketme, kütüphane perspektifindedir. Dolayısıyla kameralar birer kaynaktır (görüntü üretirler). MJPEG web sunucusu, programın içinden görüntüleri kabul ettiği için bir havuzdur (bu görüntüleri bir web tarayıcısına veya kontrol paneline iletiyor olsa bile). Kaynaklar birden fazla havuza bağlanabilir, ancak havuzlar bir ve yalnızca bir kaynağa bağlanabilir. Bir havuz bir kaynağa bağlandığında, cscore kitaplığı her bir görüntüyü kaynaktan havuza aktarmaya özen gösterir.
zh_cn: 生成图像的对象是源，接受/使用图像的对象是接收器。生成/使用是从库的角度进行的。因此，相机是来源（它们生成图像）。 MJPEG Web服务器是一个接收器，因为它接受程序中的图像（即使它可能会将这些图像转发到Web浏览器或仪表板上）。源可以连接到多个接收器，但是接收器可以连接到一个且仅一个源。当接收器连接到源时，cscore库会负责将每个映像从源传递到接收器。

source: **Sources** obtain individual frames (such as provided by a USB camera) and fire an event when a new frame is available. If no sinks are listening to a particular source, the library may pause or disconnect from a source to save processor and I/O resources. The library autonomously handles camera disconnects/reconnects by simply pausing and resuming firing of events (e.g. a disconnect results in no new frames, not an error).
es_mx: Las fuentes obtienen marcos individuales (como los proporcionados por una cámara USB) y disparan un evento cuando hay un nuevo marco disponible. Si ningún receptor está escuchando una fuente en particular, la biblioteca puede pausar o desconectarse de una fuente para ahorrar procesadores y recursos de I / O. La biblioteca maneja de forma autónoma las desconexiones y reconexiones de la cámara simplemente pausando y reanudando la activación de eventos (por ejemplo, una desconexión no genera nuevos marcos, no hay un error).
fr_ca: **Les Sources** obtiennent des images individuelles (comme celles fournies par une caméra USB) et déclenchent un événement lorsqu'une nouvelle image est disponible. Si aucun Récepteur n'écoute une Source particulière, la librairie peut s'arrêter ou se déconnecter d'une Source pour économiser le processeur et les ressources d'Entrées/Sorties. La librairie gère de manière autonome les déconnexions/reconnexions de la caméra en interrompant simplement et en reprenant le déclenchement des événements (par exemple, une déconnexion arrête l'envoie de nouvelles trames, mais ne génère pas d'erreur).
tr_tr: ** Kaynaklar **, ayrı kareleri (bir USB kamera tarafından sağlananlar gibi) alır ve yeni bir çerçeve mevcut olduğunda bir olayı tetikler. Belli bir kaynağı dinleyen havuzlar yoksa, işlemci ve G / Ç kaynaklarını kaydetmek için kitaplık duraklayabilir veya bir kaynaktan bağlantıyı kesebilir. Kütüphane, yalnızca olayların tetiklenmesini duraklatıp yeniden başlatarak kamera bağlantı kesmelerini / yeniden bağlantılarını özerk bir şekilde yönetir (örneğin, bir bağlantı kesilmesi yeni çerçevelerin olmaması, bir hata olmamasıyla sonuçlanır).
zh_cn: **来源**获取单独的帧（例如USB摄像头提供的帧），并在有新帧可用时触发事件。如果没有接收器正在监听特定的源，则该库可能会暂停或与源断开连接，以节省处理器和I / O资源。该库可通过简单地暂停和恢复事件的触发来自动处理摄像机的断开/重新连接（例如，断开连接不会导致出现新的帧，不会出现错误）。

source: **Sinks** listen to a particular source's event, grab the latest image, and forward it to its destination in the appropriate format. Similarly to sources, if a particular sink is inactive (e.g. no client is connected to a configured MJPEG over HTTP server), the library may disable parts of its processing to save processor resources.
es_mx: Los receptores escuchan el evento de una fuente en particular, toman la última imagen y la reenvían a su destino en el formato apropiado. De manera similar a las fuentes, si un receptor particular está inactivo (por ejemplo, ningún cliente está conectado a un servidor MJPEG configurado a través de HTTP), la biblioteca puede deshabilitar partes de su procesamiento para ahorrar recursos del procesador.
fr_ca: **Les Récepteurs** écoutent l'événement d'une Source particulière, récupérent la dernière image et la transfère à sa destination dans le format approprié. De même que pour les Sources, si un Récepteur particulier est inactif (par exemple, aucun client n'est connecté à un serveur MJPEG configuré sur HTTP), la librairie peut désactiver des parties de son traitement pour économiser les ressources du processeur.
tr_tr: **Sinks-Havuzlar ** belirli bir kaynağın etkinliğini dinler, en son görüntüyü alır ve uygun formatta hedefine iletir. Kaynaklara benzer şekilde, belirli bir havuz etkin değilse (örneğin, HTTP sunucusu üzerinden yapılandırılmış bir MJPEG'e hiçbir istemci bağlı değilse), kitaplık, işlemci kaynaklarını korumak için işlemenin bazı kısımlarını devre dışı bırakabilir.
zh_cn: 接收者监听特定来源的事件，获取最新图像，并以适当的格式将其转发到目的地。与源相似，如果特定接收器处于非活动状态（例如，没有客户端通过HTTP服务器连接到已配置的MJPEG），则该库可能会禁用其部分处理以节省处理器资源。

source: User code (such as that used in a FRC robot program) can act as either a source (providing processed frames as if it were a camera) or as a sink (receiving a frame for processing) via OpenCV source and sink objects. Thus an image processing pipeline that gets images from a camera and serves the processed images out looks like the below graph:
es_mx: El código de usuario (como el utilizado en un programa de robot FRC) puede actuar como fuente (proporcionando cuadros procesados ​​como si fuera una cámara) o como un receptor (que recibe un cuadro para su procesamiento) a través de la fuente de OpenCV y recibir objetos. Por lo tanto, una tubería de procesamiento de imágenes que obtiene imágenes de una cámara y sirve las imágenes procesadas se ve como el siguiente gráfico:
fr_ca: Le code utilisateur (tel que celui utilisé dans un programme de robot FRC) peut agir soit comme Source (fournissant des images traitées comme s'il s'agissait d'une caméra), soit comme Récepteur (recevant une image pour traitement) via les objets Source et Récepteur OpenCV. Ainsi, un pipeline de traitement d'image qui récupère les images d'une caméra et sert les images traitées ressemble au graphique ci-dessous:
tr_tr: Kullanıcı kodu (bir FRC robot programında kullanılanlar gibi), OpenCV kaynağı ve havuz nesneleri aracılığıyla bir kaynak (bir kamera gibi işlenmiş çerçeveler sağlar) veya bir havuz (işlenmek üzere bir çerçeve alır) olarak işlev görebilir. Bu nedenle, bir kameradan görüntüleri alan ve işlenmiş görüntüleri sunan bir görüntü işleme hattı aşağıdaki grafiğe benzer:
zh_cn: 用户代码（例如FRC机器人程序中使用的代码）可以通过OpenCV源对象和接收器对象充当源（提供处理过的帧，就好像它是照相机一样），也可以充当接收器（接收要处理的帧）。因此，从相机获取图像并将处理后的图像输出的图像处理线程如下图所示：

source: Because sources can have multiple sinks connected, the pipeline may branch. For example, the original camera image can also be served by connecting the UsbCamera source to a second MjpegServer sink in addition to the CvSink, resulting in the below graph:
es_mx: Debido a que las fuentes pueden tener múltiples receptores conectados, la tubería puede ramificarse. Por ejemplo, la imagen de la cámara original también se puede servir conectando la fuente USBCamera a un segundo receptor MjpegServer además del CvSink, lo que da como resultado el siguiente gráfico:
fr_ca: Étant donné que les Sources peuvent avoir plusieurs Récepteurs connectés, le pipeline peut se ramifier. Par exemple, l'image d'origine de la caméra peut également être servie en connectant la Source UsbCamera à un deuxième Récepteur MjpegServer en plus du récepteur CvSink, ce qui donne le graphique ci-dessous:
tr_tr: Kaynakların bağlı birden fazla havuzu olabileceğinden, boru hattı dallara ayrılabilir. Örneğin, orijinal kamera görüntüsü, UsbCamera kaynağını CvSink'e ek olarak ikinci bir MjpegServer havuzuna bağlayarak da sunulabilir, bu da aşağıdaki grafikle sonuçlanır:
zh_cn: 因为源可以连接多个接收器，所以线程可以分支。例如，还可以通过将UsbCamera源连接到CvSink之外的第二个MjpegServer接收器来提供原始摄像机图像，如下图所示：

source: When a new image is captured by the camera, both the CvSink and the MjpegServer [1] receive it.
es_mx: Cuando la cámara captura una nueva imagen, tanto el CvSink como el MjpegServer [1] la reciben.
fr_ca: Lorsqu'une nouvelle image est capturée par la caméra, le CvSink et le MjpegServer [1] la reçoivent.
tr_tr: Kamera tarafından yeni bir görüntü yakalandığında, hem CvSink hem de MjpegServer [1] onu alır.
zh_cn: 当摄像机捕获到新图像时，CvSink和MjpegServer [1]都会接收到它。

source: The above graph is what the following CameraServer snippet creates:
es_mx: El gráfico anterior es lo que crea el siguiente fragmento de CameraServer:
fr_ca: Le graphique ci-dessus est crée par le bout de code CameraServer ci-dessous:
tr_tr: Yukarıdaki grafik, aşağıdaki CameraServer snippet'inin oluşturduğu şeydir:
zh_cn: 上图是以下CameraServer片段创建的：

source: The CameraServer implementation effectively does the following at the cscore level (for explanation purposes). CameraServer takes care of many of the details such as creating unique names for all cscore objects and automatically selecting port numbers. CameraServer also keeps a singleton registry of created objects so they aren't destroyed if they go out of scope.
es_mx: La implementación de CameraServer efectivamente hace lo siguiente en el nivel del cscore (con fines explicativos). El CameraServer se encarga de muchos de los detalles, como la creación de nombres únicos para todos los objetos cscore y seleccionando automáticamente los números de puerto. CameraServer también mantiene un registro único de los objetos creados para que no se destruyan si salen del alcance.
fr_ca: L'implémentation de CameraServer effectue les opérations suivantes au niveau cscore: CameraServer prend en charge de nombreux détails tels que la création de noms uniques pour tous les objets cscore et la sélection automatique des numéros de port. CameraServer conserve également un registre de type "singleton" des objets créés afin qu'ils ne soient pas détruits s'ils sortent de leur cadre, ou champ.
tr_tr: CameraServer uygulaması, aşağıdakileri cscore düzeyinde etkin bir şekilde yapar (açıklama amacıyla). CameraServer, tüm cscore nesneleri için benzersiz adlar oluşturma ve bağlantı noktası numaralarını otomatik olarak seçme gibi birçok ayrıntıyla ilgilenir. CameraServer ayrıca, kapsam dışına çıktıklarında imha edilmemeleri için oluşturulan nesnelerin tek bir kaydını tutar.
zh_cn: CameraServer实现在cscore级别上有效地执行了以下操作（出于解释目的）。 CameraServer处理许多细节，例如为所有cscore对象创建唯一名称以及自动选择端口号。 CameraServer还会保留已创建对象的单例注册表，因此如果它们超出范围，它们不会被破坏。

source: Reference Counting
es_mx: Recuento de Referencias
fr_ca: Comptage de références
tr_tr: Referans Sayma
zh_cn: 参考计数

source: All cscore objects are internally reference counted. Connecting a sink to a source increments the source's reference count, so it's only strictly necessary to keep the sink in scope. The CameraServer class keeps a registry of all objects created with CameraServer functions, so sources and sinks created in that way effectively never go out of scope (unless explicitly removed).
es_mx: Todos los objetos cscore se cuentan internamente como referencia. La conexión de un receptor a una fuente aumenta el recuento de referencias de la fuente, por lo que solo es estrictamente necesario mantener el receptor dentro del alcance. La clase CameraServer mantiene un registro de todos los objetos creados con las funciones de CameraServer, por lo que las fuentes y los receptores creados de esa manera nunca salen del alcance (a menos que explícitamente se remueva).
fr_ca: Tous les objets cscore sont comptés en interne. La connexion d'un Récepteur à une Source augmente le compte de références de la Source, il est donc strictement nécessaire de garder le Récepteur dans sa portée. La classe CameraServer conserve un registre de tous les objets créés avec les fonctions CameraServer, de sorte que les Sources et les Récepteurs créés de cette manière ne sortent jamais de leur portée (sauf s'ils sont explicitement supprimés).
tr_tr: Tüm cscore nesneleri dahili olarak referans olarak sayılır. Bir havuzun bir kaynağa bağlanması, kaynağın referans sayısını artırır, bu nedenle yalnızca havuzun kapsamda tutulması kesinlikle gereklidir. CameraServer sınıfı, CameraServer işlevleriyle oluşturulan tüm nesnelerin kaydını tutar, bu nedenle bu şekilde oluşturulan kaynaklar ve havuzlar hiçbir zaman kapsam dışına çıkmaz (açıkça kaldırılmadıkça).
zh_cn: 所有cscore对象都在内部进行引用计数。将接收器连接到源会增加源的引用计数，因此仅严格要将接收器保持在范围内。 CameraServer类保留使用CameraServer函数创建的所有对象的注册表，因此，以这种方式创建的源和接收器永远不会超出范围（除非显式删除）。

source: Block diagram showing that a program can either sink or source from OpenCV.
fr_ca: Schéma-bloc montrant qu’un programme peut soit recevoir, soit s’approvisionner à partir d’OpenCV.

source: Block diagram of multiple sinks.
fr_ca: Schéma-bloc de plusieurs récepteurs.
