Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/introduction/identifying-and-processing-the-targets.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Identifying and Processing the Targets
es_mx: Identificando y procesando los objetivos
fr_ca: Identification et traitement des cibles
tr_tr: Hedeflerin Belirlenmesi ve İşlenmesi
zh_cn: 识别和处理目标

source: Once an image is captured, the next step is to identify Vision Target(s) in the image. This document will walk through one approach to identifying the 2016 targets. Note that the images used in this section were taken with the camera intentionally set to underexpose the images, producing very dark images with the exception of the lit targets, see the section on Camera Settings for details.
es_mx: Una vez que se captura una imagen, el siguiente paso es identificar el/los objetivo(s) de la visión en la imagen. Este documento se ocupará de un enfoque para la identificación de los objetivos de 2016. Obsérvese que las imágenes utilizadas en esta sección fueron tomadas con la cámara intencionalmente configurada para subexponer las imágenes, produciendo imágenes muy oscuras con la excepción de los objetivos iluminados, ver la sección de ajustes de la cámara para más detalles.
fr_ca: Une fois qu'une image est capturée, l'étape suivante consiste à identifier les cibles de vision dans l'image. Ce document présentera une approche pour identifier les cibles de la saison 2016. Notez que les images utilisées dans cette section ont été prises avec la caméra intentionnellement réglée pour sous-exposer les images, produisant des images très sombres à l'exception des cibles éclairées, voir la section sur les paramètres de caméra pour plus de détails.
tr_tr: Bir görüntü yakalandıktan sonraki adım, görüntüdeki Vision Target(s)-Görme Hedeflerini belirlemektir. Bu belge, 2016 hedeflerini belirlemek için tek bir yaklaşımdan geçecektir. Bu bölümde kullanılan görüntülerin kamera ile kasıtlı olarak düşük pozlama ayarlı olarak çekildiğini ve yanan hedefler haricinde çok karanlık görüntüler oluşturduğunu unutmayın, ayrıntılar için Kamera Ayarları bölümüne bakın.
zh_cn: 捕获图像后，下一步就是识别图像中的视觉目标。本文档将通过一种方法来确定2016年赛季的视觉目标。请注意，本节中使用的图像是在相机刻意将其设置为曝光不足的情况下拍摄的，经过如此配置，除了被照亮的目标外，还会产生非常暗的图像，有关详细信息，请参见“相机设置”部分。

source: Additional Options
es_mx: Opciones adicionales
fr_ca: Options additionelles
tr_tr: Ekstra seçenekler
zh_cn: 其他选项

source: This document walks through the approach used by the example code provided in LabVIEW (for PC or roboRIO), C++ and Java. In addition to these options teams should be aware of the following alternatives that allow for vision processing on the Driver Station PC or an on-board PC:
es_mx: Este documento recorre el enfoque utilizado por el código de ejemplo proporcionado en LabVIEW (para PC o roboRIO), C++ y Java. Además de estas opciones los equipos deben ser conscientes de seguir las alternativas que permiten el procesamiento de la visión en el PC del puesto de conducción o en un PC:
fr_ca: Ce document présente l'approche utilisée dans l'exemple de code fourni dans LabVIEW (pour PC ou roboRIO), C++ et Java. En plus de ces options, les équipes doivent connaître les alternatives suivantes qui permettent le traitement de la vision sur l'ordinateur Driver Station ou sur un ordinateur embarqué:
tr_tr: Bu belge, LabVIEW (PC veya roboRIO için), C ++ ve Java'da sağlanan örnek kod tarafından kullanılan yaklaşımı açıklamaktadır. Ekipler, bu seçeneklere ek olarak, Driver Station PC veya yerleşik bir PC üzerinde görüntü işlemeye izin veren aşağıdaki alternatiflerin farkında olmalıdır:
zh_cn: 本文档介绍了LabVIEW（其适用于PC或roboRIO），C ++和Java中提供的示例代码所使用的方法。除这些选项外，团队还应注意以下替代方法，他们也能允许在Driver Station PC或车载PC上进行视觉处理：

source: SmartDashboard Camera Extension (programmed in Java, works with any robot language)
es_mx: Extensión de la cámara del SmartDashboard (programada en Java, funciona con cualquier lenguaje de robots)
fr_ca: Extension de caméra SmartDashboard (programmée en Java, fonctionne avec n'importe autre langage de programmation)
tr_tr: SmartDashboard Kamera Uzantısı (Java'da programlanmıştır, herhangi bir robot diliyle çalışır)
zh_cn: SmartDashboard Camera Extension（Java编译，可与任何机器人语言一起使用）

source: Original Image
es_mx: Imagen original
fr_ca: Image d'origine
tr_tr: Gerçek görüntü
zh_cn: 原始图片

source: The image shown below is the starting image for the example described here. The image was taken using the green ring light available in *FIRST*\ |reg| Choice combined with an additional ring light of a different size. Additional sample images are provided with the vision code examples.
es_mx: La imagen que se muestra a continuación es la imagen inicial del ejemplo descrito aquí. La imagen era tomada usando la luz verde del anillo disponible en *FIRST®*\ Choice combinada con un anillo adicional de luz de un tamaño diferente. Se proporcionan imágenes de muestra adicionales con los ejemplos de código de visión.
fr_ca: L'image ci-dessous est l'image de départ pour notre exemple. L'image a été prise à l'aide de l'anneau lumineux vert disponible dans *FIRST*\ |reg| Choice, combiné avec un anneau supplémentaire d'une taille différente. Des exemples d'images sont fournis avec les exemples de code de vision.
tr_tr: Aşağıda gösterilen görüntü, burada açıklanan örnek için başlangıç görüntüsüdür. Görüntü, *FIRST*\ |reg| konumunda bulunan yeşil halka ışığı kullanılarak alınmıştır Seçim, farklı boyutta ek bir halka ışıkla birleştirildi. Görüntü kodu örnekleriyle birlikte ek örnek görüntüler sağlanır.
zh_cn: 下图是本示例将要使用的起始图像。其使用了* FIRST * \ | reg |中可找到的的绿色环形灯拍摄。其可选配不同尺寸的附加环形灯。视觉代码示例提供了其他示例图像。

source: Sample image using a green ring light showing the retroreflective tape.
fr_ca: Échantillon d'une image obtenue à l’aide d’un anneau lumineux vert montrant le ruban rétroréfléchissant.

source: What is HSL/HSV?
es_mx: ¿Qué es HSL/HSV?
fr_ca: Qu'est-ce que HSL/HSV?
tr_tr: HSL / HSV nedir?
zh_cn: 什么是HSL / HSV？

source: The Hue or tone of the color is commonly seen on the artist’s color wheel and contains the colors of the rainbow Red, Orange, Yellow, Green, Blue, Indigo, and Violet. The hue is specified using a radial angle on the wheel, but in imaging the circle typically contains only 256 units, starting with red at zero, cycling through the rainbow, and wrapping back to red at the upper end. Saturation of a color specifies amount of color, or the ratio of the hue color to a shade of gray. Higher ratio means more colorful, less gray. Zero saturation has no hue and is completely gray. Luminance or Value indicates the shade of gray that the hue is blended with. Black is 0 and white is 255.
es_mx: El tono del color se ve comúnmente en la rueda de colores del artista y contiene los colores del arco iris: rojo, naranja, amarillo, verde, azul, índigo y violeta. El tono se especifica usando un ángulo radial en la rueda, pero en la imagen el círculo típicamente contiene sólo 256 empezando con el rojo en el cero, pasando por el arco iris, y volviendo al rojo en el extremo superior. La saturación de un color especifica la cantidad de color, o la proporción del color de la tonalidad a una sombra de gris. Una proporción más alta significa más colorido, menos gris. La saturación cero no tiene ningún matiz y es completamente gris. La luminancia o valor indica el tono de gris que el tono está mezclado con. El negro es 0 y el blanco es 255.
fr_ca: La teinte de la couleur est généralement visible sur la roue chromatique et contient les couleurs de l'arc-en-ciel, soit le rouge, orange, jaune, vert, bleu, indigo et violet. La teinte est spécifiée en utilisant un angle radial sur la roue, mais en imagerie, le cercle ne contient généralement que 256 unités, en commençant par le rouge à zéro, en passant par l'arc-en-ciel et en revenant au rouge à l'extrémité supérieure. La saturation d'une couleur spécifie la quantité de couleur ou le rapport de la couleur de teinte à une quantité donnée de gris. Un rapport plus élevé signifie plus de couleurs, moins de gris. La saturation zéro n'a pas de teinte et est complètement grise. La luminance ou la valeur indique la quantité de gris avec laquelle la teinte est mélangée. Le noir est 0 et le blanc 255.
tr_tr: Ton veya rengin tonu genellikle sanatçının renk çarkında görülür ve gökkuşağı Kırmızı, Turuncu, Sarı, Yeşil, Mavi, Çivit Mavisi ve Menekşe renklerini içerir. Renk tonu, tekerlek üzerindeki bir radyal açı kullanılarak belirlenir, ancak görüntülemede daire tipik olarak, sıfırdan kırmızıdan başlayarak, gökkuşağı boyunca dönerek ve üst uçta tekrar kırmızıya sararak yalnızca 256 birim içerir. Bir rengin doygunluğu, renk miktarını veya ton renginin gri gölgeye oranını belirtir. Daha yüksek oran, daha renkli, daha az gri demektir. Sıfır doygunluğun tonu yoktur ve tamamen gridir. Parlaklık veya Değer, tonun harmanlandığı gri tonunu gösterir. Siyah 0 ve beyaz 255'tir.
zh_cn: 颜色的色相或色调通常出现在艺术家的色轮上，并包含红色，橙色，黄色，绿色，蓝色，靛蓝和紫罗兰色的彩虹色。色相是使用色轮上的径向角指定的，但是在实际成像中，圆的径向角通常仅包含256个单位，其从零（红色）开始，循环穿过彩虹渐变，然后在上端回绕为红色。颜色的饱和度指定颜色的浓量，或色调颜色与灰色阴影的比率。较高的比率表示更多彩色，较少灰色。零饱和度没有色相，并且完全是灰色。 “亮度”或“值”指示与色调混合的灰色阴影。黑色为0，白色为255。

source: The example code uses the HSV color space to specify the color of the target. The primary reason is that it readily allows for using the brightness of the targets relative to the rest of the image as a filtering criteria by using the Value (HSV) or Luminance (HSL) component. Another reason to use the HSV color system is that the thresholding operation used in the example runs more efficiently on the roboRIO when done in the HSV color space.
es_mx: El código de ejemplo utiliza el espacio de color HSV para especificar el color del objetivo. La razón principal es que permite utilizar fácilmente el brillo de los objetivos en relación con el resto de la imagen como un criterio de filtrado utilizando el componente de Valor (HSV) o Luminancia (HSL). Otra razón para usar el sistema de color HSV es que la operación de umbral utilizada en el ejemplo funciona más eficientemente en el roboRIO cuando se hace en el espacio de color del HSV.
fr_ca: L'exemple de code utilise l'espace colorimétrique HSV pour spécifier la couleur de la cible. La principale raison est qu'elle permet facilement d'utiliser la luminosité des cibles par rapport au reste de l'image comme critère de filtrage en utilisant le composant Valeur (HSV) ou Luminance (HSL). Une autre raison d'utiliser le système de couleurs HSV est que l'opération de seuillage utilisée dans l'exemple s'exécute plus efficacement sur le roboRIO lorsqu'elle est effectuée dans l'espace colorimétrique HSV.
tr_tr: Örnek kod, hedefin rengini belirtmek için HSV renk uzayını kullanır. Birincil neden, Hedeflerin parlaklığını, görüntünün geri kalanına göre, Değer (HSV) veya Parlaklık (HSL) bileşenini kullanarak bir filtreleme kriteri olarak kullanmaya kolayca izin vermesidir. HSV renk sistemini kullanmanın bir başka nedeni, örnekte kullanılan eşikleme işleminin HSV renk uzayında yapıldığında roboRIO üzerinde daha verimli çalışmasıdır.
zh_cn: 该示例代码使用HSV颜色空间指定了目标的颜色。这一操作的主要原因是因为通过使用“值”（HSV）或“亮度”（HSL）分量，可以轻松地将目标相对于图像其余部分的亮度用作过滤标准。使用HSV色彩系统的另一个原因是，当在HSV色彩空间中进行阈值过滤操作时，能roboRIO上更有效地运行。

source: Masking
es_mx: Enmascarando
fr_ca: Masquage
tr_tr: Maskeleme
zh_cn: 遮罩

source: In this initial step, pixel values are compared to constant color or brightness values to create a binary mask shown below in yellow. This single step eliminates most of the pixels that are not part of a target’s retro-reflective tape. Color based masking works well provided the color is relatively saturated, bright, and consistent. Color inequalities are generally more accurate when specified using the HSL (Hue, Saturation, and Luminance) or HSV (Hue, Saturation, and Value) color space than the RGB (Red, Green, and Blue) space. This is especially true when the color range is quite large in one or more dimension.
es_mx: En este paso inicial, los valores de los píxeles se comparan con los valores de color o brillo constantes para crear una máscara binaria que se muestra abajo en amarillo. Este único paso elimina la mayoría de los píxeles que son no es parte de la cinta retro-reflectante del objetivo. El enmascaramiento basado en el color funciona bien siempre que el color es relativamente saturado, brillante y consistente. Las desigualdades de color son generalmente más precisas cuando se especifica usando el HSL (Tono, Saturación y Luminancia) o el HSV (Tono, Saturación, y Valor) que el espacio de color RGB (Rojo, Verde y Azul). Esto es especialmente cierto cuando la gama de colores es bastante grande en una o más dimensiones.
fr_ca: Dans cette étape initiale, les valeurs des pixels sont comparées aux valeurs de couleur ou de luminosité constantes pour créer un masque binaire illustré ci-dessous en jaune. Cette étape unique élimine la plupart des pixels qui ne font pas partie du ruban rétroréfléchissant d’une cible. Le masquage basé sur la couleur fonctionne bien à condition que la couleur soit relativement saturée, lumineuse et cohérente. Les inégalités de couleur sont généralement plus précises lorsqu'elles sont spécifiées à l'aide de l'espace colorimétrique HSL (teinte, saturation et luminance) ou HSV (teinte, saturation et valeur) que l'espace RVB (rouge, vert et bleu). Cela est particulièrement vrai lorsque la gamme de couleurs est assez large dans une ou plusieurs dimensions.
tr_tr: Bu ilk adımda, aşağıda sarı renkte gösterilen bir ikili maske oluşturmak için piksel değerleri sabit renk veya parlaklık değerleriyle karşılaştırılır. Bu tek adım, hedefin geriye dönük yansıtıcı bandının parçası olmayan piksellerin çoğunu ortadan kaldırır. Renk tabanlı maskeleme, rengin nispeten doygun, parlak ve tutarlı olması koşuluyla iyi çalışır. Renk eşitsizlikleri genellikle HSL (Ton, Doygunluk ve Parlaklık) veya HSV (Ton, Doygunluk ve Değer) renk alanı kullanılarak belirtildiğinde RGB (Kırmızı, Yeşil ve Mavi) alanından daha doğrudur. Bu, özellikle renk aralığı bir veya daha fazla boyutta oldukça geniş olduğunda geçerlidir.
zh_cn: 一开始，像素值会与恒定的颜色或亮度值进行比较，以创建下面以黄色显示的二元遮罩。这一步消除了除了反光带以外的大部分像素。如果颜色相对饱和，明亮且一致，则基于颜色的遮罩效果会很好。使用HSL（色相，饱和度和亮度）或HSV（色相，饱和度和值）颜色空间时，捕捉颜色的区别通常比RGB（红色，绿色和蓝色）空间更准确。当颜色范围在一维或多个维上很大时，尤其如此。

source: Notice that in addition to the target, other bright parts of the image (overhead light and tower lighting) are also caught by the masking step.
es_mx: Observe que además del objetivo, otras partes brillantes de la imagen (la luz superior y la torre iluminación) también son atrapados por el paso de la máscara.
fr_ca: Notez qu'en plus de la cible, d'autres parties lumineuses de l'image (lumière aérienne et éclairage de la tour) sont également capturées par l'étape de masquage.
tr_tr: Hedefe ek olarak, görüntünün diğer parlak kısımlarının da (üstten ışık ve kule aydınlatması) maskeleme adımında yakalandığına dikkat edin.
zh_cn: 请注意，除了目标之外，图像的其他明亮部分（顶灯和塔顶照明）也会被遮罩步骤捕获。

source: Masked version of the image above showing the "bright" parts of the image.
fr_ca: Version masquée de l’image ci-dessus montrant les parties "lumineuses" de l’image.

source: Particle Analysis
es_mx: Análisis de partículas
fr_ca: Analyse des particules
tr_tr: Parçacık Analizi
zh_cn: 像素块分析

source: After the masking operation, a particle report operation is used to examine the area, bounding rectangle, and equivalent rectangle for the particles. These are used to compute several scored terms to help pick the shapes that are most rectangular. Each test described below generates a score (0-100) which is then compared to pre-defined score limits to decide if the particle is a target or not.
es_mx: Después de la operación de enmascaramiento, se utiliza una operación de informe de partículas para examinar la zona, delimitando rectángulo, y un rectángulo equivalente para las partículas. Estos se utilizan para ayudar a elegir las formas más rectangulares. Cada prueba descrita a continuación genera una puntuación (0-100) que luego se compara con los límites de puntuación predefinidos para decidir si el de las partículas es un objetivo o no.
fr_ca: Après l'opération de masquage, une opération de rapport de particules est utilisée pour examiner la zone, le rectangle de délimitation et le rectangle équivalent pour les particules. Ceux-ci sont utilisés pour calculer plusieurs termes notés pour aider à choisir les formes les plus rectangulaires. Chaque test décrit ci-dessous génère un score (0-100) qui est ensuite comparé aux limites de score prédéfinies pour décider si la particule est une cible ou non.
tr_tr: Maskeleme işleminden sonra, alanı, sınırlayıcı dikdörtgeni ve parçacıklar için eşdeğer dikdörtgeni incelemek için bir parçacık raporu işlemi kullanılır. Bunlar, en dikdörtgen olan şekilleri seçmeye yardımcı olmak için birkaç puanlanmış terimi hesaplamak için kullanılır. Aşağıda açıklanan her test bir puan (0-100) oluşturur ve bu daha sonra parçacığın hedef olup olmadığına karar vermek için önceden tanımlanmış puan limitleriyle karşılaştırılır.
zh_cn: 遮罩操作之后，像素块报告将检查像素块的面积，边界矩形和等效矩形。这些用于计算几个计分项，以帮助选择最矩形的形状。下文所述的每个测试都会生成一个分数（0-100），然后将其与预定义的分数限制进行比较，以确定像素块是否为目标。

source: Coverage Area
es_mx: Área de cobertura
fr_ca: Zone de couverture
tr_tr: Kapsama alanı
zh_cn: 覆盖区域

source: The Area score is calculated by comparing the area of the particle compared to the area of the bounding box drawn around the particle. The area of the retroreflective strips is 80 square inches (~516 :math:`cm^2`). The area of the rectangle that contains the target is 240 square inches (~0.15 :math:`m^2`). This means that the ideal ratio between area and bounding box area is 1/3. Area ratios close to 1/3 will produce a score near 100, as the ratio diverges from 1/3 the score will approach 0.
es_mx: La puntuación del área se calcula comparando el área de la partícula con el área del cuadro delimitador dibujado alrededor de la partícula. El área de las bandas retrorreflectoras es de 80 pulgadas cuadradas (~516 :math:`cm^2`). El área del rectángulo que contiene el objetivo es de 240 pulgadas cuadradas (~0.15 :math:`m^2`). Esto significa que la relación ideal entre el área y el área del cuadro delimitador es de 1/3. Las relaciones de área cercanas a 1/3 producirán un puntaje cercano a 100, a medida que la relación se aleje de 1/3 el puntaje se acercará a 0.
fr_ca: Le score d'aire est calculé en comparant l'aire de la particule à l'aire de la boîte englobante dessinée autour de la particule. La surface des bandes rétroréfléchissantes est de 80 pouces carrés (~516 :math:`cm^2`). La zone du rectangle qui contient la cible est de 240 pouces carrés (~0.15 :math:`m^2`). Cela signifie que le rapport idéal entre la zone et la zone de la zone de délimitation est de 1/3. Des ratios de surface proches de 1/3 produiront un score proche de 100, car le ratio diverge de 1/3, le score approchera de 0.
tr_tr: Alan puanı, parçacığın çevresine çizilen sınırlayıcı kutunun alanıyla karşılaştırılarak parçacık alanı karşılaştırılarak hesaplanır. Arkadan yansıtmalı şeritlerin alanı 80 inç karedir (~ 516: matematik: "cm ^ 2"). Hedefi içeren dikdörtgenin alanı 240 inç karedir (~ 0,15: matematik: "m ^ 2"). Bu, alan ve sınırlayıcı kutu alanı arasındaki ideal oranın 1/3 olduğu anlamına gelir. 1 / 3'e yakın alan oranları 100'e yakın bir puan üretecektir, oran 1 / 3'ten farklılaştıkça puan 0'a yaklaşacaktır.
zh_cn: 面积分数是通过将像素块的面积与像素块周围绘制的边界框的面积进行比较来计算的。全反射条的面积为80平方英寸（〜516：数学：`cm ^ 2`）。包含目标的矩形区域为240平方英寸（〜0.15：math：`m ^ 2`）。这意味着面积与边界框面积之间的理想比率为1/3。接近1/3的面积比将产生接近100的得分，比例越偏离1/3时，得分越接近0。

source: Aspect Ratio
es_mx: Relación de aspecto
fr_ca: Rapport d'aspect
tr_tr: En Boy Oranı
zh_cn: 长宽比

source: The aspect ratio score is based on (Particle Width / Particle Height). The width and height of the particle are determined using something called the "equivalent rectangle". The equivalent rectangle is the rectangle with side lengths :math:`x` and :math:`y` where :math:`2x+2y` equals the particle perimeter and :math:`x \cdot y` equals the particle area. The equivalent rectangle is used for the aspect ratio calculation as it is less affected by skewing of the rectangle than using the bounding box. When using the bounding box rectangle for aspect ratio, as the rectangle is skewed the height increases and the width decreases.
es_mx: La puntuación de la relación de aspecto se basa en (Ancho de la partícula / Altura de la partícula). El ancho y la altura de la partícula se determinan usando algo llamado "rectángulo equivalente". El rectángulo equivalente es el rectángulo con longitudes laterales :math: ´x´ y ´y´ donde :math: ´2x+2y´ es igual a la partícula perímetro y :math: ´x \cdot y´ es igual al área de la partícula. El rectángulo equivalente se utiliza para el aspecto de cálculo de la proporción, ya que se ve menos afectado por el sesgo del rectángulo que por el uso del límite caja. Cuando se utiliza el rectángulo del cuadro delimitador para la relación de aspecto, como el rectángulo está sesgado la altura aumenta y la anchura disminuye.
fr_ca: Le score du ratio d'aspect est basé sur le calcul (Largeur de particule / Hauteur de particule). La largeur et la hauteur de la particule sont déterminées en utilisant ce que l'on appelle le "rectangle équivalent". Le rectangle équivalent est le rectangle avec des longueurs latérales :math:`x` et :math:`y` où :math:`2x+2y` est égal au périmètre de particules et :math:`x \cdot y` est égal à la zone de particules. Le rectangle équivalent est utilisé pour le calcul du ratio d'aspect car il est moins affecté par l'inclinaison du rectangle que par l'utilisation du cadre de sélection. Lorsque vous utilisez le rectangle du cadre de sélection pour les proportions, à mesure que le rectangle est incliné, la hauteur augmente et la largeur diminue.
tr_tr: En boy oranı puanı (Partikül Genişliği / Partikül Yüksekliği) temel alınarak belirlenir. Parçacığın genişliği ve yüksekliği "eşdeğer dikdörtgen" adı verilen bir şey kullanılarak belirlenir. Eşdeğer dikdörtgen, kenar uzunlukları olan dikdörtgendir : math:`x` ve: math:`y` burada: math:`2x+2y`, parçacık çevresine ve: math:`x \ cdot y`, parçacık alanına eşittir. Eşdeğer dikdörtgen, en boy oranı hesaplamasında kullanılır, çünkü dikdörtgenin eğrilmesinden sınırlayıcı kutuyu kullanmaktan daha az etkilenir. En boy oranı için sınırlayıcı kutu dikdörtgeni kullanıldığında, dikdörtgen eğriltildikçe yükseklik artar ve genişlik azalır.
zh_cn: 长宽比得分基于（像素块宽度/像素块高度）。像素块的宽度和高度使用称为“等效矩形”的值来确定。等效矩形是边长为：math：`x`和：math：`y`的矩形，其中：math：`2x+2y`等于像素块周长，而：math：`x \ cdot y`等于像素块面积。等效矩形用于纵横比计算，因为与使用边框相比，等效矩形受矩形倾斜的影响较小。当使用边框矩形作为宽高比时，随着矩形的倾斜，高度会增加，宽度会减小。
