Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/introduction/identifying-and-processing-the-targets.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: The target is 20" (508 mm) wide by 12" (304.8 mm) tall, for a ratio of 1.6. The detected aspect ratio is compared to this ideal ratio. The aspect ratio score is normalized to return 100 when the ratio matches the target ratio and drops linearly as the ratio varies below or above.
es_mx: El objetivo tiene 20" (508 mm) de ancho por 12" (304,8 mm) de alto, para una relación de 1,6. La relación de aspecto detectada se compara con esta relación ideal. La puntuación de la relación de aspecto se normaliza para obtener 100 cuando la relación coincide con la del objetivo y desciende linealmente a medida que la relación varía por debajo o por encima.
fr_ca: La cible mesure 20″ (508 mm) de largeur sur 12″ (304,8 mm) de hauteur, pour un rapport de 1.6. Le rapport hauteur / largeur détecté est comparé à ce rapport idéal. Le score du rapport hauteur / largeur est normalisé pour renvoyer 100 lorsque le rapport correspond au rapport cible et diminue linéairement lorsque le rapport varie en dessous ou au-dessus.
tr_tr: Hedef 1,6 oran için 20 "(508 mm) genişliğinde ve 12" (304,8 mm) yüksekliğindedir. Tespit edilen en boy oranı bu ideal oran ile karşılaştırılır. En boy oranı puanı, oran hedef oranla eşleştiğinde ve oran aşağı veya yukarı değiştikçe doğrusal olarak düştüğünde 100'e geri dönecek şekilde normalleştirilir.
zh_cn: 视觉目标宽为20英寸（508毫米），高为12英寸（304.8毫米），比率为1.6。将检测到像素块的纵横比与该理想比例进行比较。当该比例与目标比例匹配时，纵横比得分会归一化为100，并随着该比例的变化而线性下降。

source: Moment
es_mx: Momento
fr_ca: Moment d'inertie
tr_tr: An
zh_cn: 力矩

source: The moment measurement calculates the particles moment of inertia about it's center of mass. This measurement provides a representation of the pixel distribution in the particle. The ideal score for this test is ~0.28. See: `Moment of Inertia <https://en.wikipedia.org/wiki/Moment_of_inertia>`_
es_mx: La medición del momento calcula el momento de inercia de las partículas sobre su centro de masa. Esta medida proporciona una representación de la distribución de los píxeles en la partícula. La puntuación ideal para esta prueba es de ~0,28. Vea: `Momento de inercia <https://en.wikipedia.org/wiki/Moment_of_inertia>`_
fr_ca: Cette mesure calcule le moment d'inertie des particules autour de son centre de masse. Elle fournit une représentation de la distribution des pixels dans la particule. Le score idéal pour ce test est de ~ 0,28. Voir: `Moment d'inertie <https://en.wikipedia.org/wiki/Moment_of_inertia>`_
tr_tr: Moment ölçümü, parçacıkların kütle merkezi etrafındaki eylemsizlik momentini hesaplar. Bu ölçüm, partiküldeki piksel dağılımının bir temsilini sağlar. Bu test için ideal puan ~ 0.28'dir. Bakınız: ``Atalet Momenti <https://en.wikipedia.org/wiki/Moment_of_inertia>`` _
zh_cn: 力矩测量可计算像素块在其质心附近的惯性矩。该测量提供了像素块中像素分布的表示。该测试的理想分数是〜0.28。参见：`惯性矩<https://en.wikipedia.org/wiki/Moment_of_inertia>`_

source: X/Y Profiles
es_mx: Perfiles X/Y
fr_ca: Profils X/Y
tr_tr: X / Y Profilleri
zh_cn: X / Y配置文件

source: A graph and LabVIEW plot showing X/Y Profiles.
fr_ca: Un graphique et un diagramme LabVIEW montrant les profils X/Y.

source: The edge score describes whether the particle matches the appropriate profile in both the X and Y directions. As shown, it is calculated using the row and column averages across the bounding box extracted from the original image and comparing that to a profile mask. The score ranges from 0 to 100 based on the number of values within the row or column averages that are between the upper and lower limit values.
es_mx: El puntaje del borde describe si la partícula coincide con el perfil apropiado tanto en el X y las direcciones Y. Como se muestra, se calcula usando los promedios de fila y columna a través de la caja delimitadora extraída de la imagen original y comparada con una máscara de perfil. La puntuación oscila entre 0 y 100 en función del número de valores dentro de los promedios de las filas o columnas que están entre los valores límite superior e inferior.
fr_ca: Ce score décrit si la particule correspond au profil approprié dans les directions X et Y. Il est calculé en utilisant les moyennes des lignes et des colonnes à travers le cadre de délimitation extraites de l'image d'origine et en les comparant à un masque de profil. Le score varie de 0 à 100 en fonction du nombre de valeurs dans les moyennes de ligne ou de colonne qui se situent entre les valeurs limites supérieure et inférieure.
tr_tr: Kenar puanı, parçacığın hem X hem de Y yönlerinde uygun profille eşleşip eşleşmediğini açıklar. Gösterildiği gibi, orijinal görüntüden çıkarılan sınırlayıcı kutu boyunca satır ve sütun ortalamaları kullanılarak ve bunu bir profil maskesi ile karşılaştırarak hesaplanır. Puan, üst ve alt sınır değerleri arasındaki satır veya sütun ortalamaları içindeki değerlerin sayısına bağlı olarak 0 ile 100 arasında değişir.
zh_cn: 边缘分数描述了像素块在X和Y方向上是否都匹配适当的轮廓。如图所示，它是使用从原始图像中提取的边界框上的行和列平均值，并将其与轮廓蒙版进行比较来计算的。根据行平均值或列平均值中上限值和下限值之间的值的数量，分数的范围为0到100。

source: Measurements
es_mx: Medidas
fr_ca: Mesures
tr_tr: Ölçümler
zh_cn: 测量

source: If a particle scores well enough to be considered a target, it makes sense to calculate some real-world measurements such as position and distance. The example code includes these basic measurements, so let’s look at the math involved to better understand it.
es_mx: Si una partícula puntúa lo suficientemente bien como para ser considerada un objetivo, tiene sentido calcular algunas medidas del mundo real como la posición y la distancia. El código de ejemplo incluye estas medidas básicas, así que veamos las matemáticas involucradas para entenderlo mejor.
fr_ca: Si une particule a un score suffisamment élévé pour être considérée comme une cible, il est logique de calculer certaines mesures du monde réel telles que la position et la distance. L'exemple de code comprend ces mesures de base, alors examinons les mathématiques impliquées pour mieux les comprendre.
tr_tr: Bir parçacık hedef olarak değerlendirilebilecek kadar iyi puan alırsa, konum ve mesafe gibi bazı gerçek dünya ölçümlerini hesaplamak mantıklıdır. Örnek kod bu temel ölçümleri içerir, bu yüzden onu daha iyi anlamak için ilgili matematiğe bakalım.
zh_cn: 如果像素块得分足够好，其将视为目标，此时则可以计算一些实际的测量值，例如位置和距离。该示例代码包含这些基本度量，因此让我们看一下所涉及的数学以更好地理解它。

source: The target position is well described by both the particle and the bounding box, but all coordinates are in pixels with 0,0 being at the top left of the screen and the right and bottom edges determined by the camera resolution. This is a useful system for pixel math, but not nearly as useful for driving a robot; so let’s change it to something that may be more useful.
es_mx: La posición del objetivo está bien descrita tanto por la partícula como por el cuadro delimitador, pero todas las coordenadas están en píxeles con el 0,0 estando en la parte superior izquierda de la pantalla y la derecha y la parte inferior de los bordes determinados por la resolución de la cámara. Este es un sistema útil para la matemática de los píxeles, pero no casi tan útil para conducir un robot; así que cambiémoslo a algo que pueda ser más útil.
fr_ca: La position cible est identifiée à la fois par la particule et le cadre de sélection, mais toutes les coordonnées sont en pixels. 0.0 étant en haut et à gauche de l'écran et les bords droit et inférieur déterminés par la résolution de la caméra. Il s'agit d'un système utile pour les mathématiques des pixels, mais pas vraiment utile pour conduire un robot; alors changeons-le en quelque chose qui pourrait être plus utile.
tr_tr: Hedef konum, hem parçacık hem de sınırlayıcı kutu tarafından iyi tanımlanmıştır, ancak tüm koordinatlar, ekranın sol üst köşesinde 0,0 ve kamera çözünürlüğü tarafından belirlenen sağ ve alt kenarlar olmak üzere piksel cinsindendir. Bu, piksel matematiği için kullanışlı bir sistemdir, ancak bir robotu sürmek için neredeyse hiç kullanışlı değildir; Öyleyse daha yararlı olabilecek bir şeyle değiştirelim.
zh_cn: 像素块和边界框都很好地描述了目标位置，但是所有坐标均以像素为单位，其中0,0位于屏幕的左上角，其右边缘和下边缘由相机分辨率确定。这对于像素数学来说是一个有用的系统，但是对于驱动机器人却没有那么有用。因此，让我们将其更改为可能更有用的内容。

source: To convert a point from the pixel system to the aiming system, we can use the formula shown below.
es_mx: Para convertir un punto del sistema de píxeles al sistema de puntería, podemos usar la fórmula mostrada debajo.
fr_ca: Pour convertir un point du système de pixels à un environnement plus compatible pour un robot, nous pouvons utiliser la formule ci-dessous.
tr_tr: Bir noktayı piksel sisteminden nişan alma sistemine dönüştürmek için aşağıda gösterilen formülü kullanabiliriz.
zh_cn: 要将点从像素系统转换为瞄准系统，可以使用以下公式。

source: The resulting coordinates are close to what you may want, but the Y axis is inverted. This could be corrected by multiplying the point by [1,-1] (Note: this is not done in the sample code). This coordinate system is useful because it has a centered origin and the scale is similar to joystick outputs and Drive inputs.
fr_ca: Les coordonnées résultantes sont proches de ce que vous pouvez souhaiter, mais l'axe Y est inversé. Cela pourrait être corrigé en multipliant le point par [1, -1] (Remarque: cela n'est pas fait dans l'exemple de code). Ce système de coordonnées est utile car il a une origine centrée et l'échelle est similaire aux sorties du joystick et aux entrées de l'entraînement (Drive).
zh_cn: 所得到的坐标系是接近我们想要的，但是Y轴是反着的。这可以通过将该点乘以[1，-1]来纠正。(注意:在示例代码中没有这样做)。这个坐标系统是有效的，因为它有一个中心原点和规模类似于操纵杆输出和驱动输入。

source: Two images one of a pixel based axis and another from -1 to 1 that can be directly used with motors for aiming.
fr_ca: Deux images l’une d’un axe basé sur les pixels et l’autre de -1 à 1 qui peuvent être directement utilisées avec des moteurs pour le pointage d'une cible.

source: Field of View
es_mx: Vista de campo
fr_ca: Champ de vision
tr_tr: Görüş alanı
zh_cn: 视场

source: You can use known constants and the position of the target on the coordinate plane to determine your distance, yaw, and pitch from the target. However, in order to calculate these, you must determine your FOV (field of view). In order to empirically determine vertical field of view, set your camera a set distance away from an flat surface, and measure the distance between the topmost and bottommost row of pixels.
es_mx: Puede utilizar constantes conocidas y la posición del objetivo en el plano de coordenadas para determinar la distancia, la guiñada y el cabeceo del objetivo. Sin embargo, para calcularlas, debes determinar tu FOV (campo de visión). Para determinar empíricamente el campo vertical de la vista, coloca tu cámara a una distancia determinada de una superficie plana, y mide la distancia entre la fila de píxeles más alta y la más baja.
fr_ca: Vous pouvez utiliser des constantes connues et la position de la cible sur le plan de coordonnées pour déterminer votre distance, lacet (yaw) et tangage (pitch) par rapport à la cible. Cependant, pour les calculer, vous devez déterminer votre FOV (champ de vision). Afin de déterminer empiriquement le champ de vision vertical, réglez votre caméra à une distance définie d'une surface plane et mesurez la distance entre la rangée de pixels la plus haute et la plus basse.
tr_tr: Hedeften mesafenizi, sapmanızı ve eğiminizi belirlemek için bilinen sabitleri ve hedefin koordinat düzlemindeki konumunu kullanabilirsiniz. Ancak, bunları hesaplamak için FOV'nuzu (görüş alanınızı) belirlemelisiniz. Dikey görüş alanını ampirik olarak belirlemek için, kameranızı düz bir yüzeyden belirli bir mesafe uzağa ayarlayın ve en üstteki ve en alttaki piksel sırası arasındaki mesafeyi ölçün.
zh_cn: 您可以使用已知常数和目标在坐标平面上的位置来确定距目标的距离，偏航和俯仰。但是，为了计算这些，您必须确定您的FOV（视场）。为了凭经验确定垂直视场，请将相机设置为与平面保持一定距离，然后测量最顶部和最底部像素行之间的距离。

source: You can find the horizontal FOV using the same method, but using the distance between the first and last column of pixels.
es_mx: Puede encontrar el FOV horizontal usando el mismo método, pero usando la distancia entre la primera y última columna de píxeles.
fr_ca: Vous pouvez trouver le champ de vision horizontal en utilisant la même méthode, mais en utilisant la distance entre la première et la dernière colonne de pixels.
tr_tr: Yatay FOV'u aynı yöntemi kullanarak, ancak ilk ve son piksel sütunu arasındaki mesafeyi kullanarak bulabilirsiniz.
zh_cn: 您可以使用相同的方法，但使用像素的第一列和最后一列之间的距离来找到水平FOV。

source: Pitch and Yaw
es_mx: Lanzamiento y guiño
fr_ca: Tangage (Pitch) et Lacet (Yaw)
zh_cn: 俯仰和偏航

source: Finding the pitch and yaw of the target relative to your robot is simple once you know your FOVs and the location of your target in the aiming coordinate system.
es_mx: Encontrar el lanzamiento y el guiño del objetivo en relación con tu robot es simple una vez que conoces tu FOV y la ubicación de su objetivo en el sistema de coordenadas de puntería.
fr_ca: Trouver le tangage et le lacet de la cible par rapport à votre robot est simple une fois que vous connaissez vos FOV et l'emplacement de votre cible dans le système de coordonnées de visée.
tr_tr: FOV'larınızı ve hedef koordinat sistemindeki hedefinizin konumunu öğrendikten sonra, robotunuza göre hedefin eğimini ve sapmasını bulmak basittir.
zh_cn: 一旦知道了视野和目标在瞄准坐标系中的位置，就可以轻松找到目标相对于机器人的俯仰和偏航。

source: If your target is at a significantly different height than your robot, you can use known constants, such as the physical height of the target and your camera, as well as the angle your camera is mounted, to calculate the distance between your camera and the target.
es_mx: Si tu objetivo está a una altura significativamente diferente a la de tu robot, puedes usar constantes conocidas, como la altura física del objetivo y tu cámara, así como el ángulo en el que se monta la cámara, para calcular la distancia entre la cámara y el objetivo.
fr_ca: Si votre cible est à une hauteur sensiblement différente de celle de votre robot, vous pouvez utiliser des constantes connues, telles que la hauteur physique de la cible et de votre caméra, ainsi que l'angle de montage de votre caméra, pour calculer la distance entre votre caméra et la cible.
tr_tr: Hedefiniz robotunuzdan önemli ölçüde farklı bir yükseklikte ise, kameranız ile kamera arasındaki mesafeyi hesaplamak için hedefin ve kameranızın fiziksel yüksekliği ve kameranızın monte edildiği açı gibi bilinen sabitleri kullanabilirsiniz. hedef.
zh_cn: 如果目标的高度与机器人的高度明显不同，则可以使用已知的常数，例如目标和摄像机的物理高度以及摄像机的安装角度，来计算摄像机与目标之间的距离。

source: Another option is to create a lookup table for area to distance, or to estimate the inverse variation constant of area and distance. However, this method is less accurate.
es_mx: Otra opción es crear una tabla de búsqueda de área a distancia, o estimar el inverso constante de variación de área y distancia. Sin embargo, este método es menos preciso.
fr_ca: Une autre option consiste à créer une table de correspondance de la zone à la distance ou à estimer la constante de variation inverse de la zone et de la distance. Cependant, cette méthode est moins précise.
tr_tr: Diğer bir seçenek, alan-mesafe için bir arama tablosu oluşturmak veya alan ve mesafenin ters varyasyon sabitini tahmin etmektir. Ancak bu yöntem daha az doğrudur.
zh_cn: 另一种选择是创建一个面积到距离的查找表，或估算面积和距离的反变常数（ inverse variation constant ）。但是，此方法不太准确。

source: For best results for the above methods of estimating angle and distance, you can calibrate your camera using OpenCV to get rid of any distortions that may be affecting accuracy by reprojecting the pixels of the target using the calibration matrix.
es_mx: Para obtener los mejores resultados de los métodos anteriores de estimación del ángulo y la distancia, puede calibrar su cámara usando OpenCV para deshacerse de cualquier distorsión que pueda estar afectando a la precisión reproyectando los píxeles del objetivo usando la matriz de calibración
fr_ca: Pour de meilleurs résultats pour les méthodes d'estimation d'angle et de distance ci-dessus, vous pouvez étalonner votre caméra à l'aide d'OpenCV pour éliminer les distorsions susceptibles d'affecter la précision en reprojetant les pixels de la cible à l'aide de la matrice d'étalonnage.
tr_tr: Yukarıdaki açı ve mesafe tahmin yöntemlerinden en iyi sonuçları elde etmek için, kalibrasyon matrisini kullanarak hedefin piksellerini yeniden projekte ederek doğruluğu etkileyebilecek tüm bozulmalardan kurtulmak için OpenCV kullanarak kameranızı kalibre edebilirsiniz.
zh_cn: 为了获得上述估计角度和距离的方法的最佳结果，您可以使用OpenCV校准相机，并使用校准矩阵重新投影目标像素。这样能够消除可能影响精度的任何失真。

source: Position
es_mx: Posición
tr_tr: Durum
zh_cn: 位置

source: The resulting coordinates are close to what you may want, but the Y axis is inverted. This could be corrected by multiplying the point by [1,-1] (Note: this is not done in the sample code). This coordinate system is useful because it has a centered origin and the scale is similar to joystick outputs and RobotDrive inputs.
es_mx: Las coordenadas resultantes se acercan a lo que usted puede querer, pero el eje Y está invertido. Este podría corregirse multiplicando el punto por [1,-1] (Nota: esto no se hace en la muestra de código). Este sistema de coordenadas es útil porque tiene un origen centrado y la escala es similar a las salidas de los joysticks y las entradas del RobotDrive.

source: Distance
es_mx: Distancia
tr_tr: Mesafe
zh_cn: 距离
