Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/introduction/strategies-for-vision-programming.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Strategies for Vision Programming
es_mx: Estrategias para la programación de la visión
fr_ca: Stratégies pour la programmation de la vision
tr_tr: Görüntü Programlama Stratejileri
zh_cn: 视觉编程策略

source: Using computer vision is a great way of making your robot be responsive to the elements on the field and make it much more autonomous. Often in FRC\ |reg| games there are bonus points for autonomously shooting balls or other game pieces into goals or navigating to locations on the field. Computer vision is a great way of solving many of these problems. And if you have autonomous code that can do the challenge, then it can be used during the teleop period as well to help the human drivers.
es_mx: Usar la visión por computadora es una gran manera de hacer que tu robot responda a los elementos en el campo y hacerlo mucho más autónomo. A menudo en los juegos de FRC\ |reg| hay puntos de bonificación por disparar de forma autónoma pelotas u otras piezas de juego a las metas o navegar a lugares en el campo. La visión por computador es una gran manera de resolver muchos de estos problemas. Y si tienes código autónomo que puede hacer el desafío, entonces puede ser usado durante el período de teleoperado para ayudar a los conductores.
fr_ca: L’utilisation de la vision par ordinateur est un excellent moyen de rendre votre robot sensible aux éléments sur le terrain et de le rendre beaucoup plus autonome. Souvent dans les jeux FRC\ |reg|, il ya des points bonus pour les balles tirées en mode autonome ou d’autres pièces de jeu dans les buts ou la navigation vers des endroits précis sur le terrain. La vision par ordinateur est un excellent moyen de résoudre bon nombre de ces problèmes. Et si vous avez du code autonome qui peut relever le défi, alors il peut être utilisé pendant la période de téléopéré et ainsi assister les conducteurs humains lors du pilotage.
tr_tr: Bilgisayarla görmeyi kullanmak, robotunuzun sahadaki unsurlara duyarlı olmasını ve çok daha otonom olmasını sağlamanın harika bir yoludur. Genellikle FRC \|reg| oyunlar, topları veya diğer oyun parçalarını kendi kendine hedefe atmak veya sahadaki yerlere gitmek için bonus puanlar vardır. Bilgisayarla görme, bu sorunların çoğunu çözmenin harika bir yoludur. Ve eğer meydan okumayı gerçekleştirebilecek özerk bir kodunuz varsa, o zaman insan sürücülere yardımcı olmak için teleop döneminde de kullanılabilir.
zh_cn: 使用计算机视觉是使您的机器人对现场的元素做出反应并使其更加自动化的一种好方法。通常在FRC \ | reg |比赛中，可以通过自动将球或其他比赛物件射入目标，或导航到场地上获得奖励分数。计算机视觉是解决其中许多问题的好方法。而且，如果您拥有可以实现这一操作的自动代码，那么它也可以在遥控操作期间使用，以帮助驾驶员。

source: There are many options for choosing the components for vision processing and where the vision program should run. WPILib and associated tools support a number of options and give teams a lot of flexibility to decide what to do. This article will attempt to give you some insight into many of the choices and tradeoffs that are available.
es_mx: Hay muchas opciones para elegir los componentes para el procesamiento de la visión y donde el programa de visión debería funcionar. WPILib y las herramientas asociadas apoyan un número de opciones y dan a los equipos mucha flexibilidad para decidir qué hacer. Este artículo tratará de darte un poco de de muchas de las opciones y compensaciones que están disponibles.
fr_ca: Il existe de nombreuses options pour choisir les composants pour le traitement de la vision et où le programme de vision va s'exécuter. WPILib et les outils associés prennent en charge un certain nombre d'options et offrent aux équipes une grande flexibilité pour décider quoi faire. Cet article va tenter de vous donner un aperçu de la plupart des choix et des compromis disponibles.
tr_tr: Görüntü işleme için bileşenleri ve görsel denetim programının nerede çalışması gerektiğini seçmek için bir çok seçenek vardır. WPILib ve ilgili araçlar bir dizi seçeneği destekler ve ekiplere ne yapacaklarına karar vermeleri için büyük bir esneklik sağlar. Bu makale, mevcut birçok seçenek ve değiş tokuş hakkında size fikir vermeye çalışacaktır.
zh_cn: 视觉处理系统的的组件以及视觉程序应该运行的位置有多种选项。WPILib和相关的工具也支持多种选项，并为团队的决定提供了很大的灵活性。本文将让您了解许多可用的选择和权衡。

source: Different vision workflows in FRC.
fr_ca: Différents flux de travail de vision en FRC.

source: OpenCV Computer Vision Library
es_mx: Biblioteca de Visión por Computadora OpenCV
fr_ca: Librairie de vision par ordinateur OpenCV
tr_tr: OpenCV Computer Vision Kitaplığı
zh_cn: OpenCV计算机视觉库

source: **OpenCV** is an open source computer vision library that is widely used throughout academia and industry. It has support from hardware manufactures providing GPU accelerated processing, it has bindings for a number of languages including C++, Java, and Python. It is also well documented with many web sites, books, videos, and training courses so there are lots of resources available to help learn how to use it. The C++ and Java versions of WPILib include the OpenCV libraries, there is support in the library for capturing, processing and viewing video, and tools to help you create your vision algorithms. For more information about OpenCV see https://opencv.org.
es_mx: **OpenCV** es una biblioteca de visión de ordenador de código abierto que se utiliza ampliamente en todo el mundo académico y la industria. Cuenta con el apoyo de los fabricantes de hardware que proporcionan procesamiento acelerado en la GPU, tiene enlaces para varios lenguajes incluyendo C++, Java y Python. También está bien documentado con muchos sitios web, libros, vídeos y cursos de formación, por lo que hay muchos recursos disponibles para ayudar a aprender a usarla. Las versiones C++ y Java de WPILib incluyen las bibliotecas de OpenCV, hay apoyo en la biblioteca para la captura, procesamiento y para mostrar video, y herramientas para ayudarte a crear tus algoritmos de visión. Para obtener más información sobre OpenCV, ver https://opencv.org.
fr_ca: **OpenCV** est une librairie de vision par ordinateur de type open-source largement utilisée dans le monde universitaire et l'industrie. Elle est supportée par les fabricants de matériel fournissant un traitement accéléré par GPU, et dispose de liens pour un certain nombre de langages, notamment C++, Java et Python. Elle est également bien documentée avec de nombreux sites Web, livres, vidéos et cours de formation Il existe donc de nombreuses ressources disponibles pour vous aider à apprendre à l'utiliser. Les versions C++ et Java de WPILib incluent les librairies OpenCV, celle-ci se charge de la capture, du traitement et de la visualisation de vidéos et comprend des outils pour vous aider à créer vos algorithmes de vision. Pour plus d'informations sur OpenCV, consultez https://opencv.org.
tr_tr: ** OpenCV **, akademi ve endüstri genelinde yaygın olarak kullanılan açık kaynaklı bir bilgisayar görüntü kitaplığıdır. GPU hızlandırmalı işleme sağlayan donanım üreticilerinden destek alır, C ++, Java ve Python dahil olmak üzere bir dizi dil için bağlantıları vardır. Ayrıca birçok web sitesi, kitap, video ve eğitim kursları ile iyi bir şekilde belgelenmiştir, bu nedenle nasıl kullanılacağını öğrenmenize yardımcı olacak birçok kaynak vardır. WPILib'in C ++ ve Java sürümleri OpenCV kitaplıklarını içerir, kitaplıkta video yakalama, işleme ve görüntüleme desteği ve vizyon algoritmalarınızı oluşturmanıza yardımcı olacak araçlar vardır. OpenCV hakkında daha fazla bilgi için bkz. https://opencv.org.
zh_cn: **OpenCV**是一个计算机视觉软件库，在学术界和工业界广泛使用。它有来自硬件制造商的支持，提供GPU加速处理，它绑定多种语言，包括c++， Java，和Python。它还在许多web站点、书籍、视频和培训课程有详细的文档，因此有许多可用资源来帮助学习如何使用它。c++和WPILib Java版本都包含有OpenCV库，可提供捕获、处理和查看的视频，以及帮助创建视觉算法的工具。有关OpenCV的更多信息，请参见 https://opencv.org。

source: Vision Code on roboRIO
es_mx: Código de visión en roboRIO
fr_ca: Vision Code sur roboRIO
tr_tr: RoboRIO'da Görüntü Kodu
zh_cn: 在roboRIO上运行视觉代码

source: The chain from a USB Webcam to roboRIO to Ethernet Switch over a video stream to the driver station computer.
fr_ca: La chaîne partant d’une webcam USB puis au roboRIO et à un commutateur Ethernet sur un flux vidéo à l’ordinateur contenant l'application driver station.

source: Vision code can be embedded into the main robot program on the roboRIO. Building and running the vision code is straightforward because it is built and deployed along with the robot program. The vision code can be written by hand or generated by GRIP in either C++ or Java. The disadvantage of this approach is that having vision code running on the same processor as the robot program can cause performance issues. This is something you will have to evaluate depending on the requirements for your robot and vision program.
es_mx: El código de visión puede ser incrustado en el programa principal del robot en el roboRIO. Hacer y ejecutar el código de visión es sencillo porque está construido y desplegado junto con el programa de robots. El código de la visión puede ser escrito a mano o generado por GRIP en C++ o Java. La desventaja de este enfoque es que al tener el código de visión corriendo en el mismo como el programa del robot puede causar problemas de rendimiento. Esto es algo que tienen que evaluar dependiendo de los requisitos de su robot y programa de visión.
fr_ca: Le code de vision peut être intégré au programme principal du robot sur le roboRIO. Construire et exécuter le code de vision est simple car il est construit et déployé avec le programme du robot. Le code de vision peut être écrit à la main ou généré par GRIP en C++ ou Java. L'inconvénient de cette approche est que le fait d'avoir un code de vision s'exécutant sur le même processeur que le programme du robot peut entraîner des problèmes de performances. C'est quelque chose que vous devrez évaluer en fonction des exigences de votre programme de robot et de vision.
tr_tr: Görüntü kodu, roboRIO'daki ana robot programına yerleştirilebilir. Görüntü kodu oluşturmak ve çalıştırmak basittir çünkü robot programıyla birlikte oluşturulup devreye alınır. Görüntü kodu elle yazılabilir veya GRIP tarafından C ++ veya Java'da oluşturulabilir. Bu yaklaşımın dezavantajı, robot programıyla aynı işlemci üzerinde çalışan görüntü kodunun performans sorunlarına neden olabilmesidir. Bu, robotunuzun ve görsel denetim programınızın gereksinimlerine bağlı olarak değerlendirmeniz gereken bir şeydir.
zh_cn: 视觉代码可以嵌入到roboRIO的主机器人程序中。构建和运行视觉代码非常直接，因为它是与机器人程序一起构建和部署的。视觉代码可以手动编写，也可以由GRIP使用c++或Java生成。这种方法的缺点是将视觉代码运行在与机器人程序相同的处理器上可能会导致性能问题。你需要根据你的机器人和视觉程序的要求来进行评估。

source: In this approach, the vision code simply produces results that the robot code directly uses. Be careful about synchronization issues when writing robot code that is getting values from a vision thread. The GRIP generated code and the VisionRunner class in WPILib make this easier.
es_mx: En este enfoque, el código de visión simplemente produce resultados que el código del robot utiliza directamente. Tenga cuidado con los problemas de sincronización cuando escriba el código de robot que esté obteniendo valores de un hilo de visión. El código generado por el GRIP y la clase VisionRunner en WPILib hacen que este sea más fácil.
fr_ca: Dans cette approche, le code de vision produit simplement des résultats que le code du robot utilise directement. Cependant, faites attention aux problèmes de synchronisation lorsque vous écrivez du code pour votre robot qui obtient des valeurs à partir d'un thread de vision. Le code généré par GRIP et la classe VisionRunner dans WPILib facilitent cela.
tr_tr: Bu yaklaşımda, görüş kodu basitçe robot kodunun doğrudan kullandığı sonuçları üretir. Bir vizyon dizisinden değerler alan robot kodunu yazarken senkronizasyon sorunlarına dikkat edin. GRIP tarafından üretilen kod ve WPILib'deki VisionRunner sınıfı bunu kolaylaştırır.
zh_cn: 在这种方法中，视觉代码可以简单的输出机器人代码能够直接使用的结果。在编写机器人代码的时候，如果从视觉线程取值时，要小心同步问题。GRIP生成的代码和WPILib中的VisionRunner都可使这一点更容易实现。

source: Using functions provided by the CameraServer class, the video stream can be sent to dashboards such as Shuffleboard so operators can see what the camera sees. In addition, annotations can be added to the images using OpenCV commands so targets or other interesting objects can be identified in the dashboard view.
es_mx: Utilizando las funciones proporcionadas por la clase CameraServer, el flujo de vídeo puede ser enviado a tableros como el Shuffleboard para que los operadores puedan ver lo que la cámara ve. Además, se pueden agregar anotaciones a las imágenes usando comandos OpenCV para que los objetivos u otros interesantes, los objetos pueden ser identificados en la vista del tablero.
fr_ca: En utilisant les fonctions fournies par la classe CameraServer, le flux vidéo peut être envoyé à des tableaux de bord tels que Shuffleboard afin que les opérateurs puissent voir ce que la caméra voit. De plus, des annotations peuvent être ajoutées aux images à l'aide des commandes OpenCV afin que les cibles ou autres objets intéressants puissent être identifiés dans la disposition du tableau de bord.
tr_tr: CameraServer sınıfı tarafından sağlanan işlevleri kullanarak, video akışı Shuffleboard gibi gösterge tablolarına gönderilebilir, böylece operatörler kameranın gördüklerini görebilir. Ek olarak, OpenCV komutları bilgi görüntülere eklenebilir, böylece hedefler veya diğer ilginç nesneler gösterge tablosu görünümünde tanımlanabilir.
zh_cn: 使用CameraServer类提供的函数，视频流可以发送到仪表盘，比如Shuffleboard，这样操作手就可以看到摄像头看到的内容。此外，可以使用OpenCV命令将注释添加到图像中，以便在仪表盘视图中识别目标或其他感兴趣的对象。

source: Vision Code on DS Computer
es_mx: Código de visión en computadora DS
fr_ca: Code de vision sur ordinateur DS
tr_tr: DS Bilgisayarda Görüntü Kodu
zh_cn: DS计算机上的视觉代码

source: Same as the above diagram but the Driver Station computer must process that video and send NetworkTables updates back to the roboRIO.
fr_ca: Identique au diagramme ci-dessus, mais l’ordinateur contenant l'application Driver station doit traiter cette vidéo et renvoyer les mises à jour NetworkTables au roboRIO.

source: When vision code is running on the DS computer, the video is streamed back to the Driver Station laptop for processing. Even the older Classmate laptops are substantially faster at vision processing than the roboRIO. GRIP can be run on the Driver Station laptop directly with the results sent back to the robot using NetworkTables. Alternatively you can write your own vision program using a language of your choosing. Python makes a good choice since there is a native NetworkTables implementation and the OpenCV bindings are very good.
es_mx: Cuando el código de visión se ejecuta en el ordenador DS, el vídeo se transmite de vuelta a la Estación portátil para el procesamiento. Incluso las computadoras viejas son sustancialmente más rápidas en el procesamiento de la visión que el roboRIO. GRIP puede ser ejecutado en el portátil de la Estación de Control directamente con los resultados enviados al robot usando las Tablas de Red. Alternativamente usted puede escribir su propio programa de visión usando un lenguaje de su elección. Python es una buena elección ya que hay una implementación nativa de las Tablas de Red y los enlaces de OpenCV son muy buenos.
fr_ca: Lorsque le code de vision est exécuté sur l'ordinateur principal (Driver Station), la vidéo est retransmise vers cet ordinateur portable pour traitement. Même les vieux ordinateurs portables de type Classmate sont sensiblement plus rapides pour traiter le flux de vision que le roboRIO. GRIP peut être exécuté directement sur l'ordinateur portable, et les résultats renvoyés au robot à l'aide de NetworkTables. Alternativement, vous pouvez écrire votre propre programme de vision en utilisant le langage de programmation de votre choix. Python est un bon candidat, car il supporte une implémentation native de NetworkTables et les liens OpenCV sont très bons.
tr_tr: DS bilgisayarında görüntü kodu çalışırken, video işlenmek üzere Driver Station dizüstü bilgisayarına geri gönderilir. Daha eski Classmate dizüstü bilgisayarlar bile görüntü işlemede roboRIO'dan önemli ölçüde daha hızlıdır. GRIP, sonuçların NetworkTables kullanılarak robota geri gönderilmesiyle doğrudan Driver Station dizüstü bilgisayarında çalıştırılabilir. Alternatif olarak, seçtiğiniz bir dili kullanarak kendi vizyon programınızı yazabilirsiniz. Python, yerel bir NetworkTables uygulaması olduğu ve OpenCV bağları çok iyi olduğu için iyi bir seçim yapar.
zh_cn: 当视觉代码在DS计算机上运行时，视频流回操控站笔记本电脑进行处理。即使是老版本的Classmate笔记本电脑在视觉处理方面也比roboRIO快得多。GRIP可以在操控站的笔记本电脑上直接运行，并将结果通过网络表格发送回机器人。或者，你可以用你选择的语言编写自己的视觉程序。Python是一个很好的选择，因为它可在本地的NetworkTables中进行，而且OpenCV绑定非常好。

source: After the images are processed, the key values such as the target position, distance or anything else you need can be sent back to the robot with NetworkTables. This approach generally has higher latency, as delay is added due to the images needing to be sent to the laptop. Bandwidth limitations also limit the maximum resolution and FPS of the images used for processing.
es_mx: Después de que las imágenes sean procesadas, los valores clave como la posición del objetivo, la distancia o cualquier otra cosa que necesite pueden ser enviados de vuelta al robot con NetworkTables. Este enfoque generalmente tiene una mayor latencia, ya que se añade un retraso debido a que las imágenes necesitan ser enviadas al portátil. Las limitaciones del ancho de banda también limitan la resolución máxima y el FPS de las imágenes sean utilizadas para el procesamiento.
fr_ca: Une fois les images traitées, les valeurs clés telles que la position cible, la distance ou tout autre élément dont vous avez besoin peuvent être renvoyées au robot avec NetworkTables. Cette approche a généralement une latence plus élevée, car un délai est ajouté en raison des images devant être envoyées à l'ordinateur portable. Les limitations de bande passante limitent également la résolution maximale et le FPS des images utilisées pour le traitement.
tr_tr: Görüntüler işlendikten sonra, hedef konum, mesafe veya ihtiyacınız olan herhangi bir şey gibi anahtar değerler, NetworkTables ile robota geri gönderilebilir. Görüntülerin dizüstü bilgisayara gönderilmesi gerektiğinden gecikme eklendiğinden, bu yaklaşım genellikle daha yüksek gecikmeye sahiptir. Bant genişliği sınırlamaları ayrıca işleme için kullanılan görüntülerin maksimum çözünürlüğünü ve FPS'sini de sınırlar.
zh_cn: 图像处理后，关键值，如目标位置、距离或任何您需要的东西，可以通过网络表格发送回机器人。这种方法通常具有较高的延迟，因为需要将图像发送到笔记本电脑会增加延迟。带宽的限制也限制了用于处理的图像的最大分辨率和FPS。

source: The video stream can be displayed on Shuffleboard or in GRIP.
es_mx: El stream de video puede desplegarse en el tablero de conexión o en el GRIP.
fr_ca: Le flux vidéo peut être affiché sur Shuffleboard ou dans GRIP.
tr_tr: Video akışı Shuffleboard'da veya GRIP'te görüntülenebilir.
zh_cn: 视频流可以在Shuffleboard或GRIP上显示。

source: Vision Code on Coprocessor
es_mx: Código de video en coprocesador
fr_ca: Code de vision sur coprocesseur
tr_tr: Yardımcı İşlemcide Görüntü Kodu
zh_cn: 协处理器上的视觉代码

source: Coprocessor is on same network as the roboRIO so it off loads the compute without having the latency of going to the Driver Station and back.
fr_ca: Le coprocesseur est sur le même réseau que le roboRIO, il charge donc le calcul sans avoir la latence d’aller à l'application Driver Station station et en revenir.

source: Coprocessors such as the Raspberry Pi are ideal for supporting vision code (see :ref:`docs/software/vision-processing/wpilibpi/using-the-raspberry-pi-for-frc:Using the Raspberry Pi for FRC`). The advantage is that they can run full speed and not interfere with the robot program. In this case, the camera is probably connected to the coprocessor or (in the case of Ethernet cameras) an Ethernet switch on the robot. The program can be written in any language; Python is a good choice because of its simple bindings to OpenCV and NetworkTables. Some teams have used high performance vision coprocessors such as the Nvidia Jetson for fastest speed and highest resolution, although this approach generally requires advanced Linux and programming knowledge.
es_mx: Los coprocesadores como el Pi de Raspberry son ideales para apoyar el código de visión (ver :ref:`docs/software/vision-processing/frcvision/using-the-raspberry-pi-for-frc:Using the Raspberry Pi for FRC`). La ventaja es que pueden correr a toda velocidad y no interferir con el programa de robots. En este caso, la cámara está probablemente conectada al coprocesador o (en el caso de las cámaras Ethernet) un interruptor Ethernet en el robot. El programa puede ser escrito en cualquier idioma; Python es una buena elección por su simple unión a OpenCV y NetworkTables. Algunos equipos han utilizado coprocesadores de visión de alto rendimiento como el Nvidia Jetson para una mayor velocidad y resolución, aunque este enfoque generalmente requiere conocimientos avanzados de Linux y de programación.
fr_ca: Les coprocesseurs tels que le Raspberry Pi sont idéaux pour prendre en charge le code de vision (voir :ref:`docs/software/vision-processing/wpilibpi/using-the-raspberry-pi-for-frc:Using the Raspberry Pi for FRC`). L’avantage est qu’ils peuvent fonctionner à pleine vitesse et ne pas interférer avec le programme du robot. Dans ce cas, la caméra est probablement connectée au coprocesseur ou (dans le cas des caméras Ethernet) à un interrupteur Ethernet sur le robot. Le programme peut être écrit dans n’importe quelle langage; Python est un bon choix en raison de ses liaisons simples à OpenCV et NetworkTables. Certaines équipes ont utilisé des coprocesseurs de vision haute performance tels que le Nvidia Jetson pour sa vitesse très rapide et sa plus haute résolution, bien que cette approche nécessite généralement des connaissances avancées sur Linux et en programmation.
tr_tr: Raspberry Pi gibi yardımcı işlemciler, görüntü kodunu desteklemek için idealdir (bkz: ref: `docs / software / vision-processing / wpilibpi / using-the-raspberry-pi-for-frc: Raspberry Pi for FRC`). Avantajı, tam hızda çalışabilmeleri ve robot programına müdahale etmemeleridir. Bu durumda, kamera muhtemelen yardımcı işlemciye veya (Ethernet kameraları olması durumunda) robot üzerindeki bir Ethernet anahtarına bağlıdır. Program herhangi bir dilde yazılabilir; Python, OpenCV ve NetworkTables'a olan basit bağlantıları nedeniyle iyi bir seçimdir. Bazı ekipler, en yüksek hız ve en yüksek çözünürlük için Nvidia Jetson gibi yüksek performanslı görüntü yardımcı işlemcileri kullandı, ancak bu yaklaşım genellikle gelişmiş Linux ve programlama bilgisi gerektiriyor.
zh_cn: 像Raspberry Pi这样的协处理器是支持视觉代码的理想选择(参见:ref: ' docs/software/vision-processing/frcvision/ using-raspberry - pie -for- FRC:Using the Raspberry Pi for FRC ')。优点是它们可以全速运行，不干扰机器人程序。在这种情况下，摄像机可能连接到协处理器，或者(对于以太网摄像机来说)机器人上的一个以太网开关。该程序可以用任何语言编写;Python是一个很好的选择，因为它可以简单地绑定到OpenCV和NetworkTables。一些团队使用高性能的视觉协同处理器，如Nvidia Jetson，以获得最快的速度和最高的分辨率，尽管这种方法通常需要高级的Linux和编程知识。
