Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/introduction/target-info-and-retroreflection.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Target Info and Retroreflection
es_mx: Información del objetivo y retrorreflexión
fr_ca: Informations sur la cible et rétroréflexion
tr_tr: Hedef Bilgisi ve Geri Yansıma
zh_cn: 目标信息和反射

source: Many FRC\ |reg| games have retroreflective tape attached to field elements to aid in vision processing. This document describes the Vision Targets from the 2016 FRC game and the visual properties of the material making up the targets.
es_mx: Muchos juegos de FRC\ |reg| tienen cinta retrorreflectante adherida a los elementos del campo para ayudar en el procesamiento de la visión. Este documento describe los objetivos de visión del juego de FRC 2016 y la propiedades del material que compone los objetivos.
fr_ca: Beaucoup de jeux FRC\ |reg| ont un ruban rétroréfléchissant attaché aux éléments de terrain pour aider dans le traitement de vision. Ce document décrit les cibles utilisée en vision dans le jeu FRC 2016 et les propriétés visuelles du matériau dont sont consituées ces cibles.
tr_tr: Birçok FRC \ |reg| oyunlarda, görüş işlemeye yardımcı olmak için alan öğelerine tutturulmuş retroreflektif bant bulunur. Bu belge 2016 FRC oyunundaki Vizyon Hedeflerini ve hedefleri oluşturan malzemenin görsel özelliklerini açıklamaktadır.
zh_cn: 许多FRC \ | reg |游戏在场元素上贴有反光带，以帮助视觉处理。本文档介绍了2016 FRC游戏中的视觉目标以及构成目标的材料的视觉属性。

source: For official dimensions and drawings of all field components, please see the Official Field Drawings.
es_mx: Para las dimensiones oficiales y los dibujos de todos los componentes del campo, por favor vea los Dibujos Oficiales del Campo.
fr_ca: Pour les dimensions officielles et les dessins de tous les composants sur le terrain, veuillez consulter les Dessins Officiels du Terrain.
tr_tr: Tüm saha bileşenlerinin resmi boyutları ve çizimleri için lütfen Resmi Saha Çizimlerine-Official Field Drawings bakın.
zh_cn: 有关所有现场组件的正式尺寸和图纸，请参阅官方现场图纸。

source: Targets
es_mx: Objetivos
fr_ca: Cibles
tr_tr: Hedefler
zh_cn: 目标

source: Game manual picture of the 2016 game tower and it's retroreflective tape targets.
fr_ca: Image du manuel de jeu de la tour de jeu 2016 et des bandes rétroréfléchissantes de ses cibles.

source: Low brightness picture of the same tower with illuminated retroreflective tape.
fr_ca: Image à faible luminosité de la même tour avec du ruban rétroréfléchissant illuminé.

source: Each 2016 vision target consists of a 1' 8" wide, 1' tall U-shape made of 2" wide retroreflective material (3M 8830 Silver Marking Film). The targets are located immediately adjacent to the bottom of each high goal. When properly lit, the retroreflective tape produces a bright and/or color-saturated marker.
es_mx: Cada objetivo de visión de 2016 consiste en una forma de U de 1' 8" de ancho y 1' de alto hecha de un retrorreflector de 2" de ancho (3M 8830 Silver Marking Film). Los objetivos están localizados inmediatamente adyacentes a la parte inferior de cada meta alta. Cuando está bien iluminada, la cinta retrorreflectante produce un brillante y/o marcador de color saturado.
fr_ca: Chaque cible de vision pour la saison 2016 consistait en un U de 1′ 8″ de largeur et 1′ de hauteur fabriqué avec un matériau rétroréfléchissant de 2″ de largeur (3M 8830 Silver Marking Film). Les cibles sont situées adjacentes au bas de chaque but. Lorsqu'elles sont correctement éclairées, les bandes rétroréfléchissantes produisent un marquage lumineux et/ou saturé de couleur.
tr_tr: Her bir 2016 vizyon hedefi, 2" genişliğinde retroreflektif malzemeden (3M 8830 Silver Marking Film) yapılmış 1 '8" genişliğinde, 1' yüksekliğinde U şeklinden oluşur. Hedefler, her yüksek hedefin hemen dibine bitişik konumlandırılmıştır. Gerektiği gibi aydınlatıldığında, retroreflektif bant parlak ve/veya renge doymuş bir işaret üretir.
zh_cn: 每个2016年的视觉目标均由1英寸8英寸宽，1英寸高的U形组成，该U形由2英寸宽的逆向反射材料（3M 8830银标膜）制成。目标位于紧邻每个高目标底部的位置。当正确照明时，逆向反射带会产生明亮和/或颜色饱和的标记。

source: Retroreflectivity vs. Reflectivity
es_mx: Retrorreflectividad vs Reflectividad
fr_ca: Rétroréflectivité vs réflectivité
tr_tr: Retroreflektivite ve Reflektiflik
zh_cn: 逆反射率与反射率

source: How light bounces off of retroreflective and reflective surfaces.
fr_ca: Comment la lumière rebondit sur les surfaces rétroréfléchissantes et réfléchissantes.

source: Highly reflective materials are generally mirrored so that light "bounces off" at a supplementary angle. As shown above-left, the blue and red angles sum to 180 degrees. An equivalent explanation is that the light reflects about the surface normal the green line drawn perpendicular to the surface. Notice that a light pointed at the surface will return to the light source only if the blue angle is ~90 degrees.
es_mx: Los materiales altamente reflectantes son generalmente reflejados para que la luz "rebote" en un ángulo suplementario. Como se muestra arriba a la izquierda, los ángulos azul y rojo suman 180 grados. Un equivalente explicativo es que la luz refleja sobre la superficie normal la línea verde dibujada perpendicularmente a la superficie. Noten que una luz apuntada a la superficie volverá a la fuente de luz sólo si el ángulo azul es de ~90 grados.
fr_ca: Les matériaux hautement réfléchissants sont généralement comme un miroir, de sorte que la lumière "rebondit" à un angle supplémentaire. Comme illustré ci-dessus à gauche, les angles bleu et rouge totalisent 180 degrés. Une explication similaire est que la lumière réfléchit sur la surface normale à la ligne verte tracée perpendiculairement à la surface. Notez qu'une lumière pointée vers la surface ne retournera à la source lumineuse que si l'angle bleu est de ~90 degrés.
tr_tr: Yüksek derecede yansıtıcı malzemeler genellikle, ışığın ek bir açıyla "yansıyacağı" şekilde aynalanır. Yukarıda solda gösterildiği gibi mavi ve kırmızı açıların toplamı 180 derecedir. Buna eşdeğer bir açıklama, ışığın yüzeye dik olarak çizilen yeşil çizgiyi normal yüzey etrafında yansıtmasıdır. Yüzeye doğrultulan bir ışığın, yalnızca mavi açı ~90 derece olduğunda ışık kaynağına döneceğine dikkat edin.
zh_cn: 高反射率的材料通常会成为镜像，以使光线以补充角度“反射”出去。如左上方所示，蓝色和红色角度总计为180度。一个等效的解释是，光线围绕表面法线反射垂直于该表面绘制的绿线。请注意，仅当蓝角约为90度时，指向表面的光才会返回光源。

source: Retro-reflective materials are not mirrored, but it will typically have either shiny facets across the surface, or it will have a pearl-like appearance. Not all faceted or pearl-like materials are retro-reflective, however. Retro-reflective materials return the majority of light back to the light source, and they do this for a wide range of angles between the surface and the light source, not just the 90 degree case. Retro-reflective materials accomplish this using small prisms, such as found on a bicycle or roadside reflector, or by using small spheres with the appropriate index of refraction that accomplish multiple internal reflections. In nature, the eyes of some animals, including house cats, also exhibit the retro-reflective effect typically referred to as night-shine. The `Wikipedia article on retroreflectors <https://en.wikipedia.org/wiki/Retroreflector>`_ goes into more detail on how retro-reflection is accomplished.
es_mx: Los materiales retro-reflectantes no son reflejados, pero típicamente tendrá facetas brillantes a través de la superficie, o tendrá una apariencia de perla. No todos los materiales facetados o perlados son retro-reflectantes, sin embargo. Los materiales retro-reflectantes devuelven la mayor parte de la luz a la fuente de luz, y lo hacen para un amplio rango de ángulos entre la superficie y la fuente, no sólo el caso de los 90 grados. Los materiales retro-reflectantes logran esto usando pequeñas prismas, como los que se encuentran en una bicicleta o un reflector de carretera, o utilizando pequeñas esferas con el índice de refracción apropiado que logran múltiples reflexiones internas. En la naturaleza los ojos de algunos animales, incluyendo los gatos domésticos, también exhiben el efecto retro-reflectante típico conocido como "Night Shine". `el articulo de Wikipedia con retroreflectores <https://en.wikipedia.org/wiki/Retroreflector>`_ entra en más detalles sobre cómo se logra la retro-reflexión.
fr_ca: Les matériaux rétroréfléchissants n'ont pas l'effet miroir, mais ils auront généralement soit des facettes brillantes sur la surface, soit un aspect perlé. Cependant, tous les matériaux à facettes ou ressemblant à des perles ne sont pas nécessairement rétroréfléchissants. Les matériaux rétroréfléchissants renvoient la majorité de la lumière à la source de lumière, et ils le font pour une large gamme d'angles entre la surface et la source de lumière, et non seulement les angles à 90 degrés. Les matériaux rétroréfléchissants accomplissent cela en utilisant de petits prismes, comme ceux trouvés sur un vélo ou un réflecteur en bordure de route, ou en utilisant de petites sphères avec l'indice de réfraction approprié qui accomplissent de multiples réflexions internes. Dans la nature, les yeux de certains animaux, y compris les chats domestiques, présentent également l'effet rétro-réfléchissant généralement appelé éclat nocturne. L'article `Wikipedia sur les rétroréflecteurs <https://en.wikipedia.org/wiki/Retroreflector>`_ va plus en détail sur la façon dont la rétro-réflexion est accomplie.
tr_tr: Retro-yansıtıcı malzemeler yansıtılmaz, ancak tipik olarak ya yüzey boyunca parlak yüzlere sahip olacak ya da inci benzeri bir görünüme sahip olacaktır. Bununla birlikte, tüm yüzeyli veya inci benzeri malzemeler retro yansıtıcı değildir. Retro-yansıtıcı malzemeler ışığın çoğunu ışık kaynağına geri döndürür ve bunu sadece 90 derecelik değil, yüzey ve ışık kaynağı arasındaki geniş bir açı aralığı için yaparlar. Geriye dönük yansıtıcı malzemeler bunu, bir bisiklet veya yol kenarı reflektöründe bulunanlar gibi küçük prizmalar kullanarak veya birden fazla iç yansımayı gerçekleştiren uygun kırılma indisine sahip küçük küreler kullanarak gerçekleştirir. Doğada, ev kedileri de dahil olmak üzere bazı hayvanların gözleri de tipik olarak gece parlaması olarak adlandırılan retro-reflektif etkiyi sergiler. `Wikipedia article on retroreflectors <https://en.wikipedia.org/wiki/Retroreflector>`_ retroreflektörlerle ilgili Wikipedia makalesi, retro-yansımanın nasıl gerçekleştirildiğine dair daha fazla ayrıntıya giriyor.
zh_cn: 逆反射材料没有镜面，但通常在整个表面上都具有光泽的小平面，或者具有类似珍珠的外观。但是，并非所有刻面或类似珍珠的材料都具有逆向反射性。逆向反射材料将大部分光返回光源，并且它们在表面和光源之间的角度范围很广的情况下进行反射，而不仅仅是在90度的情况下。后向反射材料使用小棱镜，例如在自行车或路边反射镜上找到的棱镜或通过使用具有适当折射率的小球体来实现此目的，这些小球体可以实现多次内部反射。在自然界中，某些动物，包括家猫的眼睛也表现出通常被称为夜光的逆反射效果。维基百科上有关后向反射器<https://en.wikipedia.org/wiki/Retroreflector>的文章详细介绍了如何实现逆向反射。

source: Examples of Retroreflection
es_mx: Ejemplos de retrorreflexión
fr_ca: Exemples de rétroréflexion
tr_tr: Retroreflection örnekleri
zh_cn: 反射示例

source: Center line divider retroreflective markers on the road.
fr_ca: Marqueurs rétroréfléchissants du diviseur de ligne centrale sur la route.

source: A retroreflective work vest.
fr_ca: Un gilet de travail rétroréfléchissant.

source: This material should be relatively familiar as it is often used to enhance nighttime visibility of road signs, bicycles, and pedestrians.
es_mx: Este material debería ser relativamente familiar ya que se utiliza con frecuencia para mejorar la visibilidad nocturna, señales de tráfico, bicicletas y peatones.
fr_ca: Ce matériau est relativement familier, car il est souvent utilisé pour améliorer la visibilité nocturne des panneaux de signalisation, des vélos et des piétons.
tr_tr: Bu malzeme, genellikle yol işaretlerinin, bisikletlerin ve yayaların gece görünürlüğünü artırmak için kullanıldığından, nispeten tanıdık olmalıdır.
zh_cn: 该材料应该相对熟悉，因为它通常用于增强道路标志，自行车和行人的夜间可见性。

source: Initially, retro-reflection may not seem like a useful property for nighttime safety, but when the light and eye are near one another, as shown above, the reflected light returns to the eye, and the material shines brightly even at large distances. Due to the small angle between the driver’s eyes and vehicle headlights, retro-reflective materials can greatly increase visibility of distant objects during nighttime driving.
es_mx: Inicialmente, la retro-reflexión puede no parecer una propiedad útil para la seguridad nocturna, pero cuando la luz y el ojo están cerca el uno del otro, como se muestra arriba, la luz reflejada regresa al ojo, y el material brilla intensamente incluso a grandes distancias. Debido al pequeño ángulo entre los ojos del conductor y los faros del vehículo, los materiales retro-reflectantes pueden aumentar mucho la visibilidad de objetos distantes durante la conducción nocturna.
fr_ca: Initialement, la rétroréflexion peut ne pas sembler être une propriété utile pour la sécurité nocturne, mais lorsque la lumière et l'œil sont proches l'un de l'autre, comme illustré ci-dessus, la lumière réfléchie retourne vers l'œil et le matériau brille intensément, même à grande distance. En raison du petit angle entre les yeux du conducteur et les phares du véhicule, les matériaux rétroréfléchissants peuvent augmenter considérablement la visibilité des objets distants pendant la conduite de nuit.
tr_tr: Başlangıçta retro-reflection karanlık güvenliği için kullanışlı bir özellik gibi görünmeyebilir, ancak yukarıda gösterildiği gibi ışık ve göz birbirine yakın olduğunda, yansıyan ışık göze geri döner ve malzeme büyük mesafelerde bile parlak bir şekilde parlar. Sürücünün gözleri ile araç farları arasındaki küçük açı nedeniyle, geri yansıtıcı malzemeler gece sürüşü sırasında uzaktaki nesnelerin görünürlüğünü büyük ölçüde artırabilir.
zh_cn: 最初，反射似乎对于夜间安全而言似乎不是有用的属性，但是，如上所示，当光线和眼睛彼此靠近时，反射光会返回到眼睛，并且即使在很远的距离处，该材料也明亮地发光。由于驾驶员的眼睛与车辆前灯之间的夹角较小，因此夜间使用时，逆反射材料可以大大提高远处物体的可见度。

source: Demonstration
es_mx: Demostración
fr_ca: Démonstration
tr_tr: Gösteri
zh_cn: 示范

source: To further explore retro-reflective material properties:
es_mx: Para explorar más a fondo las propiedades de los materiales retro-reflectantes:
fr_ca: Pour explorer davantage les propriétés des matériaux rétroréfléchissants:
tr_tr: Retro-reflective malzeme özelliklerini daha fazla keşfetmek için:
zh_cn: 为了进一步探索反射材料的特性：

source: Place a piece of the material on a wall or vertical surface
es_mx: Coloca un trozo del material en una pared o superficie vertical
fr_ca: Placer un morceau du matériau sur un mur ou une surface verticale
tr_tr: Malzemenin bir parçasını duvara veya dikey bir yüzeye yerleştirin
zh_cn: 将一块材料放在墙壁或垂直表面上

source: Stand 10-20 feet away, and shine a small flashlight at the material.
es_mx: Párese a 10-20 pies de distancia y apunte una pequeña linterna al material.
fr_ca: Tenez-vous à 10-20 pieds (3 -6 mètres) de distance et braquez une petite lampe de poche sur le matériau.
tr_tr: 10-20 fit uzakta durun ve malzemeye küçük bir el feneri tutun.
zh_cn: 站在10-20英尺远的地方，并用小手电筒照亮材料。

source: Start with the light held at your belly button, and raise it slowly until it is between your eyes. As the light nears your eyes, the intensity of the returned light will increase rapidly.
es_mx: Empieza con la luz sostenida en tu ombligo, y levántala lentamente hasta que esté entre tus ojos. A medida que la luz se acerca a los ojos, la intensidad de la luz devuelta aumentará rápidamente
fr_ca: Commencez par la lumière tenue au niveau de votre ceinture et levez-la lentement jusqu'à ce qu'elle soit au niveau de vos yeux. Lorsque la lumière se rapproche de vos yeux, l'intensité de la lumière renvoyée augmente rapidement.
tr_tr: Göbek seviyenizde tutulan ışıkla başlayın ve gözünüzün arasına gelene kadar yavaşça kaldırın. Işık gözlerinize yaklaştıkça, geri dönen ışığın yoğunluğu hızla artacaktır.
zh_cn: 从腹部按钮处的灯光开始，然后慢慢抬起直到两眼之间。随着光线靠近您的眼睛，返回的光线强度将迅速增加。

source: Alter the angle by moving to other locations in the room and repeating. The bright reflection should occur over a wide range of viewing angles, but the angle from light source to eye is key and must be quite small.
es_mx: Altere el ángulo moviéndose a otros lugares de la sala y repitiendo. La brillante reflexión debe ocurrir en una amplia gama de ángulos de visión, pero el ángulo de la luz la fuente a ojo es clave y debe ser bastante pequeña.
fr_ca: Modifiez l'angle en vous déplaçant vers d'autres endroits de la pièce et en répétant. La réflexion lumineuse doit se produire sur une large gamme d'angles de vision, mais l'angle entre la source lumineuse et l'œil est la clé du succès, et doit être assez petit.
tr_tr: Odadaki diğer yerlere gidip tekrarlayarak açıyı değiştirin. Parlak yansıma geniş bir bakış açısı aralığında gerçekleşmelidir, ancak ışık kaynağından göze olan açı önemlidir ve oldukça küçük olmalıdır.
zh_cn: 通过移至房间中的其他位置并重复来更改角度。明亮的反射应该在很大的视角范围内发生，但是从光源到眼睛的角度是关键，并且必须很小。

source: Experiment with different light sources. The material is hundreds of times more reflective than white paint; so dim light sources will work fine. For example, a red bicycle safety light will demonstrate that the color of the light source determines the color of the reflected light. If possible, position several team members at different locations, each with their own light source. This will show that the effects are largely independent, and the material can simultaneously appear different colors to various team members. This also demonstrates that the material is largely immune to environmental lighting. The light returning to the viewer is almost entirely determined by a light source they control or one directly behind them. Using the flashlight, identify other retro-reflective articles already in your environment: on clothing, backpacks, shoes, etc.
es_mx: Experimentar con diferentes fuentes de luz. El material es cientos de veces más reflectante que la pintura blanca; así que las fuentes de luz tenue funcionarán bien. Por ejemplo, una luz roja de seguridad para bicicletas demostrará que el color de la fuente de luz determina el color de la luz reflejada. Si es posible, coloque varios miembros del equipo en diferentes lugares, cada uno con su propia luz fuente. Esto demostrará que los efectos son en gran medida independientes, y el material puede aparecer simultáneamente de diferentes colores a varios miembros del equipo. Esto también demuestra que el material es en gran parte inmune a la iluminación ambiental. La luz que regresa al espectador es casi enteramente determinada por una fuente de luz que controlan o una directamente detrás de ellos. Usando una linterna, identifique otros artículos retro-reflectantes que ya estén en su entorno: en la ropa, mochilas, zapatos, etc.
fr_ca: Expérimentez avec différentes sources de lumière. Le matériau est des centaines de fois plus réfléchissant que la peinture blanche; les sources lumineuses faibles fonctionneront donc bien. Par exemple, un feu de sécurité de vélo rouge démontrera que la couleur de la source de lumière détermine la couleur de la lumière réfléchie. Si possible, placez plusieurs membres de l'équipe à différents endroits, chacun avec sa propre source de lumière. Cela montrera que les effets sont largement indépendants et que le matériau peut apparaître simultanément de différentes couleurs aux différents membres de l'équipe. Cela démontre également que le matériau est largement insensible à l'éclairage ambiant. La lumière renvoyée au membres de l'équipe est presque entièrement déterminée par une source lumineuse qu'ils contrôlent ou une située directement derrière eux. À l'aide de la lampe de poche, identifiez d'autres articles rétroréfléchissants déjà dans votre environnement: soit sur les vêtements, sacs à dos, chaussures, etc.
tr_tr: Farklı ışık kaynakları ile deneyler yapın. Malzeme, beyaz boyadan yüzlerce kat daha yansıtıcıdır; bu nedenle loş ışık kaynakları iyi çalışacaktır. Örneğin, kırmızı bir bisiklet güvenlik ışığı, ışık kaynağının renginin yansıyan ışığın rengini belirlediğini gösterecektir. Mümkünse, her biri kendi ışık kaynağına sahip birkaç ekip üyesini farklı konumlara yerleştirin. Bu, efektlerin büyük ölçüde bağımsız olduğunu ve malzemenin aynı anda çeşitli ekip üyelerine farklı renklerde görünebileceğini gösterecektir. Bu aynı zamanda malzemenin çevresel aydınlatmaya büyük ölçüde bağlı olduğunu da gösterir. İzleyiciye dönen ışık neredeyse tamamen kontrol ettikleri bir ışık kaynağı tarafından veya doğrudan arkalarındaki bir ışık tarafından belirlenir. El fenerini kullanarak, halihazırda çevrenizde bulunan diğer reflektörlü eşyaları tanımlayın: giysiler, sırt çantaları, ayakkabılar vb.
zh_cn: 尝试使用不同的光源。这种材料的反射性是白色涂料的数百倍。因此昏暗的光源可以正常工作。例如，红色的自行车安全灯将表明光源的颜色决定了反射光的颜色。如果可能，将几个团队成员放置在不同的位置，每个位置都有自己的光源。这将表明效果在很大程度上是独立的，并且材质可以同时为各个团队成员显示不同的颜色。这也表明该材料在很大程度上不受环境光的影响。返回观察者的光几乎完全由他们控制的光源或直接在他们后面的光源决定。使用手电筒，确定环境中已经存在的其他反光物品：衣服，背包，鞋子等上的物品。

source: Lighting
es_mx: ILUMINACIÓN
fr_ca: Éclairage
tr_tr: Aydınlatma
zh_cn: 灯光

source: A green ring light around a camera.
fr_ca: Un anneau LED vert autour d’une caméra.

source: We have seen that the retro-reflective tape will not shine unless a light source is directed at it, and the light source must pass very near the camera lens or the observer’s eyes. While there are a number of ways to accomplish this, a very useful type of light source to investigate is the ring flash, or ring light, shown above. It places the light source directly on or around the camera lens and provides very even lighting. Because of their bright output and small size, LEDs are particularly useful for constructing this type of device.
es_mx: Hemos visto que la cinta retro-reflectante no brillará a menos que una fuente de luz se dirija a ella, y la fuente de luz debe pasar muy cerca de la lente de la cámara o de los ojos del observador. Mientras que allí son varias formas de lograrlo, un tipo de fuente de luz muy útil para investigar es el flash de anillo, o luz de anillo, que se muestra arriba. Coloque la fuente de luz directamente sobre o alrededor de la lente de la cámara y proporciona una iluminación muy uniforme. Debido a su brillante salida y pequeño tamaño, los LEDs son particularmente útiles para construir este tipo de dispositivo.
fr_ca: Nous avons vu que le ruban rétroréfléchissant ne brille seulement si une source de lumière est dirigée vers lui, et que la source de lumière doit passer très près de l'objectif de la caméra ou des yeux de l'observateur. Bien qu'il existe un certain nombre de façons d'accomplir cela, une source de lumière à considérer est le flash annulaire, ou anneau lumineux, illustré ci-dessus. Il place la source de lumière directement autour de l'objectif de la caméra et fournit un éclairage très uniforme. En raison de leur intensité lumineuse et de leur petite taille, les LED sont particulièrement utiles pour construire ce type d'appareil.
tr_tr: Retro-reflective bandın, kendisine bir ışık kaynağı yönlendirilmedikçe parlamayacağını ve ışık kaynağının kamera merceğinin veya gözlemcinin gözlerinin çok yakınından geçmesi gerektiğini gördük. Bunu başarmanın birkaç yolu olsa da, araştırılması gereken çok yararlı bir ışık kaynağı türü, yukarıda gösterilen halka flaş veya halka ışıktır. Işık kaynağını doğrudan kamera merceğinin üzerine veya çevresine yerleştirir ve çok eşit bir aydınlatma sağlar. Parlak çıktıları ve küçük boyutları nedeniyle, LED'ler özellikle bu tür bir cihazı oluşturmak için kullanışlıdır.
zh_cn: 我们已经看到，除非有光源指向，否则反光带将不会发光，并且光源必须非常靠近相机镜头或观察者的眼睛。尽管有多种方法可以实现此目的，但是要研究的一种非常有用的光源类型是上图所示的环形闪光灯。它将光源直接放在相机镜头上或镜头周围，并提供非常均匀的照明。由于其明亮的输出和较小的尺寸，LED对于构造这种类型的设备特别有用。
