Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/introduction/target-info-and-retroreflection.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: As shown above, inexpensive circular arrangements of LEDs are available in a variety of colors and sizes and are easy to attach to cameras, and some can even be powered off of a Raspberry Pi. While not designed for diffuse even lighting, they work quite well for causing retro-reflective tape to shine. A small green LED ring is available through FIRST Choice. Other similar LED rings are available from suppliers such as SuperBrightLEDs.
es_mx: Como se muestra arriba, se dispone de económicos arreglos circulares de LEDs en una variedad de colores y tamaños y son fáciles de acoplar a las cámaras, y algunas pueden incluso ser apagadas de un Raspberry Pi. Aunque no están diseñados para una iluminación difusa, funcionan bastante bien para causar cinta retro-reflectante para brillar. Un pequeño anillo de LED verde está disponible a través de FIRST Choice. Otros anillos LED similares están disponibles en proveedores como SuperBrightLEDs.
fr_ca: Comme indiqué ci-dessus, des anneaux lumineux peu coûteux de LED sont disponibles dans une variété de couleurs et de tailles et sont faciles à attacher aux caméras. Certains peuvent même être alimenté par l'entremise d'un Raspberry Pi. Bien qu'ils ne soient pas conçus pour un éclairage diffus et uniforme, ils fonctionnent assez bien pour faire briller le ruban rétroréfléchissant. Un petit anneau LED vert est disponible via FIRST Choice. D'autres anneaux LED similaires sont disponibles auprès de fournisseurs, sous la rubrique SuperBrightLED.
tr_tr: Yukarıda gösterildiği gibi, ucuz dairesel LED düzenlemeleri çeşitli renk ve boyutlarda mevcuttur ve kameralara takılması kolaydır ve hatta bazıları bir Raspberry Pi'den kapatılabilir. Dağınık eşit aydınlatma için tasarlanmamış olsalar da, retro-yansıtıcı bandın parlamasına neden olmak için oldukça iyi çalışırlar. FIRST Choice aracılığıyla küçük bir yeşil LED halka mevcuttur. Diğer benzer LED halkaları, SuperBrightLED'ler gibi tedarikçilerden temin edilebilir.
zh_cn: 如上所示，价格低廉的圆形LED可以提供各种颜色和尺寸，并且易于连接到相机，有些甚至可以通过Raspberry Pi断电。尽管不是为漫射均匀照明而设计，但它们可以很好地使逆反射胶带发光。可通过FIRST Choice获得一个小的绿色LED环。其他类似的LED环也可以从供应商处获得，例如SuperBrightLED。

source: Sample Images
es_mx: Imágenes de muestra
fr_ca: Exemples d'images
tr_tr: Örnek Görüntüler
zh_cn: 样本图片

source: Sample images are located with the code examples for each language (packaged with LabVIEW, and in a separate ZIP in the same location as the C++/Java samples).
es_mx: Las imágenes de muestra se encuentran con los ejemplos de código de cada idioma (empaquetadas con LabVIEW, y en un ZIP separado en el mismo lugar que las muestras de C++/Java).
fr_ca: Des exemples d'images sont fournies avec les exemples de code pour chaque langage de programmation (déjà inclus avec LabVIEW et pour Java et C++, dans un fichier ZIP).
tr_tr: Örnek görüntüler, her dil için kod örnekleriyle birlikte bulunur (LabVIEW ile paketlenmiştir ve C++ / Java örnekleriyle aynı konumda ayrı bir ZIP içinde).
zh_cn: 示例图像与每种语言的代码示例一起放置（与LabVIEW打包在一起，并在单独的ZIP中，与C ++ / Java示例位于相同的位置）。
