Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/introduction/what-*-vision.po
Languages: es_mx

source: What is Vision?
es_mx: ¿Qué es La Visión?

source: Vision in FRC\ |reg| uses a camera connected to the robot in order to help teams score and drive, during both the autonomous and teleoperated periods.
es_mx: Visión en FRC\ |reg| utiliza una cámara conectada al robot para ayudar a los equipos a anotar y conducir, tanto durante el período autónomo como el período teleoperado.

source: Vision Methods
es_mx: Métodos de visión

source: There are two main method that most teams use for vision in FRC.
es_mx: Hay dos métodos principales los cuales la mayoría de los equipos de FRC utilizan

source: This method involves streaming the camera to the Driver Station so that the driver and manipulator can get visual information from the robot's point of view. This method is simple and takes little time to implement, making it a good option if you do not need features of vision processing.
es_mx: Este método implica el envío de la cámara a la estación del conductor para que el conductor y el manipulador puedan obtener información visual desde el punto de vista del robot. Este método es simple y toma poco tiempo para implementarlo, lo que lo convierte en una buena opción si no se necesitan características del procesamiento de la visión.

source: :ref:`Streaming using the roboRIO <docs/software/vision-processing/roborio/using-the-cameraserver-on-the-roborio:Using the CameraServer on the roboRIO>`
es_mx: :ref:`Streaming utilizando la roboRIO <docs/software/vision-processing/roborio/using-the-cameraserver-on-the-roborio:Utilizando la CameraServer en la roboRIO>`

source: Processing
es_mx: Procesamiento

source: Instead of only streaming the camera to the Driver Station, this method involves using the frames captured by the camera to compute information, such as a game piece's or target's angle and distance from the camera. This method requires more technical knowledge and time in order to implement, as well as being more computationally expensive. However, this method can help improve autonomous performance and assist in "auto-scoring" operations during the teleoperated period. This method can be done using the roboRIO or a coprocessor such as the Raspberry Pi using either OpenCV or programs such as GRIP.
es_mx: En lugar de sólo transmitir la cámara a la Estación de Control, este método implica usar los cuadros capturados por la cámara para calcular información, como una pieza de juego o un objetivo ángulo y distancia de la cámara. Este método requiere más conocimientos técnicos y tiempo para implementarlo, además de ser más costoso computacionalmente. Sin embargo, este puede ayudar a mejorar el rendimiento autónomo y ayudar en las operaciones de "puntuación automática" durante el período de teleoperado. Este método puede hacerse usando el roboRIO o un coprocesador como el Raspberry Pi usando OpenCV o programas como GRIP.

source: :ref:`Vision Processing with Raspberry Pi <docs/software/vision-processing/wpilibpi/index:Vision with WPILibPi>`
es_mx: :ref:`Procesamiento de Visión con Raspberry Pi <docs/software/vision-processing/wpilibpi/index:Vision with WPILibPi>`

source: :ref:`Vision Processing with GRIP <docs/software/vision-processing/grip/index:Vision with GRIP>`
es_mx: :ref:`Procesamiento de visión GRIP <docs/software/vision-processing/grip/index:Vision with GRIP>`

source: :ref:`Vision Processing with the roboRIO <docs/software/vision-processing/roborio/using-the-cameraserver-on-the-roborio:Advanced Camera Server Program>`
es_mx: :ref:`Procesamiento de la visión con la roboRIO <docs/software/vision-processing/roborio/using-the-cameraserver-on-the-roborio:Advanced Camera Server Program>`

source: For additional information on the pros and cons of using a coprocessor for vision processing, see the next page, :ref:`docs/software/vision-processing/introduction/strategies-for-vision-programming:Strategies for Vision Programming`.
es_mx: Para información adicional de pros y contras de usar un coprocesador para el procesamiento de la visión, vaya a la siguiente página, Estrategias para la programación de la visión. :ref:`docs/software/vision-processing/introduction/strategies-for-vision-programming:Strategies for Vision Programming`.
