Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/2020-overview/2020-Game-Data.po
Languages: es_mx, fr_ca, tr_tr

source: 2020 Game Data Details
es_mx: Detalles de los datos del juego 2020
fr_ca: Détails des données du jeu 2020
tr_tr: 2020 Game Data Detayları

source: In the 2020 *FIRST*\ |reg| Robotics Competition game, the Position Control objective requires alliances to select a specific color transmitted to them when specific pre-requisites have been met. The field will transmit the selected color to teams using Game Data. This page details the timing and structure of the sent data and provides examples of how to access it in the three supported programming languages.
es_mx: En el juego de 2020 de *FIRST*\ |reg| Competición de robótica, el objetivo de Control de posición requiere que las alianzas seleccionen un color específico que se les transmite cuando se cumplen los requisitos previos específicos. El campo transmitirá el color seleccionado a los equipos por medio de los datos del juego. Esta página detalla el tiempo y la estructura de los datos enviados y proporciona ejemplos de cómo acceder a ellos en los tres lenguajes de programación admitidos.
fr_ca: Dans l'édition 2020 du Jeu de la compétition de robotique *FIRST*\ |reg|, l'objectif de contrôle de position nécessite que les alliances sélectionnent une couleur spécifique qui leur est transmise lorsque des pré-requis spécifiques ont été remplis. Le terrain de jeu, par l'intermédiare du FMS, transmettra la couleur sélectionnée aux équipes utilisant les données de jeu. Cette page détaille la synchronisation et la structure des données envoyées et fournit des exemples sur la façon d'y accéder dans les trois langages de programmation pris en charge.
tr_tr: 2020 *FIRST*\ |reg| Robotics Competition oyununda, Konum Kontrolü hedefi, ittifakların belirli ön koşullar karşılandığında kendilerine iletilen belirli bir rengi seçmelerini gerektirir. Saha, seçilen rengi Game Data kullanarak takımlara iletecektir. Bu sayfa, gönderilen verilerin zamanlamasını ve yapısını ayrıntılarıyla açıklar ve desteklenen üç programlama dilinde bunlara nasıl erişileceğine dair örnekler sunar.

source: The Data
es_mx: Los datos
fr_ca: Les données
tr_tr: The Data - Veri

source: Timing
es_mx: Sincronización
fr_ca: La synchronisation
tr_tr: Timing - Zamanlama

source: Color assignment data is sent to both alliances simultaneously once the first alliance in a match has reached Capacity on Stage 3 of the Shield Generator (see the Game Manual for more complete details). Between the beginning of the match and this point, the Game Data will be an empty string.
es_mx: Los datos de asignación de color se envían a ambas alianzas simultáneamente una vez que la primera alianza en una partida ha alcanzado la Capacidad en la Etapa 3 del Generador de escudo (consulte el manual del juego para obtener detalles más completos). Entre el comienzo del partido y este punto, los datos del juego serán una cadena vacía.
fr_ca: Les données d'attribution de couleur sont envoyées aux deux alliances simultanément une fois que la première alliance d'un match a atteint sa capacité à l'étape 3 du générateur de bouclier (voir le manuel du jeu pour plus de détails). Entre le début du match et ce point, les données du jeu seront une chaîne de caractères vide.
tr_tr: Bir maçtaki herhangi bir ittifak, Shield Generator'u 3. aşamasındaki kapasiteye ulaştırdığında, renk ataması verileri her iki ittifaka aynı anda gönderilir (daha ayrıntılı bilgi için Oyun Kılavuzuna bakın). Maçın başlangıcı ile bu nokta arasında Game Data boş bir dizi olacaktır.

source: Data format
es_mx: Formato de los datos
fr_ca: Le format des données
tr_tr: Data format - Veri formatı

source: The selected color for an alliance will be provided as a single character representing the color (i.e. 'R' = red, 'G' = green, 'B' = blue, 'Y' = yellow). This color indicates the color that must be placed underneath the Control Panel's color sensor in order to complete the Position Control objective (see the Game Manual for information about the location of the Control Panel sensor).
es_mx: El color seleccionado para una alianza se proporcionará como un solo carácter que representa el color (es decir, 'R' = rojo, 'G' = verde, 'B' = azul, 'Y' = amarillo). Este color indica el color que debe colocarse debajo del sensor de color del panel de control para completar el objetivo de control de posición (consulte el manual del juego para obtener información sobre la ubicación del sensor del panel de control).
fr_ca: La couleur sélectionnée pour une alliance sera fournie sous la forme d'un seul caractère représentant la couleur (c'est-à-dire «R» = rouge, «G» = vert, «B» = bleu, «Y» = jaune). Cette couleur indique la couleur qui doit être placée sous le capteur de couleur du panneau de commande afin de compléter l'objectif de contrôle de position (voir le manuel du jeu pour plus d'informations sur l'emplacement du capteur du panneau de commande).
tr_tr: Bir ittifak için seçilen renk, rengi temsil eden tek bir karakter olarak sunulacaktır (yani 'R' = kırmızı, 'G' = yeşil, 'B' = mavi, 'Y' = sarı). Bu renk, Konum Kontrolü hedefini tamamlamak için Kontrol Panelinin renk sensörünün altına denk getirilmesi gereken rengi belirtir (Kontrol Paneli sensörünün konumu hakkında bilgi için Oyun Kılavuzuna bakın).

source: Accessing the Data
es_mx: Accediendo a los datos
fr_ca: Accéder aux données
tr_tr: Veriye erişmek

source: The data is accessed using the Game Data methods or VIs in each language. Below are descriptions and examples of how to access the data from each of the three languages. As the data is provided to the Robot during the Teleop period, teams will likely want to query the data in Teleop periodic code, or trigger reading it off a button press or other action after they have reached Stage 3 capacity.
es_mx: Se accede a los datos utilizando los métodos de datos del juego o VIs en cada idioma. A continuación, se muestran descripciones y ejemplos de cómo acceder a los datos en cada uno de los tres idiomas. Dado que los datos se proporcionan al Robot durante el período de Teleop, los equipos probablemente deseen consultar los datos en el código periódico de Teleop, o activar la lectura al presionar un botón u otra acción después de haber alcanzado la capacidad de la Etapa 3.
fr_ca: Les données sont accessibles à l'aide des méthodes ou des VIs de données de jeu dans chaque langue. Vous trouverez ci-dessous des descriptions et des exemples d'accès aux données de chacune des trois langues. Comme les données sont fournies au robot pendant la période Teleop, les équipes voudront probablement interroger les données dans le code périodique Teleop, ou déclencher leur lecture en appuyant sur un bouton ou une autre action après avoir atteint la capacité de l'étape 3.
tr_tr: Verilere, Game Data yöntemleri veya VI'lar kullanılarak erişilir. Aşağıda, üç dilin her birindeki verilere nasıl erişileceğine ilişkin açıklamalar ve örnekler bulunmaktadır. Veriler, Teleop döneminde Robota sunulduğunda, takımlar muhtemelen verileri Teleop periyodik kodunda sorgulamak veya Aşama 3 kapasitesine ulaştıktan sonra bir düğmeye basarak veya başka bir işlemle okumayı tetiklemek isteyeceklerdir.

source: In C++ and Java the Game Data is accessed by using the GetGameSpecificMessage method of the DriverStation class. Teams likely want to query the data in a Teleop method such as Teleop Periodic in order to receive the data after it is sent during the match. Make sure to handle the case where the data is an empty string as this is what the data will be until the criteria are reached to enable Position Control for either alliance.
es_mx: En C++ y Java, se accede a los datos del juego mediante el método GetGameSpecificMessage de la clase DriverStation. Es probable que los equipos quieran consultar los datos en un método Teleop como Teleop Periodic para recibir los datos después de que se envíen durante el partido. Asegúrese de manejar el caso en el que los datos sean una cadena vacía, ya que estos serán los datos hasta que se alcancen los criterios para habilitar el Control de posición para cualquiera de las alianzas.
fr_ca: En C ++ et Java, les données de jeu sont accessibles à l'aide de la méthode GetGameSpecificMessage de la classe DriverStation. Les équipes souhaitent probablement interroger les données dans une méthode Teleop telle que Teleop Periodic afin de recevoir les données après leur envoi pendant le match. Assurez-vous de gérer le cas où les données sont une chaîne vide car c'est ce que seront les données jusqu'à ce que les critères soient atteints pour activer le contrôle de position pour l'une ou l'autre alliance.
tr_tr: C ++ ve Java'da Game Data, DriverStation sınıfının GetGameSpecificMessage yöntemi kullanılarak erişilir. Takımlar, maç sırasında gönderildikten sonra verileri almak için muhtemelen Teleop Periodic gibi bir Teleop yönteminde verileri sorgulamak isteyecektir. Verilerin boş bir dizi olduğu durumu tamamladığınızdan emin olun, çünkü bu, ittifaklardan herhangi biri için Konum Kontrolünü etkinleştirmek için uygun kriterlere ulaşılana kadar alacağı veriler olacaktır.

source: The Game Data in LabVIEW is accessed from the Game Specific Data VI. This VI can be found in the WPI Robotics Library -> Driver Station palette.
es_mx: Se accede a los datos del juego en LabVIEW desde el VI de datos específicos del juego. Este VI se puede encontrar en la biblioteca de robótica WPI -> Paleta Driver Station.
fr_ca: Les données de jeu dans LabVIEW sont accessibles à partir du VI Données spécifiques au jeu. Ce VI se trouve dans la librairie WPI Robotics Library -> Palette Driver Station.
tr_tr: LabVIEW'deki Game Data verilerine Game Specific Data VI'dan erişilir. Bu VI, WPI Robotics Library -> Driver Station paletinde bulunabilir.

source: LabVIEW teams will likely want to query the data in the Teleop or PeriodicTasks VIs and may choose to gate the query behind a button press or other action. The code below reads the data and then uses a case structure to react differently to each of the 5 possible cases (empty, or any of the 4 letters).
es_mx: Los equipos de LabVIEW probablemente querrán consultar los datos en Teleop o en los VIs de PeriodicTasks y pueden optar por cerrar la consulta detrás de presionar un botón u otra acción. El siguiente código lee los datos y luego usa una estructura de caso para reaccionar de manera diferente a cada uno de los 5 casos posibles (vacío o cualquiera de las 4 letras).
fr_ca: Les équipes LabVIEW voudront probablement interroger les données dans les VIs Teleop ou PeriodicTasks et peuvent choisir de bloquer la requête derrière une pression de bouton ou une autre action. Le code ci-dessous lit les données puis utilise une structure de cas pour réagir différemment à chacun des 5 cas possibles (vide, ou l'une des 4 lettres).
tr_tr: LabVIEW takımları büyük olasılıkla Teleop veya PeriodicTasks VI' içinde verileri sorgulamak isteyecek ve sorguyu bir düğmeye basma veya başka bir eylemin arkasına yerleştirmeyi seçecektir. Aşağıdaki kod, verileri okur ve ardından olası 5 durumun her birine (boş veya 4 renk harfinden herhangi biri) farklı tepki vermek için bir yapı kullanır.

source: Testing Game Specific Data
es_mx: Prueba de datos específicos del juego
fr_ca: Test des données spécifiques au jeu
tr_tr: Oyun Verisinin - Game Specific Data Denenmesi

source: You can test your Game Specific Data code without FMS by using the Driver Station. Click on the Setup tab of the Driver Station, then enter the desired test string into the Game Data text field. The data will be transmitted to the robot in one of two conditions: Enable the robot in Teleop mode, or when the DS reaches the End Game time in a Practice Match (times are configurable on the Setup tab). It is recommended to run at least one match using the Practice functionality to verify that your code works correctly in a full match flow.
es_mx: Puede probar el código de datos específicos del juego sin FMS mediante la Driver Station. Haga clic en la pestaña Configuración de la Driver Station, luego ingrese la cadena de prueba deseada en el campo de texto Datos del juego. Los datos se transmitirán al robot en una de estas dos condiciones: El Robot habilitado en modo Teleop, o cuando el DS llegue al tiempo de Fin del Juego en un Partido de Práctica (los tiempos se pueden configurar en la pestaña Configuración). Se recomienda ejecutar al menos un partido utilizando la funcionalidad de práctica para verificar que su código funcione correctamente durante un partido completo.
fr_ca: Vous pouvez tester votre code de données spécifiques au jeu sans FMS en utilisant la Driver Station. Cliquez sur l'onglet Configuration de la Driver Station, puis entrez la chaîne de test souhaitée dans le champ de texte Game Data. Les données seront transmises au robot dans l'une des deux conditions suivantes: Activer le robot en mode Teleop, ou lorsque la DS atteint le moment de fin de partie dans un match d'entraînement (les heures sont configurables dans l'onglet Configuration). Il est recommandé d'exécuter au moins un match dans le mode Pratique pour vérifier que votre code fonctionne correctement dans un vrai match durant la compétition.
tr_tr: Driver Station'ı kullanarak Game Specific Data kodunuzu FMS olmadan da test edebilirsiniz. Driver Station'ın "Setup" sekmesine tıklayın, ardından istediğiniz test dizisini Game Data metin alanına girin. Veriler robota şu iki koşuldan birinde aktarılacaktır: Robotu Teleop modunda etkinleştirildiğinde veya DS Practice Match modunda oyun sonu zamanına ulaştığında (zamanlar Setup sekmesinden yapılandırılabilir). Kodunuzun gerçek maç akışında düzgün şekilde çalıştığını doğrulamak için Practice işlevini kullanarak en az bir maç denemesi yapmanız önerilir.
