Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/2020-overview/known-issues.po
Languages: es_mx, fr_ca, tr_tr

source: Known Issues
es_mx: Problemas Conocidos
fr_ca: Problèmes rapportés
tr_tr: Bilinen Sorunlar

source: This article details known issues (and workarounds) for FRC Control System Software.
es_mx: Esta articulo detalla problemas conocidos (y soluciones alternativas) para el Software de Control de Sistema de FRC.
fr_ca: Le présent article détaille les problèmes rencontrés (et leurs solutions) pour un logiciel du système de contrôle FRC.
tr_tr: Bu makale, FRC Kontrol Sistemi Yazılımı için bilinen sorunları (ve geçici çözümleri) ayrıntılarıyla anlatmaktadır.

source: Open Issues
es_mx: Abrir Problemas
fr_ca: Questions ouvertes
tr_tr: Açık sorunlar

source: Chinese characters in Driver Station Log
es_mx: Caracteres chinos en el registro de la Driver Station
fr_ca: Caractères chinois dans Driver Station Log
tr_tr: Driver Station Log içinde Çince karakterler

source: **Issue:** Rarely, the driver station log will show Chinese characters instead of the English text. This appears to only happen when Windows is set to a language other then English.
es_mx: **Problema:** En raras ocasiones, el registro de la driver station mostrará caracteres chinos en lugar del texto en inglés. Esto parece ocurrir solo cuando Windows está configurado en un idioma que no sea el inglés.
fr_ca: **Problème:** Le journal de la Driver Station affichera rarement des caractères chinois au lieu du texte anglais. Cette situation semble se produire uniquement lorsque Windows est configuré sur une langue autre que l’anglais.
tr_tr: **Sorun:** Nadiren, Driver Station loglarında İngilizce metin yerine Çince karakterler görünecektir. Bu, yalnızca Windows, İngilizce dışında bir dilde olduğunda ortaya çıkar.

source: **Workaround:** There are two known workarounds:
es_mx: **Solución alternativa:** Hay dos soluciones alternativas conocidas:
fr_ca: **Solution de rechange:** Il existe deux solutions de rechange connues:
tr_tr: **Çözüm:** Bilinen iki geçici çözüm vardır:

source: Copy and paste the Chinese characters into notepad, and the English text will be shown.
es_mx: Copie y pegue los caracteres chinos en un notepad, y texto en ingles se mostrará.
fr_ca: Copiez et collez les caractères chinois dans le bloc-notes, et le texte anglais sera affiché.
tr_tr: Çince karakterleri kopyalayıp Notepad not defterine yapıştırın, İngilizce metin görünecektir.

source: Temporarily change the Windows language to English.
es_mx: Cambie temporalmente el idioma de Windows a ingles.
fr_ca: Temporairement, configuer l'anglais comme langue sous Windows.
tr_tr: Windows dilini geçici olarak İngilizce olarak değiştirin.

source: macOS Simulation fails to launch in Visual Studio Code
es_mx: La Simulación de macOS no se inicia en Visual Studio Code.
fr_ca: Sous macOS, une simulation ne démarre pas dans l'environnement Visual Studio Code
tr_tr: macOS Similasyonu, Visual Studio Code'da başlatılamıyor

source: The first time launching simulation in VS Code on macOS using the ``WPILib: Simulate Robot Code on Desktop`` task will fail with a warning similar to the one below.
es_mx: La primera vez iniciando la simulación en VS Code en macOS usando la tarea de ``WPILib: Simulate Robot Code on Desktop´´ fallará con una advertencia similar a la que se muestra a continuación.
fr_ca: Lorsque lancée pour la première fois dans VS Code sous macOS en utilisant l'application ``WPILib: Simulate Robot Code on Desktop``, une simulation ne s'exécute pas et s'accompagne d'un message d'avertissement semblable à celui ci-dessus.
tr_tr: ``WPILib: Simulate Robot Code on Desktop`` görevi kullanılarak macOS üzerinde VS Code'da simülasyonu ilk kez başlatma işlemi, aşağıdakine benzer bir uyarı ile başarısız olacaktır.

source: This is a bug in VS Code being tracked by WPILib in `vscode-wpilib#334 <https://github.com/wpilibsuite/vscode-wpilib/issues/334>`__.
es_mx: Este es un error en VS Code que WPILib está rastreando en `vscode-wpilib#334 <https://github.com/wpilibsuite/vscode-wpilib/issues/334>`__.
fr_ca: Il s'agit d'un bogue se produisant sous VS Code et suivi par WPILib dans `vscode-wpilib#334 <https://github.com/wpilibsuite/vscode-wpilib/issues/334>`__.
tr_tr: Bu, VS Code'da WPILib tarafından `vscode-wpilib # 334 <https://github.com/wpilibsuite/vscode-wpilib/issues/334>`__ 'de takip edilmektedir.

source: **Workaround:** Attempt to launch the simulation once using the ``WPILib: Simulate Robot Code on Desktop`` task and let the task fail. Without closing the console that opens at the bottom of the VS Code window, launch the simulator again using the ``WPILib: Simulate Robot Code on Desktop`` task. The second time the simulator will launch properly.
es_mx: **Solución Alternativa:** Intente iniciar la simulación una vez utilizando la tarea de ``WPILib: Simulate Robot Code on Desktop`` y deje que la tarea falle. Sin cerrar la consola que se abre en el fondo de la ventana del VS Code, inicie el simulador otra vez usando la tarea ``WPILib: Simulate Robot Code on Desktop`` . En la segunda vez el simulador se iniciará de forma apropiada.
fr_ca: **Solution:** Dans un premier temps, essayer de lancer la simulation en utilisant la tâche ``WPILib: Simulate Robot Code on Desktop`` et laisser la tâche échouer. Sans fermer la console qui s'ouvre en bas dans la fenêtre de VS Code et toujours en utilisant la tâche ``WPILib: Simulate Robot Code on Desktop``, relancer le simulateur. Cette seconde tentative devrait démarrer normalement le simulateur.
tr_tr: **Çözüm:** ``Simulate Robot Code on Desktop`` görevini kullanarak simülasyonu başlatmayı deneyin ve başarısız olmasına izin verin. VS Code penceresinin altında açılan konsolu kapatmadan, ``Simulate Robot Code on Desktop`` görevini kullanarak simülatörü tekrar başlatın. Simülatör ikinci kez düzgün bir şekilde başlayacaktır.

source: C++ Intellisense - Files Open on Launch Don't Work Properly
es_mx: C++Intellisense - Los archivos abiertos al iniciarse no funcionan correctamente
fr_ca: C++ Intellisense - Les fichiers ouverts au démarrage ne fonctionnent pas correctement
tr_tr: C ++ Intellisense - Başlanğıçta Açılan Dosyalar Düzgün Çalışmıyor. - Files Open on Launch Don't Work Properly

source: **Issue:** In C++, files open when VS Code launches will have issues with Intellisense showing suggestions from all options from a compilation unit and not just the appropriate ones or not finding header files. This is a bug in VS Code.
es_mx: **Problema:** En C++, los archivos abren cuando VS Code se inicia, pueden tener problemas con la muestra de sugerencias de Intellisense de todas las opciones de una unidad de compilación y no solo las apropiadas o archivos de encabezados no encontrados. Este es un error en VS Code.
fr_ca: **Problème:** En C++, les fichiers ouverts au démarrage de VS Code rencontrent un fonctionnement erratique d'Intellisense : apparition de suggestions de toutes les options de l'unité de compilation même celles qui ne sont pas concernées ou impossibilité de trouver les en-têtes des fichiers. C'est un bogue dans VS Code.
tr_tr: **Sorun:** C ++ 'da, VS Code başlatıldığında açılan dosyalarda Intellisense, yalnızca uygun olanları değil veya başlık dosyalarını bulamama değil, bir derleme birimindeki tüm seçeneklerdeki önerileri gösterirken sorunlar yaşayacaktır. Bu VS Code'daki bir hatadır.

source: **Workaround:**
es_mx: **Solución Alternativa:**
fr_ca: **Solution:**
tr_tr: **Çözüm**

source: Close all files in VS Code, but leave VS Code open
es_mx: Cierre todos los archivos en VS Code, pero mantenga abierto VS Code
fr_ca: Fermer tous les fichiers sous VS Code, mais laisser VS Code ouvert
tr_tr: VS Code'daki tüm dosyaları kapatın ancak VS Code açık kalsın.

source: Delete c_cpp_properties.json file in the .vscode folder, if it exists
es_mx: Elimine el archivo c_cpp_properties.json en la carpeta .vscode, si existe
fr_ca: Effacer le fichier c_cpp_properties.json dans le dossier .vscode, s'il existe
tr_tr: Eğer varsa c_cpp_properties.json dosyasını .vscode klasöründen silin.

source: Run the "Refresh C++ Intellisense" command in vscode.
es_mx: Ejecute el comando "Refresh C++ Intellisense" en vscode.
fr_ca: Lancer la commande "Refresh C++ Intellisense" dans vscode.
tr_tr: "Refresh C++ Intellisense" komutunu VS Code da çalıştırın.

source: In the bottom right you should see something that looks like a platform (linuxathena or windowsx86-64 etc). If it’s not linuxathena click it and set it to linuxathena (release)
es_mx: En la parte inferior derecha deberá ver algo que luce como una plataforma (linuxathena or windowsx86-64 etc). Si no está linuxathena presione y configure a linuxathena (versión)
fr_ca: En bas à droite, vous devriez apercevoir quelque chose qui a l'apparence d'une plateforme (linuxathena, windowsx86-64, etc.). Si ce n'est pas effectivement linuxathena, cliquez dessus et configurez linuxathena (édition)
tr_tr: Sağ altta platforma benzeyen bir bölüm görmelisiniz (linuxathena veya windowsx86-64 vb.). Eğer linuxathena değilse tıklayın ve linuxathena (release) olarak ayarlayın

source: Wait ~ 1 min
es_mx: Espere ~ 1 min
fr_ca: Attendre environ 1 minute
tr_tr: ~ 1 dakika bekleyiniz.

source: Open the main cpp file (not a header file). Intellisense should now be working
es_mx: Abra el archivo principal de cpp (no un archivo de encabezado). Intellisense ahora debería estar funcionando.
fr_ca: Ouvrir le fichier principal cpp (pas un fichier d'en-tête). Intellisense devrait maintenant être fonctionnel
tr_tr: Main-ana cpp dosyasını açın (bir başlık dosyası değil). Intellisense şimdi çalışıyor olmalı

source: SmartDashboard and Simulation fail to launch on Windows N Editions
es_mx: SmartDashboard y Simulación no se inician en las ediciones de Windows N
fr_ca: Le SmartDashboard et la Simulation ne démarrent pas sous Windows N Editions
tr_tr: SmartDashboard ve Simulation, Windows N Sürümlerinde başlatılamıyor

source: **Issue:** WPILib code using CSCore (dashboards and simulated robot code) will fail to launch on Education N editions of Windows.
es_mx: **Problema:** El código de WPILib que usa CSCore (dashboards y códigos de robot simulados ) no se ejecutarán en ediciones de Education N de Windows.
fr_ca: **Problème:** En faisant usage de la WPILib, un code contenant CSCore (dashboards et simulation) ne s'exécutera pas avec la version Education N editions de Windows.
tr_tr: **Sorun:** CSCore (dashboard-kontrol panelleri ve simüle edilmiş robot kodu) kullanan WPILib kodu, Windows'un Education N sürümlerinde başlatılamayacak.

source: **Solution:** Install the `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__
es_mx: **Solución:** Instale el `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__
fr_ca: **Solution:** Installer `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__
tr_tr: **Çözüm:** `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__ kurun.

source: NetworkTables Interoperability
es_mx: Interoperabilidad de NetworkTables
fr_ca: Interopérabilité des NetworkTables
tr_tr: NetworkTables-Ağ tabloları Çalışabilirliği

source: There is currently an issue with inter-operating C++/Java Network Tables clients (dashboards or co-processors) with LabVIEW servers (LV robot code). In some scenarios users will see updates from one client fail to be replicated across to other clients (e.g. data from a co-processor will not be properly replicated out to a dashboard). Data still continues to return correctly when accessed by code on the server.
es_mx: Actualmente hay un problema con los clientes interoperativos de NetworkTables de C++/Java (dashboard o coprocesadores) con servidores de LabVIEW (Codigo de robot LV). En algunos escenarios los usuarios pueden ver fallas en las actualizaciones de un cliente para ser replicado en otros clientes (p.e. los datos de un coprocesador no estaran propiamente replicados en un dasboard). Los datos aún continúan regresando correctamente cuando se accede mediante código en el servidor.
fr_ca: Il y a présentement un problème d'interopérabilité des clients NetworkTables C++/Java (dashboards ou co-processeurs) avec les serveurs LabVIEW (code robot LV). Dans certains scénarios, les usagers ne verront pas les mises à jour effectuées dans un client se propager à travers les autres clients (e.g. les données en provenance d'un co-processeur ne seront pas adéquatement repliquées au dashboard). Cependant, les données continuent d'être transmises correctement lorsqu'elles sont accédées à travers un code sur le serveur.
tr_tr: Şu anda LabVIEW sunucuları (LV robot kodu) ile birlikte çalışan C ++ / Java Ağ Tabloları istemcilerinde (dashboard veya yardımcı işlemciler) bir sorun vardır. Bazı senaryolarda kullanıcılar, bir istemciden gelen güncellemelerin diğer istemcilere kopyalanamadığını göreceklerdir (örneğin, bir yardımcı işlemciden gelen veriler bir dashboard'a düzgün şekilde kopyalanmayacaktır). Veriler, sunucudaki kodla erişildiğinde doğru şekilde geri dönmeye devam eder.

source: **Workaround**: Write code on the server to mirror any keys you wish to see on other clients (e.g. dashboards) to a separate key. For example, if you have a key named ``targetX`` being published by a co-processor that you want to show up on a dashboard, you could write code on the robot to read the key and re-write it to a key like ``targetXDash``.
es_mx: **Solución Alternativa:** Escriba el código en el servidor para reflejar cualquier clave que usted desee ver en otros clientes (p.e. dashboards) para separar la clave. Por ejemplo, si usted tiene una clave llamada ``targetX`` siendo publicada por un coprocesador que quiere aparecer en la dashboard, usted puede escribir un código en el robot para leer la clave y reescribirla a una clave como ``targetXDash``.
fr_ca: **Solution**: Écrire un code sur le serveur afin de reproduire toute clé que vous souhaitez voir sur les autres clients (e.g. dashboards) sur une clé à part. Par exemple, si vous avez une clé nommée ``targetX`` émise par un co-processeur que vous souhaitez afficher au dashboard, vous pouvez écrire un code sur le robot pour lire cette clé et la renommer ``targetXDash`` dans une autre clé.
tr_tr: **Geçici Çözüm**: Diğer istemcilerde (ör. dashboard) görmek istediğiniz anahtarları ayrı bir anahtara yansıtmak için sunucuya kod yazın. Örneğin, bir gösterge panosunda gösterilmesini istediğiniz bir yardımcı işlemci tarafından yayınlanan ``targetX`` adlı bir anahtarınız varsa, anahtarı okuyup yeni bir anahtara yazmak için robota kod yazabilirsiniz. ``targetXDash`` gibi.

source: Fixed in 2020.3.2
es_mx: Fijado en 2020.3.2
fr_ca: Résolu dans 2020.3.2
tr_tr: Çözüldü 2020.3.2

source: PathWeaver Units
es_mx: Unidades de PathWeaver
fr_ca: Unités dans PathWeaver
tr_tr: PathWeaver Birimleri

source: **Issue:** PathWeaver exports paths using the length unit that was used for the project. However, the WPILib trajectory tools expects paths with the length units of meters. If different units are selected in PathWeaver, the paths will be scaled incorrectly.
es_mx: **Problema:** PatherWeaver exporta rutas usando la unidad larga que fue usada para el proyecto. Como sea, las herramientas de trayectoria de WPILib espera rutas con las unidades largas de los metros. Si las unidades seleccionadas son diferentes en PathWeaver, las rutas se escalarán incorrectamente.
fr_ca: **Problème:** PathWeaver exporte des trajectoires en faisant usage d'unité de longueur qui était utilisée pour le projet. Cependant, l'utilitaire de gestion de trajectoires de WPILib s'attend à recevoir des trajectoires ayant le mètre comme unité de longueur. Si dans PathWeaver des unités différentes sont sélectionnées, les trajectoires ne seront pas correctement mises à l'échelle.
tr_tr: **Sorun:** PathWeaver, proje için kullanılan uzunluk birimini kullanarak projeyi dışa aktarır. Bununla birlikte, WPILib araçları, metre cinsinden uzunluk birimleriyle çalışmayı bekler. PathWeaver'da farklı birimler seçilirse, yollar yanlış şekilde ölçeklenecektir.

source: **Solution:** PathWeaver, starting with version 2020.3.2, can now export export to meters when the units within PathWeaver are set to something else.
es_mx: **Solución:** PathWeaver, empezando con la versión 2020.3.2, ahora puede exportar a metros cuando las unidades dentro de PathWeaver están configuradas en otra diferente.
fr_ca: **Solution:** PathWeaver, depuis la version 2020.3.2, peut maintenant exporter les unités en mètres même lorsque les unités configurées à l'intérieur de PathWeaver ne sont pas des mètres.
tr_tr: **Çözüm:** 2020.3.2 sürümünden başlayarak PathWeaver artık PathWeaver içindeki birimler başka bir şeye ayarlandığında da metre şeklinde dışa aktarabilir.

source: Fixed in 2020.2.2
es_mx: Fijo en 2020.2.2
fr_ca: Résolu en 2020.2.2
tr_tr: Çözüldü 2020.2.2

source: Java predefined colors are all zero
es_mx: Los colores predefinidos de Java son todos cero
fr_ca: En Java les couleurs prédéfinies sont toutes égales à zéro
tr_tr: Java önceden tanımlanmış renklerin tümü sıfırdır

source: The predefined (static) colors from the WPILib Color class have all zero red, green, blue values.
es_mx: Los colores predefinidos (estáticos) de la clase WPILib Color tienen todos los valores cero rojo, verde y azul.
fr_ca: Dans la WPILib, les couleurs prédéfinies (statiques) de la classe Color sont initialisées à zéro pour le rouge, le vert et le bleu.
tr_tr: WPILib Color sınıfından önceden tanımlanmış (statik) renklerin tümü sıfır kırmızı, yeşil, mavi değerlere sahiptir.

source: This issue is being tracked by WPILib in `allwpilib#2269 <https://github.com/wpilibsuite/allwpilib/pull/2269>`__.
es_mx: Este problema está siendo rastreado por WPILib en `allwpilib#2269 <https://github.com/wpilibsuite/allwpilib/pull/2269>`__.
fr_ca: Ce problème est suivi par la WPILib dans `allwpilib#2269 <https://github.com/wpilibsuite/allwpilib/pull/2269>`__.
tr_tr: Bu sorun WPILib tarafından `allwpilib #2269 <https://github.com/wpilibsuite/allwpilib/pull/2269>`__ 'da takip ediliyor.

source: C++ Command Based JoystickButton and POVButton not functioning
es_mx: JoystickButton y POVButton basados ​​en comandos de C ++ no funcionan
fr_ca: En C++ les classes JoystickButton et POVButton du patron de conception Command Based ne sont pas opérationnelles.
tr_tr: C++ Komut Tabanlı JoystickButton ve POVButton çalışmıyor

source: C++ JoystickButton and POVButton are both non functioning.
es_mx: C ++ JoystickButton y POVButton no funcionan.
fr_ca: En C++ les classes JoystickButton et POVButton sont toutes les deux non fonctionnelles.
tr_tr: C++ JoystickButton ve POVButton ikisi birden işlevsizdir.

source: This issue is being tracked by WPILib in `allwpilib#2259 <https://github.com/wpilibsuite/allwpilib/pull/2259>`__.
es_mx: Este problema está siendo rastreado por WPILib en `allwpilib#2259 <https://github.com/wpilibsuite/allwpilib/pull/2259>`__.
fr_ca: Ce problème est suivi par la WPILib dans `allwpilib#2259 <https://github.com/wpilibsuite/allwpilib/pull/2259>`__.
tr_tr: Bu sorun WPILib tarafından `allwpilib #2259 <https://github.com/wpilibsuite/allwpilib/pull/2259>`__ 'da takip ediliyor.

source: **Workaround**: Use a Button object directly instead of using JoystickButton or POVButton.
es_mx: **Solución Alternativa:** Utilice un Button object directamente en lugar de utilizar JoystickButton o POVButton.
fr_ca: **Solution**: Utiliser directement un objet de type Button object au lieu de JoystickButton ou POVButton.
tr_tr: **Geçici Çözüm**: JoystickButton veya POVButton yerine doğrudan bir Button nesnesi kullanın.

source: RobotBuilder extensions use the frc namespace (C++)
es_mx: Las extensiones de RobotBuilder utilizan el espacio de nombres de frc (C++)
fr_ca: Les extensions de RobotBuilder utilisent l'espace de nommage frc (C++)
tr_tr: RobotBuilder uzantıları frc ad alanını kullanır (C++)

source: When using RobotBuilder to create a C++ robot program, extensions will generate code prepended with the ``frc::`` namespace which will not compile.
es_mx: Al utilizar RobotBuilder para crear un programa de robot C++, las extensiones generarán código precedido del espacio de nombres `` frc :: '' que no se compilará
fr_ca: Lorsqu'on se sert de RobotBuilder pour produire un programme robot en C++, les extensions vont générer un code précédé de l'espace de noms ``frc::`` qui ne compilera pas.
tr_tr: Bir C++ robot programı oluşturmak için RobotBuilder'ı kullanırken, uzantılar, derlenmeyecek olan ``frc::`` ad alanının başına kod üretir.

source: **Workaround**: After generating C++ robot code with RobotBuilder, where appropriate, replace ``frc::`` with the correct namespace for that device.
es_mx: **Solución Alternativa:** Después de generar el código de robot C ++ con RobotBuilder, cuando corresponda, reemplace `` frc :: '' con el espacio de nombres correcto para ese dispositivo.
fr_ca: **Solution**: Après avoir généré un code robot C++ par l'intermédiaire de RobotBuilder, le cas échéant, remplacer ``frc::`` par l'espace de nommage du dispositif approprié.
tr_tr: **Geçici Çözüm**: RobotBuilder ile C++ robot kodu oluşturduktan sonra, uygun yerlerde, ``frc::`` yi o cihaz için doğru ad alanıyla değiştirin.

source: This issue is being tracked by WPILib in `RobotBuilder#194 <https://github.com/wpilibsuite/RobotBuilder/issues/194>`__.
es_mx: Este problema está siendo rastreado por WPILib en `RobotBuilder#194 <https://github.com/wpilibsuite/RobotBuilder/issues/194>`__.
fr_ca: Ce problème est suivi par la WPILib dans `RobotBuilder#194 <https://github.com/wpilibsuite/RobotBuilder/issues/194>`__.
tr_tr: Bu sorun WPILib tarafından `RobotBuilder#194<https://github.com/wpilibsuite/RobotBuilder/issues/194>``__'da takip edilmektedir.

source: Fixed in 2020.1.2
es_mx: Fijo en 2020.1.2
fr_ca: Résolu dans 2020.1.2
tr_tr: 2020.1.2 içinde çözüldü.

source: WPILib Projects created with 2020.1.1 have a project version of Beta2020-2
es_mx: Los proyectos de WPILib creados con 2020.1.1 tienen una versión de proyecto de Beta2020-2
fr_ca: Les projets WPILib créés avec la version 2020.1.1 ont une version de projet de Beta2020-2
tr_tr: 2020.1.1 ile oluşturulan WPILib Projeleri Beta2020-2 proje sürümüne sahiptir

source: Any projects created have a project version of `Beta2020-2` set in wpilib_preferences.json. This is not an issue, everything will still work properly. This will be fixed and update your projects in the 2nd release.
es_mx: Todos los proyectos creados tienen una versión de proyecto de `Beta2020-2` configurada en wpilib_preferences.json. Esto no es un problema, todo seguirá funcionando correctamente. Esto se solucionará y actualizará sus proyectos en la segunda versión.
fr_ca: Tous les projets créés ont une version de projet de `Beta2020-2` configurée dans le fichier wpilib_preferences.json. Ce n'est pas un problème en soi; tout fonctionne normalement. Cependant, dans la 2ème version, cette situation sera corrigée et vos projets mis à jour.
tr_tr: Oluşturulan tüm projelerin wpilib_preferences.json içinde ayarlanmış bir "Beta2020-2" proje sürümü vardır. Bu bir sorun değil, her şey hala düzgün çalışacak. Bu düzeltilecek ve projeleriniz 2. sürümde güncellenecektir.

source: PathWeaver "Build Paths" Doesn't Work
es_mx: "Build Paths" en PathWeaver no funciona
fr_ca: Le bouton "Build Paths" de PathWeaver ne fonctionne pas.
tr_tr: PathWeaver "Build Paths" Çalışmıyor
