Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/2020-overview/known-issues.po
Languages: es_mx, fr_ca, tr_tr

source: The "Build Paths" button in PathWeaver currently doesn't work due to HAL usage reporting in the kinematics classes. This will be resolved in the 2nd release. See `this page <https://github.com/wpilibsuite/PathWeaver/issues/157>`_ for more info on this error.
es_mx: El botón "Build Paths" en PathWeaver actualmente no funciona debido a los informes de uso de HAL en las clases de cinemática. Esto se resolverá en la versión 2. Ver `esta página <https://github.com/wpilibsuite/PathWeaver/issues/157>`_ para más información de este error.
fr_ca: Le bouton "Build Paths" dans PathWeaver ne fonctionne pas présentement à cause de l'usage de la Couche d'Abstraction Matériel ou HAL tel que rapporté dans les classes dédiées à la cinématique. Cette situation sera réglée dans la 2ème version. Consulter `la page <https://github.com/wpilibsuite/PathWeaver/issues/157>`_ pour obtenir plus d'informations sur cette erreur.
tr_tr: PathWeaver'daki "Build Paths" düğmesi şu anda kinematics sınıflarında HAL kullanım raporlaması nedeniyle çalışmıyor. Bu, 2. sürümde çözülecektir. Bu hata hakkında daha fazla bilgi için `bu sayfaya <https://github.com/wpilibsuite/PathWeaver/issues/157>`_ bakın.
