Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/2020-overview/new-for-2020.po
Languages: es_mx, fr_ca, tr_tr

source: New for 2020
es_mx: Lo nuevo para el 2020
fr_ca: Nouveautés pour 2020
tr_tr: 2020 İçin Yenilikler

source: A number of improvements have been made to FRC Control System software for 2020. This article will describe and provide a brief overview of the new changes and features as well as a more complete changelog for C++/Java WPILib changes.
es_mx: Se han hecho varias mejoras en el software del Sistema de Control de FRC para el 2020. Este artículo describirá y proporcionará una breve visión general de los nuevos cambios y características, así como un registro de cambios más completo para los cambios de C++/Java WPILib.
fr_ca: Un certain nombre d’améliorations ont été apportées à la composante logicielle du système de contrôle FRC, pour 2020. Cet article décrira et fournira un bref aperçu des nouvelles modifications et fonctionnalités ainsi qu’un journal de changements plus complet pour les modifications apportée en C++/Java WPILib.
tr_tr: 2020 için FRC Kontrol Sistemi yazılımında bir dizi iyileştirme yapılmıştır. Bu makale, yeni değişiklikler ve özelliklerin kısa bir özetini ve ayrıca C++ / Java WPILib değişiklikleri için daha eksiksiz bir değişiklik günlüğünü açıklayacak ve sağlayacaktır.

source: Major Features - All Languages
es_mx: Características principales - Todos los idiomas
fr_ca: Principales caractéristiques - Tous les langages de programmation
tr_tr: Başlıca Özellikler - Tüm Diller

source: **Addressable LEDs** - The roboRIO FPGA has been enhanced to be able to control individually addressable LEDs (WS2812 or compatible protocol) from the roboRIO PWM ports (non-MXP). Teams can connect the signal line of these LEDs directly to the roboRIO PWM signal line and control them from APIs in all three languages. Depending on the length of the LED string and whether any servos are also being powered from the PWM ports, teams may be able to power the string directly from the PWM port or may need to use an external supply.
es_mx: **Diodos direccionables** - La FPGA del roboRIO ha sido mejorada para poder controlar los LEDs direccionables individualmente (WS2812 o protocolo compatible) desde los puertos PWM del roboRIO (no-MXP). Los equipos pueden conectar la línea de señal de estos LEDs directamente a la línea de señal PWM de roboRIO y controlarlos desde las APIs en los tres lenguajes. Dependiendo de la longitud de la cadena de LEDs y de si los servos también se alimentan desde los puertos PWM, los equipos pueden ser capaces de alimentar la cadena directamente desde el puerto PWM o pueden necesitar utilizar una fuente de alimentación externa.
fr_ca: **LEDs adressables** - Le FPGA du roboRIO a été amélioré pour pouvoir contrôler des LED adressables individuellement (WS2812 ou protocole compatible) à partir des ports roboRIO PWM (non-MXP). Les équipes peuvent connecter ces DELs directement aux ports PWM du roboRIO et les contrôler à partir d’API dans les trois langages de programmation disponibles. Selon la longueur de la chaîne de DELs et si des servos sont également alimentés à partir des ports PWM, les équipes peuvent être en mesure d’alimenter la chaîne directement à partir du port PWM ou peuvent avoir besoin d’utiliser une source d'alimentation externe.
tr_tr: **Adreslenebilir LED'ler** - roboRIO FPGA, roboRIO PWM bağlantı noktalarından (MXP olmayan) ayrı ayrı adreslenebilir LED'leri (WS2812 veya uyumlu protokol) kontrol edebilecek şekilde geliştirilmiştir. Takımlar, bu LED'lerin sinyal hattını doğrudan roboRIO PWM sinyal hattına bağlayabilir ve bunları üç dilde de API'lerden kontrol edebilir. LED dizisinin uzunluğuna ve herhangi bir servonun da PWM bağlantı noktalarından çalıştırılıp çalıştırılmadığına bağlı olarak, ekipler diziyi doğrudan PWM bağlantı noktasından çalıştırabilir veya harici bir kaynak kullanmaları gerekebilir.

source: **Duty Cycle Encoder** - The roboRIO FPGA has been enhanced to be able to decode the signals from Duty Cycle encoders (this includes devices like the US Digital MA3, CTRE Mag Encoder, and REV Robotics Through Bore Encoder). Teams can connect these devices to the DIO ports on the roboRIO and access the encoder data via APIs in all three languages.
es_mx: **Duty Cycle Encoder** - La FPGA roboRIO ha sido mejorada para poder decodificar las señales de los codificadores de Duty Cycle (esto incluye dispositivos como el US Digital MA3, CTRE Mag Encoder, y REV Robotics Through Bore Encoder). Los equipos pueden conectar estos dispositivos a los puertos DIO del roboRIO y acceder a los datos del codificador a través de APIs en los tres idiomas.
fr_ca: **Encodeur avec rapport cyclique** - Le FPGA du roboRIO a été amélioré pour être en mesure de décoder les signaux des encodeurs avec rapport cyclique (cette catégorie inclut les dispositifs comme les encodeurs US Digital MA3, CTRE Mag Encoder et REV Robotics Through Bore Encoder). Les équipes peuvent connecter ces disposits aux ports DIO du roboRIO et accéder aux données de l’encodeur via des API dans les trois langages de programmation disponibles.
tr_tr: **Duty Cycle Encoder - Görev Döngüsü Kodlayıcı** - roboRIO FPGA, Duty Cycle Encoder'lerden gelen sinyallerin kodunu çözebilecek şekilde geliştirilmiştir (US Digital MA3, CTRE Mag Encoder ve REV Robotics Through Bore Encoder gibi cihazları içerir). Ekipler bu cihazları roboRIO üzerindeki DIO bağlantı noktalarına bağlayabilir ve kodlayıcı verilerine üç dilde API'ler aracılığıyla erişebilir.

source: **CAN Bus Internal Restructure** - The internal implementation of the CAN bus has changed to reduce the latency incurred by CAN bus calls from robot programs. Team programs, particularly those with many CAN calls, should see reduced and more consistent loop timing with the new implementation. No team action is needed to take advantage of this change, the changes are limited to internal implementation. Users may notice changes in how some tools like the CTRE Phoenix Tuner work as a consequence of the restructure.
es_mx: **Reestructuración interna del bus CAN** - La implementación interna del bus CAN ha cambiado para reducir la latencia de las llamadas del bus CAN de los programas de los robots. Los programas de equipo, particularmente aquellos con muchas llamadas CAN, deberían ver reducida y más consistente la temporización del bucle con la nueva implementación. No se necesita ninguna acción de equipo para aprovechar este cambio, los cambios se limitan a la implementación interna. Los usuarios pueden notar cambios en el funcionamiento de algunas herramientas como el Sintonizador CTRE Phoenix como consecuencia de la reestructuración.
fr_ca: **Restructuration interne du bus CAN** - L'implémentation interne du bus CAN a changé pour réduire la latence encourue par les appels du bus CAN à partir des programmes de robots. Les programmes d’équipe, en particulier ceux qui font de nombreux appels CAN, devraient voir un temps de boucle réduit et plus cohérent avec la nouvelle implémentation. Aucun ajout de fonctionnalité additionnelle n’est nécessaire de la part des équipes pour tirer parti de ce changement, les changements se limitent à l'implémentation interne. Les utilisateurs pourront remarquer des changements dans la façon dont certains outils comme le CTRE Phoenix Tuner fonctionnent à la suite de cette restructuration.
tr_tr: **CAN Veri Yolu Dahili Yeniden Yapılandırması** - CAN veri yolunun dahili uygulaması, robot programlarından CAN veri yolu çağrılarının neden olduğu gecikmeyi azaltmak için değiştirildi. Takım programları, özellikle çok sayıda CAN çağrısı olanlar, yeni uygulamayla birlikte azaltılmış ve daha tutarlı döngü zamanlaması görecektir. Bu değişiklikten yararlanmak için herhangi bir takım işlemine gerek yoktur, değişiklikler dahili uygulamayla sınırlıdır. Kullanıcılar, yeniden yapılanmanın bir sonucu olarak CTRE Phoenix Tuner gibi bazı araçların çalışma şeklindeki değişiklikleri fark edebilir.

source: **Control Packet Caching** - A change has been made to the internals of how control packet data (such as Joystick data, current mode, etc.) is retrieved, resulting in reduced latency in these calls. The user-facing API has not changed, users will see this benefit without making any changes to their programs.
es_mx: **Caché de paquetes de control** - Se ha hecho un cambio en el interior de cómo se recuperan los datos de los paquetes de control (como los datos de los joysticks, el modo actual, etc.), lo que resulta en una reducción de la latencia de estas llamadas. La API de cara al usuario no ha cambiado, los usuarios verán este beneficio sin hacer ningún cambio en sus programas.
fr_ca: **Mise en cache des paquets de contrôles**- Une modification a été apportée aux mécanismes internes inhérentes à la façon dont les paquets de données de contrôle (telles que les données Joystick, mode actuel, etc.) sont récupérés, ce qui réduit la latence dans ces appels. L'interface API n’ayant pas changé, les utilisateurs profiteront de cet avantage sans avoir à apporter de modifications à leurs programmes.
tr_tr: **Kontrol Paketini Önbelleğe Alma** - Kontrol paketi verilerinin (Joystick verileri, geçerli mod, vb.) Nasıl alındığına ilişkin dahili bir değişiklik yapıldı ve bu çağrılarda daha az gecikme sağlandı. Kullanıcıya dönük API değişmedi, kullanıcılar programlarında herhangi bir değişiklik yapmadan bu avantajı göreceklerdir.

source: **Documentation** - If you're on this page, you're likely aware that the software documentation has moved from Screensteps to this new FRC-Docs page. This open source documentation, hosted on Read the Docs, allows for a greater number of contributors (including community contribution) as well as new features such as testable example code (to ensure example code remains correct as library changes are made), better support for localization, and more. For the 2020 season, KOP part documentation can still be found on `Screensteps <https://wpilib.screenstepslive.com/s/4485>`__
es_mx: **Documentación** - Si estás en esta página, es probable que sepas que la documentación del software ha pasado de Screensteps a esta nueva página de FRC-Docs. Esta documentación de código abierto, alojada en Read the Docs, permite un mayor número de colaboradores (incluyendo la contribución de la comunidad), así como nuevas características como código de ejemplo comprobable (para asegurar que el código de ejemplo sigue siendo correcto a medida que se realizan cambios en la biblioteca), mejor soporte para la localización, y más. Para la temporada 2020, la documentación de las partes de KOP todavía se puede encontrar en `Screensteps <https://wpilib.screenstepslive.com/s/4485>`__
fr_ca: **Documentation** - Si vous êtes sur cette page, vous savez probablement que la documentation logicielle est passée de Screensteps à cette nouvelle page FRC-Docs. Cette documentation de sources ouvertes, hébergée sur Read the Docs, permet un plus grand nombre de contributeurs (y compris la contribution communautaire) ainsi que de nouvelles fonctionnalités telles que l'exemple de code testable (pour s’assurer que l'exemple de code reste fonctionnel au fur et à mesure que des modifications sont apportées à la bibliothèque), une meilleure prise en charge de la localisation, et plus encore. Pour la saison 2020, la documentation de la partie KOP peut encore être trouvée sur `Screensteps <https://wpilib.screenstepslive.com/s/4485>`__
tr_tr: **Belgeler** - Bu sayfadaysanız, yazılım belgelerinin Screensteps'ten bu yeni FRC-Docs sayfasına taşındığını muhtemelen biliyorsunuzdur. Read the Docs'da barındırılan bu açık kaynak dokümantasyon, daha fazla sayıda katılımcının (topluluk katkısı dahil) yanı sıra test edilebilir örnek kod (kütüphane değişiklikleri yapılırken örnek kodun doğru kalmasını sağlamak için) gibi yeni özelliklerin yanı sıra yerelleştirme ve daha fazlasını içermektedir. 2020 sezonu için, KOP malzeme belgeleri hala `Ekran Adımları <https://wpilib.screenstepslive.com/s/4485>`__ adresinde bulunabilir.

source: Major Features - C++/Java
es_mx: Características principales - C++/Java
fr_ca: Principales caractéristiques- C++/Java
tr_tr: Önemli Özellikler - C++/Java

source: More complete details on all of these changes can be found in the changelog below (under **WPILib**).
es_mx: Se pueden encontrar detalles más completos sobre todos estos cambios en el registro de cambios de abajo (bajo **WPILib**).
fr_ca: Vous trouverez des détails plus complets sur toutes ces modifications dans le journal des changements ci-dessous (sous **WPILib**).
tr_tr: Tüm bu değişikliklerle ilgili daha detaylı ayrıntılar aşağıdaki değişiklik günlüğünde bulunabilir (**WPILib** altında).

source: **Command Based Framework Rewrite** - A new version of the Command Based framework has been written from the ground up based on the years of experience with the previous framework. Both frameworks will be available as options in 2020 and have been split out as "vendor libraries" (though they are still included in the WPILib installer) in order to reduce the chances of mixing the two which will not work correctly.
es_mx: **Reescribir el marco basado en el mando** - Se ha escrito una nueva versión del marco basado en el mando desde cero, basada en los años de experiencia con el marco anterior. Ambos marcos estarán disponibles como opciones en 2020 y han sido divididos como "librerías de proveedores" (aunque todavía están incluidas en el instalador de WPILib) para reducir las posibilidades de mezclar los dos que no funcionarán correctamente.
fr_ca: **Réécriture du cadre de développement orienté commande** - Une nouvelle version du cadre de développement orienté commande a été écrite à partir de zéro en fonction des années d’expérience dans le cadre précédent. Les deux cadres de développement seront disponibles en tant qu’options en 2020 et ont été divisés en tant que "bibliothèques des fournisseurs" (bien qu’ils soient toujours inclus dans l’installateur WPILib) afin de réduire les chances de mélanger les deux ce qui ne fonctionnera pas correctement.
tr_tr: **Komut Tabanlı Framework Yeniden Yazımı** - Komut Tabanlı Framework'ün yeni bir sürümü, önceki framework deneyimine dayalı olarak sıfırdan yazılmıştır. Her iki framework de 2020'de seçenekli olarak sunulacak ve doğru şekilde çalışmama olasılığı olabilecek "üretici kütüphaneleri"(yine de WPILib yükleyicisine dahil edilmişlerdir) için destek sağlanmış olacaktır.

source: **PID Controller Rewrite** - A new synchronous PID controller class has been written that is structured in a way that makes it simpler to compose with other higher level classes such as filters, motion profiles, kinematics and more. The new PID Controller is located in a new package to maintain separation from the existing implementation.
es_mx: **Reescritura del controlador PID** - Se ha escrito una nueva clase de controlador PID síncrono que está estructurado de manera que hace más simple componer con otras clases de nivel superior como filtros, perfiles de movimiento, cinemática y más. El nuevo controlador PID se encuentra en un nuevo paquete para mantener la separación de la implementación existente.
fr_ca: **Réécriture du contrôleur PID** - Une nouvelle classe de contrôleur PID synchrone a été écrite qui est structurée d’une manière qui facilite la composition avec d’autres classes de haut niveau telles que les filtres, les profils de mouvement, la cinématique et plus encore. Le nouveau contrôleur PID est situé dans un nouveau package pour maintenir la séparation face à l’implémentation déjà existante.
tr_tr: **PID Denetleyicisi Yeniden Yazımı** - Filtreler, hareket profilleri, kinematik ve daha fazlası gibi diğer üst düzey sınıflarla oluşturmayı kolaylaştıracak şekilde yapılandırılmış yeni bir eşzamanlı PID denetleyici sınıfı yazılmıştır. Yeni PID Denetleyici, mevcut uygulama ile karışmaması için yeni bir pakette bulunur.

source: **High level controls & Trajectory generation** - A number of new classes have been added to assist teams with higher level controls including kinematics, odometry, and trajectory generation. In addition to the characterization GUI mentioned below this should allow teams a much easier entry to high level control of mechanisms included drivetrains (with smooth trajectories), arms, and elevators.
es_mx: **Controles de alto nivel y generación de trayectorias** - Se han añadido varias clases nuevas para ayudar a los equipos con controles de alto nivel, incluyendo cinemática, odometría y generación de trayectorias. Además de la caracterización GUI que se menciona a continuación, esto debería permitir a los equipos una entrada mucho más fácil al control de alto nivel de los mecanismos incluidos los trenes de conducción (con trayectorias suaves), los brazos y los ascensores.
fr_ca: **Contrôles de haut niveau & génération de trajectoires** - Un certain nombre de nouvelles classes ont été ajoutées pour aider les équipes à avoir des contrôles de haut niveau, parmi lesquelles la cinématique, l’odométrie et la génération de trajectoires. En plus de l’interface graphique de caractérisation mentionnée ci-dessous, cela devrait permettre aux équipes d’entrer beaucoup plus facilement dans le contrôle de haut niveau des mécanismes dont les bases pilotables (avec des trajectoires lisses), les bras et les élevateurs.
tr_tr: **Yüksek seviyeli kontroller ve Yörünge oluşturma** - Kinematik, odometri ve yörünge oluşturma dahil olmak üzere daha yüksek seviyeli kontrollere sahip takımlara yardımcı olmak için bir dizi yeni sınıf eklendi. Aşağıda belirtilen GUI karakterizasyonuna ek olarak, bu değişiklik, takımlara aktarma organları (düzgün yörüngeli), kollar ve asansörler dahil olmak üzere mekanizmaların üst düzey kontrolüne çok daha kolay girmesini sağlayacaktır.

source: **Robot Characterization Tool** - This new tool helps teams characterize their mechanical systems (currently supports drivetrains, elevators, and arms) to help tune control loops. Combined with the new controls classes this should enable teams to follow an end-to-end solution for autonomous trajectory following.
es_mx: **Herramienta de caracterización de robots** - Esta nueva herramienta ayuda a los equipos a caracterizar sus sistemas mecánicos (actualmente soporta trenes de tracción, ascensores y brazos) para ayudar a ajustar los bucles de control. Combinado con las nuevas clases de control, esto debería permitir a los equipos seguir una solución de extremo a extremo para el seguimiento de la trayectoria autónoma.
fr_ca: **Outil de caractérisation du robot** - Ce nouvel outil aide les équipes à caractériser leurs systèmes mécaniques (prend actuellement en charge les transmissions, les élevateurs et les bras) pour aider à régler les boucles de contrôle. Combiné avec les nouvelles classes de contrôle, cet outil devrait permettre aux équipes d'adopter une solution complète pour le suivi de la trajectoire en mode autonome.
tr_tr: **Robot Karakterizasyon Aracı** - Bu yeni araç, kontrol döngülerini ayarlamaya yardımcı olmak için ekiplerin mekanik sistemlerini (şu anda aktarma organlarını, asansörleri ve kolları destekler) karakterize etmelerine yardımcı olur. Yeni kontrol sınıfları ile birlikte bu araç, takımların otonom yol takibi için uçtan uca bir çözüme sahip olmasını sağlar.

source: **Simulation GUI** - A basic simulation GUI has been implemented allowing teams to visualize outputs and control basic inputs when simulating code on their desktop. While vendor support at Kickoff is expected to be limited, we hope this will expand in the future.
es_mx: **Simulation GUI** - Se ha implementado una GUI de simulación básica que permite a los equipos visualizar las salidas y controlar las entradas básicas al simular el código en su escritorio. Aunque se espera que el soporte de los proveedores en el Kickoff sea limitado, esperamos que esto se amplíe en el futuro.
fr_ca: **Interface Graphique pour la Simulation** - Une interface graphique de base pour la simulation a été implémentée permettant aux équipes de visualiser les sorties et de contrôler les entrées de base lors de la simulation de code sur leur bureau. Bien que le soutien des fournisseurs au moment du lancement devrait être limité, nous espérons que cette prise en charge se développera dans le futur.
tr_tr: **Simülasyon GUI** - Ekiplerin, masaüstlerinde kodu simüle ederken çıktıları görselleştirmesine ve temel girdileri kontrol etmesine olanak tanıyan temel bir simülasyon GUI'si hazırlandı. Kickoff'ta donanım üretici desteğinin sınırlı olması beklenirken, bunun gelecekte genişleyeceğini umuyoruz.

source: There are many changes and additions to the main WPILib library for 2020. Most notably, there is a new version of the command-based framework with several major enhancements, a new (synchronous) PIDController, a GUI simulator, and kinematics classes have been added for closed loop driving. The full change log can be read below.
es_mx: Hay muchos cambios y adiciones a la biblioteca principal de WPILib para el 2020. Lo más notable es que hay una nueva versión del marco de trabajo basado en comandos con varias mejoras importantes, un nuevo PIDController (síncrono), un simulador GUI, y se han añadido clases de cinemática para la conducción en bucle cerrado. El registro completo de cambios se puede leer a continuación.
fr_ca: Il y a beaucoup de changements et d’ajouts à la bibliothèque principale WPILib pour 2020. Plus particulièrement, il existe une nouvelle version du cadre orientée commande avec plusieurs améliorations majeures, un nouveau PIDController (synchrone), un simulateur avec interface graphique, et des classes de cinématique ont été ajoutées pour la conduite en boucle fermée. Le journal complet des modifications peut être lu ci-dessous.
tr_tr: 2020 için ana WPILib kitaplığında pek çok değişiklik ve ekleme var. En önemlisi, command-based framework'ün birkaç önemli geliştirmeye sahip yeni bir sürümü, kapalı döngü sürüşü için yeni (eşzamanlı) PIDController, GUI simülatörü ve kinematik sınıfları eklenmiştir. Tam değişiklik günlüğü aşağıda okunabilir.

source: The command-based framework has been rewritten. The design rationale behind the rewrite can be found `here <https://github.com/wpilibsuite/design-docs/blob/master/CommandRewriteDesignDoc.md>`__. The new version of the framework is located in the ``frc2`` namespace (C++) and the ``edu.wpi.first.wpilibj2`` package (Java).
es_mx: El marco basado en el comando ha sido reescrito. El fundamento del diseño detrás de la reescritura se puede encontrar `aquí <https://github.com/wpilibsuite/design-docs/blob/master/CommandRewriteDesignDoc.md>`__. la nueva versión del marco de trabajo se encuentra en el espacio de nombres ``frc2`` (C++) y el paquete ``edu.wpi.first.wpilibj2`` (Java).
fr_ca: Le cadre de développement orienté commande a été réécrit. La raison d’être de la conception derrière cette réécriture peut être trouvée `ici <https://github.com/wpilibsuite/design-docs/blob/master/CommandRewriteDesignDoc.md>`__. La nouvelle version du cadre se trouve dans l'espace de nommage ``frc2`` (C++) et le package ``edu.wpi.first.wpilibj2`` (Java).
tr_tr: Komut tabanlı framework yeniden yazıldı. Yeniden yazmanın arkasındaki tasarım mantığı `burada <https://github.com/wpilibsuite/design-docs/blob/master/CommandRewriteDesignDoc.md>`__ bulunabilir. Framework'ün yeni sürümü, ``frc2`` ad alanında (C ++) ve ``edu.wpi.first.wpilibj2`` paketinde (Java) bulunur.
