Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/2020-overview/new-for-2020.po
Languages: es_mx, fr_ca, tr_tr

source: The command-based frameworks are now separate vendor libraries, rather then built into WPILib itself.
es_mx: Los marcos basados en comandos son ahora bibliotecas de proveedores separados, en lugar de estar incorporados en el propio WPILib.
fr_ca: Les cadres de développement orienté commande sont maintenant des bibliothèques des fournisseurs séparées, plutôt qu'intégrées dans WPILib elle-même.
tr_tr: Komut tabanlı framework'ler artık WPILib'in kendisinde yerleşik olmak yerine ayrı üretici kütüphaneleri şeklindedir.

source: LinearDigitalFilter has been renamed to LinearFilter, and now has a ``Calculate()`` method which returns the filtered value.
es_mx: El Filtro Digital Lineal ha sido renombrado a Filtro Lineal, y ahora tiene un método "Calcular()" que devuelve el valor filtrado.
fr_ca: LinearDigitalFilter a été renommé LinearFilter et dispose maintenant d’une méthode ``Calculate()`` qui retourne la valeur filtrée.
tr_tr: LinearDigitalFilter, LinearFilter olarak yeniden adlandırıldı ve artık filtrelenmiş değeri döndüren bir ``Calculate()`` methoduna sahiptir.

source: Takes a double in the ``Calculate()`` method instead of a ``PIDSource`` in the constructor
es_mx: Toma un doble en el método ``Calcular()`` en lugar de un ``PIDSource`` en el constructor
fr_ca: Prend un double dans la méthode ``Calculate()`` au lieu d’un ``PIDSource`` dans le constructeur
tr_tr: constructor, ``PIDSource`` yerine ``Calculate()`` methodunda double alır.

source: ``PIDGet()`` was replaced with ``Calculate()``
es_mx: "PIDGet()" fue reemplazado por "Calculate()".
fr_ca: ``PIDGet()`` a été remplacée par ``Calculate()``
tr_tr: ``PIDGet()``, ``Calculate()`` ile değiştirildi

source: Both of these changes make it easy to compose the LinearFilter class with the new PIDController class
es_mx: Ambos cambios facilitan la composición de la clase de Filtro Lineal con la nueva clase de PIDController
fr_ca: Ces deux changements facilitent la composition de la classe LinearFilter avec la nouvelle classe PIDController
tr_tr: Bu değişikliklerin her ikisi de yeni PIDController sınıfı ile LinearFilter sınıfını oluşturmayı kolaylaştırır.

source: More details about the new LinearFilter can be found in :ref:`this article <docs/software/advanced-controls/filters/linear-filter:Linear Filters>`
es_mx: Más detalles sobre el nuevo Filtro Lineal se pueden encontrar en :ref:`este artículo <docs/software/advanced-controls/filters/linear-filter:Linear Filters>`
fr_ca: Plus de détails sur la nouvelle classe LinearFilter sont disponibles dans :ref:`cet article <docs/software/advanced-controls/filters/linear-filter:Linear Filters>`
tr_tr: Yeni LinearFilter hakkında daha fazla ayrıntı şu adreste bulunabilir :ref:`bu makale <docs/software/advanced-controls/filters/linear-filter:Linear Filters>`

source: PIDController has been rewritten; the old PIDController along with PIDSource and PIDOutput have been deprecated. The new version of PIDController is located in the ``frc2`` namespace (C++) and the ``edu.wpi.first.wpilibj2`` package (Java) while the deprecated version remains in the old namespace and package.
es_mx: El PIDController ha sido reescrito; el antiguo PIDController junto con PIDSource y PIDOutput han sido desaprobados. La nueva versión del PIDController se encuentra en el espacio de nombres ``frc2`` (C++) y el paquete ``edu.wpi.first.wpilibj2`` (Java) mientras que la versión obsoleta permanece en el antiguo espacio de nombres y el paquete.
fr_ca: PIDController a été réécrit; l’ancien PIDController de même que PIDSource et PIDOutput sont maintenant déconseillés. La nouvelle version de PIDController se trouve dans l’espace de noms ``frc2`` (C++) et le package ``edu.wpi.first.wpilibj2`` (Java) tandis que la version obsolète reste dans l’ancien espace de noms et package.
tr_tr: PIDController yeniden yazıldı; eski PIDController, PIDSource ve PIDOutput ile birlikte kullanımdan kaldırıldı. PIDController'ın yeni sürümü ``frc2`` ad alanında (C++) ve ``edu.wpi.first.wpilibj2`` paketinde (Java) bulunurken, kullanımdan kaldırılan sürüm eski ad alanında ve pakette kalır.

source: The new PIDController no longer runs asynchronously in a separate thread. This eliminates a major source of bugs for teams. Instead, teams should run the controller as part of their main periodic TimedRobot loop by calling ``Calculate()`` and passing the result to the motor’s ``Set()`` function. Note this means that the controller will run at the TimedRobot periodic rate.
es_mx: El nuevo PIDController ya no funciona asincrónicamente en un hilo separado. Esto elimina una importante fuente de errores para los equipos. En su lugar, los equipos deben ejecutar el controlador como parte de su principal bucle periódico TimedRobot llamando a ``Calculate()`` y pasando el resultado a la función ``Set()`` del motor. Note que esto significa que el controlador se ejecutará a la tasa periódica de TimedRobot.
fr_ca: Le nouveau PIDController ne s’exécute plus de manière asynchrone dans un thread séparé. Ce qui élimine une source majeure de bogues pour les équipes. À la place, les équipes doivent exécuter le contrôleur à l'intérieur de leur boucle périodique principale TimedRobot en appelant ``Calculate()`` et en passant le résultat à la fonction ``Set()`` du moteur. Notez que cela veut dire que le contrôleur s’exécute à la même période que TimedRobot.
tr_tr: Yeni PIDController artık ayrı bir iş parçacığında asenkron olarak çalışmamaktadır. Bu, takımlar için önemli bir hata kaynağını ortadan kaldırır. Bunun yerine takımlar, main periodic TimedRobot döngüsünün bir parçası olarak ``Calculate()`` i çağırarak ve sonucu motorun ``Set ()`` fonksiyonuna aktararak denetleyiciyi çalıştırmalıdır. Bunun, denetleyicinin TimedRobot periyodik hızında çalışacağı anlamına geldiğini unutmayın.

source: Input range was replaced with ``EnableContinuousInput()`` and output range was replaced with integrator range. If it’s necessary to clamp inputs or outputs to a range, use ``std::clamp()`` or ``wpiutil.MathUtils.clamp()`` on either the input or output of ``Calculate()`` as appropriate. To deal with steady-state error, use ProfiledPIDController instead of reducing the output range or having an integral term.
es_mx: El rango de entrada fue reemplazado por "EnableContinuousInput()" y el rango de salida fue reemplazado por el rango integrador. Si es necesario sujetar las entradas o salidas a un rango, use ``std::clamp()`` o ``wpiutil.MathUtils.clamp()`` en la entrada o en la salida de ``Calculate()`` como sea apropiado. Para tratar el error de estado estacionario, use el ProfiledPIDController en lugar de reducir el rango de salida o tener un término integral.
fr_ca: La plage d’entrée a été remplacée par ``EnableContinuousInput()`` et la plage de sortie a été remplacée par une plage d’intégrateur. S’il est nécessaire de limiter les entrées ou les sorties dans une plage, appliquez ``std::clamp()`` ou ``wpiutil.MathUtils.clamp()`` sur l’entrée ou la sortie de ``Calculate()`` selon le cas. Pour faire face à une erreur en régime permanent, utilisez ProfiledPIDController au lieu de réduire la plage de sortie ou d’avoir un terme intégral.
tr_tr: Girdi aralığı, ``EnableContinuousInput ()`` ile değiştirildi ve çıktı aralığı, entegratör aralığı ile değiştirildi. Girişleri veya çıkışları bir aralığa sabitlemek gerekirse, ``std::clamp()`` veya ``Calculate()``'in uygun giriş/çıkışında ``wpiutil.MathUtils.clamp()`` kullanın. Steady-state hatasıyla başa çıkmak için, çıktı aralığını azaltmak veya bir integral terimi kullanmak yerine ProfiledPIDController 'ı kullanın.

source: ``PIDSource`` is no longer used. Instead, pass the sensor value directly to ``Calculate()``.
es_mx: "PIDSource" ya no se usa. En su lugar, pasa el valor del sensor directamente a "Calculate()".
fr_ca: ``PIDSource`` n’est plus utilisé. À la place, passez directement la valeur du capteur à la méthode ``Calculate()``.
tr_tr: ``PIDSource`` artık kullanılmamaktadır. Bunun yerine, sensör değerini doğrudan ``Calculate()`` öğesine iletin.

source: ``PIDOutput`` is no longer used. Instead, call ``Set()`` with the output of ``Calculate()``.
es_mx: "PIDOutput" ya no se usa. En su lugar, llama a "Set()" con la salida de "Calculate()".
fr_ca: ``PIDOutput`` n’est plus utilisé. À la place, invoquez ``Set()`` avec la sortie de ``Calculate()``.
tr_tr: ``PIDOutput`` artık kullanılmamaktadır. Bunun yerine, ``Calculate()`` çıktısı ile ``Set()`` çağırın.

source: Percent tolerance has been removed. Absolute tolerance is provided via ``SetTolerance()``.
es_mx: Se ha eliminado el porcentaje de tolerancia. La tolerancia absoluta se proporciona a través de ``SetTolerance()``.
fr_ca: La tolérance au pourcentage a été supprimée. La tolérance absolue est assurée via la méthode ``SetTolerance()``.
tr_tr: Yüzde tolerans kaldırıldı. Mutlak tolerans, ``SetTolerance()`` aracılığıyla sağlanır.

source: More details about the new PIDController can be found in :ref:`this article <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.
es_mx: Más detalles sobre el nuevo PIDController se pueden encontrar en :ref: `este artículo <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.
fr_ca: Plus de détails sur le nouveau PIDController peuvent être trouvés dans :ref:`cet article <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.
tr_tr: Yeni PIDController hakkında daha fazla ayrıntı şu adreste bulunabilir: ref: `bu makale <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`.

source: Added kinematics classes for Swerve, Mecanum, and DifferentialDrive. These classes can be used to implement closed loop driving of these drive types.
es_mx: Se añadieron clases de cinemática para Swerve, Mecanum y DifferentialDrive. Estas clases pueden ser usadas para implementar la conducción en bucle cerrado de estos tipos de conducción.
fr_ca: Ajout de classes de cinématique pour Swerve, Mecanum et DifferentialDrive. Ces classes peuvent être utilisées pour implémenter la conduite en boucle fermée de ces types d'entraînement.
tr_tr: Swerve, Mecanum ve DifferentialDrive için kinematik sınıfları eklendi. Bu sınıflar, bu sürücü türlerinin kapalı döngü sürüşünü uygulamak için kullanılabilir.

source: Added odometry classes for Swerve, Mecanum, and DifferentialDrive. These are needed for closed loop feedback control on global pose (as opposed to just PID on the two drivetrain sides, which can accrue error since there are multiple ending positions a robot can be in for a given set of encoder measurements)
es_mx: Se agregaron clases de odometría para Swerve, Mecanum y DifferentialDrive. Estos son necesarios para el control de retroalimentación de bucle cerrado en la pose global (a diferencia de solo PID en los dos lados del tren de transmisión, que pueden acumular errores ya que hay múltiples posiciones finales en las que un robot puede estar para un conjunto dado de medidas de codificador)
fr_ca: Ajout de classes d’odométrie pour Swerve, Mecanum et DifferentialDrive. Celles-ci sont nécessaires pour le contrôle de rétroaction en boucle fermée sur la pose globale (par opposition à avoir seulement des boucles PID sur les deux côtés de transmission, ce qui peut accumuler des erreurs car il y a plusieurs positions de fin dans lesquelles un robot peut être dans un ensemble donné de mesures d’encodeur)
tr_tr: Swerve, Mecanum ve DifferentialDrive için odometri sınıfları eklendi. Bunlar, genel çapta kapalı döngü geri bildirim kontrolü için gereklidir (sadece iki aktarma sistemi tarafına uygulanan ve encoder ölçüm sonuçlarına göre birden fazla sonlanma pozisyonu nedeniyle artan miktarda hata oluşturan PID'nin aksine)

source: Add RamseteController for closed loop feedback control on global pose for unicycles (the DifferentialDriveKinematics class can convert the chassis speeds to that of a differential drive)
es_mx: Añadir RamseteController para el control de retroalimentación en bucle cerrado en la pose global de los monociclos (la clase DifferentialDriveKinematics puede convertir las velocidades del chasis en la de un accionamiento diferencial)
fr_ca: Ajout de la classe RamseteController pour le contrôle de rétroaction en boucle fermée sur la pose globale pour les monocycles (la classe DifférentielleDriveKinematics peut convertir les vitesses du châssis à celles de l'entraînement différentiel)
tr_tr: Kapalı döngü geri bildirim kontrolü için Unicycles global pozda RamseteController ekleyin (DifferentialDriveKinematics sınıfı şasi hızlarını diferansiyel sürüş hızına dönüştürebilir)

source: (C++) Add frc2::Timer which is unit safe
es_mx: (C++) Añade frc2::Timer que es una unidad segura
fr_ca: (C++) Ajouter frc2::Timer dont les unités sont fiables.
tr_tr: (C++) Güvenli olan frc2::Timer ekleyin

source: Real-time trajectory generation for 2 DOF trajectories (e.g., x and y position for a drivetrain)
es_mx: Generación de trayectorias en tiempo real para 2 trayectorias DOF (por ejemplo, posición x e y para un tren de tracción)
fr_ca: Génération de trajectoires en temps réel pour 2 trajectoires DOF (p. ex., position x et y pour une base pilotable)
tr_tr: 2 DOF-degree of freedom yörünge için gerçek zamanlı yörünge oluşturma (örneğin, bir drivetrainiçin x ve y konumu)

source: Added a PortForwarding class to allow forwarding ports from a remote, to a client. This can be used when connecting to the roboRIO from USB and needing to access Ethernet content.
es_mx: Añadió una clase de PortForwarding para permitir el reenvío de puertos desde un remoto, a un cliente. Esto puede ser usado cuando se conecta al roboRIO desde el USB y necesita acceder al contenido de Ethernet.
fr_ca: Ajout d’une classe PortForwarding pour autoriser le transfert de ports à partir d’un hôte distant à un client. Cece peut être utilisé lors de la connexion au roboRIO à partir de l’USB et qu'on a besoin d’accéder au contenu Ethernet.
tr_tr: Bir uzaktaki bir istemciye bağlantı noktalarının iletilmesine izin vermek için bir PortForwarding sınıfı eklendi. Bu, roboRIO'ya USB'den bağlanırken ve Ethernet içeriğine erişmeniz gerektiğinde kullanılabilir.

source: Added an interactive GUI for desktop simulation of robot code. The GUI provides DS-like controls for operating mode and joystick input and provides live display/control of virtual hardware inputs and outputs.
es_mx: Se añadió un GUI interactivo para la simulación de escritorio del código del robot. La GUI proporciona controles similares a los del DS para el modo de operación y la entrada del joystick y proporciona una visualización/control en vivo de las entradas y salidas del hardware virtual.
fr_ca: Ajout d’une interface graphique interactive pour la simulation de bureau du code robot. L’interface graphique fournit des contrôles de style DS pour le mode d'opération ainsi qu l'entrée joystick et fournit l’affichage/contrôle en direct des entrées et sorties matérielles virtuelles.
tr_tr: Robot kodunun masaüstü simülasyonu için etkileşimli bir GUI eklendi. GUI, çalışma modu ve kumanda kolu girişi için DS benzeri kontroller sağlar ve sanal donanım giriş ve çıkışlarının canlı görüntüsünü / kontrolünü sağlar.

source: Removed SampleRobot
es_mx: Robot de muestra eliminado
fr_ca: Retrait de SampleRobot
tr_tr: Kaldırılan SampleRobot-örnek robot

source: Made null checks on Java parameters more descriptive
es_mx: Hizo que las comprobaciones nulas de los parámetros de Java fueran más descriptivas
fr_ca: Les vérifications de null sur les paramètres Java sont rendues plus descriptives
tr_tr: Java parametrelerinde boş kontrolleri daha açıklayıcı hale getirdi

source: Removed deprecated LiveWindow functions
es_mx: Se han eliminado las funciones obsoletas de LiveWindow
fr_ca: Les fonctions LiveWindow obsolètes sont supprimées
tr_tr: Kullanımdan kaldırılmış LiveWindow işlevleri kaldırıldı

source: Deprecated frc/WPILib.h. Instead, include only what you use.
es_mx: Depreciado frc/WPILib.h. En su lugar, incluye sólo lo que usas.
fr_ca: Frc/WPILib.h est déconseillé. À la place, incluez uniquement ce que vous utilisez.
tr_tr: frc/WPILib.h kullanımdan kaldırıldı . Bunun yerine, yalnızca kullandığınız şeyi ekleyin.

source: Removed deprecated shim header files for wpilibc and llvm.
es_mx: Se han eliminado los archivos de encabezamiento de calzas para wpilibc y llvm.
fr_ca: Suppression des fichiers d’en-tête shim dépréciés pour wpilibc et llvm.
tr_tr: Wpilibc ve llvm için kullanımdan kaldırılan başlık dosyaları kaldırıldı.

source: Added low-level geometry classes: Pose2d, Rotation2d, Transform2d, Translation2d
es_mx: Añadió clases de geometría de bajo nivel: Pose2d, Rotación2d, Transformación2d, Traducción2d
fr_ca: Ajout de classes de géométrie de bas niveau : Pose2d, Rotation2d, Transform2d, Translation2d
tr_tr: Düşük seviyeli geometri sınıfları eklendi: Pose2d, Rotation2d, Transform2d, Translation2d

source: Added C++ units library. This library provides type safety, which makes it impossible to mix up units (e.g. pass seconds as meters) and also provides automatic unit conversion. The units can be specified in literals using a suffix, e.g. ``1.0_s`` for 1 second.
es_mx: Añadida biblioteca de unidades C++. Esta librería proporciona seguridad de tipos, lo que hace imposible mezclar unidades (por ejemplo, pasar los segundos como metros) y también proporciona conversión automática de unidades. Las unidades pueden ser especificadas en literales usando un sufijo, por ejemplo, ``1.0_s`` por 1 segundo.
fr_ca: Ajout d'une bibliothèque d’unités C++. Cette bibliothèque assure la sécurité de type, ce qui rend impossible de mélanger les unités (p. ex. passer des secondes à la place des mètres) et fournit également la conversion automatique de l’unité. Les unités peuvent être spécifiées dans les libellés à l’aide d’un suffixe, par exemple ``1.0_s`` pour spécifier 1 seconde.
tr_tr: C++ birimler kitaplığı eklendi. Bu kitaplık, birimlerin karıştırılmasını (örneğin, sayaç olarak saniye geçişi) imkansız kılan yazım hatası güvenliği sağlar ve ayrıca otomatik birim çevirme sağlar. Birimler, bir son ek kullanılarak belirtilebilir, ör. 1 saniye için ``1.0_s``.

source: Added Java units utility functions for unit conversions. This provides a set of common unit conversions (e.g. feet to meters). Unlike C++, the Java library does not provide type safety; this was done for performance reasons.
es_mx: Añadidas funciones de utilidad de unidades Java para la conversión de unidades. Esto proporciona un conjunto de conversiones de unidades comunes (por ejemplo, de pies a metros). A diferencia de C++, la biblioteca de Java no proporciona seguridad de tipos; esto se hizo por razones de rendimiento.
fr_ca: Ajout de fonctions utilitaires d’unités Java pour les conversions d’unités. Ce qui fournit un ensemble de conversions d’unités communes (p. ex. des pieds en mètres). Contrairement à C++, la bibliothèque Java ne fournit pas de sécurité de type ; cela a été fait pour des raisons de performance.
tr_tr: Birim dönüştürmeleri için Java birimleri yardımcı programı işlevleri eklendi. Bu, bir dizi ortak birim dönüştürme sağlar (örn. Feet'ten metreye). C ++ 'dan farklı olarak, Java kitaplığı yazım hatası güvenliği sağlamaz; bu performans sebebiyle yapıldı.

source: Added TrapezoidProfile class for 1 degree-of-freedom (DOF) trajectories
es_mx: Añadida la clase de perfil trapezoidal para trayectorias de 1 grado de libertad (GDL)
fr_ca: Ajout de la classe TrapezoidProfile pour les trajectoires de 1 degré de liberté (DOF)
tr_tr: 1 serbestlik-dereceli degree-of-freedom (DOF) yörüngeler için TrapezoidProfile sınıfı eklendi

source: Added ProfiledPIDController class. Given a goal, this class constrains the setpoint movement over time to a max velocity and acceleration.
es_mx: Añadida la clase ProfiledPIDController. Dada una meta, esta clase restringe el movimiento del punto de ajuste en el tiempo a una velocidad y aceleración máximas.
fr_ca: Ajout de la classe ProfiledPIDController. Compte tenu d’un objectif, cette classe limite le mouvement du point de consigne au fil du temps à une vitesse et à une accélération maximales.
tr_tr: ProfiledPIDController sınıfı eklendi. Bir hedef verildiğinde, bu sınıf zaman içindeki ayar noktası hareketini maksimum hız ve ivmeyle sınırlar.

source: Moved the CircularBuffer/circular_buffer classes from wpilib to wpiutil
es_mx: Se movieron las clases CircularBuffer/circular_buffer de wpilib a wpiutil
fr_ca: Les classes CircularBuffer/circular_buffer ont été déplacées de wpilib à wpiutil
tr_tr: CircularBuffer/round_buffer sınıfları wpilib'den wpiutil'e taşındı

source: Deprecated the GearTooth class. Based on usage reporting, no teams have used this class in the last several years. The Counter class can be used directly instead.
es_mx: Desaprobado la clase de GearTooth. Según los informes de uso, ningún equipo ha usado esta clase en los últimos años. La clase Counter puede ser usada directamente en su lugar.
fr_ca: La classe GearTooth est déconseillée. D’après les rapports d’utilisation, aucune équipe n’a utilisé cette classe au cours des dernières années. À la place, la classe Counter peut être directement utilisée.
tr_tr: GearTooth sınıfı kullanımdan kaldırıldı. Kullanım raporlamasına göre, son birkaç yılda bu sınıfı hiçbir ekip kullanmamıştır. Counter sınıfı bunun yerine doğrudan kullanılabilir.

source: Deprecated the Filter class. Since PIDSource is deprecated, it no longer serves a purpose. Teams should use the derived classes of Filter directly rather than using polymorphism.
es_mx: Desaprobado la clase filtro. Como la PIDSource está desaprobada, ya no sirve para nada. Los equipos deben usar las clases derivadas de Filtro directamente en lugar de usar el polimorfismo.
fr_ca: La classe Filter est déconseillée. Puisque PIDSource est déconsillé, Filter ne sert à aucune fin. Les équipes doivent directement utiliser les classes dérivées de Filter plutôt que d’avoir recours au polymorphisme.
tr_tr: Filtre sınıfı kullanımdan kaldırıldı. PIDSource kullanımdan kaldırıldığı için artık bir amaca hizmet etmemektedir. Ekipler, polimorfizm kullanmak yerine doğrudan Filter sınıflarını kullanmalıdır.

source: Added the PWMSparkMax class for PWM control of the REV Robotics SPARK MAX Motor Controller
es_mx: Añadió la clase PWMSparkMax para el control PWM del controlador de motor REV Robotics SPARK MAX
fr_ca: Ajout de la classe PWMSparkMax pour le contrôle PWM du contrôleur de moteur REV Robotics SPARK MAX
tr_tr: REV Robotics SPARK MAX Motor Denetleyicisinin PWM kontrolü için PWMSparkMax sınıfı eklendi

source: Simplified the Sendable interface and deprecated SendableBase. The name and subsystem have been removed from individual objects, and instead this data is stored in a new singleton class, SendableRegistry. Much of LiveWindow has been refactored into SendableRegistry.
es_mx: Simplificó la interfaz de Sendable y la obsoleta SendableBase. El nombre y el subsistema se han eliminado de los objetos individuales, y en su lugar estos datos se almacenan en una nueva clase de singleton, SendableRegistry. Gran parte de LiveWindow ha sido refactorizado en SendableRegistry.
fr_ca: L’interface Sendable a été simplifiée et SendableBase est déconseillée . Le nom et le sous-système ont été supprimés des objets individuels, et à la place, ces données sont stockées dans une nouvelle classe singleton, SendableRegistry. Une grande partie de LiveWindow a été remaniée dans SendableRegistry.
tr_tr: Sendable arayüzü basitleştirildi ve SendableBase kullanımdan kaldırıldı. name ve subsystem tek tek nesnelerden kaldırılmıştır ve bunun yerine bu veriler SendableRegistry adlı yeni bir tekil sınıfta depolanmıştır. LiveWindow'un büyük bir kısmı SendableRegistry'de yeniden düzenlendi.
