Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/2020-overview/new-for-2020.po
Languages: es_mx, fr_ca, tr_tr

source: In C++, a new CRTP helper class, SendableHelper, has been added to provide move and destruction functionality.
es_mx: En C++, se ha añadido una nueva clase de ayudante CRTP, SendableHelper, para proporcionar la funcionalidad de movimiento y destrucción.
fr_ca: En C++, une nouvelle classe utilitaire CRTP, SendableHelper, a été ajoutée pour fournir des fonctionnalités de déplacement et de destruction.
tr_tr: C++ 'da, taşıma ve silme işlevselliği sağlamak için yeni bir CRTP yardımcı sınıfı olan SendableHelper eklenmiştir.

source: Shims for GetName, SetName, GetSubsystem, and SetSubsystem have been added to Command and Subsystem (both old and new), and also to SendableHelper to prevent code breakage.
es_mx: Las calzas para GetName, SetName, GetSubsystem y SetSubsystem han sido agregadas a Command and Subsystem (ambos viejos y nuevos), y también a SendableHelper para prevenir la ruptura de código.
fr_ca: Des Shims pour GetName, SetName, GetSubsystem et SetSubsystem ont été ajoutés à Command et Subsystem (anciens et nouveaux), ainsi qu’à SendableHelper pour éviter les ruptures de code.
tr_tr: GetName, SetName, GetSubsystem ve SetSubsystem için girintiler, Command ve Subsystem'e (hem eski hem de yeni) ve ayrıca kod bozulmasını önlemek için SendableHelper'a eklenmiştir.

source: Update to GCC 7, and use C++17
es_mx: Actualizar a GCC 7, y usar C++17
fr_ca: Mise à jour du CCG 7 et utilisation de C++17
tr_tr: GCC 7'ye güncelleyin ve C++17 kullanın

source: Use OS for serial port instead of the NI driver
es_mx: Usar el sistema operativo para el puerto serie en lugar del controlador NI
fr_ca: Utiliser OS pour le port série au lieu du pilote NI
tr_tr: Seri bağlantı noktası için NI sürücüsü yerine işletim sistemini kullanın

source: IterativeRobot template has been removed
es_mx: La plantilla de IterativeRobot ha sido eliminada
fr_ca: Le modèle IterativeRobot a été supprimé.
tr_tr: IterativeRobot şablonu kaldırıldı

source: Add support for Addressable LEDs, such as WS2812's and NeoPixels
es_mx: Añade soporte para LEDs direccionables, como los WS2812 y NeoPixels
fr_ca: Ajout de la prise en charge des LEDs adressables, telles que WS2812's et NeoPixels
tr_tr: WS2812'ler ve NeoPikseller gibi adreslenebilir LED'ler için destek

source: Add support for DutyCycle inputs, such as the absolute output on many FRC encoders
es_mx: Añadir soporte para entradas DutyCycle, como la salida absoluta en muchos codificadores FRC
fr_ca: Ajout d'une prise en charge des entrées DutyCycle, telles que la sortie absolue sur de nombreux encodeurs FRC
tr_tr: Birçok FRC encoderdeki mutlak çıktı gibi DutyCycle girişlerine destek

source: Eigen has been added to C++, and EJML has been added to Java to support linear algebra and matrix calculations. These are included by default, with no need to add anything to your robot project to use them.
es_mx: Eigen ha sido añadido a C++, y EJML ha sido añadido a Java para soportar álgebra lineal y cálculos matriciales. Estos están incluidos por defecto, sin necesidad de añadir nada a su proyecto de robot para usarlos.
fr_ca: Eigen a été ajouté à C++, et EJML a été ajouté à Java pour prendre en charge les calculs d’algèbre linéaire et de matrice. Ceux-ci sont inclus par défaut, sans avoir besoin d’ajouter quoi que ce soit à votre projet de robot pour les utiliser.
tr_tr: C++ 'ya doğrusal cebir ve matris hesaplamalarını desteklemek için Eigen, Java'ya EJML eklenmiştir. Bunlar varsayılan olarak dahil edilmiştir ve bunları kullanmak için robot projenize herhangi bir şey eklemenize gerek yoktur.

source: Jackson has been added to Java for JSON support. C++ support already existed with json library in the wpi header root. These can be used with no need to add anything to your robot project.
es_mx: Jackson ha sido añadido a Java para el soporte de JSON. El soporte de C++ ya existía con la biblioteca json en la raíz de la cabecera del wpi. Estas pueden ser usadas sin necesidad de agregar nada a su proyecto de robot.
fr_ca: Jackson a été ajouté à Java pour le soutien JSON. La prise en charge C++ existait déjà avec la bibliothèque json dans la racine d’en-tête wpi. Ceux-ci peuvent être utilisés sans avoir besoin d’ajouter quoi que ce soit à votre projet de robot.
tr_tr: Jackson, JSON desteği için Java'ya eklenmiştir. Wpi başlık kökünde json kitaplığında C++ desteği zaten vardı. Bunlar, robot projenize herhangi bir şey eklemenize gerek kalmadan kullanılabilir.

source: The location that maven artifacts are published has changed to: https://frcmaven.wpi.edu/artifactory/release/
es_mx: La ubicación en la que se publican los artefactos maven ha cambiado a: https://frcmaven.wpi.edu/artifactory/release/
fr_ca: L’emplacement où les artefacts maven sont publiés a changé pour: https://frcmaven.wpi.edu/artifactory/release/
tr_tr: Maven yazılım eserlerinin yayınlandığı konum şu şekilde değiştirildi: https://frcmaven.wpi.edu/artifactory/release/

source: Ignore whitespace and capitalization for remotely defined settings
es_mx: Ignorar los espacios en blanco y las mayúsculas para los ajustes definidos a distancia
fr_ca: Les espaces et les majuscules pour les paramètres définis à distance sont ignorés.
tr_tr: Uzaktan tanımlanan ayarlar için whitespace - tab,space v.b. ve büyük harf kullanımını göz ardı edin

source: Components in grids can now have location specified remotely
es_mx: Los componentes de las cuadrículas pueden ahora tener una ubicación especificada a distancia remota
fr_ca: Les composants des grilles peuvent désormais avoir un emplacement spécifié à distance
tr_tr: Izgaralardaki bileşenler artık uzaktan belirtilen konuma sahip olabilir

source: Upper and lower bounds on graph X and Y axis can now be manually specified
es_mx: Los límites superiores e inferiores en el gráfico de los ejes X e Y pueden ahora especificarse manualmente
fr_ca: Les limites supérieure et inférieure des axes X et Y des graphiques peuvent maintenant être spécifiées manuellement
tr_tr: X ve Y eksenindeki üst ve alt sınırlar artık manuel olarak belirtilebilir

source: Small numbers will properly be shown in number fields using scientific notation.
es_mx: Los números pequeños serán mostrados apropiadamente en los campos numéricos usando notación científica.
fr_ca: De nombres avec des valeurs très petites seront correctement affichés dans les champs de nombres à l’aide de la notation scientifique.
tr_tr: Küçük sayılar, bilimsel gösterim kullanılarak sayı alanlarında düzgün bir şekilde gösterilecektir.

source: Allow widget titles to be hidden
es_mx: Permitir que los títulos de los widgets se oculten
fr_ca: Les titres des widgets peuvent être masqués.
tr_tr: Widget başlıklarının gizlenmesine izin ver

source: Added a documentation link in the about dropdown
es_mx: Añadido un enlace de documentación en el menú desplegable
fr_ca: Ajout d’un lien de documentation dans la liste déroulante *à propos*
tr_tr: "Hakkında" açılır listesine bir belge bağlantısı eklendi.

source: FRC Raspberry Pi Image
es_mx: Imagen de FRC Raspberry Pi
tr_tr: FRC Raspberry Pi İmajı

source: Updated to work on Raspberry Pi 4
es_mx: Actualizado para trabajar en Raspberry Pi 4
fr_ca: Mise à jour pour travailler sur Raspberry Pi 4
tr_tr: Raspberry Pi 4 üzerinde çalışmak üzere güncellendi

source: Updated to use Raspbian Buster
es_mx: Actualizado para usar Raspbian Buster
fr_ca: Mise à jour pour utiliser Raspbian Buster
tr_tr: Raspbian Buster kullanmak için güncellendi

source: Added CPU temperature to system status screen
es_mx: Añadida la temperatura de la CPU a la pantalla de estado del sistema
fr_ca: Ajout de la température du processeur à l’écran d’état du système
tr_tr: Sistem durumu ekranına CPU sıcaklığı eklendi

source: Properly parses special characters in MJPEG urls
es_mx: Analiza adecuadamente los personajes especiales en las páginas web de MJPEG
fr_ca: Analyse correctement les caractères spéciaux dans les url MJPEG
tr_tr: MJPEG URL'lerindeki özel karakterleri doğru şekilde algılar.

source: Updated to output WPILib splines
es_mx: Actualizado para producir splines WPILib
fr_ca: Mise à jour pour la production des splines WPILib
tr_tr: WPILib şeritlerinin çıktısı için güncellendi

source: Now shows an error alert when configuration screen is invalid
es_mx: Ahora muestra una alerta de error cuando la pantalla de configuración no es válida
fr_ca: Affiche maintenant un message d’erreur lorsque l’écran de configuration n’est pas valide
tr_tr: Yapılandırma ekranı geçersiz olduğunda bir hata uyarısı gösteriyor

source: Fixed the initial settings dialog (it was too small on some platforms)
es_mx: Arreglado el diálogo de configuración inicial (era demasiado pequeño en algunas plataformas)
fr_ca: Correction de la boîte de dialogue des paramètres initiaux (elle était trop petite sur certaines plates-formes)
tr_tr: İlk ayarlar iletişim kutusu düzeltildi (bazı platformlarda çok küçüktü)

source: Fixed array editor
es_mx: Editor de arreglos fijos
fr_ca: L'éditeur de tableau est réglé
tr_tr: Dizi düzenleyici düzeltildi.

source: Fixed JRE slowdown when using ``concat()`` on Strings.
es_mx: Se corrigió la ralentización de JRE al usar `` concat() '' en Strings.
fr_ca: correction du ralentissement de JRE lors de l’invocation de la méthode ``concat()`` sur des objects Strings.
tr_tr: Dizelerde ``concat()`` kullanılırken JRE'nin yavaşlaması düzeltildi.

source: Fixed JRE slowdown on garbage collection.
es_mx: Arreglado la desaceleración de JRE en la recogida de basura.
fr_ca: Correction du ralentissement de la JRE pendant la collecte des ordures.
tr_tr: Hata düzenlemede JRE'nin yavaşlaması düzeltildi.

source: Fixed cscore compatibility with OpenCV 4 (mainly useful for coprocessors)
es_mx: Compatibilidad de cscore fija con OpenCV 4 (útil principalmente para los coprocesadores)
fr_ca: Le problème de la compatibilité cshore avec OpenCV 4 (principalement utile pour les coprocesseurs) est réglé
tr_tr: OpenCV 4 ile cscore uyumluluğu düzeltildi (çoğunlukla yardımcı işlemciler için kullanışlıdır)

source: Fixed setting exposure on PS3eye cameras
es_mx: La exposición de ajuste fijo en las cámaras PS3eye
fr_ca: Le problème du réglage de l'exposition sur les caméras PS3eyel est résolu
tr_tr: PS3eye kameralarda pozlama ayarı düzeltildi

source: WPILib All in One Installer
es_mx: Instalador de WPILib todo en uno
fr_ca: WPILib au complet dans un seul installateur
tr_tr: WPILib Hepsi Bir Arada Yükleyici

source: Use ``wpilib\2020\`` instead of ``frc2020\``. This prevents cluttering the user’s home directory when installing alongside previous years’ installation.
es_mx: Usa "wpilib2020" en lugar de "frc2020". Esto evita que el directorio principal del usuario se llene al instalar junto con la instalación de años anteriores.
fr_ca: Utilisez ``wpilib\2020\`` au lieu de ``frc2020\``. Cela empêche l’encombrement du répertoire d’accueil de l’utilisateur lors d'une installation cottoyant des installations des années précédentes.
tr_tr: ``frc2020\`` yerine ``wpilib\2020\`` kullanın. Bu, önceki yılların kurulumuyla birlikte kurulum yaparken kullanıcının ana dizininin dağınık olmasını önler.

source: Fixed an issue where shortcuts would get created for installed tools, even if it was unchecked.
es_mx: Se ha solucionado un problema por el que se creaban atajos para las herramientas instaladas, incluso si no estaba marcado.
fr_ca: Correction du problème lié à la création des raccourcis pour les outils installés, même si cette option n’était pas cochée.
tr_tr: İşaretlenmemiş olsa bile, kurulu araçlar için kısayolların oluşturulmasına neden olan bir sorun düzeltildi.

source: Installing for **All Users** will now create shortcuts for all users, instead of only the current one.
es_mx: La instalación para **Todos los usuarios** creará ahora atajos para todos los usuarios, en lugar de sólo el actual.
fr_ca: L’option d'installation **All Users** créera désormais des raccourcis pour tous les utilisateurs et non pour l'utilisateur courant seulement.
tr_tr: **All Users** için yükleme artık yalnızca mevcut kullanıcı yerine tüm kullanıcılar için kısayollar oluşturacaktır.

source: Update to latest Visual Studio Code and C++/Java extensions
es_mx: Actualización a las últimas extensiones de Visual Studio Code y C++/Java
fr_ca: Actualisé aux dernières extensions Visual Studio Code et C++/Java
tr_tr: En son Visual Studio Code ve C++/Java uzantılarına güncelleyin

source: Visual Studio Code Extension
es_mx: Código de extensión de Visual Studio
fr_ca: Extension Visual Studio Code
tr_tr: Visual Studio Code Extension - Uzantıları

source: Added a 2019 to 2020 project importer
es_mx: Se añadió un importador del proyecto 2019 a 2020
fr_ca: Ajout d’un importateur de projet 2019 à 2020
tr_tr: 2019 to 2020 proje içe aktarma eklendi

source: Add a window for a simple way to grab all project information
es_mx: Añade una ventana para una forma sencilla de tomar toda la información del proyecto
fr_ca: Ajout d'une fenêtre pour avoir un moyen simple de saisir toutes les informations du projet
tr_tr: Tüm proje bilgilerini almanın basit bir yolu için bir pencere ekleyin

source: Add built in way to open and display API docs
es_mx: Añade la forma de abrir y mostrar los documentos de la API
fr_ca: Ajouter une manière intégrée pour ouvrir et afficher les documents API
tr_tr: API belgelerini açmak ve görüntülemek için yerleşik bir yöntem ekleyin

source: Use individual includes instead of wpilib.h for C++
es_mx: Usar individual includes en lugar de wpilib.h para C++
fr_ca: Utilise des fichiers individuels d'inclusion au lieu de wpilib.h pour C++
tr_tr: C++ için wpilib.h yerine bağımsız içerme kullanın

source: Add export of PWMSparkMax, PWMTalonFX, PWMVenom
es_mx: Añadir la exportación de PWMSparkMax, PWMTalonFX, PWMVenom
fr_ca: Ajout de l’exportation de PWMSparkMax, PWMTalonFX, PWMVeom
tr_tr: PWMSparkMax, PWMTalonFX, PWMVenom dışar aktarımı ekleyin

source: Extensions are now stored in ~/wpilib/2020/Robotbuilder/extensions
es_mx: Las extensiones están ahora almacenadas en ~/wpilib/2020/Robotbuilder/extensiones
fr_ca: Les extensions sont maintenant stockées dans ~/wpilib/2020/Robotbuilder/extensions
tr_tr: Uzantılar artık ~/wpilib/2020/Robotbuilder/extensions'ta saklanıyor

source: GUI for defining Command Groups was removed for maintainability reasons. Commands can be added in VS Code.
es_mx: El GUI para definir los Grupos de Comando fue eliminado por razones de mantenimiento. Los comandos pueden ser añadidos en el código VS.
fr_ca: Suppression pour des rasisons de maintenance de l'interface graphique utilisateur pour définir les groupes de commandes. Les commandes peuvent être ajoutées dans vs code.
tr_tr: Komut Gruplarını tanımlayan GUI, sürdürülebilirlik nedenleriyle kaldırıldı. VS Code'da komutlar eklenebilir.

source: Robot Characterization
es_mx: Caracterización del robot
fr_ca: Caractérisation du robot

source: Introduced the robot characterization toolsuite.
es_mx: Presentación de la suite de herramientas de caracterización del robot.
fr_ca: Introduit la suite d'outils logiciels de caractérisation du robot.
tr_tr: Robot karakterizasyon araçları tanıtıldı.

source: Due to internal GradleRIO changes, it is necessary to update previous years projects. After :doc:`Installing WPILib for 2020 </docs/getting-started/getting-started-frc-control-system/wpilib-setup>`, any 2019 projects must be :doc:`imported </docs/software/vscode-overview/importing-gradle-project>` to be compatible.
tr_tr: Dahili GradleRIO değişiklikleri nedeniyle, önceki yıl projelerinin güncellenmesi gerekmektedir. Sonra :doc:`Installing WPILib for 2020 </docs/getting-started/getting-started-frc-control-system/wpilib-setup>'ile uyumlu olması için tüm 2019 projeleri :doc:`imported </docs/software/vscode-overview/importing-gradle-project> ` olmalıdır.
