Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/advanced-usage/shuffleboard-tuning-pid.po
Languages: es_mx, fr_ca, tr_tr

source: Testing and Tuning PID Loops
es_mx: Probar y sintonizar ciclos PID
fr_ca: Test et réglage des boucles PID
tr_tr: PID Döngülerini Test Etme ve Ayarlama

source: One challenge in using sensors to control mechanisms is to have a good algorithm to drive the motors to the proper position or speed. The most commonly used control algorithm is called PID control. There is a `good set of videos <https://wp.wpi.edu/wpilib/robotics-videos/>`__ (look for the robot controls playlist) that explain the control algorithms described here The PID algorithm converts sensor values into motor speeds by:
es_mx: Uno de los retos que se encuentran al utilizar sensores para controlar mecanismos es tener un buen algoritmo para manejar apropiadamente la velocidad y dirección de los motores. El algoritmo más utilizado se llama control PID. Existe una `gran cantidad de videos <https://wp.wpi.edu/wpilib/robotics-videos/>`__ (busca la lista de reproducción sobre controles para el robot) que explican los algoritmos de control descritos aquí. El algoritmo PID convierte los valores de los sensores en velocidad para el motor de la siguiente manera:
fr_ca: Un défi dans l'utilisation de capteurs pour contrôler les mécanismes est d'avoir un bon algorithme pour conduire les moteurs à la bonne position ou vitesse. L'algorithme de contrôle le plus couramment utilisé est appelé contrôle PID. Il y a une `excellente série de vidéos <https://wp.wpi.edu/wpilib/robotics-videos/>`__ (recherchez la liste de lecture sur les commandes du robot) qui expliquent les algorithmes de commande décrits ici. L'algorithme PID convertit les valeurs des capteurs en vitesse de moteur ainsi:
tr_tr: Mekanizmaları kontrol etmek için sensörleri kullanmanın zorluklarından biri, motorları uygun konuma veya hıza sürmek için iyi bir algoritmaya sahip olmaktır. En yaygın kullanılan kontrol algoritmasına PID kontrolü denir. Burada açıklanan kontrol algoritmalarını açıklayan `iyi bir video seti <https://wp.wpi.edu/wpilib/robotics-videos/>`__(robot kontrolleri oynatma listesine bakın) vardır PID algoritması sensör değerlerini motor hızlarına şu şekilde dönüştürür:

source: Reading sensor values to determine how far the robot or mechanism from the desired setpoint. The setpoint is the sensor value that corresponds to the expected goal. For example, a robot arm with a wrist joint should be able to move to a specified angle very quickly and stop at that angle as indicated by a sensor. A potentiometer is a sensor that can measure. rotational angle. By connecting it to an analog input, the program can get a voltage measurement that is directly proportional to the angle.
es_mx: Al leer los valores del sensor se determina la distancia entre el robot o el mecanismo y el punto de control deseado. El punto de control es el valor del sensor que corresponde con el objetivo. Por ejemplo, un brazo robótico con una articulación tipo muñeca debería moverse a un ángulo específico rápidamente y detenerse cuando el sensor indica dicho ángulo. Un potenciómetro es un sensor que puede medir el ángulo rotacional. Al conectarlo a una entrada análoga, el programa puede determinar un voltaje que sea directamente proporcional al ángulo.
fr_ca: Lecture des valeurs du capteur pour déterminer la distance du robot ou du mécanisme par rapport à la valeur cible souhaitée. La cible est la valeur du capteur qui correspond à l'objectif attendu. Par exemple, un bras de robot avec un joint articulé similaire à un poignet, défini ci-dessous comme "poignet" pour alléger le texte, devrait pouvoir se déplacer très rapidement selon un angle spécifié et s'arrêter à cet angle, comme indiqué par un capteur. Un potentiomètre est un capteur qui peut mesurer l'angle de rotation. En le connectant à une entrée analogique, le programme peut obtenir une mesure de tension directement proportionnelle à l'angle.
tr_tr: Robotun veya mekanizmanın istenen ayar noktasından ne kadar uzakta olduğunu belirlemek için sensör değerlerini okuma. Ayar noktası, beklenen hedefe karşılık gelen sensör değeridir. Örneğin, bir bilek eklemi olan bir robot kol, belirli bir açıya çok hızlı bir şekilde hareket edebilmeli ve bir sensörle gösterildiği gibi bu açıda durabilmelidir. Potansiyometre, ölçüm yapabilen bir sensördür. Dönme açısı. Program, bir analog girişe bağlayarak, açı ile doğru orantılı bir voltaj ölçümü alabilir.

source: Compute an error (the difference between the sensor value and the desired value). The sign of the error value indicates which side of the setpoint the wrist is on. For example negative values might indicate that the measured wrist angle is larger than the desired wrist angle. The magnitude of the error is how far the measured wrist angle is from the actual wrist angle. If the error is zero, then the measured angle exactly matches the desired angle. The error can be used as an input to the PID algorithm to compute a motor speed.
es_mx: Al calcular un error (la diferencia entre los valores del sensor y los esperados). La señal de error en los valores indica en qué lado del punto de control se encuentra la muñeca. Por ejemplo, valores negativos pueden indicar que el ángulo medido es mayor al deseado. La magnitud del error determina la distancia entre el valor actual y el valor esperado del ángulo de la muñeca. Si el error es cero, esto quiere decir que el valor medido es exactamente igual al valor esperado. El error puede utilizarse como un dato de entrada para que el algoritmo PID calcule la velocidad del motor.
fr_ca: Calcul de l'écart (la différence entre la valeur du capteur et la valeur souhaitée). Le signe de la valeur de l'écart indique de quel côté de la valeur cible le poignet se trouve. Par exemple, des valeurs négatives peuvent indiquer que l'angle de poignet mesuré est supérieur à l'angle de poignet souhaité. L'ampleur de l'écart est la différence entre l'angle du poignet mesuré et l'angle réel du poignet. Si l'écart est nul, l'angle mesuré correspond exactement à l'angle souhaité. L'écart peut être utilisé comme entrée de l'algorithme PID pour calculer la vitesse d'un moteur.
tr_tr: Bir hatayı hesaplayın (sensör değeri ile istenen değer arasındaki fark). Hata değerinin işareti, bileğin ayar noktasının hangi tarafında olduğunu gösterir. Örneğin negatif değerler, ölçülen bilek açısının istenen bilek açısından daha büyük olduğunu gösterebilir. Hatanın büyüklüğü, ölçülen bilek açısının gerçek bilek açısından ne kadar uzakta olduğudur. Hata sıfır ise, ölçülen açı istenen açı ile tam olarak eşleşir. Hata, bir motor hızını hesaplamak için PID algoritmasına bir giriş olarak kullanılabilir.

source: The resultant motor speed is them used to drive the motor in the correct direction and a speed that hopefully will reach the setpoint as quickly as possible without overshooting (moving past the setpoint).
es_mx: La velocidad resultante del motor es utilizada después para conducir al robot en la dirección correcta a una velocidad que alcanzará el punto de control rápidamente sin excederse (moviéndose más allá del punto de control).
fr_ca: La vitesse du moteur qui en résulte est utilisée pour entraîner le moteur dans la bonne direction et à une vitesse qui, espérons-le, atteindra la valeur cible le plus rapidement possible sans dépassement (dépassement de la valeur cible).
tr_tr: Elde edilen motor hızı, motoru doğru yönde sürmek için kullanılırlar ve umarız ki ayar noktasına aşmadan (ayar noktasının ötesine geçerek) mümkün olan en kısa sürede ulaşır.

source: WPILib has a PIDController class that implements the PID algorithm and accepts constants that correspond to the Kp, Ki, and Kd values. The PID algorithm has three components that contribute to computing the motor speed from the error.
es_mx: WPILib cuenta con una clase PIDController que implementa el algoritmo PID y acepta constantes que corresponden a los valores Kp, Ki y Kd. El algoritmo PID tiene tres componentes que contribuyen al cálculo de la velocidad del motor a través del error.
fr_ca: WPILib a une classe PIDController qui supporte l'algorithme PID et accepte des constantes correspondant aux valeurs ``Kp``, ``Ki`` et ``Kd``. L'algorithme PID a trois composants qui contribuent au calcul de la vitesse du moteur à partir de l'écart.
tr_tr: WPILib, PID algoritmasını uygulayan ve Kp, Ki ve Kd değerlerine karşılık gelen sabitleri kabul eden bir PIDController sınıfına sahiptir. PID algoritmasının, hatadan motor hızının hesaplanmasına katkıda bulunan üç bileşeni vardır.

source: P (proportional) - this is a term that when multiplied by a constant (Kp) will generate a motor speed that will help move the motor in the correct direction and speed.
es_mx: P (proporcional) – Es el término que, al multiplicarse por una constante (Kp) generará una velocidad del motor que ayudará a mover al motor en la dirección correcta con la velocidad adecuada.
fr_ca: ``P`` (proportionnel) - c'est un terme qui, multiplié par une constante (``Kp``), générera une vitesse du moteur qui aidera à déplacer le moteur dans la bonne direction et à la bonne vitesse.
tr_tr: P (proportional-orantılı) - bu, bir sabit (Kp) ile çarpıldığında, motoru doğru yönde ve hızda hareket ettirmeye yardımcı olacak bir motor hızı oluşturacak bir terimdir.

source: I (integral) - this term is the sum of successive errors. The longer the error exists the larger the integral contribution will be. It is simply a sum of all the errors over time. If the wrist isn't quite getting to the setpoint because of a large load it is trying to move, the integral term will continue to increase (sum of the errors) until it contributes enough to the motor speed to get it to move to the setpoint. The sum of the errors is multiplied by a constant (Ki) to scale the integral term for the system.
es_mx: I (integral) - Es el término de la suma de errores sucesivos. Mientras más tiempo exista el error más grande será la contribución integral. Simplemente es una suma de todos los errores a través del tiempo. Si la muñeca no se acerca lo suficiente al punto de control debido a la gran carga que intenta mover, el término integral continuará aumentando (suma de errores) hasta que contribuya lo suficiente para que la velocidad del motor pueda alcanzar el punto de control. La suma de los errores se multiplica por una constante (Ki) para escalar el término integral para el sistema
fr_ca: ``I`` (intégrale) - ce terme est la somme des écarts successifs. Plus l'écart persiste, plus la contribution intégrale sera importante. Il s'agit simplement de la somme de tous les écarts dans le temps. Si le poignet n'atteint pas tout à fait la valeur cible en raison d'une grande charge qu'il essaie de déplacer, le terme intégral continuera d'augmenter (somme des écarts) jusqu'à ce qu'il contribue suffisamment à la vitesse du moteur pour le faire passer au point cible. La somme des écarts est multipliée par une constante (``Ki``) pour mettre à l'échelle le terme intégral du système.
tr_tr: I (integral) - bu terim ardışık hataların toplamıdır. Hata ne kadar uzunsa, integral katkısı o kadar büyük olacaktır. Zaman içindeki tüm hataların toplamıdır. Bilek hareket etmeye çalıştığı büyük bir yük nedeniyle ayar noktasına tam olarak ulaşamıyorsa, integral terimi, motor hızına hareket etmesi için yeterli katkıda bulunana kadar (hataların toplamı) artmaya devam edecektir. ayar noktası. Sistemin integral terimini ölçeklendirmek için hataların toplamı bir sabit (Ki) ile çarpılır.

source: D (differential) - this value is the rate of change of the errors. It is used to slow down the motor speed if it's moving too fast. It's computed by taking the difference between the current error value and the previous error value. It is also multiplied by a constant (kd) to scale it to match the rest of the system.
es_mx: D (diferencial) – Este valor es la tasa de cambio de los errores. Se utiliza para alentar la velocidad del motor cuando se mueve demasiado rápido. Se calcula de la diferencia entre el valor actual de error y el valor del error anterior. También se multiplica por una constante (Kd) para escalarlo y homologarlo con el resto del sistema.
fr_ca: ``D`` (différentiel) - cette valeur est le taux de variation des écarts. Elle est utilisée pour ralentir la vitesse du moteur s'il se déplace trop vite. Elle est calculée en prenant la différence entre la valeur d'écart actuelle et la valeur d'écart précédente. Elle est également multipliée par une constante (``Kd``) pour la mettre à l'échelle afin qu'elle corresponde au reste du système.
tr_tr: D (diferansiyel) - bu değer, hataların değişim oranıdır. Çok hızlı hareket ediyorsa motor hızını yavaşlatmak için kullanılır. Mevcut hata değeri ile önceki hata değeri arasındaki fark alınarak hesaplanır. Sistemin geri kalanıyla eşleşecek şekilde ölçeklendirmek için bir sabit (kd) ile çarpılır.

source: Tuning the PID Controller
es_mx: Sintonizar el controlador PID
fr_ca: Réglage du contrôleur PID
tr_tr: PID Denetleyicisinin Ayarlanması

source: Tuning the PID controller consists of picking constants that will give good performance. Shuffleboard helps this process by displaying the details of a PID subsystem with a user interface for setting constant values and testing how well it operates. This is displayed while the robot is operating in test mode (done by setting "Test" in the driver station).
es_mx: Sintonizar el controlador PID consiste en elegir valores constantes que aseguren un buen funcionamiento. Shuffleboard contribuye a este proceso al mostrar los detalles del subsistema PID a través de una interfaz de usuario para configurar los valores constantes y probar si operan adecuadamente. Esto se visualiza mientras el robot está operando en el modo de prueba (se configura habilitando “Test” en la driver station).
fr_ca: Le réglage du contrôleur PID consiste à choisir des constantes qui donneront de bonnes performances. Shuffleboard facilite ce processus en affichant les détails d'un sous-système PID avec une interface utilisateur pour définir les valeurs constantes et tester son bon fonctionnement. Ceci est affiché pendant que le robot fonctionne en mode Test (fait en réglant "Test" dans la station de pilotage).
tr_tr: PID denetleyicisinin ayarlanması, iyi performans sağlayacak toplama sabitlerinden oluşur. Shuffleboard, sabit değerleri ayarlamak ve ne kadar iyi çalıştığını test etmek için bir PID alt sisteminin ayrıntılarını bir kullanıcı arayüzüyle görüntüleyerek bu işleme yardımcı olur. Bu, robot test modunda çalışırken görüntülenir (sürücü istasyonunda "Test" ayarlanarak yapılır).

source: This is the test mode picture of a wrist subsystem that has a potentiometer as the sensor (pot) and a motor controller connected to the motor. It has a number of areas that correspond to the PIDSubsystem.
es_mx: Esta es la imagen del modo de prueba de un subsistema de muñeca que tiene un potenciómetro como sensor (pot) y un controlador de motor conectado al motor. Tiene una serie de áreas que corresponden al PIDSubsystem.
fr_ca: Il s’agit de l’image du mode Test d’un sous-système baptisé wrist qui représente un poignet articulé et qui a un potentiomètre comme capteur (pot) et un contrôleur de moteur connecté au moteur. Il a un certain nombre de champs qui correspondent au PIDSubsystem.
tr_tr: Bu, sensör (pot) olarak bir potansiyometreye ve motora bağlı bir motor kontrol cihazına sahip bir bilek alt sisteminin test modu resmidir. PIDS alt sistemine karşılık gelen bir dizi alana sahiptir.

source: The analog input voltage value from the potentiometer. This is the sensor input value.
es_mx: El valor de la entrada análoga del voltaje del potenciómetro. Este es el valor de entrada del sensor.
fr_ca: La valeur de la tension d'entrée analogique du potentiomètre. Il s'agit de la valeur d'entrée du capteur.
tr_tr: Potansiyometreden analog giriş voltajı değeri. Bu, sensör giriş değeridir.

source: A slider that moves the wrist motor in either direction with 0 as stopped. The positive and negative values correspond to moving up or down.
es_mx: Un intensificador que mueve el motor de la muñeca del brazo en cualquier dirección, con 0 como detenido. Los valores positivos y negativos corresponden a arriba o abajo.
fr_ca: Un curseur qui déplace le moteur du poignet dans les deux sens avec 0 à l'arrêt. Les valeurs positives et négatives correspondent à un déplacement vers le haut et vers le bas.
tr_tr: Wrist-Bilek motorunu durduğu halde 0 ile her iki yönde hareket ettiren bir sürgü. Pozitif ve negatif değerler yukarı veya aşağı hareket etmeye karşılık gelir.

source: The PID constants as described above (F is a feedforward value that is used for speed PID loops)
es_mx: Las constantes PID descritas arriba (F es para un valor preliminar que se utiliza en los lazos PID).
fr_ca: Les constantes PID telles que décrites ci-dessus (F est une valeur à action directe utilisée pour les boucles PID de vitesse)
tr_tr: Yukarıda açıklandığı gibi PID sabitleri (F, hız PID döngüleri için kullanılan ileri besleme değeridir)

source: The setpoint value that corresponds the to the pot value when the wrist has reached the desired value
es_mx: El punto de control que corresponde al valor de pot cuando la muñeca ha alcanzado el valor esperado.
fr_ca: La valeur cible qui correspond à la valeur du pot lorsque le poignet a atteint la valeur souhaitée
tr_tr: Wrist-Bilek istenen değere ulaştığında pot değerine karşılık gelen ayar noktası değeri

source: Enables the PID controller - No longer working, see below.
es_mx: Habilita el controlador PID - Ya no funciona, vea abajo.
fr_ca: Active le contrôleur PID - Ne fonctionne plus, voir ci-dessous.
tr_tr: PID denetleyicisini etkinleştirir - Artık çalışmaz, aşağıya bakın.

source: Try various PID gains to get the desired motor performance. You can look at the video linked to at the beginning of this article or other sources on the internet to get the desired performance.
es_mx: Pruebe varias varias veces el controlador PID para obtener el rendimiento de motor deseado. Puede mirar el vídeo enlazado al principio de este artículo o en otras fuentes de Internet para obtener el rendimiento deseado.
fr_ca: Essayez différents gains PID pour obtenir les performances moteur souhaitées. Vous pouvez regarder la vidéo liée au début de cet article ou d'autres sources sur Internet pour obtenir les performances souhaitées.
tr_tr: İstenen motor performansını elde etmek için çeşitli PID kazanımlarını deneyin. İstenilen performansı elde etmek için bu makalenin başında bağlantılı videoya veya internetteki diğer kaynaklara bakabilirsiniz.

source: The enable option does not affect the `PIDController <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__ introduced in 2020, as the controller is updated every robot loop. See the example below on how to retain this fuctionality.
es_mx: La opción de activación no afecta al `PIDController <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__ introducido en 2020, ya que el controlador se actualiza en cada bucle del robot. Vea el ejemplo a continuación sobre cómo conservar esta funcionalidad.
fr_ca: L'option enable n'affecte pas le `PIDController <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__ introduit en 2020, car le contrôleur est mis à jour à chaque boucle de robot. Consultez l'exemple ci-dessous pour savoir comment conserver cette fonctionnalité.
tr_tr: Etkinleştirme seçeneği, 2020'de kullanıma sunulan `PIDController <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__ 'ı etkilemez, kontrolör her robot döngüsünde güncellenirken. Bu işlevselliği nasıl koruyacağınıza ilişkin aşağıdaki örneğe bakın.

source: Enable Functionality in the New PIDController
es_mx: Habilitar la Funcionalidad en el Nuevo Controlador PID
fr_ca: Activer la fonctionnalité dans le nouveau PIDController
tr_tr: Yeni PIDController'de İşlevselliği Etkinleştirin

source: The following example demonstrates how to create a button on your dashboard that will enable/disable the PIDController.
es_mx: El siguiente ejemplo demuestra cómo crear un botón en la dashboard que habilite/deshabilite el controlador PID.
fr_ca: L'exemple suivant montre comment créer un bouton sur votre tableau de bord qui activera / désactivera le PIDController.
tr_tr: Aşağıdaki örnek, panonuzda PIDController'ı etkinleştirecek / devre dışı bırakacak bir düğmenin nasıl oluşturulacağını gösterir.
