Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/advanced-usage/shuffleboard-commands-subsystems.po
Languages: fr_ca, tr_tr

source: Commands and Subsystems
fr_ca: Commandes et sous-systèmes
tr_tr: Komutlar ve Alt Sistemler

source: When using the command-based framework Shuffleboard makes it easier to understand what the robot is doing by displaying the state of various commands and subsystems in real-time.
fr_ca: Lorsque vous utilisez le framework basé sur des commandes, Shuffleboard facilite la compréhension de ce que fait le robot en affichant l'état des différentes commandes et sous-systèmes en temps réel.
tr_tr: Komut tabanlı çerçeveyi kullanırken Shuffleboard, çeşitli komutların ve alt sistemlerin durumunu gerçek zamanlı olarak görüntüleyerek robotun ne yaptığını anlamayı kolaylaştırır.

source: Displaying Subsystems
fr_ca: Affichage des sous-systèmes
tr_tr: Alt Sistemleri Görüntüleme

source: To see the status of a subsystem while the robot is operating in either autonomous or teleoperated modes, that is what its default command is and what command is currently using that subsystem, send a subsystem instance to Shuffleboard:
fr_ca: Pour voir l'état d'un sous-système pendant que le robot fonctionne en mode autonome ou téléopéré, c'est-à-dire quelle est sa commande par défaut et quelle commande utilise actuellement ce sous-système, envoyez une instance de sous-système à Shuffleboard:
tr_tr: Robot otonom veya teleoperasyonlu modlarda çalışırken bir alt sistemin durumunu görmek için, varsayılan komutu budur ve şu anda bu alt sistemi hangi komut kullanıyor, Shuffleboard'a bir alt sistem örneği gönderin:

source: Shuffleboard will display the subsystem name, the default command associated with this subsystem, and the currently running command. In this example the default command for the Elevator subsystem is called ``AutonomousCommand`` and it is also the current command that is using the Elevator subsystem.
fr_ca: Shuffleboard affichera le nom du sous-système, la commande par défaut associée à ce sous-système et la commande en cours d'exécution. Dans cet exemple, la commande par défaut pour le sous-système Elevator est appelée ``AutonomousCommand`` et c'est également la commande actuelle qui utilise le sous-système Elevator.
tr_tr: Shuffleboard, alt sistem adını, bu alt sistemle ilişkili varsayılan komutu ve şu anda çalışan komutu görüntüleyecektir. Bu örnekte, Elevator alt sistemi için varsayılan komut ``AutonomousCommand`` olarak adlandırılır ve aynı zamanda Elevator alt sistemini kullanan mevcut komuttur.

source: Subsystems in Test Mode
fr_ca: Sous-systèmes en mode test
tr_tr: Test Modundaki Alt Sistemler

source: In Test mode (Test/Enabled in the driver station) subsystems may be displayed in the LiveWindow tab with the sensors and actuators of the subsystem. This is ideal for verifying of sensors are working by seeing the values that they are returning. In addition, actuators can be operated. For example, motors can be operated using sliders to set their commanded speed and direction. For PIDSubsystems the P, I, D, and F constants are displayed along with the setpoint and an enable control. This is useful for tuning PIDSubsystems by adjusting the constants, putting in a setpoint, and enabling the embedded PIDController. Then the mechanism's response can be observed. This cycle (change parameters, enable, and observe) can be repeated until a reasonable set of parameters is found.
fr_ca: En mode Test (Test/Enable sur la station de pilotage), des sous-systèmes peuvent être affichés dans l'onglet LiveWindow avec les capteurs et actionneurs du sous-système. C'est idéal pour vérifier que les capteurs fonctionnent en voyant les valeurs qu'ils renvoient. De plus, les actionneurs peuvent être commandés. Par exemple, les moteurs peuvent être actionnés à l'aide de curseurs pour définir leur vitesse et leur direction commandées. Pour les sous-systèmes PID, les constantes ``P``, ``I``, ``D`` et ``F`` sont affichées avec la valeur cible et un contrôle d'activation. Ceci est utile pour régler les sous-systèmes PID en ajustant les constantes, en insérant une valeur cible et en activant le contrôleur PID intégré. Ensuite, la réponse du mécanisme peut être observée. Ce cycle (modifier les paramètres, activer et observer) peut être répété jusqu'à ce qu'un ensemble raisonnable de paramètres soit trouvé.
tr_tr: Test modunda (Sürücü istasyonunda Test / Etkinleştirildi) alt sistemler, alt sistemin sensörleri ve aktüatörleriyle birlikte LiveWindow sekmesinde görüntülenebilir. Bu, sensörlerin geri döndükleri değerleri görerek çalıştığını doğrulamak için idealdir. Ek olarak, aktüatörler çalıştırılabilir. Örneğin motorlar, komut verilen hız ve yönlerini ayarlamak için kaydırıcılar kullanılarak çalıştırılabilir. PIDS alt sistemleri için P, I, D ve F sabitleri ayar noktası ve bir etkinleştirme kontrolü ile birlikte görüntülenir. Bu, sabitleri ayarlayarak, bir ayar noktası koyarak ve gömülü PIDController'ı etkinleştirerek PIDS alt sistemlerini ayarlamak için kullanışlıdır. Daha sonra mekanizmanın tepkisi gözlemlenebilir. Bu döngü (parametreleri değiştirme, etkinleştirme ve gözlemleme) makul bir parametre seti bulunana kadar tekrar edilebilir.

source: Todo
fr_ca: Ce qui reste à faire
tr_tr: Yapmak

source: Add RobotBuilder links
fr_ca: Ajouter des liens RobotBuilder
tr_tr: RobotBuilder bağlantıları ekleyin

source: More information on tuning PIDSubsystems can be found :doc:`here <shuffleboard-tuning-pid>`. Using RobotBuilder will automatically generate the code to get the subsystem displayed in Test mode. The code that is necessary to have subsystems displayed is shown below where subsystem-name is a string containing the name of the subsystem:
fr_ca: Plus d'informations sur le réglage des sous-systèmes PID peuvent être trouvées :doc:`ici <shuffleboard-tuning-pid>`. L'utilisation de RobotBuilder générera automatiquement le code pour afficher le sous-système en mode Test. Le code nécessaire pour afficher les sous-systèmes est indiqué ci-dessous, où "subsystem-name" est une chaîne de caractères contenant le nom du sous-système:
tr_tr: PIDS alt sistemlerinin ayarlanması hakkında daha fazla bilgi bulunabilir :doc:`here <shuffleboard-tuning-pid>`. RobotBuilder'ı kullanmak, alt sistemi Test modunda görüntülemek için kodu otomatik olarak oluşturacaktır. Alt sistemlerin görüntülenmesi için gerekli olan kod aşağıda gösterilmiştir; burada alt sistem adı, alt sistemin adını içeren bir dizedir:

source: Displaying Commands
fr_ca: Affichage des commandes
tr_tr: Komutları Görüntüleme

source: Using commands and subsystems makes very modular robot programs that can easily be tested and modified. Part of this is because commands can be written completely independently of other commands and can therefor be easily run from Shuffleboard. To write a command to Shuffleboard use the ``SmartDashboard.putData`` method as shown here:
fr_ca: L'utilisation de commandes et de sous-systèmes crée des programmes de robot très modulaires qui peuvent facilement être testés et modifiés. Cela est dû en partie au fait que les commandes peuvent être écrites en toute indépendance des autres commandes et peuvent donc être exécutées facilement à partir de Shuffleboard. Pour écrire une commande dans Shuffleboard, utilisez la méthode ``SmartDashboard.putData`` comme indiqué ici:
tr_tr: Komutları ve alt sistemleri kullanmak, kolayca test edilebilen ve değiştirilebilen çok modüler robot programları oluşturur. Bunun bir nedeni, komutların diğer komutlardan tamamen bağımsız olarak yazılabilmesi ve bu nedenle Shuffleboard'dan kolayca çalıştırılabilmesidir. Shuffleboard'a bir komut yazmak için, burada gösterildiği gibi `` SmartDashboard.putData '' yöntemini kullanın:

source: Shuffleboard will display the command name and a button to execute the command. In this way individual commands and command groups can easily be tested without needing special test code in a robot program. In the image below there are a number of commands contained in a Shuffleboard list. Pressing the button once runs the command and pressing it again stops the command. To use this feature the robot must be enabled in teleop mode.
fr_ca: Shuffleboard affichera le nom de la commande et un bouton pour exécuter la commande. De cette façon, les commandes individuelles et les groupes de commandes peuvent facilement être testés sans avoir besoin de code de test spécial dans un programme de robot. Dans l'image ci-dessous, il y a un certain nombre de commandes contenues dans une liste Shuffleboard. Appuyez une fois sur le bouton pour exécuter la commande et appuyez à nouveau pour l'arrêter. Pour utiliser cette fonction, le robot doit être activé en mode téléop.
tr_tr: Shuffleboard, komut adını ve komutu yürütmek için bir button-düğme görüntüler. Bu şekilde, bir robot programında özel test koduna ihtiyaç duymadan bireysel komutlar ve komut grupları kolayca test edilebilir. Aşağıdaki resimde, Shuffleboard listesinde bulunan birkaç komut vardır. Düğmeye bir kez basmak komutu çalıştırır ve tekrar basmak komutu durdurur. Bu özelliği kullanmak için robotun teleop modunda etkinleştirilmesi gerekir.
