Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/motors/wpi-drive-classes.po
Languages: es_mx, fr_ca, tr_tr

source: WPILib provides separate Robot Drive classes for the most common drive train configurations (differential, mecanum, and Killough). The DifferentialDrive class handles the differential drivetrain configuration. These drive bases typically have two or more in-line traction or omni wheels per side (e.g., 6WD or 8WD) and may also be known as "skid-steer", "tank drive", or "West Coast Drive" (WCD). The Kit of Parts drivetrain is an example of a differential drive. There are methods to control the drive with 3 different styles ("Tank", "Arcade", or "Curvature"), explained in the article below.
es_mx: WPILib proporciona clases separadas de Robot Drive para las configuraciones de entrenamiento de manejo mas comunes (differential, mecanum y Killough). La clase differential Drive maneja la configuración de transmisión diferencial. Estas basas de accionamiento suelen tener dos o más ruedas en línea de tracción u omnidireccionales por lado (p. ej., 6WD u 8WD) y también pueden conocerse como “skid-steer”, “tank drive”, or West Coast Drive” (WCD). La transmisión del kit de piezas es un ejemplo de differential drive. Existen métodos para controlar la unidad con 3 estilos diferentes (“Tank”, “Arcade” o “Curvature”), explicado en el articulo a continuación.
fr_ca: WPILib fournit des classes Robot Drive distinctes pour les configurations de trains d'entraînement les plus courantes (différentiel, Mécanum et Killough). La classe DifferentialDrive gère la configuration de la transmission différentielle. Ces bases d'entraînement ont généralement deux ou plusieurs roues motrices en ligne ou omnidirectionnelles par côté (par exemple, 6WD ou 8WD) et peuvent également être appelées "skid-steer", "tank drive" ou "West Coast Drive". La transmission du Kit de pièces est un exemple d'entraînement différentiel. Il existe des méthodes pour contrôler l'entrainement avec 3 styles différents ("Tank", "Arcade" ou "Curvature"), expliqués dans l'article ci-dessous.

source: DifferentialDrive is a method provided for the control of "skid-steer" or "West Coast" drivetrains, such as the Kit of Parts chassis. Instantiating a DifferentialDrive is as simple as so:
es_mx: DifferentialDrive es un método proporcionado para el control de transmisiones “skid-steer” o “West Coast”, como el chasis del Kit de piezas. Crear una instancia de una unidad diferencial es tan simple como esto:
fr_ca: DifferentialDrive est une méthode fournie pour le contrôle des transmissions "skid-steer" ou "West Coast", comme le châssis du Kit de pièces. L'instanciation d'un DifferentialDrive est aussi simple que cela:

source: C++ (Header)
es_mx: C++ (Encabezado)
fr_ca: C++ (Header ou en-tête)
tr_tr: C ++ (Header-Üstbilgi)

source: Multi-Motor DifferentialDrive with MotorControllerGroups
fr_ca: DifferentialDrive multimoteur avec MotorControllerGroups

source: Many FRC\ |reg| drivetrains have more than 1 motor on each side. In order to use these with DifferentialDrive, the motors on each side have to be collected into a single MotorController, using the MotorControllerGroup class. The examples below show a 4 motor (2 per side) drivetrain. To extend to more motors, simply create the additional controllers and pass them all into the MotorController group constructor (it takes an arbitrary number of inputs).
fr_ca: Beaucoup de FRC\ |reg| les transmissions ont plus d'un moteur de chaque côté. Afin de les utiliser avec DifferentialDrive, les moteurs de chaque côté doivent être regroupés dans un seul MotorController, en utilisant la classe MotorControllerGroup. Les exemples ci-dessous montrent une transmission à 4 moteurs (2 par côté). Pour étendre à plus de moteurs, créez simplement les contrôleurs supplémentaires et transmettez-les tous dans le constructeur de groupe MotorController (qui prend un nombre arbitraire d'entrées).

source: Drive Modes
es_mx: Modos de manejo
fr_ca: Modes de conduite

source: The DifferentialDrive class contains three different default modes of driving your robot's motors.
es_mx: La clase DifferentialDrive contiene tres modos predeterminados diferentes para conducir sus motores del robot.
fr_ca: La classe DifferentialDrive contient trois différents modes de pilotage (par défaut)

source: Tank Drive, which controls the left and right side independently
es_mx: Tank Drive, que controla los lados izquierdo y derecho de forma independiente
fr_ca: Tank Drive, qui contrôle les côtés gauche et droit de façon indépendante

source: Arcade Drive, which controls a forward and turn speed
es_mx: Arcade Drive, que controla la velocidad de avance y giro
fr_ca: Arcade Drive, qui contrôle la vitesse vers l'avant/arrière et le virage

source: Curvature Drive, a subset of Arcade Drive, which makes your robot handle like a car with constant-curvature turns.
es_mx: Curvature Drive, un subconjunto de Arcade Drive, que hace que su robot se maneje como un automóvil con giros de curvatura constante.
fr_ca: Curvature Drive, un sous-ensemble d'Arcade Drive, qui fait que votre robot se comporte comme une voiture avec des virages à courbure constante.

source: The DifferentialDrive class contains three default methods for controlling skid-steer or WCD robots. Note that you can create your own methods of controlling the robot's driving and have them call tankDrive() with the derived inputs for left and right motors.
es_mx: La clase DifferentialDrive contiene tres métodos predeterminados para controlar los robots de dirección deslizante o WCD. Tenga en cuenta que puede crear sus propios métodos para controlar la conducción del robot y hacer que llamen a tankDrive() con las entradas derivadas para los motores izquierdo y derecho.
fr_ca: La classe DifferentialDrive contient trois méthodes par défaut pour contrôler les robots de dérapage ou de WCD. Notez que vous pouvez créer vos propres méthodes de contrôle de la conduite du robot et les faire appeler tankDrive() avec les entrées dérivées pour les moteurs gauche et droit.

source: The Tank Drive mode is used to control each side of the drivetrain independently (usually with an individual joystick axis controlling each). This example shows how to use the Y-axis of two separate joysticks to run the drivetrain in Tank mode. Construction of the objects has been omitted, for above for drivetrain construction and here for Joystick construction.
es_mx: El modo Tank Drive se usa para controlar cada lado del drivetrain de forma independiente (generalmente con un eje de joystick individual que controla cada uno). Este ejemplo muestra cómo usar el eje Y de dos palancas de mando separadas para ejecutar la transmisión en modo Tank. La construcción de los objetos ha sido omitida, para arriba drivetrain y aquí para Joystick.
fr_ca: Le mode Tank Drive est utilisé pour contrôler chaque côté du train d'entraînement de façon indépendante (généralement avec un axe de joystick (manette) individuel contrôlant chacun des côtés). Cet exemple montre comment utiliser l'axe Y de deux joysticks séparés pour un train d'entraînement opéré en mode Tank. La construction des objets a été omise, ci-dessus pour la transmission et ci-dessous pour la construction du joystick.

source: The Arcade Drive mode is used to control the drivetrain using speed/throttle and rotation rate. This is typically used either with two axes from a single joystick, or split across joysticks (often on a single gamepad) with the throttle coming from one stick and the rotation from another. This example shows how to use a single joystick with the Arcade mode. Construction of the objects has been omitted, for above for drivetrain construction and here for Joystick construction.
es_mx: El modo Arcade Drive se usa para controlar el drivetrain mediante la velocidad / aceleración y la velocidad de la rotación. Esto generalmente se usa con dos ejes de un solo joystick, o dividido en joysticks (a menudo en un solo gamepad) con el acelerador proveniente de una palanca y la rotación de otra. Este ejemplo muestra cómo usar un solo joystick con el modo Arcade. La construcción de los objetos ha sido omitida, para arriba para la construcción de drivetrain y aquí para la construcción de Joystick.
fr_ca: Le mode Arcade Drive est utilisé pour contrôler le train d'entraînement en utilisant la vitesse/l'accélérateur et le taux de rotation. Ceci est implémenté soit avec les deux axes provenant d'un seul joystick, soit divisé en joysticks (souvent sur une seule manette de jeu) avec l'accélérateur venant d'un joystick et la rotation d'un autre. Cet exemple montre comment utiliser un seul joystick avec le mode Arcade. La construction des objets a été omise, ci-dessus pour la transmission et c-dessous pour la construction du joystick.

source: Like Arcade Drive, the Curvature Drive mode is used to control the drivetrain using speed/throttle and rotation rate. The difference is that the rotation control input controls the radius of curvature instead of rate of heading change, much like the steering wheel of a car. This mode also supports turning in place, which is enabled when the third :code:`boolean` parameter is true.
es_mx: Al igual que Arcade Drive, el modo Curvature Drive se usa para controlar el drivetrain usando velocidad/aceleración y tasa de rotación. La diferencia es que la entrada de control de rotación controla el radio de curvatura en lugar de la tasa de cambio de rumbo, al igual que el volante de un automóvil. Este modo también admite girar en su lugar, que se habilita cuando el tercer parámetro :code:`boolean` es verdadero.
fr_ca: Comme Arcade Drive, le mode Curvature Drive est utilisé pour contrôler la transmission en utilisant la vitesse/accélérateur et la vitesse de rotation. La différence est que l'entrée de commande de rotation contrôle le rayon de courbure au lieu du taux de changement de cap, un peu comme le volant d'une voiture. Ce mode prend également en charge la mise en place, qui est activée lorsque le troisième paramètre :code:`boolean` est à l'état vrai (true).

source: Using the MecanumDrive class to control Mecanum Drive robots
es_mx: Uso de la clase MecanumDrive para controlar los robots Mecanum Drive
fr_ca: Utilisation de la classe MecanumDrive pour contrôler les robots avec trains d'entraînement Mécanum

source: MecanumDrive is a method provided for the control of holonomic drivetrains with Mecanum wheels, such as the Kit of Parts chassis with the mecanum drive upgrade kit, as shown above. Instantiating a MecanumDrive is as simple as so:
es_mx: MecanumDrive es un método proporcionado para el control de transmisiones holonómicas con ruedas Mecanum, como el chasis del kit de piezas con el kit de actualización de la transmisión mecanum, como se muestra arriba. Crear una instancia de MecanumDrive es tan simple como esto:
fr_ca: MecanumDrive est une méthode fournie pour le contrôle des transmissions holonomiques avec roues Mécanum, telles que le châssis du Kit de pièces, augmenté du kit Mécanum, comme illustré ci-dessus. Instancier un MecanumDrive est aussi simple que ceci:

source: Mecanum Drive Modes
es_mx: Modos de manejo mecanum
fr_ca: Modes d'entraînement Mécanum

source: The drive axis conventions are different from common joystick axis conventions. See the `Axis Conventions`_ above for more information.
es_mx: Las convenciones del eje de accionamiento son diferentes de las convenciones comunes del eje del joystick. Ver las convenciones del eje anteriores para más información.
fr_ca: Les conventions d'axe d'entraînement sont différentes des conventions d'axe de joystick courantes. Voir les `Conventions d'axe`_ ci-dessus pour plus d'informations.

source: The MecanumDrive class contains two different default modes of driving your robot's motors.
es_mx: La clase MecanumDrive contiene dos modos predeterminados diferentes para conducir los motores de su robot.
fr_ca: La classe MecanumDrive contient deux différents modes de pilotage (par défaut)

source: driveCartesian: Angles are measured clockwise from the positive X axis. The robot's speed is independent from its angle or rotation rate.
es_mx: driveCartesian: los ángulos se miden en sentido horario desde el eje X positivo. La velocidad de los robots es independiente de su ángulo o velocidad de rotación.
fr_ca: driveCartesian: Les angles sont mesurés dans le sens horaire à partir de l'axe X positif. La vitesse du robot est indépendante de son angle ou de sa vitesse de rotation.

source: drivePolar: Angles are measured counter-clockwise from straight ahead. The speed at which the robot drives (translation) is independent from its angle or rotation rate.
es_mx: drivePolar: los ángulos se miden en sentido antihorario desde el frente. La velocidad a que el robot conduce (traslación) es independiente de su ángulo o velocidad de rotación.
fr_ca: drivePolar: Les angles sont mesurés dans le sens antihoraire à partir de la ligne droite. La vitesse à laquelle le robot roule (translation) est indépendante de son angle ou de sa vitesse de rotation.

source: Field-Oriented Driving
es_mx: Conducción con orientación del campo
fr_ca: Conduite orientée sur le terrain

source: A 4th parameter can be supplied to the ``driveCartesian(double ySpeed, double xSpeed, double zRotation, double gyroAngle)`` method, the angle returned from a Gyro sensor. This will adjust the rotation value supplied. This is particularly useful with mecanum drive since, for the purposes of steering, the robot really has no front, back or sides. It can go in any direction. Adding the angle in degrees from a gyro object will cause the robot to move away from the drivers when the joystick is pushed forwards, and towards the drivers when it is pulled towards them, regardless of what direction the robot is facing.
es_mx: Se puede suministrar un 4to parámetro al método ``driveCartesian(doble ySpeed, doble xSpeed, doble zRotation, doble gyroAngle)``, el ángulo devuelto por un sensor Gyro. Esto ajustará el valor de rotación suministrado. Esto es particularmente útil con mecanum drive dado que, a los efectos de la dirección, el robot realmente no tiene frente, parte posterior o laterales. Puede entrar cualquier dirección. Agregar el ángulo en grados desde un objeto giroscópico hará que el robot se mueva lejos de los conductores cuando el joystick se empuja hacia adelante, y hacia los conductores cuando se tira hacia ellos, independientemente de la dirección que esté mirando el robot.
fr_ca: Un 4ème paramètre peut être fourni à la méthode ``driveCartesian (double ySpeed, double xSpeed, double zRotation, double gyroAngle)``, soit l'angle renvoyé par un capteur gyroscopique. Cela ajustera la valeur de rotation fournie. Ceci est particulièrement utile avec le Mécanum car, aux fins de la direction, le robot n'a vraiment ni avant, ni arrière, ni côtés. Il peut aller dans n'importe quelle direction. L'ajout de l'angle en degrés par rapport à un objet gyroscopique entraînera le robot à s'éloigner des pilotes lorsque le joystick est poussé vers l'avant et vers les pilotes lorsqu'il est tiré vers eux, quelle que soit la direction dans laquelle le robot fait face.

source: The use of field-oriented driving makes often makes the robot much easier to drive, especially compared to a "robot-oriented" drive system where the controls are reversed when the robot is facing the drivers.
es_mx: El uso de la conducción orientada al campo a menudo hace que el robot sea mucho más fácil de conducir, especialmente en comparación con un sistema de accionamiento "orientado al robot" donde los controles se invierten cuando el robot se enfrenta a los conductores.
fr_ca: L'utilisation de la conduite orientée sur le terrain rend souvent le robot beaucoup plus facile à conduire, en particulier par rapport à un système d'entraînement "orienté robot" où les commandes sont inversées lorsque le robot fait face aux conducteurs.

source: Just remember to get the gyro angle each time ``driveCartesian()`` is called.
es_mx: Solo recuerde obtener el ángulo giroscópico cada vez que se llame a ``driveCartesian()``.
fr_ca: N'oubliez pas d'obtenir l'angle gyroscopique chaque fois que la méthode ``driveCartesian()`` est appelée.

source: Many teams also like to ramp the joysticks inputs over time to promote a smooth acceleration and reduce jerk. This can be accomplished with a :ref:`Slew Rate Limiter <docs/software/advanced-controls/filters/slew-rate-limiter:Slew Rate Limiter>`.
es_mx: A muchos equipos también les gusta ramificar las entradas de los mandos en el tiempo para promover una aceleración suave y reducir las sacudidas. Esto se puede conseguir con un :ref:`Limitador de velocidad de giro <docs/software/advanced-controls/filters/slew-rate-limiter:Slew Rate Limiter>`.
fr_ca: Beaucoup d’équipes aiment aussi augmenter linéairement les entrées des joysticks au fil du temps pour avoir une accélération en douceur et réduire le jerk. Ceci peut être accompli avec un :ref:`Slew Rate Limiter <docs/software/advanced-controls/filters/slew-rate-limiter:Slew Rate Limiter>`.
tr_tr: Birçok takım zaman, pürüzsüz bir ivme ile sarsılmayı azaltmak için kumanda kolu gridilerini arttırmaktadır. Bu işlem bir :ref:`Slew Rate Limiter <docs/software/advanced-controls/filters/slew-rate-limiter:Slew Rate Limiter>` ile gerçekleştirilebilmektedir.

source: Motor Inversion
es_mx: Inversión motora

source: Squaring Inputs
es_mx: Cuadrar las entradas

source: Input Deadband
es_mx: Deadband de entrada

source: Maximum Output
es_mx: Salida máxima

source: C++ (Source)
es_mx: C++ (Fuente)
tr_tr: C ++ (Kaynak)

source: The purpose of the Motor Safety mechanism is the same as the purpose of a watchdog timer, to disable mechanisms which may cause harm to themselves, people, or property if the code locks up and does not properly update the actuator output. Motor Safety breaks this concept out on a per actuator basis so that you can appropriately determine where it is necessary and where it is not. Examples of mechanisms that should have motor safety enabled are systems like drive trains and arms. If these systems get latched on a particular value they could cause damage to their environment or themselves. An example of a mechanism that may not need motor safety is a spinning flywheel for a shooter. If this mechanism gets latched on a particular value it will simply continue spinning until the robot is disabled. By default Motor Safety is enabled for DifferentialDrive and MecanumDrive objects and disabled for all other motor controllers and servos.
tr_tr: Motor Güvenliği düzeneğinin amacı, bir güvenlik zamanlayıcısınınkiyle aynıdır: Kodun kilitlendiği ve aktüatör çıktısının doğru bir şekilde güncellenmediği durumlarda kendilerine, başkalarına veya çevreye zarar verebilecek düzenekleri etkisiz hale getirmek. Nerede gerekli olup nerede olmadığını uygun bir şekilde belirleyebilmeniz için Motor Güvenliği bu kavramı aktüatör başı bir şekilde gerçekleştirmektedir. Aktarma sistemleri ve kollar motor güvenliğinin etkinleştirilmesi gereken düzeneklere örnek olarak gösterilebilmektedir. Bu sistemler belirli bir değerde takılı kalırsa, çevrelerine veya kendilerine zarar verebilmektedir. Bir atıcının döner volanı motor güvenliğine ihtiyaç duymayabilen bir düzeneğe örnek olarak gösterilebilmektedir. Bu düzenek belrili bir değerde takılı kalırsa, sadece robot etkisiz hale gelinceye kadar dönmeye devam edecektir. Varsayılan olarak Motor Güvenliği DifferentialDrive ve MecanumDrive nesnelerinde etkin, diğer tüm motor kontrolörleri ve servolar içinse devre dışıdır.

source: The drive classes use the NWU axes convention (North-West-Up as external reference in the world frame). The positive X axis points ahead, the positive Y axis points left, and the positive Z axis points up. We use NWU here because the rest of the library, and math in general, use NWU axes convention.
tr_tr: Sürüş sınırları (dünya çerçevesinde dış bir referans olarak Kuzey-Batı-Yukarı) NWU eksen yönlerini kullanmaktadır. Pozitif X ekseni ileri, pozitif Y ekseni sola, pozitif Z ekseiyse yukarı bakmaktadır. Bu durum için NWU kullanmamızın sebebi kütüphanenin geri kalanının, ve genel olarak matematiğin, NWU eksen düzeni kullanıyor olmasıdır.

source: Joysticks follow NED (North-East-Down) convention, where the positive X axis points ahead, the positive Y axis points right, and the positive Z axis points down. However, it's important to note that axes values are rotations around the respective axes, not translations. When viewed with each axis pointing toward you, CCW is a positive value and CW is a negative value. Pushing forward on the joystick is a CW rotation around the Y axis, so you get a negative value. Pushing to the right is a CCW rotation around the X axis, so you get a positive value.
tr_tr: Kumanda kolları; pozitif X ekseni ileri, pozitif Y ekseni sağa, pozitif Z ekseniyse aşağıya bakan NED (Kuzey-Doğu-Aşağı) yönünü izlemektedir. Fakat eksen değerlerinin öteleme değil, ilgili eksenler etrafında dönme olduğu unutlmamalıdır. Tüm eksenler size bakacak şekilde görüntülendiğinde CCW pozitif bir değerken CW negatif bir değerdir. Kumanda kolunun sağa doğru oynatmak Y ekseni etrafında gerçekleşen bir CW dönmesidir, yani elde edilen değer negatif olacaktır. Kolunun ileri doğru oynatmak X ekseni etrafında gerçekleşen bir CCW dönmesidir, yani elde edilen değer pozitif olacaktır.

source: See the :doc:`/docs/software/basic-programming/coordinate-system` section for more detail about the axis conventions and coordinate systems.
tr_tr: Eksen düzenleri ve koordinat düzlemlerine dair daha fazla bilgi için bkz. :doc:`/docs/software/basic-programming/coordinate-system` bölümü.

source: WPILib provides separate Robot Drive classes for the most common drive train configurations (differential and mecanum). The DifferentialDrive class handles the differential drivetrain configuration. These drive bases typically have two or more in-line traction or omni wheels per side (e.g., 6WD or 8WD) and may also be known as "skid-steer", "tank drive", or "West Coast Drive" (WCD). The Kit of Parts drivetrain is an example of a differential drive. There are methods to control the drive with 3 different styles ("Tank", "Arcade", or "Curvature"), explained in the article below.
tr_tr: WPILib, en yaygın aktarma sistemi yapılandırmalı (diferansiyel ve mecanum) için ayrı Robot Drive sınıfları sağlamaktadır. DifferentialDrive sınıfı diferansiyel aktarma sistemi yapılandırmasını yönetmektedir. BU sürüş tabanları yaygın bir şekilde taraf başına iki veya daha fazla sıralı çekiş veya çok yönlü teker (6W veya 8W) içermekte ve "skid-steer", "tank drive" veya "West Coast Drive" (WCD) gibi isimlerle de anılabilmektedir. Parça Kiti aktarma sistemi diferansiyel sürüş için bir örnek olarak gösterilebilmektedir. Aşağıdaki yazıda açıklandığı üzere, sürüşü yönetmek için kullanılabilen 3 farklı tarz ("Tank", "Arcade" veya "Curvature") bulunmaktadır.

source: C++ (Source) :sync: C++ (Source)
tr_tr: C++ (Kaynak) C++ (Kaynak)

source: Multi-Motor DifferentialDrive
tr_tr: Çok Motorlu DifferentialDrive
