Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/motors/wpi-drive-classes.po
Languages: es_mx, fr_ca, tr_tr

source: Many FRC\ |reg| drivetrains have more than 1 motor on each side. Classes derived from ``PWMMotorController`` (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/motorcontrol/PWMMotorController.html>`__ / `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_p_w_m_motor_controller.html>`__ / :external:py:class:`Python <wpilib.PWMMotorController>`) have an ``addFollower`` method so that multiple follower motor controllers can be updated when the leader motor controller is commanded. CAN motor controllers have similar features, review the vendor's documentation to see how to use them. The examples below show a 4 motor (2 per side) drivetrain. To extend to more motors, simply create the additional controllers and use additional ``addFollower`` calls.
tr_tr: Birçok FRC\ |reg| aktarma sistemi taraf başına 1'den fazla motora sahiptir. ``PWMMotorController`` (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/motorcontrol/PWMMotorController.html>`__ / `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_p_w_m_motor_controller.html>`__ / :external:py:class:`Python <wpilib.PWMMotorController>`)'dan türetilen sınıflar, baş motor kontrolörüne komut verildiğinde birden fazla takipçi motor kontrolörünün güncellenebilmesi için ``addFollower`` metoduna sahiptir. CAN motor kontrolörleri benzer özelliklere sahiptir, bunların nasıl kullanıldığını görmek için satıcının sunduğu belgeleri gözden geçiriniz. Aşağıdaki örnekler (taraf başı 2 tane olmak üzere) 4 motorlu bir aktarma sistemini göstermektedir. Daha fazla motor eklemek için, ek kontrolörlerin oluşturulması ve ek ``addFollower`` çağrılarının kullanılması yeterli olacaktır.

source: Class variables (e.g. in Robot.java or Subsystem):
tr_tr: Sınıf değişkenleri (örn. Robot.java veya Alt sistem) aşağıdaki şekildedir:

source: In Robot or Subsystem constructor:
tr_tr: Robot veya Alt sistem constructor'ında aşağıdaki şekildedir:

source: A 4th parameter can be supplied to the ``driveCartesian(double ySpeed, double xSpeed, double zRotation, double gyroAngle)`` method, the angle returned from a Gyro sensor. This will adjust the rotation value supplied. This is particularly useful with mecanum drive since, for the purposes of steering, the robot really has no front, back, or sides. It can go in any direction. Adding the angle in degrees from a gyro object will cause the robot to move away from the drivers when the joystick is pushed forwards, and towards the drivers when it is pulled towards them, regardless of what direction the robot is facing.
tr_tr: Jiroskop değerinden döndürülen açı değeri şeklinde ``driveCartesian(double ySpeed, double xSpeed, double zRotation, double gyroAngle)`` metoduna 4. bir parametre eklenebilmektedir. Bu parametre sağlanan dönüş değerini ayarlayacaktır. Yönlendirme sebebinden ötürü robotun önü, arkası ya da yanları olmadığı için bu ayar özellikle mecanum sürüşü için faydalıdır. Robot herhangi bir yönde hareket edebilmektedir. Bir jiroskop nesnesinden derece olarak açının eklenmesi durumunda, robotun baktığı yön fark etmeksizin, kumanda kolu ileri oynatıldığında robotun sürücüden uzaklaşmasına, kol sürücülere doğru çekildiğindeyse robotun sürücülere doğru hareket etmesine sebep olacaktır.
