Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/motors/wpi-drive-classes.po
Languages: es_mx, fr_ca, tr_tr

source: Using the WPILib Classes to Drive your Robot
es_mx: Uso de las clases de WPILib para conducir su robot
fr_ca: Utilisation des classes WPILib pour piloter votre robot
tr_tr: Robotunuzu Sürmek için WPILib Sınıflarının Kullanımı

source: WPILib includes many classes to help make your robot get driving faster.
es_mx: WPILib incluye muchas clases para ayudar a que su robot conduzca más rápido.
fr_ca: WPILib comprend de nombreuses classes pour faciliter le développement de la programmation et obtenir un robot fonctionnel plus rapidement.
tr_tr: WPILib, robotunuzun daha kısa sürede işlevsel hale getirmeye yardımcı birçok sınıf içermektedir.

source: Standard drivetrains
es_mx: Chasis estándar
fr_ca: Transmissions standard
tr_tr: Standart aktarma sistemleri

source: Differential Drive Robots
es_mx: Robots con chasis diferencial
fr_ca: Robots à entraînement différentiel

source: The wiring of a simple differential drive robot.
fr_ca: Le câblage d’un simple robot à entraînement différentiel.
tr_tr: Basit bir diferansiyel sürüş robotunun kablolaması.

source: These drive bases typically have two or more in-line traction or omni wheels per side (e.g., 6WD or 8WD) and may also be known as "skid-steer", "tank drive", or "West Coast Drive". The Kit of Parts drivetrain is an example of a differential drive. These drivetrains are capable of driving forward/backward and can turn by driving the two sides in opposite directions causing the wheels to skid sideways. These drivetrains are not capable of sideways translational movement.
es_mx: Estas bases de transmisión suelen tener dos o más ruedas en línea u omnidireccionales por lado (p. Ej., 6WD u 8WD) y también pueden conocerse como "skid-steer", "tank drive" o "West Coast Drive". La transmisión del kit de piezas es un ejemplo de transmisión diferencial. Estas transmisiones son capaces de conducir hacia adelante / hacia atrás y puede girar conduciendo los dos lados en direcciones opuestas causando que las ruedas patinen de lado. Estas transmisiones no son capaces de moverse de manera lateral.
fr_ca: Ces bases d'entraînement ont généralement deux ou plusieurs roues motrices en ligne ou omnidirectionnelles par côté (par exemple, 6WD ou 8WD) et peuvent également être appelées "skid-steer", "tank drive" ou "West Coast Drive". La transmission du Kit de pièces est un exemple d'entraînement différentiel. Ces transmissions sont capables de faire avancer ou reculer le robot et peuvent le faire tourner en activant les moteurs de chaque côté dans des directions opposées, ce qui fait déraper les roues latéralement. Ces transmissions ne sont pas capables d'exécuter des mouvements de translation latéraux.
tr_tr: Bu sürüş tabanları tipik olarak her tarafta iki veya daha fazla sıralı çekiş veya çok yönlü tekerleklere (ör., 6WD veya 8WD) sahiptir ve diğer adlarıyla "skid-steer", "tank drive" veya "West Coast Drive" olarak da bilinmektedir. Parça kiti aktarma sistemi, diferansiyel sürücüye bir örnektir. Bu aktarma sistemleri ileri/geri hareket kabiliyetine sahip ve her iki tarafı zıt yönlerde hareket ettirip, tekerleklerin yana doğru kaymasına sebep olarak dönüş yapabilmektedir. Bu aktarma sistemleri, yanlamasına öteleme hareketine olanak tanımamaktadır.

source: Mecanum Drive
es_mx: Chasis mecanum
fr_ca: Entraînement de type Mécanum
tr_tr: Mecanum Sürüşü

source: A four wheel Mecanum robot using the KOP chassis.
fr_ca: Un robot Mecanum à quatre roues utilisant le châssis fourni dans le KOP.
tr_tr: KOP şasesini kullanan dört tekerlekli bir Mecanum robotu.

source: Mecanum drive is a method of driving using specially designed wheels that allow the robot to drive in any direction without changing the orientation of the robot. A robot with a conventional drivetrain (all wheels pointing in the same direction) must turn in the direction it needs to drive. A mecanum robot can move in any direction without first turning and is called a holonomic drive. The wheels (shown on this robot) have rollers that cause the forces from driving to be applied at a 45 degree angle rather than straight forward as in the case of a conventional drive.
es_mx: Chasis Mecanum es un método de conducción que utiliza ruedas especialmente diseñadas que permiten al robot conducir en cualquier dirección sin cambiar la orientación del robot. Un robot con una transmisión convencional (todas las ruedas apuntando en la misma dirección) debe girar en la dirección que se necesita conducir. Un robot mecanum puede moverse en cualquier dirección sin girar primero y se llama impulso holonómico. Las ruedas (que se muestran en este robot) tienen rodillos que causan las fuerzas de conducir para ser aplicado en un ángulo de 45 grados en lugar de en línea recta como en el caso de un accionamiento convencional.
fr_ca: L'entraînement Mécanum est une méthode de conduite utilisant des roues spécialement conçues qui permettent au robot de conduire dans n'importe quelle direction sans changer l'orientation du robot. Un robot avec une transmission conventionnelle (toutes les roues pointant dans la même direction) doit tourner dans la direction qu'il doit conduire. Un robot Mécanum peut se déplacer dans n'importe quelle direction sans avoir à tourner au préalable et est appelé un entraînement holonomique. Les roues (montrées sur ce robot) ont des rouleaux qui font que les forces de la conduite sont appliquées à un angle de 45 degrés plutôt que droit comme dans le cas d'un entraînement conventionnel.

source: When viewed from the top, the rollers on a mecanum drivetrain should form an 'X' pattern. This results in the force vectors (when driving the wheel forward) on the front two wheels pointing forward and inward and the rear two wheels pointing forward and outward. By spinning the wheels in different directions, various components of the force vectors cancel out, resulting in the desired robot movement. A quick chart of different movements has been provided below, drawing out the force vectors for each of these motions may help in understanding how these drivetrains work. By varying the speeds of the wheels in addition to the direction, movements can be combined resulting in translation in any direction and rotation, simultaneously.
es_mx: Cuando se ve desde la parte superior, los rodillos de una transmisión mecanum deben formar un patrón de "X". Esto da como resultado los vectores de fuerza (al conducir la rueda hacia adelante) en las dos ruedas delanteras apuntando hacia adelante y hacia adentro y las dos ruedas traseras apuntando hacia adelante y hacia afuera. Girando las ruedas en diferentes direcciones, varios componentes de los vectores de fuerza se cancelan, lo que resulta en el movimiento deseado del robot. Un gráfico rápido de diferentes movimientos se proporciona a continuación, extraer los vectores de fuerza para cada uno de estos movimientos puede ayudar en entender cómo funcionan estas transmisiones. Variando las velocidades de las ruedas, además a la dirección, los movimientos se pueden combinar dando como resultado la traslación en cualquier dirección y rotación, simultáneamente.
fr_ca: Lorsqu'ils sont vus du haut, les rouleaux d'une transmission Mécanum doivent former un motif en 'X'. Il en résulte que les vecteurs de force (lors de la conduite de la roue vers l'avant) sur les deux roues avant pointent vers l'avant et vers l'intérieur et les deux roues arrière pointent vers l'avant et vers l'extérieur. En faisant tourner les roues dans différentes directions, divers composants des vecteurs de force s'annulent, entraînant le mouvement souhaité du robot. Un tableau rapide des différents mouvements a été fourni ci-dessous, en traçant les vecteurs de force pour chacun de ces mouvements peut aider à comprendre comment ces transmissions fonctionnent. En faisant varier les vitesses des roues en plus de la direction, les mouvements peuvent être combinés, ce qui entraîne une translation dans n'importe quelle direction et rotation, simultanément.

source: Drive Class Conventions
es_mx: Convenciones de clase de conducción
fr_ca: Conventions utilisées par les classes

source: As of 2022, the right side of the drivetrain is **no longer** inverted by default. It is the responsibility of the user to manage proper inversions for their drivetrain. Users can invert motors by calling ``setInverted()``/``SetInverted()`` on their motor objects.
fr_ca: Depuis 2022, le côté droit de la transmission n'est **plus** inversé par défaut. Il est de la responsabilité de l'utilisateur de gérer les inversions appropriées de sa transmission. Les utilisateurs peuvent inverser les moteurs en appelant ``setInverted()``/``SetInverted()`` sur leurs objets moteurs.

source: When driving robots, it is often desirable to manipulate the joystick inputs such that the robot has finer control at low speeds while still using the full output range. One way to accomplish this is by squaring the joystick input, then reapplying the sign. By default the Differential Drive class will square the inputs. If this is not desired (e.g. if passing values in from a PIDController), use one of the drive methods with the squaredInputs parameter and set it to false.
es_mx: Al conducir robots, a menudo es deseable manipular las entradas del joystick de modo que el robot tiene un control más fino a bajas velocidades mientras sigue usando el rango de salida completo. Una forma de lograr esto es al cuadrar la entrada del joystick y luego volver a aplicar el signo. Por defecto la Differential Drive class cuadrará las entradas. Si esto no se desea (por ejemplo, si pasa valores desde un PID Controller), utilice uno de los métodos de accionamiento con el parámetro squaredInputs y configúrelo en falso.
fr_ca: Lors de la conduite de robots, il est souvent souhaitable de manipuler les entrées du joystick de sorte que le robot ait un contrôle plus précis à basse vitesse tout en utilisant toute la plage de sortie disponible. Une façon d'y parvenir est d'élever au carré la valeur absolue de l'entrée du joystick, puis de réappliquer le signe. Par défaut, la classe Differential Drive mettra les entrées au carré. Si cela n'est pas souhaité (par exemple, si vous transmettez des valeurs à partir d'un PIDController), utilisez l'une des méthodes d'entraînement et initialiser le paramètre squaredInputs à False.

source: By default, the Differential Drive class applies an input deadband of 0.02. This means that input values with a magnitude below 0.02 (after any squaring as described above) will be set to 0. In most cases these small inputs result from imperfect joystick centering and are not sufficient to cause drivetrain movement, the deadband helps reduce unnecessary motor heating that may result from applying these small values to the drivetrain. To change the deadband, use the `setDeadband()` method.
es_mx: Por defecto, la clase de Differential Drive aplica una banda muerta/deadband de entrada de 0.02. Esto significa que la entrada los valores con una magnitud inferior a 0.02 (después de cualquier cuadrado como se describe anteriormente) se establecerán en 0. En la mayoría de los casos, estas entradas pequeñas resultan del centrado imperfecto del joystick y no son suficientes para provocar el movimiento de la transmisión, la banda muerta ayuda a reducir el calentamiento innecesario del motor que puede resultar de aplicar estos pequeños valores a la transmisión. Para cambiar la banda muerta, use el método setDeadband().
fr_ca: Par défaut, la classe DifferentialDrive applique une zone morte d'entrée de 0.02. Cela signifie que toutes les valeurs d'entrée qui sont inférieures à 0.02 (après la mise au carré décrite ci-dessus) seront plutôt considérées comme ayant une valeur de zéro. Dans la plupart des cas, ces petites valeurs d'entrée résultent d'un centrage imparfait du joystick et ne sont pas suffisantes pour provoquer un mouvement du robot. En appliquant une zone morte, on réduit l'échauffement des moteurs provenant de l'énergie appliquée inutilement aux moteurs, lorsque le robot ne bouge pas. Pour modifier la zone morte, utilisez la méthode ``setDeadband()``.
tr_tr: Varsayılan olarak Diferansiyel Drive 0,02'lik bir ölü bant uygulamaktadır. Diğer bir deyişle (yukarıda açıklandığı üzere herhangi bir kareleme işleminden sonra) 0,02'den aşağı bir değere sahip giriş değerleri 0 olarak ayarlanacaktır. Çoğu durumda bu küçük girdiler eksik bir kumanda kolu merkezlemesinden kaynaklanmakta olup kendi başlarına aktarım sisteminin hareketine sebep olmak için yeterli değillerdir, ölü bant bu düşük değerlerin aktarma sistemine uygulanmasıyla ortaya çıkabilecek gereksiz motor ısınmasının önüne geçmektedir. Ölü bantı değiştirmek için `setDeadband()` metodunu kullanınız.

source: Sometimes drivers feel that their drivetrain is driving too fast and want to limit the output. This can be accomplished with the `setMaxOutput()` method. This maximum output is multiplied by result of the previous drive functions like deadband and squared inputs.
es_mx: A veces, los drivers sienten que su tren motriz conduce demasiado rápido y quieren limitar la salida. Esto se puede lograr con el método `setMaxOutput()`. Esta salida máxima se multiplica por el resultado de las funciones de accionamiento anteriores, como entradas cuadradas y de banda muerta.
fr_ca: Parfois, les pilotes ont l’impression que leur transmission roule trop vite et veulent limiter la sortie. Cela peut être accompli avec la méthode ``setMaxOutput()``. Cette sortie maximale est multipliée par le résultat des fonctions d’entraînement précédentes comme deadband et squared inputs.
tr_tr: Bazen aktarma sistemi robotu çok hızlı sürdüğü için sürücüler sistemin çıktısını sınırlamak isteyebilmektedir. Bu işlem `setMaxOutput()` metodu ile kolayca gerçekleştirilebilmektedir. Bu maksimum çıktı, ölü pant ve karelenmiş girdiler gibi önceki sürüş fonksiyonlarının sonuçlarıyla çarpılmaktadır.

source: Motor Safety
fr_ca: La sécurité moteur (Motor Safety)

source: Motor Safety is a mechanism in WPILib that takes the concept of a watchdog and breaks it out into one watchdog (Motor Safety timer) for each individual actuator. Note that this protection mechanism is in addition to the System Watchdog which is controlled by the Network Communications code and the FPGA and will disable all actuator outputs if it does not receive a valid data packet for 125ms.
es_mx: Motor Safety es un mecanismo en WPILib que toma el concepto de un perro guardián/watchdog y lo rompe a un perro guardián/watchdog (temporizador de seguridad del motor) para cada actuador individual. Tenga en cuenta que este mecanismo de protección es adicional al System Watchdog que es controlado por la red Código de comunicaciones y FPGA y deshabilitará todas las salidas del actuador si no recibe un paquete de datos válido para 125 ms.
fr_ca: Motor Safety est un mécanisme dans WPILib qui prend le concept d'un chien de garde (Watchdog) et crée une minuterie de sécurité pour chaque dispositif actionneur qui contrôle un moteur. Notez que ce mécanisme de protection s'ajoute au System Watchdog, celui-ci étant contrôlé par le code de communication réseau et le FPGA. Le Watchdog désactivera toutes les sorties du dispositif actionneur s'il ne reçoit pas de paquet de données valides pendant un délai de 125 ms.

source: The purpose of the Motor Safety mechanism is the same as the purpose of a watchdog timer, to disable mechanisms which may cause harm to themselves, people or property if the code locks up and does not properly update the actuator output. Motor Safety breaks this concept out on a per actuator basis so that you can appropriately determine where it is necessary and where it is not. Examples of mechanisms that should have motor safety enabled are systems like drive trains and arms. If these systems get latched on a particular value they could cause damage to their environment or themselves. An example of a mechanism that may not need motor safety is a spinning flywheel for a shooter. If this mechanism gets latched on a particular value it will simply continue spinning until the robot is disabled. By default Motor Safety is enabled for DifferentialDrive, KilloughDrive, and MecanumDrive objects and disabled for all other motor controllers and servos.
fr_ca: Le but du mécanisme de sécurité du moteur est le même que le but d'une minuterie de surveillance, pour désactiver les mécanismes qui peuvent causer des dommages à eux-mêmes, aux personnes ou aux biens si le code se bloque et ne met pas à jour correctement la sortie de l'actionneur. Motor Safety décompose ce concept actionneur par actionneur afin que vous puissiez déterminer de manière appropriée où il est nécessaire et où il ne l'est pas. Des exemples de mécanismes pour lesquels la sécurité des moteurs devrait être activée sont des systèmes tels que les transmissions et les bras. Si ces systèmes sont verrouillés sur une valeur particulière, ils pourraient causer des dommages à leur environnement ou à eux-mêmes. Un exemple de mécanisme qui peut ne pas avoir besoin de sécurité moteur est un volant d'inertie en rotation pour un tireur. Si ce mécanisme est verrouillé sur une valeur particulière, il continuera simplement à tourner jusqu'à ce que le robot soit désactivé. Par défaut, la sécurité moteur est activée pour les objets DifferentialDrive, KilloughDrive et MecanumDrive et désactivée pour tous les autres contrôleurs de moteur et servomoteurs.

source: The Motor Safety feature operates by maintaining a timer that tracks how long it has been since the feed() method has been called for that actuator. Code in the Driver Station class initiates a comparison of these timers to the timeout values for any actuator with safety enabled every 5 received packets (100ms nominal). The set() methods of each motor controller class and the set() and setAngle() methods of the servo class call feed() to indicate that the output of the actuator has been updated.
es_mx: La característica de Seguridad del Motor opera manteniendo un temporizador que rastrea cuánto tiempo ha pasado desde que el método feed() ha sido llamado para ese actuador. El código en la clase Driver Station inicia una comparación de estos temporizadores con los valores de tiempo de espera para cualquier actuador con la seguridad activada cada 5 paquetes recibidos (100ms nominal). Los métodos set() de cada clase de controlador de motor y los métodos set() y setAngle() de la clase servo llaman a feed() para indicar que la salida del actuador ha sido actualizada.
fr_ca: La fonction Motor Safety d'un actionneur fonctionne en maintenant un timer qui surveille et enregistre le temps qui s'est écoulé depuis que le dernier appel de la méthode ``feed()`` pour cet actionneur. Un code dans la classe DriverStation initie une comparaison de ces timers aux valeurs de délai d’attente pour tout actionneur avec la sécurité activé tous les 5 paquets reçus (100ms nominal). Les méthodes set() de chaque classe de contrôleur de moteur et les méthodes ``set()`` et ``setAngle()`` de la classe servo font un appel à la méthode ``feed()`` pour indiquer que la sortie de l’actionneur a été mise à jour.

source: The Motor Safety interface of motor controllers can be interacted with by the user using the following methods:
es_mx: El usuario puede interactuar con la interfaz de seguridad del motor de los controladores de velocidad utilizando siguientes métodos:
fr_ca: L’interface Motor Safety des contrôleurs moteurs peut être en interaction avec l’utilisateur par l'intermédiaire des méthodes suivantes:

source: By default all Drive objects enable Motor Safety. Depending on the mechanism and the structure of your program, you may wish to configure the timeout length of the motor safety (in seconds). The timeout length is configured on a per actuator basis and is not a global setting. The default (and minimum useful) value is 100ms.
fr_ca: Par défaut, tous les objets Drive activent la sécurité moteur. Selon le mécanisme et la structure de votre programme, vous pouvez souhaiter configurer la durée de temporisation de la sécurité moteur (en secondes). La durée du timeout est configurée par actionneur et n'est pas un paramètre global. La valeur par défaut (et minimale utile) est de 100 ms.
tr_tr: Varsayılan olarak tüm Drive nesneleri, Motor Güvenliğini etkinleştirmektedir. Düzenek ve programın yapısına bağlı olarak, (saniye biriminde) motor güvenliği zaman aşımını yapılandırmak isteyebilirsiniz. Zaman aşımı süresi aktüatör başına gerçekleştirilen bir yapılandırmadır, genel bir ayar değildir. Varsayılan (ve faydalı en düşük) değer 100ms'dir.

source: Axis Conventions
es_mx: Convenciones del Eje
fr_ca: Conventions des axes
tr_tr: Eksen Düzenleri

source: Show the axis of the robot with X+ going forward. Y+ to the right and Z+ downward.
fr_ca: Montrez l’axe du robot avec X + en se dirigeant vers l'avant. Y+ à droite et Z+ vers le bas.

source: The drive classes use the NED axes convention (North-East-Down as external reference in the world frame). The positive X axis points ahead, the positive Y axis points right, and the positive Z axis points down. The rest of the library, and math in general, uses NWU axes convention (North-West-Up). We use NED here because joysticks use NED, and they use NED because the aviation industry does.
fr_ca: Les classes d'entraînement utilisent la convention d'axes NED (Nord-Est-Bas comme référence externe dans le référentiel mondial). L'axe X positif pointe vers l'avant, l'axe Y positif pointe vers la droite et l'axe Z positif pointe vers le bas. Le reste de la librairie, et les mathématiques en général, utilisent la convention des axes NWU (Nord-Ouest-Up). Nous utilisons NED ici parce que les joysticks utilisent NED, et ils utilisent NED parce que l'industrie aéronautique le fait.

source: Joysticks follow NED convention, but it's important to note that axes values are rotations around the respective axes, not translations. When viewed with each axis pointing toward you, CCW is a positive value and CW is a negative value. Pushing forward on the joystick is a CW rotation around the Y axis, so you get a negative value. Pushing to the right is a CCW rotation around the X axis, so you get a positive value.
fr_ca: Les joysticks suivent la convention NED, mais il est important de noter que les valeurs des axes sont des rotations autour des axes respectifs, pas des translations. Vu avec chaque axe pointant vers vous, CCW (sens anti-horaire) est une valeur positive et CW (sens horaire) est une valeur négative. Pousser vers l'avant sur le joystick est une rotation CW autour de l'axe Y, vous obtenez donc une valeur négative. Pousser vers la droite est une rotation CCW autour de l'axe X, vous obtenez donc une valeur positive.

source: The ``MecanumDrive`` class does not follow this convention. The positive Y axis points ahead, the positive X axis points right. This may change in a future year's WPILib release.
fr_ca: La classe ``MecanumDrive`` ne suit pas cette convention. L'axe Y positif pointe vers l'avant, l'axe X positif pointe vers la droite. Cela peut changer dans la version WPILib d'une année future.

source: Using the DifferentialDrive class to control Differential Drive robots
es_mx: Uso de la clase DifferentialDrive para controlar robots de accionamiento diferencial
fr_ca: Utilisation de la classe DifferentialDrive pour contrôler les robots à entraînement différentiel (WCD)
tr_tr: Diferansiyel Sürüşe sahip robotların yönetimi için DifferentialDrive sınıfını kullanmak
