Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/pathweaver/adding-field-images.po
Languages: es_mx, tr_tr

source: Adding field images to PathWeaver
es_mx: Añadiendo Imágenes dela Cancha a PathWeaver
tr_tr: PathWeaver'a alan görüntüleri ekleme

source: Here are instructions for adding your own field image using the 2019 game as an example.
es_mx: Aquí están las instrucciones para añadir sus propias imágenes del campo usando el juego de 2019 como ejemplo.
tr_tr: 2019 oyununu örnek olarak kullanarak kendi saha görüntünüzü eklemeye yönelik talimatları burada bulabilirsiniz.

source: Games are loaded from the ``~/PathWeaver/Games`` on Linux and macOS or ``%USERPROFILE%/PathWeaver/Games`` directory on Windows. The files can be in either a game-specific subdirectory, or in a zip file in the Games directory. The ZIP file must follow the same layout as a game directory; the JSON file must be in the root of the ZIP file (cannot be in a subdirectory).
es_mx: Los juegos se cargan desde el ``~/PathWeaver/Games`` en Linux y macOS o el directorio ``%USERPROFILE%/PathWeaver/Games`` en Windows. Los archivos pueden estar en un subdirectorio específico del juego, o en un archivo ZIP en el directorio Games. El archivo ZIP debe seguir el mismo diseño que un directorio del juego; el archivo JSON debe estar en la raíz del archivo ZIP (no puede estar en un subdirectorio).
tr_tr: Oyunlar, Linux ve macOS'ta ``~ / PathWeaver /Games`` veya Windows'ta ``% USERPROFILE% / PathWeaver / Games`` dizininden yüklenir. Dosyalar, oyuna özel bir alt dizinde veya Oyunlar dizinindeki bir zip dosyasında olabilir. ZIP dosyası bir oyun dizini ile aynı düzeni izlemelidir; JSON dosyası ZIP dosyasının kök dizininde olmalıdır (bir alt dizinde olamaz).

source: Download the example *FIRST* Destination Deep Space field definition :download:`here <files/DeepSpace.zip>`. Other field definitions are available in the `PathWeaver GitHub repository <https://github.com/wpilibsuite/PathWeaver/tree/master/src/main/resources/edu/wpi/first/pathweaver>`__.
es_mx: Descargue el ejemplo de la definición del campo de juego de *FIRST* Destination Deep Space :download:`aquí <files/DeepSpace.zip>`. Otras definiciones del campo de juego están disponibles en `PathWeaver GitHub repository <https://github.com/wpilibsuite/PathWeaver/tree/master/src/main/resources/edu/wpi/first/pathweaver>`__.

source: File Layout
es_mx: Diseño del Archivo
tr_tr: Dosya Düzeni

source: JSON Format
es_mx: Formato JSON
tr_tr: JSON Biçimi

source: The path to the field image is relative to the JSON file. For simplicity, the image file should be in the same directory as the JSON file.
es_mx: La ruta de la imagen del campo es relativa al archivo JSON. Para simplificar, el archivo de la imagen debe estar en el mismo directorio que el archivo JSON.
tr_tr: Alan görüntüsünün yolu JSON dosyasına göredir. Basitlik açısından, görüntü dosyası JSON dosyasıyla aynı dizinde olmalıdır.

source: The field corners are the X and Y coordinates of the top-left and bottom-right pixels defining the rectangular boundary of the playable area in the field image. Non-rectangular playing areas are not supported.
es_mx: Las esquinas del campo son las coordenadas X & Y de los píxeles de arriba a la izquierda y de abajo a la derecha que definen el límite rectangular del área de juego en la imagen del campo. Las áreas de juego no rectangulares no son compatibles.
tr_tr: Alan köşeleri, alan görüntüsündeki oynatılabilir alanın dikdörtgen sınırını tanımlayan sol üst ve sağ alt piksellerin X ve Y koordinatlarıdır. Dikdörtgen olmayan oyun alanları desteklenmez.

source: The field size is the width and length of the playable area of the field in the provided units.
es_mx: El tamaño del campo es el ancho y el largo del área jugable del campo en las unidades proporcionadas.
tr_tr: Alan boyutu, sağlanan birimlerdeki sahanın oynanabilir alanının genişliği ve uzunluğudur.

source: The field units are case-insensitive and can be in meters, cm, mm, inches, feet, yards, or miles. Singular, plural, and abbreviations are supported (e.g. "meter","meters", and"m"are all valid for specifying meters)
es_mx: Las unidades de campo no distinguen entre mayúsculas y minúsculas y pueden estar en metros, centímetros, milímetros, pulgadas, pies, yardas o millas. Se admiten el singular, el plural y las abreviaturas(por ejemplo, "meter", "meters", y "m" son todas válidas para especificar la unidad de metros).
tr_tr: Alan birimleri büyük / küçük harfe duyarlı değildir ve metre, cm, mm, inç, fit, yard veya mil cinsinden olabilir. Tekil, çoğul ve kısaltmalar desteklenir (ör. "Metre", "metre" ve "m", sayaçları belirtmek için geçerlidir)

source: Download the example *FIRST* Destination Deep Space field definition :download:`here <files/DeepSpace.zip>`. Other field definitions are available in the `PathWeaver GitHub repository <https://github.com/wpilibsuite/PathWeaver/tree/main/src/main/resources/edu/wpi/first/pathweaver>`__.
tr_tr: Örneği indirin *FIRST* Hedef Derin Uzay alanı tanımı :download:`here <files/DeepSpace.zip>`. Diğer alan tanımları, PathWeaver GitHub deposunda <https://github.com/wpilibsuite/PathWeaver/tree/main/src/main/resources/edu/wpi/first/pathweaver>`__.
