Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/pathweaver/creating-pathweaver-project.po
Languages: fr_ca, tr_tr, zh_cn

source: Creating a Pathweaver Project
fr_ca: Création d’un projet Pathweaver
tr_tr: Pathweaver Projesi Oluşturma
zh_cn: 创建一个路径编织项目

source: PathWeaver is the tool used to draw the paths for a robot to follow. The paths for a single program are stored in a PathWeaver project.
fr_ca: Le PathWeaver est l’outil utilisé pour tracer les trajectoires qu'un robot va suivre. Un projet PathWeaver ne stocke que les trajectoires définies pour un seul programme.
tr_tr: PathWeaver, bir robotun izleyeceği yolları çizmek için kullanılan araçtır. Tek bir programın yolları PathWeaver projesinde saklanır.
zh_cn: 路径编织器是用于绘制机器人要遵循的路径的工具。单个程序的路径存储在路径编织器项目中。

source: Starting PathWeaver
fr_ca: Démarrage de PathWeaver
tr_tr: PathWeaver'ı Başlatma
zh_cn: 开始编织路径

source: PathWeaver is started by clicking on the ellipsis icon in the top right of the corner of the Visual Studio Code interface. You must select a source file from the WPILib project to see the icon. Then click on "Start tool" and then click on "PathWeaver" as shown below.
fr_ca: On lance le PathWeaver en cliquant sur l’icône en forme d'ellipse située en haut à droite du coin de l’interface Visual Studio Code. Vous devez sélectionner un fichier source dans le projet WPILib pour afficher l’icône. Cliquez ensuite sur "Start tool" puis cliquez sur "PathWeaver" tel qu'indiqué ci-dessous.
tr_tr: PathWeaver, Visual Studio Code arabiriminin köşesinin sağ üst köşesindeki üç nokta simgesine tıklanarak başlatılır. Simgeyi görmek için WPILib projesinden bir kaynak dosyası seçmelisiniz. Ardından "Başlat aracı" na tıklayın ve ardından aşağıda gösterildiği gibi "PathWeaver" a tıklayın.
zh_cn: 单击 Visual Studio 代码界面右上角的省略号图标可启动路径编织器。您必须从 WPILib 项目中选择一个源文件才能看到该图标。然后单击“启动工具”，然后单击 “Path Weaver”，如下所示。

source: Creating the Project
fr_ca: Création du projet
tr_tr: Projeyi Oluşturmak
zh_cn: 创建项目

source: To create a PathWeaver project, click on "Create project" and then fill out the project creation form. Notice that hovering over any of the fields in the form will display more information about what is required.
fr_ca: Pour créer un projet PathWeaver, cliquez sur "Create project", puis remplissez le formulaire de création de projet. Notez qu'en plaçant votre souris sur l’un des champs du formulaire vous afficherez plus d’informations sur ce qui est requis.
tr_tr: PathWeaver projesi oluşturmak için "Proje oluştur" üzerine tıklayın ve ardından proje oluşturma formunu doldurun. Formdaki alanlardan herhangi birinin üzerine gelmenin, neyin gerekli olduğu hakkında daha fazla bilgi görüntüleyeceğine dikkat edin.
zh_cn: 要创建路径编织项目，请单击 “Create Project”，然后填写项目创建表单。请注意，将鼠标悬停在表单中的任何场地上将显示有关所需内容的更多信息。

source: **Project Directory:** This is normally the top level project directory that contains the build.gradle and src files for your robot program. Choosing this directory is the expected way to use PathWeaver and will cause it to locate all the output files in the correct directories for automatic path deployment to your robot.
fr_ca: **Project Directory:** Il s’agit normalement du répertoire de projet de niveau supérieur qui contient les fichiers build.gradle et src pour votre programme de robot. Le choix de ce répertoire est la façon prévue d’utiliser PathWeaver et qui fera en sorte de localiser tous les fichiers de sortie dans les répertoires concordants pour le déploiement automatique du chemin d’accès à votre robot.
tr_tr: ** Proje Dizini: ** Bu normalde robot programınız için build.gradle ve src dosyalarını içeren en üst düzey proje dizinidir. Bu dizini seçmek PathWeaver'ı kullanmanın beklenen yoludur ve robotunuza otomatik yol dağıtımı için tüm çıktı dosyalarını doğru dizinlerde bulmasına neden olur.
zh_cn: 关于**Project Directory:** ： 这通常是顶层项目目录，其中包含机器人程序的 build.gradle 和 src 文件。选择此目录是使用路径编织器的预期方式，并且会使它在正确的目录中定位所有输出文件，以将路径自动部署到您的机器人。

source: **Output directory:** The directory where the paths are stored for deployment to your robot. If you specified the top level project folder of our robot project in the previous step (as recommended) filling in the output directory is optional.
fr_ca: **Output directory:** Répertoire où les trajectoires sont stockées pour le déploiement sur votre robot. Si vous avez spécifié le dossier de projet de niveau supérieur de votre projet de robot à l’étape précédente (comme recommandé), le remplissage du répertoire de sortie est facultatif.
tr_tr: ** Çıktı dizini: ** Robotunuza konuşlandırılmak üzere yolların depolandığı dizin. Robot projemizin üst düzey proje klasörünü önceki adımda belirlediyseniz (önerilen şekilde) çıktı dizinini doldurmak isteğe bağlıdır.
zh_cn: 关于**Output directory: **：存储路径以部署到您的机器人的目录。如果您在上一步中（根据建议）指定了我们的机器人项目的顶级项目文件夹，则可以选择填写项目目录。

source: **Game:** The game (which FRC\ |reg| game is being used) will cause the correct field image overlay to be used. You can also create your own field images and the procedure will be described later in this series.
fr_ca: **Game:** Le jeu (le jeu FRC\ |reg| en vigueur) provoquera l’utilisation de la superposition correcte d’image de terrain . Vous pouvez également créer vos propres images de terrain et la procédure sera décrite plus tard dans cette série.
tr_tr: **Game:** Oyun (FRC \ | reg | oyununun kullanıldığı) doğru alan görüntüsü kaplamasının kullanılmasına neden olacaktır. Ayrıca kendi alan görüntülerinizi de oluşturabilirsiniz ve prosedür bu dizinin ilerleyen kısımlarında açıklanacaktır.
zh_cn: 关于**Game:**：选择正确的比赛相关信息（正在使用哪个 FRC 比赛）将引用正确的场地图像叠加层。您也可以创建自己的场地图像，该过程将在本系列的后面部分中描述。

source: **Length Unit:** The units to be used in describing your robot and for the field measurements when visualizing trajectories using PathWeaver.
fr_ca: **Length Unit:** Les unités à utiliser pour décrire votre robot et pour les mesures sur le terrain lors de la visualisation des trajectoires à l’aide de PathWeaver.
tr_tr: **Length Unit-Uzunluk Birimi: ** Robotunuzu tanımlamada ve PathWeaver kullanarak yörüngeleri görselleştirirken alan ölçümleri için kullanılacak birimler.
zh_cn: 关于**Length Unit:**：使用路径编织器使轨迹可视化时，用于描述机器人和进行现场测量的单位。最好使用米作为单位，因为这是遵循 WPILib 轨迹的单位。

source: **Export Unit:** The units to be used when exporting the paths and waypoints. If you are planning to use WPILib Trajectories, then you should choose :guilabel:`Always Meters`. Choosing :guilabel:`Same as Project` will export in the same units as :guilabel:`Length Unit` above.
fr_ca: **Export Unit:** Les unités à utiliser lors de l’exportation des trajectoires et des points de passage. Si vous prévoyez d’utiliser les trajectoires WPILib, vous devez alors choisir l'option :guilabel:`Always Meters`. Le choix de l'option :guilabel:`Same as Project` exportera dans les mêmes unités que :guilabel:`Length Unit` ci-dessus.
tr_tr: **Export Unit-Dışa Aktarma Birimi: ** Yolları ve yol noktalarını dışa aktarırken kullanılacak birimler. WPILib Yörüngelerini kullanmayı planlıyorsanız, şu seçimi yapmalısınız :guilabel:`Always Meters` her zaman ölçerler kullanılmalıdır. Seçme : guilabel: "Projeyle Aynı", yukarıdak :guilabel:`Length Unit` uzunlık birimi ile aynı birimlerde dışa aktarılacaktır.

source: **Max Velocity:** The max speed of the robot for trajectory tracking. This does not need to be the maximum attainable speed of the robot, but just the max speed that you want to run trajectories at.
fr_ca: **Max Velocity:** La vitesse maximale du robot pour le suivi de trajectoire. Elle ne correspondant pas nécessairement à la vitesse maximale possible du robot, mais simplement à la vitesse maximale que vous voulez atteindre sur vos trajectoires.
tr_tr: **Max Velocity:** Yörünge izleme için robotun maksimum hızdır. Bunun, robotun elde edilebilecek maksimum hızı olması gerekmez, sadece yörüngeleri çalıştırmak istediğiniz maksimum hız olması gerekir.
zh_cn: 关于**Max Velocity:**：用于轨迹跟踪的机器人的最大速度。这不必是机器人可达到的最大速度，而只需是机器人在规定轨迹上的最大运动速度。

source: **Max Acceleration:** The max acceleration of the robot for trajectory tracking. This does not need to be the maximum attainable acceleration of the robot, but just the max acceleration that you want to run trajectories at.
fr_ca: **Max Acceleration:** L’accélération maximale du robot pour le suivi de trajectoire. Elle ne correspond pas nécessairement à l’accélération maximale possible du robot, mais simplement à l’accélération max que vous voulez atteindre sur vos trajectoires.
tr_tr: **Max Acceleration:** Yörünge izleme için robotun maksimum hızlanması. Bunun, robotun maksimum elde edilebilir ivmesi olması gerekmez, sadece yörüngeleri çalıştırmak istediğiniz maksimum ivme olması gerekir.
zh_cn: 关于**Max Acceleration:**：用于轨迹跟踪的机器人的最大加速度。这不必是机器人可以达到的最大加速度，而只需是机器人在规定轨迹上的最大加速度。

source: **Wheel Base:** The distance between the left and right wheels of your robot. This is used to ensure that no wheel on a differential drive will go over the specified max velocity around turns.
fr_ca: **Wheel Base:** La distance entre les roues gauche et droite de votre robot. Ce paramètre est utilisé pour s’assurer qu’aucune roue sur une commande différentielle ne dépassera la vitesse maximale spécifiée dans des virages.
tr_tr: ** Wheel Base: ** Robotunuzun sol ve sağ tekerlekleri arasındaki mesafe. Bu, diferansiyel sürücüdeki hiçbir tekerleğin dönüşlerde belirtilen maksimum hızı aşmamasını sağlamak için kullanılır.
zh_cn: 关于**Wheel Base:**：这表达的是机器人左右轮之间的距离。这用于确保差速器驱动时任何一个车轮均不会在转弯时超过指定的最大速度。

source: PathWeaver User Interface
fr_ca: Interface utilisateur PathWeaver
tr_tr: PathWeaver Kullanıcı Arayüzü
zh_cn: 路径编织器的用户界面

source: The PathWeaver user interface consists of the following:
fr_ca: L’interface utilisateur PathWeaver se compose des éléments suivants :
tr_tr: PathWeaver kullanıcı arayüzü aşağıdakilerden oluşur:
zh_cn: 路径编织器的用户界面包含以下内容：

source: The field area in the top left corner, which takes up most of the PathWeaver window. Trajectories are drawn on this part of the program.
fr_ca: Zone de champs localisée dans le coin supérieur gauche, qui occupe la majeure partie de la fenêtre PathWeaver. Les trajectoires sont tracées dans cette partie de l'interface.
tr_tr: PathWeaver penceresinin çoğunu kaplayan sol üst köşedeki alan alanı. Yörüngeler programın bu bölümünde çizilir.
zh_cn: 左上角的场地区域，占据了路径编织器窗口的大部分。轨迹将被绘制在此区域上。

source: The properties of the currently selected waypoint are displayed in the bottom pane. These properties include the X and Y, along with the tangents at each point.
fr_ca: Les propriétés du point de repère actuellement sélectionné s’affichent dans le volet inférieur. Ces propriétés comprennent l'abscisse X et l'ordonnée Y, ainsi que les tangentes à chaque point.
tr_tr: Halihazırda seçili olan yol noktasının özellikleri alt panelde görüntülenir. Bu özellikler, her noktadaki teğetlerle birlikte X ve Y'yi içerir.
zh_cn: 当前选定导航点的属性将显示在底部窗格中。这些属性包括 X 坐标和 Y 坐标，以及每个点上所对应的切线。

source: A group of paths (or an "autonomous" mode) is displayed on the upper right side of the window. This is a convenient way of seeing all of the trajectories in a single auto mode.
fr_ca: Un regroupement de trajectoires (ou un Mode "autonome") s’affiche sur le côté supérieur droit de la fenêtre. C’est une façon pratique de voir toutes les trajectoires pour un Mode autonome donné.
tr_tr: Pencerenin sağ üst tarafında bir grup yol (veya bir "otonom" mod) görüntülenir. Bu, tüm yörüngeleri tek bir otomatik modda görmenin uygun bir yoludur.
zh_cn: 一组路径（或“自动操作”模式）将显示在窗口的右上方。这是在单个自动模式下查看所有轨迹的便捷方式。

source: The individual paths that a robot might follow are displayed in the lower right side of the window.
fr_ca: Les trajectoires individuelles qu’un robot peut suivre sont affichées dans le côté inférieur droit de la fenêtre.
tr_tr: Bir robotun izleyebileceği ayrı yollar, pencerenin sağ alt tarafında görüntülenir.
zh_cn: 机器人可能遵循的各个路径将显示在窗口的右下方。

source: The "Build Paths" button will export the trajectories in a JSON format. These JSON files can be used from the robot code to follow the trajectory.
fr_ca: Le bouton "Build Paths" sert à exporter les trajectoires sous le format JSON. Ces fichiers JSON peuvent, par la suite, être utilisés à partir du code robot pour suivre la trajectoire.
tr_tr: "Build Paths" düğmesi yörüngeleri JSON formatında dışa aktarır. Bu JSON dosyaları, yörüngeyi izlemek için robot kodundan kullanılabilir.
zh_cn: “Build Path” 按钮将以 JSON 格式导出轨迹。机器人代码也可以使用这些 JSON 文件来跟踪轨迹。

source: The "Edit Project" button allows you to edit the project properties.
fr_ca: Le bouton "Edit Project" vous permet de modifier les propriétés du projet.
tr_tr: "Edit Project" düğmesi proje özelliklerini düzenlemenizi sağlar.
zh_cn: “Edit Project” 按钮允许您编辑项目的属性。
