Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/pathweaver/drawing-pathweaver-path.po
Languages: tr_tr, zh_cn

source: Visualizing PathWeaver Trajectories
tr_tr: PathWeaver Yörüngelerini Görselleştirme
zh_cn: 使路径编织器轨迹可视

source: PathWeaver's primary feature is to visualize trajectories. The following images depict a smooth trajectory that represents a trajectory that a robot might take during the autonomous period. Paths can have any number of waypoints that can allow more complex driving to be described. In this case there are 3 waypoints (including the start and stop) depicted with the triangle icons. Each waypoint consists of a X, Y position on the field as well as a robot heading described as the X and Y tangent lines.
tr_tr: PathWeaver'ın birincil özelliği yörüngeleri görselleştirmektir. Aşağıdaki resimler, bir robotun otonom dönem boyunca izleyebileceği bir yörüngeyi temsil eden yumuşak bir yörünge tasvir etmektedir. Yollar, daha karmaşık sürüşün tanımlanmasına izin verebilecek herhangi bir sayıda ara noktaya sahip olabilir. Bu durumda, üçgen simgelerle gösterilen 3 ara nokta (başlama ve durma dahil) vardır. Her geçiş noktası, alandaki bir X, Y konumundan ve X ve Y teğet çizgileri olarak tanımlanan bir robot başlığından oluşur.
zh_cn: 路径编织器的主要功能是使轨迹可视化。下图描绘了平滑的轨迹，该轨迹表示机器人在自动阶段可能采取的轨迹。路径可以具有任意数量的导航点，从而可以引导更为复杂的路径。在这种情况下，三角形图标描述了3个航路点（包括起点和终点）。每个导航点均由场地上的X，Y位置以及称为X和Y切线的机器人的航向组成。

source: Creating the Initial Trajectory
tr_tr: İlk Yörüngeyi Oluşturmak
zh_cn: 创建初始轨迹

source: To start creating a trajectory, click the + (plus) button in the path window. A default trajectory will be created that probably does not have the proper start and end points that you desire. The path also shows the tangent vectors (teal lines) for the start and end points. Changing the angle of the tangent vectors changes the shape of the trajectory.
tr_tr: Bir yörünge oluşturmaya başlamak için, yol penceresindeki + (artı) düğmesine tıklayın. Muhtemelen arzu ettiğiniz uygun başlangıç ve bitiş noktalarına sahip olmayan varsayılan bir yörünge oluşturulacaktır. Yol ayrıca başlangıç ve bitiş noktaları için teğet vektörleri (turkuaz çizgileri) gösterir. Teğet vektörlerin açısını değiştirmek, yörüngenin şeklini değiştirir.
zh_cn: 要开始创建轨迹，请在路径窗口中单击 + (加号) 按钮。此操作将创建一个默认轨迹，该轨迹可能没有你所需的正确起点和终点。该路径还显示了起点和终点的切向量 (虚线)。改变切向量的角度会改变轨迹的形状。

source: Drag the start and end points of the trajectory to the desired locations. Notice that in this case, the default trajectory does not start in a legal spot for the 2019 game. We can drag the initial waypoint to make the robot start on the HAB.
tr_tr: Yörüngenin başlangıç ve bitiş noktalarını istenen konumlara sürükleyin. Bu durumda, varsayılan yörüngenin 2019 oyunu için yasal bir noktada başlamadığına dikkat edin. Robotun HAB'da başlaması için ilk ara noktayı sürükleyebiliriz.
zh_cn: 将轨迹的起点和终点拖到所需的位置。请注意，在这种情况下，默认轨迹不会从2019年比赛所需的标准位置开始。我们可以拖动初始航路点以使机器人在 HAB 上启动。

source: Changing a Waypoint Heading
tr_tr: Yol Noktası Başlığını Değiştirme
zh_cn: 更改导航点方向

source: The robot heading can be changed by dragging the tangent vector (teal) line. Here, the final waypoint was dragged to the desired final pose and was rotated to face the rocket.
tr_tr: Robot başlığı, teğet vektör (turkuaz) çizgisini sürükleyerek değiştirilebilir. Burada, son ara nokta istenen son poza sürüklendi ve rokete bakacak şekilde döndürüldü.
zh_cn: 可以通过拖动切线矢量 (竖直) 线来更改机器人的方向。在这里，将最终航路点拖动到所需的最终姿态，并旋转以面对火箭。

source: Adding Additional Waypoints to Control the Robot Path
tr_tr: Robot Yolunu Kontrol Etmek İçin Ek Yol Noktaları Ekleme
zh_cn: 添加其他导航点以控制机器人的路径

source: Adding additional waypoints and changing their tangent vectors can affect the path that is followed. Additional waypoints can be added by dragging in the middle of the path. In this case, we added another waypoint in the middle of the path.
tr_tr: İlave ara noktalar eklemek ve teğet vektörlerini değiştirmek, takip edilen yolu etkileyebilir. Yolun ortasına sürüklenerek ek yol noktaları eklenebilir. Bu durumda, yolun ortasına başka bir ara nokta ekledik.
zh_cn: 添加其他航路点并更改其切向量可能会影响其所遵循的路径。可以通过在路径中间拖动来添加其他航路点。在这种情况下，我们在路径中间添加了另一个导航点。

source: Locking the Tangent Lines
tr_tr: Teğet Çizgilerini Kilitleme
zh_cn: 锁定切线

source: Locking tangent lines prevents them from changing when the trajectory is being manipulated. The tangent lines will also be locked when the point is moved.
tr_tr: Teğet çizgilerin kilitlenmesi, yörünge manipüle edilirken değişmelerini önler. Teğet çizgiler de nokta hareket ettirildiğinde kilitlenecektir.
zh_cn: 锁定切线可防止在操纵轨迹时改变它们。移动点时，切线也将被锁定。

source: More Precise control of Waypoints
tr_tr: Ara Noktaların daha hassas kontrolü
zh_cn: 更精确地控制导航点

source: While PathWeaver makes it simple to draw trajectories that the robot should follow, it is sometimes hard to precisely set where the waypoints should be placed. In this case, setting the waypoint locations can be done by entering the X and Y value which might come from an accurate CAD model of the field. The points can be entered in the X and Y fields when a waypoint is selected.
tr_tr: PathWeaver, robotun izlemesi gereken yörüngeleri çizmeyi kolaylaştırırken, ara noktaların nereye yerleştirileceğini kesin olarak belirlemek bazen zordur. Bu durumda, yol noktası konumlarının belirlenmesi, alanın doğru bir CAD modelinden gelebilecek X ve Y değeri girilerek yapılabilir. Noktalar, bir yol noktası seçildiğinde X ve Y alanlarına girilebilir.
zh_cn: 虽然路径编织器使绘制机器人应遵循的轨迹变得简单，但有时很难精确设置路标的放置位置。在这种情况下，可以通过输入 X 和 Y 值来设置航点位置，这些值可能来自场地的精确CAD模型。选择导航点后，可以在 X 和 Y 场地中输入这些点。
