Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/trajectory-tutorial/characterizing-drive.po
Languages: fr_ca, tr_tr

source: Step 1: Characterizing Your Robot Drive
fr_ca: Étape 1 : Caractérisation de l'entraînement de votre robot
tr_tr: 1. Adım: Robot Drive'ınızın Netilendirilmesi

source: For detailed instructions on using the System Identification tool, see its :ref:`dedicated documentation <docs/software/pathplanning/system-identification/introduction:Introduction to System Identification>`.
fr_ca: Pour des instructions détaillées sur l'utilisation de l'outil d'identification du système, consultez sa :ref:`documentation dédiée <docs/software/pathplanning/system-identification/introduction:Introduction to System Identification>`.

source: The drive identification process requires ample space for the robot to drive. Be sure to have *at least* a 10' stretch (ideally closer to 20') in which the robot can drive during the identification routine.
fr_ca: Le processus d'identification du lecteur nécessite suffisamment d'espace pour que le robot puisse conduire. Assurez-vous d'avoir *au moins* un espace de 10' (idéalement plus proche de 20') dans lequel le robot peut conduire pendant la routine d'identification.
tr_tr: Drive tespit süreci robotun sürülebileceği geniş bir alan gerektirmektedir. Robotun tespit rutininde sürülebileceği *en azından* 10', yaklaşık üç metrelik (tercihen 20', yaklaşık 6 metrelik) bir alanda olduğunuzdan emin olunuz.

source: The identification data for this tutorial has been generously provided by Team 5190, who generated it as part of a demonstration of this functionality at the 2019 North Carolina State University P2P Workshop.
fr_ca: Les données d'identification de ce didacticiel ont été généreusement fournies par l'équipe 5190, qui les a générées dans le cadre d'une démonstration de cette fonctionnalité lors de l'atelier P2P 2019 de la North Carolina State University.
tr_tr: Bu rehber için tespit verileri, bu işlevselliği 2019 North Carolina State University P2P Çalıştayının bir parçası olarak sunmak için, Takım 5190 tarafından sağlanmıştır.

source: Before accurately following a path with a robot, it is important to have an accurate model for how the robot moves in response to its control inputs. Determining such a model is a process called "system identification." WPILib's System Identification tool can accurately determine such a model.
fr_ca: Avant de suivre avec précision une trajectoire avec un robot, il est important d'avoir un modèle précis de la façon dont le robot se déplace en réponse à ses entrées de commande. La détermination d'un tel modèle est un processus appelé "identification du système". L'outil d'identification du système de WPILib peut déterminer avec précision un tel modèle.
tr_tr: Bir robot ile tam olarak bir yolu takip etmeden önce robotun kontrol girdilerine verdiği tepkilerin isabetli bir modelini olması önemlidir. Böyle bir modelin tanımlanması "sistem tespiti"dir. WPILib'in Sistem Tespiti aracı böyle bir modeli isabetli bir şekilde tanımlayabilmektedir.

source: Gathering the Data
fr_ca: Collecte des données
tr_tr: Verilerin Toplanması

source: We begin by gathering our drive identification data.
fr_ca: Nous commençons par rassembler nos données d'identification de disque.
tr_tr: Öncelikle drive tespiti verilerimizin toplanmasıyla başlamaktayız.

source: :ref:`Configure and Deploy a robot project <docs/software/pathplanning/system-identification/configuring-project:Configuring a Project>`.
fr_ca: :ref:`Configurer et déployer un projet de robot <docs/software/pathplanning/system-identification/configuring-project:Configuring a Project>`.

source: :ref:`Run the identification Routine <docs/software/pathplanning/system-identification/identification-routine:Running the Identification Routine>`.
fr_ca: :ref:`Exécutez la routine d'identification <docs/software/pathplanning/system-identification/identification-routine:Running the Identification Routine>`.

source: Analyzing the Data
fr_ca: Analyse des données
tr_tr: Verilerin Analiz Edilmesi

source: Once the identification routine has been run and the data file has been saved, it is time to :ref:`open it in the analysis pane <docs/software/pathplanning/system-identification/analyzing-data:Analyzing Data>`.
fr_ca: Une fois la routine d'identification exécutée et le fichier de données enregistré, il est temps de :ref:`l'ouvrir dans le volet d'analyse <docs/software/pathplanning/system-identification/analyzing-data:Analyzing Data>`.

source: Checking Diagnostics
fr_ca: Vérification des diagnostics
tr_tr: Tanıların Kontrolü

source: Per the :ref:`system identification guide <docs/software/pathplanning/system-identification/viewing-diagnostics:Viewing Diagnostics>`, we first view the diagnostics to ensure that our data look reasonable:
fr_ca: Selon le :ref:`guide d'identification du système <docs/software/pathplanning/system-identification/viewing-diagnostics:Viewing Diagnostics>`, nous examinons d'abord les diagnostics pour nous assurer que nos données semblent raisonnables :

source: SysId diagnostics panel.
fr_ca: Panneau de diagnostic SysId.
tr_tr: SysId tanı paneli

source: As our data look reasonably linear, and the fit metrics are within acceptable parameters, we proceed to the next step.
fr_ca: Comme nos données semblent raisonnablement linéaires et que les mesures d'ajustement se situent dans des paramètres acceptables, nous passons à l'étape suivante.
tr_tr: Verilerimiz makul derecede çizgisel olduğu ve ayar ölçülerimiz kabul edilebilir parametreler içinde olduğundan diğer adıma geçebiliriz.

source: Record Feedforward Gains
fr_ca: Enregistrer les gains de commande Feedforward
tr_tr: İleri Bildirim Kazançlarının Kaydedilmesi

source: Feedforward gains do *not*, in general, transfer across robots. Do *not* use the gains from this tutorial for your own robot.
fr_ca: Les gains de commande prédictive ou Feedforward ne se transfèrent *pas*, en général, entre les robots. Aussi, n’utilisez *pas* les gains de ce tutoriel pour votre propre robot.

source: We now record the feedforward gains calculated by the tool:
fr_ca: Nous enregistrons maintenant les gains de commande prédictive calculés par l’outil :

source: Highlights where to get the kS, kV, kA, and r-squared results from in the center of the window.
fr_ca: Met en surbrillance l’emplacement à partir duquel on peut obtenir les résultats kS, kV, kA et r au carré au centre de la fenêtre.
tr_tr: Pencerenin ortasında; kS, kV, kA ce r kare sonuçlarının nerede elde edildiği kutucuk içine alınmaktadır.

source: Since our wheel diameter was specified in meters, our feedforward gains are in the following units:
fr_ca: Puisque notre diamètre de roue a été spécifié en mètres, nos gains de prédiction sont dans les unités suivantes:

source: If you have specified your units correctly, your feedforward gains will likely be within an order of magnitude of the ones reported here (a possible exception exists for ``kA``, which may be vanishingly small if your robot is light). If they are not, it is possible you specified one of your drive parameters incorrectly when generating your robot project. A good test for this is to calculate the "theoretical" value of ``kV``, which is 12 volts divided by the theoretical free speed of your drivetrain (which is, in turn, the free speed of the motor times the wheel circumference divided by the gear reduction). This value should agree very closely with the ``kV`` measured by the tool - if it does not, you have likely made an error somewhere.
fr_ca: Si vous avez correctement spécifié vos unités, vos gains de commande prédictive seront probablement dans un ordre de grandeur de ceux du présent tutoriel (une exception possible existe pour ``kA``, qui peut être beaucoup plus petite si votre robot est léger). Si ce n’est pas le cas, il est possible que vous ayiez incorrectement spécifié un de vos paramètres du système d'entraînement lors de la génération de votre projet de robot. Pour cela, un bon test est de calculer la valeur "théorique" de ``kV``, qui est de 12 volts divisé par la vitesse libre théorique de votre base pilotable (qui est, à son tour, la vitesse libre du moteur multipliée par la circonférence de la roue divisée par le rapport d'engrenage). Cette valeur devrait être très proche du ``kV`` mesuré par l’outil - si ce n’est pas le cas, vous avez probablement fait une erreur quelque part.

source: Calculate Feedback Gains
fr_ca: Calculer les gains de rétroaction

source: Feedback gains do *not*, in general, transfer across robots. Do *not* use the gains from this tutorial for your own robot.
fr_ca: Les gains de rétroaction ne se transfèrent *pas*, en général, entre les robots. Aussi, n’utilisez pas les gains de ce tutoriel pour votre propre robot.

source: We now :ref:`calculate the feedback gains <docs/software/pathplanning/system-identification/analyzing-feedback:Feedback Analysis>` for the PID control that we will use to follow the path. Trajectory following with WPILib's RAMSETE controller uses velocity closed-loop control, so we first select ``Velocity`` mode in the identification tool:
fr_ca: Nous allons maintenant :ref:`calculer les gains de rétroaction <docs/software/pathplanning/system-identification/analyzing-feedback:Feedback Analysis>` pour le contrôle PID que nous utiliserons pour suivre le chemin. Le suivi de trajectoire avec le contrôleur RAMSETE de WPILib utilise le contrôle en boucle fermée de la vitesse, nous sélectionnons donc d'abord le mode ``Velocity`` dans l'outil d'identification :

source: How to specify velocity mode in the "Loop Type" dropdown.
fr_ca: Comment spécifier le mode vitesse dans la liste déroulante "Loop Type".
tr_tr: "Loop Type - Döngü Türü" açılır listesinde nasıl hız modunun nasıl belirlenebileceği.

source: Since we will be using the WPILib PIDController for our velocity loop, we furthermore select the ``WPILib (2020-)`` option from the drop-down "presets" menu. This is *very* important, as the feedback gains will not be in the correct units if we do not select the correct preset:
fr_ca: Puisque nous utiliserons lePIDController WPILib pour notre boucle de vitesse, nous sélectionnons en outre l’option ``WPILib (2020-)`` dans le menu déroulant "presets". Ceci est *très* important, car les gains de rétroaction ne seront pas dans les unités concordantes si nous ne sélectionnons pas le bon préréglage:

source: Highlights choosing "WPILib (2020-)" from the "Gain Setting Preset" dropdown.
fr_ca: Met en évidence le choix de "WPILib (2020-)" dans la liste déroulante "Gain Setting Preset".
tr_tr: "Gain Setting Preset - Kazanç Önayarı" açılır listesinden "WPILib (2020-)"nin nasıl seçileceği kutucuk içine alınmaktadır.

source: Finally, we calculate and record the feedback gains for our control loop. Since it is a velocity controller, only a P gain is required:
fr_ca: Enfin, nous calculons et enregistrons les gains de rétroaction pour notre boucle de contrôle. Puisqu’il s’agit d’un contrôleur de vitesse, seul un gain P est requis :

source: Highlights the calculated kP and kD controller gains.
fr_ca: Met en évidence les gains calculés des paramètres kP et kD du contrôleur.
tr_tr: Hesap edilmiş kP ve kD kontrolör kazançları kutucuk içine alınmaktadır.

source: Assuming we have done everything correctly, our proportional gain will be in units of Volts * Seconds / Meters. Thus, our calculated gain means that, for each meter per second of velocity error, the controller will output an additional 3.38 volts.
fr_ca: En supposant que nous avons tout fait correctement, notre gain proportionnel sera en unités de Volts * Secondes / Mètres. Ainsi, notre gain calculé signifie que, pour chaque mètre par seconde d’erreur de vitesse, le contrôleur produira 3.38 volts supplémentaires.
tr_tr: HEr şeyi doğru yaptığımızı varsayarsak, orantılı kazancımız Volt * Saniye / Metre biriminde olacaktır. Bu sebeple hesapladığımız kazanç, her bir saniye başı metre hız hatası için, kontrolörün ek 3.38 voltluk bir çıktı vereceği anlamına gelmektedir

source: For detailed instructions on using the System Identification tool, see its :ref:`dedicated documentation <docs/software/advanced-controls/system-identification/introduction:Introduction to System Identification>`.
tr_tr: Sistem tespit aracının kullanımına dair ayrıntılı talimatlar için bkz. :ref:`özel belgeleri <docs/software/advanced-controls/system-identification/introduction:Introduction to System Identification>`

source: :ref:`Configure and Deploy your robot project <docs/software/advanced-controls/system-identification/creating-routine:Creating an Identification Routine>`.
tr_tr: :ref:`Robot projenizi Yapılandırıp Dağıtınız <docs/software/advanced-controls/system-identification/creating-routine:Creating an Identification Routine>`.

source: :ref:`Run the identification Routine <docs/software/advanced-controls/system-identification/running-routine:Running the Identification Routine>`.
tr_tr: :ref:`Tespit Rutinini başlatınız <docs/software/advanced-controls/system-identification/running-routine:Running the Identification Routine>`.

source: Once the identification routine has been run and the data file has been saved, it is time to :ref:`open it in the analysis pane <docs/software/advanced-controls/system-identification/analyzing-gains:Analyzing Data>`.
tr_tr: Tespit rutini çalıştırılıp veri dosyası kaydedildikten sonra sıra :ref:`dosyanın görüntü pencersinde açılmasına <docs/software/advanced-controls/system-identification/analyzing-gains:Analyzing Data>` gelmiştir.

source: Per the :ref:`system identification guide <docs/software/advanced-controls/system-identification/viewing-diagnostics:Viewing Diagnostics>`, we first view the diagnostics to ensure that our data look reasonable:
tr_tr: :ref:`sistem tespiti rehberi <docs/software/advanced-controls/system-identification/viewing-diagnostics:Viewing Diagnostics>` doğrultusunda öncelikle verilerimizin makul olduğundan emin olmak için diagnostics - tanıları görüntülemekteyiz:

source: ``kS``: Volts
tr_tr: ``kS``: Volt

source: ``kV``: Volts * Seconds / Meters
tr_tr: ``kV``: Volt * Saniye / Metre

source: ``kA``: Volts * Seconds^2 / Meters
tr_tr: ``kA``: Volt * Saniye^2 / Metre

source: We now :ref:`calculate the feedback gains <docs/software/advanced-controls/system-identification/analyzing-gains:Feedback Analysis>` for the PID control that we will use to follow the path. Trajectory following with WPILib's RAMSETE controller uses velocity closed-loop control, so we first select ``Velocity`` mode in the identification tool:
tr_tr: Artık yolu takip etmek için kullanacağımız PID kontrolünün :ref:`geribildirim kazançlarını hesaplayabiliriz <docs/software/advanced-controls/system-identification/analyzing-gains:Feedback Analysis>`. WPILib'in RAMSETE kontrolörünü takiben yörünge hız kapalı döngü kontrolü kullanmaktadır, bu sebepten ötürü öncelikle tespit aracında ``Velocity`` modunu seçmekteyiz:
