Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/trajectory-tutorial/creating-following-trajectory.po
Languages: es_mx, fr_ca, tr_tr

source: The drive kinematics: This is the ``DifferentialDriveKinematics`` object (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/kinematics/DifferentialDriveKinematics.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1DifferentialDriveKinematics.html>`__) that we constructed earlier in our constants file, and will be used to convert chassis speeds to wheel speeds.
es_mx: La cinemática de la unidad: Este es el objeto ``DifferentialDriveKinematics`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/kinematics/DifferentialDriveKinematics.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1DifferentialDriveKinematics.html>` __) que construimos anteriormente en nuestro archivo de constantes, y se utilizará para convertir las velocidades del chasis a velocidades de rueda.

source: The left-side PIDController: This is the ``PIDController`` object (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDController.html>`__) that will track the left-side wheel speed setpoint, using the P gain that we obtained from the drive characterization tool.
es_mx: El PIDController del lado izquierdo: Este es el objeto ``PIDController`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDController.html>` __) que rastreará el punto de ajuste de velocidad de la rueda del lado izquierdo, usando la ganancia P que obtuvimos de la caracterización del variador herramienta.

source: The right-side PIDController: This is the ``PIDController`` object (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDController.html>`__) that will track the right-side wheel speed setpoint, using the P gain that we obtained from the drive characterization tool.
es_mx: El PIDController del lado derecho: este es el objeto ``PIDController`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDController.html>` __) que rastreará el punto de ajuste de velocidad de la rueda del lado derecho, utilizando la ganancia P que obtuvimos de la caracterización del variador herramienta.

source: As per the :ref:`standard command-based project structure <docs/software/commandbased/structuring-command-based-project:Structuring a Command-Based Robot Project>`, we will do this in the ``getAutonomousCommand`` method of the ``RobotContainer`` class. The full method from the RamseteCommand Example Project (`Java <https://github.com/wpilibsuite/allwpilib/tree/v2024.3.2/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/v2024.3.2/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) can be seen below. The rest of the article will break down the different parts of the method in more detail.
tr_tr: :ref:`Standart komut temelli proje yapısıyla <docs/software/commandbased/structuring-command-based-project:Structuring a Command-Based Robot Project>` gereğince bu işlemleri ``RobotContainer`` sınıfının ``getAutonomousCommand`` metodu ile gerçekleştireceğiz. RamseteCommand Örnek Projesi'ndeki metodun tamamı (`Java <https://github.com/wpilibsuite/allwpilib/tree/v2024.3.2/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/v2024.3.2/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) aşağıda görüntülenebilmektedir. Yazının geri kalanı, metodun farklı bölümlerini ayrıntılandıracaktır.

source: It is very important that the initial robot pose match the first pose in the trajectory. For the purposes of our example, the robot will be reliably starting at a position of ``(0,0)`` with a heading of ``0``. In actual use, however, it is probably not desirable to base your coordinate system on the robot position, and so the starting position for both the robot and the trajectory should be set to some other value. If you wish to use a trajectory that has been defined in robot-centric coordinates in such a situation, you can transform it to be relative to the robot's current pose using the ``transformBy`` method (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/Trajectory.html#transformBy(edu.wpi.first.math.geometry.Transform2d)>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_trajectory.html#a8edfbd82347bbf32ddfb092679336cd8>`__). For more information about transforming trajectories, see :ref:`docs/software/advanced-controls/trajectories/transforming-trajectories:Transforming Trajectories`.
tr_tr: İlk robot pozunun yörüngedeki ilk poz ile örtüşmesi son derece önemlidir. Kullanacağımız örnek için robotun düzenli bir şekilde ``0`` yönü ile ``(0,0)`` başlangıç konumunda olduğunu varsayınız. Ancak gerçek kullanım sırasında, koordinat sisteminizi robot konumundan yola çıkarak belirlemek istenilen bir durum olmayacaktır, bu sebeple başlangıç konumu olarak başka bir değerin belirlenmesi gerekmektedir. Böyle bir durumda robot odaklı koordinatlarda tanımlanmış bir yörünge kullanmak istiyorsanız, ``transformBy`` metodunu (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/Trajectory.html#transformBy(edu.wpi.first.math.geometry.Transform2d)>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_trajectory.html#a8edfbd82347bbf32ddfb092679336cd8>`__) kullanarak yörüngeyi robotun anlık pozuna göreceli olacak bir şekle dönüştürebilirsiniz. Yörünge dönüşümlerine dair daha fazla bilgi için bkz. :ref:`docs/software/advanced-controls/trajectories/transforming-trajectories:Transforming Trajectories`.

source: Now that we have a trajectory, we can create a command that, when executed, will follow that trajectory. To do this, we use the ``RamseteCommand`` class (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RamseteCommand.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc2_1_1_ramsete_command.html>`__)
tr_tr: artık elimizde bir yörünge olduğuna göre çalıştırıldığı zaman u yörüngeyi takip edecek bir komut oluşturabiliriz. Bunun için ``RamseteCommand`` sınıfını (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RamseteCommand.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc2_1_1_ramsete_command.html>`__) kullanmaktayız.

source: The RAMSETE controller: This is the ``RamseteController`` object (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/controller/RamseteController.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_ramsete_controller.html>`__) that will perform the path-following computation that translates the current measured pose and trajectory state into a chassis speed setpoint.
tr_tr: RAMSETE kontrolörü: Bu, anlık ölçülen poz ve yörünge durumunu şasi hız ayar noktasına dönüştüren yol takibi hesaplamasını gerçekleştirecek ``RamseteController`` nesnesidir (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/controller/RamseteController.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_ramsete_controller.html>`__).

source: The drive feedforward: This is a ``SimpleMotorFeedforward`` object (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/controller/SimpleMotorFeedforward.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_simple_motor_feedforward.html>`__) that will automatically perform the correct feedforward calculation with the feedforward gains (``kS``, ``kV``, and ``kA``) that we obtained from the drive identification tool.
tr_tr: Sürüş ileri beslemesi: Bu, sürüş tespitinden elde ettiğimiz ileri besleme kazançları (``kS``, ``kV`` ve ``kA``) ile kendiliğinden uygun ileri besleme hesaplarını yapacak ``SimpleMotorFeedforward`` nesnesidir (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/controller/SimpleMotorFeedforward.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_simple_motor_feedforward.html>`__).

source: The drive kinematics: This is the ``DifferentialDriveKinematics`` object (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/kinematics/DifferentialDriveKinematics.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_differential_drive_kinematics.html>`__) that we constructed earlier in our constants file, and will be used to convert chassis speeds to wheel speeds.
tr_tr: Sürüş kinematikleri: Bu, önceden sabitler dosyasında oluşturduğumuz ve şasi hazını teker hızına dönüştürmek için kullanılacak ``DifferentialDriveKinematics`` nesnesidir (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/kinematics/DifferentialDriveKinematics.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_differential_drive_kinematics.html>`__).

source: The left-side PIDController: This is the ``PIDController`` object (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/controller/PIDController.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_p_i_d_controller.html>`__) that will track the left-side wheel speed setpoint, using the P gain that we obtained from the drive identification tool.
tr_tr: Sol taraftaki PIDController: Bu, sürüş tespit aracından elde ettiğimiz P kazancını kullanarak sol taraftaki tekerlek hız ayar noktasını izleyecek ``PIDController`` nesnesidir (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/controller/PIDController.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_p_i_d_controller.html>`__).

source: The right-side PIDController: This is the ``PIDController`` object (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/controller/PIDController.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_p_i_d_controller.html>`__) that will track the right-side wheel speed setpoint, using the P gain that we obtained from the drive identification tool.
tr_tr: Sağ taraftaki PIDController: Bu, sürüş tespit aracından elde ettiğimiz P kazancını kullanarak sağ taraftaki tekerlek hız ayar noktasını izleyecek ``PIDController`` nesnesidir (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/controller/PIDController.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_p_i_d_controller.html>`__).
