Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/trajectory-tutorial/creating-following-trajectory.po
Languages: es_mx, fr_ca, tr_tr

source: Step 4: Creating and Following a Trajectory
es_mx: Paso 4: Creando y Siguiendo una trayectoria
fr_ca: Étape 4 : Création et suivi d’une trajectoire
tr_tr: Adım 4: Bir Yörüngenin Oluşturulması ve Takip Edilmesi

source: With our drive subsystem written, it is now time to generate a trajectory and write an autonomous command to follow it.
es_mx: Con nuestro subsistema de accionamiento escrito, es hora de generar una trayectoria y escribir un comando autónomo para seguirla.
fr_ca: Avec notre sous-système de déplacement écrit, il est maintenant temps de générer une trajectoire et d’écrire une commande autonome pour la suivre.

source: As per the :ref:`standard command-based project structure <docs/software/commandbased/structuring-command-based-project:Structuring a Command-Based Robot Project>`, we will do this in the ``getAutonomousCommand`` method of the ``RobotContainer`` class. The full method from the RamseteCommand Example Project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) can be seen below. The rest of the article will break down the different parts of the method in more detail.
es_mx: Según la :ref:` estructura estandar de un proyecto a base de comandos <docs/software/commandbased/structuring-command-based-project:Structuring a Command-Based Robot Project>`, haremos esto en el método de la clase ``RobotContainer``. El método completo del proyecto RamseteCommand Example (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) puede verse debajo. El resto del articulo se separará en diferentes partes del método en más detalle.
fr_ca: Selon le projet :ref:`structure standard d'un projet orienté commande <docs/software/commandbased/structuring-command-based-project:Structuring a Command-Based Robot Project>`, nous le ferons dans la méthode ``getAutonomousCommand`` de la classe ``RobotContainer``. La méthode complète du projet d’exemple RamseteCommand (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) peut être vue ci-dessous. Le reste de l’article décomposera plus en détail les différentes parties de la méthode.

source: Configuring the Trajectory Constraints
es_mx: Configurando las Restricciones de Trayectoria
fr_ca: Configuration des contraintes de la trajectoire

source: First, we must set some configuration parameters for the trajectory which will ensure that the generated trajectory is followable.
es_mx: Primero, debemos establecer algunos parámetros de configuración para la trayectoria que aseguren que la trayectoria generada sea seguible.
fr_ca: Tout d’abord, nous devons définir certains paramètres de configuration pour la trajectoire qui garantiront que la trajectoire ainsi générée peut effectivement être suivie.

source: Creating a Voltage Constraint
es_mx: Creando una Restricción de Voltaje
fr_ca: Création d’une contrainte de tension

source: The first piece of configuration we will need is a voltage constraint. This will ensure that the generated trajectory never commands the robot to go faster than it is capable of achieving with the given voltage supply:
es_mx: La primera pieza de configuración que necesitaremos es una restricción de voltaje. Esto asegurará que la trayectoria generada nunca ordene al robot ir más rápido de lo que es capaz de lograr con el suministro de voltaje dado:
fr_ca: La première pièce de configuration dont nous aurons besoin est une contrainte de tension. Cela permettra de s’assurer que la trajectoire générée ne contraigne jamais le robot d’aller plus vite qu’il n’est capable d’atteindre avec l’alimentation de tension disponible:

source: Notice that we set the maximum voltage to 10V, rather than the nominal battery voltage of 12V. This gives us some "headroom" to deal with "voltage sag" during operation.
es_mx: Nótese que fijamos el votaje máximo a 10V, en lugar del voltaje nominal de la batería de 12V. Esto nos da un poco de "margen" para lidiar con la "caída de voltaje" durante la operación.
fr_ca: Notez que nous avons fixé la tension maximale à 10V, plutôt qu'à la tension nominale de la batterie de 12V. Cela nous laisse une certaine "marge" pour faire face à un éventuel "creux de tension" pendant le suivi de la trajectoire.

source: Creating the Configuration
es_mx: Creando la Configuración
fr_ca: Création de la configuration

source: Now that we have our voltage constraint, we can create our ``TrajectoryConfig`` instance, which wraps together all of our path constraints:
es_mx: Ahora que tenemos nuestra restricción de voltaje, podemos crear nuestra instancia ``TrajectoryConfig``, que envuelve todas nuestras restricciones de camino:
fr_ca: Maintenant que nous avons notre contrainte de tension, nous pouvons créer notre instance ``TrajectoryConfig``, qui englobe toutes nos contraintes de trajectoire :

source: Generating the Trajectory
es_mx: Generando la Trayectoria
fr_ca: Génération de la trajectoire

source: With our trajectory configuration in hand, we are now ready to generate our trajectory. For this example, we will be generating a "clamped cubic" trajectory - this means we will specify full robot poses at the endpoints, and positions only for interior waypoints (also known as "knot points"). As elsewhere, all distances are in meters.
es_mx: Con la configuración de nuestra trayectoria en mano, estamos listos para generar nuestra trayectoria. Para este ejemplo, generaremos una trayectoria "clamped cubic" - esto significa que especificaremos las posiciones completas del robot en los puntos finales, y las posiciones sólo para los waypoints interiores (también conocidos como "knot points"). Como en cualquier otro lugar, todas las distancias están en metros.
fr_ca: Avec notre configuration de trajectoire en main, nous sommes maintenant prêts à générer notre trajectoire. Pour cet exemple, nous allons générer une trajectoire "clamped cubic" - cela signifie que nous allons spécifier au complet les poses de robots aux extrémités, et spécifier des positions uniquement pour les points de passage intérieurs (également connu sous le nom "points noeuds"). Comme ailleurs, toutes les distances sont en mètres.

source: Instead of generating the trajectory on the roboRIO as outlined above, one can also :ref:`import a PathWeaver JSON <docs/software/pathplanning/pathweaver/integrating-robot-program:Importing a PathWeaver JSON>`.
fr_ca: Au lieu de générer la trajectoire sur le roboRIO comme indiqué ci-dessus, on peut également :ref:`importer un PathWeaver JSON <docs/software/pathplanning/pathweaver/integrating-robot-program:Importing a PathWeaver JSON>`.
tr_tr: Yukarıda belirtildiği üzere roboRIO'da bir yörünge oluşturmak yerine :ref:`bi PathWeaver JSON'un içe aktarılması <docs/software/pathplanning/pathweaver/integrating-robot-program:Importing a PathWeaver JSON>` da mümkündür.

source: Creating the RamseteCommand
es_mx: Creando el RamseteCommand
fr_ca: Création de la commande Ramsete ou RamseteCommand

source: We will first reset our robot's pose to the starting pose of the trajectory. This ensures that the robot's location on the coordinate system and the trajectory's starting position are the same.
es_mx: Primero reajustaremos la posición de nuestro robot a la posición inicial de la trayectoria. Esto asegura que la posición del robot en el sistema de coordenadas y la posición inicial de la trayectoria sean las mismas.
fr_ca: Nous allons d'abord réinitialiser la pose de notre robot à la pose de départ de la trajectoire. Cela garantit que l'emplacement du robot sur le système de coordonnées et la position de départ de la trajectoire sont identiques.

source: It is very important that the initial robot pose match the first pose in the trajectory. For the purposes of our example, the robot will be reliably starting at a position of ``(0,0)`` with a heading of ``0``. In actual use, however, it is probably not desirable to base your coordinate system on the robot position, and so the starting position for both the robot and the trajectory should be set to some other value. If you wish to use a trajectory that has been defined in robot-centric coordinates in such a situation, you can transform it to be relative to the robot's current pose using the ``transformBy`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/Trajectory.html#transformBy(edu.wpi.first.math.geometry.Transform2d)>`_, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_trajectory.html#a8edfbd82347bbf32ddfb092679336cd8>`_). For more information about transforming trajectories, see :ref:`docs/software/advanced-controls/trajectories/transforming-trajectories:Transforming Trajectories`.
fr_ca: Il est très important que la pose initiale du robot corresponde à la première pose de la trajectoire. Pour les besoins de notre exemple, le robot commencera de manière fiable à une position de ``(0,0)`` avec un cap ou une orientation de ``0``. En utilisation réelle, cependant, il n’est probablement pas souhaitable de baser votre système de coordonnées sur la position du robot, et donc la position de départ du robot et la trajectoire doivent être réglées sur une autre valeur. Si vous souhaitez utiliser une trajectoire qui a été définie en coordonnées centrées sur le robot dans une telle situation, vous pouvez la transformer pour qu’elle soit relative à la pose actuelle du robot en utilisant la méthode `transformBy`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/Trajectory.html#transformBy(edu.wpi.first.math.geometry.Transform2d)>`_, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_trajectory.html#a8edfbd82347bbf32ddfb092679336cd8>`_). Pour plus d’informations sur la transformation des trajectoires, consulter :ref:`docs/software/advanced-controls/trajectories/transforming-trajectories:Transforming Trajectories`.

source: Now that we have a trajectory, we can create a command that, when executed, will follow that trajectory. To do this, we use the ``RamseteCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RamseteCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_ramsete_command.html>`__)
fr_ca: Maintenant que nous avons une trajectoire, nous pouvons créer une commande qui, une fois exécutée, suivra cette trajectoire. Pour ce faire, nous nous servons de la classe ``RamseteCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RamseteCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_ramsete_command.html>`__)

source: This declaration is fairly substantial, so we'll go through it argument-by-argument:
es_mx: Esta declaración es bastante sustancial, así que la revisaremos argumento por argumento:
fr_ca: Cette déclaration est assez substantielle, nous allons donc la scruter paramètre par paramètre:

source: The trajectory: This is the trajectory to be followed; accordingly, we pass the command the trajectory we just constructed in our earlier steps.
es_mx: La trayectoria: Esta es la trayectoria a seguir; en consecuencia, pasamos el comando de la trayectoria que acabamos de construir en nuestros pasos anteriores.
fr_ca: La trajectoire : C’est la trajectoire à suivre; en conséquence, nous passons à la commande la trajectoire que nous venons de construire dans nos étapes antérieures.

source: The pose supplier: This is a method reference (or lambda) to the :ref:`drive subsystem method that returns the pose <docs/software/pathplanning/trajectory-tutorial/creating-drive-subsystem:Odometry Accessor Method>`. The RAMSETE controller needs the current pose measurement to determine the required wheel outputs.
fr_ca: Le fournisseur de pose : il s'agit d'une référence de méthode (ou lambda) à la méthode du sous-système :ref:`drive qui renvoie la pose <docs/software/pathplanning/trajectory-tutorial/creating-drive-subsystem:Odometry Accessor Method>`. Le contrôleur RAMSETE a besoin de la mesure de pose actuelle pour déterminer les sorties de roue requises.
tr_tr: Poz tedarikçisi: Bu, :ref:`pozu döndüren sürüş alt sistemi metodu <docs/software/pathplanning/trajectory-tutorial/creating-drive-subsystem:Odometry Accessor Method>` için bir metod referansı (veya lambda) görevi görmektedir. RAMSETE kontrolörü gerekli teker çıktılarını belirlemek için anlık poz ölçümlerine ihtiyaç duymaktadır.

source: The RAMSETE controller: This is the ``RamseteController`` object (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/controller/RamseteController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_ramsete_controller.html>`__) that will perform the path-following computation that translates the current measured pose and trajectory state into a chassis speed setpoint.
fr_ca: Le contrôleur RAMSETE : Il s'agit de l'objet ``RamseteController`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/controller/RamseteController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_ramsete_controller.html>`__) qui effectuera les calculs relatifs au suivi de la trajectoire qui traduisent la pose actuelle mesurée et l’état de la trajectoire en un point de consigne de vitesse du châssis.

source: The drive kinematics: This is the ``DifferentialDriveKinematics`` object (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/kinematics/DifferentialDriveKinematics.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_differential_drive_kinematics.html>`__) that we constructed earlier in our constants file, and will be used to convert chassis speeds to wheel speeds.
fr_ca: Le paramètre drive kinematics : Il s’agit de l’objet ``DifferentialDriveKinematics`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/kinematics/DifferentialDriveKinematics.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_differential_drive_kinematics.html>`__) que nous avons construit plus tôt dans notre fichier de constantes, et qui sera utilisé pour convertir les vitesses du châssis en vitesses des roues.

source: The wheel speed supplier: This is a method reference (or lambda) to the :ref:`drive subsystem method that returns the wheel speeds <docs/software/pathplanning/trajectory-tutorial/creating-drive-subsystem:Encoder Accessor Method>`
fr_ca: Le fournisseur de vitesse de roue : il s'agit d'une référence de méthode (ou lambda) à la méthode du sous-système :ref:`drive qui renvoie les vitesses de roue <docs/software/pathplanning/trajectory-tutorial/creating-drive-subsystem:Encoder Accessor Method>`
tr_tr: Teker hızı tedrikçisi: Bu, :ref:`tekerlek hızını döndüren sürüş alt sistemi metodu <docs/software/pathplanning/trajectory-tutorial/creating-drive-subsystem:Encoder Accessor Method>` için bir metod referansı (veya lambda) görevi görmektedir.

source: The output consumer: This is a method reference (or lambda) to the :ref:`drive subsystem method that passes the voltage outputs to the drive motors <docs/software/pathplanning/trajectory-tutorial/creating-drive-subsystem:Voltage-Based Drive Method>`.
fr_ca: Le consommateur de sortie : il s'agit d'une référence de méthode (ou lambda) à la méthode du sous-système :ref:`drive qui transmet les sorties de tension aux moteurs d'entraînement <docs/software/pathplanning/trajectory-tutorial/creating-drive-subsystem:Voltage- Méthode de lecteur basée>`.
tr_tr: Çıktı tüketicisi: Bu, :ref:`voltaj çıktılarını sürüş motorlarına aktaran sürüş alt sistemi metodu <docs/software/pathplanning/trajectory-tutorial/creating-drive-subsystem:Voltage-Based Drive Method>` için bir metod referansı (veya lambda) görevi görmektedir.

source: The robot drive: This is the drive subsystem itself, included to ensure the command does not operate on the drive at the same time as any other command that uses the drive.
es_mx: El impulso del robot: Este es el subsistema de accionamiento en sí, incluido para asegurar que el comando no funcione en el accionamiento al mismo tiempo que cualquier otro comando que utilice el accionamiento.
fr_ca: Le sous-système d'entraînement du robot : Il s’agit du sous-système de déplacement lui-même, inclus ici pour s’assurer que la commande ne fonctionne pas sur la base pilotable en même temps que toute autre commande qui utilise cette même base pilotable.

source: Finally, note that we append a final "stop" command in sequence after the path-following command, to ensure that the robot stops moving at the end of the trajectory.
es_mx: Finalmente, note que añadimos un comando final de "stop" en secuencia después del comando de seguimiento de la trayectoria, para asegurar que el robot deje de moverse al final de la trayectoria.
fr_ca: Enfin, notez que nous ajoutons une commande finale "stop" dans l’ordre après la commande de suivi de la trajectoire, pour s’assurer que le robot s'immobilise à la fin de la trajectoire.

source: Video
fr_ca: Vidéo

source: If all has gone well, your robot's autonomous routine should look something like this:
es_mx: Si todo ha ido bien, la rutina autónoma de tu robot debería ser algo así:
fr_ca: Si tout s’est bien passé, la routine autonome de votre robot devrait ressembler à ceci :

source: C++ (Source)
es_mx: C++ (Fuente)
tr_tr: C ++ (Kaynak)

source: It is very important that the initial robot pose match the first pose in the trajectory. For the purposes of our example, the robot will be reliably starting at a position of ``(0,0)`` with a heading of ``0``. In actual use, however, it is probably not desirable to base your coordinate system on the robot position, and so the starting position for both the robot and the trajectory should be set to some other value. If you wish to use a trajectory that has been defined in robot-centric coordinates in such a situation, you can transform it to be relative to the robot's current pose using the ``transformBy`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/Trajectory.html#transformBy(edu.wpi.first.wpilibj.geometry.Transform2d)>`_, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Trajectory.html#a8edfbd82347bbf32ddfb092679336cd8>`_). For more information about transforming trajectories, see :ref:`docs/software/advanced-controls/trajectories/transforming-trajectories:Transforming Trajectories`.
es_mx: Es muy importante que la pose inicial del robot coincida con la primera pose en la trayectoria. Para los propósitos de nuestro ejemplo, el robot comenzará de manera confiable en una posición de ``(0,0)`` con un encabezado de ``0``. Sin embargo, en el uso real, probablemente no sea deseable basar su sistema de coordenadas en la posición del robot, por lo que la posición inicial tanto para el robot como para la trayectoria debe establecerse en algún otro valor. Si desea utilizar una trayectoria que ha sido definida en coordenadas centradas en el robot en tal situación, puede transformarla para que sea relativa a la pose actual del robot utilizando el método ``transformBy`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/Trajectory.html#transformBy(edu.wpi.first.wpilibj.geometry.Transform2d)>` _, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Trajectory.html#a8edfbd82347bbf32ddfb092679336cd8> `_). Para obtener más información sobre la transformación de trayectorias, consulte :ref:`docs/software/advanced-controls/trajectories/transforming-trajectories:Transforming Trajectories`.

source: Now that we have a trajectory, we can create a command that, when executed, will follow that trajectory. To do this, we use the ``RamseteCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RamseteCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1RamseteCommand.html>`__)
es_mx: Ahora que tenemos una trayectoria, podemos crear un comando que, cuando se ejecute, seguirá esa trayectoria. Para hacer esto, usamos la clase ``RamseteCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RamseteCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1RamseteCommand.html>`__)

source: The RAMSETE controller: This is the ``RamseteController`` object (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/RamseteController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1RamseteController.html>`__) that will perform the path-following computation that translates the current measured pose and trajectory state into a chassis speed setpoint.
es_mx: El controlador RAMSETE: Este es el objeto ``RamseteController`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/RamseteController.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1RamseteController.html>` __) que realizará el cálculo de seguimiento de ruta que traduce la pose actual medida y el estado de trayectoria en un punto de ajuste de velocidad del chasis.

source: The drive feedforward: This is a ``SimpleMotorFeedforward`` object (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/SimpleMotorFeedforward.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1SimpleMotorFeedforward.html>`__) that will automatically perform the correct feedforward calculation with the feedforward gains (``kS``, ``kV``, and ``kA``) that we obtained from the drive characterization tool.
es_mx: El feedforward del subsistema drive: Este es un objeto ``SimpleMotorFeedforward`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/SimpleMotorFeedforward.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1SimpleMotorFeedforward.html>` __) que realizará automáticamente el cálculo de feedforward correcto con las ganancias de feedforward (``kS``, ``kV``, and ``kA``) que obtuvimos de la herramienta de caracterización de variadores.
