Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/trajectory-tutorial/creating-drive-subsystem.po
Languages: fr_ca, tr_tr

source: Step 3: Creating a Drive Subsystem
fr_ca: Étape 3 : Création d’un sous-système de déplacement
tr_tr: 3. Adım: Sürücü Alt Sistemi Oluşturmak

source: Now that our drive is characterized, it is time to start writing our robot code *proper*. As mentioned before, we will use the :ref:`command-based <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` framework for our robot code. Accordingly, our first step is to write a suitable drive :ref:`subsystem <docs/software/commandbased/subsystems:Subsystems>` class.
fr_ca: Maintenant que la base pilotable est caractérisée, c'est le moment de commencer à écrire notre code robot *proprement dit*. Comme mentionné précédemment, nous utiliserons le cadre de développement :ref:`command-based <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`, pour ce faire. Aussi, notre première étape consiste à créer une classe sous-système de déplacement appropriée :ref:`subsystem <docs/software/commandbased/subsystems:Subsystems>`.

source: The full drive class from the RamseteCommand Example Project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) can be seen below. The rest of the article will describe the steps involved in writing this class.
fr_ca: La classe de déplacement complète du projet d’exemple RamseteCommand (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) peut être vu ci-dessous. Le reste de l’article décrira les étapes nécessaires dans l’écriture de cette classe.

source: C++ (Header)
fr_ca: C++ (Header ou en-tête)
tr_tr: C ++ (Header-Üstbilgi)

source: Configuring the Drive Encoders
fr_ca: Configuration des encodeurs du sous-système de déplacement
tr_tr: Drive-Sürüş Kodlayıcılarının Yapılandırılması

source: The drive encoders measure the rotation of the wheels on each side of the drive. To properly configure the encoders, we need to specify two things: the ports the encoders are plugged into, and the distance per encoder pulse. Then, we need to write methods allowing access to the encoder values from code that uses the subsystem.
fr_ca: Les encodeurs du sous-système de déplacement mesurent la rotation des roues de chaque côté de la base pilotable. Pour configurer correctement ces encodeurs, nous devons spécifier deux choses : les ports dans lesquels les encodeurs sont branchés et la distance par impulsion d’encodeur. Ensuite, nous devons écrire des méthodes permettant d'obtention de valeurs d’encodeur à partir du code qui utilise le sous-système.
tr_tr: Sürücü kodlayıcıları, sürücünün her iki yanındaki tekerleklerin dönüşünü ölçmektedir. Kodlayıcıları doğru bir şekilde yapılandırmak için iki şeyin tanımlanması gerekmektedir: kodlayıcıların takılı olduğu bağlantı noktaları ve kodlayıcı darbesi başına katedilen mesafe. Bunun ardından, alt sistemi kullanan koddan kodlayıcı değerlerine erişime izin veren metodlar yazmamız gerekmektedir.

source: Encoder Ports
fr_ca: Ports des encodeurs
tr_tr: Kodlayıcı Bağlantı Noktaları

source: The encoder ports are specified in the encoder's constructor, like so:
fr_ca: Les ports d'encodeur sont spécifiés dans le constructeur de l’encodeur de la manière suivante :
tr_tr: Kodlayıcı bağlantı noktaları, kodlayıcının constructor'ında aşağıdaki şekilde belirtilmektedir:

source: Encoder Distance per Pulse
fr_ca: Distance par impulsion d'encodeur
tr_tr: Darbe Başına Katedilen Kodlayıcı Mesafesi

source: Encoder Accessor Method
fr_ca: Méthode d'obtention d'encodeur
tr_tr: Kodlayıcı Accessor-Erişimci Metodu

source: To access the values measured by the encoders, we include the following method:
fr_ca: Pour accéder aux valeurs mesurées par les encodeurs, nous incluons la méthode suivante :
tr_tr: Kodlayıcılar tarafından ölçülen değerlere erişmek için aşağıdaki metodu dahil etmekteyiz:

source: The returned velocities **must** be in meters! Because we configured the distance per pulse on the encoders above, calling ``getRate()`` will automatically apply the conversion factor from encoder units to meters. If you are not using WPILib's ``Encoder`` class, you must perform this conversion either through the respective vendor's API or by manually multiplying by a conversion factor.
fr_ca: Les vitesses renvoyées ** doivent ** être en mètres! Parce que nous avons configuré la distance par impulsion sur les encodeurs ci-dessus, l'appel de ``getRate()`` appliquera automatiquement le facteur de conversion des unités d'encodeur aux mètres. Si vous n'utilisez pas la classe ``Encoder`` de WPILib, vous devez effectuer cette conversion soit via l'API du fournisseur respectif, soit en multipliant manuellement par un facteur de conversion.

source: We wrap the measured encoder values in a ``DifferentialDriveWheelSpeeds`` object for easier integration with the ``RamseteCommand`` class later on.
fr_ca: Nous enveloppons les valeurs d’encodeur mesurées dans un objet ``DifferentialDriveWheelSpeeds`` pour faciliter l’intégration, plus tard, avec la classe ``RamseteCommand``.

source: Configuring the Gyroscope
fr_ca: Configuration du Gyroscope
tr_tr: Jiroskopun Yapılandırılması

source: The gyroscope measures the rate of change of the robot's heading (which can then be integrated to provide a measurement of the robot's heading relative to when it first turned on). In our example, we use the `Analog Devices ADXRS450 FRC Gyro Board <https://www.analog.com/en/landing-pages/001/first.html>`__, which has been included in the kit of parts for several years:
fr_ca: Le gyroscope mesure le taux de changement de position angulaire du robot (qui peut ensuite être intégré pour fournir une mesure de l'angle du robot par rapport au moment où il s’est allumé pour la première fois). Dans notre exemple, nous utilisons le `Gyro Analog Devices ADXRS450 de board FRC <https://www.analog.com/en/landing-pages/001/first.html>`__, qui est inclus dans le kit de pièces depuis plusieurs années :

source: Gyroscope Accessor Method
fr_ca: Méthode d'obtention du gyroscope
tr_tr: Jiroskop Erişimci Metodu

source: To access the current heading measured by the gyroscope, we include the following method:
fr_ca: Pour accéder à l'orientation actuelle mesurée par le gyroscope, nous incluons la méthode suivante :
tr_tr: Jiroskop tarafından ölçülen anlık yöne erişmek için aşağıdaki metodu dahil etmekteyiz:

source: Configuring the Odometry
fr_ca: Configuration de l’odométrie
tr_tr: Odometrinin Yapılandırılması

source: Now that we have our encoders and gyroscope configured, it is time to set up our drive subsystem to automatically compute its position from the encoder and gyroscope readings.
fr_ca: Maintenant que nous avons nos encodeurs et gyroscope configurés, nous pouvons mettre en place notre sous-système de déplacement pour calculer automatiquement sa position à partir des lectures obtenues des encodeurs et de gyroscope.

source: First, we create a member instance of the ``DifferentialDriveOdometry`` class:
fr_ca: Tout d’abord, nous créons une instance membre de la classe ``DifferentialDriveOdometry``:

source: Updating the Odometry
fr_ca: Mise à jour de l’odométrie
tr_tr: Odometrinin Güncellenmesi

source: The odometry class must be regularly updated to incorporate new readings from the encoder and gyroscope. We accomplish this inside the subsystem's ``periodic`` method, which is automatically called once per main loop iteration:
fr_ca: La classe d’odométrie doit être régulièrement mise à jour pour incorporer de nouvelles lectures de l’encodeur et du gyroscope. Nous accomplissons cela à l’intérieur de la méthode ``periodic`` du sous-système, qui est automatiquement appelée une fois à chaque itération de boucle principale :

source: Odometry Accessor Method
fr_ca: Méthode d'obtention de l'odométrie

source: To access the robot's current computed pose, we include the following method:
fr_ca: Pour accéder à la pose actuelle calculée du robot, nous incluons la méthode suivante :

source: Voltage-Based Drive Method
fr_ca: Méthode du sous-système de déplacement en charge de la tension
tr_tr: Voltaj Tabanlı Sürüş Methodu

source: Finally, we must include one additional method - a method that allows us to set the voltage to each side of the drive using the ``setVoltage()`` method of the ``MotorController`` interface. The default WPILib drive class does not include this functionality, so we must write it ourselves:
fr_ca: Enfin, nous devons inclure une méthode supplémentaire - une méthode qui nous permet de régler la tension de chaque côté de la base pilotable en utilisant la méthode ``setVoltage()`` de l’interface ``MotorController``. La classe du système d'entraînement WPILib par défaut n’inclut pas cette fonctionnalité, nous devons donc l’écrire nous-mêmes:
tr_tr: Son olarak, ``MotorController`` arayüzünün ``setVoltage()`` metodunu kullanarak sürüşün her iki tarafınddaki voltajı ayarlamamızı sağlayan ek bir metodu bu yazıya dahil etmeliyiz. Varsayılan WPILib sürüş sınıfı bu işlevselliği içermediği için metodu kendimiz yazmalıyız:

source: The full drive class from the RamseteCommand Example Project (`Java <https://github.com/wpilibsuite/allwpilib/tree/v2024.3.2/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/v2024.3.2/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) can be seen below. The rest of the article will describe the steps involved in writing this class.
tr_tr: Aşağıda, RamseteCommand Örnek Projesi'ndeki drive sınıfının tamamını (`Java <https://github.com/wpilibsuite/allwpilib/tree/v2024.3.2/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/v2024.3.2/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) görüntüleyebilirsiniz. Yazının geri kalanı bu sınıfın yazılımı ile ilişkili adımları açıklayacaktır.

source: C++ (Source)
tr_tr: C ++ (Kaynak)

source: The distance per pulse is specified by calling the encoder's ``setDistancePerPulse`` method. Note that for the WPILib Encoder class, "pulse" refers to a full encoder cycle (i.e. four edges), and thus will be 1/4 the value that was specified in the SysId config. Remember, as well, that the distance should be measured in meters!
tr_tr: Darbe başına mesafe, kodlayıcının ``setDistancePerPulse`` metodunun çağırılmasıyla tanımlanmaktadır. WPILib Kodlayıcı sınıfı için "darbe"nin bütün bir kodlayıcı döngüsüne (diğer bir deyişle dört kenara) denk geldiğini ve bu sebeple SysId yapılandırılmasında tanımlanan değerin 1/4'ü olacağını unutmayınız. Ayrıca mesafenin metre cinsinde ölçülmesi gerektiğini de unutmayınız!

source: The gyroscope measures the rate of change of the robot's heading (which can then be integrated to provide a measurement of the robot's heading relative to when it first turned on). In our example, we use the `Analog Devices ADXRS450 FRC Gyro Board <https://www.analog.com/en/landing-pages/001/first.html>`__, which was included in the kit of parts for several years:
tr_tr: (Entegre edilmesiyle robotun ilk çalıştırıldığı konumuna göreceli bir şekilde robot yönüne dair ölçümler sağlayan) jiroskop robotun yönündeki değişim oranını ölçmektedir. Verdiğimiz örnekte parça kitinde uzun yıllar bulunmuş `Analog Devices ADXRS450 FRC Gyro Board <https://www.analog.com/en/landing-pages/001/first.html>`__'u kullanmaktayız.

source: Then we initialize the ``DifferentialDriveOdometry``.
tr_tr: Ardından ``DifferentialDriveOdometry``'i başlatıyoruz.

source: Before running a ``RamseteCommand``, teams are strongly encouraged to deploy and test the odometry code alone, with values sent to the SmartDashboard or Shuffleboard during the ``DriveSubsystem``'s ``periodic()``. This odometry must be correct for a RamseteCommand to successfully work, as sign or unit errors can cause a robot to move at high speeds in unpredictable directions.
tr_tr: ``RamseteCommand`` komutunu çalıştırmadan önce takımların, ``DriveSubsystem``'in ``periodic()`` sırasında SmartDashboard veya Shuffleboard'a gönderilendeğerlerle, kendi başına odometri kodunu çalıştırıp test etmesi şiddetle tavsiye edilmektedir. Bir RamseteCommand komutunun başarılı bir şekilde çalışması için odometrinin doğru olması şarttır, işaret veya birim hataları robotun öngörülemez yönlerde yüksek hızlarda hareket etmesine sebep olabilmektedir.

source: It is very important to use the ``setVoltage()`` method rather than the ordinary ``set()`` method, as this will automatically compensate for battery "voltage sag" during operation. Since our feedforward voltages are physically-meaningful (as they are based on measured identification data), this is essential to ensuring their accuracy.
tr_tr: Normal ``set()`` metodu yerine ``setVoltage()`` metodunun kullanılması, bu metodun kendiliğinden işlem sırasındaki "gerilim sarkması"nı telafi etmesinden ötürü önemlidir. İleri besleme voltajımız fiziksel olarak anlamlı olduğundan (değerler ölçülmüş tespit verilerine dayandığından), metodun kullanımı voltaj doğrulunun sağlanması için son derece önemlidir.

source: ``RamseteCommand`` itself does not internally enforce any speed or acceleration limits before providing motor voltage parameters to this method. During initial code development, teams are strongly encouraged to apply both maximum and minimum bounds on the input variables before passing these values to ``setVoltage()`` while ensuring the trajectory velocity and acceleration are achievable. For example, generate a trajectory with a little less than half of the Robot's maximum velocity and limit voltage to 6 volts.
tr_tr: ``RamseteCommand`` komutu, bu metoda motor voltaj parametrelerine ilişkin kendi başına dahili bir şekilde herhangi bir hız veya ivme limiti sağlamamaktadır. Kod geliştirmesinin ilk aşamalarında takımların, yörünge hızı ve ivmesinin ulaşılabilir değerlere sahip olduğundan emin olurken, değerleri ``setVoltage()`` metoduna aktarmadan önce girdi değişkenleri için en yüksek ve en düşük sınırlar tanımlaması şiddetle tavsiye edilmektedir. Örneğin, Robotun maksimum hızının yarısından biraz az olacak bir hız değeriyle voltajı 6'ya sınırlanmış bir yörünge oluşturunuz.
