Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/trajectory-tutorial/entering-constants.po
Languages: fr_ca

source: Step 2: Entering the Calculated Constants
fr_ca: Étape 2 : Saisie des constantes calculées

source: In C++, it is important that the feedforward constants be entered as the correct unit type. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
fr_ca: En C++, il est important que les constantes de la commande prédictive soient saisies dans le type d’unité approprié. Pour plus d’informations sur les unités C++, voir :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.

source: Now that we have our system constants, it is time to place them in our code. The recommended place for this is the ``Constants`` file of the :ref:`standard command-based project structure <docs/software/commandbased/structuring-command-based-project:Constants>`.
fr_ca: Maintenant que nous avons nos constantes système, il est temps de les placer dans notre code. L'emplacement recommandé pour cela est le fichier ``Constants`` de la :ref:`structure de projet basée sur des commandes standard <docs/software/commandbased/structuring-command-based-project:Constants>`.

source: The relevant parts of the constants file from the RamseteCommand Example Project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) can be seen below.
fr_ca: Les parties pertinentes du fichier des constantes de l’exemple de projet RamseteCommand (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/ramsetecommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/RamseteCommand>`__) peuvent être vue ci-dessous.

source: Feedforward/Feedback Gains
fr_ca: Gains Prédicitif/Rétroactif

source: Firstly, we must enter the feedforward and feedback gains which we obtained from the identification tool.
fr_ca: Tout d'abord, nous devons entrer les gains d'anticipation et de rétroaction que nous avons obtenus à partir de l'outil d'identification.

source: Feedforward and feedback gains do *not*, in general, transfer across robots. Do *not* use the gains from this tutorial for your own robot.
fr_ca: Les gains prédictif et rétroactif ne se transfèrent *pas*, en général, entre les robots. Aussi, n’utilisez pas les gains de ce tutoriel sur votre propre robot.

source: Additionally, we must create an instance of the ``DifferentialDriveKinematics`` class, which allows us to use the trackwidth (i.e. horizontal distance between the wheels) of the robot to convert from chassis speeds to wheel speeds. As elsewhere, we keep our units in meters.
fr_ca: En outre, nous devons créer une instance de la classe ``DifferentialDriveKinematics`` , qui nous permet d’utiliser la *trackwidth* (c’est-à-dire la distance horizontale entre les roues) du robot pour la conversion des vitesses du châssis aux vitesses des roues. Comme partout ailleurs, nous gardons nos unités en mètres.

source: Max Trajectory Velocity/Acceleration
fr_ca: Vitesse/accélération max sur la trajectoire

source: We must also decide on a nominal max acceleration and max velocity for the robot during path-following. The maximum velocity value should be set somewhat below the nominal free-speed of the robot. Due to the later use of the ``DifferentialDriveVoltageConstraint``, the maximum acceleration value is not extremely crucial.
fr_ca: Nous devons également décider d’une accélération nominale max et d’une vitesse maximale du robot pendant le suivi de la trajectoire. La valeur maximale de la vitesse doit être choisie légèrement en dessous de la vitesse libre nominale du robot. En raison de l’utilisation ultérieure du ``DifferentialDriveVoltageConstraint``, la valeur maximale de l’accélération n’est pas extrêmement cruciale.

source: Ramsete Parameters
fr_ca: Paramètres Ramsete

source: Finally, we must include a pair of parameters for the RAMSETE controller. The values shown below should work well for most robots, provided distances have been correctly measured in meters - for more information on tuning these values (if it is required), see :ref:`docs/software/advanced-controls/trajectories/ramsete:Constructing the Ramsete Controller Object`.
fr_ca: Enfin, nous devons inclure une paire de paramètres pour le contrôleur RAMSETE. Les valeurs indiquées ci-dessous devraient bien fonctionner pour la plupart des robots, à condition que les distances aient été correctement mesurées en mètres - pour plus d’informations sur le réglage de ces valeurs (si nécessaire), voir :ref:`docs/software/advanced-controls/trajectories/ramsete:Constructing the Ramsete Controller Object`.
