Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/trajectory-tutorial/trajectory-tutorial-overview.po
Languages: es_mx

source: Trajectory Tutorial Overview
es_mx: Descripción de Tutorial de Trayectoria

source: Todo
es_mx: Qué hacer

source: add pathweaver stuff once it is available
es_mx: agregue el material de la vía de acceso una vez que esté disponible

source: Before following this tutorial, it is helpful (but not strictly necessary) to have a baseline familiarity with WPILib's :ref:`PID control <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`, :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`, and :ref:`trajectory <docs/software/advanced-controls/trajectories/index:Trajectory Generation and Following with WPILib>` features.
es_mx: Antes de seguir este tutorial, es útil (pero no necesario) estar familiarizado con las características de WPILib :ref:`PID control <docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib>`, :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`, y :ref:`trajectory <docs/software/advanced-controls/trajectories/index:Trajectory Generation and Following with WPILib>`

source: The robot code in this tutorial uses the :ref:`command-based <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` framework. The command-based framework is strongly recommended for beginning and intermediate teams.
es_mx: El código del robot en este tutorial usa el marco de trabajo :ref:`command-based <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`. El espacio de trabajo basado en comandos es altamente recomendado para equipos principiantes.

source: The goal of this tutorial is to provide "end-to-end" instruction on implementing a trajectory-following autonomous routine for a differential-drive robot. By following this tutorial, readers will learn how to:
es_mx: El objetivo de este tutorial es proporcionar instrucciones de "principio a fin" para implementar una rutina autónoma de seguimiento de la trayectoria para un robot diferencial. Al seguir este tutorial, los lectores aprenderán cómo:

source: Accurately characterize their robot's drivetrain to obtain accurate feedforward calculations and approximate feedback gains.
es_mx: Caracterizar con precisión la cadena de tracción de su robot para obtener cálculos precisos de avance y ganancias aproximadas de retroalimentación.

source: Configure a drive subsystem to track the robot's pose using WPILib's odometry library.
es_mx: Configure un subsistema de unidad para rastrear la pose del robot utilizando la biblioteca de odometría de WPILib.

source: Generate a simple trajectory through a set of waypoints using WPILib's ``TrajectoryGenerator`` class.
es_mx: Generar una trayectoria simple a través de un conjunto de waypoints usando la clase ``TrajectoryGenerator`` de WPILib.

source: Follow the generated trajectory in an autonomous routine using WPILib's ``RamseteCommand`` class with the calculated feedforward/feedback gains and pose.
es_mx: Seguir la trayectoria generada en una rutina autónoma usando la clase ``RamseteCommand`` de WPILib con las ganancias calculadas de feedforward/feedback.

source: This tutorial is intended to be approachable for teams without a great deal of programming expertise. While the WPILib library offers significant flexibility in the manner in which its trajectory-following features are implemented, closely following the implementation outlined in this tutorial should provide teams with a relatively-simple, clean, and repeatable solution for autonomous movement.
es_mx: Este tutorial está hecho para que sea accesible para equipos que no tengan tanta experiencia en programación. Mientras que la librería de WPILib ofrece una flexibilidad significativa en la forma en la que se implementan sus características de seguimiento de trayectoria, seguir la implementación de este tutorial debería proporcionar a los equipos una solución relativamente simple, limpia y repetible para el movimiento autónomo.

source: Why Trajectory Following?
es_mx: ¿Por qué seguir la trayectoria?

source: FRC\ |reg| games often feature autonomous tasks that require a robot to effectively and accurately move from a known starting location to a known scoring location. Historically, the most common solution for this sort of task in FRC has been a "drive-turn-drive" approach - that is, drive forward by a known distance, turn by a known angle, and drive forward by another known distance.
es_mx: Los juegos en FRC\ |reg| a menudo presentan tareas autónomas que requieren que un robot se mueva de manera efectiva y precisa desde un lugar de inicio conocido a un lugar de puntuación conocido. Históricamente, la solución más común para este tipo de tareas en FRC ha sido un enfoque "drive-turn-drive", es decir, conducir hacia adelante por una distancia conocida, girar por un ángulo conocido y conducir hacia adelante por otra distancia conocida.

source: While the "drive-turn-drive" approach is certainly functional, in recent years teams have begun tracking smooth trajectories which require the robot to drive and turn at the same time. While this is a fundamentally more-complicated technical task, it offers significant benefits: in particular, since the robot no longer has to stop to change directions, the paths can be driven much faster, allowing a robot to score more game pieces during the autonomous period.
es_mx: Aunque el enfoque "conducir-girar-impulsar" es ciertamente funcional, en los últimos años los equipos han comenzado a rastrear trayectorias que requieren que el robot conduzca y gire al mismo tiempo. Aunque se trata de una tarea técnica fundamentalmente más complicada, ofrece importantes beneficios: en particular, dado que el robot ya no tiene que detenerse para cambiar de dirección, las trayectorias pueden ser recorridas mucho más rápido, lo que permite al robot anotar más piezas de juego durante el período autónomo.

source: Beginning in 2020, WPILib now supplies teams with working, advanced code solutions for trajectory generation and tracking, significantly lowering the "barrier-to-entry" for this kind of advanced and effective autonomous motion.
es_mx: Desde 2020, WPILib suministra ahora a los equipos soluciones de código de trabajo avanzadas para la generación de trayectorias y el seguimiento, educiendo significativamente la "barrier-to-entry" para este tipo de movimiento autónomo avanzado y efectivo.

source: Required Equipment
es_mx: Equipo Requerido

source: To follow this tutorial, you will need ready access to the following materials:
es_mx: Para seguir este tutorial, necesitarás acceso a los siguientes materiales:

source: Quadrature encoders for measuring the wheel rotation of each side of the drive.
es_mx: Codificadores de cuadratura para medir la rotación de la rueda de cada lado de la unidad.

source: A gyroscope for measuring robot heading.
es_mx: Un giroscopio para medir la dirección del robot.

source: A driver-station computer configured with:
es_mx: Una computadora driver-station configurada con:
