Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/index.po
Languages: es_mx, fr_ca, tr_tr

source: Hardware APIs
fr_ca: API du Matériel
tr_tr: Donanım API'ları

source: This section discusses the control of motors and pneumatics through motor controllers, solenoids, and pneumatics, and their interface with Java and C++ WPILib.
tr_tr: Bu bölüm motorlar ve pnömatiklerin; motor kontrolörleri, solenoidler ve pnömatikler ile Java ve C++ WPILib'in arayüzü üzerinden yönetimini tartışacaktır.

source: Motor Controllers
es_mx: Controladores de motor
fr_ca: Contrôleurs de moteurs
tr_tr: Motor Kontrolörleri

source: A motor controller is responsible on your robot for making motors move. For brushed DC motors such as the :term:`CIM` or 775, the motor controller regulates the voltage that the motor receives, much like a light bulb. For brushless motor controllers such as the Spark MAX, the controller regulates the power delivered to each "phase" of the motor.
tr_tr: Motor kontrolörü robotunuzda motorların hareketinden sorumludur. Fırçalı DC motorlarında, :term:`CIM` veya 775 gibi, motor kontrolörü, tıpkı bir ampülde olduğu gibi, motorun aldığı voltajı düzenlemektedir. Spark MAX gibi fırçasız motor kontrolörleri içinse kontrolör motorun her bir "aşamasına" aktarılan gücü düzenlemektedir.

source: Another name for a motor controller is a speed controller.
es_mx: Otro nombre para un controlador de motor es un controlador de velocidad.
fr_ca: Un autre nom pour un contrôleur de moteur est un contrôleur de vitesse.
tr_tr: Bir motor kontrolörünün diğer bir adı da hız kontrolörüdür.

source: One can make a quick, non-competition-legal motor controller by removing the motor from a cordless BRUSHED drill and attaching PowerPoles or equivalents to the motor's leads. Make sure that the voltage supplied by the drill will not damage the motor, but note that the 775 is fine at up to 24 volts.
es_mx: Se puede hacer un controlador de motor rápido, no legal para la competición, quitando el motor de un taladro inalámbrico BRUSHED y conectando PowerPoles o equivalentes a los cables del motor. Asegúrese de que el voltaje suministrado por el taladro no dañe el motor, pero tenga en cuenta que el 775 está bien hasta 24 voltios.
fr_ca: On peut fabriquer un contrôleur de moteur rapidement (mais non-conforme au normes FRC) en retirant le moteur d'une perceuse sans fil avec balais (non brushless) et en attachant des PowerPoles ou des équivalents aux fils du moteur. Assurez-vous que la tension fournie par la perceuse n'endommagera pas le moteur, mais notez que le 775 fonctionne bien jusqu'à 24 volts.
tr_tr: Motoru kablosuz FIRÇALI bir matkaptan çıkarıp motorun uçlarına PowerPoles veya eşdeğerlerini takarak çabuk, kullanıma uygun müsabaka dışı bir motor kontrolörü yapılabilmektedir. Matkap tarafından sağlanan voltajın motora zarar vermeyeceğinden emin olunuz, ancak 775'in 24 volta kadar sorun çıkarmayacağını unutmayınız.

source: Connecting a BRUSHLESS motor controller straight to power, such as to a conventional brushed motor controller, will destroy the motor!
es_mx: Advertencia: Conectar el controlador de un motor SIN ESCOBILLAS directo a la corriente, como un controlador de motor de escobilla, ¡destruirá el motor!
fr_ca: Attention! Brancher un moteur de type "Brushless" directement à l'alimentation, comme un moteur à balais conventionnel, détruira le moteur!
tr_tr: Geleneksel fırçalı bir motor kontrolörü gibi FIRÇASIZ bir motor kontrolörünü doğrudan güç kaynağına bağlamak, motoru mahvedecektir!

source: FRC Legal Motor Controllers
es_mx: Controladores de motores legales FRC
fr_ca: Contrôleurs de moteur légaux FRC
tr_tr: FRC'de Kullanıma Uygun Motor Sürücüleri

source: Motor controllers come in lots of shapes, sizes, and feature sets. This is the full list of FRC\ |reg| Legal motor controllers as of 2025:
tr_tr: Motor kontrolörleri birçok farklı şekle, boyuta ve özellik setine sahiptir. FRC\ |reg|'de Kullanıma Uygun motor kontrolörlerinin 2025 yılı itibariyle tam listesi aşağıdaki şekildedir:

source: DMC 60/DMC 60c Motor Controller (P/N: 410-334-1, 410-334-2)
es_mx: DMC 60/DMC 60c Controlador de Motor (P/N: 410-334-1, 410-334-2)
fr_ca: DMC 60/DMC 60c (P/N: 410-334-1, 410-334-2)
tr_tr: DMC 60/DMC 60c Motor Sürücü (P/N: 410-334-1, 410-334-2)

source: Jaguar Motor Controller (P/N: MDL-BDC, MDL-BDC24, and 217-3367) connected to :term:`PWM` only
tr_tr: Sadece :term:`PWM`'ye bağlı Jaguar Motor Controller (P/N: MDL-BDC, MDL-BDC24, and 217-3367)

source: Koors40 Motor Controller (P/N am-5600)
tr_tr: Koors40 Motor Kontrolörlü (P/N am-5600)

source: Nidec Dynamo BLDC Motor with Controller to control integral actuator only (P/N 840205-000, am-3740)
es_mx: Motor Nidec Dynamo BLDC con controlador solo a control de solenoide integral (P/N 840205-000, am-3740)
fr_ca: Moteur Nidec Dynamo BLDC avec contrôleur (P/N 840205-000, am-3740)
tr_tr: Yalnızca gömülü aktüatörü kontrol eden Kontrolörlü Nidec Dynamo BLDC Motor (P/N 840205-000, am-3740)

source: SD540 Motor Controller (P/N: SD540x1, SD540x2, SD540x4, SD540Bx1, SD540Bx2, SD540Bx4, SD540C)
es_mx: SD540 Controlador de Motor(P/N: SD540x1, SD540x2, SD540x4, SD540Bx1, SD540Bx2, SD540Bx4, SD540C)
fr_ca: SD540 (P/N: SD540x1, SD540x2, SD540x4, SD540Bx1, SD540Bx2, SD540Bx4, SD540C)
tr_tr: SD540 Motor Kontrolörü (P/N: SD540x1, SD540x2, SD540x4, SD540Bx1, SD540Bx2, SD540Bx4, SD540C)

source: Spark Flex Motor Controller (P/N REV-11-2159, am-5276)
tr_tr: Spark Flex Motor Kontrolörü (P/N REV-11-2159, am-5276)

source: Spark Motor Controller (P/N: REV-11-1200, am-4260)
tr_tr: Spark Motor Kontrolörü (P/N: REV-11-1200, am-4260)

source: Spark MAX Motor Controller (P/N: REV-11-2158, am-4261)
tr_tr: Spark MAX Motor Kontrolörü (P/N: REV-11-2158, am-4261)

source: Talon FX Motor Controller (P/N 217-6515, 19-708850, am-6515, am-6515_Short, WCP-0940) for controlling integral Falcon 500 or Kraken X60 only,
tr_tr: Sadece gömülü Falcon 500 veya Kraken X60 yönetimi için Talon FX Motor KOntrolörü (P/N 217-6515, 19-708850, am-6515, am-6515_Short, WCP-0940)

source: Talon FXS Motor Controller (P/N 24-708883, WCP-1692)
tr_tr: Talon FXS Motor Kontrolörü (P/N 24-708883, WCP-1692)

source: Talon Motor Controller (P/N: CTRE_Talon, CTRE_Talon_SR, and am-2195)
es_mx: Controlador de motor Talon (P/N: CTRE_Talon, CTRE_Talon_SR, and am-2195)
fr_ca: Talon (P/N: CTRE_Talon, CTRE_Talon_SR, and am-2195)
tr_tr: Talon Motor Kontrolörü (P/N: CTRE_Talon, CTRE_Talon_SR, and am-2195)

source: Talon SRX Motor Controller (P/N: 217-8080, am-2854, 14-838288)
es_mx: Controlador de motor Talon SRX (P/N: 217-8080, am-2854, 14-838288)
fr_ca: Talon SRX (P/N: 217-8080, am-2854, 14-838288)
tr_tr: Talon SRX Motor Kontrolörü (P/N: 217-8080, am-2854, 14-838288)

source: Venom Motor with Controller (P/N BDC-10001) for controlling integral motor only​
es_mx: Motor Venom con controlador (P/N BDC-10001) solo para controlado integral de motor.
fr_ca: Moteur Venom avec contrôleur (P/N BDC-10001) pour contrôler uniquement le moteur correspondant
tr_tr: Sadece gömülü motorunu kontrol eden Kontrolörlü Venom Motoru (P / N BDC-10001)

source: Victor 884 Motor Controller (P/N: VICTOR-884-12/12)
es_mx: Controlador de motor Victor 884 (P/N: VICTOR-884-12/12)
fr_ca: Victor 884 (P/N: VICTOR-884-12/12)
tr_tr: Victor 884 Motor Kontrolörü (P/N: VICTOR-884-12/12)

source: Victor 888 Motor Controller (P/N: 217-2769)
es_mx: Controlador de motor Victor 888 (P/N: 217-2769)
fr_ca: Victor 888 (P/N: 217-2769)
tr_tr: Victor 888 Motor Kontrolörü (P/N: 217-2769)

source: Victor SP Motor Controller (P/N: 217-9090, am-2855, 14-868380)
es_mx: Controlador de motor Victor SP (P/N: 217-9090, am-2855, 14-868380)
fr_ca: Victor SP (P/N: 217-9090, am-2855, 14-868380)
tr_tr: Victor SP Motor Kontrolörü (P/N: 217-9090, am-2855, 14-868380)

source: Victor SPX Motor Controller (P/N: 217-9191, 17-868388, am-3748)
es_mx: Controlador de motor Victor SPX (P/N: 217-9191, 17-868388, am-3748)
fr_ca: Victor SPX (P/N: 217-9191, 17-868388, am-3748)
tr_tr: Victor SPX Motor Kontrolörü (P/N: 217-9191, 17-868388, am-3748)

source: Pneumatics
es_mx: Neumática
fr_ca: La pneumatique
tr_tr: Pnömatikler

source: Pneumatics are a quick and easy way to make something that's in one state or another using compressed air. For information on operating pneumatics, see :doc:`pneumatics/index`.
tr_tr: Pnömatikler sıkıştırılmış hava kullanarak bulunduğu durumlar arasında geçiş yapan bir bileşen yapmanın çabuk ve kolay bir yoludur. Pnömatiklerin yönetimine dair daha fazla bilgi için bkz. :doc:`pneumatics/index`.

source: FRC Legal Pneumatics controllers
es_mx: Controladores de neumáticos legales FRC
fr_ca: Dispositifs pneumatiques légaux pour la FRC
tr_tr: FRC'de Kullanıma Uygun Pnömatik kontrolörleri

source: Pneumatics Control Module (P/N: am-2858, 217-4243)
es_mx: Módulo de control de neumáticos (P/N: am-2858, 217-4243)
fr_ca: Module de commande pneumatique (P/N: am-2858, 217-4243)
tr_tr: Pneumatics Kontrol Modülü (P/N: am-2858, 217-4243)

source: Pneumatic Hub (P/N REV-11-1852)
fr_ca: Concentrateur pneumatique (P/N REV-11-1852)
tr_tr: Pnömatik Hub (P/N REV-11-1852)

source: Relays
es_mx: Relés
fr_ca: Relais
tr_tr: Röleler

source: A relay controls power to a motor or custom electronics in an On/Off fashion.
es_mx: Un relé controla la energía a un motor o electrónica personalizada en forma de encendido / apagado.
fr_ca: Un relais contrôle la puissance d’un moteur ou d’un système électronique personnalisé selon le mode on/off (tout ou rien).
tr_tr: Röle, bir motora veya kişisel elektroniğe giden gücü Açık / Kapalı şeklinde kontrol etmektedir..

source: FRC Legal Relay Modules
es_mx: Modulo relevador legales FRC
fr_ca: Modules de relais légaux pour la FRC
tr_tr: FRC'de Kullanıma Uygun Röle Modülleri

source: Spike H-Bridge Relay (P/N: 217-0220 and SPIKE-RELAY-H)
es_mx: Relevador Spike H-Bridge (P/N: 217-0220 and SPIKE-RELAY-H)
fr_ca: Relais Spike H-Bridge (P/N: 217-0220 et SPIKE-RELAY-H)
tr_tr: Spike H-Bridge Röle (P/N: 217-0220 and SPIKE-RELAY-H)

source: Automation Direct Relay (P/N: AD-SSR6M12-DC200D, AD-SSR6M25-DC200D, AD-SSR6M40-DC200D)
es_mx: Relevador Directo de Automatizacion (P/N: AD-SSR6M12-DC200D, AD-SSR6M25-DC200D, ADSSR6M40-DC200D)
fr_ca: Relais direct d'automatisation (P/N: AD-SSR6M12-DC200D, AD-SSR6M25-DC200D, AD-SSR6M40-DC200D)
tr_tr: Automation Direct Röle (P/N: AD-SSR6M12-DC200D, AD-SSR6M25-DC200D, AD-SSR6M40-DC200D)

source: Power Distribution Hub (PDH) switched channel (P/N REV-11-1850)
fr_ca: Canal commuté du concentrateur de distribution de puissance (PDH) (P/N REV-11-1850)
tr_tr: Değişen kanallara sahip Power Distribution Hub (PDH) (P/N REV-11-1850)

source: This section discusses the control of motors and pneumatics through motor controllers, solenoids and pneumatics, and their interface with Java and C++ WPILib.
es_mx: Esta sección habla del control de motores y neumáticos a través de controladores de velocidad, solenoides y neumáticos, y su interfaz con Java y C++ WPILib.
fr_ca: Cette section traite du contrôle des moteurs et de la pneumatique via les contrôleurs de moteur, les solénoïdes et la pneumatique, et leur interface avec Java et C++ WPILib.

source: A motor controller is responsible on your robot for making motors move. For brushed DC motors such as CIMs or 775s, the motor controller regulates the voltage that the motor receives, much like a light bulb. For brushless motor controllers such as the Spark MAX, the controller regulates the power delivered to each "phase" of the motor.
es_mx: Un controlador de motor es el responsable en tu robot de hacer que los motores se muevan. En el caso de los motores de corriente continua con escobillas, como los CIM o los 775, el controlador del motor regula la tensión que recibe el motor, de forma parecida a una bombilla. En el caso de los controladores de motores sin escobillas, como el Spark MAX, el controlador regula la potencia suministrada a cada "fase" del motor.
fr_ca: Un contrôleur moteur est responsable dans votre robot de l'activation des moteurs. Pour les moteurs DC à balais tels que les CBM ou les 775, le contrôleur de moteur régule la tension que le moteur reçoit, un peu comme une ampoule. Pour les contrôleurs de moteurs sans balais tels que le Spark MAX, le contrôleur régule la puissance livrée à chaque "phase" du moteur.

source: Motor controllers come in lots of shapes, sizes and feature sets. This is the full list of FRC\ |reg| Legal motor controllers as of 2022:
fr_ca: Les contrôleurs de moteurs se présentent sous de nombreuses formes, tailles et ensembles de fonctionnalités. Voici la liste complète des contrôleurs de moteurs légaux en FRC\ |reg| à partir de janvier 2022 :

source: Jaguar Motor Controller (P/N: MDL-BDC, MDL-BDC24, and 217-3367) connected to PWM only
es_mx: Controlador de Motor Jaguar (P/N: MDL-BDC, MDL-BDC24, and 217-3367) connected to PWM onl
fr_ca: Jaguar (P/N: MDL-BDC, MDL-BDC24, and 217-3367) relié aux sorties PWM

source: Spark Motor Controller (P/N: REV-11-1200)
es_mx: Controlador de motor Spark (P/N: REV-11-1200)
fr_ca: Spark (P/N: REV-11-1200)

source: Spark MAX Motor Controller (P/N: REV-11-2158)
es_mx: Controlador de motor Spark MAX (P/N: REV-11-2158)
fr_ca: Spark MAX (P/N: REV-11-2158)

source: Talon FX Motor Controller (P/N: 217-6515, 19-708850, am-6515, am-6515_Short) for controlling integral Falcon 500 only
es_mx: Controlador de motor Talon FX (P/N:217-6515, 19-708850, am-6515, am-6515_Short) solo para controlado integral de Falcon 500
fr_ca: Contrôleur de moteur Talon FX (P/N: 217-6515, 19-708850, am-6515, am-6515_Short) pour contrôler le Falcon 500

source: Pneumatics are a quick and easy way to make something that's in one state or another using compressed air. For information on operating pneumatics, see :doc:`pneumatics/pneumatics`.
es_mx: Los neumáticos son una forma rápida y sencilla de hacer algo que esta en un estado u otro usando aire comprimido. Para información en operación de neumáticos, ver :doc:`pneumatics/pneumatics`.
fr_ca: La pneumatique est un moyen rapide et facile de fabriquer quelque chose qui est dans un état ou un autre en utilisant de l'air comprimé. Pour plus d'informations sur le fonctionnement de la pneumatique, voir :doc:`pneumatics/pneumatics`.

source: Motor controllers come in lots of shapes, sizes and feature sets. This is the full list of FRC\ |reg| Legal motor controllers as of January 2020:
es_mx: Los controladores de motor vienen en muchas formas, tamaños y conjuntos de características. Esta es la lista completa de controladores de motor legales de FRC a partir de enero de 2020:
