Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/tasks/beta-task-overview.po
Languages: es_mx, fr_ca

source: Beta Task Overview
es_mx: Descripción general de la tarea beta
fr_ca: Vue d’ensemble des Beta tâches

source: This document provides an overview of the Tasks we'd like you to try for the Control System Beta Test. Further details on each Task can be found in the subsequent pages of this section. Target completion dates are provided to give you an estimate of how you may want to progress through the tasks during the test period.
fr_ca: Ce document fournit un aperçu des tâches que nous aimerions que vous essayiez pour le test bêta du système de contrôle. De plus amples détails sur chaque tâche peuvent être trouvés dans les pages suivantes de cette section. Les dates d'achèvement cibles sont fournies pour vous donner une estimation de la façon dont vous pouvez progresser dans les tâches pendant la période de test.

source: For the 2022 FRC\ |reg| Beta Test, some of you may not have access to physical robot hardware. We recognize this will inhibit your ability to complete some tasks. Teams without hardware should skip Task 2, merely ensure they can build their 2020/21 robot code for Task 3 and focus on Task 4, testing new features to the extent possible using simulation.
fr_ca: Pour le Test bêta FRC 2022\ |reg|, certains d'entre vous n'ont peut-être pas accès au matériel physique du robot. Nous reconnaissons que cela entravera votre capacité à accomplir certaines tâches. Les équipes sans matériel doivent ignorer la tâche 2, s'assurer simplement qu'elles peuvent créer leur code de robot 2020/21 pour la tâche 3 et se concentrer sur la tâche 4, en testant de nouvelles fonctionnalités dans la mesure du possible à l'aide de la simulation.

source: Task 0 - Background and Preparation
es_mx: Tarea 0: antecedentes y preparación
fr_ca: Tâche 0 - Contexte et préparation

source: The purpose of Task 0 is to complete some housekeeping tasks and familiarize yourself with the tools and documentation for the Beta Test before beginning. This task consists of 1 Objective:
es_mx: El propósito de la Tarea 0 es completar algunas tareas de limpieza y familiarizarse con las herramientas y la documentación de la Prueba Beta antes de comenzar. Esta tarea consta de 1 objetivo:
fr_ca: Le but de la tâche 0 est d’accomplir certaines tâches de gestion interne et de vous familiariser avec les outils et la documentation pour le Beta Test avant de commencer. Cette tâche poursuit 1 Objectif :

source: Beta Test Tools and Documentation Familiarization
es_mx: Herramientas de prueba beta y familiarización con la documentación
fr_ca: Outils Beta Test et familiarisation avec la documentation

source: Task 1 - Install Software (Targeted Completion 10/22/2021)
fr_ca: Tâche 1 - Installer le logiciel (date cible 22/10/2021)

source: The purpose of Task 1 is to complete installation of the new Control System software. This task consists of 1 Objective
es_mx: El propósito de la Tarea 1 es completar la instalación del nuevo software del Sistema de Control. Esta tarea consta de 1 objetivo
fr_ca: Le but de la Tâche 1 est de terminer l’installation du nouveau logiciel du système de contrôle. Cette tâche poursuit 1 Objectif

source: Install the necessary software for your assigned Beta Test language (LabVIEW or VSCode + plugins, NI FRC Game Tools, CTRE installer if using CANTalon SRX, REV installer if using SPARK MAX or new REV hardware)
fr_ca: Installez le logiciel nécessaire pour le langage de test bêta qui vous est attribué (plugins LabVIEW ou VSCode +, NI FRC Game Tools, programme d'installation CTRE si vous utilisez CANTalon SRX, programme d'installation REV si vous utilisez SPARK MAX ou un nouveau matériel REV)

source: Task 2 - Basic Benchtop Test (Targeted Completion 10/29/2021)
fr_ca: Tâche 2 - Test de base (date cible 29/10/2021)

source: The purpose of Task 2 is to get the base new Control System software set up and running. This helps minimize complexity to ease debugging of any issues that do occur. In this task you will set up the development environment for your programming language, configure the roboRIO, load and debug a simple program. This Task consists of 2 Objectives:
es_mx: El propósito de la Tarea 2 es configurar y ejecutar el nuevo software básico del Sistema de control. Esto ayuda a minimizar la complejidad para facilitar la depuración de cualquier problema que ocurra. En esta tarea, configurará el entorno de desarrollo para su lenguaje de programación, configurará roboRIO, cargará y depurará un programa simple. Esta tarea consta de 2 objetivos:
fr_ca: Le but de la Tâche 2 est d'installer, de configurer et d’exécuter le nouveau logiciel du système de contrôle. Cela permet de minimiser la complexité pour faciliter le débogage de tous les problèmes qui se produisent. Dans cette tâche, vous configurerez l’environnement de développement pour votre langage de programmation, configurerez le roboRIO, chargerez et déboguerez un programme simple. Cette tâche poursuit 2 Objectifs :

source: Configure the roboRIO
es_mx: Configurar el roboRIO
fr_ca: Configurer le roboRIO

source: Create, Build and Load Default Program
es_mx: Crear, construir y cargar un programa predeterminado
fr_ca: Créer, compiler et charger le programme par défaut

source: Task 3 - Port Previous Robot Code (Targeted Completion 11/12/2021)
fr_ca: Tâche 3 - Traduire le code du robot précédent (date cible 12/11/2021)

source: The purpose of Task 3 is to port the previous year's robot code with the new Control System software and bring it to full functionality. This Task consists of 2 Objectives and 1 Optional Objective:
es_mx: El propósito de la Tarea 3 es portar el código del robot del año anterior con el nuevo software del Sistema de Control y llevarlo a la funcionalidad completa. Esta tarea consta de 2 objetivos y 1 objetivo opcional:
fr_ca: Le but de la Tâche 3 est d'importer le code robot de l’année précédente dans le nouveau logiciel du système de contrôle et de l’amener à fonctionner parfaitement. Cette tâche poursuit 2 objectifs obligatoires et 1 objectif facultatif :

source: Port Existing Robot Code to new System
es_mx: Transferir el código de robot existente a un nuevo sistema
fr_ca: Importer un code robot existant vers le nouveau système

source: Wireless Operation of FRC Robot
es_mx: Operación inalámbrica del robot FRC
fr_ca: Opérer sans fil un robot FRC

source: (Optional) Play with robot at offseason event
fr_ca: (Facultatif) Jouez avec un robot lors d'un événement hors saison

source: Task 4 - New Code and Advanced Feature Testing (Targeted Completion 12/3/2021)
fr_ca: Tâche 4 - Test du nouveau code et des fonctionnalités avancées (date cible 03/12/2021)

source: Note: Objectives in Task 4 may be completed in any order.
es_mx: Nota: Los objetivos de la Tarea 4 pueden completarse en cualquier orden.
fr_ca: Remarque : Les objectifs de la Tâche 4 peuvent être complétés dans n’importe quel ordre.

source: The purpose of Task 4 is to write new code in order to test features and functionality of the new Control System software. While we have written up a number of ideas, please feel free to come up with your own and report on what you tried/are trying and how it went.
es_mx: El propósito de la Tarea 4 es escribir código nuevo para probar las características y la funcionalidad del nuevo software del Sistema de Control. Si bien hemos escrito una serie de ideas, no dude en presentar las suyas propias e informar sobre lo que intentó / está tratando y cómo le fue.
fr_ca: Le but de la Tâche 4 est d’écrire un nouveau code afin de tester les caractéristiques et les fonctionnalités du nouveau logiciel du système de contrôle. BIen que nous ayions mis de l'avant un certain nombre d’idées pour les tests, s’il vous plaît, n’hésitez pas à suggérer vos propres idées et nous rapporter ce que vous avez essayé/être en train d'essayez et décrire comment ça s’est passé.

source: REV Robotics Hardware and associated software
fr_ca: Matériel REV Robotics et logiciels associés

source: RoboRIO 2.0, especially the SD card imaging process
fr_ca: RoboRIO 2.0, en particulier le processus d'imagerie de la carte SD

source: This document provides an overview of the Tasks assigned for the Control System Beta Test. Further details on each Task can be found in the subsequent pages of this section.
es_mx: Este documento proporciona una descripción general de las tareas asignadas para la prueba beta del sistema de control. Se pueden encontrar más detalles sobre cada tarea en las páginas siguientes de esta sección.

source: Task 1 - Install Software (Targeted Completion 11/8/2020)
es_mx: Tarea 1: Instalar software (finalización prevista 8/11/2020)

source: Install the necessary software for your assigned Beta Test language (LabVIEW or VSCode + plugins, NI FRC Game Tools, CTRE installer if using CANTalon SRX)
es_mx: Instale el software necesario para su lenguaje Beta Test asignado (complementos de LabVIEW o VSCode +, NI FRC Game Tools, instalador CTRE si usa CANTalon SRX)

source: Task 2 - Basic Benchtop Test (Targeted Completion 11/15/2020)
es_mx: Tarea 2: Prueba de laboratorio básica (finalización prevista el 15/11/2020)

source: Task 3 - Port Previous Robot Code (Targeted Completion 11/22/2020)
es_mx: Tarea 3: Transferir código de robot anterior (finalización prevista 22/11/2020)

source: Task 4 - New Code and Advanced Feature Testing (Targeted Completion 11/29/2020)
es_mx: Tarea 4: Prueba de código nuevo y funciones avanzadas (finalización prevista el 29/11/2020)

source: New Command Based framework
es_mx: Nuevo marco basado en comandos

source: Kinematics classes
es_mx: Clases de cinemática

source: C++/Java Simulator UI
es_mx: IU del simulador C++ / Java
