Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/tasks/task-0-tools-and-docs.po
Languages: fr_ca

source: Task 0: Beta Test Tools and Documentation Familiarization
fr_ca: Tâche 0: Familiarisation avec les outils de test bêta et la documentation

source: Task: Learn about the tools and documentation sources for the FRC\ |reg| Beta
fr_ca: Tâche : Consultez les outils et les sources de documentation relatives à la version Bêta FRC\ |reg|

source: Beta Test Tools
fr_ca: Outils de test bêta

source: The FRC Control System Beta Test will primarily be administered through a TeamForge project. If you have not been part of an Alpha or Beta test effort in the last few years, please take some time to read through the following articles to learn more about the tool being used:
fr_ca: Le test bêta du système de contrôle FRC sera principalement administré par le biais d'un projet TeamForge. Si vous n'avez pas participé à un effort de test alpha ou bêta au cours des dernières années, veuillez prendre le temps de lire les articles suivants pour en savoir plus sur l'outil utilisé:

source: Beta Test Documentation
fr_ca: Documentation du test bêta

source: There will be 2 primary sources of Beta Test specific documentation. The first source is this manual which will primarily contain things like task instructions as well as documentation updated for the new season. This documentation is publicly accessible without a username or password.
fr_ca: Il y aura 2 sources principales de documentation spécifique au test bêta. La première source est ce manuel qui contiendra principalement des choses comme les instructions de tâches ainsi que la documentation mise à jour pour la nouvelle saison. Cette documentation est accessible au public sans nom d'utilisateur ni mot de passe.

source: The other source of documentation will be the Documents section of the TeamForge project. For more information on how to access that, see :ref:`docs/beta/beta-getting-started/accessing-the-beta-project:Accessing the Beta Project`. This document will any information intended to be limited to only beta teams. There may or may not be any documentation in this section.
fr_ca: L'autre source de documentation sera la section Documents du projet TeamForge. Pour plus d'informations sur la façon d'y accéder, voir :ref:`docs/beta/beta-getting-started/accessing-the-beta-project:Accessing the Beta Project`. Ce document contiendra toutes les informations destinées à être limitées aux seules équipes bêta. Il peut y avoir ou non de la documentation dans cette section.

source: Please read through the documentation in this section to understand the tasks associated with the Beta Test.
fr_ca: Veuillez lire la documentation de cette section pour comprendre les tâches associées au test bêta.

source: Desired Feedback
fr_ca: Commentaires souhaités

source: No report is necessary for this task.
fr_ca: Aucun rapport n'est nécessaire pour cette tâche.
