Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/tasks/task-2-configure-and-benchtop.po
Languages: es_mx, fr_ca

source: Task 2: Configure roboRIO & Benchtop Test
es_mx: Tarea 2: Configure la roboRIO & Prueba
fr_ca: Tâche 2: configuration du roboRIO et du prototype

source: Task:
es_mx: Tarea:
fr_ca: Tâche

source: Image and configure your roboRIO controller.
es_mx: Imagen y configure su controlador de roboRIO.
fr_ca: Imaginez et configurez votre contrôleur roboRIO.

source: Create, build, load and run a basic robot program (template of your choosing) on the roboRIO benchtop setup.
es_mx: Cree, construya, cargue y corra un programa básico de robot (el modelo de su elección) en los ajustes de la mesa de trabajo de la roboRIO.
fr_ca: Créez, construisez, chargez et exécutez un programme de robot de base (modèle de votre choix) sur la configuration de table roboRIO.

source: Overview
es_mx: Vista general
fr_ca: Aperçu

source: Before using the roboRIO controller with the Beta software, it must be imaged with the new image and configured with your FRC\ |reg| team number. As part of the purpose of this Beta test is to test the documentation and its ease of use, no direct links to setup instructions will be provided. Instructions for configuring the roboRIO are available on the :ref:`docs/zero-to-robot/step-3/index:Step 3: Preparing Your Robot` page.
es_mx: Antes de usar el controlador de la roboRIO con un software Beta, debe estar configurado con la nueva imagen y con su número de equipo de FRC. Como parte del propósito de esta prueba Beta es probar la documentación y si es fácil de usar, sin enlaces directos para ajustar las instrucciones serán dadas. Las instrucciones para configurar la roboRIO están disponibles en la página :ref:`docs/zero-to-robot/step-3/index:Step 3: Preparing Your Robot`.
fr_ca: Avant d’utiliser le contrôleur roboRIO avec la version Bêta du logiciel, il doit être pourvu de la nouvelle image et configuré avec votre numéro d’équipe FRC\ |reg|. Comme l'objet du présent test Bêta est précisément de tester la documentation et sa facilité d’utilisation, aucun lien direct vers les instructions de configuration ne sera fourni. Les instructions pour configurer le roboRIO sont disponibles sur la page :ref:`docs/zero-to-robot/step-3/index:Step 3: Preparing Your Robot`.

source: The image version in the documentation may not be updated yet. You should use the latest image available after installing the latest Beta Update.
es_mx: La versión de imagen el la documentación puede no estar actualizado aún. Puede usar la última imagen disponible antes de instalar la ultima actualización Beta.
fr_ca: La version de l'image dans la documentation n'est peut-être pas encore mise à jour. Vous devez utiliser la dernière image disponible après avoir installé la dernière mise à jour bêta.

source: Next verify the ability to create and download a basic robot program from the chosen template in the assigned programming language. This will verify that the development environment is set up correctly and working properly before moving on to a more complex system. For this task you should create, build and download a basic program to the roboRIO to run at startup, then verify that you are able to communicate with and enable the program using the Driver Station. Instructions can be found on the :ref:`docs/zero-to-robot/step-4/index:Step 4: Programming your Robot` page.
es_mx: A continuación, verifique la capacidad de crear y descargar un programa de robot básico a partir de la plantilla elegida en el lenguaje de programación asignado. Esto verificará que el entorno de desarrollo esté configurado correctamente y funcione apropiadamente antes de pasar a un sistema más complejo. Para esta tarea, debe crear, construir y descargar un programa básico a la roboRIO para que se ejecute al inicio, luego verificar que puede comunicarse y habilitar el programa usando la Driver Station. Las instrucciones pueden encontrarse en la página :ref:`docs/zero-to-robot/step-4/index:Step 4: Programming your Robot`.
fr_ca: Vérifiez ensuite la possibilité de créer et de télécharger un programme de robot de base à partir du modèle choisi dans le langage de programmation attribué. Cela vérifiera que l'environnement de développement est configuré correctement et fonctionne correctement avant de passer à un système plus complexe. Pour cette tâche, vous devez créer, créer et télécharger un programme de base sur le roboRIO à exécuter au démarrage, puis vérifier que vous pouvez communiquer et activer le programme à l'aide de Driver Station. Les instructions peuvent être trouvées sur la page :ref:`docs/zero-to-robot/step-4/index:Step 4: Programming your Robot`.

source: Desired Feedback
es_mx: Retroalimentación Deseada
fr_ca: Commentaires souhaités

source: Please keep the following questions in mind as you complete the task and include this information, as appropriate, in your Task 2 report.
es_mx: Por favor tenga las siguientes preguntas en mente mientras va completando la tarea e incluya esta información, como es apropiado, en su reporte de Tarea 2.
fr_ca: Veuillez garder les questions suivantes à l'esprit lorsque vous accomplissez la tâche et inclure ces informations, le cas échéant, dans votre rapport de tâche 2.

source: What problems or difficulties did you encounter?
es_mx: ¿Qué problemas o dificultades encontró?
fr_ca: Quels problèmes ou difficultés avez-vous rencontrés?

source: What questions did you have during the process?
es_mx: ¿Qué preguntas tuvo durante el proceso?
fr_ca: Quelles questions aviez-vous pendant le processus?

source: Any specific suggestions on improving the documentation? (Were any instructions unclear?)
es_mx: ¿Alguna sugerencia específica para mejorar la documentación? (¿Alguna instrucción no estaba clara?)
fr_ca: Des suggestions spécifiques pour améliorer la documentation? (Certaines instructions n'étaient-elles pas claires?)

source: Is there anything else you want to tell us related to this task?
es_mx: ¿Hay algo más que nos quiera decir relacionado con esta tarea?
fr_ca: Voulez-vous nous dire autre chose concernant cette tâche?
