Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/tasks/task-3-port-code.po
Languages: fr_ca

source: Task 3: Port Existing Robot Code to New System
fr_ca: Tâche 3: Transférer le code du robot existant vers un nouveau système

source: Task: Port previous season's robot code to new system.
fr_ca: Tâche: Transférer le code du robot de la saison précédente vers un nouveau système.

source: Overview
fr_ca: Aperçu

source: The purpose of this task is to port your robot code to the new development environment and bring it to a fully functional state. Make sure to post in the discussions or file a bug in the tracker for any items that do not seem to be working properly.
fr_ca: Le but de cette tâche est de porter le code de votre robot vers le nouvel environnement de développement et de l'amener à un état entièrement fonctionnel. Assurez-vous de publier dans les discussions ou de signaler un bogue dans le tracker pour tout élément qui ne semble pas fonctionner correctement.

source: For C++/Java teams, the Project Importer will attempt to update your code to handle many of the breaking changes for 2022. Please include in your report any items that were not properly updated or that you had to change in order for your code to compile or work correctly.
fr_ca: Pour les équipes C++/Java, l'importateur de projet tentera de mettre à jour votre code pour gérer la plupart des changements majeurs pour 2022. Veuillez inclure dans votre rapport tous les éléments qui n'ont pas été correctement mis à jour ou que vous avez dû modifier pour que votre code soit compilé. ou fonctionner correctement.

source: Desired Feedback
fr_ca: Commentaires souhaités

source: Please keep the following questions in mind as you complete the task and include this information, as appropriate, in your Task 3 report.
fr_ca: Veuillez garder les questions suivantes à l'esprit lorsque vous effectuez la tâche et incluez ces informations, le cas échéant, dans votre rapport de la tâche 3.

source: Note any required changes to your robot program not detailed in the documentation for porting robot code.
fr_ca: Notez toutes les modifications requises de votre programme de robot non détaillées dans la documentation pour le portage du code du robot.

source: What problems or difficulties did you encounter?
fr_ca: Quels problèmes ou difficultés avez-vous rencontrés?

source: What questions did you have during the process?
fr_ca: Quelles questions aviez-vous pendant le processus?

source: Any specific suggestions on improving the documentation? (Were any instructions unclear?)
fr_ca: Des suggestions spécifiques pour améliorer la documentation? (Certaines instructions n'étaient-elles pas claires?)

source: Is there anything else you want to tell us related to this task?
fr_ca: Voulez-vous nous dire autre chose concernant cette tâche?
