Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/romi-robot/getting-to-know-romi.po
Languages: fr_ca, tr_tr

source: Getting to know your Romi
fr_ca: Apprendre à connaître votre Romi
tr_tr: Romi Robotunu tanımak

source: Directional Conventions
fr_ca: Conventions directionnelles
tr_tr: Yön Konvansiyonları

source: The front of the Romi is where the Raspberry Pi USB ports, GPIO pins and suspended caster wheel are.
fr_ca: L’avant de Romi est correspond à l'endroit où se trouvent les ports USB du Raspberry Pi, les ports GPIO et la roue de roulette suspendue.
tr_tr: Romi'nin önü, Raspberry Pi USB bağlantı noktalarının, GPIO pinlerinin ve suspended caster tekerleğinin bulunduğu yerdir.

source: Romi Front View
fr_ca: Romi, vue de devant

source: In all Romi documentation, references to driving forward use the above definition of "front".
fr_ca: Dans toute la documentation de Romi, les références à la conduite vers l’avant utilisent la définition ci-dessus de "l’avant".
tr_tr: Tüm Romi belgelerinde, ileriye doğru ilerlemeye yönelik referanslar yukarıdaki "front" tanımını kullanır.

source: Romi Forward Driving Direction
fr_ca: Romi, conduite vers l'avant

source: Hardware, Sensors and GPIO
fr_ca: Matériel (Hardware), capteurs et GPIO
tr_tr: Donanım, Sensörler ve GPIO

source: The Romi has the following built-in hardware/peripherals:
fr_ca: Le Romi possède le matériel et les périphériques intégrés suivants:
tr_tr: Romi robotu, aşağıdaki yerleşik donanıma / çevre birimlerine sahiptir:

source: 2x geared motors with encoders
fr_ca: 2x motoréducteurs avec encodeurs
tr_tr: Enkoderli 2x dişli motor

source: 1x Inertial Measurement Unit (IMU)
fr_ca: 1x unité de mesure inertielle (IMU)
tr_tr: 1x Atalet Ölçüm Birimi (IMU)

source: 3x LEDs (green, yellow, red)
fr_ca: 3x LED (verte, jaune, rouge)
tr_tr: 3x LED (yeşil, sarı, kırmızı)

source: 3x pushbuttons (marked A, B, and C)
fr_ca: 3 boutons poussoirs (marqués A, B et C)
tr_tr: 3x buton (A, B ve C olarak işaretlenmiştir)

source: 5x configurable GPIO channels (EXT)
fr_ca: 5x canaux GPIO configurables (EXT)

source: Buzzer
fr_ca: Buzer ou vibreur

source: The Buzzer is currently not supported by WPILib.
fr_ca: Le Buzzer ou vibreur n’est pas actuellement pris en charge par WPILib.

source: Motors, Wheels and Encoders
fr_ca: Moteurs, roues et encodeurs
tr_tr: Motorlar, Tekerlekler ve Kodlayıcılar

source: The motors used on the Romi have a 120:1 gear reduction, and a no-load output speed of 150 RPM at 4.5V. The free current is 0.13 amps and the stall current is 1.25 amps. Stall torque is 25 oz-in (0.1765 N-m) but the built-in safety clutch might start slipping at lower torques.
fr_ca: Les moteurs utilisés sur le Romi ont une réduction de 120:1 et une vitesse de sortie à vide de 150 RPM à 4.5V. Le courant libre est de 0.13 ampères et le courant de décrochage est de 1.25 ampères. Le couple de décrochage est de 25 oz-in (0.1765 N-m) mais l'embrayage de sécurité intégré peut commencer à glisser à des couples inférieurs.
tr_tr: Romi robotunda kullanılan motorlar 120: 1 dişli redüksiyonuna ve 4,5V'de 150 RPM yüksüz çıkış hızına sahiptir. Serbest akım 0,13 amperdir ve durma akımı 1,25 amperdir. Durma torku 25 oz-inçtir (0.1765 N-m), ancak yerleşik emniyet kavraması daha düşük torklarda kaymaya başlayabilir.

source: The wheels have a diameter of 70mm (2.75"). They have a trackwidth of 141mm (5.55").
fr_ca: Les roues ont un diamètre de 70mm (2.751″). Ils ont une voie (trackwidth) de 141mm (5.551″).
tr_tr: Tekerlekler 70 mm (2,75 ") çapa sahiptir ve 141 mm (5,55") iz genişliğine sahiptirler.

source: The encoders are connected directly to the motor output shaft and have 12 Counts Per Revolution (CPR). With the provided gear ratio, this nets 1440 counts per wheel revolution.
fr_ca: Les encodeurs sont connectés directement à l'arbre de sortie du moteur et ont 12 comptes par révolution (CPR). Avec le rapport de démultiplication fourni, ceci correspond à 1440 comptes par rotation de roue.
tr_tr: Enkoderlar doğrudan motor çıkış şaftına bağlanır ve 12 Devir Başına Sayıma (CPR) sahiptir. Sağlanan dişli oranıyla, bu, tekerlek dönüşü başına 1440 sayım yapar.

source: The motor PWM channels are listed in the table below.
fr_ca: Les canaux PWM relatifs aux moteurs sont répertoriés dans le tableau ci-dessous.

source: Channel
fr_ca: Canal

source: Romi Hardware Component
fr_ca: Composant matériel Romi
tr_tr: Romi Donanım Bileşeni

source: Left Motor
fr_ca: Moteur gauche
tr_tr: Sol Motor

source: Right Motor
fr_ca: Moteur droit
tr_tr: Sağ Motor

source: The right motor will spin in a backward direction when positive output is applied. Thus, the corresponding motor controller needs to be inverted in robot code.
fr_ca: Le moteur droit tournera dans une direction inverse lorsque la sortie positive est appliquée. Ainsi, le code relatif au contrôleur de moteur correspondant doit être inversé dans le code du robot.

source: The encoder channels are listed in the table below.
fr_ca: Les canaux relatifs aux encodeurs sont répertoriés dans le tableau ci-dessous.

source: Left Encoder Quadrature Channel A
fr_ca: Canal de quadrature encodeur gauche A
tr_tr: Sol Kodlayıcı Dörtlü Kanal A

source: Left Encoder Quadrature Channel B
fr_ca: Canal de quadrature encodeur gauche B
tr_tr: Sol Enkoder Dörtlü Kanal B

source: Right Encoder Quadrature Channel A
fr_ca: Canal de quadrature encodeur droit A
tr_tr: Sağ Kodlayıcı Dörtlü Kanal A

source: Right Encoder Quadrature Channel B
fr_ca: Canal de quadrature encodeur droit B
tr_tr: Sağ Kodlayıcı Dörtlü Kanal B

source: By default, the encoders count up when the Romi moves forward.
fr_ca: Par défaut, la lecture de valeurs croissantes des encodeurs se produit lorsque le Romi avance.
tr_tr: Varsayılan olarak, kodlayıcılar Romi ileri gittiğinde sayar.

source: Inertial Measurement Unit
fr_ca: L'unité de mesure inertielle
tr_tr: Atalet ölçü birimi

source: The Romi includes an STMicroelectronics LSM6DS33 Inertial Measurement Unit (IMU) which contains a 3-axis gyro and a 3-axis accelerometer.
fr_ca: Le Romi comprend une unité de mesure inertielle (IMU) STMicroelectronics LSM6DS33 qui contient un gyroscope à 3 axes et un accéléromètre à 3 axes.
tr_tr: Romi robotu, 3 eksenli cayro ve 3 eksenli ivmeölçer içeren bir STMicroelectronics LSM6DS33 Atalet Ölçüm Birimi (IMU) içerir.

source: The accelerometer has selectable sensitivity of 2G, 4G, 8G, and 16G. The gyro has selectable sensitivity of 125 Degrees Per Second (DPS), 250 DPS, 500 DPS, 1000 DPS and 2000 DPS.
fr_ca: L'accéléromètre a une sensibilité sélectionnable de 2G, 4G, 8G et 16G. Le gyroscope a une sensibilité sélectionnable de 125 degrés par seconde (DPS), 250 DPS, 500 DPS, 1000 DPS et 2000 DPS.
tr_tr: İvmeölçer 2G, 4G, 8G ve 16G seçilebilir hassasiyete sahiptir. Gyro, Saniyede 125 Derece (DPS), 250 DPS, 500 DPS, 1000 DPS ve 2000 DPS seçilebilir hassasiyete sahiptir.

source: The Romi Web UI also provides a means to calibrate the gyro and measure its zero-offsets before use with robot code.
fr_ca: L'interface utilisateur Web Romi fournit également un moyen de calibrer le gyroscope et de mesurer ses décalages d'origine avant de l'utiliser avec le code du robot.
tr_tr: Romi robotu web kullanıcı arayüzü ayrıca, robot koduyla kullanılmadan önce jiroskopu kalibre etmek ve sıfır ofsetlerini ölçmek için bir araç sağlar.

source: Onboard LEDs and Push Buttons
fr_ca: LEDs et boutons-poussoirs intégrés

source: The Romi 32U4 control board has 3 push buttons and 3 LEDs onboard that are exposed as Digital IO (DIO) channels to robot code.
fr_ca: La carte de contrôle Romi 32U4 dispose de 3 boutons-poussoirs et de 3 LEDs embarqués qui sont exposés en tant que canaux d’E/S numériques (DIO) au code du robot.

source: Romi LEDs and Buttons
fr_ca: LEDs et boutons du Romi

source: DIO Channel
fr_ca: Canal DIO
tr_tr: DIO Kanalı

source: Button A (input only)
fr_ca: Bouton A (entrée uniquement)
tr_tr: Button A (yalnızca giriş)

source: Button B (input), Green LED (output)
fr_ca: Bouton B (entrée), LED verte (sortie)
tr_tr: Button B (giriş), Yeşil LED (çıkış)

source: Button C (input), Red LED (output)
fr_ca: Bouton C (entrée), LED rouge (sortie)
tr_tr: Button C (giriş), Kırmızı LED (çıkış)

source: Yellow LED (output only)
fr_ca: LED jaune (sortie uniquement)
tr_tr: Sarı LED (yalnızca çıkış)

source: Writes to DIO 0, 4, 5, 6 and 7 will result in no-ops.
fr_ca: Les écritures sur DIO 0, 4, 5, 6 et 7 entraîneront des non-opérations.

source: Configurable GPIO Pins
fr_ca: Broches GPIO configurables

source: The control board has 5 configurable GPIO pins (named EXT0 through EXT4) that allow a user to connect external sensors and actuators to the Romi.
fr_ca: La carte de contrôle dispose de 5 broches GPIO configurables (désignées EXT0 à EXT4) qui permettent à un utilisateur de connecter des capteurs et des actionneurs externes au Romi.

source: Romi External GPIO Channels
fr_ca: Romi, canaux GPIO externes

source: All 5 pins support the following modes: Digital IO, Analog In, PWM (with the exception of EXT 0, which only supports Digital IO and PWM). The mode of the ports can be configured with :ref:`The Romi Web UI <docs/romi-robot/web-ui:External IO Configuration>`.
fr_ca: Les 5 broches prennent en charge les modes suivants : E/S numériques, Entrée analogique, PWM (à l’exception de EXT 0, qui ne prend en charge que les E/S numériques et PWM). Le mode des ports peut être configuré avec :ref:`L’interface utilisateur Web Romi <docs/romi-robot/web-ui:External IO Configuration>`.

source: The GPIO channels are exposed via a 3-pin, servo style interface, with connections for Ground, Power and Signal (with the Ground connection being closest to the edge of the board, and the signal being closest to the inside of the board).
fr_ca: Les canaux GPIO sont exposés via une interface de style servo à 3 broches, avec des connexions pour la masse (ground), l'alimentation et le signal (la connexion à la masse étant la plus proche du bord de la carte et le signal le plus proche de l'intérieur de la carte).
tr_tr: GPIO kanalları, Topraklama, Güç ve Sinyal bağlantılarıyla (Toprak bağlantısı kartın kenarına en yakın ve sinyal kartın içine en yakın olacak şekilde) 3 pimli, servo tarzı bir arabirim aracılığıyla gösterilir.

source: The power connections for the GPIO pins are initially left unconnected, but can be hooked into the Romi's on-board 5V supply by using a jumper to connect the 5V pin to the power bus (as seen in the image above). Additionally, if more power than the Romi can provide is needed, the user can provide their own 5V power supply and connect it directly to power bus and ground pins.
fr_ca: Les connexions d’alimentation pour les broches GPIO sont initialement laissées sans connexion, mais peuvent être connectées à l’alimentation 5V intégrée du Romi à l’aide d’un cavalier pour connecter la broche 5V au bus d’alimentation (comme on le voit dans l’image ci-dessus). De plus, si plus si on a besoin de plus d'énergie que ce le Romi peut fournir, l’utilisateur peut fournir sa propre alimentation 5V et la connecter directement au bus d’alimentation et aux broches de terre.

source: GPIO Default Configuration
fr_ca: Configuration par défaut de broches GPIO

source: The table below shows the default configuration of the GPIO pins (EXT0 through EXT4). :ref:`The Romi Web UI <docs/romi-robot/web-ui:External IO Configuration>` allows the user to customize the functions of the 5 configurable GPIO pins. The UI will also provide the appropriate WPILib channel/device mappings on screen once the IO configuration is complete.
fr_ca: Le tableau ci-dessous montre la configuration par défaut des broches GPIO (EXT0 à EXT4). :ref:`L’interface utilisateur Web Romi <docs/romi-robot/web-ui:External IO Configuration>` permet à l’utilisateur de personnaliser les fonctions des 5 broches GPIO configurables. L’interface utilisateur fournira également à l’écran les correspondances de canaux/périphériques WPILib appropriés une fois la configuration des E/S terminée.

source: We are working hard on getting the Romi documentation complete. Please check back later.
tr_tr: Romi robotu belgelerini tamamlamak için çok çalışıyoruz. Lütfen daha sonra tekrar kontrol edin.

source: 5x configurable GPIO channels
tr_tr: 5x yapılandırılabilir GPIO kanalı

source: LEDs and Push Buttons
tr_tr: LED'ler ve Basmalı Düğmeler

source: The Romi 32U4 control board has 3 push buttons and 3 LEDs that are exposed as Digital IO channels to robot code. The section on GPIO Mapping has more information on how to use the built in LEDs and buttons in robot code.
tr_tr: Romi robotu 32U4 kontrol panosu, robot koduna Dijital IO kanalları olarak gösterilen 3 basma düğmesi ve 3 LED'e sahiptir. GPIO Haritalama bölümü, yerleşik LED'lerin ve düğmelerin robot kodunda nasıl kullanılacağı hakkında daha fazla bilgi içerir.

source: Configurable GPIO Channels
tr_tr: Yapılandırılabilir GPIO Kanalları

source: The control board has 5 configurable GPIO channels (named EXT0 through EXT4) that allow a user to connect external sensors and actuators to the Romi.
tr_tr: Kontrol panosu, kullanıcının harici sensörleri ve aktüatörleri Romi'ye bağlamasına olanak tanıyan 5 yapılandırılabilir GPIO kanalına (EXT0'dan EXT4'e kadar) sahiptir.

source: All 5 channels support the following modes: Digital IO, Analog In, PWM (with the exception of EXT 0, which only supports Digital IO and PWM).
tr_tr: 5 kanalın tamamı aşağıdaki modları destekler: Dijital IO, Analog Giriş, PWM (yalnızca Dijital IO ve PWM'yi destekleyen EXT 0 hariç).

source: The power connections for the GPIO channels are initially left unconnected, but can be hooked into the Romi's on-board 5V supply by using a jumper to connect the 5V pin to the power bus (as seen in the image above). Additionally, if more power than the Romi can provide is needed, the user can provide their own 5V power supply and connect it directly to power bus and ground pins.
tr_tr: GPIO kanalları için güç bağlantıları başlangıçta bağlantısız bırakılır, ancak 5V pini güç veriyoluna bağlamak için bir atlama teli kullanılarak Romi'nin yerleşik 5V kaynağına bağlanabilir (yukarıdaki resimde görüldüğü gibi). Ek olarak, Romi'nin sağlayabileceğinden daha fazla güce ihtiyaç duyulursa, kullanıcı kendi 5V güç kaynağını sağlayabilir ve bunu doğrudan güç veriyoluna ve toprak pimlerine bağlayabilir.

source: GPIO Mapping
tr_tr: GPIO Haritalama

source: To support all the built in peripherals on the Romi, we have provided a hard-coded mapping of WPILib channels/devices to the Romi hardware.
tr_tr: Romi üzerindeki tüm yerleşik çevre birimlerini desteklemek için, Romi donanımına WPILib kanallarının/cihazlarının sabit kodlu bir eşlemesini sağladık.

source: Digital IO
tr_tr: Dijital IO

source: PWM Output
tr_tr: PWM Çıkışı

source: PWM Channel
tr_tr: PWM Kanalı

source: The right motor is hardwired to spin in a forward direction when forward stick movement is applied on a joystick. Thus there is no need to invert the corresponding motor controller in robot code.
tr_tr: Sağ motor, bir kumanda çubuğuna ileri çubuk hareketi uygulandığında ileri yönde dönecek şekilde bağlanmıştır. Böylelikle robot kodunda ilgili motor kontrolörünü ters çevirmeye gerek yoktur.

source: GPIO Channels
tr_tr: GPIO Kanalları

source: The Romi Web UI allows the user to customize the functions of the 5 configurable GPIO channels. The UI will also provide the appropriate WPILib channel/device mappings on screen once the IO configuration is complete. More information on this can be found in the next section.
tr_tr: Romi Web Kullanıcı Arayüzü, kullanıcının 5 yapılandırılabilir GPIO kanalının işlevlerini özelleştirmesine olanak tanır. UI ayrıca, IO yapılandırması tamamlandığında ekranda uygun WPILib kanal/cihaz eşleştirmelerini sağlayacaktır. Bununla ilgili daha fazla bilgi sonraki bölümde bulunabilir.
