Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/romi-robot/hardware-support.po
Languages: fr_ca, tr_tr

source: Romi Hardware Support
fr_ca: Support matériel Romi
tr_tr: Romi Donanım Desteği

source: The Romi robot, having a different hardware architecture than a roboRIO, is compatible with a subset of commonly used FRC control system components.
fr_ca: Le robot Romi, ayant une architecture matérielle différente de celle d'un roboRIO, est compatible avec un sous-ensemble de composants du système de contrôle FRC couramment utilisés.
tr_tr: RoboRIO'dan farklı bir donanım mimarisine sahip olan Romi robotu, yaygın olarak kullanılan FRC kontrol sistemi bileşenlerinin birkaçıyla uyumludur.

source: Compatible Hardware
fr_ca: Matériel compatible
tr_tr: Uyumlu Donanımlar

source: In general, the Romi is compatible with the following:
fr_ca: En général, le Romi est compatible avec les éléments suivants :
tr_tr: Genel olarak, Romi aşağıdakilerle uyumludur:

source: Simple Digital Input/Output devices (e.g. bumper switches, single LEDs)
fr_ca: Dispositifs d'entrée/sortie numériques simples (par exemple, commutateurs, LED)
tr_tr: Basit Dijital Giriş/Çıkış cihazları (örn. tampon anahtarları, tek LED'ler)

source: Standard RC-style :term:`PWM` output devices (e.g. servos, PWM based motor controllers)
tr_tr: Standart RC tarzı :term:`PWM` çıkış cihazları (örn. servolar, PWM tabanlı motor kontrolörleri)

source: Analog Input sensors (e.g distance sensors that report distance as a voltage)
fr_ca: Capteurs d'entrée analogique (par exemple, capteurs de distance qui signalent la distance sous forme de tension)
tr_tr: Analog Giriş sensörleri (örn. mesafeyi voltaj olarak bildiren mesafe sensörleri)

source: Incompatible Hardware
fr_ca: Matériel incompatible
tr_tr: Uyumsuz Donanımlar

source: Due to hardware limitations, the Romi Robot is not compatible with the following:
fr_ca: En raison de limitations matérielles, le robot Romi n'est pas compatible avec les éléments suivants :
tr_tr: Donanım sınırlamaları nedeniyle, Romi Robot aşağıdakilerle uyumlu değildir:

source: Encoders other than the Romi-integrated encoders
fr_ca: Encodeurs autres que les encodeurs intégrés Romi
tr_tr: Romi'ye entegre edilmiş kodlayıcılar dışındaki kodlayıcılar

source: "Ping" style ultrasonic sensors (which require 2 DIO channels)
fr_ca: Capteurs à ultrasons de style "Ping" (qui nécessitent 2 canaux DIO)
tr_tr: "Ping" tarzı ultrasonik sensörler (2 DIO kanalı gerektirmektedir)

source: Timing based sensors
fr_ca: Capteurs basés sur le temps
tr_tr: Zamanlama temelli sensörler

source: CAN based devices
fr_ca: Appareils basés sur CAN
tr_tr: CAN temelli cihazlar

source: Romi built-in buzzer
fr_ca: Buzzer intégré Romi
tr_tr: Romi dahili buzzer

source: Compatible Classes
fr_ca: Classes compatibles
tr_tr: Uyumlu Sınıflar

source: All classes listed here are supported by the Romi Robot. If a class is not listed here, assume that it is not supported and *will not* work.
fr_ca: Toutes les classes répertoriées ici sont prises en charge par le robot Romi. Si une classe n'est pas répertoriée ici, supposez qu'elle n'est pas prise en charge et qu'elle *ne fonctionnera pas*.
tr_tr: Burada sıralanan tüm sınıflar Romi Robot tarafından desteklenmektedir. Bir sınıf burada listelenmemişse, desteklenmediğini ve *çalışamayacağını* varsayınız.

source: PWM Motor Controllers (i.e. ``Spark``)
fr_ca: Contrôleurs de moteurs PWM (i.e. ``Spark``)
tr_tr: PWM Motor Kontrolörleri (yani ``Spark``)

source: ``Encoder``
tr_tr: ``Kodlayıcı``

source: The following classes are provided by the `Romi Vendordep <https://raw.githubusercontent.com/wpilibsuite/romi-vendordep/main/RomiVendordep.json>`__.
fr_ca: Les classes suivantes sont fournies par `Romi Vendordep <https://raw.githubusercontent.com/wpilibsuite/romi-vendordep/main/RomiVendordep.json>`__, c'est à dire le manufacturier du Romi.
tr_tr: Aşağıdaki sınıflar `Romi Vendordep <https://raw.githubusercontent.com/wpilibsuite/romi-vendordep/main/RomiVendordep.json>`__ tarafından sağlanmaktadır .

source: Standard RC-style PWM output devices (e.g. servos, PWM based motor controllers)
fr_ca: Périphériques de sortie PWM de style RC standard (par exemple, servos, contrôleurs de moteur basés sur PWM)
