Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/romi-robot/hardware.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Romi Hardware & Assembly
es_mx: Romi Hardware y montaje
fr_ca: Matériel (Hardware) et assemblage de Romi
tr_tr: Romi Donanım ve Montajı
zh_cn: Romi硬件和装配体

source: To get started with the Romi, you will need to have the necessary hardware.
es_mx: Para comenzar con Romi, deberá tener el hardware necesario.
fr_ca: Pour démarrer avec le Romi, vous aurez besoin du matériel nécessaire.
tr_tr: Romi'ye başlamak için gerekli donanıma sahip olmanız gerekecek.
zh_cn: 要开始使用Romi，您需要具备必要的硬件。

source: `Romi Kit from Pololu <https://www.pololu.com/product/4022>`__ – Order qualifies for free shipping
es_mx: `Kit Romi de Pololu <https://www.pololu.com/product/4022>`__ – El pedido tiene derecho a un envío gratis
fr_ca: `Romi Kit vendu par Pololu <https://www.pololu.com/product/4022>`__ – La commande bénéficie d'une livraison gratuite
zh_cn: `Romi Kit from Pololu <https://www.pololu.com/product/4022>`__ – 订购可免运费

source: `Raspberry Pi <https://www.amazon.com/gp/product/B07BFH96M3/>`__ – 3B+ or 4
es_mx: `Raspberry Pi <https://www.amazon.com/gp/product/B07BFH96M3/>` __ - 3B + o 4
fr_ca: `Raspberry Pi <https://www.amazon.com/gp/product/B07BFH96M3/>`__ – 3B+ ou 4
tr_tr: `Raspberry Pi <https://www.amazon.com/gp/product/B07BFH96M3/>` __ - 3B + veya 4
zh_cn: 树莓派<https://www.amazon.com/gp/product/B07BFH96M3/>`__ - 3B+或4

source: `8GB (or larger) Micro SD card <https://www.amazon.com/dp/B073K14CVB/>`__
es_mx: `8GB (o más grande) tarjeta Micro SD <https://www.amazon.com/dp/B073K14CVB/>`__
fr_ca: `Carte Micro SD de 8GB (ou plus) <https://www.amazon.com/dp/B073K14CVB/>`__
zh_cn: 8GB(及以上)的Micro - SD卡 <https://www.amazon.com/dp/B073K14CVB/>`__

source: `Micro SD card reader <https://www.amazon.com/gp/product/B0779V61XB/>`__ - if you don't already have one
es_mx: `Lector de tarjeta Micro SD <https://www.amazon.com/gp/product/B0779V61XB/>`__ - si no tiene uno ya
fr_ca: `Lecteur de carte Micro SD <https://www.amazon.com/gp/product/B0779V61XB/>`__ - si vous n'en avez pas déjà un
tr_tr: `Micro SD card reader <https://www.amazon.com/gp/product/B0779V61XB/>" __ - eğer zaten sizde yoksa
zh_cn: Micro SD读卡器<https://www.amazon.com/gp/product/B0779V61XB/>`__ -如果你还没有的话

source: `6 AA batteries <https://www.amazon.com/gp/product/B07TW9T8JW/>`__ – Rechargeable is best (don't forget the charger)
es_mx: `6 pilas AA <https://www.amazon.com/gp/product/B07TW9T8JW/>`__ – Mejor si son recargables (no olvides el cargador)
fr_ca: `6 piles AA <https://www.amazon.com/gp/product/B07TW9T8JW/>`__ - Les piles rechargeables sont recommendées (n'oubliez pas le chargeur)
tr_tr: `6 AA batteries <https://www.amazon.com/gp/product/B07TW9T8JW/>`__ – Şarj edilebilir en iyisidir (şarj cihazını unutmayın)
zh_cn: 6 AA电池<https://www.amazon.com/gp/product/B07TW9T8JW/>`__ -最好是可充电的(别忘了充电器)

source: Assembly
es_mx: Ensamblaje
fr_ca: Assemblage
tr_tr: Montaj
zh_cn: 装配

source: The Romi Robot Kit for FIRST comes pre-soldered and only has to be put together before it can be used. Once you have gathered all the materials you can begin assembly:
es_mx: El kit de robot Romi para FIRST viene pre-soldado y solo tiene que ensamblarse antes de poder usarse. Una vez que haya reunido todos los materiales, puede comenzar a ensamblar:
fr_ca: Le kit de robot Romi pour FIRST est pré-soudé et doit être assemblé avant de pouvoir être utilisé. Une fois que vous avez rassemblé tous les matériaux, vous pouvez commencer l'assemblage:
tr_tr: FIRST için Romi Robot Kiti önceden lehimlenmiş olarak gelir ve kullanılmadan önce yalnızca bir araya getirilmesi gerekir. Tüm malzemeleri topladıktan sonra montaja başlayabilirsiniz:
zh_cn: Romi机器人套件是预先焊接的，只需要在使用前组装好。一旦你收集了所有的材料，你可以开始组装:

source: Align the motor clips with the chassis as indicated and press them firmly into the chassis until the bottom of the clips are even with the bottom of the chassis (you may hear several clicks).
es_mx: Alinee los clips del motor con el chasis como se indica y presiónelos firmemente en el chasis hasta que la parte inferior de los clips esté nivelada con la parte inferior del chasis (puede que escuche varios clics).
fr_ca: Alignez les clips du moteur avec le châssis comme indiqué et appuyez-les fermement dans le châssis jusqu'à ce que le bas des clips soit au même niveau que le bas du châssis (vous pouvez entendre plusieurs clics).
tr_tr: Motor klipslerini gösterildiği gibi kasayla hizalayın ve klipslerin altı kasanın alt kısmıyla aynı hizaya gelene kadar kasanın içine sıkıca bastırın (birkaç tıklama duyabilirsiniz).
zh_cn: 按照指示将电机夹与底盘对齐，并将其牢固地压入底盘，直到电机夹的底部与底盘底部持平(您可能会听到几声咔哒声)。

source: Installing the motor clips on the Romi chassis.
fr_ca: Installation des clips du moteur sur le châssis du Romi

source: Push the Mini Plastic Gearmotors into the motor clips until they snap into place. Note that the motor blocks the clip release, so if you need to remove a motor bracket later, you will first need to remove the motor. The Mini Plastic Gearmotors that come with the kit have extended motor shafts to enable quadrature encoders for position feedback.
es_mx: Empuje los mini motorreductores de plástico en las abrazaderas del motor hasta que encajen en su lugar. Tenga en cuenta que el motor bloquea la liberación de la abrazadera, por lo que si necesita quitar un soporte de motor más tarde, primero tendrá que quitar el motor. Los mini motorreductores de plástico que vienen con el kit tienen ejes de motor extendidos para permitir que los codificadores de cuadratura puedan retroalimentar la posición.
fr_ca: Poussez les mini moteurs en plastique dans les clips du moteur jusqu'à ce qu'ils s'enclenchent. Notez que le moteur bloque la libération du clip, donc si vous devez retirer un support de moteur plus tard, vous devrez d'abord retirer le moteur. Les mini moteurs en plastique fournis avec le kit ont des arbres étendus pour permettre la liason mécanique aux encodeurs en quadrature pour le contrôle de position.
tr_tr: Mini Plastik Redüktörlü Motorları, yerine oturana kadar motor klipslerine itin. Motorun klips serbest bırakılmasını engellediğini unutmayın, bu nedenle daha sonra bir motor braketini çıkarmanız gerekirse, önce motoru çıkarmanız gerekir. Kitle birlikte gelen Mini Plastik Redüktörlü motorlar, konum geri bildirimi için dört evreli kodlayıcıları etkinleştirmek için genişletilmiş motor millerine sahiptir.
zh_cn: 将微型塑料齿轮马达推入马达夹，直到它们卡住。注意，电机阻塞夹释放，因此，如果您稍后需要拆卸电机支架，您将首先需要拆卸电机。迷你塑料齿轮马达和有扩展的电机轴结合以得到正交编码器的位置反馈。

source: Installing the motors on the Romi chassis.
fr_ca: Installation des moteurs sur le châssis du Romi

source: Press the wheels onto the output shafts of the motors until the motor shaft is flush with the outer face of the wheel. One way to do this is to set the wheel on a flat surface and line the chassis up with it so that the flat part of the motor’s D-shaft lines up correctly with the wheel. Then, lower the chassis, pressing the motor shaft into the wheel until it contacts the surface.
es_mx: Presione las ruedas sobre los ejes de salida de los motores hasta que el eje del motor esté al ras de la cara exterior de la rueda. Una forma de hacerlo es colocar la rueda en una superficie plana y alinear el chasis con ella para que la parte plana del eje D del motor se alinee correctamente con la rueda. Luego, baje el chasis, presionando el eje del motor en la rueda hasta que entre en contacto con la superficie.
fr_ca: Insérer les roues sur les arbres de sortie des moteurs jusqu'à ce que l'arbre du moteur affleure la face extérieure de la roue. Une façon de procéder consiste à placer la roue sur une surface plane et à aligner le châssis avec elle de sorte que la partie plate de l’arbre en D du moteur s’aligne correctement avec la roue. Ensuite, abaissez le châssis en enfonçant l'arbre du moteur dans la roue jusqu'à ce qu'il entre en contact avec la surface.
tr_tr: Motor şaftı tekerleğin dış yüzü ile aynı hizaya gelene kadar tekerlekleri motorların çıkış millerine bastırın. Bunu yapmanın bir yolu, tekerleği düz bir yüzeye yerleştirmek ve şasiyi bununla hizalamaktır, böylece motorun D-şaftının düz kısmı tekerlekle doğru şekilde hizalanır. Ardından, motor şaftını yüzeye temas edene kadar tekerleğin içine doğru bastırarak şasiyi indirin.
zh_cn: 将轮组压在电机的输出轴上，直到电机轴与轮组的外表面齐平。通过使电机的D轴的平坦部分与车轮正确地排列来将轮组和底盘设置在同一个平坦的表面。然后，放下底盘，将电机轴压入车轮，直到它接触到表面。

source: Attaching the wheels on the Romi chassis.
fr_ca: Installation des roues sur le châssis du Romi

source: Flip the chassis upside down and place the three rollers for the rear ball caster into the cutouts in the chassis. Place the 1″ plastic ball on top of the three rollers. Then push the ball caster retention clip over the ball and into the chassis so the three legs snap into their respective holes.
es_mx: Ponga el chasis al revés y coloque los tres rodillos para el lanzador de bolas trasero en los recortes del chasis. Coloque la bola de plástico 1″ encima de los tres rodillos. Luego empuje el clip de retención del lanzador de pelotas sobre la pelota y dentro del chasis para que las tres patas encajen en sus respectivos agujeros.
fr_ca: Retournez le châssis et placez les trois rouleaux arrière dans les découpes du châssis. Placez la boule en plastique de 1″ au-dessus des trois rouleaux. Poussez ensuite le clip de retenue de la roulette sur la bille et dans le châssis pour que les trois pieds s'enclenchent dans leurs trous respectifs.
tr_tr: Şasiyi ters çevirin ve arka top tekerlek için üç silindiri şasideki oyuklara yerleştirin. 1 plastik topu üç silindirin üstüne yerleştirin. Ardından, bilyeli tekerlek tutma klipsini topun üzerinden şasinin içine itin, böylece üç bacak ilgili deliklere oturur.
zh_cn: 将底盘倒过来，将后滚珠脚轮的三个滚轮放入底盘的开口内。将1英寸塑料球放在三个滚轮的顶部。然后推滚珠脚轮保留夹并在球和进入底盘时滑入到他们各自的位置。

source: Installing the rear ball caster on the Romi chassis.
fr_ca: Installation de la roulette arrière sur le châssis Romi.

source: Repeat for the front ball caster so there is a caster on the front and the back of the robot.
es_mx: Repita para el lanzador de bolas frontal para que haya un lanzador en la parte delantera y trasera del robot.
fr_ca: Répétez l'opération pour les rouleaux avant afin qu'il y ait un rouleau à l'avant et à l'arrière du robot.
tr_tr: Ön top tekeri için tekrarlayın, böylece robotun önünde ve arkasında bir tekerlek olur.
zh_cn: 重复为前面的球的脚轮，所以有一个脚轮在前面和后面的机器人。

source: Installing the front ball caster on the Romi chassis.
fr_ca: Installation de la roulette avant sur le châssis Romi.

source: Optional: The front ball caster is supported by a flexible arm that acts as a suspension system. If you want to make it stiffer, you can wrap a rubber band around the two hooks located on either side of the ball caster on the top side of the chassis.
es_mx: Opcional: El lanzador de bolas delantero está apoyado por un brazo flexible que actúa como sistema de suspensión. Si quiere hacerlo más rígido, puede envolver una banda de goma alrededor de los dos ganchos situados a cada lado del lanzador de pelotas en la parte superior del chasis.
fr_ca: En option: le rouleau à bille avant est soutenue par un bras flexible qui agit comme un système de suspension. Si vous souhaitez le rendre plus rigide, vous pouvez enrouler une bande de caoutchouc autour des deux crochets situés de chaque côté de la roulette à billes sur le côté supérieur du châssis.
tr_tr: İsteğe bağlı: Ön bilyalı tekerlek, süspansiyon sistemi olarak işlev gören esnek bir kolla desteklenir. Daha sert hale getirmek istiyorsanız, şasinin üst tarafındaki top tekerleğinin her iki yanında bulunan iki kancanın etrafına bir lastik bant sarabilirsiniz.
zh_cn: 可选:前球脚轮是由一个灵活的手臂支持，作为一个悬挂系统。如果你想让它更硬，你可以在底盘顶部的滚珠轮两侧的两个挂钩上包一个橡皮筋。

source: A rubber band can be used to stiffen the suspension of the optional front ball caster if desired.
fr_ca: Un élastique peut être utilisé pour raidir la suspension de la roulette avant si vous le souhaitez (optionnel).

source: Install the standoffs to support the Raspberry Pi board. Two standoffs (thread side down) mount in the holes on the side of the Romi board closest to the "Romi 32U4" label as shown in the picture. The nuts for these standoffs are inside the battery compartment. The other two standoffs go into the holes on the opposite side of the board. To attach them, you will need a needle-nose pliers to hold the nut while you screw in the standoffs. The circled holes in the image below show where the standoffs should go.
es_mx: Instale los separadores para apoyar la placa Raspberry Pi. Dos separadores (con la rosca hacia abajo) se montan en los agujeros del lado de la placa Romi más cercano a la etiqueta "Romi 32U4" como se muestra en la imagen. Las tuercas para estos separadores están dentro del compartimiento de la batería. Los otros dos separadores van en los agujeros del lado opuesto de la placa. Para colocarlos, necesitarás unos alicates de punta para sujetar la tuerca mientras atornillas los separadores. Los agujeros marcados con un círculo en la imagen de abajo muestran dónde deben ir los separadores.
fr_ca: Installez les socles pour soutenir la carte Raspberry Pi. Deux socles (côté fil vers le bas) montent dans les trous sur le côté de la carte du Romi la plus proche de l’étiquette "Romi 32U4" comme le montre l’image. Les écrous de ces socles sont à l’intérieur du compartiment de la batterie. Les deux autres socles s'insèrent dans les trous de l’autre côté de la carte. Pour les attacher, vous aurez besoin d’une pince à bec effilé pour tenir l’écrou pendant que vous vissez dans les socles. Les trous encerclés de l’image ci-dessous montrent où les socles doivent s'insérer.
tr_tr: Raspberry Pi kartını desteklemek için ayraçları takın. Romi kartının yan tarafındaki deliklere resimde gösterildiği gibi "Romi 32U4" etiketine en yakın iki çıkıntı (dişli tarafı aşağıda) monte edilir. Bu aralayıcıların somunları pil bölmesinin içindedir. Diğer iki çıkıntı, kartın diğer tarafındaki deliklere girer. Bunları takmak için, çıkıntıları vidalarken somunu tutmak için bir kargaburun pense ihtiyacınız olacaktır. Aşağıdaki resimde daire içine alınmış delikler, zıtlıkların nereye gitmesi gerektiğini göstermektedir.
zh_cn: 安装支架以支持树莓派板。两个压铆螺母(螺纹侧向下)安装在最接近“Romi 32U4”标签的Romi板的孔中，如图所示。这些防护栏的螺母在电池箱里。另外两个压铆螺母进了板对面的洞里。要连接它们，你需要一个尖嘴钳来固定螺母，而你螺丝在压铆螺母中。下图中圈出的洞显示了压铆螺母的位置。

source: Mounting holes for the Raspberry Pi
fr_ca: Trous de montage pour le Raspberry Pi

source: The chassis works with four or six AA batteries (we recommend using rechargeable AA NiMH cells). The correct orientation for the batteries is indicated by the battery-shaped holes in the Romi chassis as well as the + and - indicators in the chassis itself.
es_mx: El chasis funciona con cuatro o seis pilas AA (recomendamos utilizar pilas AA NiMH recargables). La orientación correcta de las baterías se indica mediante los orificios en forma de batería en el chasis Romi, así como los indicadores + y - en el propio chasis.
fr_ca: Le châssis fonctionne avec quatre ou six piles AA (nous vous recommandons d'utiliser des piles AA NiMH rechargeables). L'orientation correcte des batteries est indiquée par les trous en forme de batterie dans le châssis Romi ainsi que par les voyants + et - dans le châssis lui-même.
tr_tr: Kasa, dört veya altı adet AA pil ile çalışır (şarj edilebilir AA NiMH pilleri kullanmanızı öneririz). Pillerin doğru yönü Romi kasasındaki pil şeklindeki deliklerin yanı sıra kasanın kendisindeki + ve - göstergeleriyle gösterilir.
zh_cn: 底盘工作需要4或6节AA电池(我们建议使用可充电AA镍氢电池)。电池的正确方向是由电池形状的孔在Romi底盘以及底盘本身的+和-指示器指示。

source: Installing the batteries and battery cover on the Romi chassis.
fr_ca: Installation des piles et du couvercle des piles sur le châssis Romi.

source: Attach the Raspberry Pi board upside down, carefully aligning the 2x20 pin connector on the Pi with the 2x20 pin socket on the Romi. Push with even pressure taking care to not bend any of the pins. Once inserted, use the supplied screws to fasten the Raspberry Pi board to the standoffs that were installed in a previous step.
es_mx: Coloque la placa Raspberry Pi boca abajo, alineando con cuidado el conector de 2x20 pines en el Pi con el enchufe de 2x20 pines en el Romi. Empuje con presión uniforme teniendo cuidado de no doblar ninguno de los pasadores. Una vez insertado, use los tornillos suministrados para sujetar la placa Raspberry Pi a los separadores que se instalaron en un paso anterior.
fr_ca: Fixez la carte Raspberry Pi à l'envers, en alignant soigneusement le connecteur 2x20 broches sur le Pi avec la prise 2x20 broches sur le Romi. Poussez avec une pression uniforme en prenant soin de ne plier aucune des broches. Une fois insérée, utilisez les vis fournies pour fixer la carte Raspberry Pi aux entretoises installées lors de l'étape précédente.
tr_tr: Raspberry Pi kartını, Pi üzerindeki 2x20 pinli konektörü Romi'deki 2x20 pin soketiyle dikkatlice hizalayarak baş aşağı takın. Pimlerin hiçbirini bükmemeye dikkat ederek eşit bir basınçla itin. Takıldıktan sonra, Raspberry Pi kartını önceki bir adımda takılan tırnaklarla sabitlemek için verilen vidaları kullanın.
zh_cn: 将树莓派板倒置，小心对准Pi上的2x20针连接器与Romi上的2x20针插座。用均匀的压力推，注意不要弯曲任何插销。插入后，使用所提供的螺丝将树莓派板固定到上一步安装的支架上。

source: Two of the screws will require placing a nut in a hexagonal hole inside the battery compartment. The locations are shown by the blue circles in the image above.
es_mx: Dos de los tornillos requerirán la colocación de una tuerca en un agujero hexagonal dentro del compartimento de la batería. Las ubicaciones se muestran con los círculos azules en la imagen de arriba.
fr_ca: Deux des vis nécessiteront de placer un écrou dans un trou hexagonal à l’intérieur du compartiment de la batterie. Les emplacements sont indiqués par les cercles bleus dans l’image ci-dessus.
tr_tr: Vidalardan ikisi, pil bölmesinin içindeki altıgen bir deliğe bir somun yerleştirilmesini gerektirecektir. Konumlar yukarıdaki resimde mavi dairelerle gösterilmiştir.
zh_cn: 其中两个螺丝需要在电池隔间内的一个六角形孔中放置一个螺母。位置用上图中的蓝色圆圈表示。

source: Installing the standoffs and Raspberry Pi on the Romi chassis.
fr_ca: Installation des entretoises et Raspberry Pi sur le châssis Romi.

source: The assembly of your Romi chassis is now complete!
es_mx: ¡El ensamblaje de su chasis Romi ahora está completo!
fr_ca: L'assemblage de votre châssis Romi est maintenant terminé!
tr_tr: Romi kasanızın montajı artık tamamlandı!
zh_cn: 你的Romi底盘的组装现在完成了!
