Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/romi-robot/imaging-romi.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Imaging your Romi
es_mx: Configuración de su Romi
fr_ca: Installation de l'image dans votre Romi
tr_tr: Romi'nize Imaj atmak
zh_cn: 成像你的Romi

source: The Romi has 2 microprocessor boards:
es_mx: La Romi tiene 2 placas de microprocesador:
fr_ca: Le Romi dispose de 2 cartes à microprocesseur :
tr_tr: Romi'nin 2 mikroişlemci kartı vardır:
zh_cn: Romi有2个微处理器板:

source: A **Raspberry Pi** that handles high level communication with the robot program running on the desktop and
es_mx: Una **Raspberry Pi** que se encarga de la comunicación de alto nivel con el programa del robot que se ejecuta en el escritorio y
fr_ca: Un **Raspberry Pi** qui gère la communication de haut niveau avec le programme robot en cours d’exécution sur le bureau et
tr_tr: Masaüstünde çalışan robot programıyla üst düzey iletişimi yöneten bir **Raspberry Pi** ve
zh_cn: 一个树莓派，处理与运行在桌面和机器人程序的高级通信

source: A **Romi 32U4 Control Board** that handles low level motor and sensor operation.
es_mx: Una **Placa de control Romi 32U4** que se encarga del funcionamiento de los motores y sensores de bajo nivel.
fr_ca: Une carte **Romi 32U4 Control Board** qui gère le fonctionnement au bas niveau du moteur et du capteur.
tr_tr: Düşük seviyeli motor ve sensör çalışmasını idare eden bir **Romi 32U4 Control Board**.
zh_cn: Romi 32U4控制板，处理低电平电机和传感器操作。两块板都需要安装固件，这样机器人才能正常工作。

source: Both boards need to have firmware installed so that the robot operate properly.
es_mx: Ambas placas deben tener el firmware instalado para que el robot funcione correctamente.
fr_ca: Les deux cartes doivent être pourvues de firmware pour que le robot fonctionne correctement.
tr_tr: Robotun düzgün çalışması için her iki panoda da aygıt yazılımının kurulu olması gerekir.
zh_cn: 两块板都需要安装固件，这样机器人才能正常工作。

source: Download
es_mx: Descarga
fr_ca: Téléchargement
tr_tr: İndirme
zh_cn: 下载

source: The Raspberry Pi firmware is based on WPILibPi (formerly FRCVision) and must be downloaded and written to the Raspberry Pi micro SD card. Click on ``Assets`` at the bottom of the description to see the available image files:
es_mx: El firmware de Raspberry Pi está basado en WPILibPi (anteriormente FRCVision) y debe ser descargado y escrito en la tarjeta micro SD de Raspberry Pi. Haga clic en ``Assets`` en la parte inferior de la descripción para ver los archivos de imagen disponibles:
fr_ca: Le firmware du Raspberry Pi est basé sur WPILibPi (anciennement FRCVision) et doit être téléchargé et écrit sur la carte Raspberry Pi micro SD. Cliquez sur ``Assets`` au bas de la description pour voir les fichiers images disponibles :
tr_tr: Raspberry Pi ürün yazılımı WPILibPi (eski adıyla FRCVision) tabanlıdır ve Raspberry Pi mikro SD kartına indirilip yazılmalıdır. Mevcut resim dosyalarını görmek için açıklamanın altındaki ``Assets-Varlıklar`` seçeneğine tıklayın:
zh_cn: 覆盆子Pi固件是基于WPILibPi(以前为FRCVision)的，必须下载并写入覆盆子Pi micro SD卡。点击下方的Assets可以看到可用的图像文件:

source: Be sure to download the Romi version and not the standard release of WPILibPi. The Romi version is suffixed with ``-Romi``. See the below image for an example.
es_mx: Asegúrese de descargar la versión Romi y no la versión estándar de WPILibPi. La versión Romi tiene el sufijo ``-Romi``. Vea la imagen de abajo para un ejemplo.
fr_ca: Assurez-vous de télécharger la version Romi et non la version standard de WPILibPi. La version Romi est pourvue du suffixe ``-Romi``. Voir l’image ci-dessous pour un exemple.
tr_tr: WPILibPi'nin standart sürümünü değil, Romi sürümünü indirdiğinizden emin olun. Romi versiyonunun sonuna `` -Romi`` eklenmiştir. Örnek için aşağıdaki resme bakın.
zh_cn: 请确保下载的是Romi版本，而不是WPILibPi的标准版本。Romi版本的后缀是-Romi。 下面的图片是一个例子

source: GitHub Romi Release
fr_ca: Romi sur GitHub

source: Imaging
es_mx: Configuración
fr_ca: Installation de l'image
tr_tr: İmaj Atma
zh_cn: 成像

source: The procedure for installing the image is described here: :doc:`WPILibPi Installation</docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card>`.
es_mx: El procedimiento para instalar la imagen se describe aquí : :doc:`WPILibPi Installation</docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card>`.
fr_ca: La procédure d’installation de l’image est décrite ici: :doc:`WPILibPi Installation</docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card>`.
tr_tr: Görüntünün kurulum prosedürü burada açıklanmaktadır: :doc:`WPILibPi Kurulumu </docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card>`.
zh_cn: 安装映像的过程在这里描述:WPILibPi安装。

source: Wireless Network Setup
es_mx: Configuración de la red inalámbrica
fr_ca: Configuration du réseau sans fil
tr_tr: Kablosuz Ağ Kurulumu
zh_cn: 无线网络设置

source: Perform the following steps to get your Raspberry Pi ready to use with the Romi:
es_mx: Realice los siguientes pasos para que su Raspberry Pi esté lista para ser utilizada con la Romi:
fr_ca: Réalisez les étapes suivantes pour que votre Raspberry Pi soit prêt à être utilisé avec le Romi :
tr_tr: Raspberry Pi'nizi Romi ile kullanıma hazır hale getirmek için aşağıdaki adımları uygulayın:
zh_cn: 完成以下步骤，让树莓派可以和Romi一起使用:

source: Turn the Romi on by sliding the power switch on the Romi 32U4 board to the on position. The first time it is started with a new image it will take approximately 2-3 minutes to boot while it resizes the file system and reboots. Subsequent times it will boot in less than a minute.
es_mx: Encienda la Romi deslizando el interruptor de encendido de la placa Romi 32U4 a la posición de encendido. La primera vez que se inicie con una nueva imagen tardará aproximadamente 2-3 minutos en arrancar mientras redimensiona el sistema de archivos y se reinicia. Las siguientes veces arrancará en menos de un minuto.
fr_ca: Allumez le Romi en glissant l’interrupteur d’alimentation sur la carte Romi 32U4 jusqu’à la position on. La première fois qu’il est mis sous tension avec une nouvelle image, il faudra environ 2-3 minutes pour démarrer pendant qu’il redimensionne le système de fichiers et redémarre. Les démarrages suivants se feront en moins d’une minute.
tr_tr: Romi 32U4 kartındaki güç anahtarını açık konuma kaydırarak Romi'yi açın. Yeni bir görüntü ile ilk kez başlatıldığında, dosya sistemini yeniden boyutlandırırken ve yeniden başlatılırken önyüklemesi yaklaşık 2-3 dakika sürecektir. Sonraki zamanlarda, bir dakikadan daha kısa sürede açılacaktır.
zh_cn: 打开Romi通过滑动Romi 32U4板上的电源开关到on位置。第一次使用新映像启动时，需要大约2-3分钟来引导，同时调整文件系统的大小并重新启动。随后它将在不到一分钟的时间内启动。

source: Using your computer, connect to the Romi WiFi network using the SSID ``WPILibPi-<number>`` (where ``<number>`` is based on the Raspberry Pi serial number) with the WPA2 passphrase ``WPILib2021!``.
es_mx: Usando su computadora, conéctese a la red Romi WiFi usando el SSID ``WPILibPi-<number>`` (donde``<number>está basado en el número de serie de la Raspberry Pi) con la frase de contraseña WPA2 ``WPILib2021!``.
fr_ca: À l’aide de votre ordinateur, connectez-vous au réseau WiFi Romi à l’aide du SSID ``WPILibPi-<number>`` (où ``<number>`` est basé sur le numéro de série du Raspberry Pi) avec le mot de passe WPA2 ``WPILib2021!``.
tr_tr: Bilgisayarınızı kullanarak, WPA2 parolası `` WPILib2021! '' İle SSID ``WPILibPi- <number>`` (burada ``<number>`` Raspberry Pi seri numarasına dayalıdır) kullanarak Romi WiFi ağına bağlanın.
zh_cn: 使用您的电脑，连接到Romi WiFi网络使用SSID WPILibPi-<number>(其中<number>是基于树莓派的序列号)和WPA2密码WPILib2021!

source: If powering on the Raspberry Pi in an environment with multiple WPILibPi-running Raspberry Pis, the SSID for a particular Raspberry Pi is also announced audibly through the headphone port. The default SSID is also written to the ``/boot/default-ssid.txt`` file, which can be read by inserting the SD card (via a reader) into a computer and opening the ``boot`` partition.
es_mx: Si se enciende la Raspberry Pi en un entorno con múltiples WPILibPi Raspberry Pis, el SSID para una Raspberry Pi en particular también se anuncia de forma audible a través del puerto de auriculares. El SSID por defecto también se escribe en el archivo ``/boot/default-ssid.txt`` , que se puede leer insertando la tarjeta SD (a través de un lector) en un ordenador y abriendo ``boot``
fr_ca: Si le Raspberry Pi est allumé dans un environnement avec plusieurs Raspberry Pis pourvus de WPILibPI en cours d'exécution, le SSID pour un Raspberry Pi particulier est également annoncé de manière audible à travers le port du casque. Le SSID par défaut est également écrit sur le fichier ``/boot/default-ssid.txt`` qui peut être lu en insérant la carte SD (via un lecteur) dans un ordinateur et en ouvrant la partition ``boot``.
tr_tr: Raspberry Pi'yi birden fazla WPILibPi çalıştıran Raspberry Pis'in bulunduğu bir ortamda çalıştırıyorsanız, belirli bir Raspberry Pi'nin SSID'si de kulaklık bağlantı noktası aracılığıyla sesli olarak duyurulur. Varsayılan SSID, SD kartı (okuyucu aracılığıyla) bir bilgisayara takıp ``boot-önyükleme`` bölümünü açarak okunabilen ``/boot/default-ssid.txt`` dosyasına da yazılır.
zh_cn: 注意: 如果在一个有多个运行wpilibpi的树莓派的环境中打开树莓派的电源，一个特定的树莓派的SSID也会通过耳机端口发出声音。默认的SSID也被写入/boot/default- SSID .txt文件，可以通过将SD卡(通过读卡器)插入计算机并打开引导分区来读取。

source: Open a web browser and connect to the Raspberry Pi dashboard at either ``http://10.0.0.2/`` or ``http://wpilibpi.local/``.
es_mx: Abra un navegador web y conéctese a la dashboard de la Raspberry Pi en ``http://10.0.0.2/`` o ``http://wpilibpi.local/``.
fr_ca: Ouvrez un navigateur Web et connectez-vous au dashboard du Raspberry Pi soit à l’adresse ``http://10.0.0.2/`` ou à l'adresse ``http://wpilibpi.local/``.
tr_tr: Bir web tarayıcısı açın ve ``http://10.0.0.2/`` veya ``http://wpilibpi.local/`` adresinden Raspberry Pi panosuna bağlanın.
zh_cn: 打开Web浏览器，然后通过``http://10.0.0.2/''或``http：//wpilibpi.local/''连接到Raspberry Pi仪表板。

source: The image boots up read-only by default, so it is necessary to click the ``Writable`` button to make changes. Once done making changes, click the ``Read-Only`` button to prevent memory corruption.
es_mx: La imagen se inicia en modo de solo lectura de forma predeterminada, por lo que es necesario hacer clic en el botón ``Escribir`` para realizar cambios. Una vez que haya hecho los cambios, haga clic en el botón ``Solo lectura`` para evitar daños en la memoria.
fr_ca: L'image démarre en lecture seule par défaut, il est donc nécessaire de cliquer sur le bouton ``Writable`` pour apporter des modifications. Une fois les modifications effectuées, cliquez sur le bouton ``Read-Only`` pour éviter la corruption de la mémoire.
tr_tr: Görüntü varsayılan olarak salt okunur olarak açılır, bu nedenle değişiklik yapmak için ``Writable`` düğmesine tıklamanız gerekir. Değişiklikleri yaptıktan sonra, bellek bozulmasını önlemek için ``Read-Only`` düğmesine tıklayın.
zh_cn: Note: 默认情况下，映像以只读方式启动，因此有必要单击Writable按钮进行更改。完成更改后，单击Read-Only按钮以防止内存损坏。

source: Select :guilabel:`Writable` at the top of the dashboard web page.
es_mx: Seleccione :guilabel:`Writable` en la parte superior de la dashboard de la página web.
fr_ca: Sélectionnez :guilabel:`Writable` en haut de la page Web du dashboard.
tr_tr: Kontrol paneli web sayfasının üst kısmındaki :guilabel:`Writable` öğesini seçin.
zh_cn: 在仪表板web页面的顶部选择Writable。

source: Change the default password for your Romi by setting a new password in the ``WPA2 Passphrase`` field.
es_mx: Cambie la contraseña por defecto de su Romi estableciendo una nueva contraseña en el campo ``WPA2 Passphrase``.
fr_ca: Changez le mot de passe par défaut de votre Romi en inscrivant un nouveau mot de passe dans le champ ``WPA2 Passphrase``.
tr_tr: ``WPA2 Passphrase`` alanına yeni bir parola ayarlayarak Romi'niz için varsayılan parolayı değiştirin.
zh_cn: 通过在WPA2 Passphrase字段中设置新密码，更改Romi的默认密码。

source: Press the :guilabel:`Save` button at the bottom of the page to save changes.
es_mx: Pulse el botón :guilabel:`Save` en la parte inferior de la página para guardar los cambios.
fr_ca: Appuyez sur le bouton :guilabel:`Save` en bas de la page pour enregistrer les modifications.
tr_tr: Değişiklikleri kaydetmek için sayfanın altındaki :guilabel:`Save` düğmesine basın.
zh_cn: 按页面底部的Save按钮保存更改。

source: Change the network SSID to a unique name if you plan on operating your Romi on wireless network with other Romis.
es_mx: Cambie el SSID de la red por un nombre único si planea operar su Romi en una red inalámbrica con otras Romis.
fr_ca: Changez le réseau SSID pour un nom unique si vous prévoyez d’utiliser votre Romi sur un réseau sans fil avec d’autres Romis.
tr_tr: Romi'nizi diğer Romiler ile kablosuz ağ üzerinde çalıştırmayı planlıyorsanız, ağ SSID'sini benzersiz bir adla değiştirin.
zh_cn: 如果您计划在无绳网络上与其他Romi一起操作您的Romi，请将网络SSID更改为唯一的名称。

source: Reconnect to the Romi's WiFi network with the new password you set.
es_mx: Vuelva a conectarse a la red WiFi de la Romi con la nueva contraseña que estableció.
fr_ca: Reconnectez-vous au réseau WiFi de Romi avec le nouveau mot de passe que vous avez défini.
tr_tr: Belirlediğiniz yeni şifre ile Romi'nin WiFi ağına yeniden bağlanın.
zh_cn: 用你设置的新密码重新连接Romi的WiFi网络。

source: Be sure to set the Dashboard to ``Read-only`` when all the changes have been completed.
es_mx: Asegúrese de poner la Dashboard en ``Read-only`` cuando todos los cambios hayan sido completados.
fr_ca: Assurez-vous de configurer le Dashboard à ``Read-only`` lorsque toutes les modifications auront été effectuées.
tr_tr: Tüm değişiklikler tamamlandığında Gösterge Panosunu ``Read-only- Salt Okunur`` olarak ayarladığınızdan emin olun.
zh_cn: 在完成所有更改后，请确保将指示板设置为只读。

source: Romi web dashboard network settings
fr_ca: Paramètres réseau du Dashboard Web Romi

source: 32U4 Control Board
es_mx: Tablero de control 32U4
fr_ca: Carte de contrôle 32U4
tr_tr: 32U4 Kontrol Kartı
zh_cn: 32U4 控制板

source: The Raspberry Pi can now be used to write the firmware image to the 32U4 Control Board.
es_mx: La Raspberry Pi puede utilizarse ahora para escribir la imagen del firmware en la placa de control 32U4.
fr_ca: Le Raspberry Pi peut maintenant être utilisé pour installer l’image du firmware à la carte de contrôle 32U4
tr_tr: Raspberry Pi artık donanım yazılımı görüntüsünü 32U4 Kontrol Paneline yazmak için kullanılabilir.
zh_cn: 树莓派现在可以用来写入固件镜像到32U4控制板。

source: Turn off the Romi
es_mx: Apague la Romi
fr_ca: Éteignez le Romi
tr_tr: Romi'yi kapatın
zh_cn: 把罗米关掉

source: Connect a USB A to micro-B cable from one of the Raspberry Pi's USB ports to the micro USB port on the 32U4 Control Board.
es_mx: Conecte un cable USB A a micro-B desde uno de los puertos USB de la Raspberry Pi al puerto micro USB de la placa de control 32U4.
fr_ca: Connectez un câble USB A à micro-B de l’un des ports USB du Raspberry Pi aux ports micro USB de la carte de contrôle 32U4.
tr_tr: Raspberry Pi'nin USB bağlantı noktalarından birinden 32U4 Kontrol Panosu üzerindeki mikro USB bağlantı noktasına bir USB A - mikro-B kablosu bağlayın.
zh_cn: 将树莓派的一个USB接口连接到32U4控制板的micro USB接口。

source: Turn on the Romi and connect to its Wifi network and connect to the web dashboard as in the previous steps.
es_mx: Encienda la Romi y conéctese a su red Wifi y conéctese a la dashboard como en los pasos anteriores.
fr_ca: Allumez le Romi et connectez-vous à son réseau Wifi et connectez-vous au dashboard web comme lors des étapes précédentes.
tr_tr: Romi'yi açın ve Wifi ağına bağlanın ve önceki adımlarda olduğu gibi web panosuna bağlanın.
zh_cn: 打开Romi并连接到它的Wifi网络，并像前面的步骤一样连接到web仪表板。

source: On the ``Romi`` configuration page, press the :guilabel:`Update Firmware` button.
es_mx: En la página de configuración de ``Romi``, pulse el botón :guilabel:`Update Firmware`.
fr_ca: Sur la page de configuration de ``Romi`` appuyez sur le bouton :guilabel:`Update Firmware`.
tr_tr: ``Romi`` konfigürasyon sayfasında, :guilabel:`Update Firmware` düğmesine basın.
zh_cn: 在Romi配置界面中，按“Update Firmware”按钮。

source: The firmware update button before updating firmware
fr_ca: Le bouton de mise à jour du firmware avant sa mise à jour

source: A console will appear showing a log of the firmware deploy process. Once the firmware has been deployed to the 32U4 Control Board, the message ``avrdude done. Thank you.`` will appear.
es_mx: Aparecerá una consola que muestra un registro del proceso de despliegue del firmware. Una vez que el firmware ha sido desplegado a la Junta de Control de 32U4, aparecerá el mensaje ``avrdude done. Thank you.``
fr_ca: Une console apparaîtra affichant un log du processus de déploiement du micrologiciel. Une fois le micrologiciel déployé sur la carte de contrôle 32U4, le message ``avrdude done. Thank you.`` apparaîtra.
tr_tr: Aygıt yazılımı dağıtım işleminin günlüğünü gösteren bir konsol görünecektir. Firmware 32U4 Kontrol Panosuna dağıtıldıktan sonra,``avrdude done. Thank you.``görünecek.
zh_cn: 将出现一个控制台，显示固件部署过程的日志。一旦固件部署到32U4控制板，消息avrdude就完成了。谢谢你！就会出现。

source: The firmware update log showing the completed firmware update
fr_ca: Le journal de mise à jour du firmware indiquant la mise à jour du micrologiciel terminée

source: Raspberry Pi
zh_cn: 树莓版
