Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/romi-robot/programming-romi-*-labview.po
Languages: fr_ca

source: Programming the Romi (LabVIEW)
fr_ca: Programmation du Romi (LabVIEW)

source: Writing a LabVIEW program for the Romi is very similar to writing a program for a regular roboRIO based robot. In fact, all the same tools can be used with the Romi.
fr_ca: L'écriture d'un programme LabVIEW pour le Romi est très similaire à l'écriture d'un programme pour un robot standard basé sur roboRIO. En fait, tous les mêmes outils peuvent être utilisés avec le Romi.

source: Creating a Romi Project
fr_ca: Créer un projet Romi

source: Creating a new program for a Romi is no different than creating a normal FRC \|reg| program, similar to the :doc:`Zero To Robot </docs/zero-to-robot/step-4/index>` programming steps. Initially, you may wish to create a separate project for use on just the Romi as the Romi hardware may be connected to different ports than on your roboRIO robot.
fr_ca: Créer un nouveau programme pour un Romi n'est pas différent de créer un FRC normal \|reg| similaire aux étapes de programmation :doc:`Zero To Robot`. Au départ, vous souhaiterez peut-être créer un projet distinct à utiliser uniquement sur le Romi, car le matériel Romi peut être connecté à des ports différents de ceux de votre robot roboRIO.

source: The Romi Robot used PWM ports 0 and 1 for left and right side respectively.
fr_ca: Le robot Romi a utilisé les ports PWM 0 et 1 respectivement pour les côtés gauche et droit.

source: Todo
fr_ca: À faire

source: add information on romi gyro and encoders
fr_ca: ajouter des informations sur romi gyro et encodeurs

source: Installing the WebSockets VI
fr_ca: Installer le WebSockets VI

source: One aspect where a Romi project differs from a regular FRC \|reg| robot project is that the code is not deployed directly to the Romi. Instead, a Romi project runs on your development computer, and leverages the WPILib simulation framework to communicate with the Romi robot. WebSockets is the protocol that LabVIEW uses to converse with the Romi.
fr_ca: Un aspect où un projet Romi diffère d'un FRC régulier \|reg| robot est que le code n'est pas déployé directement sur le Romi. Au lieu de cela, un projet Romi s'exécute sur votre ordinateur de développement et exploite le cadre de simulation WPILib pour communiquer avec le robot Romi. WebSockets est le protocole que LabVIEW utilise pour converser avec le Romi.

source: Open the :guilabel:`VI Package Manager` application. Type ``websockets`` into the search box in the top right. Select the VI by :guilabel:`LabVIEW Tools Network`.
fr_ca: Ouvrez l'application :guilabel:`VI Package Manager`. Tapez ``websockets`` dans le champ de recherche en haut à droite. Sélectionnez le VI par :guilabel:`LabVIEW Tools Network`

source: Installing WebSockets via the VI Package Manager
fr_ca: Installation des WebSockets via le VI Package Manager

source: Changing the Project Target
fr_ca: Modification de la cible du projet

source: The primary step needed to run your LabVIEW program on the Romi is to change the target to the Desktop. To change the project target, locate the Robot Main VI in the Project Explorer and click and drag it from the ``Target`` section to the ``My Computer`` section.
fr_ca: La première étape nécessaire pour exécuter votre programme LabVIEW sur le Romi est de changer la cible en Desktop. Pour changer la cible du projet, localisez le Robot Main VI dans l'explorateur de projet et cliquez dessus et faites-le glisser de la section ``Cible`` vers la section ``Poste de travail``.

source: An image showing moving Robot Main VI to the My Computer section
fr_ca: Une image montrant le déplacement du Robot Main VI vers le "Poste de travail"

source: Setting the Target IP
fr_ca: Définition de l'adresse IP cible

source: By default, your LabVIEW program will attempt to connect to a Romi with the IP address of ``10.0.0.2``. If you wish to use a different IP, you can specify it as an input to the ``Driver Station Start Communication VI`` inside ``Robot Main``. Locate the pink input terminal for ``Simulation URL`` then right-click and select :guilabel:`Create Constant` to create a constant pre-filled with the default value. You can then modify the IP address portion of the text, taking care to leave the protocol section (at the beginning) and port and suffix (at the end) the same.
fr_ca: Par défaut, votre programme LabVIEW tentera de se connecter à un Romi avec l'adresse IP ``10.0.0.2``. Si vous souhaitez utiliser une adresse IP différente, vous pouvez la spécifier comme entrée du ``Driver Station Start Communication VI`` dans ``Robot Main``. Localisez le terminal d'entrée rose pour ``Simulation URL`` puis faites un clic droit et sélectionnez :guilabel:`Create Constant` pour créer une constante pré-remplie avec la valeur par défaut. Vous pouvez ensuite modifier la partie adresse IP du texte, en prenant soin de laisser la section protocole (au début) et le port et le suffixe (à la fin) identiques.

source: An image showing the constant for an alternate IP
fr_ca: Une image montrant la constante pour une adresse IP alternative

source: Running a Romi Program
fr_ca: Exécution d'un programme Romi

source: To run a Romi program, first, ensure that your Romi is powered on. Once you connect to the ``WPILibPi-<number>`` network broadcast by the Romi, press the white :guilabel:`Run` arrow to start running the Romi program on your computer.
fr_ca: Pour exécuter un programme Romi, assurez-vous d'abord que votre Romi est sous tension. Une fois connecté au réseau ``WPILibPi-`` diffusé par le Romi, appuyez sur la flèche blanche :guilabel:`Run` pour lancer le programme Romi sur votre ordinateur.

source: Your Romi code is now running! The program will automatically attempt to connect to either the IP you have specified, or the default if you have not specified an IP.
fr_ca: Votre code Romi est maintenant en cours d'exécution! Le programme tentera automatiquement de se connecter soit à l'adresse IP que vous avez spécifiée, soit à la valeur par défaut si vous n'avez pas spécifié d'adresse IP.

source: It is recommended to run the Driver Station software on the same computer as the LabVIEW code. Once your program successfully connects to the Driver Station, it will automatically notify the Driver Station that the code is running on the Desktop, allowing the Driver Station to connect without you changing any information inside the Driver Station. Next, you'll need to point the Driver Station to your Romi. This is done by setting the team number to ``127.0.0.1``. You can then use the controls in the Driver Station to set the robot mode and enable/disable as normal.
fr_ca: Il est recommandé d'exécuter le logiciel Driver Station sur le même ordinateur que le code LabVIEW. Une fois que votre programme se connecte avec succès à la Driver Station, il notifiera automatiquement à la Driver Station que le code est en cours d'exécution sur le bureau, permettant à la Driver Station de se connecter sans que vous ne modifiiez aucune information à l'intérieur de la Driver Station. Ensuite, vous devrez pointer la Driver Station vers votre Romi. Cela se fait en définissant le numéro d'équipe sur ``127.0.0.1``. Vous pouvez ensuite utiliser les commandes de la Driver Station pour définir le mode robot et activer/désactiver normalement.

source: Using the Gyro or Encoder
fr_ca: Utilisation du gyroscope ou de l'encodeur

source: The gyro that is available on the Romi is available using the RomiGyro functions. This is located under
fr_ca: Le gyroscope disponible sur le Romi est disponible à l'aide des fonctions RomiGyro. Celui-ci est situé sous

source: Tree structure of locating the RomiGyro function
fr_ca: Arborescence de localisation de la fonction RomiGyro

source: The encoders can be used using the standard encoder function. The DIO ports are:
fr_ca: Les encodeurs peuvent être utilisés en utilisant la fonction d'encodeur standard. Les ports DIO sont :
