Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/romi-robot/web-ui.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Angry IP Scanner is flagged by some antivirus as spyware as it pings devices on your network! It is a safe application!
es_mx: Angry IP Scanner es marcado por algunos antivirus como software espía, ya que hace pings a los dispositivos de su red. Es una aplicación segura.
fr_ca: Angry IP Scanner est signalé par certains antivirus comme spyware comme il envoie des requêtes ping à des dispositifs sur votre réseau! C’est une application sûre!
tr_tr: Angry IP Scanner, ağınızdaki cihazlara ping gönderirken bazı antivirüsler tarafından casus yazılım olarak işaretlenir! Güvenli bir uygulamadır!
zh_cn: 在对网络中的设备执行ping操作时，Angular IP Scanner被某些防病毒软件标记为间谍软件！这是一个安全的应用程序！

source: **Ethernet**: DHCP
zh_cn: **以太网**：DHCP

source: **WiFi Mode**: Bridge
es_mx: **Modo WiFi**: Bridge
tr_tr: **WiFi Modu**: Köprü
zh_cn: ** WiFi模式**：桥接

source: **WiFi Address**: DHCP
es_mx: **Dirección WiFi**: DHCP
tr_tr: **WiFi Adresi**: DHCP
zh_cn: ** WiFi地址**：DHCP
