Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/romi-robot/web-ui.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: The Romi Web UI
es_mx: La Interfaz de Usuario web de Romi
fr_ca: Interface utilisateur Web de Romi
tr_tr: Romi Web Kullanıcı Arayüzü
zh_cn: ROMI Web界面

source: The Romi Web UI comes installed as part of the WPILibPi Raspberry Pi image. It is accessible by clicking on the Romi tab in the navigation bar of the main WPILibPi Web UI.
es_mx: La interfaz de usuario web de Romi viene instalada como parte de la imagen WPILibPi Raspberry Pi. Se puede acceder haciendo clic en la pestaña Romi en la barra de navegación de la interfaz de usuario web principal de WPILibPi.
fr_ca: L’interface utilisateur web Romi est installée comme partie intégrante de l’image WPILibPi Raspberry Pi. Elle est accessible en cliquant sur l’onglet Romi dans la barre de navigation de l’interface utilisateur web WPILibPi principale.
tr_tr: Romi Web Kullanıcı Arayüzü, WPILibPi Raspberry Pi görüntüsünün bir parçası olarak yüklenir. Ana WPILibPi Web Kullanıcı Arayüzünün gezinme çubuğundaki Romi sekmesine tıklayarak erişilebilir.
zh_cn: ROMI Web UI作为WPILibPi Raspberry Pi图像的一部分进行安装。通过单击主WPILibPi Web UI导航栏上的ROMI选项卡可以访问它。

source: Accessing the Romi Web UI
fr_ca: Accès au Romi Web UI

source: The rest of this section will walk through the various parts of the Romi Web UI and describe the relevant functionality.
es_mx: El resto de esta sección abordará las distintas partes de la interfaz de usuario web de Romi y describirá su funcionalidad relevante.
fr_ca: Le reste de cette section passera en revue les différentes parties de l'interface utilisateur Web Romi et décrira les fonctionnalités pertinentes.
tr_tr: Bu bölümün geri kalanı, Romi Web Kullanıcı Arayüzünün çeşitli bölümlerinden geçecek ve ilgili işlevselliği açıklayacaktır.
zh_cn: 本节的其余部分将介绍ROMI Web UI的各个部分，并描述相关的功能。

source: Background Service Status
es_mx: Estado del servicio en segundo plano
fr_ca: État du service Web en arrière-plan
tr_tr: Arka Plan Hizmet Durumu
zh_cn: 后台服务状态

source: Romi Background Service Status
fr_ca: État du service d'arrière-plan Romi

source: This section of the Romi Web UI provides information about the currently running Romi Web Service (which is what allows WPILib to talk to the Romi). The UI provides controls to bring the service up/down as well as shows the current uptime of the web service.
es_mx: Esta sección de la interfaz de usuario web de Romi proporciona información sobre el servicio web de Romi que se está ejecutando actualmente (que es lo que permite a WPILib hablar con Romi). La interfaz de usuario proporciona controles para activar o desactivar el servicio y muestra el tiempo de actividad actual del servicio web.
fr_ca: Cette section de l'interface utilisateur Web Romi fournit des informations sur le service Web Romi en cours d'exécution (ce qui permet à WPILib de parler au Romi). L'interface utilisateur fournit des contrôles pour activer/désactiver le service et affiche le temps de fonctionnement actuel du service Web.
tr_tr: Romi Web Kullanıcı Arayüzünün bu bölümü, halihazırda çalışan Romi Web Hizmeti (WPILib'in Romi ile konuşmasına izin veren şey) hakkında bilgi sağlar. Kullanıcı arabirimi, hizmeti yukarı / aşağı getirmek için kontroller sağlar ve web hizmetinin mevcut çalışma süresini gösterir.
zh_cn: ROMI Web UI的这一部分提供了有关当前运行的ROMI Web服务的信息(它允许WPILib与ROMI对话)。UI提供了控制来打开/关闭服务，并显示web服务的当前正常运行时间。

source: Users will not need to use the functionality in this section often, but it can be useful for troubleshooting.
es_mx: Los usuarios no necesitarán utilizar la funcionalidad de esta sección con frecuencia, pero puede ser útil para solucionar problemas.
fr_ca: Les utilisateurs n'auront pas besoin d'utiliser souvent la fonctionnalité de cette section, mais cela peut être utile pour le dépannage.
tr_tr: Kullanıcıların bu bölümdeki işlevleri sık kullanmaları gerekmeyecektir, ancak sorun giderme için yararlı olabilir.
zh_cn: 注意:用户不需要经常使用本节中的功能，但它可以用于解决问题

source: Romi Status
es_mx: Estado de Romi
fr_ca: Statut du Romi
tr_tr: Romi Durumu
zh_cn: Romi状态

source: This section provides information about the Romi, including the service version, battery voltage, and whether or not the currently installed firmware on the Romi 32U4 board is compatible with the current version of the web service.
es_mx: Esta sección provee información sobre Romi, incluyendo la versión de servicio, voltaje de batería, y si el firmware instalado al momento en el tablero 32U4 de Romi es compatible con la versión actualizada del servicio web.
fr_ca: Cette section fournit des informations sur le Romi, y compris la version du service, la tension de la batterie et si le micrologiciel actuellement installé sur la carte Romi 32U4 est compatible ou non avec la version actuelle du service Web.
tr_tr: Bu bölüm, hizmet sürümü, pil voltajı ve Romi 32U4 kartında şu anda yüklü olan ürün yazılımının web hizmetinin mevcut sürümü ile uyumlu olup olmadığı dahil olmak üzere Romi hakkında bilgi sağlar.
zh_cn: 这个部分介绍Romi的相关信息，包括服务版本、电池电压、当前安装在Romi 32U4板上的固件与当前web服务版本是否兼容等。

source: If the firmware is not compatible, see the section on :doc:`Imaging your Romi </docs/romi-robot/imaging-romi>`
es_mx: Si el firmware no es compatible, vea la sección en :doc:`Imaging your Romi </docs/romi-robot/imaging-romi>`
fr_ca: Si le micrologiciel n'est pas compatible, voir la section :doc:`Installation de l'image dans votre Romi</docs/romi-robot/imaging-romi>`
tr_tr: Donanım yazılımı uyumlu değilse, şu bölüme bakın :doc:`Imaging your Romi </docs/romi-robot/imaging-romi>'nizi görüntüleme ''
zh_cn: 如果固件不兼容，请参阅:doc: ' Imaging your Romi 1 '章节。

source: Web Service Update
es_mx: Actualización del servicio web
fr_ca: Mise à jour du service Web
tr_tr: Web Servis Güncellemesi
zh_cn: Web服务更新

source: The Raspberry Pi must be in **Writable** mode for this section to work.
es_mx: La Raspberry Pi debe estar en modo **Writable** para que esta sección funcione.
fr_ca: Le Raspberry Pi doit être en mode **Writable** pour que cette section fonctionne.
tr_tr: Raspberry Pi'nin bu bölümün çalışması için **Writable- Yazılabilir ** modunda olması gerekir.
zh_cn: 注意:Raspberry Pi必须在可写模式下才能工作。

source: The Romi WPILibPi image ships with the latest (at publication time) version of the Romi web service. To support upgrading to newer versions of the Romi web service, this section allows users to upload a pre-built bundle that can be obtained via the Romi web service `GitHub releases page <https://github.com/wpilibsuite/wpilib-ws-robot-romi/releases>`__.
es_mx: La imagen Romi WPILibPi se envía con la última versión (en el momento de la publicación) del servicio web Romi. Para admitir la actualización a versiones más nuevas del servicio web Romi, esta sección permite a los usuarios cargar un paquete prediseñado que se puede obtener a través del servicio web Romi `GitHub releases page <https://github.com/wpilibsuite/wpilib-ws-robot-romi/releases>` __.
fr_ca: L'image Romi WPILibPi est fournie avec la dernière version (au moment de la publication) du service Web Romi. Pour prendre en charge la mise à niveau vers des versions plus récentes du service Web Romi, cette section permet aux utilisateurs de télécharger un bundle pré-construit qui peut être obtenu via le service Web Romi `Page des versions de GitHub <https://github.com/wpilibsuite/wpilib-ws-robot-romi/releases>`__.
tr_tr: Romi WPILibPi görüntüsü, Romi web hizmetinin en son (yayınlanma anında) sürümüyle birlikte gelir. Romi web hizmetinin daha yeni sürümlerine yükseltmeyi desteklemek için bu bölüm, kullanıcıların Romi web hizmeti `GitHub releases page <https://github.com/wpilibsuite/wpilib-ws-robot-romi/releases>`__.
zh_cn: Romi WPILibPi映像随附了Romi Web服务的最新版本（在发布时）。为了支持升级到Romi Web服务的较新版本，本节允许用户上传可以通过Romi Web服务`GitHub releases页面<https://github.com/wpilibsuite/wpilib-ws-robot-romi/releases>`__获得的预构建捆绑包。

source: To perform an upgrade, download the appropriate .tgz file from the GitHub Releases page. Next, select the downloaded .tgz file and click :guilabel:`Save`. The updated web service bundle will be uploaded to the Raspberry Pi, and be installed. After a short moment, the Romi Status section should update itself with the latest version information.
es_mx: Para realizar una actualización, descargue el archivo .tgz apropiado de la página de versiones de GitHub. A continuación, seleccione el archivo .tgz descargado y haga clic en :guilabel: `Guardar`. El paquete de servicio web actualizado se cargará en Raspberry Pi y se instalará. Después de un breve momento, la sección Romi Status debería actualizarse con la información de la última versión.
fr_ca: Pour effectuer une mise à niveau, téléchargez le fichier .tgz approprié à partir de la page Versions de GitHub. Ensuite, sélectionnez le fichier .tgz téléchargé et cliquez sur :guilabel:`Save`. Le kit de services Web mis à jour sera téléchargé sur le Raspberry Pi et installé. Après un court instant, la section Statut Romi devrait se mettre à jour avec les dernières informations de version.
tr_tr: Yükseltme gerçekleştirmek için GitHub Bültenleri sayfasından uygun .tgz dosyasını indirin. Ardından, indirilen .tgz dosyasını seçin ve tıklayın :guilabel:`Save` . Güncellenen web hizmeti paketi Raspberry Pi'ye yüklenecek ve yüklenecektir. Kısa bir süre sonra Romi Durumu bölümü kendisini en son sürüm bilgileriyle güncellemelidir.
zh_cn: 要执行升级，请从GitHub发布页面下载适当的.tgz文件。接下来，选择下载的.tgz文件并单击Save。更新后的web服务包将被上传到Raspberry Pi，并进行安装。过一会儿，Romi Status部分就会使用最新的版本信息更新自己。

source: External IO Configuration
es_mx: Configuración IO externa
fr_ca: Configuration I/O (Éntrées-Sorties) externe
tr_tr: Harici IO Yapılandırması
zh_cn: 外部IO配置

source: This section allows users to configure the 5 external GPIO channels on the Romi.
es_mx: Esta sección permite a los usuarios configurar los 5 canales GPIO externos en la Romi.
fr_ca: Cette section permet aux utilisateurs de configurer les 5 canaux GPIO externes sur le Romi.
tr_tr: Bu bölüm, kullanıcıların Romi üzerindeki 5 harici GPIO kanalını yapılandırmasına olanak tanır.
zh_cn: 这一部分允许用户在Romi上配置5个外部GPIO通道。

source: To change the configuration of a GPIO channel, select an appropriate option from the dropdown lists. All channels (with the exception of EXT 0) support Digital IO, Analog In and PWM as channel types. Once the appropriate selections are made, click on :guilabel:`Save External IO Configuration`. The web service will then restart and pick up the new IO configuration.
es_mx: Para cambiar la configuración de un canal GPIO, seleccione una opción apropiada de las listas desplegables. Todos los canales (con la excepción de EXT 0) admiten IO Digital, Entrada analógica y PWM como tipos de canal. Una vez realizadas las selecciones adecuadas, haga clic en :guilabel: `Guardar configuración de IO externa`. El servicio web se reiniciará y recuperará la nueva configuración de IO.
fr_ca: Pour modifier la configuration d'un canal GPIO, sélectionnez une option appropriée dans les listes déroulantes. Tous les canaux (à l'exception de EXT 0) prennent en charge les I/O numériques, les entrées analogiques et PWM comme types de canaux. Une fois les sélections appropriées effectuées, cliquez sur :guilabel:`Save External IO Configuration`. Le service Web redémarrera et récupérera la nouvelle configuration IO.
tr_tr: Bir GPIO kanalının yapılandırmasını değiştirmek için, açılır listelerden uygun bir seçenek seçin. Tüm kanallar (EXT 0 hariç), kanal türleri olarak Dijital IO, Analog Giriş ve PWM'yi destekler. Uygun seçimler yapıldıktan sonra, tıklayın:guilabel:`Save External IO Configuration`. Web hizmeti daha sonra yeniden başlayacak ve yeni IO yapılandırmasını alacaktır.
zh_cn: 要更改GPIO通道的配置，请从下拉列表中选择合适的选项。所有通道(除了EXT 0)都支持数字IO、模拟In和PWM作为通道类型。一旦做出了适当的选择，单击Save External IO configuration。然后，web服务将重新启动并拾取新的IO配置。

source: The "Robot Port" row provides the appropriate WPILib mapping for each configured GPIO channel. For example, EXT 0 is configured as a Digital IO channel, and will be accessible in WPILib as a DigitalInput (or DigitalOutput) channel 8.
es_mx: La fila "Robot Port" proporciona el mapeo WPILib apropiado para cada canal GPIO configurado. Por ejemplo, EXT 0 está configurado como un canal de IO digital y será accesible en WPILib como un canal 8 de entrada digital (o salida digital).
fr_ca: La ligne «Robot Port» fournit le mappage WPILib approprié pour chaque canal GPIO configuré. Par exemple, EXT 0 est configuré comme canal I/O numérique et sera accessible dans WPILib en tant que canal 8 DigitalInput (ou DigitalOutput).
tr_tr: "Robot Port-Robot Bağlantı Noktası" satırı, yapılandırılmış her GPIO kanalı için uygun WPILib eşlemesini sağlar. Örneğin, EXT 0 bir Dijital IO kanalı olarak yapılandırılmıştır ve WPILib'de bir DigitalInput (veya DigitalOutput) kanalı 8 olarak erişilebilir olacaktır.
zh_cn: 机器人端口行为每个配置好的GPIO通道提供了适当的WPILib映射。例如，EXT 0被配置为数字IO通道，并且可以在WPILib中作为数字输入(或数字输出)通道8访问。

source: IMU Calibration
es_mx: Calibración IMU
fr_ca: Étalonnage de l'unité IMU
tr_tr: IMU Kalibrasyonu
zh_cn: IMU校准

source: This section allows users to calibrate the gyro on the Romi. Gyros usually have some sort of zero-offset error, and calibration allows the Romi to calculate the offset and use it in calculations.
es_mx: Esta sección permite a los usuarios calibrar el giróscopo en el Romi. Los giroscopios suelen tener algún tipo de error de compensación cero, y la calibración permite a Romi calcular la compensación y utilizarla en los cálculos.
fr_ca: Cette section permet aux utilisateurs de calibrer le gyroscope sur le Romi. Les gyroscopes ont généralement une sorte d'erreur de décalage zéro, et l'étalonnage permet au Romi de calculer le décalage et de l'utiliser dans les calculs.
tr_tr: Bu bölüm, kullanıcıların jiroskopu Romi üzerinde kalibre etmesine olanak tanır. Jiroskoplarda genellikle bir tür sıfır ofset hatası vardır ve kalibrasyon Romi'nin ofseti hesaplamasına ve hesaplamalarda kullanmasına izin verir.
zh_cn: 本节允许用户在Romi上校准陀螺。陀螺通常有某种零偏移误差，并且校准允许Romi计算偏移量并在计算中使用它。

source: To begin calibration, place the Romi on a flat, stable surface. Then, click the :guilabel:`Calibrate Gyro` button. A progress bar will appear, showing the current calibration process. Once calibration is complete, the latest offset values will be displayed on screen and registered with the Romi web service.
es_mx: Para comenzar la calibración, coloque el Romi en una superficie plana y estable. Luego, haga clic en el botón :guilabel: `Calibrate Gyro`. Aparecerá una barra de progreso que muestra el proceso de calibración actual. Una vez que se completa la calibración, los últimos valores de compensación se mostrarán en la pantalla y se registrarán con el servicio web Romi.
fr_ca: Pour commencer l'étalonnage, placez le Romi sur une surface plane et stable. Ensuite, cliquez sur le bouton :guilabel:`Calibrate Gyro`. Une barre de progression apparaîtra, indiquant le processus d'étalonnage en cours. Une fois l'étalonnage terminé, les dernières valeurs de décalage seront affichées à l'écran et enregistrées auprès du service Web Romi.
tr_tr: Kalibrasyona başlamak için Romi'yi düz, sabit bir yüzeye yerleştirin. Ardından :guilabel:`Calibrate Gyro` düğmesine tıklayın. Mevcut kalibrasyon sürecini gösteren bir ilerleme çubuğu görünecektir. Kalibrasyon tamamlandıktan sonra, en son ofset değerleri ekranda görüntülenecek ve Romi web hizmetine kaydedilecektir.
zh_cn: 开始校准时，把Romi放在一个平坦、稳定的表面上。然后，点击校准陀螺按钮。将出现一个进度条，显示当前的校准过程。校准完成后，最新的偏移值将显示在屏幕上，并向Romi web服务注册。

source: These offset values are saved to disk and persist between reboots.
es_mx: Estos valores de compensación se guardan en el disco y persisten entre reinicios.
fr_ca: Ces valeurs de décalage sont enregistrées sur la carte SD et persistent entre les redémarrages.
tr_tr: Bu ofset değerleri diske kaydedilir ve yeniden başlatmalar arasında kalır.
zh_cn: 这些偏移值保存到磁盘，并在重新引导之间保持不变。

source: Firmware
fr_ca: Micrologiciel
zh_cn: 固件

source: See the section on :doc:`Imaging your Romi </docs/romi-robot/imaging-romi>`
es_mx: Consulte la sección sobre :doc: `Imaging your Romi </docs/romi-robot/imaging-romi>`
fr_ca: Voir la section sur :doc:`Installation de l’image dans votre Romi </docs/romi-robot/imaging-romi>`
tr_tr: Şu bölüme bakın :doc:`Imaging your Romi </docs/romi-robot/imaging-romi>` ınızı görüntüleme.
zh_cn: 注意:请参阅成像Romi部分

source: Console Output
es_mx: Salida de consola
fr_ca: Sortie de la console
tr_tr: Konsol Çıkışı
zh_cn: 控制台输出

source: When enabled, this section allows users to view the raw console output that the Romi web service provides. This is useful for troubleshooting issues with the Romi, or just to find out more about what goes on behind the scenes.
es_mx: Cuando está habilitada, esta sección permite a los usuarios ver la salida de consola sin procesar que el servicio web de Romi proporciona. Esto es útil para solucionar problemas con Romi, o solamente para tener más información sobre qué más sucede detrás de escenas,
fr_ca: Lorsqu'elle est activée, cette section permet aux utilisateurs d'afficher la sortie de console brute fournie par le service Web Romi. Ceci est utile pour résoudre les problèmes avec le Romi, ou simplement pour en savoir plus sur ce qui se passe dans les coulisses.
tr_tr: Etkinleştirildiğinde, bu bölüm kullanıcıların Romi web hizmetinin sağladığı ham konsol çıktısını görüntülemelerine olanak tanır. Bu, Romi ile ilgili sorunları gidermek veya sadece perde arkasında neler olduğu hakkında daha fazla bilgi edinmek için kullanışlıdır.
zh_cn: 启用后，本节允许用户查看Romi web服务提供的原始控制台输出。这对于解决Romi问题非常有用，或者只是为了了解更多关于幕后发生的事情。

source: Bridge Mode
es_mx: Modo Bridge
fr_ca: Mode passerelle
tr_tr: Köprü Modu
zh_cn: 桥接模式

source: Bridge mode allows your Romi robot to connect to a WiFi network instead of acting as an Access Point (AP). This is especially useful in remote learning environments, as you can use the internet while using the Romi without extra hardware.
es_mx: El modo Bridge permite que su robot Romi se conecte a una red WiFi, en lugar de actuar como un Punto de Acceso (AP). Esto es especialmente útil en entornos de aprendizaje remotos, ya que puede utilizar Internet mientras usa el Romi sin necesidad de hardware adicional.
fr_ca: Le mode Bridge ou passerelle permet à votre robot Romi de se connecter à un réseau WiFi au lieu d’agir comme un point d’accès (AP). Ceci est particulièrement utile dans les environnements d’apprentissage à distance, car vous pouvez utiliser Internet tout en utilisant le Romi sans matériel supplémentaire.
tr_tr: Köprü modu, Romi robotunuzun Erişim Noktası (AP) gibi davranmak yerine bir WiFi ağına bağlanmasına olanak tanır. Bu, Romi'yi ekstra donanım olmadan kullanırken interneti kullanabileceğiniz için özellikle uzaktan öğrenme ortamlarında kullanışlıdır.
zh_cn: 桥接模式允许您的Romi机械手连接到WiFi网络，而不是充当接入点（AP）。这在远程学习环境中特别有用，因为您可以在使用Romi的同时使用互联网而无需额外的硬件。

source: Bridge mode is not likely to work properly in restricted network environments (Educational Institutions).
es_mx: Es probable que el modo Bridge no funcione correctamente en entornos de red restringidos (instituciones educativas).
fr_ca: Il est peu probable que le mode passerelle fonctionne correctement dans les environnements de réseau restreints (institutions d’enseignement).
tr_tr: Köprü modunun kısıtlı ağ ortamlarında (Eğitim Kurumları) düzgün çalışması olası değildir.
zh_cn: 在受限的网络环境（教育机构）中，桥接模式不太可能正常工作。

source: Enable :guilabel:`Writable` in the top menu.
es_mx: Active :guilabel:`Writable` en el menú superior.
fr_ca: Activer :guilabel:`Writable` dans le menu du haut.
tr_tr: Üst menüde :guilabel:`Yazılabilir` seçeneğini etkinleştirin.
zh_cn: 在顶部菜单中启用“可写”。

source: Enabling writable mode in the romi UI
fr_ca: Activer le mode écriture dans l'interface utilisateur de Romi

source: Click on :guilabel:`Network Settings`.
es_mx: Haga clic en :guilabel:`Network Settings`.
fr_ca: Cliquez sur :guilabel:`Network Settings`.
tr_tr: :guilabel:`Ağ Ayarları`na tıklayın.
zh_cn: 点击“网络设置”。

source: Selecting Network Settings in the UI
fr_ca: Choisir la configuration de réseau dans le UI

source: The following network settings must be applied:
es_mx: Deben aplicarse los siguientes ajustes de red:
fr_ca: Les configurations réseau suivantes doivent être appliquées :
tr_tr: Aşağıdaki ağ ayarları uygulanmalıdır:
zh_cn: 必须应用以下网络设置：

source: Picture of the necessary romi options listed below
fr_ca: Image des options de Romi nécessaires répertoriées ci-dessous

source: **SSID**: SSID (name) of your network
es_mx: **SSID**: SSID (nombre) de su red
fr_ca: **SSID**: SSID (name) nom de votre réseau
tr_tr: **SSID**: Ağınızın SSID'si (adı)
zh_cn: ** SSID **：您网络的SSID（名称）

source: **WPA2 Passphrase**: Password of your wifi network
es_mx: **WPA2 Frase de Acceso**: Contraseña de su red wifi
fr_ca: **WPA2 Passphrase**: Mot de passe de votre réseau wifi
tr_tr: **WPA2 Parolası**: Wi-Fi ağınızın parolası
zh_cn: ** WPA2密码**：您的wifi网络的密码

source: Once the settings are applied, please reboot the Romi. You should now be able to navigate to ``wpilibpi.local`` in your web browser while connected to your specified network.
es_mx: Una vez aplicada la configuración, reinicie la Romi. Ahora debería poder navegar a ``wpilibpi.local`` en su navegador web mientras está conectado a su red especificada.
fr_ca: Une fois que les configurations sont appliquées, s’il vous plaît redémarrer le Romi. Vous devriez maintenant être en mesure de naviguer vers ``wpilibpi.local`` dans votre navigateur Web lorsque vous êtes connecté à votre réseau spécifié.
tr_tr: Ayarlar uygulandıktan sonra lütfen Romi'yi yeniden başlatın. Artık belirlediğiniz ağa bağlıyken web tarayıcınızda ``wpilibpi.local`` konumuna gidebilmelisiniz.
zh_cn: 应用设置后，请重新启动Romi。现在，当连接到指定的网络时，您应该能够在Web浏览器中导航到“ wpilibpi.local”。

source: Unable to Access Romi
es_mx: No se puede acceder a Romi
fr_ca: Impossible d’accéder à Romi
tr_tr: Romi'ye Erişilemiyor
zh_cn: 无法访问罗米

source: If the Romi has the correct bridge settings and you are unable to access it, we have a few workarounds.
es_mx: Si la Romi tiene la configuración correcta del puente y usted no puede acceder a ella, tenemos algunas soluciones.
fr_ca: Si le Romi présente des configurations exactes de ses paramètres de passerelle et que vous ne pouvez pas y accéder, nous avons quelques solutions de contournement.
tr_tr: Romi doğru köprü ayarlarına sahipse ve buna erişemiyorsanız, birkaç geçici çözümümüz var.
zh_cn: 如果Romi的网桥设置正确，而您无法访问它，我们有一些解决方法。

source: Ethernet into the Romi
es_mx: Ethernet en la Romi
fr_ca: Connectez-vous à Romi par câble Ethernet
tr_tr: Romi'ye Ethernet
zh_cn: 以太网进入罗米

source: Reimage the Romi
es_mx: Reimaginar la Romi
fr_ca: Réinstallez l'image du Romi
tr_tr: Romi'yi yeniden şekillendirin
zh_cn: 重塑Romi

source: Some restricted networks can interfere with the hostname of the Romi resolving, you can workaround this by using `Angry IP Scanner <https://angryip.org/>`__ to find the IP address.
es_mx: Algunas redes restringidas pueden interferir con la resolución del nombre de host del Romi, usted puede solucionar esto usando `Angry IP Scanner <https://angryip.org/>`__ para encontrar la dirección IP.
fr_ca: Certains réseaux restreints peuvent interférer avec le nom d’hôte de la résolution Romi, vous pouvez résoudre ce problème en utilisant `Angry IP Scanner <https://angryip.org/>`__ pour trouver l’adresse IP.
tr_tr: Bazı kısıtlı ağlar, Romi çözümlemesinin ana bilgisayar adını etkileyebilir, IP adresini bulmak için `Angry IP Scanner <https://angryip.org/>`__ kullanarak bu sorunu çözebilirsiniz.
zh_cn: 某些受限制的网络可能会干扰Romi解析的主机名，您可以使用`Angry IP Scanner <https://angryip.org/>`__查找IP地址来解决此问题。
