Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/smartdashboard/changing-display-properties.po
Languages: tr_tr, zh_cn

source: Changing the display properties of a value
tr_tr: Bir değerin görüntü özelliklerini değiştirme
zh_cn: 更改值的显示属性

source: Each value displayed with SmartDashboard has a a set of properties that effect the way it's displayed.
tr_tr: SmartDashboard ile görüntülenen her değerin, görüntülenme şeklini etkileyen bir dizi özelliği vardır.
zh_cn: “SmartDashboard” 显示的每个值都有一组属性，这些属性会影响其显示方式。

source: Setting the SmartDashboard display into editing mode
tr_tr: SmartDashboard ekranını düzenleme moduna ayarlama
zh_cn: 将 “SmartDashboard” 的显示设置为编辑模式

source: The SmartDashboard has two modes it can operate in, display mode and edit mode. In edit mode you can move around widgets on the screen and edit their properties. To put the SmartDashboard into edit mode, click the "View" menu, then select "Editable" to turn on edit mode.
tr_tr: SmartDashboard'un çalışabileceği iki modu vardır: görüntüleme modu ve düzenleme modu. Düzenleme modunda, ekranda widget'lar arasında gezinebilir ve özelliklerini düzenleyebilirsiniz. SmartDashboard'u düzenleme moduna getirmek için, "View" " menüsünü tıklayın, ardından düzenleme modunu açmak için "Editable" ı seçin.
zh_cn: “SmartDashboard” 有两种可运行的模式：显示模式和编辑模式。在编辑模式下，你可以在屏幕上移动小组件并编辑其属性。要将 “SmartDashboard” 设置为编辑模式，请单击 “View” 菜单，然后选择 “Editable” 以打开编辑模式。

source: Getting the properties editor of a widget
tr_tr: Bir widget'ın özellikler düzenleyicisini edinme
zh_cn: 获取小组件的属性编辑器

source: Once in edit mode, you can display and edit the properties for a widget. Right-click on the widget and select "Properties...".
tr_tr: Düzenleme moduna girdikten sonra, bir widget'ın özelliklerini görüntüleyebilir ve düzenleyebilirsiniz. Widget'a sağ tıklayın ve "Properties..." seçeneğini seçin.
zh_cn: 进入编辑模式后，你可以显示和编辑小组件的属性。右键单击小组件，然后选择 “Properties...”。

source: Editing the properties on a field
tr_tr: Bir alandaki özellikleri düzenleme
zh_cn: 编辑字段属性

source: A dialog box will be shown in response to the "Properties..." menu item on the widgets right-click context menu.
tr_tr: Widget'ların sağ tıklama bağlam menüsündeki "Properties..." menü öğesine yanıt olarak bir iletişim kutusu gösterilecektir.
zh_cn: 右键单击小组件并选择 “Properties” 菜单时，一个对话框会弹出以响应该操作。

source: Editing the widgets background color
tr_tr: Widget arka plan rengini düzenleme
zh_cn: 编辑小组件的背景色

source: To edit a property value, say, Background color, click the background color shown (in this case grey), and choose a color from the color editor that pops up. This will be used as the widgets background color.
tr_tr: Bir özellik değerini düzenlemek için, örneğin Arka plan rengi, gösterilen arka plan rengini (bu durumda gri) tıklayın ve açılan renk düzenleyiciden bir renk seçin. Bu, widget arka plan rengi olarak kullanılacaktır.
zh_cn: 要编辑属性值，例如“背景色”，请单击显示的背景色 (在这种情况下为灰色)，然后从弹出的颜色编辑器中选择一种颜色。这个颜色将被设为小部件的背景色。

source: Edit properties of other widgets
tr_tr: Diğer widget'ların özelliklerini düzenleyin
zh_cn: 编辑其他小组件的属性

source: Different widget types have different sets of editable properties to change the appearance. In this example, the upper and lower limits of the dial and the tick interval are changeable parameters.
tr_tr: Farklı pencere öğesi türleri, görünümü değiştirmek için farklı düzenlenebilir özellik kümelerine sahiptir. Bu örnekte, kadranın üst ve alt sınırları ve tik aralığı değiştirilebilir parametrelerdir.
zh_cn: 不同的小组件类型具有不同的可编辑外观属性。在此示例中，刻度盘的上下限和刻度间隔是可更改的参数。
