Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/smartdashboard/choosing-an-autonomous-program-from-smartdashboard.po
Languages: tr_tr, zh_cn

source: Choosing an Autonomous Program
tr_tr: Otonom Program Seçimi
zh_cn: 选择自动程序

source: Often teams have more than one autonomous program, either for competitive reasons or for testing new software. Programs often vary by adding things like time delays, different strategies, etc. The methods to choose the strategy to run usually involves switches, joystick buttons, knobs or other hardware based inputs.
tr_tr: Çoğu zaman, takımların ya rekabetçi nedenlerle ya da yeni yazılımı test etmek için birden fazla otonom programı vardır. Programlar genellikle zaman gecikmeleri, farklı stratejiler vb. gibi şeyler ekleyerek değişir. Çalıştırılacak stratejiyi seçme yöntemleri genellikle anahtarlar, kumanda kolu butonları, düğmeler veya diğer donanım tabanlı girdileri içerir.
zh_cn: 出于竞争原因或测试新软件的原因，团队通常拥有多个自动程序。程序通常会通过添加时间延迟，加入不同的策略等来变化。选择要运行的策略的方法通常包括开关，操纵杆按钮，旋钮或其他基于硬件的输入。

source: With the SmartDashboard you can simply display a widget on the screen to choose the autonomous program that you would like to run. And with command based programs, that program is encapsulated in one of several commands. This article shows how to select an autonomous program with only a few lines of code and a nice looking user interface.
tr_tr: SmartDashboard ile çalıştırmak istediğiniz otonom programı seçmek için ekranda bir widget görüntüleyebilirsiniz. Ve komut tabanlı programlarla, bu program birkaç komuttan birinde kapsanır. Bu makale, yalnızca birkaç satır kod ve hoş görünümlü bir kullanıcı arayüzüne sahip otonom bir programın nasıl seçileceğini gösterir.
zh_cn: 使用SmartDashboard，您可以简单地在屏幕上显示小部件以选择要运行的自动程序。对于基于命令的程序，该程序被封装在多个命令中的一个内部。本文将说明如何选择仅包含几行代码和漂亮的用户界面的自动程序。

source: The code snippets shown below are part of the HatchbotTraditional example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):
tr_tr: Aşağıda gösterilen kod parçacıkları, HatchbotTraditional örnek projesinin bir parçasıdır (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>` __):
zh_cn: 下面显示的代码段是HatchbotTraditional示例项目的一部分（Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__）：

source: Creating the SendableChooser Object
tr_tr: SendableChooser Nesnesini Oluşturma
zh_cn: 创建SendableChooser对象

source: In ``RobotContainer``, create a variable to hold a reference to a ``SendableChooser`` object. Two or more commands can be created and stored in new variables. Using the ``SendableChooser``, one can choose between them. In this example, ``SimpleAuto`` and ``ComplexAuto`` are shown as options.
zh_cn: 在“ RobotContainer”中，创建一个变量以保存对“ SendableChooser”对象的引用。可以创建两个或更多命令并将其存储在新变量中。使用“ SendableChooser”，可以在它们之间进行选择。在此示例中，“ SimpleAuto”和“ ComplexAuto”显示为选项。

source: Setting up SendableChooser
tr_tr: SendableChooser'ı kurma
zh_cn: 设置SendableChooser

source: Imagine that you have two autonomous programs to choose between and they are encapsulated in commands ``SimpleAuto`` and ``ComplexAuto``. To choose between them:
tr_tr: Aralarından seçim yapabileceğiniz iki otonom programınız olduğunu ve bu programların ``SimpleAuto`` ve ``ComplexAuto`` komutları içinde kapsandığını hayal edin. Aralarından seçim yapmak için:
zh_cn: 假设你有两个自动程序可供选择，它们被封装在指令“ SimpleAuto”和“ ComplexAuto”中。在它们当中进行选择：

source: In ``RobotContainer``, create a ``SendableChooser`` object and add instances of the two commands to it. There can be any number of commands, and the one added as a default (``setDefaultOption``), becomes the one that is initially selected. Notice that each command is included in an ``setDefaultOption()`` or ``addOption()`` method call on the ``SendableChooser`` instance.
tr_tr: ``RobotContainer`` içinde bir ``SendableChooser`` nesnesi oluşturun ve iki komutun örneklerini ona ekleyin. Herhangi bir sayıda komut olabilir ve varsayılan olarak eklenen komut (``setDefaultOption``), başlangıçta seçilen komut haline gelir. Her komutun ``SendableChooser`` örneğinde bir ``setDefaultOption()`` veya ``addOption()`` yöntem çağrısına dahil edildiğine dikkat edin.
zh_cn: 在“ RobotContainer”中创建一个“ SendableChooser”对象，并向其添加两个指令的实例。指令的数量没有限制，并且默认添加的指令（``setDefaultOption``）将成为最初选择的命令。注意，每个指令都包含在“ SendableChooser”实例上的“ setDefaultOption（）”或“ addOption（）”方法调用中。

source: Starting an Autonomous Command
tr_tr: Otonom Komuta Başlama
zh_cn: 启动自动命令

source: In ``Robot.java``, when the autonomous period starts, the ``SendableChooser`` object is polled to get the selected command and that command must be scheduled.
tr_tr: ``Robot.java`` da otonom dönem başladığında, ``SendableChooser`` nesnesi seçili komutu almak için sorgulanır ve bu komutun zamanlanması gerekir.
zh_cn: 在“ Robot.java”中，当自动阶段开始时，将选取“ SendableChooser”对象以获取所选命令，并且必须调度该命令。

source: Running the Scheduler during Autonomous
tr_tr: Otonom sırasında Zamanlayıcıyı Çalıştırma
zh_cn: 在自动阶段运行调度程序

source: In ``Robot.java``, this will run the scheduler every driver station update period (about every 20ms) and cause the selected autonomous command to run.
tr_tr: ``Robot.java`` da bu, zamanlayıcıyı her sürücü istasyonu güncelleme periyodunda (yaklaşık her 20 ms'de bir) çalıştıracak ve seçilen otonom komutun çalışmasına neden olacaktır.
zh_cn: 在 "Robot.java" 中，每当driver station刷新时（约20ms一次），调度程序将被执行并使得被选择的自动程序持续运行。

source: Running the scheduler can occur in the ``autonomousPeriodic()`` function or ``robotPeriodic()``, both will function similarly in autonomous mode.
tr_tr: Zamanlayıcının çalıştırılması ``autonomousPeriodic()`` işlevinde veya ``robotPeriodic()`` içinde gerçekleşebilir, her ikisi de otonom modda benzer şekilde çalışacaktır.
zh_cn: 运行调度程序可以在autonomousPeriodic（）函数或robotPeriodic（）中进行，两者在自动模式下的功能相似。

source: Canceling the Autonomous Command
tr_tr: Otonom Komutu İptal Etme
zh_cn: 取消自动命令

source: In ``Robot.java``, when the teleop period begins, the autonomous command will be canceled.
tr_tr: ``Robot.java`` da teleop dönemi başladığında otonom komut iptal edilecektir.
zh_cn: 在 "Robot.java" 当中，当遥控阶段开始时，自动指令将被终止。

source: SmartDashboard Display
tr_tr: SmartDashboard Ekranı
zh_cn: SmartDashboard显示

source: When the SmartDashboard is run, the choices from the ``SendableChooser`` are automatically displayed. You can simply pick an option before the autonomous period begins and the corresponding command will run.
tr_tr: SmartDashboard çalıştırıldığında, ``SendableChooser`` dan seçimler otomatik olarak görüntülenir. Otonom periyodu başlamadan önce bir seçenek belirleyebilirsiniz ve ilgili komut çalışacaktır.
zh_cn: 运行SmartDashboard时，将自动显示“ SendableChooser”中的选项。您可以在自动期限开始之前选择一个选项，然后相应的命令将运行。
