Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/smartdashboard/displaying-expressions.po
Languages: es_mx, fr_ca

source: Displaying Expressions from a Robot Program
es_mx: Mostrar expresiones desde el programa del robot
fr_ca: Affichage des expressions à partir du programme du robot

source: Often debugging or monitoring the status of a robot involves writing a number of values to the console and watching them stream by. With SmartDashboard you can put values to a GUI that is automatically constructed based on your program. As values are updated, the corresponding GUI element changes value - there is no need to try to catch numbers streaming by on the screen.
es_mx: A menudo la depuración o el monitoreo del estado del robot involucra ingresar una serie de valores a la consola y verlos fluir. Con la SmartDashboard puede ingresar valores a un GUI que está automáticamente construido basado en su programa. A medida que los valores se actualizan, los elementos correspondientes GUI cambian su valor – no hay necesidad de intentar capturar números que aparecen en la pantalla.
fr_ca: Souvent, le débogage ou la surveillance de l’état du robot implique d’écrire un certain nombre de valeurs à la console et de les visionner par streaming. Grâce à SmartDashboard, vous pouvez afficher des valeurs dans un GUI qui est automatiquement généré par votre programme. Au fur et à mesure que les valeurs sont mises à jour, les éléments correspondants du GUI changent de valeurs - il n’est pas nécessaire d'intercepter ces valeurs en streaming à la console.

source: Writing Values to SmartDashboard
es_mx: Escribir valores a la SmartDashboard
fr_ca: Écriture de valeurs sur SmartDashboard

source: You can write Boolean, Numeric, or String values to the SmartDashboard by simply calling the correct method for the type and including the name and the value of the data, no additional code is required. Any time in your program that you write another value with the same name, it appears in the same UI element on the screen on the driver station or development computer. As you can imagine this is a great way of debugging and getting status of your robot as it is operating.
es_mx: Puede escribir valores tipo Boolean, Numeric o String a la SmartDashboard simplemente llamando el método correcto de acuerdo al tipo e incluyendo el nombre del valor de los datos, no es necesario un código adicional. Cada vez que escriba otro valor con el mismo nombre en su programa, aparece en el mismo elemento UI en la pantalla en la driver station o la computadora en uso. Como puede imaginar este es una gran manera de depurar y obtener el estado de su robot mientras esté funcionando.
fr_ca: Vous pouvez écrire des valeurs booléennes, numériques ou des chaînes de caractères sur SmartDashboard en appelant simplement la méthode correspondant au type de la donnée appelée et en incluant le nom et la valeur de cette donnée, aucun code supplémentaire n’est requis. Dès que votre programme écrit une valeur pour un nom déclaré, cette variable apparaîtra dans le même élément de la station de pilotage ou sur la console de l’ordinateur de développement. Comme vous pouvez l’imaginer c’est un excellent moyen de débogage et d’obtenir l’état de votre robot pendant qu'il est en opération.

source: Creating Widgets on SmartDashboard
es_mx: Crear widgets en la SmartDashboard
fr_ca: Création de widgets sur SmartDashboard

source: Todo
fr_ca: À faire

source: add references
fr_ca: ajouter des références

source: Widgets are populated on the SmartDashboard automatically, no user intervention is required. Note that the widgets are only populated when the value is first written, you may need to enable your robot in a particular mode or trigger a particular code routine for an item to appear. To alter the appearance of the widget, see the next two sections Changing the Display Properties of a Value and Changing the Display Widget Type for a Value.
fr_ca: Les widgets sont automatiquement remplis sur SmartDashboard, aucune intervention de l’utilisateur n’est donc requise. Notez que les widgets ne sont remplis que lorsque la valeur correspondante est écrite pour la première fois, toutefois il vous sera peut-être nécessaire d'activer votre robot dans un mode de fonctionnement particulier ou de déclencher une routine particulière dans votre code pour qu’un élément apparaisse. Pour modifier l’apparence du widget, rapportez-vous aux deux sections Modification des propriétés d’affichage d’une valeur et Modification du type du widget d’affichage d'une valeur.

source: Stale Data
es_mx: Datos desactualizados
fr_ca: Données obsolètes

source: SmartDashboard uses NetworkTables for communicating values between the robot and the driver station laptop. Network Tables acts as a distributed table of name and value pairs. If a name/value pair is added to either the client (laptop) or server (robot) it is replicated to the other. If a name/value pair is deleted from, say, the robot but the SmartDashboard or OutlineViewer are still running, then when the robot is restarted, the old values will still appear in the SmartDashboard and OutlineViewer because they never stopped running and continue to have those values in their tables. When the robot restarts, those old values will be replicated to the robot.
es_mx: La SmartDashboard usa NetworkTables para valores comunicables entre el robot y la laptop con la Driver Station. Los NetworkTables actúan como una tabla distribuida en pares de nombre y valor. SI una pareja de nombre/valor es agregada ya sea al cliente (laptop) o servidor (robot) es replicada a la otra. Si una pareja de nombre / valor es eliminada de, por ejemplo, el robot pero la SmartDashboard o el Outline Viewer siguen trabajando, luego cuando el robot es reiniciado, los valores viejos seguirán apareciendo en la SmartDashboard y OutlineViewer porque ellos nunca pararon de funcionar y continúan teniendo esos valores en sus tablas. Cuando el robot se reinicia, esos valores desactualizados serán replicados al robot
fr_ca: SmartDashboard utilise des NetworkTables pour communiquer des valeurs entre le robot et l’ordinateur portable de la station de pilotage. Une NetworkTable agit comme une table diffusée de paires de noms et de valeurs. Si une paire nom/valeur est ajoutée soit au client (ordinateur portable) ou alors au serveur (robot), elle est répliquée à l’autre. Si une paire nom/valeur est supprimée du robot, par exemple, mais que SmartDashboard ou OutlineViewer sont toujours en cours d’exécution, alors lorsque le robot sera redémarré, les anciennes valeurs apparaîtront toujours dans SmartDashboard et OutlineViewer parce qu’ils n’ont jamais cessé de s’exécuter et continuent d’avoir ces valeurs dans leurs tables. Lorsque le robot redémarre, ces anciennes valeurs seront répliquées au robot.

source: To ensure that the SmartDashboard and OutlineViewer are showing current values, it is necessary to restart the network table clients and robot at the same time. That way, old values that one is holding won't get replicated to the others.
es_mx: Para asegurarse que la SmartDashboard y el OutlineViewer están mostrando valores actuales, es necesario reiniciar network table clients y el robot al mismo tiempo. De esa manera, los valores desactualizados que uno sigue manteniendo no se replicarán en los otros.
fr_ca: Pour s’assurer que SmartDashboard et OutlineViewer affichent les valeurs actuelles, il est nécessaire de redémarrer en même temps les clients des NetworkTables et le robot. De cette façon, les anciennes valeurs contenues dans les uns ne seront pas reproduites aux autres.

source: This usually isn't a problem if the program isn't constantly changing, but if the program is in development and the set of keys being added to NetworkTables is constantly changing, then it might be necessary to do the restart of everything to accurately see what is current.
es_mx: Normalmente esto no es un problema si el programa no está cambiando constantemente, pero si el programa está en desarrollo y el conjunto de claves que está siendo añadido a los NetworkTables está cambiando constantemente, entonces puede ser necesario hacer el reinicio de todo para ver en ese momento las actualizaciones.
fr_ca: Ce n’est généralement pas un problème si le programme ne change pas constamment, mais si le programme est phase de développement et l’ensemble de clés ajoutées à NetworkTables changent constamment, il peut alors s'avérer nécessaire de tout redémarrer afin de voir précisément ce qui est à jour.

source: Widgets are populated on the SmartDashboard automatically, no user intervention is required. Note that the widgets are only populated when the value is first written, you may need to enable your robot in a particular mode or trigger a particular code routine for an item to appear. To alter the appearance of the widget, see the next two sections :doc:`Changing the Display Properties of a Value <changing-display-properties>` and :doc:`Changing the Display Widget Type for a Value <changing-display-widget-type>`.
es_mx: Los widgets se completan en SmartDashboard automáticamente, no se requiere la intervención del usuario. Tenga en cuenta que los widgets solo se completan cuando se escribe el valor por primera vez, es posible que deba habilitar su robot en un modo particular o activar una rutina de código particular para que aparezca un elemento. Para modificar la apariencia del widget, consulte las dos secciones siguientes: :doc:`Changing the Display Properties of a Value<changing-display-properties>` y :doc:`Changing the Display Widget Type for a Value<changing-display-widget-type>`.
