Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/smartdashboard/smartdashboard-namespace.po
Languages: tr_tr

source: SmartDashboard Namespace
tr_tr: SmartDashboard Ad Alanı

source: SmartDashboard uses NetworkTables to send data between the robot and the Dashboard (Driver Station) computer. NetworkTables sends data as name, value pairs, like a distributed hashtable between the robot and the computer. When a value is changed in one place, its value is automatically updated in the other place. This mechanism and a standard set of name (keys) is how data is displayed on the SmartDashboard.
tr_tr: SmartDashboard, robot ile Dashboard (Driver Station) bilgisayarı arasında veri göndermek için NetworkTables'ı kullanır. NetworkTables, verileri robot ve bilgisayar arasında dağıtılmış bir hashtable gibi ad, değer çiftleri olarak gönderir. Bir değer bir yerde değiştirildiğinde, değeri diğer yerde otomatik olarak güncellenir. Bu mekanizma ve standart bir ad (anahtarlar) kümesi, verilerin SmartDashboard'da nasıl görüntülendiğidir.

source: There is a hierarchical structure in the name space creating a set of tables and subtables. SmartDashboard data is in the SmartDashboard subtable and LiveWindow data is in the LiveWindow subtable as shown below.
tr_tr: Ad alanında bir dizi tablo ve alt tablo oluşturan hiyerarşik bir yapı vardır. SmartDashboard verileri SmartDashboard alt tablosunda ve LiveWindow verileri aşağıda gösterildiği gibi LiveWindow alt tablosundadır.

source: SmartDashboard Data Values
tr_tr: Bilgilendirici, adlar ve değerler SmartDashboard ile aynı kurulabilir OutlineViewer uygulaması görüntülenebilir. Tüm NetworkTable anahtarlarını ve güncellenendikçe gösterecektir.

source: SmartDashboard values are created with key names that begin with ``SmartDashboard/``. The above values viewed with OutlineViewer correspond to data put to the SmartDashboard with the following statements:
tr_tr: SmartDashboard değerleri, `` SmartDashboard / '' ile başlayan anahtar adlarıyla oluşturulur. OutlineViewer ile görüntülenen yukarıdaki değerler, aşağıdaki ifadelerle SmartDashboard'a konulan verilere karşılık gelir:

source: The ``Arm position`` is created with the ``putNumber()`` call. The ``AutonomousCommand`` is written with a ``putData("Autonomous Command", command)`` that is not shown in the above code fragment. The chooser is created as a ``SendableChooser`` object and the string value, ``Program Version`` is created with the ``putString()`` call.
tr_tr: `` Kol pozisyonu '', `` putNumber () '' çağrısıyla oluşturulur. `` AutonomousCommand '', yukarıdaki kod parçasında gösterilmeyen bir `` putData ("Autonomous Command", command) '' ile yazılmıştır. Seçici, bir `` SendableChooser '' nesnesi olarak oluşturulur ve `` Program Sürümü '' dize değeri, `` putString () '' çağrısıyla oluşturulur.

source: View of SmartDashboard
tr_tr: SmartDashboard'un görünümü

source: LiveWindow Data Values
tr_tr: LiveWindow Veri Değerleri

source: LiveWindow data is automatically grouped by subsystem. The data is viewable in the SmartDashboard when the robot is in Test mode (set on the Driver Station). If you are not writing a command based program, you can still cause sensors and actuators to be grouped for easy viewing by specifying the subsystem name. In the above display you can see the key names and the resultant output in Test mode on the SmartDashboard. All the strings start with ``/LiveWindow`` then the Subsystem name, then a group of values that are used to display each element. The code that generates this LiveWindow display is shown below:
tr_tr: LiveWindow verileri otomatik olarak alt sisteme göre gruplandırılır. Veriler, robot Test modundayken (Sürücü İstasyonunda ayarlanır) SmartDashboard'da görüntülenebilir. Komut tabanlı bir program yazmıyorsanız, alt sistem adını belirterek sensörlerin ve aktüatörlerin kolay görüntüleme için gruplanmasına yine de neden olabilirsiniz. Yukarıdaki ekranda, SmartDashboard üzerinde Test modunda anahtar adlarını ve sonuçta ortaya çıkan çıktıyı görebilirsiniz. Tüm dizeler `` / LiveWindow '' ile başlar, ardından Alt Sistem adı, ardından her bir öğeyi görüntülemek için kullanılan bir değer grubu. Bu LiveWindow ekranını oluşturan kod aşağıda gösterilmiştir:

source: Values that correspond to actuators are not only displayed, but can be set using sliders created in the SmartDashboard in Test mode.
tr_tr: Aktüatörlere karşılık gelen değerler yalnızca görüntülenmez, ayrıca Test modunda SmartDashboard'da oluşturulan kaydırıcılar kullanılarak da ayarlanabilir.
