Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/smartdashboard/smartdashboard-intro.po
Languages: es_mx, tr_tr, zh_cn

source: SmartDashboard Introduction
es_mx: Introducción a SmartDashboard
tr_tr: SmartDashboard Tanıtımı
zh_cn: 智能仪表板介绍

source: The SmartDashboard is a Java program that will display robot data in real time. The SmartDashboard helps you with these things:
es_mx: La SmartDashboard es un programa de Java que proporciona datos del robot en tiempo real. La SmartDashboard te ayuda con las siguientes cosas:
tr_tr: SmartDashboard, robot verilerini gerçek zamanlı olarak görüntüleyen bir Java programıdır. SmartDashboard size şu konularda yardımcı olur:
zh_cn: SmartDashboard 是一个 Java 程序，可以实时显示机器人数据。SmartDashboard 可帮助您完成以下任务：

source: Displays robot data of your choice while the program is running. It can be displayed as simple text fields or more elaborately in many other display types like graphs, dials, etc.
es_mx: Proporciona los datos de su elección del robot mientras el código está ejecutándose. Pueden mostrase como simples recuadros de texto o en un tipo de visualización más elaborado como gráficas, diales, etc.
tr_tr: Program çalışırken seçtiğiniz robot verilerini görüntüler. Basit metin alanları olarak veya grafikler, kadranlar vb. Gibi diğer birçok görüntüleme türünde daha ayrıntılı olarak görüntülenebilir.
zh_cn: 在程序运行时显示您选择的机器人数据。它可以以更加简单的文本形式显示，也可以更精细地显示在许多其他显示类型中，如图形、表盘等。

source: Displays the state of the robot program such as the currently executing commands and the status of any subsystems
es_mx: Muestra el estado del robot, los comandos que se están ejecutando al momento y el estado de cualquier subsistema.
tr_tr: Halihazırda yürütülen komutlar ve herhangi bir alt sistemin durumu gibi robot programının durumunu görüntüler
zh_cn: 显示机器人程序的状态，比如当前执行的命令和任何子系统的状态

source: Displays buttons that you can press to cause variables to be set on your robot
es_mx: Muestra botones que puedes presionar para establecer variables en tu robot.
tr_tr: Değişkenlerin robotunuzda ayarlanmasını sağlamak için basabileceğiniz düğmeleri görüntüler
zh_cn: 显示按钮这样您可以按这些按钮在机器人上设置变量

source: Allows you to choose startup options on the dashboard that can be read by the robot program
es_mx: Permite elegir opciones de inicio en la dashboard que pueden leerse en el programa del robot.
tr_tr: Kontrol panelinde robot programı tarafından okunabilen başlangıç seçeneklerini seçmenize izin verir
zh_cn: 允许您在仪表板上选择可被机器人程序读取的启动选项

source: The displayed data is automatically formatted in real-time as the data is sent from the robot, but you can change the format or the display widget types and then save the new screen layouts to be used again later. And with all these options, it is still extremely simple to use. To display some data on the dashboard, simply call one of the SmartDashboard methods with the data and its name and the value will automatically appear on the dashboard screen.
es_mx: Los datos mostrados son automáticamente formateados en tiempo-real a medida que los datos son enviados desde el robot, pero usted puede cambiar el formato o la visualización de los widgets y después guardar los diseños nuevos de la pantalla para ser usados de nuevo más tarde. Con todas estas opciones, sigue siendo extremadamente fácil de usar. Para mostrar algunos datos en la dashboard, simplemente llama a uno de los métodos SmartDashboard con los datos y su nombre y el valor aparecerá automáticamente la pantalla de la dashboard.
tr_tr: Veriler robottan gönderildikçe görüntülenen veriler otomatik olarak gerçek zamanlı olarak biçimlendirilir, ancak biçimi veya ekran pencere öğesi türlerini değiştirebilir ve ardından yeni ekran düzenlerini daha sonra tekrar kullanmak üzere kaydedebilirsiniz. Ve tüm bu seçeneklerle, kullanımı hala son derece basittir. Gösterge tablosunda bazı verileri görüntülemek için, verilerle ve adıyla birlikte SmartDashboard yöntemlerinden birini çağırmanız yeterlidir; değer otomatik olarak gösterge tablosu ekranında görünecektir.
zh_cn: 当数据从机器人发送时，显示的数据将自动实时格式化，但您可以更改格式或显示小部件类型，然后保存新的屏幕布局，以便以后再次使用。有了这些选项，它仍然非常容易使用。要在仪表板上显示某些数据，只需使用数据及其名称调用 SmartDashboard 方法之一，值将自动显示在仪表板屏幕上。

source: Installing the SmartDashboard
es_mx: Instalar la SmartDashboard
tr_tr: SmartDashboard'u Kurma
zh_cn: 安装 SmartDashboard

source: The SmartDashboard is packaged with the WPILib Installer and can be launched directly from the Driver Station by selecting the **SmartDashboard** button on the Setup tab.
es_mx: La SmartDashboard está empaquetada con el WPILib Installer y puede ser iniciada directamente desde la Driver Station al seleccionar el botón **SmartDashboard** en la pestaña Setup.
tr_tr: SmartDashboard, WPILib Yükleyici ile paketlenmiştir ve Kurulum sekmesindeki ** SmartDashboard ** düğmesi seçilerek doğrudan Sürücü İstasyonundan başlatılabilir.
zh_cn: SmartDashboard 与 WPILib 安装程序一起打包，通过选择 Setup 上的**SmartDashboard** 按钮，可以直接从驱动程序站启动。

source: Configuring the Team Number
es_mx: Configurar el número de equipo
tr_tr: Takım Numarasını Yapılandırma

source: The first time you launch the SmartDashboard you should be prompted for your team number. To change the team number after this: click **File > Preferences** to open the Preferences dialog. Double-click the box to the right of **Team Number** and enter your FRC\ |reg| Team Number, then click outside the box to save.
es_mx: La primera vez que inicie la SmartDashboard se le solicitará su número de equipo. Para cambiar el número de equipo después de esto: clic en **File > Preferences**, para abrir el cuadro de Preferencias. Doble clic en el cuadro a la derecha de **Team Number** e ingrese su número de equipo de FRC\ |reg|, después, dé clic afuera del cuadro para guardar.
tr_tr: SmartDashboard'u ilk kez başlattığınızda ekip numaranız sorulmalıdır. Bundan sonra takım numarasını değiştirmek için: Tercihler iletişim kutusunu açmak için **File > Preferences* 'e tıklayın. **Team Number-Takım Numarası** 'nın sağındaki kutuyu çift tıklayın ve FRC\|reg| Takım Numarası, ardından kaydetmek için kutunun dışına tıklayın.
zh_cn: 第一次启动 SmartDashboard 时，会提示您输入 SmartDashboard 的时间。要在此之后更改团队编号：单击 **File > Preferences** 打开首选项对话框。双击**Team Number**右边的框，输入您的 FRC\ |reg| 组号，然后在框外点击保存。

source: SmartDashboard will take a moment to configure itself for the team number, do not be alarmed.
es_mx: La SmartDashboard tardará un momento en configurarse por el número de equipo, no se alarme.
tr_tr: SmartDashboard'un kendisini takım numarası için yapılandırması biraz zaman alacaktır, alarma geçmeyin.
zh_cn: SmartDashboard 将花费一些时间为团队编号进行自我配置，请不要惊慌。

source: Setting a Custom NetworkTables Server Location
es_mx: Configuración de una ubicación personalizada de NetworkTables
tr_tr: Özel Bir NetworkTables Sunucu Konumu Ayarlama

source: By default, SmartDashboard will look for NetworkTables instances running on a connected RoboRIO, but it's sometimes useful to look for NetworkTables at a different IP address. To connect to SmartDashboard from a host other than the roboRIO, open SmartDashboard preferences under the ``File`` menu and in the ``Team Number`` field, enter the IP address or hostname of the NetworkTables host.
es_mx: De forma predeterminada, SmartDashboard buscará instancias de NetworkTables que se ejecuten en un RoboRIO conectado, pero a veces es útil buscar NetworkTables en una dirección IP diferente. Para conectarse a SmartDashboard desde un host que no sea roboRIO, abra las preferencias de SmartDashboard en el menú ``File`` y en el campo ``Team Number``, ingrese la dirección IP o el nombre del host de NetworkTables.
tr_tr: Varsayılan olarak SmartDashboard, bağlı bir RoboRIO üzerinde çalışan NetworkTables örneklerini arayacaktır, ancak bazen farklı bir IP adresinde NetworkTable'ları aramak faydalı olabilir. RoboRIO dışındaki bir ana bilgisayardan SmartDashboard'a bağlanmak için, `` Dosya '' menüsü altında SmartDashboard tercihlerini açın ve `` Ekip Numarası '' alanına NetworkTables ana bilgisayarının IP adresini veya ana bilgisayar adını girin.
zh_cn: 默认情况下，SmartDashboard 将查找在已连接的 RoboRIO 上运行的NetworkTables 实例，但有时查找位于不同 IP 地址的 NetworkTables 很有用。要从 roboRIO以外的主机连接到 SmartDashboard，请打开 ``File`` 菜单下的，并在 ``Team Number`` 字段中输入 NetworkTables 主机的 IP 地址或主机名。

source: This option is incredibly useful for using SmartDashboard with :doc:`WPILib simulation </docs/software/wpilib-tools/robot-simulation/introduction>`. Simply add ``localhost`` to the ``Team Number`` field and SmartDashboard will detect your locally-hosted robot!
es_mx: Esta opción es increíblemente útil para usar SmartDashboard con :doc:`WPILib simulation </docs/software/wpilib-tools/robot-simulation/introduction>`. Simplemente agregue ``localhost`` al campo ``Team Number`` y SmartDashboard detectará su robot alojado localmente.
tr_tr: Bu seçenek, SmartDashboard'u aşağıdakilerle kullanmak için inanılmaz derecede kullanışlıdır: doc: `WPILib simülasyonu '. `` Takım Numarası '' alanına `` localhost '' eklemeniz yeterlidir; SmartDashboard yerel olarak barındırılan robotunuzu algılayacaktır!
zh_cn: 此选项对于将 SmartDashboard 与doc:`WPILib simulation </docs/software/wpilib-tools/robot-simulation/introduction>`。只需将 ``localhost`` 添加到 ``Team Number`` 字段，SmartDashboard 将检测到本地托管的机器人！

source: Locating the Save File
es_mx: Ubicar Save File
tr_tr: Kaydedilen Dosyayı Bulma
zh_cn: 确定保存文件

source: Users may wish to customize the save location of the SmartDashboard. To do this click the box next to **Save File** then browse to the folder where you would like to save the configuration. Files saved in the installation directories for the WPILib components will likely be overwritten on updates to the tools.
es_mx: Puede que desee personalizar la dirección de guardado de la SmartDashboard. Para hacer esto de click en el recuadro continuo a **Save File**, después seleccione la carpeta en la que le gustaría guardar la configuración. Los archivos guardados en los directorios de instalación de los componentes de WPILib, probablemente se sobrescribirán en actualizaciones a las herramientas.
tr_tr: Kullanıcılar SmartDashboard'un kaydetme konumunu özelleştirmek isteyebilir. Bunu yapmak için ** Dosyayı Kaydet ** seçeneğinin yanındaki kutuyu tıklayın ve ardından yapılandırmayı kaydetmek istediğiniz klasöre gidin. WPILib bileşenleri için kurulum dizinlerine kaydedilen dosyalar, araçlara yapılan güncellemelerde büyük olasılıkla üzerine yazılacaktır.
zh_cn: 用户可能希望自定义 SmartDashboard 的保存位置。要执行此操作，请单击 **Save File** 旁边的框，然后浏览到要保存配置的文件夹。保存在 WPILib 组件安装目录中的文件可能会在更新工具时被覆盖。

source: Adding a Connection Indicator
es_mx: Añadir un indicador de conexión
tr_tr: Bir Bağlantı Göstergesi Ekleme
zh_cn: 增加一个指示灯

source: It is often helpful to see if the SmartDashboard is connected to the robot. To add a connection indicator, select **View > Add > Connection Indicator**. This indicator will be red when disconnected and green when connected. To move or resize this indicator, select **View > Editable** to toggle the SmartDashboard into editable mode, then drag the center of the indicator to move it or the edges to resize. Select the **Editable** item again to lock it in place.
es_mx: Muchas veces es útil revisar si la SmartDashboard está conectada al robot. Para agregar un indicador de conexión, seleccione **View > Add > Connection Indicator**. El indicador será rojo cuando esté desconectado y verde cuando esté conectado. Para mover o modificar el tamaño del indicador, seleccione **View > Editable** para cambiar la SmartDashboard a modo editable, después arrastra el centro del indicador para moverlo, o las esquinas para cambiar su tamaño. Seleccione el objeto **Editable** de nuevo para ajustarlo en su lugar.
tr_tr: SmartDashboard'un robota bağlı olup olmadığını görmek genellikle yararlıdır. Bir bağlantı göstergesi eklemek için ** Görünüm> Ekle> Bağlantı Göstergesi ** seçeneğini seçin. Bu gösterge, bağlantı kesildiğinde kırmızı, bağlandığında yeşil olacaktır. Bu göstergeyi taşımak veya yeniden boyutlandırmak için, SmartDashboard'u düzenlenebilir moda geçirmek için ** Görünüm> Düzenlenebilir ** 'i seçin, ardından hareket ettirmek için göstergenin ortasını veya yeniden boyutlandırmak için kenarları sürükleyin. Yerine kilitlemek için ** Düzenlenebilir ** öğesini tekrar seçin.
zh_cn: 查看 SmartDashboard 是否已连接到机器人，通常会有帮助。如果要添加连接指示灯，选择 **View > Add > Connection Indicator**。该指示灯断开时为红色，接通时为绿色。选择 **View > Editable** ，将 SmartDashboard 切换到可编辑模式，然后拖动 SmartDashboard 的中心或边缘来移动或调整SmartDashboard 的大小。再次选择 **Editable** 项，将其锁定在适当的位置。

source: Adding Widgets to the SmartDashboard
es_mx: Añadir widgets a la SmartDashboard
tr_tr: SmartDashboard'a Widget Ekleme

source: Widgets are automatically added to the SmartDashboard for each "key" sent by the robot code. For instructions on adding robot code to write to the SmartDashboard see :doc:`Displaying Expressions from Within the Robot Program <displaying-expressions>`.
es_mx: Los Widgets se agregan automáticamente al SmartDashboard por cada “clave” enviada por el código del robot. Para instrucciones sobre como hacer que el código del robot escriba al SmartDashboard vea :doc:`Displaying Expressions from Within the Robot Program 1`.
tr_tr: Robot kodu tarafından gönderilen her "anahtar" için SmartDashboard'a otomatik olarak widget eklenir. SmartDashboard'a yazmak için robot kodu ekleme talimatları için bkz :doc:`Displaying Expressions from Within the Robot Program 1`.
zh_cn: 对于 robot 代码发送的每个 "key" ，小部件都会自动添加到 SmartDashboard 中。有关添加要写入 SmartDashboard 的 robot 代码的说明，请参阅：doc:`Displaying Expressions from the robot Program<displaying-expressions>`
