Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/smartdashboard/verifying-smartdashboard-*-working.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Verifying SmartDashboard is working
es_mx: Verificando que SmartDashboard está funcionando
fr_ca: Vérifier que SmartDashboard fonctionne
tr_tr: SmartDashboard'un çalıştığını doğrulama
zh_cn: 检测 “SmartDashboard” 是否在工作

source: Connection Indicator
es_mx: Indicador de conexión
fr_ca: Indicateur de connexion
tr_tr: Bağlantı Göstergesi
zh_cn: 连接指示灯

source: SmartDashboard will automatically include the connection status and IP address of the NetworkTables source in the title of the window.
es_mx: SmartDashboard incluirá automáticamente el estado de la conexión y la dirección IP de la fuente NetworkTables en el título de la ventana.
fr_ca: SmartDashboard inclura automatiquement l'état de la connexion et l'adresse IP de la source NetworkTables dans le titre de la fenêtre.
tr_tr: SmartDashboard, pencerenin başlığına NetworkTables kaynağının bağlantı durumunu ve IP adresini otomatik olarak aktaracaktır.
zh_cn: "SmartDashboard" 将在窗口标题中自动包含 "NetworkTable" 的连接状态和IP地址。

source: Connection Indicator Widget
es_mx: Widget de indicador de conexión
fr_ca: Widget indicateur de connexion
tr_tr: Bağlantı Göstergesi Widget'ı
zh_cn: 连接指示器小组件

source: SmartDashboard includes a connection indicator widget which will turn red or green depending on the connection to NetworkTables, usually provided by the roboRIO. For instructions to add this widget, look at :ref:`Adding a Connection Indicator <docs/software/wpilib-tools/smartdashboard/smartdashboard-intro:Adding a Connection Indicator>` in the SmartDashboard Intro.
es_mx: SmartDashboard incluye un widget indicador de conexión que se volverá rojo o verde dependiendo de la conexión a NetworkTables, generalmente proporcionada por roboRIO. Para obtener instrucciones para agregar este widget, consulte: :ref:`Añadiendo un indicador de conexión <docs/software/wpilib-tools/smartdashboard/smartdashboard-intro:Adding a Connection Indicator>` en la introducción de SmartDashboard.
fr_ca: SmartDashboard comprend un widget indicateur de connexion qui deviendra rouge ou vert en fonction de la connexion à NetworkTables, généralement fournie par le roboRIO. Pour obtenir des instructions sur l'ajout de ce widget, consultez :ref: `Ajout d'un indicateur de connexion <docs / software / wpilib-tools / smartdashboard / smartdashboard-intro: Ajout d'un indicateur de connexion>` dans SmartDashboard Intro.
tr_tr: SmartDashboard, genellikle roboRIO tarafından sağlanan NetworkTables bağlantısına bağlı olarak kırmızıya veya yeşile dönecek bir bağlantı göstergesi aracı içerir. Bu widget için ekleme talimatlarına SmartDashboard Giriş kısmında :ref:`Adding a Connection Indicator <docs/software/wpilib-tools/smartdashboard/smartdashboard-intro:Adding a Connection Indicator>` ulaşın.
zh_cn: SmartDashboard包含一个连接指示器小部件，该部件将根据roboRIO通常提供的与NetworkTables的连接而变为红色或绿色。有关添加此小部件的说明，请参阅SmartDashboard简介中关于如何添加连接指示器的部分：Adding a Connection Indicator <docs/software/wpilib-tools/smartdashboard/smartdashboard-intro:Adding a Connection Indicator>。

source: Robot Program Example
es_mx: Ejemplo de programa de robot
fr_ca: Exemple de programme de robot
tr_tr: Robot Programı Örneği
zh_cn: 机器人程序示例

source: This is a minimal robot program that writes a value to the SmartDashboard. It simply increments a counter 50 times per second to verify that the connection is working. However, to minimize bandwidth usage, NetworkTables by default will throttle the updates to 10 times per second.
es_mx: Este es un programa de robot mínimo que escribe un valor en el SmartDashboard. Simplemente incrementa un contador 50 veces por segundo para verificar que la conexión está funcionando. Sin embargo, para minimizar el uso de ancho de banda, NetworkTables de forma predeterminada acelerará las actualizaciones a 10 veces por segundo.
fr_ca: Il s'agit d'un programme de robot minimal qui écrit une valeur sur le SmartDashboard. Il incrémente simplement un compteur 50 fois par seconde pour vérifier que la connexion fonctionne. Cependant, pour minimiser l'utilisation de la bande passante, NetworkTables par défaut limitera les mises à jour à 10 fois par seconde.
tr_tr: Bu, SmartDashboard'a değer katan minimal bir robot programıdır. Basitçe bağlantının çalıştığını doğrulamak için bir sayacı saniyede 50 kez artırır. Bununla birlikte, bant genişliği kullanımını en aza indirmek için, NetworkTables varsayılan olarak güncellemeleri saniyede 10 kez yapar.
zh_cn: 这是一个可以向智能仪表盘写入值的机器人小程序。它仅会每秒将一个计数器的数值增加50以验证连接是否正常。但是，为了最大程度地减少带宽使用，默认情况下，"NetworkTables" 会将更新限制为每秒10次。

source: SmartDashboard Output for the Sample Program
es_mx: Salida de SmartDashboard para el programa de muestra
fr_ca: Sortie SmartDashboard pour l'exemple de programme
tr_tr: Örnek Program için SmartDashboard Çıktısı
zh_cn: 示例程序在智能仪表盘上的输出

source: The SmartDashboard display should look like this after about 6 seconds of the robot being enabled in Teleop mode. If it doesn't, then you need to check that the connection is correctly set up.
es_mx: La pantalla SmartDashboard debería verse así después de aproximadamente 6 segundos de que el robot se haya habilitado en el modo Teleop. Si no es así, debe verificar que la conexión esté configurada correctamente.
fr_ca: L'affichage du SmartDashboard devrait ressembler à ceci après environ 6 secondes d'activation du robot en mode Teleop. Si ce n'est pas le cas, vous devez vérifier que la connexion est correctement configurée.
tr_tr: SmartDashboard ekranı, robot Teleop modunda etkinleştirildikten yaklaşık 6 saniye sonra bu şekilde görünmelidir. Olmazsa, bağlantının doğru şekilde kurulup kurulmadığını kontrol etmeniz gerekir.
zh_cn: 当机器人以 "Teleop" 模式被启动大约6秒过后，智能仪表盘上的显示应当如图所示。如果不是如此，你应当检测是否是连接设置出现了问题。

source: Verifying the IP address in SmartDashboard
es_mx: Verificación de la dirección IP en SmartDashboard
fr_ca: Vérification de l'adresse IP dans SmartDashboard
tr_tr: SmartDashboard'da IP adresini doğrulama
zh_cn: 在智能仪表盘中验证IP地址

source: If the display of the value is not appearing, verify that the team number is correctly set as shown in this picture. The preferences dialog can be viewed by selecting ``File``, then ``Preferences``.
es_mx: Si la pantalla del valor no aparece, verifique que el número de equipo esté configurado correctamente como se muestra en esta imagen. El cuadro de diálogo de preferencias se puede ver seleccionando ``Archivo`` y luego `` Preferencias``.
fr_ca: Si l'affichage de la valeur n'apparaît pas, vérifiez que le numéro d'équipe est correctement défini comme indiqué sur cette image. La boîte de dialogue des préférences peut être visualisée en sélectionnant ``File``, puis ``Preferences``.
tr_tr: Değerin görüntüsü gözükmüyorsa, takım numarasının bu resimde gösterildiği gibi doğru şekilde ayarlandığını doğrulayın. Tercihler menüsü ``File`` ve ardından ``Preferences`` seçilerek görüntülenebilir.
zh_cn: 如果数值显示没有出现，请按照如图所示的方式检查队伍号是否设置正确。首选项对话框可以通过选择 "File" 下的 "Preference" 项以显示。

source: Verifying Program using OutlineViewer
es_mx: Verificación del programa mediante OutlineViewer
fr_ca: Vérification du programme à l'aide d'OutlineViewer
tr_tr: OutlineViewer kullanarak Programı Doğrulama
zh_cn: 使用 "OutlineViewer" 检测程序

source: You can verify that the robot program is generating SmartDashboard values by using the OutlineViewer program. This is a Java program, ``OutlineViewer.jar``, that is located in ``~/wpilib/YYYY/tools`` (where YYYY is the year and ~ is ``C:\Users\Public`` on Windows).
es_mx: Puede verificar que el programa del robot está generando valores de SmartDashboard mediante el programa OutlineViewer. Este es un programa java, ``OutlineViewer.jar``, que se encuentra en ``~/wpilib/YYYY/tools`` (donde YYYY es el año y ~ es ``C:\Users\Public`` en Windows).
fr_ca: Vous pouvez vérifier que le programme du robot génère des valeurs SmartDashboard à l'aide du programme OutlineViewer. Il s'agit d'un programme Java, `ʻOutlineViewer.jar``, qui se trouve dans ``~/wpilib/YYYY/tools`` (où YYYY est l'année et ~ est ``C: \ Users \ Public`` sous Windows ).
tr_tr: OutlineViewer programını kullanarak robot programının SmartDashboard değerleri oluşturduğunu doğrulayabilirsiniz. Bu, ``~/wpilib/YYYY/tools`` (burada YYYY yıl ve ~, Windows için ``C:\Users\Public`` demektir) içinde yer alan ``OutlineViewer.jar`` adlı bir Java programıdır.
zh_cn: 你可以使用 "OutlineViewer" 检查验证机器人程序是否正在生成智能仪表盘上的值。这是一个Java程序 "OutlineViewer.jar"，位于 "〜/ wpilib / YYYY / tools" 中 (其中YYYY是年份，而在Windows上，〜是C:\Users\Public)。

source: OutlineViewer is downloaded as part of the WPILib Offline Installer. For more information, see the :ref:`Windows/macOS/Linux installation guides <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`. In Visual Studio Code, press :kbd:`Ctrl+Shift+P` and type "WPILib" or click the WPILib logo in the top right to launch the WPILib Command Palette. Select :guilabel:`Start Tool`, and then select :guilabel:`OutlineViewer`.
es_mx: OutlineViewer se descarga como parte del instalador Offline de WPILib. Para más información vea :ref:`Windows/macOS/Linux installation guides <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`. En el Visual Studio, presione :kbd:`Ctrl+Shift+P` y escriba "WPILib" o haga clic en el logo de WPILib que se encuentra en la parte superior derecha para lanzar la paleta de comandos de WPILib. Seleccione :guilabel:`Start Tool` y después seleccione :guilabel:`OutlineViewer`.
tr_tr: OutlineViewer, WPILib Çevrimdışı Yükleyicinin bir parçası olarak indirilir. Daha fazla bilgi için bkz: :ref:`Windows/macOS/Linux installation guides <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`. Visual Studio Code'da, WPILib Komut Paletini başlatmak için kbd: `Ctrl + Shift + P` tuşlarına basın ve" WPILib "yazın veya sağ üstteki WPILib logosunu tıklayın. Guilabel: `Start Tool` seçin ve ardından guilabel:`OutlineViewer` seçin.
zh_cn: "OutlineViewer" 将作为WPILib脱机安装程序的一部分被下载。有关更多信息，请参阅 Windows / macOS / Linux 安装指南 <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>。在Visual Studio Code中，按Ctrl + Shift + P并键入 "WPILib"，或单击右上角的WPILib徽标以启动WPILib指令面板。选择 "启动工具"，然后选择 "OutlineViewer"。

source: In the "Server Location" box, enter your team number with no leading zeroes. Then, click ``Start``.
es_mx: En la casilla "Server Location", introduzca el número de su equipo sin ceros iniciales. Después, haga clic en ``Start``.
tr_tr: "Server Location-Sunucu Konumu" kutusuna takım numaranızı başında sıfır olmadan girin. Ardından, ``Start`` a tıklayın.
zh_cn: 在 "Server Location" 框中，输入您的团队编号，该编号不应以0开头。然后点击 "开始"。

source: Look at the second row in the table, the value ``SmartDashboard/Counter`` is the variable written to the SmartDashboard via NetworkTables. As the program runs you should see the value increasing (``41.0`` in this case). If you don't see this variable in the OutlineViewer, look for something wrong with the robot program or the network configuration.
es_mx: Mire la segunda fila de la tabla, el valor ``SmartDashboard/Counter`` es la variable escrita en SmartDashboard a través de NetworkTables. A medida que se ejecuta el programa, debería ver que el valor aumenta (``41.0`` en este caso). Si no ve esta variable en OutlineViewer, busque algún problema con el programa del robot o la configuración de la red.
fr_ca: Regardez la deuxième ligne du tableau, la valeur ``SmartDashboard/Counter`` est la variable écrite dans le SmartDashboard via NetworkTables. Au fur et à mesure que le programme s'exécute, vous devriez voir la valeur augmenter (``41.0`` dans ce cas). Si vous ne voyez pas cette variable dans OutlineViewer, recherchez un problème avec le programme du robot ou la configuration du réseau.
tr_tr: Tablodaki ikinci satıra bakın, ``SmartDashboard/Counter`` değeri, NetworkTables aracılığıyla SmartDashboard'a yazılan değişkendir. Program çalışırken değerin arttığını görmelisiniz (bu durumda ``41.0``). Bu değişkeni OutlineViewer'da görmüyorsanız, robot programında veya ağ yapılandırmasında yanlış bir şey arayın.
zh_cn: 查看表中的第二行，值 "SmartDashboard / Counter'" 是通过NetworkTables写入智能仪表盘的变量。在程序运行时，您应该看到该值正在增加（在这种情况下为 "41.0"）。如果您在 "OutlineViewer" 中看不到此变量，请检查机器人程序或网络的配置是否出现了问题。

source: OutlineViewer is downloaded as part of the WPILib Offline Installer. For more information, see the :ref:`Windows/macOS/Linux installation guides <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`. In Visual Studio Code, press :kbd:`Ctrl+Shift+P` and type WPILib or click the WPILib logo in the top right to launch the WPILib Command Palette and select **Start Tool**, then select **OutlineViewer**.
fr_ca: L'outil OutlineViewer est intégré dans le téléchargement de l’installateur hors ligne WPILib. Pour plus d’informations, voir les guides d’installation :ref:`Windows/macOS/Linux installation guides <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`. Sous Visual Studio Code, appuyez sur :kbd:`Ctrl+Shift+P` et tapez WPILib ou cliquez sur le logo WPILib en haut à droite pour lancer la palette de commande WPILib et sélectionnez **Start Tool**, puis sélectionnez **OutlineViewer**.

source: In the host box, enter your roboRIO hostname (``roboRIO-####.local`` where ``####`` is your team number with no leading zeroes). Then, click ``Start Client``.
fr_ca: Dans la zone hôte, entrez votre nom d'hôte roboRIO (``roboRIO-####.local`` où ``####`` est votre numéro d'équipe sans zéros précédent le numéro). Ensuite, cliquez sur ``Start Client``.
