Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-gradlerio/code-formatting.po
Languages: es_mx, fr_ca, zh_cn

source: Using a Code Formatter
es_mx: Uso de un formateador de código
fr_ca: Utilisation d’un formateur de code
zh_cn: 使用代码格式化程序

source: Code formatters exist to ensure that the style of code written is consistent throughout the entire codebase. This is used in many major projects; from Android to OpenCV. Teams may wish to add a formatter throughout their robot code to ensure that the codebase maintains readability and consistency throughout.
es_mx: Los formateadores de código existen para asegurar que el estilo del código escrito sea consistente en toda la base de código. Esto se utiliza en muchos proyectos importantes, desde Android hasta OpenCV. Los equipos pueden querer añadir un formateador en todo el código de su robot para asegurarse de que el código base mantiene la legibilidad y la coherencia en todo momento.
fr_ca: Les formateurs de code existent pour s’assurer que le style de code écrit est cohérent dans l’ensemble du code de base. Ceci est utilisé dans de nombreux grands projets; d’Android à OpenCV. Les équipes peuvent souhaiter ajouter un formateur dans tout leur code robot pour s’assurer que le code de base maintient la lisibilité et la cohérence tout le long.
zh_cn: 存在代码格式化程序，以确保编写的代码样式在整个代码库中保持一致。这在许多大型项目中都得到过应用。从Android到OpenCV。团队可能希望在整个机器人代码中添加格式化程序，以确保代码库始终保持可读性和一致性。

source: For this article, we will highlight using `Spotless <https://github.com/diffplug/spotless>`__ for Java teams and `wpiformat <https://github.com/wpilibsuite/styleguide/blob/main/wpiformat/README.rst>`__ for C++ teams.
es_mx: Para este artículo, destacaremos el uso de `Spotless <https://github.com/diffplug/spotless>`__ para equipos Java y `wpiformat <https://github.com/wpilibsuite/styleguide/blob/main/wpiformat/README.rst>`__ para equipos C++.
fr_ca: Pour cet article, nous mettons l'emphase sur l’utilisation de `Spotless <https://github.com/diffplug/spotless>`__ pour les équipes Java et `wpiformat <https://github.com/wpilibsuite/styleguide/blob/main/wpiformat/README.rst>`__ pour les équipes C++.
zh_cn: 在本文中，我们将重点介绍Java团队使用Spotpot <https://github.com/diffplug/spotless> __和C ++团队使用wpiformat <https://github.com/wpilibsuite/styleguide/blob/main/wpiformat/README.rst>__。

source: Spotless
zh_cn: 一尘不染

source: Configuration
es_mx: Configuración
zh_cn: 配置

source: Necessary ``build.gradle`` changes are required to get Spotless functional. In the ``plugins {}`` block of your ``build.gradle``, add the Spotless plugin so it appears similar to the below.
es_mx: Es necesario realizar los cambios necesarios en ``build.gradle`` para que Spotless sea funcional. En el bloque ``plugins {}`` de tu ``build.gradle``, añade el plugin Spotless para que aparezca de forma similar a la siguiente.
fr_ca: Des modifications ``build.gradle`` nécessaires sont requises pour que Spotless soit fonctionnel. Dans le bloc ``plugins {}`` de votre ``build.gradle``, ajoutez le plugin Spotless de sorte qu’il semble similaire à celui apparaissant ci-dessous.
zh_cn: 为了实现Spotless功能，需要进行必要的build.gradle更改。在build.gradle的plugins {}块中，添加Spotless插件，使其看起来类似于以下内容。

source: Then ensure you add a required ``spotless {}`` block to correctly configure spotless. This can just get placed at the end of your ``build.gradle``.
es_mx: A continuación, asegúrese de añadir un bloque requerido ``spotless {}`` para configurar correctamente spotless. Esto puede colocarse al final de tu ``build.gradle``.
fr_ca: Ensuite, assurez-vous d’ajouter un bloc ``spotless {}`` nécessaire pour configurer correctement Spotless. Celui-ci peut simplement être placé à la fin de votre fichier ``build.gradle``.
zh_cn: 然后确保您添加了一个必需的``spotless {}''块以正确配置一尘不染。这可以放在build.gradle的末尾。

source: Spotless can be ran using ``./gradlew spotlessApply`` which will apply all formatting options. You can also specify a specific task by just adding the name of formatter. An example is ``./gradlew spotlessmiscApply``.
es_mx: Spotless puede ser ejecutado usando ``./gradlew spotlessApply`` que aplicará todas las opciones de formato. También se puede especificar una tarea concreta añadiendo simplemente el nombre del formateador. Un ejemplo es ``./gradlew spotlessmiscApply``.
fr_ca: Spotless peut être exécuté en utilisant la commande ``./gradlew spotlessApply`` qui appliquera toutes les options de mise en forme. Vous pouvez également spécifier une tâche spécifique en ajoutant simplement le nom du formateur. Un exemple est ``./gradlew spotlessmiscApply``.
zh_cn: 可以使用../gradlew spotlessApply来运行Spotless，这将应用所有格式选项。您还可以仅通过添加格式化程序的名称来指定特定任务。一个示例是``./gradlew spotlessmiscApply''。

source: Spotless can also be used as a :doc:`CI check <robot-code-ci>`. The check is ran with ``./gradlew spotlessCheck``.
es_mx: Spotless también puede utilizarse como una comprobación :doc:`CI<robot-code-ci>`. La comprobación se ejecuta con ``./gradlew spotlessCheck``.
zh_cn: Spotless也可以用作CI检查<robot-code-ci>。使用``./gradlew spotlessCheck''运行检查。

source: Explanation of Options
es_mx: Explicación de las opciones
fr_ca: Explication des options
zh_cn: 选项说明

source: Each ``format`` section highlights formatting of custom files in the project. The ``java`` and ``groovyGradle`` are natively supported by spotless, so they are defined differently.
es_mx: Cada sección ``format`` destaca el formato de los archivos personalizados en el proyecto. Las secciones ``java`` y ``groovyGradle`` son soportadas nativamente por spotless, por lo que se definen de forma diferente.
fr_ca: Chaque section ``format`` met en évidence le formatage des fichiers personnalisés dans le projet. Les ``java`` et ``groovyGradle`` sont nativement soutenus par Spotless, de sorte qu’ils sont définis différemment.
zh_cn: 每个``格式''部分突出显示项目中自定义文件的格式。 Java和GroovyGradle本身受Spotless的支持，因此它们的定义有所不同。

source: Breaking this down, we can split this into multiple parts.
es_mx: Desglosando esto, podemos dividirlo en varias partes.
fr_ca: En décomposant ceci, on peut le diviser en plusieurs parties.
zh_cn: 分解这一点，我们可以将其分为多个部分。

source: Formatting Java
es_mx: Formateo de Java
fr_ca: Mise en forme de Java
zh_cn: 格式化Java

source: Formatting Gradle files
es_mx: Formateo de archivos Gradle
fr_ca: Mise en forme des fichiers Gradle
zh_cn: 格式化Gradle文件

source: Formatting XML files
es_mx: Formateo de archivos XML
fr_ca: Mise en forme des fichiers XML
zh_cn: 格式化XML文件

source: Formatting Miscellaneous files
es_mx: Formateo de archivos varios
fr_ca: Mise en forme de fichiers divers
zh_cn: 格式化其他文件

source: They are all similar, except for some small differences that will be explained. The below example will highlight the ``java {}`` block.
es_mx: Todos son similares, excepto por algunas pequeñas diferencias que se explicarán. El siguiente ejemplo destacará el bloque ``java {}``.
fr_ca: Ils sont tous similaires, à l’exception de quelques petites différences qui seront expliquées. L’exemple ci-dessous mettra l'emphase sur le bloc ``java {}``
zh_cn: 它们都是相似的，除了一些小的差异将被解释。下面的示例将突出显示“ java {}”块。

source: Let's explain what each of the options mean.
es_mx: Vamos a explicar qué significa cada una de las opciones.
fr_ca: Expliquons la signification de chacune des options.
zh_cn: 让我们解释每个选项的含义。

source: The above example tells spotless where our Java classes are and to exclude the ``build`` directory. The rest of the options are fairly self-explanatory.
es_mx: El ejemplo anterior le dice a spotless dónde están nuestras clases Java y que excluya el directorio ``build``. El resto de las opciones se explican por sí mismas.
fr_ca: L’exemple ci-dessus indique à Spotless où se trouvent nos classes Java et d’exclure le dossier ``build``. Les options restantes sont assez explicites.
zh_cn: 上面的例子告诉我们Java类在哪里，并排除了build目录。其余选项都不言自明。

source: ``toggleOffOn()`` adds the ability to have spotless ignore specific portions of a project. The usage looks like the following
es_mx: ``toggleOffOn()`` añade la posibilidad de que spotless ignore partes específicas de un proyecto. El uso es como el siguiente
fr_ca: ``toggleOffOn()`` ajoute à Spotless la possibilité d’ignorer des parties spécifiques d’un projet. L’utilisation ressemble à ce qui suit
zh_cn: toggleOffOn（）增加了使项目Spotless的能力。用法如下所示

source: ``googleJavaFormat()`` tells spotless to format according to the `Google Style Guide <https://google.github.io/styleguide/javaguide.html>`__
es_mx: ``googleJavaFormat()`` le dice a spotless que formatee según la `Guía de Estilo de Google <https://google.github.io/styleguide/javaguide.html>`__
fr_ca: ``googleJavaFormat()`` indique à Spotless de mettre en forme selon le `Guide de Style de Google <https://google.github.io/styleguide/javaguide.html>`__
zh_cn: ``googleJavaFormat（）``告诉Spotless地根据`Google样式指南<https://google.github.io/styleguide/javaguide.html>`__

source: ``removeUnusedImports()`` will remove any unused imports from any of your java classes
es_mx: ``removeUnusedImports()`` eliminará cualquier importación no utilizada de cualquiera de tus clases java
zh_cn: ``removeUnusedImports（）``将从您的任何Java类中删除所有未使用的导入

source: ``trimTrailingWhitespace()`` will remove any extra whitespace at the end of your lines
es_mx: ``trimTrailingWhitespace()`` eliminará cualquier espacio en blanco extra al final de las líneas
fr_ca: ``trimTrailingWhitespace()`` supprimera tout espace blanc supplémentaire à la fin de vos lignes
zh_cn: ``trimTrailingWhitespace（）``将删除行尾的所有多余空格

source: ``endWithNewline()`` will add a newline character to the end of your classes
es_mx: ``endWithNewline()`` añadirá un carácter de nueva línea al final de tus clases
fr_ca: ``endWithNewline()`` ajoutera un caractère newline à la fin de vos classes
zh_cn: ``endWithNewline（）``将在课程末尾添加换行符

source: In the ``groovyGradle`` block, there is a ``greclipse`` option. This is the formatter that spotless uses to format gradle files.
es_mx: En el bloque ``groovyGradle``, hay una opción ``greclipse``. Este es el formateador que spotless utiliza para formatear los archivos gradle.
fr_ca: Dans le bloc ``groovyGradle``, il existe une option ``greclipse``. C’est le formateur que Spotless utilise pour mettre en forme les fichiers gradle.
zh_cn: 在groovyGradle块中，有一个Greclipse选项。这是一尘不染的格式程序，用于格式化gradle文件。

source: Additionally, there is a ``eclipseWtp`` option in the ``xml`` block. This stands for "Gradle Web Tools Platform" and is the formatter to format ``xml`` files. Teams not using any XML files may wish to not include this configuration.
es_mx: Además, hay una opción ``eclipseWtp`` en el bloque ``xml``. Esto significa "Gradle Web Tools Platform" y es el formateador para formatear archivos ``xml``. Los equipos que no utilicen ningún archivo XML pueden desear no incluir esta configuración.
fr_ca: Additionnellement, il existe une option ``eclipseWtp`` dans le bloc ``xml``. Il s’agit de "Gradle Web Tools Platform" et est le formateur servant à mettre en forme les fichiers ``xml``. Les équipes qui n’utilisent pas de fichiers XML peuvent choisir de ne pas inclure cette configuration.
zh_cn: 另外，在xml块中有一个“ eclipseWtp”选项。这代表“ Gradle Web工具平台”，并且是格式化“ xml”文件的格式化程序。不使用任何XML文件的团队可能希望不包括此配置。

source: A full list of configurations is available on the `Spotless README <https://github.com/diffplug/spotless>`__
es_mx: Una lista completa de configuraciones está disponible en el `Spotless README <https://github.com/diffplug/spotless>`__
fr_ca: Une liste complète des configurations est disponible dans le fichier `Spotless README <https://github.com/diffplug/spotless>`__
zh_cn: 完整的配置列表位于`Spotless README <https://github.com/diffplug/spotless>`__

source: Issues with Line Endings
es_mx: Problemas con los finales de línea
fr_ca: Problèmes avec les fins de ligne
zh_cn: 线尾问题

source: Spotless will attempt to apply line endings per-OS, which means Git diffs will be constantly changing if two users are on different OSes (Unix vs Windows). It's recommended that teams who contribute to the same repository from multiple OSes utilize a ``.gitattributes`` file. The following should suffice for handling line endings.
es_mx: Spotless intentará aplicar finales de línea por SO, lo que significa que los diffs de Git cambiarán constantemente si dos usuarios están en diferentes SOs (Unix vs Windows). Se recomienda que los equipos que contribuyen al mismo repositorio desde múltiples sistemas operativos utilicen un archivo ``.gitattributes``. Lo siguiente debería ser suficiente para manejar los finales de línea.
fr_ca: Spotless tentera d’appliquer des fins de ligne par OS, ce qui signifie que les commandes Git diffs changeront constamment si deux utilisateurs sont sur des OS différents (Unix vs Windows). Il est recommandé aux équipes qui contribuent au même dépôt à partir de plusieurs OS d’utiliser un fichier ``.gitattributes``. Ce qui suit devrait suffire pour la manipulation des fins de ligne.
zh_cn: Spotless将尝试在每个OS上应用行尾，这意味着如果两个用户使用不同的OS（Unix与Windows），则Git差异将不断变化。建议从多个操作系统向同一存储库做出贡献的团队使用.gitattributes文件。以下内容足以处理行尾。

source: wpiformat
zh_cn: WPI格式

source: Requirements
es_mx: Requerimientos:
fr_ca: Exigences
zh_cn: 要求

source: `Python 3.6 or higher <https://www.python.org/>`__
es_mx: `Python 3.6 o superior <https://www.python.org/>`__
fr_ca: `Python 3.6 ou ultérieur <https://www.python.org/>`__
zh_cn: `Python 3.6或更高版本<https://www.python.org/>`__

source: clang-format (included with `LLVM <https://releases.llvm.org/download.html>`__)
es_mx: clang-format (incluido en `LLVM <https://releases.llvm.org/download.html>`__)
zh_cn: clang格式（包含在`LLVM <https://releases.llvm.org/download.html>`__中）

source: Windows is not currently supported at this time! Installing LLVM with Clang **will** break normal robot builds if installed on Windows.
es_mx: Windows no está soportado en este momento. La instalación de LLVM con Clang **interrumpirá las compilaciones normales del robot si se instala en Windows.
zh_cn: 目前不支持Windows！如果将CVM安装在Windows上，则使用Clang安装LLVM会破坏正常的机器人版本。

source: You can install `wpiformat <https://github.com/wpilibsuite/styleguide/blob/main/wpiformat/README.rst>`__ by typing ``pip3 install wpiformat`` into a terminal or command prompt.
es_mx: Puede instalar `wpiformat <https://github.com/wpilibsuite/styleguide/blob/main/wpiformat/README.rst>`__ escribiendo ``pip3 install wpiformat`` en un terminal o en la línea de comandos.
fr_ca: Vous pouvez installer `wpiformat <https://github.com/wpilibsuite/styleguide/blob/main/wpiformat/README.rst>`__ en tapant ``pip3 install wpiformat`` dans un terminal ou une invite de commande.
zh_cn: 您可以通过在终端或命令提示符中键入“ pip3 install wpiformat”来安装`wpiformat <https://github.com/wpilibsuite/styleguide/blob/main/wpiformat/README.rst>`__。

source: Usage
es_mx: Uso
fr_ca: Utilisation
zh_cn: 用法

source: wpiformat can be ran by typing ``wpiformat`` in a console. This will format with ``clang-format``. Three configuration files are required (``.clang-format``, ``.styleguide``, ``.styleguide-license``). These must exist in the project root.
es_mx: wpiformat se puede ejecutar escribiendo ``wpiformat`` en una consola. Esto formateará con ``clang-format``. Se necesitan tres archivos de configuración (``.clang-format``, ``.styleguide``, ``.styleguide-license``). Estos deben existir en la raíz del proyecto.
fr_ca: wpiformat peut être couru en tapant ``wpiformat`` dans une console. La mise en forme sera effectuée à l'aide de ``clang-format``. Trois fichiers de configuration sont nécessaires (``.clang-format``, ``.styleguide``, ``.styleguide-license``). Ceux-ci doivent être présents dans la racine du projet.
zh_cn: 可以通过在控制台中键入``wpiformat''来运行wpiformat。这将使用``clang-format''格式化。需要三个配置文件（“ .clang-format”，“。styleguide”，“。styleguide-license”）。这些必须存在于项目根目录中。

source: ``.clang-format``: :download:`Download <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/.clang-format>`
fr_ca: ``.clang-format``: :download:`Télécharger <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/.clang-format>`
zh_cn: ``.clang-format''：：download：`下载<https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/.clang-format>`

source: ``.styleguide-license``: :download:`Download <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/.styleguide-license>`
fr_ca: ``.styleguide-license``: :download:`Télécharger <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/.styleguide-license>`
zh_cn: ``.styleguide-license''：：download：`下载<https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/.styleguide-license>`

source: An example styleguide is shown below:
es_mx: A continuación se muestra un ejemplo de guía de estilo:
fr_ca: Un exemple de guide de style est montré ci-dessous:
zh_cn: 样式指南示例如下所示：

source: Teams can adapt ``.styleguide`` and ``.styleguide-license`` however they wish. It's important that these are not deleted, as they are required to run wpiformat!
es_mx: Los equipos pueden adaptar ``.styleguide`` y ``.styleguide-license`` como quieran. ¡Es importante que no se eliminen, ya que son necesarios para ejecutar wpiformat!
fr_ca: Les équipes peuvent adapter ``.styleguide`` et ``.styleguide-license`` comme elles le souhaitent. Il est important que ceux-ci ne sont pas supprimés, car ils sont requis pour exécuter wpiformat!
zh_cn: 团队可以根据需要调整.styleguide和.styleguide-license。重要的是不要删除它们，因为它们是运行wpiformat所必需的！

source: You can turn this into a :doc:`CI check <robot-code-ci>` by running ``git --no-pager diff --exit-code HEAD``. It can be configured with a ``.clang-format`` configuration file. An example configuration file is provided below.
es_mx: Puedes convertir esto en una comprobación :doc:`CI <robot-code-ci>`ejecutando ``git --no-pager diff --exit-code HEAD``. Se puede configurar con un archivo de configuración ``.clang-format``. A continuación se proporciona un archivo de configuración de ejemplo.
zh_cn: 您可以通过运行git --no-pager diff --exit-code HEAD将其转换为CI检查<robot-code-ci>。可以使用.clang-format配置文件进行配置。下面提供了示例配置文件。

source: Below is an example GitHub Actions check that uses wpiformat
es_mx: A continuación se muestra un ejemplo de comprobación de acciones de GitHub que utiliza wpiformat
zh_cn: 以下是使用wpiformat的GitHub Actions检查示例

source: Running Spotless
es_mx: Ejecutar Spotless
fr_ca: Exécution de Spotless
