Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-gradlerio/external-libraries.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Using External Libraries with Robot Code
es_mx: Uso de bibliotecas externas con el código del robot
fr_ca: Utilisation de librairies externes avec le code du robot
tr_tr: Robot Koduyla Harici Kitaplıklar Kullanma
zh_cn: 通过机器人代码使用外部库

source: Using external libraries may have unintended behavior with your robot code! It is not recommended unless you are aware of what you are doing!
es_mx: El uso de bibliotecas externas puede tener un comportamiento no deseado con el código de su robot. No se recomienda a menos que sea consciente de lo que está haciendo.
fr_ca: L’utilisation de librairies externes peut avoir un comportement inattendue avec votre code robot! Il n’est pas recommandé à moins que vous ne sachiez ce que vous faites!
tr_tr: Harici kitaplıkları kullanmak, robot kodunuzla istenmeyen davranışlara neden olabilir! Ne yaptığınızın farkında değilseniz tavsiye edilmez!
zh_cn: 使用外部库可能会对您的机器人代码产生意想不到的行为！除非您知道自己在做什么，否则不建议这样做！

source: Often a team might want to add external Java or C++ libraries for usage with their robot code. This article highlights adding Java libraries to your Gradle dependencies, or the options that C++ teams have.
es_mx: A menudo un equipo puede querer añadir librerías externas Java o C++ para utilizarlas con su código de robot. Este artículo destaca la adición de bibliotecas Java a sus dependencias de Gradle, o las opciones que tienen los equipos de C++.
fr_ca: Souvent, une équipe peut vouloir ajouter des librairies externes Java ou C++ pour une utilisation avec son code robot. Cet article met l'emphase sur l’ajout de librairies Java à vos dépendances Gradle, ou les options disponibles pour les équipes C++.
tr_tr: Genellikle bir ekip, robot kodlarıyla kullanım için harici Java veya C++ kitaplıkları eklemek isteyebilir. Bu makale, Gradle bağımlılıklarınıza Java kitaplıkları eklemeyi veya C++ ekiplerinin sahip olduğu seçenekleri vurgulamaktadır.
zh_cn: 通常，团队可能希望添加外部Java或C ++库，以用于其机器人代码。本文重点介绍将Java库添加到您的Gradle依赖项或C ++团队具有的选项。

source: Any external dependencies that rely on native libraries (JNI) are likely not going to work.
es_mx: Cualquier dependencia externa que dependa de bibliotecas nativas (JNI) probablemente no va a funcionar.
fr_ca: Toutes les dépendances externes qui dépendent des librairies natives (JNI) ne fonctionneront probablement pas.
tr_tr: Yerel kitaplıklara (JNI) dayanan herhangi bir dış bağımlılık muhtemelen çalışmayacaktır.
zh_cn: 任何依赖于本机库（JNI）的外部依赖关系都可能无法正常工作。

source: Java is quite simple to add external dependencies. You simply add the required ``repositories`` and ``dependencies``.
es_mx: En Java es bastante sencillo añadir dependencias externas. Basta con añadir los ``repositorios`` y las ``dependencias`` necesarias.
fr_ca: Il est assez simple d'ajouter des dépendances externes avec Java. Il vous suffit d’ajouter les ``repositories`` (référentiels) et les ``dependencies`` (dépendances) requises.
tr_tr: Java, harici bağımlılıklar eklemek için oldukça basittir. Sadece gerekli ``depoları`` ve ``bağımlılıkları`` eklemeniz yeterlidir.
zh_cn: Java添加外部依赖项非常简单。您只需添加所需的``存储库''和``依赖项''即可。

source: Robot projects by default do not have a ``repositories {}`` block in the ``build.gradle`` file. You will have to add this yourself. Above the ``dependencies {}`` block, please add the following:
es_mx: Los proyectos Robot por defecto no tienen un bloque ``repositorios {}` en el archivo ``build.gradle``. Tendrás que añadirlo tú mismo. Por encima del bloque ``dependencies {}``, añade lo siguiente:
fr_ca: Les projets de robot par défaut n’ont pas de bloc ``repositories {}`` dans le fichier ``build.gradle``. Vous devrez les ajouter vous-même. Au-dessus du bloc ``dependencies {}``, veuillez ajouter ce qui suit :
tr_tr: Robot projelerinin varsayıldığı gibi ``build.gradle`` dosyasında bir ``repositories {}`` bloğu yoktur. Bunu kendiniz eklemek zorunda kalacaksınız. ``dependencies {}`` bloğunun üstüne lütfen aşağıdakileri ekleyin:
zh_cn: 机器人项目默认情况下在build.gradle文件中没有repository {}块。您将必须自己添加。在“ dependencies {}”块上方，请添加以下内容：

source: ``mavenCentral()`` can be replaced with whatever repository the library you want to import is using. Now you have to add the dependency on the library itself. This is done by adding the necessary line to your ``dependencies {}`` block. The below example showcases adding Apache Commons to your Gradle project.
es_mx: ``mavenCentral()`` puede ser sustituido por cualquier repositorio que la biblioteca que quieres importar esté utilizando. Ahora tienes que añadir la dependencia de la propia biblioteca. Esto se hace añadiendo la línea necesaria a tu bloque de ``dependencias {}`. El siguiente ejemplo muestra la adición de Apache Commons a tu proyecto Gradle.
fr_ca: ``mavenCentral()`` peut être remplacé par n’importe quel référentiel que la librairie que vous souhaitez importer utilise. Maintenant, vous devez ajouter la dépendance à la librairie elle-même. Ceci est fait en ajoutant la ligne nécessaire à votre bloc ``dependencies {}``. L’exemple ci-dessous présente l’ajout d’Apache Commons à votre projet Gradle.
tr_tr: ``mavenCentral()``, içe aktarmak istediğiniz kitaplığın kullandığı herhangi bir depoyla değiştirilebilir. Şimdi bağımlılığı kütüphanenin kendisine eklemelisiniz. Bu, ``dependencies {}`` bloğunuza gerekli satırı ekleyerek yapılır. Aşağıdaki örnek, Gradle projenize Apache Commons eklemeyi göstermektedir.
zh_cn: 可以将mavenCentral（）替换为要导入的库使用的任何存储库。现在，您必须添加对库本身的依赖关系。这是通过在“ dependencies {}”块中添加必要的行来完成的。以下示例展示了如何将Apache Commons添加到您的Gradle项目中。

source: Now you run a build and ensure the dependencies are downloaded. Intellisense may not work properly until a build is ran!
es_mx: Ahora ejecute una compilación y asegúrese de que las dependencias se descargan. Es posible que Intellisense no funcione correctamente hasta que se ejecute una compilación.
fr_ca: Maintenant, vous lancez une compilation et assurez-vous que les dépendances sont téléchargées. Intellisense peut ne pas fonctionner correctement jusqu’à ce qu’une compilation soit en cours d’exécution!
tr_tr: Şimdi bir yapı çalıştırıyorsunuz ve bağımlılıkların indirildiğinden emin oluyorsunuz. Bir yapı çalıştırılana kadar Intellisense düzgün çalışmayabilir!
zh_cn: 现在，您运行一个构建并确保已下载依赖项。在运行构建之前，Intellisense可能无法正常工作！

source: Adding C++ dependencies to your robot project is non-trivial due to needing to compile for the roboRIO. You have a couple of options.
es_mx: Añadir dependencias de C++ a tu proyecto de robot no es trivial debido a la necesidad de compilar para el roboRIO. Tienes un par de opciones.
fr_ca: L’ajout de dépendances C++ à votre projet de robot n’est pas une tâche triviale en raison de la nécessité de compiler pour le roboRIO. Vous avez deux options.
tr_tr: Robot projenize C++ bağımlılıkları eklemek, roboRIO için derlemeye ihtiyaç duyması nedeniyle önemsiz değildir. Birkaç seçeneğin var.
zh_cn: 由于需要为roboRIO进行编译，因此向您的机器人项目中添加C ++依赖项并非易事。您有两种选择。

source: Copy the source code of the wanted library into your robot project.
es_mx: Copie el código fuente de la biblioteca deseada en su proyecto de robot.
fr_ca: Copiez le code source de la librairie souhaitée dans votre projet de robot.
tr_tr: İstediğiniz kitaplığın kaynak kodunu robot projenize kopyalayın.
zh_cn: 将所需库的源代码复制到您的机器人项目中。

source: Use the `vendordep template <https://github.com/wpilibsuite/vendor-template>`__ as an example and create a vendordep.
es_mx: Utilice la `vendordep template <https://github.com/wpilibsuite/vendor-template>`__ como ejemplo y crear un vendordep.
fr_ca: Utilisez le `modèle vendordep <https://github.com/wpilibsuite/vendor-template>`__ comme exemple et créez un vendordep.
tr_tr: Örnek olarak `satıcı dep şablonunu <https://github.com/wpilibsuite/vendor-template>`__ kullanın ve bir satıcı departmanı oluşturun.
zh_cn: 以`vendordep模板<https://github.com/wpilibsuite/vendor-template>`__为例，并创建一个vendordep。

source: Copying Source Code
es_mx: Copiar el código fuente
fr_ca: Copie du code source
tr_tr: Kaynak Kodu Kopyalama
zh_cn: 复制源代码

source: Simply copy the necessary source and/or headers into your robot project. You can then configure any necessary platform args like below:
es_mx: Simplemente copie el código fuente y/o las cabeceras necesarias en su proyecto de robot. A continuación, puede configurar los argumentos de plataforma necesarios como se indica a continuación:
fr_ca: Il vous suffit de copier la source et/ou les en-têtes nécessaires dans votre projet de robot. Vous pouvez alors configurer toutes les args plate-forme nécessaires comme ci-dessous:
tr_tr: Gerekli kaynağı ve/veya başlıkları robot projenize kopyalamanız yeterlidir. Daha sonra aşağıdaki gibi gerekli platform argümanlarını yapılandırabilirsiniz:
zh_cn: 只需将必要的源代码和/或标题复制到您的机器人项目中。然后，您可以配置任何必要的平台参数，如下所示：

source: Creating a Vendordep
es_mx: Creación de un Vendordep
fr_ca: Création d’un Vendordep
tr_tr: Bir Satıcı Departmanı Oluşturma
zh_cn: 创建一个Vendordep

source: Please follow the instructions in the `vendordep repository <https://github.com/wpilibsuite/vendor-template>`__.
es_mx: Siga las instrucciones del `vendordep repository <https://github.com/wpilibsuite/vendor-template>`__.
fr_ca: Veuillez suivre les instructions dans `le référentiel vendordep <https://github.com/wpilibsuite/vendor-template>`__.
tr_tr: Lütfen `vendordep deposu <https://github.com/wpilibsuite/vendor-template>`__ içindeki talimatlara uyun.
zh_cn: 请按照“ vendordep存储库<https://github.com/wpilibsuite/vendor-template>” __中的说明进行操作。
