Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-gradlerio/gradlew-tasks.po
Languages: fr_ca

source: Gradlew Tasks
fr_ca: Tâches Gradlew

source: This article aims to highlight the gradle commands supported by the WPILib team for user use. These commands can be viewed by typing ``./gradlew tasks`` at the root of your robot project. Not all commands shown in ``./gradlew tasks`` and unsupported commands will not be documented here.
fr_ca: Cet article vise à mettre l'emphase sur les commandes gradle prises en charge par l’équipe WPILib pour une utilisation par l’utilisateur. Ces commandes peuvent être visualisées en tapant ``./gradlew tasks`` à la racine de votre projet de robot. Toutes les commandes affichées dans ``./gradlew tasks`` ne seront pas documentées ici, de même que les commandes qui ne sont pas prises en charge.

source: Build tasks
fr_ca: Tâches Build (Compilation)

source: ``./gradlew build`` - Assembles and tests this project. Useful for prebuilding your project without deploying to the roboRIO. ``./gradlew clean`` - Deletes the build directory.
fr_ca: ``./gradlew build`` - Assemble et teste ce projet. Utile pour pré-compiler votre projet sans le déployer sur le roboRIO. ``./gradlew clean`` - Supprime le répertoire build.

source: CompileCommands tasks
fr_ca: Tâches CompileCommands

source: ``./gradlew generateCompileCommands`` - Generate compile_commands.json. This is a configuration file that is supported by many Integrated Development Environments.
fr_ca: ``./gradlew generateCompileCommands`` - Génère compile_commands.json. Il s’agit d’un fichier de configuration pris en charge par de nombreux Environnements de Développement Intégré.

source: EmbeddedTools tasks
fr_ca: Tâches EmbeddedTools

source: ``./gradlew deploy`` - Deploy all artifacts on all targets. This will deploy your robot project to the available targets (IE, roboRIO).
fr_ca: ``./gradlew deploy`` - Déployez tous les artefacts sur toutes les cibles. Cela permettra de déployer votre projet de robot sur les cibles disponibles (IE, roboRIO).

source: ``./gradlew discoverRoborio`` - Determine the address(es) of target RoboRIO. This will print out the IP address of a connected roboRIO.
fr_ca: ``./gradlew discoverRoborio`` - Détermine l’adresse ou les adresses du RoboRIO cible. Cela imprimera l’adresse IP d’un roboRIO connecté.

source: GradleRIO tasks
fr_ca: Tâches GradleRIO

source: ``./gradlew downloadAll`` - Download all dependencies that may be used by this project
fr_ca: ``./gradlew downloadAll`` - Télécharge toutes les dépendances qui peuvent être utilisées par ce projet

source: ``./gradlew $TOOL$`` - Runs the tool ``$TOOL$`` (Replace ``$TOOL$`` with the name of the tool. IE, Glass, Shuffleboard, etc)
fr_ca: ``./gradlew $TOOL$`` - Exécute l'outil ``$TOOL$`` (Remplace ``$TOOL$`` par le nom de l'outil. IE, Glass, Shuffleboard, etc)

source: ``./gradlew $TOOL$Install`` - Installs the tool ``$TOOL$`` (Replace ``$TOOL$`` with the name of the tool. IE, Glass, Shuffleboard, etc)
fr_ca: ``./gradlew $TOOL$Install`` - Installe l'outil ``$TOOL$`` (Replace ``$TOOL$`` avec le nom de l'outil. IE, Glass, Shuffleboard, etc)

source: ``./gradlew InstallAllTools`` - Installs all available tools. This excludes the development environment such as VSCode. It's the users requirement to ensure the required dependencies (Java) is installed. Only recommended for advanced users!
fr_ca: ``./gradlew InstallAllTools`` - Installe tous les outils disponibles. Cela exclut l’environnement de développement tel que VSCode. Les utilisateurs doivent s’assurer que les dépendances requises (Java) sont installées. Recommandé uniquement pour les utilisateurs avancés!

source: ``./gradlew riolog`` - Runs a console displaying output from the default RoboRIO (roborio)
fr_ca: ``./gradlew riolog`` - Exécute une console affichant la sortie du RoboRIO par défaut (roborio)

source: ``./gradlew simulateExternalCpp`` - Simulate External Task for native executable. Exports a JSON file for use by editors / tools
fr_ca: ``./gradlew simulateExternalCpp`` - Simule une tâche externe pour l’exécutable natif. Exporte un fichier JSON pour une utilisation par les éditeurs / outils

source: ``./gradlew simulateExternalJava`` - Simulate External Task for Java/Kotlin/JVM. Exports a JSON file for use by editors / tools
fr_ca: ``./gradlew simulateExternalJava`` - Simule une tâche externe pour Java/Kotlin/JVM. Exporte un fichier JSON pour une utilisation par les éditeurs / outils

source: ``./gradlew vendordep`` - Install vendordep JSON file from URL or local installation. See :doc:`/docs/software/vscode-overview/3rd-party-libraries`
fr_ca: ``./gradlew vendordep`` - Installe le fichier JSON vendordep à partir d’une URL ou d’une installation locale. Consulter :doc:`/docs/software/vscode-overview/3rd-party-libraries`
