Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-gradlerio/robot-code-ci.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Setting up CI for Robot Code using GitHub Actions
es_mx: Configurando un CI para Código de Robot usando Acciones GitHub
fr_ca: Configurer l'Intégration Continue pour votre code de robot en utilisant GitHub Actions
tr_tr: GitHub Eylemlerini Kullanarak Robot Kodu için CI kurmak
zh_cn: 使用GitHub Actions为机器人代码设置CI

source: An important aspect of working in a team environment is being able to test code that is pushed to a central repository such as GitHub. For example, a project manager or lead developer might want to run a set of unit tests before merging a pull request or might want to ensure that all code on the main branch of a repository is in working order.
es_mx: Un aspecto importante de trabajar en un equipo es ser capaz de probar el código que es enviado a una librería como GitHub. Por ejemplo, el director del proyecto o desarrollador principal podría ejecutar un grupo de unidades de prueba antes de fusionarla a una solicitud de extracción o podría querer asegurarse que todos los códigos en la rama dominante de una librería estén trabajando correctamente
fr_ca: Un aspect important du travail dans un environnement d’équipe est de pouvoir tester le code qui est poussé vers un dépôt central tel que GitHub. Par exemple, un gestionnaire de projet ou un développeur principal peut vouloir exécuter un ensemble de tests unitaires avant de fusionner sa contribution ou peut vouloir s’assurer que tout le code de la branche principale d’un dépôt est en bon état de fonctionnement.
tr_tr: Bir ekip ortamında çalışmanın önemli bir yönü, GitHub gibi merkezi bir depoya gönderilen kodu test edebilmektir. Örneğin, proje yöneticisi veya lider geliştirici, kodu birleştirmeden önce bir dizi birim testini çalıştırmak isteyebilir veya tüm kodun çalışır durumda olduğundan emin olmak isteyebilir.
zh_cn: 在团队环境中工作的一个重要方面是能够测试推送到像 GitHub 一样的中央存储库的代码。例如，项目经理或首席开发人员可能希望在合并拉取请求之前运行一组单元测试，或者可能想要确保存储库主分支上的所有代码都处于正常工作状态。

source: `GitHub Actions <https://github.com/features/actions>`_ is a service that allows for teams and individuals to build and run unit tests on code on various branches and on pull requests. These types of services are more commonly known as "Continuous Integration" services. This tutorial will show you how to setup GitHub Actions on robot code projects.
es_mx: `Acciones GitHub <https://github.com/features/actions>`_ es un servicio que permite a los equipos e individuos construyan y ejecuten pruebas de unidades en un código con varias ramas y solicitudes de extracción. Este tipo de servicios son comúnmente conocidos conocidos como servicios de “Continuous Integration”. Este tutorial le enseñará como preparar GitHub Actions en proyectos con códigos en robots.
fr_ca: `GitHub Actions <https://github.com/features/actions>`_ est un service qui permet aux équipes et aux individus de créer et d'exécuter des tests unitaires sur le code sur divers branches et sur les demandes de type pull Ces types de services sont plus communément appelés services «d'intégration continue», ou CI. Ce tutoriel vous montrera comment configurer des actions GitHub sur des projets de code de robot.
tr_tr: 'GitHub Eylemleri <https://github.com/features/actions>`_ ekiplerin ve bireylerin çekme isteklerinde çeşitli dallardaki kod üzerinde birim testleri oluşturmasına ve çalıştırmasına olanak tanıyan bir hizmettir. Bu tip servisler genel olarak "Continuous Integration-Sürekli Entegrasyon" hizmetleri şeklinde bilinir. Bu öğretici yazı size GitHub Aksiyonlarını robot kodu projelerinde nasıl kurulacağını göstericektir.
zh_cn: GitHub Actions <https://github.com/features/actions> _ 是一项服务，它允许团队和个人在各个分支上的代码以及请求请求上构建和运行单元测试。这些类型的服务通常称为“连续集成”服务。本教程将向你展示如何在机器人代码项目上设置 GitHub Actions 。

source: This tutorial assumes that your team's robot code is being hosted on GitHub. For an introduction to Git and GitHub, please see this :doc:`introduction guide </docs/software/basic-programming/git-getting-started>`.
es_mx: Este tutorial asume que el código del robot de tu equipo está alojado en GitHub. Para una introducción a Git y GitHub, por favor vea esta :doc:`guía de introducción</docs/software/basic-programming/git-getting-started>`.
fr_ca: Ce tutoriel suppose que le code robot de votre équipe est hébergé sur GitHub. Pour une introduction à Git et GitHub, s’il vous plaît consulter :doc:`introduction guide </docs/software/basic-programming/git-getting-started>`.
zh_cn: 本教程假定您团队的机器人代码托管在GitHub上。有关Git和GitHub的简介，请参见：doc：`入门指南</docs/software/basic-programming/git-getting-started>`。

source: Creating the Action
es_mx: Creando una acción
fr_ca: Création de l'action
tr_tr: Eylem oluşturma
zh_cn: 创建动作

source: The instructions for carrying out the CI process are stored in a YAML file. To create this, click on the "Actions" tab at the top of your repository. Then click on the "set up a workflow yourself" hyperlink.
es_mx: Las instrucciones para llevar a cabo el proceso de CI están almacenados en un archivo YAML. Para crearlo, dé click en “Actions” en la parte superior de su repositorio. Después dé click en hipervínculo de “set up a workflow yourself”.
fr_ca: Les instructions pour exécuter le processus CI sont stockées dans un fichier YAML. Pour le créer, cliquez sur l'onglet "Actions" en haut de votre référentiel de données. Cliquez ensuite sur l'hyperlien "set up a workflow yourself".
tr_tr: CI sürecini gerçekleştirme talimatları bir YAML dosyasında depolanır. Bunu oluşturmak için, deponun sağ üstünde bulunan "Actions_Eylemler" sekmesine tıklayın. Ardından "set up a workflow yourself-kendi başınıza bir iş akışı oluşturun" bağlantısına tıklayın.
zh_cn: 进行 CI 处理的指令存储在 YAML 文件中。为了创建动作，请单击存储库顶部的 “操作” 选项卡。然后单击 “自行设置工作流程” 超链接。

source: Setup a workflow yourself.
fr_ca: Configurez un flux de travail vous-même.

source: You will now be greeted with a text editor. Replace all the default text with the following:
es_mx: Ahora será recibido con un editor de texto. Reemplace todo el texto predeterminado con lo siguiente:
fr_ca: Vous allez maintenant être accueilli par un éditeur de texte. Remplacez tout le texte par défaut par ce qui suit:
tr_tr: Şimdi bir metin editörü ile karşılanacaksınız. Tüm varsayılan metni aşağıdakilerle değiştirin:
zh_cn: 你现在会看到一个文本编辑器。将所有默认文本替换为以下内容：

source: Then, save changes by clicking the "Start commit" button on the top-right corner of the screen. You can amend the default commit message if you wish to do so. Then, click the green "Commit new file" button.
es_mx: Después, guarde los cambios dando click en botón de “Start commit” en la esquina superior derecha de la pantalla. Puede modificar el mensaje predeterminado si lo desea. Después, de click en el botón verde de “Commit new file”.
fr_ca: Enregistrez ensuite les modifications en cliquant sur le bouton "Start commit" dans le coin supérieur droit de l'écran. Vous pouvez modifier le message de validation par défaut si vous le souhaitez. Cliquez ensuite sur le bouton vert "Commit new file".
tr_tr: Ardından, ekranın sağ üst köşesinde bulunan "Start commit-işlemeye başla" butonuna tıklayarak değişiklikleri kaydedin. İsterseniz varsayılan kaydetme mesajını düzenleyebilirsiniz. Sonrasında, "Commit new file-yeni dosya işle" yeşil butonuna tıklayın.
zh_cn: 然后，通过单击屏幕右上角的 “开始提交” 按钮来保存更改。如果愿意，您可以修改默认提交消息。然后，单击绿色的 “提交新文件” 按钮。

source: Committing a new file.
fr_ca: Validation d'un nouveau fichier

source: GitHub will now automatically run a build whenever a commit is pushed to main or a pull request is opened. To monitor the status of any build, you can click on the "Actions" tab on the top of the screen.
es_mx: El GitHub ahora ejecutará automáticamente una construcción cada vez que un commit sea empujado al principal o se abra una solicitud pull. Para monitorear el estado de cualquier construcción, puedes hacer clic en la pestaña "Acciones" en la parte superior de la pantalla.
fr_ca: GitHub exécute désormais automatiquement une compilation à chaque fois qu’un commit est envoyé vers la branche principale ou qu'un pull request est ouvert. Pour surveiller l’état de toute compilation, vous pouvez cliquer sur l’onglet "Actions" en haut de l’écran.
tr_tr: Ana bilgisayarda bir işlem gerçekleştiğinde, GitHub artık her zaman otomatik olarak çalıştıracaktır. Herhangi bir yapının durumunu izlemek için ekranın üst kısmındaki " Actions -eylemler" sekmesine tıklayabilirsiniz.
zh_cn: 现在，无论何时将提交推送到 main 或打开 pull 请求，GitHub 都会自动运行构建。要监视任何构建的状态，你可以单击屏幕顶部的 “操作” 选项卡。

source: View of the actions tab
fr_ca: Affichage de l’onglet Actions

source: A Breakdown of the Actions YAML File
es_mx: Una descompostura del archivo Acciones YAML
fr_ca: Une analyse du fichier Actions YAML
tr_tr: Eylemler YAML Dosyasının Dökümü
zh_cn: Actions YAML 文件的细分

source: Here is a breakdown of the YAML file above. Although a strict understanding of each line is not required, some level of understanding will help you add more features and debug potential issues that may arise.
es_mx: Aquí hay un desglose del archivo YAML de arriba. Aunque no se requiere una comprensión estricta de cada línea, algún nivel de comprensión le ayudará a añadir más características y depurar posibles problemas que puedan surgir.
fr_ca: Voici une analyse du fichier YAML ci-dessus. Bien qu'une compréhension stricte de chaque ligne ne soit pas requise, un certain niveau de compréhension vous aidera à ajouter plus de fonctionnalités et à déboguer les problèmes potentiels qui pourraient survenir.
tr_tr: İşte yukarıdaki YAML dosyasının bir dökümü. Her satırın tam olarak anlaşılması gerekmese de, bir miktar anlayış, daha fazla özellik eklemenize ve ortaya çıkabilecek olası sorunları gidermenize yardımcı olacaktır.
zh_cn: 以下是 YAML 文件的细分。尽管不需要对每一行都有严格的了解，但是一定程度的了解将帮助您添加更多功能并调试可能出现的潜在问题。

source: This block of code dictates when the Action will run. Currently, the action will run when commits are pushed to main or when pull requests are opened against main.
es_mx: Este bloque de código dicta cuándo se ejecutará la Acción. Actualmente, la acción se ejecutará cuando las confirmaciones se empujen al main o cuando se abran peticiones pull contra la del main.
fr_ca: Ce bloc de code dicte quand l’Action s’exécutera. Actuellement, l’action s’exécute lorsque les commits sont poussés vers la branche principale ou lorsque les pull requests sont ouvertes par rapport à la branche principale.
tr_tr: Bu kod bloğu, eylemin ne zaman çalışacağını belirler. Şu anda eylem, işlem yürütüldüğünde yada istendiğinde çalışacaktır.
zh_cn: 此代码块指示操作将在何时运行。当前，该操作将在将提交推送到 main 或针对 main 打开拉取请求时运行。

source: Each Action workflow is made of a one or more jobs that run either sequentially (one after another) or in parallel (at the same time). In our workflow, there is only one "build" job.
es_mx: Cada flujo de trabajo de Action es hecho por uno o más trabajos ya sea que serán ejecutados (uno después de otro) o en paralelo (al mismo tiempo). En nuestro flujo de trabajo, solo hay un trabajo de “construcción”.
fr_ca: Chaque Action est composée d'une ou de plusieurs tâches qui s'exécutent séquentiellement (l'une après l'autre) ou en parallèle (en même temps). Dans notre exemple, il n'y a qu'une seule tâche "build".
tr_tr: Her aksiyonun iş akışı, sıralı olarak (birbiri ardına) veya paralel (aynı anda) çalışan bir veya daha fazla işten oluşur. İş akışımızda sadece bir "yapım" işi vardır.
zh_cn: 每个 Action 工作流程都由一个或多个作业组成，这些作业 (依次一个接一个) 运行或并行 (同时) 运行。在我们的工作流程中，只有一项 “构建” 工作。

source: We specify that we want the job to run on an Ubuntu virtual machine and in a virtualized `Docker container <https://www.docker.com/resources/what-container>`_ that contains the JDK, C++ compiler and roboRIO toolchains.
es_mx: Especificamos que queremos que el trabajo ejecute una máquina virtual de Ubuntu y en un `contenedor Docker <https://www.docker.com/resources/what-container>`_ que contiene JDK, compilador C++ y roboRIO toolchains.
fr_ca: Nous spécifions que nous voulons que la tâche s'exécute sur une machine virtuelle Ubuntu et dans un `Docker container <https://www.docker.com/resources/what-container>`_ qui contient le JDK, le compilateur C++ et les chaînes de compilation roboRIO .
tr_tr: Şunu belirtmek isteriz ki , işin bir Ubuntu sanal makinesinde ve sanallaştırılmış bir 'JDK, C ++ derleyici ve roboRIO araç zincirleri içeren bir Docker konteynerinde <https://www.docker.com/resources/what-container>`_ çalışmasını istiyoruz.
zh_cn: 我们指定希望工作在 Ubuntu 虚拟机上和虚拟化的 Docker 容器<https://www.docker.com/resources/what-container> _中运行，该容器包含 JDK ，C ++ 编译器和 roboRIO 工具链。

source: Each job has certain steps that will be executed. This job has three steps. The first step involves checking out the repository to access the robot code. The second step involves giving the virtual machine permission to execute gradle tasks using ``./gradlew``. The final step runs ``./gradlew build`` to compile robot code and run any unit tests.
fr_ca: Chaque tâche comporte certaines étapes qui seront exécutées. Ce travail comporte trois étapes. La première étape consiste à extraire le référentiel de données pour accéder au code du robot. La deuxième étape consiste à donner à la machine virtuelle l'autorisation d'exécuter des tâches gradle à l'aide de ``./Gradlew``. La dernière étape exécute ``./gradlew build`` pour compiler le code du robot et exécuter tous les tests unitaires.
tr_tr: Her işin yürütülecek belirli adımları vardır. Bu işin üç adımı vardır. İlk adım, robot koduna erişmek için depoyu kontrol etmeyi içerir. İkinci adım, sanal makineye “. /gradlew '' kullanarak kademeli görevleri yürütme izni vermeyi içerir. Son adım, robot kodunu derlemek ve herhangi bir birim testini çalıştırmak için “./gradlew build '' çalıştırır.
zh_cn: 每个工作都有某些将要执行的步骤。这项工作分为三个步骤。第一步涉及检出存储库以访问机器人代码。第二步涉及授予虚拟机使用 ``./ gradlew`` 执行 gradle 任务的权限。最后一步运行 ``./gradlew build`` 来编译机器人代码并运行任何单元测试。

source: Adding a Build Status Badge to a README.md File
es_mx: Agregando un Distintivo de estatus de construcción a un archivo README.md
fr_ca: Ajout d'un Build Status Badge à un fichier README.md
tr_tr: README.md dosyasına Yapı Durum işareti ekleme
zh_cn: 将构建状态标志添加到 README.md 文件

source: It is helpful to add a CI status badge to the top of your repository's README file to quickly check the status of the latest build on main. To do this, click on the "Actions" tab at the top of the screen and select the "CI" tab on the left side of the screen. Then, click on the "Create status badge" button on the top right and copy the status badge Markdown code.
es_mx: Es útil agregar una etiqueta CI de estatus en la parte superior del archivo README de su repositorio para revisar rápidamente el estado de la última construcción en la rama principal. Para hacer esto, dé clic en “Actions” en la parte superior de la pantalla y seleccione “CI” en el lado izquierdo de la pantalla. Después, dé clic en el botón de “Create status badge” en la parte superior derecha y copie el código de Markdown de la etiqueta de estado.
fr_ca: Il est utile d’ajouter un badge d'état CI en haut du fichier README de votre dépôt pour vérifier rapidement l’état de la dernière version sur la principale. Pour ce faire, cliquez sur l’onglet "Actions" en haut de l’écran et sélectionnez l’onglet "CI" sur le côté gauche de l’écran. Cliquez ensuite sur le bouton "Create status badge" en haut à droite et copier le code Markdown du badge d’état.
tr_tr: Main üzerinde en son derlemenin durumunu hızlı bir şekilde kontrol etmek için deponuzun README dosyasının üstüne bir CI durum işareti eklemek yararlıdır. Bunu yapmak için, ekranın üst kısmındaki "Actions-eylemler" sekmesine tıklayın ve ekranın sol tarafındaki "CI" sekmesini seçin. Ardından, sağ üstteki "Create status badge-durum işareti oluştur" düğmesini tıklayın ve durum işareti Markdown kodunu kopyalayın.
zh_cn: 将 CI 状态标记添加到存储库的 README 文件的顶部非常有帮助，以快速检查 main 上最新版本的状态。为此，请单击屏幕顶部的 “操作” 选项卡，然后选择屏幕左侧的 “ CI” 选项卡。然后，点击右上角的“创建状态标记”按钮，然后复制状态徽章 Markdown 代码。

source: Where to click on "Copy status badge Markdown"
fr_ca: Où cliquer sur "Copy status badge Markdown"

source: Finally, paste the Markdown code you copied at the top of your README file, commit, and push your changes. Now, you should see the GitHub Actions status badge on your main repository page.
es_mx: Finalmente, pegue el código de Markdown que copió en la parte de arriba de su archivo README, asigne, y presione sus cambios. Ahora, debería de ver la etiqueta de estado de GitHub Actions en la página principal de su repositorio.
fr_ca: Enfin, collez le code Markdown que vous avez copié en haut de votre fichier README, validez et envoyez vos modifications. Maintenant, vous devriez voir le badge d'état Actions GitHub sur votre page de référentiel de données principale.
tr_tr: Son olarak, Kopyaladığınız Markdown kodunu README dosyanızın en üstüne yapıştırın, uygulayın ve değişikliklerinizi gönderin. Şimdi, ana depo sayfanızda GitHub Aksiyonları durum rozetini görmelisiniz.
zh_cn: 最后，将复制的 Markdown 代码粘贴到 README 文件的顶部，提交并推送更改。现在，你应该在主存储库页面上看到 GitHub Actions 状态标记。

source: A picture of the repository with the badge created.
fr_ca: Image du référentiel avec le badge créé.
