Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/machine-learning/adding-more-data.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Adding More Data
es_mx: Agregando más datos
fr_ca: Ajouter plus de données
tr_tr: Daha Fazla Veri Ekleme
zh_cn: 添加更多的数据

source: Unfortunately, this documentation is outdated and the methods described here are no longer functional. We are currently working on an a successor project and advise teams to research into a `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ solution in the meantime.
es_mx: Lamentablemente, esta documentación está obsoleta y los métodos descritos aquí ya no son funcionales. Actualmente estamos trabajando en un proyecto sucesor y aconsejamos a los equipos que investiguen una solución `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ por el momento.
fr_ca: Malheureusement, cette documentation est dépassée et les méthodes décrites ici ne sont plus fonctionnelles. Nous travaillons actuellement sur un projet successeur et conseillons aux équipes de rechercher une solution `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ entre-temps.
tr_tr: Ne yazık ki bu dokümantasyon güncelliğini yitirmiştir ve burada açıklanan yöntemler artık işlevsel değildir. Şu anda bir ardıl proje üzerinde çalışıyoruz ve ekiplere bu arada bir `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>` __ çözümü üzerinde araştırma yapmalarını tavsiye ediyoruz.
zh_cn: 不幸的是，该文档已过时，此处描述的方法不再起作用。我们目前正在进行一个后续项目，并建议团队同时研究`tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__解决方案。

source: These steps detail how to record a new video, upload it to Supervisely, and label the frames. You can skip this article if you want to use the WPILib dataset directly.
es_mx: Estos pasos detallan cómo grabar un nuevo vídeo, subirlo a Supervisely, y etiquetar los fotogramas. Puede saltarte este artículo si quiere usar el conjunto de datos de WPILib directamente.
fr_ca: Ces étapes détaillent comment enregistrer une nouvelle vidéo, la télécharger sur Supervately et étiqueter les images. Vous pouvez ignorer cet article si vous souhaitez utiliser directement l'ensemble de données WPILib.
tr_tr: Bu adımlar, yeni bir videonun nasıl kaydedileceğini, onu Supervisely'ye nasıl yükleyeceğinizi ve kareleri nasıl etiketleyeceğinizi ayrıntılarıyla anlatır. Doğrudan WPILib veri kümesini kullanmak istiyorsanız bu makaleyi atlayabilirsiniz.
zh_cn: 这些步骤详细的描述了如何录制一个新的视频，上传至Supervisely，并为框架标注标签。如果你想要直接使用WPILib的数据集，你可以选择跳过这篇文章。

source: If you cannot access Supervisely, you can use the WPILib dataset directly in later steps.
es_mx: Si no puede acceder a Supervisely, puede usar el conjunto de datos de WPILib directamente.
fr_ca: Si vous ne pouvez pas accéder à Supervately, vous pouvez utiliser directement l'ensemble des données WPILib dans les étapes ultérieures.
tr_tr: Supervisely'e erişemiyorsanız, WPILib veri kümesini doğrudan sonraki adımlarda kullanabilirsiniz.
zh_cn: 如果你无法访问Supervisely，在之后的步骤里你可以直接使用WPILib的数据集。

source: Why Add More Data
es_mx: ¿Por qué agregar más datos?
fr_ca: Pourquoi ajouter plus de données?
tr_tr: Neden Daha Fazla Veri Eklemelisiniz?
zh_cn: 为什么要添加更多的数据？

source: Terminology
es_mx: Terminología
fr_ca: Terminologie
tr_tr: Terminoloji
zh_cn: 术语

source: Raw Data - These are all the images we have provided.
es_mx: Datos Raw- Estos son todas las imágenes que hemos proporcionado.
fr_ca: Données brutes (Raw Data) - Ce sont toutes les images que nous avons fournies.
tr_tr: Raw Data - Ham Veriler - Sağladığımız tüm görüntüler bunlar.
zh_cn: 原始数据 — 包括我们提供的所有图像

source: Dataset - This is the subset of images we used to train the network. We created this subset by clicking on the 3 dots of the Raw Data workspace, then going to the menu item "Run Python Script" and selecting the script "Filter by tag" We then filled in the tag "Valid"
es_mx: Conjunto de datos - Este es el subconjunto de imágenes que utilizamos para entrenar la red. Creamos este subconjunto haciendo clic en los 3 puntos del espacio de trabajo de los datos brutos, y luego yendo a la opción de menú "Ejecutar el script de Python" y seleccionando el script "Filtrar por etiqueta" Luego rellenamos la etiqueta "Válido"
fr_ca: Ensemble de données (Dataset) - Il s'agit du sous-ensemble d'images que nous avons utilisé pour former le réseau. Nous avons créé ce sous-ensemble en cliquant sur les 3 points de l'espace de travail "Raw data", puis en allant dans l'élément de menu "Run Python Script" et en sélectionnant le script "Filter by tag". Ensuite, nous avons rempli le tag "Valid".
zh_cn: 数据集-这是我们用来训练网络的图像子集。我们通过单击Raw Data工作区的3个点来创建此子集，然后转到菜单项“运行Python脚本”并选择脚本“按标签过滤”，然后填充标签“有效”

source: Datasets are becoming increasingly important to companies. It has been said that Tesla now spends more time with datasets than it does with the software. It is hard to make driving decisions at 70 MPH without accurate object detection. Of interest, at this point in our legal system, you can not patent or copyright an image that is just a statement of fact, for instance a picture of the road or a ball. While Tesla may want to keep their dataset very proprietary, we are hoping that is not true with the FIRST community.
es_mx: Los Conjuntos de Datos son cada vez más importantes para las compañías. Se ha dicho que Tesla ahora pasa más tiempo con los conjuntos de datos que con el software. Es difícil tomar decisiones de conducción a 70 MPH sin una detección de objetos precisa. Es interesante que en este punto de nuestro sistema legal, no se puede patentar o registrar el copyright de una imagen que es sólo una declaración de hecho, por ejemplo una imagen de la carretera o un balón. Mientras que Tesla puede querer mantener su conjunto de datos muy patentados, esperamos que no sea cierto con la comunidad de FIRST.
fr_ca: Les ensembles de données sont de plus en plus importants pour les entreprises. Il a été dit que Tesla passe maintenant plus de temps avec les ensembles de données qu'avec le logiciel. Il est difficile de prendre des décisions de conduite à 70 MPH (110 kmh) sans détection précise des objets. Il est intéressant de noter qu'à ce stade de notre système juridique, vous ne pouvez pas breveter ou protéger une image qui n'est qu'une déclaration de fait, par exemple une photo de la route ou une balle. Bien que Tesla puisse vouloir garder son jeu de données très exclusif, nous espérons que ce n'est pas vrai avec la communauté FIRST.
tr_tr: Veri kümeleri şirketler için giderek daha önemli hale geliyor. Tesla'nın artık veri kümeleri ile yazılımdan daha fazla zaman harcadığı söylendi. Doğru nesne tespiti olmadan 70 mil hızla sürüş kararları vermek zordur. Hukuk sistemimizde bu noktasında ilgi çekici olan, örneğin yolun veya topun bir fotoğrafı gibi, sadece bir olgu ifadesi olan bir görüntünün patentini alamaz veya telif hakkını alamazsınız. Tesla, veri setini çok özel tutmak isteyebilir, ancak bunun FIRST topluluğu için doğru olmadığını umuyoruz.
zh_cn: 对各大公司来说，数据集正变得越来越重要。据称，特斯拉现在花在数据集上的时间比花在软件上的时间还要多。试想，在每小时70英里的速度下，没有精确的物体感知能力，系统将很难做出驾驶决定。有趣的是，在我们当前的法律体系中，你不能为仅仅是对事实进行描述的图像，例如一张道路的图片或一个球，申请专利或版权。虽然Tesla可能会想要使他们的数据集保持专有，但是我们不希望在FIRST社区里看到同样的事情。

source: For INFINITE RECHARGE we have provided over 4500 raw images. These images were taken on an actual field with a combination of still images from a camera, and frames from video that was taken.
es_mx: Para INFINITE RECHARGE hemos proporcionado cerca de 4500 imágenes raw. Estas imágenes fueron tomadas en la cancha real con una combinación de imágenes fijas de una cámara, y fotogramas de un video que fue tomado.
fr_ca: Pour INFINITE RECHARGE, nous avons fourni plus de 4500 images brutes. Ces images ont été prises sur un champ réel avec une combinaison d'images fixes d'une caméra et d'images de la vidéo qui a été prise.
tr_tr: INFINITE RECHARGE için 4500'den fazla ham görüntü sağladık. Bu görüntüler, bir kameradan gelen hareketsiz görüntülerin ve çekilen videodan karelerin bir kombinasyonu ile gerçek bir alanda çekildi.
zh_cn: 我们为无限充能提供了超过4500张原始图片。这些图像包括在实际场地上拍摄的图片，一些由静态相机拍摄的图片，以及一些截取自已拍摄的视频的图片。

source: When you look at the set of images we have labeled and marked as valid it makes a dataset of just over 550 images. We have left a lot of room for teams to do more with this dataset.
es_mx: Cuando miras el conjunto de imágenes que hemos etiquetado y marcado como válidas hace un conjunto de datos de poco más de 550 imágenes. Hemos dejado mucho espacio para que los equipos hagan más con este conjunto de datos.
fr_ca: Lorsque vous regardez l'ensemble d'images que nous avons étiquetées et marquées comme valides, cela crée un ensemble de données d'un peu plus de 550 images. Nous avons laissé beaucoup de place aux équipes pour en faire plus avec cet ensemble de données.
tr_tr: Geçerli olarak işaretlediğimiz ve etiketlediğimiz görseller kümesine baktığınızda, 550'den fazla görüntüden oluşan bir veri kümesi oluşturur. Takımların bu veri kümesiyle daha fazlasını yapmaları için bir çok yer bıraktık.
zh_cn: 当你查看这组图像时，你会发现已被我们标注过的图像只能构成一个包含超过550张图片的数据集。我们为各队伍处理这个数据集留下了充足的空间。

source: Let me describe some of the decisions we made in creating our dataset. First of all we have a number of images that are marked as valid but don’t have any POWER CELLS in them. It is important to have images of the space that POWER CELLS will show up in, but don’t have any POWER CELLS. This helps eliminate false positives in the world of space that we expect to see.
es_mx: Permítame describir algunas de las decisiones que hicimos al crear nuestro conjunto de datos. En primer lugar tenemos una serie de imágenes que están marcadas como válidas pero no tienen ninguna POWER CELLS en ella. Es importante tener imágenes del espacio en el que aparecerán las POWER CELLS, pero no tener ninguna POWER CELLS. Esto ayuda a eliminar los falsos positivos en el espacio que esperamos ver.
fr_ca: Permettez-moi de décrire certaines des décisions que nous avons prises lors de la création de notre ensemble de données. Tout d'abord, nous avons un certain nombre d'images qui sont marquées comme valides mais qui ne contiennent aucune CELLULE D'ÉNERGIE (en anglais, "Power Cell"). Il est important d’avoir des images de l’espace dans lequel ces dernières apparaîtront, mais sans aucune CELLULE D'ÉNERGIE. Cela aide à éliminer les faux positifs dans le monde des espaces que nous nous attendons à voir.
tr_tr: Veri setimizi oluştururken verdiğimiz bazı kararları açıklayayım. Öncelikle, geçerli olarak işaretlenmiş ancak içinde POWER CELLS bulunmayan birkaç görselimiz var. POWER CELLS'nin görüneceği, ancak POWER CELLS lerin olmadığı alanın görüntülerinin olması önemlidir. Bu, görmeyi beklediğimiz uzay dünyasındaki yanlış pozitifleri ortadan kaldırmaya yardımcı olur.
zh_cn: 让我描述一下我们在创建数据集时所做的一些决策。首先，我们有许多图像被标记为有效，但其中没有任何POWER CELLS。重要的是要具有将显示POWER CELLS的空间的图像，但没有任何POWER CELLS。这有助于消除我们期望看到的太空世界中的误报。

source: Second we picked a methodology for labeling POWER CELLS. We only labeled POWER CELLS that were clear and with the entire cell visible. Is this the best way to go about this? We don’t know for sure. We would have had to create a number of datasets and tried them many different ways in order to determine this. We felt what we created is has a good level of accuracy, but we do know we can find ways to make it see false positives.
es_mx: En segundo lugar, elegimos una metodología para etiquetar las POWER CELLS. Sólo etiquetamos POWER CELLS que estaban claras y con toda la célula visible. ¿Es esta la mejor manera de hacerlo? No lo sabemos con seguridad. Tendríamos que haber creado una serie de conjuntos de datos y probado de muchas maneras diferentes para determinar esto. Sentimos que lo que creamos tiene un buen nivel de precisión, pero sabemos que podemos encontrar maneras de hacer que vea falsos positivos.
fr_ca: Deuxièmement, nous avons choisi une méthodologie pour étiqueter les CELLULES D'ÉNERGIE. Nous n'avons étiqueté seulement que les CELLULES D'ÉNERGIE qui étaient claires et entièrement visible. Est-ce la meilleure façon de procéder? Nous ne savons pas avec certitude. Il aurait fallu créer un certain nombre d'ensembles de données et les avoir essayés de différentes manières pour le déterminer. Nous avons estimé que ce que nous avons créé a un bon niveau de précision, mais nous savons qu'il existe des moyens de lui faire voir de faux positifs.
tr_tr: İkinci olarak POWER CELLS etiketlemek için bir metodoloji seçtik. Sadece net olan ve hücrenin tamamı görünür olan POWER CELLS olarak etiketledik. Bunu yapmanın en iyi yolu bu mu? Kesin olarak bilmiyoruz. Bunu belirlemek için bir dizi veri kümesi oluşturmalı ve onları birçok farklı yoldan denemeliydik. Oluşturduğumuz şeyin iyi bir doğruluk seviyesine sahip olduğunu hissettik, ancak yanlış pozitifleri görmesini sağlayacak yollar bulabileceğimizi biliyoruz.
zh_cn: 其次，我们选择了标记POWER CELLS的方法。我们只标记了清晰且整个单元可见的POWER CELLS。这是解决此问题的最佳方法吗？我们不确定。为了确定这一点，我们将不得不创建许多数据集并尝试了许多不同的方法。我们认为我们创建的内容具有较高的准确性，但是我们知道我们可以找到方法使它看到误报。

source: We also only labeled a single class, POWER CELLS. Are there other elements or field features you might want to detect?
es_mx: También sólo etiquetamos una clase única, POWER CELLS. ¿Hay otros elementos o características de campo que quieras detectar?
fr_ca: Nous n'avons également étiqueté qu'une seule classe, soit: CELLULE D'ÉNERGIE. Y a-t-il d'autres éléments ou caractéristiques du terrain que vous aimeriez peut-être détecter?
tr_tr: Ayrıca sadece tek bir sınıfı POWER CELLS olarak etiketledik. Algılamak isteyebileceğiniz başka öğeler veya alan özellikleri var mı?
zh_cn: 我们还只标记了一个类，即POWER CELLS。您是否还需要检测其他元素或字段特征？

source: As you can tell from above there might be many reasons that you may want to modify our dataset or use more of the raw images.
es_mx: Como puede ver desde arriba, puede haber muchas razones por las que quiera modificar nuestro conjunto de datos o usar más imágenes raw.
fr_ca: Comme vous pouvez le voir ci-dessus, il peut y avoir de nombreuses raisons pour lesquelles vous souhaitez peut-être modifier notre ensemble de données ou utiliser davantage d'images brutes.
tr_tr: Yukarıdan da anlayabileceğiniz gibi, veri setimizi değiştirmek veya daha fazla ham görüntü kullanmak isteyebileceğiniz birçok neden olabilir.
zh_cn: 从上面可以看出，您可能有很多原因想要修改我们的数据集或使用更多原始图像。

source: Could you achieve higher accuracy, most likely. If you are already using the camera with ML, would it make sense to label other field shapes or symbols instead of using the retro reflective tape? We imagine so.
es_mx: ¿Podría lograr una mayor precisión? Lo más probable. Si ya estás usando la cámara con ML, ¿tendría sentido etiquetar otras formas de campo o símbolos en lugar de usar la cinta retro-reflectante? Nos imaginamos que sí.
fr_ca: Pourriez-vous obtenir une précision plus élevée? Très probablement. Si vous utilisez déjà une caméra avec ML, serait-il judicieux d'étiqueter d'autres formes de champ ou symboles au lieu d'utiliser le ruban rétro-réfléchissant? Nous l'imaginons.
tr_tr: Daha yüksek kesinlik elde edebilir misiniz? Büyük ihtimalle. Kamerayı ML ile zaten kullanıyorsanız, retro-reflective bant kullanmak yerine diğer alan şekillerini veya sembollerini etiketlemek mantıklı olur mu? Öyle hayal ediyoruz.
zh_cn: 您是否有可能获得更高的准确性？如果您已经在使用带有ML的相机，那么标记其他场形状或符号而不是使用复古反光带是否有意义？我们可以这样想。

source: To add another class, other than just POWER CELLS, click into the Raw Data workspace and at the top of the page there is a menu item for Classes. Also remember when labeling images to also Tag the image as Valid. Run the Valid filter again when you are ready to create your own dataset to train.
es_mx: Para agregar otra clase, que no sea sólo POWER CELLS, haga clic en el espacio de trabajo Raw Data y en la parte superior de la página hay un elemento de menú para las clases. También recuerde cuando etiqueten las imágenes para también Etiquetar la imagen como Válida. Ejecute el filtro Válido de nuevo cuando esté listo para crear su propio conjunto de datos para practicar.
fr_ca: Pour ajouter une autre classe, autre que CELLULES D'ÉNERGIE, cliquez dans l'espace de travail "Raw data" et en haut de la page, il y a un élément de menu pour les Classes. N'oubliez pas que lorsque vous étiquetez des images, vous devez également étiqueter l'image comme valide. Exécutez à nouveau le filtre valide lorsque vous êtes prêt à créer votre propre jeu de données à entraîner.
tr_tr: Sadece POWER CELLS dışında başka bir sınıf eklemek için, Raw Data çalışma alanına tıklayın ve sayfanın üst kısmında Sınıflar-classes için bir menü öğesi vardır. Ayrıca resimleri etiketlerken-tag, resmi de Valid olarak etiketlemeyi unutmayın. Eğitmek için kendi veri kümenizi oluşturmaya hazır olduğunuzda Valid filtresini tekrar çalıştırın.
zh_cn: 要添加除POWER CELLS之外的其他类，请单击Raw Data工作区，然后在页面顶部有一个Classes菜单项。还要记住在标记图像时也将图像标记为有效。准备创建自己的数据集进行训练时，请再次运行“有效”过滤器。

source: We wanted to provide you with a rich set of raw images and a good way to find power cells, but we also wanted to leave room for each team to be creative with their own solution.
es_mx: Queremos proporcionarle un conjunto de imágenes y una buena forma de encontrar power cells, pero también queremos dejar espacio para que cada equipo sea creativo y encuentren sus propias soluciones.
fr_ca: Nous voulions vous fournir un riche ensemble d'images brutes et un bon moyen de trouver des cellules de puissance, mais nous voulions également laisser la place à chaque équipe d'être créative avec sa propre solution.
tr_tr: Size zengin ham görüntüler seti ve güçlü hücreler bulmanın iyi bir yolunu sunmak istedik, ancak her ekibin kendi çözümleriyle yaratıcı olmaları için de yer açmak istedik.
zh_cn: 我们想为您提供丰富的原始图像和找到动力电池的好方法，但我们也想为每个团队留出空间，让他们可以使用自己的解决方案发挥创造力。

source: We hope you enjoy this process and learn more about datasets, as we perceive datasets being very important to the future of machine learning.
es_mx: Esperamos que disfruten este proceso y aprendan más acerca de conjuntos de datos, ya que percibimos que los conjuntos de datos son muy importantes para el futuro del aprendizaje de las máquinas.
fr_ca: Nous espérons que vous apprécierez ce processus et en apprendrez plus sur les ensembles de données, car nous estimons que les ensembles de données sont très importants pour l'avenir de l'apprentissage automatique.
tr_tr: Veri kümelerinin makine öğreniminin geleceği için çok önemli olduğunu düşündüğümüzden, bu süreçten keyif alacağınızı ve veri kümeleri hakkında daha fazla bilgi edineceğinizi umuyoruz.
zh_cn: 我们希望您喜欢这个过程并了解有关数据集的更多信息，因为我们认为数据集对于机器学习的未来非常重要。

source: Record a video to label
es_mx: Grabar un video para etiquetar
fr_ca: Enregistrer une vidéo pour étiqueter
tr_tr: Etiketlemek için bir video kaydedin
zh_cn: 录制要标记的视频

source: When creating your own dataset, it is often easier to take frames from a video rather than capture individual photos. This section describes how to extract frames from a video.
es_mx: Al crear su propio conjunto de datos, es más fácil tomar fotos de un vídeo que capturar fotos individuales. Esta sección describe como extraer fotos de un vídeo.
fr_ca: Lors de la création de votre propre ensemble de données, il est souvent plus facile de prendre des images d'une vidéo plutôt que de capturer des photos individuelles. Cette section décrit comment extraire des images d'une vidéo.
tr_tr: Kendi veri kümenizi oluştururken, tek tek fotoğraflar çekmek yerine bir videodan kare çekmek genellikle daha kolaydır. Bu bölümde videodan karelerin nasıl çıkarılacağı açıklanmaktadır.
zh_cn: 创建自己的数据集时，从视频中拍摄帧通常比捕获单个照片要容易得多。本节介绍如何从视频中提取帧。

source: Prepare to record a video of objects you want your robot to detect. You will want to get multiple angles and locations of the objects.
es_mx: Prepárese para grabar un vídeo de objetos que quiere que el robot detecte. Querrá obtener múltiples ángulos y ubicaciones de los objetos.
fr_ca: Préparez-vous à enregistrer une vidéo des objets que votre robot doit détecter. Vous voudrez obtenir plusieurs angles et emplacements des objets.
tr_tr: Robotunuzun algılamasını istediğiniz nesnelerin bir videosunu kaydetmeye hazırlanın. Nesnelerin birden çok açısını ve konumunu elde etmek isteyeceksiniz.
zh_cn: 准备录制要让机器人检测到的物体的视频。您将需要获取对象的多个角度和位置。

source: Plug a USB Camera into your laptop, point the camera at your chosen object, and run `record_video.py <https://github.com/wpilibsuite/DetectCoral/blob/master/utils/record_video.py>`__, which records an MP4. This script records small (640x480) images.
es_mx: Conecte una Camara USB a su laptop, apunte la cámara al objeto elegido y ejecute `record_video.py <https://github.com/wpilibsuite/DetectCoral/blob/master/utils/record_video.py>`__, que graba en MP4. Este guion graba imágenes pequeñas (640x480).
fr_ca: Branchez une caméra USB sur votre ordinateur portable, pointez la caméra sur l'objet de votre choix et exécutez `record_video.py <https://github.com/wpilibsuite/DetectCoral/blob/master/utils/record_video.py>`__, ce qui enregistre un MP4. Ce script enregistre de petites images (640x480).
tr_tr: Dizüstü bilgisayarınıza bir USB Kamera takın, kamerayı seçtiğiniz nesneye doğrultun ve bir MP4 kaydeden `record_video.py <https://github.com/wpilibsuite/DetectCoral/blob/master/utils/record_video.py>`__ 'ı çalıştırın. Bu komut dosyası, küçük (640x480) görüntüler kaydeder.
zh_cn: 将USB摄像头插入笔记本电脑，将摄像头对准所选对象，然后运行`record_video.py <https://github.com/wpilibsuite/DetectCoral/blob/master/utils/record_video.py>`__，以记录MP4。该脚本记录较小的（640x480）图像。

source: Click on the workspace, then the WPILib project that you imported in the :ref:`Setting Up the Data <docs/software/examples-tutorials/machine-learning/setting-up-the-data:Getting Data>` article.
es_mx: Haga clic en el espacio de trabajo, después en el proyecto WPILib que importó en el artículo :ref:`Setting Up the Data <docs/software/examples-tutorials/machine-learning/setting-up-the-data:Getting Data>`.
fr_ca: Cliquez sur l'espace de travail, puis sur le projet WPILib que vous avez importé dans l'article :ref:`Configuration des données <docs/software/examples-tutorials/machine-learning/setting-up-the-data:Getting Data`.
tr_tr: Çalışma alanına-workspace, ardından :ref:`Setting Up the Data <docs/software/examples-tutorials/machine-learning/setting-up-the-data:Getting Data>` makalesinde içe aktardığınız WPILib projesine tıklayın.
zh_cn: 单击工作区，然后单击在设置数据<docs/software/examples-tutorials/machine-learning/setting-up-the-data:Getting Data>文章中导入的WPILib项目。

source: Upload your own video to your workspace. Click 'UPLOAD' when inside of your workspace, change your import plugin to video, drag in your video, give the project a name, and click import. The default configuration, seen in the picture below, is fine.
es_mx: Suba su propio video a su espacio de trabajo. Haga clic en 'UPLOAD' cuando esté en su espacio de trabajo, cambie el complemento de importación a vídeo, arrástrelo, nombre el proyecto, y haga clic en importar. La configuración predeterminada, que se muestra en la imagen siguiente, es correcta.
fr_ca: Téléchargez votre propre vidéo dans votre espace de travail. Cliquez sur 'UPLOAD' à l'intérieur de votre espace de travail, changez votre plugin d'importation en vidéo, faites glisser votre vidéo, donnez un nom au projet et cliquez sur importer. La configuration par défaut, vue dans l'image ci-dessous, est correcte.
tr_tr: Kendi videonuzu çalışma alanınıza yükleyin. Çalışma alanınızın içindeyken 'UPLOAD'yi tıklayın, içe aktarma eklentinizi videoya değiştirin, videonuzu sürükleyin, projeye bir ad verin ve import'a tıklayın. Aşağıdaki resimde görülen varsayılan yapılandırma gayet iyi.
zh_cn: 将您自己的视频上传到您的工作区。在工作空间中时，单击“上传”，将导入插件更改为视频，拖入视频，为项目命名，然后单击导入。如下图所示，默认配置很好。
