Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/machine-learning/adding-more-data.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Click into your newly import Dataset. Use the ``rectangle tool`` to draw appropriate boxes around the objects which you wish to label. Make sure to choose the correct class while you are labeling. The class selector is in the top left of your screen.
es_mx: Haga clic en su conjunto de datos recién importado. Use la ``rectangle tool`` para dibujar cajas apropiadas alrededor de los objetos que desea etiquetar. Asegúrese de elegir la clase correcta mientras la etiqueta. El selector de clase se encuentra en la parte superior izquierda de la pantalla.
fr_ca: Cliquez sur votre nouvel ensemble de données importé. Utilisez l'outil ``rectangle tool`` pour dessiner des cases appropriées autour des objets que vous souhaitez étiqueter. Assurez-vous de choisir la bonne classe lors de l'étiquetage. Le sélecteur de classe se trouve en haut à gauche de votre écran.
tr_tr: Yeni içe aktarılan Veri Kümenize-Dataset tıklayın. Etiketlemek istediğiniz nesnelerin etrafına uygun kutuları çizmek için ``rectangle tool`` kullanın. Etiketleme yaparken doğru sınıfı seçtiğinizden emin olun. Sınıf seçici, ekranınızın sol üst tarafındadır.
zh_cn: 单击进入新导入的数据集。使用``矩形工具''在要标记的对象周围绘制适当的框。贴标签时，请确保选择正确的类别。类选择器在屏幕的左上方。

source: Dataset - This is the subset of images we used to train the network. We created this subset by clicking on the 3 dots of the Raw Data workspace, then going to the menu item “Run Python Script” and selecting the script “Filter by tag” We then filled in the tag “Valid”
tr_tr: Dataset - Veri Kümesi - Bu, ağı eğitmek için kullandığımız görüntülerin alt kümesidir. Bu alt kümeyi, Raw Data workspace-Ham Veri çalışma alanının 3 noktasını tıklayıp ardından "Run Python Script" menü öğesine gidip "Filter by tag" komut dosyasını seçerek oluşturduk. Ardından "Valid" etiketini doldurduk.
