Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/machine-learning/how-*-works.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: How it Works
es_mx: Como funciona
fr_ca: Comment ça fonctionne
tr_tr: Nasıl Çalışır
zh_cn: 怎么运行的

source: Unfortunately, this documentation is outdated and the methods described here are no longer functional. We are currently working on an a successor project and advise teams to research into a `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ solution in the meantime.
es_mx: Lamentablemente, esta documentación está obsoleta y los métodos descritos aquí ya no son funcionales. Actualmente estamos trabajando en un proyecto sucesor y aconsejamos a los equipos que investiguen una solución `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ por el momento.
fr_ca: Malheureusement, cette documentation est dépassée et les méthodes décrites ici ne sont plus fonctionnelles. Nous travaillons actuellement sur un projet successeur et conseillons aux équipes de rechercher une solution `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ entre-temps.
tr_tr: Ne yazık ki bu dokümantasyon güncelliğini yitirmiştir ve burada açıklanan yöntemler artık işlevsel değildir. Şu anda bir ardıl proje üzerinde çalışıyoruz ve ekiplere bu arada bir `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>` __ çözümü üzerinde araştırma yapmalarını tavsiye ediyoruz.
zh_cn: 不幸的是，该文档已过时，此处描述的方法不再起作用。我们目前正在进行一个后续项目，并建议团队同时研究`tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__解决方案。

source: The dockerfile is used to build an ECR image used by the training instance. The dockerfile contains the following important dependencies:
es_mx: El dockerfile se usa para construir una imagen ECR usada por la instancia de entrenamiento. El dockerfile contiene las siguientes dependencias importantes:
fr_ca: Le dockerfile est utilisé pour créer une image ECR utilisée par l'instance d'entraînement. Le dockerfile contient les dépendances importantes suivantes:
tr_tr: Dockerfile, eğitim örneği tarafından kullanılan bir ECR görüntüsü oluşturmak için kullanılır. Dockerfile aşağıdaki önemli bağlılıkları içerir:
zh_cn: dockerfile用于构建训练实例使用的ECR映像。 dockerfile包含以下重要依赖项：

source: TensorFlow for GPU
es_mx: TensorFlow para GPU
fr_ca: TensorFlow pour un GPU
tr_tr: GPU için TensorFlow

source: Python 2 and 3
es_mx: Python 2 y 3
fr_ca: Python 2 et 3
tr_tr: Python 2 ve 3
zh_cn: Python 2和3

source: Coral retraining scripts
es_mx: Guiones de reentrenamiento de coral
fr_ca: Scripts retenus par Coral
tr_tr: Coral yeniden eğitim kodları
zh_cn: 珊瑚再培训脚本

source: `WPILib scripts <https://github.com/wpilibsuite/DetectCoral/tree/dc17f4abdc101612ca163857bde363a082cd6ee2/container/coral>`__
tr_tr: `WPILib kodları <https://github.com/wpilibsuite/DetectCoral/tree/dc17f4abdc101612ca163857bde363a082cd6ee2/container/coral>`__
zh_cn: `WPILib脚本<https://github.com/wpilibsuite/DetectCoral/tree/dc17f4abdc101612ca163857bde363a082cd6ee2/container/coral>`__

source: Data
es_mx: Datos
fr_ca: Les données
tr_tr: Veri
zh_cn: 数据

source: Images should be labeled in Supervisely. They should be downloaded as ``jpeg + json``, in a tar file. When the user calls ``estimator.fit("s3://bucket")``, SageMaker automatically downloads the content of that folder/bucket to ``/opt/ml/input/data/training`` inside of the training instance.
es_mx: Las imágenes deben etiquetarse en Supervisely/Supervisado. Deben descargarse como ``jpeg + json``, en un archivo tar. Cuando el usuario llama a ``estimator.fit("s3://bucket")``, SageMaker descarga automáticamente el contenido de esa carpeta/bucket en ``/opt/ml/input/data/training`` dentro del entrenamiento ejemplo.
fr_ca: Les images doivent être étiquetées dans Supervately. Ils doivent être téléchargés en tant que ``jpeg + json``, dans un fichier de type .tar. Lorsque l'utilisateur appelle ``estimator.fit("s3://bucket")``, SageMaker télécharge automatiquement le contenu de ce dossier/bucket vers ``/opt/ml/input/data/training`` à l'intérieur de l'instance de formation.
tr_tr: Görüntüler Supervisely'de etiketlenmelidir. Tar dosyası içinde `` jpeg + json '' olarak indirilmelidirler. Kullanıcı `` estimator.fit("s3://bucket") '' i çağırdığında, SageMaker bu klasörün / paketin içeriğini otomatik olarak eğitim örneğinin içerisindeki `` /opt/ml /input/data/training '' klasörüne indirir.
zh_cn: 图像应在“ Supervisely”中标记。它们应在tar文件中以jpeg + json的形式下载。当用户调用“ estimator.fit（“ s3：// bucket”）“时，SageMaker会在培训过程中自动将该文件夹/存储桶的内容下载到/ opt / ml / input / data / training实例。

source: The tar is converted to the 2 records and ``.pbtxt`` used by the retraining script by the ``tar_to_record.sh`` script. It automatically finds the ONLY tar in the specified folder and extracts it. It then uses ``json_to_csv.py`` to convert the jsons to 2 large csv files. ``generate_tfrecord.py`` converts the csv files into ``.record`` files. Finally, the ``meta.json`` file is parsed by ``parse_meta.py`` to create the ``.pbtxt`` file, which is a label map.
es_mx: El tar se convierte a los 2 registros y ``.pbtxt`` utilizados por el script de reentrenamiento por el script `` tar_to_record.sh``. Esto encuentra automáticamente el ÚNICO tar en la carpeta especificada y lo extrae. Luego usa ``json_to_csv.py`` para convertir los jsons en 2 archivos csv grandes. ``generate_tfrecord.py`` convierte los archivos csv en archivos ``.record``. Finalmente, el archivo ``meta.json`` es analizado por ``parse_meta.py`` para crear el archivo ``.pbtxt``, que es un mapa de etiquetas.
fr_ca: Le fichier d'extension .tar est converti en 2 enrégistrements et le fichier d'extension ``.pbtxt`` utilisé par le script d'apprentissage ``tar_to_record.sh``. Il trouve automatiquement l'UNIQUE fichier d'extension .tar dans le dossier spécifié et l’extrait. Il utilise ensuite le fichier ``json_to_csv.py`` pour convertir les fichiers d'extension jsons en 2 gros fichiers csv. Le fichier ``generate_tfrecord.py`` convertit les fichiers csv en fichiers ``.record``. Enfin, le fichier ``meta.json`` est analysé par le fichier ``parse_meta.py`` pour créer le fichier ``.pbtxt``, qui est une carte d’étiquettes.
tr_tr: Tar uzantılı arşiv dosyası, ``tar_to_record.sh``kodu tarafından yeniden eğitim kodunun kullandığı 2 kayda ve ``.pbtxt`` ye dönüştürülür. Belirtilen klasörde SADECE tar uzantılı arşiv dosyasını otomatik olarak bulur ve çıkarır. Daha sonra jsonları 2 büyük csv dosyasına dönüştürmek için ``json_to_csv.py`` kullanır. `` generate_tfrecord.py``, csv dosyalarını ``.record`` dosyalarına dönüştürür. Son olarak, `` meta.json '' dosyası, bir etiket haritası olan ``.pbtxt``dosyasını oluşturmak için ``parse_meta.py`` tarafından ayrıştırılır.
zh_cn: tar将转换为2条记录，再由tar_to_record.sh脚本的再培训脚本使用.pbtxt。它会自动在指定的文件夹中找到唯一的tar并将其解压缩。然后使用json_to_csv.py将jsons转换为2个大型csv文件。 generate_tfrecord.py将csv文件转换为.record文件。最后，由“ parse_meta.py”解析“ meta.json”文件，以创建“ .pbtxt”文件，这是一个标签图。

source: Hyperparameters
es_mx: Hiperparámetros
fr_ca: Hyperparamèters
tr_tr: Hiperparametreler
zh_cn: 超参数

source: At the moment, the only hyperparameter that you can change is the number of training steps. The dict specified in the notebook is written to ``/opt/ml/input/config/hyperparameters.json`` in the training instance. It is parsed by ``hyper.py``, and is used when calling ``./retrain_....sh`` in train.
es_mx: En el momento, solo el hiperparámetro que se puede cambiar es el número de pasos de entrenamiento. El dictado específico en el cuaderno está escrito a ``/opt/ml/input/config/hyperparameters.json`` en una instancia de entrenamiento. Ésta es analizada por ``hyper.py``, y es utilizada cuando se llama ``./retrain_....sh`` en entrenamiento.
fr_ca: Pour le moment, le seul hyperparamètre que vous pouvez modifier est le nombre d'étapes d'entraînement. Le "dict" spécifié dans le notebook est écrit dans ``/opt/ml/input/config/hyperparameters.json`` dans l'instance d'entraînement. Il est analysé par ``hyper.py``, et est utilisé lors de l'appel de ``./retrain_....sh`` dans le mode Entraînement (Train).
tr_tr: Şu anda değiştirebileceğiniz tek hiperparametre eğitim adımlarının sayısıdır. Defterde belirtilen dikte, eğitim örneğinde ``/opt/ml/input/config/hyperparameters.json`` olarak yazılır. ``Hyper.py`` ile ayrıştırılır ve trende ``./retrain _.... sh`` çağrılırken kullanılır.
zh_cn: 目前，唯一可以更改的超参数是训练步骤的数量。笔记本中指定的字典在训练实例中写入``/opt/ml/input/config/hyperparameters.json''中。它由hyper.py解析，并在火车中调用./retrain_....sh时使用。

source: Training
es_mx: Entrenamiento
fr_ca: La formation
tr_tr: Eğitim
zh_cn: 训练

source: ``estimator.fit(...)`` calls the train script inside the training instance. It downloads checkpoints, creates the records, trains, converts to .tflite, and uploads to S3.
es_mx: ``estimator.fit(...)`` llama al escrito de entrenamiento dentro de la instancia de entrenamiento. Esto descarga puntos de verificación, crea reportes, entrenamientos, convierte a .tflite y sube a S3.
fr_ca: ``estimator.fit(...)`` appelle le script de train dans l'instance d'entraînement. Il télécharge les points de contrôle, crée les enregistrements, entraîne, convertit en .tflite et télécharge sur S3.
tr_tr: `` estimator.fit (...) ``, eğitim örneğinin içindeki tren kodunu çağırır. Denetim noktalarını indirir, kayıtları oluşturur, eğitir, .tflite biçimine dönüştürür ve S3'e yükler.
zh_cn: ``estimator.fit（...）``调用训练实例中的训练脚本。它下载检查点，创建记录，进行训练，转换为.tflite并上传到S3。

source: Output
es_mx: Salida
fr_ca: La sortie
tr_tr: Çıktı
zh_cn: 输出

source: The output ``output.tflite`` is moved to ``/opt/ml/model/output.tflite``. This is then automatically uploaded to an S3 bucket generated by SageMaker. You can find exactly where this is uploaded by going into the completed training job in SageMaker. It will be inside of a tar, inside of a tar.
es_mx: La salida ``output.tflite`` se cambió a ``/opt/ml/model/output.tflite``. Esto despues está automáticamente subido a una S3 bucket generada por SageMaker. Se puede encontrar exactamente donde se subió yendo a el trabajo de entrenamiento completado en SageMaker. Esto podrá estar dentro de un tar, dentro de un tar.
fr_ca: La sortie ``output.tflite`` est déplacée vers ``/opt/ml/model/output.tflite``. Ceci est ensuite automatiquement téléchargé dans un compartiment S3 généré par SageMaker. Vous pouvez trouver exactement où cela est téléchargé en accédant aux fichiers de formation complétés durant la tâche (completed training job) dans SageMaker. Ce sera à l'intérieur d'un fichier .tar
tr_tr: ``output.tflite`` çıktısı ``/opt/ml/model/output.tflite`` klasörüne taşınır. Bu daha sonra otomatik olarak SageMaker tarafından oluşturulan bir S3 klasörüne yüklenir. SageMaker'da tamamlanan eğitim işine giderek bunun tam olarak nereye yüklendiğini bulabilirsiniz. Bir tar uzantılı arşiv dosyasının içinde, bir tarın içinde olacak.
zh_cn: 输出``output.tflite''被移至``/opt/ml/model/output.tflite''。然后将其自动上传到SageMaker生成的S3存储桶。通过进入SageMaker中已完成的培训工作，您可以找到确切的上传位置。它会在tar内部，在tar内部。

source: Dockerfile
zh_cn: Docker文件
