Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/machine-learning/inference.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Inference
es_mx: Inferencia
fr_ca: Inférence
tr_tr: Çıkarım
zh_cn: 推理

source: Unfortunately, this documentation is outdated and the methods described here are no longer functional. We are currently working on an a successor project and advise teams to research into a `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ solution in the meantime.
es_mx: Lamentablemente, esta documentación está obsoleta y los métodos descritos aquí ya no son funcionales. Actualmente estamos trabajando en un proyecto sucesor y aconsejamos a los equipos que investiguen una solución `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ por el momento.
fr_ca: Malheureusement, cette documentation est dépassée et les méthodes décrites ici ne sont plus fonctionnelles. Nous travaillons actuellement sur un projet successeur et conseillons aux équipes de rechercher une solution `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ entre-temps.
tr_tr: Ne yazık ki bu dokümantasyon güncelliğini yitirmiştir ve burada açıklanan yöntemler artık işlevsel değildir. Şu anda bir ardıl proje üzerinde çalışıyoruz ve ekiplere bu arada bir `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ çözümü üzerinde araştırma yapmalarını tavsiye ediyoruz.
zh_cn: 不幸的是，该文档已过时，此处描述的方法不再起作用。我们目前正在进行一个后续项目，并建议团队同时研究`tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__解决方案。

source: Inference with the Google Coral
es_mx: Inferencia con Google Coral
fr_ca: Inférence avec le Google Coral
tr_tr: Google Coral ile Çıkarım
zh_cn: 用Google Coral推断

source: Acquire a Raspberry Pi 3 or newer, and a `Google Coral USB Accelerator <https://www.amazon.com/dp/B07S214S5Y>`__.
es_mx: Adquiera una Raspberry Pi 3 o la más reciente y un `Google Coral USB Accelerator <https://www.amazon.com/dp/B07S214S5Y>`__.
fr_ca: Faire l'acquisition d'un Raspberry Pi 3 ou plus récent et un `Google Coral USB Accelerator <https://www.amazon.com/dp/B07S214S5Y>` __.
tr_tr: Raspberry Pi 3 veya daha yenisini ve bir "Google Coral USB Hızlandırıcı edinin <https://www.amazon.com/dp/B07S214S5Y>`__.
zh_cn: 获取Raspberry Pi 3或更高版本，以及Google珊瑚USB加速器<https://www.amazon.com/dp/B07S214S5Y>`__。

source: Go to the training job in SageMaker, scroll to the bottom, and find the output S3 location.
es_mx: Vaya al trabajo de capacitación en SageMaker, desplácese hasta la parte inferior y busque la ubicación de salida S3.
fr_ca: Accéder à la tâche de formation dans SageMaker, faites défiler vers le bas et recherchez l'emplacement S3 de sortie.
tr_tr: SageMaker'daki eğitim işine gidin, en alta kaydırın ve S3 çıktısının konumunu bulun.
zh_cn: 转到SageMaker中的培训作业，滚动到底部，然后找到输出S3的位置。

source: Download the the tar file in the bucket.
es_mx: Descargue el archivo tar en el depósito.
fr_ca: Téléchargez le fichier .tar dans le "bucket".
tr_tr: Tar uzantılı arşiv dosyasını pakette indirin.
zh_cn: 将tar文件下载到存储桶中。

source: Setup your Raspberry Pi by :ref:`installing the WPILibPi image to your MicroSD card <docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card:Installing the image to your MicroSD card>`. This will install an operating system and most of the WPILib software that you will use for machine learning.
es_mx: Configure su Raspberry Pi :ref:`instalando la imagen WPILibPi en su tarjeta MicroSD <docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card:Installing the image to your MicroSD card>`. Esto instalará un sistema operativo y la mayor parte del software WPILib que utilizará para el aprendizaje automático.
fr_ca: Configurez votre Raspberry Pi en :ref:`en installant l'image WPILibPi sur votre carte MicroSD <docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card:Installing the image to your MicroSD card>`. Cela installera un système d'exploitation et la plupart des logiciels WPILib que vous utiliserez pour l'apprentissage automatique.
tr_tr: Raspberry Pi'nizi şu şekilde kurun: ref: `WPILibPi görüntüsünü MicroSD kartınıza <docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card:Installing the image to your MicroSD card> yükleme`. Bu, bir işletim sistemi ve makine öğrenimi için kullanacağınız WPILib yazılımının çoğunu kuracaktır.
zh_cn: 通过将WPILibPi映像安装到MicroSD卡<docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card:Installing the image to your MicroSD card>来设置Raspberry Pi。这将安装一个操作系统以及您将用于机器学习的大多数WPILib软件。

source: Plug the Coral into the Pi, as shown in the picture above.
es_mx: Conecte el Coral al Pi, como se muestra en la imagen de arriba.
fr_ca: Branchez le Coral dans le Pi, comme indiqué dans l'image ci-dessus.
tr_tr: Coral'ı yukarıdaki resimde gösterildiği gibi Pi'ye takın.
zh_cn: 如上图所示，将Coral插入Pi。

source: After successfully imaging your Pi, plug the Pi into your computer over ethernet. Open http://wpilibpi.local and change the file system to writeable.
es_mx: Después de obtener una imagen con éxito de su Pi, conecte el Pi a su computadora a través de Ethernet. Abra 'http://wpilibpi.local'. y cambie el sistema de archivos a escribible.
fr_ca: Après avoir réussi à imager votre Pi, branchez le Pi sur votre ordinateur via Ethernet. Ouvrez http://wpilibpi.local et changez le système de fichiers pour "Writeable".
tr_tr: Pi'nizi başarıyla görüntüledikten sonra, Pi'yi ethernet üzerinden bilgisayarınıza takın. http://wpilibpi.local dosyasını açın ve dosya sistemini yazılabilir olarak değiştirin.
zh_cn: 成功对Pi进行映像后，将Pi通过以太网插入计算机。打开http：//wpilibpi.local并将文件系统更改为可写。

source: Switch to the Application tab on the left.
es_mx: Cambie a la pestaña Aplicación a la izquierda.
fr_ca: Basculez vers l'onglet Application sur la gauche.
tr_tr: Soldaki Uygulama sekmesine geçin.
zh_cn: 切换到左侧的“应用程序”选项卡。

source: Upload the previously downloaded ``model.tar.gz`` to the Pi by selecting the file in the File Upload box, and switching on ``Extract .zip and .tar.gz files``.
es_mx: Sube el archivo ``model.tar.gz`` descargado previamente al Pi seleccionando el archivo en el cuadro Carga de archivos y activando ``Extract .zip and .tar.gz files``.
fr_ca: Téléchargez le fichier ``model.tar.gz`` précédemment téléchargé sur le Pi en sélectionnant le fichier dans la case Téléchargement de fichier et en activant ``Extract .zip and .tar.gz files``.
tr_tr: Önceden indirilen "model.tar.gz'' dosyasını, Dosya Yükleme kutusundaki dosyayı seçip ".zip ve .tar.gz dosyalarını çıkart'' seçeneğini açarak Pi'ye yükleyin.
zh_cn: 在文件上传框中选择文件，然后打开“解压缩.zip和.tar.gz文件”，将以前下载的“ model.tar.gz”上传到Pi。

source: Click upload.
es_mx: Haga clic en cargar
fr_ca: Cliquez sur télécharger.
tr_tr: Yükle'yi tıklayın.
zh_cn: 点击上传。

source: `Download the Python script which runs the model <https://raw.githubusercontent.com/wpilibsuite/DetectCoral/master/utils/inference.py>`__.
es_mx: `Descargue el script de Python que correra el modelo <https://raw.githubusercontent.com/wpilibsuite/DetectCoral/master/utils/inference.py>`__.
fr_ca: `Téléchargez le script Python qui exécute le modèle <https://raw.githubusercontent.com/wpilibsuite/DetectCoral/master/utils/inference.py>` __.
tr_tr: Modeli çalıştıran Python kodunu indirin <https://raw.githubusercontent.com/wpilibsuite/DetectCoral/master/utils/inference.py>`__.
zh_cn: `下载运行模型<https://raw.githubusercontent.com/wpilibsuite/DetectCoral/master/utils/inference.py>`__的Python脚本。

source: Switch the ``Vision Application Configuration`` to ``Uploaded Python File``, as shown below, and upload the downloaded script.
es_mx: Cambie la ``Vision Application Configuration`` a ``Uploaded Python File``, como se muestra a continuación, y cargue el script descargado.
fr_ca: Changer l'option ``Vision Application Configuration`` pour ``Uploaded Python File`` comme indiqué ci-dessous, et faire un Upload avec le script téléchargé.
tr_tr: Aşağıda gösterildiği gibi "Vision Uygulama Yapılandırması'' nı "Yüklenen Python Dosyası'' olarak değiştirin ve indirilen komut dosyasını yükleyin.
zh_cn: 如下图所示，将“视觉应用程序配置”切换为“上传的Python文件”，然后上传下载的脚本。

source: Real time labeling can be found on an MJPEG stream located at http://wpilibpi.local:1182
es_mx: El etiquetado en tiempo real se puede encontrar en un flujo MJPEG ubicado en http://wpilibpi.local:1182
fr_ca: L'étiquetage en temps réel peut être trouvé sur un flux MJPEG situé à http://wpilibpi.local:1182
tr_tr: Gerçek zamanlı etiketleme, http://wpilibpi.local:1182 adresinde bulunan bir MJPEG akışında bulunabilir.
zh_cn: 实时标签可以在位于http：//wpilibpi.local：1182的MJPEG流上找到

source: The information about the detected objects is put to NetworkTables.
es_mx: La información sobre los objetos detectados se coloca en NetworkTables.
fr_ca: Les informations sur les objets détectés sont placées dans les NetworkTables.
tr_tr: Tespit edilen nesneler hakkındaki bilgiler NetworkTables'a konur.
zh_cn: 有关检测到的对象的信息将放入NetworkTables。
