Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/machine-learning/testing.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Testing
es_mx: Probar
fr_ca: Faire les essais
tr_tr: Test yapmak
zh_cn: 测验

source: Unfortunately, this documentation is outdated and the methods described here are no longer functional. We are currently working on an a successor project and advise teams to research into a `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ solution in the meantime.
es_mx: Lamentablemente, esta documentación está obsoleta y los métodos descritos aquí ya no son funcionales. Actualmente estamos trabajando en un proyecto sucesor y aconsejamos a los equipos que investiguen una solución `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ por el momento.
fr_ca: Malheureusement, cette documentation est dépassée et les méthodes décrites ici ne sont plus fonctionnelles. Nous travaillons actuellement sur un projet successeur et conseillons aux équipes de rechercher une solution `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ entre-temps.
tr_tr: Ne yazık ki bu dokümantasyon güncelliğini yitirmiştir ve burada açıklanan yöntemler artık işlevsel değildir. Şu anda bir ardıl proje üzerinde çalışıyoruz ve ekiplere bu arada bir `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>` __ çözümü üzerinde araştırma yapmalarını tavsiye ediyoruz.
zh_cn: 不幸的是，该文档已过时，此处描述的方法不再起作用。我们目前正在进行一个后续项目，并建议团队同时研究`tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__解决方案。

source: These steps are for testing your model in SageMaker, before you load it onto your Raspberry Pi with Google Coral. It will use your model to annotate a video, and output the video for you to view. This is useful if you think you may have under or over fitted, or if you think you may not have enough data to develop a strong model.
es_mx: Estos pasos son para probar su modelo en SageMaker, antes de cargarlo en su Raspberry Pi con Google Coral. Utilizará su modelo para hacer anotaciones en un video y generará el video para que lo vea. Esto es útil si cree que puede tener un ajuste insuficiente o excesivo, o si cree que es posible que no tenga suficientes datos para desarrollar un modelo sólido.
fr_ca: Ces étapes permettent de tester votre modèle dans SageMaker, avant de le charger sur votre Raspberry Pi avec Google Coral. Il utilisera votre modèle pour annoter une vidéo et affichera la vidéo pour que vous puissiez la visionner. Ceci est utile si vous pensez que vous avez peut-être sous ou sur-ajusté vos paramètres, ou si vous pensez ne pas avoir suffisamment de données pour développer un modèle solide.
tr_tr: Bu adımlar, modelinizi Google Coral ile Raspberry Pi'nize yüklemeden önce SageMaker'da test etmek içindir. Modelinizi bir videoya açıklama eklemek için kullanır ve görüntülemeniz için videoyu çıkarır. Bu, yetersiz veya fazla takıldığınızı düşünüyorsanız veya güçlü bir model geliştirmek için yeterli veriye sahip olamayacağınızı düşünüyorsanız yararlıdır.
zh_cn: 这些步骤用于在使用Google Coral将模型加载到Raspberry Pi之前，在SageMaker中测试模型。它将使用您的模型为视频添加注释，并输出视频以供您查看。如果您认为拟合得不足或过高，或者您认为没有足够的数据来建立强大的模型，则这很有用。

source: You can skip these steps if you would like to not test your model.
es_mx: Puede omitir estos pasos si no desea probar su modelo.
fr_ca: Vous pouvez ignorer ces étapes si vous ne souhaitez pas tester votre modèle.
tr_tr: Modelinizi test etmek istemiyorsanız bu adımları atlayabilirsiniz.
zh_cn: 如果您不想测试模型，则可以跳过这些步骤。

source: Open ``Training jobs`` on the far left. Open the most recent job.
es_mx: Abra ``Trabajos de formación`` en el extremo izquierdo. Abra el trabajo más reciente.
fr_ca: Ouvrez ``Emplois de formation`` à l'extrême gauche. Ouvrez la tâche la plus récente.
tr_tr: En soldaki ``Training jobs- Eğitim işleri`` ni açın. En son işi açın.
zh_cn: 在最左侧打开``培训工作''。打开最近的工作。

source: Once the model is done training (the job says ``Completed``), scroll to the bottom inside the training job. Copy on the link in the ``Output`` section, where it says ``S3 model artifact``.
es_mx: Una vez que el modelo haya terminado de entrenarse (el trabajo dice ``Completado``), desplácese hasta la parte inferior dentro del trabajo de entrenamiento. Copie el enlace en la sección ``Salida``, donde dice ``Artefacto del modelo S3``.
fr_ca: Une fois que le modèle a terminé sa formation (la tâche dit ``Completed``), faites défiler vers le bas dans la tâche de formation. Copiez le lien dans la section ``Output``, où il est dit ``S3 model artifact``.
tr_tr: Model eğitimi tamamlandıktan sonra (işte ``Completed`` tamamlandı, yazıyor), eğitim işinin içinde aşağıya kaydırın. ``S3 model artifact`` yazan ``Output`` bölümündeki bağlantıyı kopyalayın.
zh_cn: 模型完成训练后（作业说``已完成''），滚动到训练作业内的底部。在``输出''部分的链接上复制，上面写着``S3模型工件''。

source: In SageMaker, click Start on the notebook you have already created if it does not say "In Service".
es_mx: En SageMaker, haga clic en Iniciar en el cuaderno que ya ha creado si no dice "En servicio".
fr_ca: Dans SageMaker, cliquez sur Démarrer sur le bloc-notes que vous avez déjà créé s'il ne dit pas "In Service".
tr_tr: SageMaker'da, "In Service" yazmıyorsa, önceden oluşturduğunuz not defterinde Başlat'a tıklayın.
zh_cn: 在SageMaker中，如果未显示“正在使用”，请在已创建的笔记本上单击“开始”。

source: Once the notebook is "In Service", open it using the JupyterLab option.
es_mx: Una vez que el cuaderno esté "En servicio", ábralo usando la opción JupyterLab.
fr_ca: Une fois que le bloc-notes est "In Service". ouvrez-le à l'aide de l'option JupyterLab.
tr_tr: Dizüstü bilgisayar "In Service" olduğunda, JupyterLab seçeneğini kullanarak açın.
zh_cn: 笔记本“投入使用”后，请使用JupyterLab选项将其打开。

source: Open the ``DetectCoral`` folder, and then ``testing.ipynb`` this time. These can be found on the left side of the screen. We've noticed that the first time a notebook is opened that it doesn't work correctly. To fix this, follow these steps:
es_mx: Abra la carpeta ``DetectCoral`` y luego ``testing.ipynb`` esta vez. Estos se pueden encontrar en el lado izquierdo de la pantalla. Hemos notado que la primera vez que se abre un notebook, no funciona correctamente. Para solucionar este problema, siga estos pasos:
fr_ca: Ouvrez le dossier ``DetectCoral``, puis ``testing.ipynb`` cette fois-ci. Ceci peut être trouvé sur le côté gauche de l'écran. Nous avons remarqué que la première fois qu'un ordinateur portable est ouvert, il ne fonctionne pas correctement. Pour résoudre ce problème, procédez comme suit:
tr_tr: ``DetectCoral`` klasörünü ve ardından bu sefer ``testing.ipynb`` i açın. Bunlar ekranın sol tarafında bulunabilir. Bir not defteri ilk açıldığında düzgün çalışmadığını fark ettik. Bunu düzeltmek için şu adımları izleyin:
zh_cn: 打开``DetectCoral''文件夹，然后这次``testing.ipynb''。这些可以在屏幕的左侧找到。我们注意到，第一次打开笔记本无法正常工作。若要解决此问题，请按照下列步骤操作：

source: Reload the tab. Dismiss the error. When prompted, select the kernel ``conda_amazonei_tensorflow_p36``
es_mx: Vuelve a cargar la pestaña. Descarte el error. Cuando se le solicite, seleccione el kernel ``conda_amazonei_tensorflow_p36``
fr_ca: Rechargez l'onglet. Ignorez l'erreur. Lorsque vous y êtes invité, sélectionnez le noyau (kernel) ``conda_amazonei_tensorflow_p36``.
tr_tr: Sekmeyi yeniden yükleyin. Hatayı reddedin. İstendiğinde, ``conda_amazonei_tensorflow_p36`` çekirdeğini seçin
zh_cn: 重新加载标签。消除错误。出现提示时，选择内核``conda_amazonei_tensorflow_p36''

source: If the tab does not finish reloading, close the tab, and open the notebook in JupyterLab once again. It will work this time.
es_mx: Si la pestaña no termina de recargarse, cierre la pestaña y abra el notebook en JupyterLab una vez más. Funcionará esta vez.
fr_ca: Si l'onglet ne termine pas le rechargement, fermez l'onglet et ouvrez à nouveau le bloc-notes dans JupyterLab. Cela fonctionnera cette fois.
tr_tr: Sekme yeniden yükleme işlemini tamamlamazsa, sekmeyi kapatın ve not defterini JupyterLab'da bir kez daha açın. Bu sefer işe yarayacak.
zh_cn: 如果该选项卡未完成重新加载，请关闭该选项卡，然后再次在JupyterLab中打开笔记本。这次它将起作用。

source: In the code block, replace the string value of ``model`` with the link you copied in step 2.
es_mx: En el bloque de código, reemplace el valor de string de ``modelo`` con el enlace que copió en el paso 2.
fr_ca: Dans le bloc de code, remplacez la valeur de chaîne de ``model`` par le lien que vous avez copié à l'étape 2.
tr_tr: Kod bloğunda, ``model`` in dize değerini 2. adımda kopyaladığınız bağlantıyla değiştirin.
zh_cn: 在代码块中，将``model''的字符串值替换为您在步骤2中复制的链接。

source: If you want to test your model with a different ``video`` than the current value of video, follow these steps:
es_mx: Si desea probar su modelo con un ``video`` diferente al valor actual del video, siga estos pasos:
fr_ca: Si vous souhaitez tester votre modèle avec un paramètre ``video`` différent de la valeur actuelle de la vidéo, procédez comme suit:
tr_tr: Modelinizi videonun mevcut değerinden farklı bir ``video`` ile test etmek istiyorsanız, şu adımları izleyin:
zh_cn: 如果要使用不同于当前视频值的``视频''来测试模型，请按照以下步骤操作：

source: Open AWS S3 by searching for the service in the ``Services`` dropdown.
es_mx: Abra AWS S3 buscando el servicio en el menú desplegable ``Servicios``.
fr_ca: Ouvrez AWS S3 en recherchant le service dans la liste déroulante ``Services``.
tr_tr: ``Services`` açılır menüsünde hizmeti arayarak AWS S3 'ü açın.
zh_cn: 通过在``服务''下拉列表中搜索服务来打开AWS S3。

source: Create a new bucket by giving it a unique name. Hit next until you reach the ``Set permissions`` page. On the third page, make sure it has public read permissions if multiple accounts will be using this data.
es_mx: Cree un nuevo depósito dándole un nombre único. Presione Siguiente hasta llegar a la página ``Establecer permisos``. En la tercera página, asegúrese de que tenga permisos de lectura públicos si varias cuentas utilizarán estos datos.
fr_ca: Créez un nouveau "Bucket" en lui attribuant un nom unique. Appuyez sur "Next" jusqu'à ce que vous atteigniez la page ``Set permissions``. Sur la troisième page, assurez-vous qu'il dispose des autorisations de lecture publiques si plusieurs comptes utiliseront ces données.
tr_tr: Benzersiz bir ad vererek yeni bir paket oluşturun. ``Set permissions- izinleri ayarla``, sayfasına ulaşana kadar ileriye basın. Üçüncü sayfada, bu verileri birden fazla hesap kullanacaksa, genel okuma izinlerine sahip olduğundan emin olun.
zh_cn: 通过为其指定一个唯一的名称来创建一个新的存储桶。单击下一步，直到到达``设置权限''页面。在第三页上，如果多个帐户将使用此数据，请确保它具有公共读取权限。

source: Once you've made the bucket, go into the bucket, then ``Permissions`` --> ``Access Control List``. Then change the public access to allow ``List objects`` and ``Read bucket permissions``.
es_mx: Una vez que haya hecho el cubo, vaya al cubo, luego a ``Permisos`` --> ``Lista de control de acceso``. Luego, cambie el acceso público para permitir ``Listar objetos`` y ``Leer permisos de depósito``.
fr_ca: Une fois que vous avez créé le "Bucket", allez dans le "Bucket", puis ``Permissions`` --> ``Access Control List``. Modifiez ensuite l'accès public pour autoriser ``List objects`` et ``Read bucket permissions``.
tr_tr: Paketi yaptıktan sonra, ardından ``Permissions-İzinler`` --> ``Access Control List-Erişim Kontrol Listesi `` pakete gidin. ``List objects -Nesneleri Listele`` ve ``Read bucket permissions-Paket izinlerini oku`` ya izin vermek için genel erişimi değiştirin.
zh_cn: 创建存储桶后，进入存储桶，然后进入“权限”->“访问控制列表”。然后更改公共访问权限以允许``列出对象''和``读取存储桶权限''。

source: Upload the video file that you wish to use into the new S3 bucket. Click "Add files", then select the file, click "Next", then make sure it also has public read permissions if multiple accounts will be using this video. Keep the file properties "Standard", and then click "Upload".
es_mx: Sube el archivo de video que deseas usar en el nuevo bucket de S3. Haga clic en "Agregar archivos", luego seleccione el archivo, haga clic en "Siguiente", luego asegúrese de que también tenga permisos públicos de lectura si varias cuentas usarán este video. Mantenga las propiedades del archivo como "Estándar" y luego haga clic en "Cargar".
fr_ca: Téléchargez le fichier vidéo que vous souhaitez utiliser dans le nouveau compartiment S3. Cliquez sur "Add files", puis sélectionnez le fichier, cliquez sur "Next", puis assurez-vous qu'il dispose également des autorisations de lecture publiques si plusieurs comptes utiliseront cette vidéo. Conservez les propriétés du fichier "Standard", puis cliquez sur "Upload".
tr_tr: Kullanmak istediğiniz video dosyasını yeni S3 klasörüne yükleyin. "Add files-Dosya ekle" yi tıklayın, ardından dosyayı seçin, "Next-ileri" yi tıklayın ve bu videoyu birden fazla hesap kullanacaksa, genel okuma izinlerine sahip olduğundan emin olun. Dosya özelliklerini "Standard" olarak tutun ve ardından "Upload-Yükle" yi tıklayın.
zh_cn: 将您要使用的视频文件上传到新的S3存储桶中。单击“添加文件”，然后选择文件，单击“下一步”，如果多个帐户将使用此视频，请确保它也具有公共读取权限。保留文件属性为“标准”，然后单击“上传”。

source: Click on the video after it is done uploading, then click ``Copy Path``.
es_mx: Haga clic en el video después de que haya terminado de cargarse, luego haga clic en ``Copiar ruta``.
fr_ca: Cliquez sur la vidéo une fois le téléchargement terminé, puis cliquez sur ``Copy Path``.
tr_tr: Yükleme tamamlandıktan sonra videoyu tıklayın, ardından ``Copy Path-Yolu Kopyala`` yı tıklayın.
zh_cn: 上传完成后单击视频，然后单击“复制路径”。

source: Go back into the notebook in SageMaker, and replace the string value of ``model`` with the path you copied in the last step.
es_mx: Vuelva al notebook en SageMaker y reemplace el valor de cadena de ``modelo`` con la ruta que copió en el último paso.
fr_ca: Revenez dans le bloc-notes dans SageMaker et remplacez la valeur de la chaîne de caractères ``model`` par le chemin (Path) que vous avez copié à la dernière étape.
tr_tr: SageMaker'daki not defterine geri dönün ve ``model`` in dize değerini son adımda kopyaladığınız yolla değiştirin.
zh_cn: 返回到SageMaker中的笔记本，然后用在上一步中复制的路径替换“ model”的字符串值。

source: Run the code block by clicking the play button at the top of your screen. This block may take several hours to finish annotating your video.
es_mx: Ejecute el bloque de código haciendo clic en el botón de reproducción en la parte superior de su pantalla. Este bloque puede tardar varias horas en terminar de anotar su video.
fr_ca: Exécutez le bloc de code en cliquant sur le bouton de lecture en haut de votre écran. Ce bloc de code peut prendre plusieurs heures pour accomplir l'annotation de votre vidéo.
tr_tr: Ekranınızın üst kısmındaki oynat düğmesine tıklayarak kod bloğunu çalıştırın. Bu engellemenin videonuza açıklama eklemeyi bitirmesi birkaç saat sürebilir.
zh_cn: 通过单击屏幕顶部的播放按钮来运行代码块。此块可能需要几个小时才能完成对视频的注释。

source: Go back to SageMaker. Open ``Training jobs`` on the far left. Open the most recent training job.
es_mx: Vuelve a SageMaker. Abra ``Trabajos de formación`` en el extremo izquierdo. Abra el trabajo de formación más reciente.
fr_ca: Retournez dans SageMaker. Ouvrez ``Training jobs`` à l'extrême gauche. Ouvrez le poste de formation le plus récent.
tr_tr: SageMaker'a geri dönün. En soldaki ``Training jobs-Eğitim işleri`` ni açın. En son eğitim işini açın.
zh_cn: 返回到SageMaker。在最左侧打开``培训工作''。打开最近的培训工作。

source: Once the model is done training (the job says ``Completed``), scroll to the bottom inside the training job. Click on the link in the Output section, where it says ``S3 model artifact``.
es_mx: Una vez que el modelo haya terminado de formarse (el trabajo dice ``Completado``), desplácese hasta la parte inferior dentro del trabajo de entrenamiento. Haga clic en el enlace en la sección Salida, donde dice ``Artefacto del modelo S3``.
fr_ca: Une fois que le modèle a terminé la formation (la tâche dit ``Completed``), faites défiler vers le bas dans la tâche de formation. Cliquez sur le lien dans la section Output, où il est dit ``S3 model artifact``.
tr_tr: Model eğitimi tamamlandıktan sonra (işte ``Completed-Tamamlandı``yazıyor), eğitim işinin içinde aşağıya kaydırın. Çıktı bölümündeki `` S3 model artifact-S3 model yapısı`` yazan bağlantıya tıklayın.
zh_cn: 模型完成训练后（作业说``已完成''），滚动到训练作业内的底部。单击输出部分中的链接，其中显示``S3模型工件''。

source: Click on ``model.tar.gz``. Click on Download.
es_mx: Haga clic en ``model.tar.gz``. Haga clic en Descargar.
fr_ca: Cliquez sur ``model.tar.gz``. Cliquez sur "Download".
tr_tr: ``model.tar.gz`` ye tıklayın. İndir'e tıklayın.
zh_cn: 点击``model.tar.gz''。点击下载。

source: Using an extraction tool (like 7Zip if you have Windows), extract the file you just downloaded. Then, view ``inference.avi`` that is inside of it. Frames should look like the one below.
es_mx: Con una herramienta de extracción (como 7Zip si tiene Windows), extraiga el archivo que acaba de descargar. Luego, vea ``inference.avi`` que está dentro de él. Los marcos deben verse como el de abajo.
fr_ca: À l'aide d'un outil d'extraction (comme 7Zip, si vous avez Windows), extraire le fichier que vous venez de télécharger. Ensuite, affichez ``inference.avi`` qui se trouve à l'intérieur. Les cadres doivent ressembler à celui illustré ci-dessous.
tr_tr: Bir ayıklama aracı kullanarak (Windows'unuz varsa 7Zip gibi), yeni indirdiğiniz dosyayı çıkarın. Ardından, içindeki ``inference.avi`` dosyasını görüntüleyin. Çerçeveler aşağıdaki gibi görünmelidir.
zh_cn: 使用解压缩工具（例如Windows，则为7Zip）解压缩刚刚下载的文件。然后，查看其中的``inference.avi''。框架看起来应该像下面的框架。
