Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/machine-learning/training.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Training
es_mx: Formación
fr_ca: La formation
tr_tr: Eğitim
zh_cn: 训练

source: Unfortunately, this documentation is outdated and the methods described here are no longer functional. We are currently working on an a successor project and advise teams to research into a `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ solution in the meantime.
es_mx: Lamentablemente, esta documentación está obsoleta y los métodos descritos aquí ya no son funcionales. Actualmente estamos trabajando en un proyecto sucesor y aconsejamos a los equipos que investiguen una solución `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ por el momento.
fr_ca: Malheureusement, cette documentation est dépassée et les méthodes décrites ici ne sont plus fonctionnelles. Nous travaillons actuellement sur un projet successeur et conseillons aux équipes de rechercher une solution `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ entre-temps.
tr_tr: Ne yazık ki bu dokümantasyon güncelliğini yitirmiştir ve burada açıklanan yöntemler artık işlevsel değildir. Şu anda bir ardıl proje üzerinde çalışıyoruz ve ekiplere bu arada bir `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>` __ çözümü üzerinde araştırma yapmalarını tavsiye ediyoruz.
zh_cn: 不幸的是，该文档已过时，此处描述的方法不再起作用。我们目前正在进行一个后续项目，并建议团队同时研究`tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__解决方案。

source: Training on AWS with the provided dataset should take about 2 hours and cost roughly $1. If you add more images or add new labeling classes the cost and time will be higher.
es_mx: La capacitación en AWS con el conjunto de datos proporcionado debería tomar aproximadamente 2 horas y costar aproximadamente $ 1 USD. Si agrega más imágenes o agrega nuevas clases de etiquetado, el costo y el tiempo serán mayores.
fr_ca: La formation sur AWS avec l'ensemble de données fourni devrait prendre environ 2 heures et coûter environ 1 USD. Si vous ajoutez plus d'images ou ajoutez de nouvelles classes d'étiquetage, le coût et le temps seront plus élevés.
tr_tr: Sağlanan veri kümesiyle AWS eğitimi yaklaşık 2 saat sürmeli ve yaklaşık 1 ABD doları maliyeti olmalıdır. Daha fazla resim eklerseniz veya yeni etiketleme sınıfları eklerseniz, maliyet ve süre daha yüksek olacaktır.
zh_cn: 使用提供的数据集在AWS上进行培训大约需要2个小时，费用约为1美元。如果添加更多图像或添加新的标签类别，则成本和时间会更高。

source: Train with AWS
es_mx: Entrenar con AWS
fr_ca: Entraînez-vous avec AWS
tr_tr: AWS ile eğitim
zh_cn: 使用AWS进行培训

source: If you are not in the AWS Console main page, click the AWS logo in the top left if you're logged in, or go to the page through your `awseducate classroom <https://aws.amazon.com/education/awseducate/>`__ if you are not logged in.
es_mx: Si no está en la página principal de la consola de AWS, haga clic en el logotipo de AWS en la parte superior izquierda si ha iniciado sesión, o vaya a la página a través de su aula `awseducate classroom <https://aws.amazon.com/education/awseducate/>`__ si no ha iniciado sesión.
fr_ca: Si vous n'êtes pas dans la page principale d'AWS Console, cliquez sur le logo AWS en haut à gauche si vous êtes connecté, ou accédez à la page via votre classe `awseducate classroom <https://aws.amazon.com/education/awseducate/>`__ si vous n'êtes pas connecté.
zh_cn: 如果您不在AWS Console的主页中，请单击左上角的AWS徽标（如果已登录），或者如果尚未登录，请通过“ awseducate教室<https://aws.amazon.com/education/awseducate/>” __进入该页面。

source: Search "SageMaker" in the "Find Services" field and create a new SageMaker notebook instance.
es_mx: Busque "SageMaker" en el campo "Find Services" y cree una nueva instancia de cuaderno de SageMaker.
fr_ca: Recherchez "SageMaker" dans le champ "Find Services" et créez une nouvelle instance de notebook SageMaker.
tr_tr: "Find Services-Hizmet Bul" alanında "SageMaker" ı arayın ve yeni bir SageMaker dizüstü bilgisayar örneği oluşturun.
zh_cn: 在“查找服务”字段中搜索“ SageMaker”，然后创建一个新的SageMaker笔记本实例。

source: Notebook instance name: Give your notebook a name
es_mx: Nombre de la instancia de su notebook: asigne un nombre a su notebook
fr_ca: Nom de l'instance de notebook: attribuez un nom à votre notebook
tr_tr: Not defteri örnek adı: Defterinize bir ad verin
zh_cn: 笔记本实例名称：为您的笔记本命名

source: IAM Role: Click Create a new role inside of the dropdown. Let it have access to Any S3 bucket.
es_mx: Función de IAM: haga clic en Crear una nueva función dentro del menú desplegable. Deje que tenga acceso a Any S3 bucket.
fr_ca: IAM Role: cliquez sur Créer un nouveau rôle dans la liste déroulante. Laissez-le accéder à n'importe quel compartiment S3 (Any S3 bucket).
tr_tr: IAM Rolü: Açılır listenin içindeki Yeni bir rol oluştur'u tıklayın. Herhangi bir S3 klasörüne erişmesine izin verin.
zh_cn: IAM角色：在下拉菜单中单击创建新角色。让它可以访问任何S3存储桶。

source: Git repositories: open the panel, then click on where it says None. Click Clone a public Git repository to this notebook instance only, then paste in this link: https://github.com/wpilibsuite/DetectCoral.git
es_mx: Repositorios de Git: abra el panel, luego haga clic en donde dice Ninguno. Haga clic en Clonar un repositorio público de Git solo en esta instancia de notebook, luego pegue este enlace: https://github.com/wpilibsuite/DetectCoral.git
fr_ca: Git repositories: ouvrez le panneau, puis cliquez là où il est dit "None". Cliquez sur "Clone a public Git repository" sur cette instance de notebook uniquement, puis collez ce lien: https://github.com/wpilibsuite/DetectCoral.git
tr_tr: Git depoları: paneli açın, ardından Yok yazan yere tıklayın. Yalnızca bu not defteri örneğine genel bir Git deposunu klonla'yı tıklayın, ardından şu bağlantıyı yapıştırın: https://github.com/wpilibsuite/DetectCoral.git
zh_cn: Git存储库：打开面板，然后单击显示无的位置。单击仅将公共Git存储库克隆到此笔记本实例，然后粘贴以下链接：https://github.com/wpilibsuite/DetectCoral.git

source: Create the instance
es_mx: Crear la instancia
fr_ca: Créer l'instance
tr_tr: Örneği oluşturun
zh_cn: 创建实例

source: After several minutes, the notebook will be "In Service". Open the notebook using the JupyterLab option.
es_mx: Después de varios minutos, el portátil estará "En servicio". Abra el cuaderno con la opción JupyterLab.
fr_ca: Après quelques minutes, le notebook sera "In service". Ouvrez le bloc-notes à l'aide de l'option JupyterLab.
tr_tr: Birkaç dakika sonra dizüstü bilgisayar "In Service-Hizmette" olacaktır. JupyterLab seçeneğini kullanarak not defterini açın.
zh_cn: 几分钟后，笔记本将“投入使用”。使用JupyterLab选项打开笔记本。

source: Open the ``DetectCoral`` folder, and then ``training.ipynb``, found on the left side of the screen. We've noticed that the first time a notebook is opened that it doesn't work correctly. To fix this, follow these steps:
es_mx: Abra la carpeta ``DetectCoral`` y luego ``training.ipynb``, que se encuentra en el lado izquierdo de la pantalla. Hemos notado que la primera vez que se abre una notebook, no funciona correctamente. Para solucionar este problema, siga estos pasos:
fr_ca: Ouvrez le dossier ``DetectCoral``, puis ``training.ipynb``, qui se trouve sur le côté gauche de l'écran. Nous avons remarqué que la première fois qu'un ordinateur portable est ouvert, il ne fonctionne pas correctement. Pour résoudre ce problème, procédez comme suit:
tr_tr: ``DetectCoral`` klasörünü ve ardından ekranın sol tarafında bulunan `` training.ipynb`` klasörünü açın. Bir not defteri ilk açıldığında düzgün çalışmadığını fark ettik. Bunu düzeltmek için şu adımları izleyin:
zh_cn: 打开``DetectCoral''文件夹，然后打开位于屏幕左侧的``training.ipynb''。我们注意到，第一次打开笔记本无法正常工作。若要解决此问题，请按照下列步骤操作：

source: Reload the tab. Dismiss the error. When prompted, select the kernel ``conda_amazonei_tensorflow_p36``.
es_mx: Vuelve a cargar la pestaña. Descarte el error. Cuando se le solicite, seleccione el kernel ``conda_amazonei_tensorflow_p36``.
fr_ca: Rechargez l'onglet. Ignorez l'erreur. Lorsque vous y êtes invité, sélectionnez le noyau (kernel) ``conda_amazonei_tensorflow_p36``.
tr_tr: Sekmeyi yeniden yükleyin. Hatayı reddedin. İstendiğinde, ``conda_amazonei_tensorflow_p36`` çekirdeğini seçin.
zh_cn: 重新加载标签。消除错误。出现提示时，选择内核``conda_amazonei_tensorflow_p36''。

source: If the tab does not finish reloading, close the tab, and open the notebook in JupyterLab once again. It will work this time.
es_mx: Si la pestaña no termina de recargarse, cierre la pestaña y abra la notebook en JupyterLab una vez más. Funcionará esta vez.
fr_ca: Si l'onglet ne termine pas le rechargement, fermez l'onglet et ouvrez à nouveau le bloc-notes dans JupyterLab. Cela fonctionnera cette fois.
tr_tr: Sekme yeniden yükleme işlemini tamamlamazsa, sekmeyi kapatın ve not defterini JupyterLab'da bir kez daha açın. Bu sefer işe yarayacak.
zh_cn: 如果该选项卡未完成重新加载，请关闭该选项卡，然后再次在JupyterLab中打开笔记本。这次它将起作用。

source: Replace ``estimator.fit(s3://wpilib)`` with ``estimator.fit(s3://<<your-bucket-name>>)``. If you could not access Supervisely in earlier steps, do not replace the bucket's name.
es_mx: Reemplace ``estimator.fit(s3://wpilib)`` por ``estimator.fit(s3://<<your-bucket-name>>)``. Si no pudo acceder a Supervisar en los pasos anteriores, no reemplace el nombre del depósito.
fr_ca: Remplacez ``estimator.fit(s3://wpilib)`` par ``estimator.fit(s3://<<your-bucket-name>>)``. Si vous n'avez pas pu accéder à Supervisely lors des étapes précédentes, ne remplacez pas le nom du "bucket".
tr_tr: ``estimator.fit(s3://wpilib)`` yerine ``estimator.fit (s3: // <<your-bucket-name>>)`` yazın. Önceki adımlarda Supervisely'ye erişemediyseniz paket adını değiştirmeyin.
zh_cn: 将``estimator.fit（s3：// wpilib）''替换为``estimator.fit（s3：// <<your-bucket-name>>）''。如果您无法在之前的步骤中以Supervisely访问，请不要替换存储桶的名称。

source: Run the code block by clicking the play button at the top of your screen. This block could take up to two hours to train your model depending on the value of ``epochs`` in the ``hyperparameters`` dictionary.
es_mx: Ejecute el bloque de código haciendo clic en el botón de reproducción en la parte superior de su pantalla. Este bloque puede tardar hasta dos horas en entrenar su modelo, dependiendo del valor de ``épocas`` en el diccionario de ``hiperparámetros``.
fr_ca: Exécutez le bloc de code en cliquant sur le bouton de lecture en haut de votre écran. Ce bloc peut prendre jusqu'à deux heures pour entraîner votre modèle en fonction de la valeur de ``epochs`` dans le dictionnaire ``hyperparameters``.
tr_tr: Ekranınızın üst kısmındaki oynat düğmesine tıklayarak kod bloğunu çalıştırın. Bu bloğun modelinizi eğitmesi, ``hyperparameters`` sözlüğündeki ``epochs`` değerine bağlı olarak iki saate kadar sürebilir.
zh_cn: 通过单击屏幕顶部的播放按钮来运行代码块。根据“超参数”字典中“ epochs”的值，此模块最多可能需要两个小时来训练模型。

source: Once the code block finishes running, the precision for each epoch is outputted. More information about what precision means can be found in :ref:`Understanding Precision <docs/software/examples-tutorials/machine-learning/understanding-precision:Understanding Precision>`.
es_mx: Una vez que el bloque de código termina de ejecutarse, se genera la precisión para cada época. Puede encontrar más información sobre lo que significa precisión en :ref: `Understanding Precision <docs/software/examples-tutorials/machine-learning/understanding-precision:Understanding Precision>`.
fr_ca: Une fois que le bloc de code a fini de s'exécuter, la précision de chaque époque est sortie. Pour plus d'informations sur ce que signifie la précision, consultez :ref:`Understanding Precision <docs/software/examples-tutorials/machine-learning/understanding-precision:Understanding Precision>`.
tr_tr: Kod bloğu çalışmayı bitirdiğinde, her bir dönemin kesinliği verilir. Hassasiyetin ne anlama geldiğiyle ilgili daha fazla bilgiyi şurada bulabilirsiniz :ref:`Understanding Precision <docs/software/examples-tutorials/machine-learning/understanding-precision:Understanding Precision>`.
zh_cn: 代码块完成运行后，将输出每个时期的精度。关于精度的更多信息可以在了解精度<docs/software/examples-tutorials/machine-learning/understanding-precision:Understanding Precision>中找到。

source: Go back to SageMaker. Open ``Training jobs`` on the far left. Open the most recent training job.
es_mx: Vuelve a SageMaker. Abra ``Trabajos de formación`` en el extremo izquierdo. Abra el trabajo de formación más reciente.
fr_ca: Retournez dans SageMaker. Ouvrez ``Training jobs`` à l'extrême gauche. Ouvrez le poste de formation le plus récent.
tr_tr: SageMaker'a geri dönün. En soldaki `` Training jobs-Eğitim işleri`` ni açın. En son eğitim işini açın.
zh_cn: 返回到SageMaker。在最左侧打开``培训工作''。打开最近的培训工作。

source: Once the model is done training (the job says ``Completed``), scroll to the bottom inside the training job. Click on the link in the ``Output`` section, where it says ``S3 model artifact``.
es_mx: Una vez que el modelo haya terminado de entrenarse (el trabajo dice ``Completado``), desplácese hasta la parte inferior dentro del trabajo de entrenamiento. Haga clic en el enlace en la sección ``Salida``, donde dice ``Artefacto del modelo S3``.
fr_ca: Une fois que le modèle a terminé la formation (la tâche dit ``Completed``), faites défiler vers le bas dans la tâche de formation. Cliquez sur le lien dans la section ``Output`` , où il est dit ``S3 model artifact``.
tr_tr: Model eğitimi tamamlandıktan sonra (işte ``Tamamlandı`` yazıyor), eğitim işinin içinde aşağıya kaydırın. ``S3 model artefakt`` yazan `` Çıktı`` bölümündeki bağlantıya tıklayın.
zh_cn: 模型完成训练后（作业说``已完成''），滚动到训练作业内的底部。单击``输出''部分中的链接，其中显示``S3模型工件''。

source: Click on ``model.tar.gz``. Click on ``Download``.
es_mx: Haga clic en ``model.tar.gz``. Haga clic en ``Descargar``.
fr_ca: Cliquez sur ``model.tar.gz``. Cliquez sur ``Download``.
tr_tr: ``Model.tar.gz`` ye tıklayın. `` İndir`` e tıklayın.
zh_cn: 点击``model.tar.gz''。点击``下载''。

source: Stop the notebook now that the training job is completed. Do this by going back to the SageMaker tab, clicking on ``Notebook instances`` on the far left, selecting the instance that is no longer needed, and selecting ``Actions -> Stop``.
es_mx: Detenga el notebook ahora que se completó el trabajo de capacitación. Haga esto volviendo a la pestaña SageMaker, haciendo clic en ``Instancias de Notebook`` en el extremo izquierdo, seleccionando la instancia que ya no es necesaria y seleccionando ``Acciones -> Detener``.
fr_ca: Arrêtez le notebook maintenant que la tâche de formation est terminée. Pour ce faire, revenez à l'onglet SageMaker, cliquez sur ``Notebook instances`` à l'extrême gauche, sélectionnez l'instance qui n'est plus nécessaire et sélectionnez ``Actions -> Stop``.
tr_tr: Eğitim işi tamamlandığına göre dizüstü bilgisayarı durdurun. Bunu SageMaker sekmesine geri dönerek, en soldaki ``Notebook instances-Dizüstü bilgisayar örnekleri`` üzerine tıklayarak, artık gerekli olmayan örneği seçerek ve ``Actions -> Stop - Eylemler -> Durdur`` u seçerek yapın.
zh_cn: 培训工作完成后，请立即停止笔记本计算机。为此，返回到SageMaker选项卡，单击最左侧的“笔记本实例”，选择不再需要的实例，然后选择“操作->停止”。
