Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/machine-learning/understanding-precision.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Understanding Precision
es_mx: Entender la precisión
fr_ca: Comprendre la précision
tr_tr: Hassasiyeti Anlamak
zh_cn: 了解精度

source: Unfortunately, this documentation is outdated and the methods described here are no longer functional. We are currently working on an a successor project and advise teams to research into a `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ solution in the meantime.
es_mx: Lamentablemente, esta documentación está obsoleta y los métodos descritos aquí ya no son funcionales. Actualmente estamos trabajando en un proyecto sucesor y aconsejamos a los equipos que investiguen una solución `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ por el momento.
fr_ca: Malheureusement, cette documentation est dépassée et les méthodes décrites ici ne sont plus fonctionnelles. Nous travaillons actuellement sur un projet successeur et conseillons aux équipes de rechercher une solution `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ entre-temps.
tr_tr: Ne yazık ki bu dokümantasyon güncelliğini yitirmiştir ve burada açıklanan yöntemler artık işlevsel değildir. Şu anda bir ardıl proje üzerinde çalışıyoruz ve ekiplere bu arada bir `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>` __ çözümü üzerinde araştırma yapmalarını tavsiye ediyoruz.
zh_cn: 不幸的是，该文档已过时，此处描述的方法不再起作用。我们目前正在进行一个后续项目，并建议团队同时研究`tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__解决方案。

source: With a lot of ML projects accuracy is fairly straightforward. But when doing object detection, there are a lot of nuances once you start to think about it. I will give you a quick overview of what goes into the calculations and what we are reporting. There are a lot of good articles that go into the subject deeper if you get interested.
es_mx: Con muchos proyectos de ML, la precisión es bastante sencilla. Pero al realizar la detección de objetos, hay muchos matices una vez que empiezas a pensar en ello. Le daré una descripción general rápida de lo que se incluye en los cálculos y lo que informamos. Hay muchos buenos artículos que profundizan en el tema si le interesa.
fr_ca: Avec beaucoup de projets ML, la précision est assez simple. Mais lors de la détection d'objets, il y a beaucoup de nuances une fois que vous commencez à y penser. Je vais vous donner un bref aperçu de ce qui est considéré lors des calculs et de ce que nous rapportons. Il y a beaucoup de bons articles qui approfondissent le sujet si vous vous intéressez.
tr_tr: Pek çok makine öğrenimi projesinde doğruluk oldukça basittir. Ancak nesne tespiti yaparken, onu düşünmeye başladığınızda birçok nüans vardır. Hesaplamalara nelerin girdiğine ve neleri rapor ettiğimize dair size hızlı bir genel bakış vereceğim. Eğer ilgilenirseniz, konunun derinliklerine inen birçok iyi makale var.
zh_cn: 对于许多ML项目，准确性非常简单。但是，在进行对象检测时，一旦您开始考虑它，就会有很多细微差别。我将为您简要介绍计算内容以及我们要报告的内容。如果您感兴趣，有很多不错的文章可以更深入地探讨该主题。

source: Some terms to start with.
es_mx: Algunos términos para empezar.
fr_ca: Quelques termes pour commencer.
tr_tr: Başlamak İçin Bazı Terimler.
zh_cn: 首先要讲一些术语。

source: GroundTruth. This refers to an image that was labeled by hand. As far as the ML can tell, when it evaluates against an image like this, it is the truth.
es_mx: GroundTruth. Esto se refiere a una imagen que fue etiquetada a mano. Por lo que el ML puede decir, cuando evalúa una imagen como esta, es la verdad.
fr_ca: GroundTruth. Cela fait référence à une image qui a été étiquetée à la main. Pour autant que le ML sache, quand il évalue par rapport à une image comme celle-ci, c'est la vérité.
tr_tr: GroundTruth-Zemin gerçeği. Bu, elle etiketlenmiş bir görüntüyü ifade eder. ML'nin anlayabildiği kadarıyla, böyle bir imaja karşı değerlendirme yaptığında gerçek budur.
zh_cn: GroundTruth。这是指用手标记的图像。据ML所知，当对这样的图像进行评估时，这是事实。

source: Predicted objects - This is when the trained neural network detects an object in an image. Usually the GroundTruth image, without the bounding boxes so that it can compare how it is doing.
es_mx: Objetos predichos: aquí es cuando la red neuronal entrenada detecta un objeto en una imagen. Por lo general, la imagen GroundTruth, sin los cuadros delimitadores para que pueda comparar cómo está funcionando.
fr_ca: Objets prédits - C'est à ce moment que le réseau neuronal formé détecte un objet dans une image. Habituellement, ce sera l'image GroundTruth, sans les cadres de délimitation, ceci afin de pouvoir comparer ses performances.
tr_tr: Predicted objects -Tahmin edilen nesneler - Bu, eğitimli sinir ağının bir görüntüdeki bir nesneyi algılamasıdır. Genelde GroundTruth görüntüsü, nasıl yaptığını karşılaştırabilmesi için sınırlayıcı kutular olmadan.
zh_cn: 预测对象-这是训练有素的神经网络在图像中检测到对象时的情况。通常，GroundTruth图像没有边界框，因此可以比较其效果。

source: Epoch - When you provide a dataset of labeled images to the training, we take 70% of the images as input to the neural network for training, and 30% of the images for validating the trained neural network against. One Epoch is when it has gone through a cycle of training and validating with all the supplied images. A neural network gets better when it goes through many cycles of the training and validating.
es_mx: Época: cuando proporcionas un conjunto de datos de imágenes etiquetadas al entrenamiento, tomamos el 70% de las imágenes como entrada a la red neuronal para el entrenamiento y el 30% de las imágenes para validar la red neuronal entrenada. Una Época es cuando ha pasado por un ciclo de formación y validación con todas las imágenes suministradas. Una red neuronal mejora cuando pasa por muchos ciclos de entrenamiento y validación.
fr_ca: Époque - Lorsque vous fournissez un ensemble de données d'images étiquetées à la formation, nous prenons 70% des images en entrée du réseau neuronal pour la formation et 30% des images pour valider le réseau neuronal formé. Une époque, c'est quand on a traversé un cycle de formation et de validation avec toutes les images fournies. Le réseau de neurones s'améliore lorsqu'il passe par de nombreux cycles d'entraînement et de validation.
tr_tr: Epoch - Eğitime etiketli görüntülerden oluşan bir veri kümesi sağladığınızda, eğitim için sinir ağına girdi olarak görüntülerin %70'ini ve eğitimli sinir ağını doğrulamak için görüntülerin %30'unu alıyoruz. Bir Epoch, verilen tüm görüntülerle bir eğitim ve doğrulama döngüsünden geçtiği zamandır. Bir sinir ağı, eğitimin ve onaylamanın birçok döngüsünden geçtiğinde daha iyi hale gelir.
zh_cn: 时代-当您为训练提供标签图像的数据集时，我们将70％的图像作为输入到神经网络进行训练，而将30％的图像用作验证训练后的神经网络的输入。一个纪元就是经过所有提供的图像的训练和验证周期之后。当神经网络经历训练和验证的许多周期时，它会变得更好。

source: We have set up our training to look at the accuracy information after every 100 Epochs.
es_mx: Hemos configurado nuestra capacitación para ver la información de precisión después de cada 100 épocas.
fr_ca: Nous avons mis en place notre formation pour examiner les informations de précision toutes les 100 époques.
tr_tr: Her 100 Dönemden sonra doğruluk bilgilerine bakmak için eğitimimizi ayarladık.
zh_cn: 我们已经设置了培训，以每100个Epoch之后查看一次准确性信息。

source: Now for some of the nuances in looking at the accuracy. Let's say we have a GroundTruth image with 5 cargo and 4 hatches labeled on it. To start with let's just look at Cargo. The systems takes the GroundTruth image and compares it with the hand labeled bounding boxes and the predicted bounding boxes. The prediction shows 4 cargo. 3 are actual cargo and 1 is the person in the stands with an orange shirt on. There are two interesting numbers here. One is called Recall. The Recall is out of 5 true cargos it recognized 3. This means the recall is 3/5. The next number is precision. The precision is that out of 4 recognized cargo 3 where correct. Making the Precision 3/4. These numbers many times turn out to be inversely related. So when there is more recall, the accuracy may go down, more false positives. And when the recall goes down there may be better accuracy or fewer false positives. In order to find a good way to represent these two numbers another number is calculated. This is call the Average Precision (AP). This is done by taking the amount of precision at each level of recall, creating a Precision Recall curve. The calculation for this is very interesting and worth looking up if you are interested. All of these are done every 100 Epochs in our case. Then this is done for each of the classes, Cargo and then Hatches. And the mean, or average, are taken for the AP of each of the classes to make the mean Average Precision or mAP. This gives us a pretty good feeling for the accuracy, but there is one more consideration around locality. If you take the bounding box from the GroundTruth for and object and the predicted bounding box and overlap them, you want at least 50% of those boxes to intersect. If not, the predicted object is not accurate enough to be considered a match. This overlapping intersection is referred to as Intersection over Union (IoU). Different accuracy checks use different percentages of IoU, but we are going to stick with >50%.
es_mx: Ahora, algunos de los matices al observar la precisión. Digamos que tenemos una imagen de GroundTruth con 5 cargos y 4 hatches etiquetadas. Para empezar, echemos un vistazo a Cargo. El sistema toma la imagen de GroundTruth y la compara con los cuadros delimitadores etiquetados a mano y los cuadros delimitadores predichos. La predicción muestra 4 cargos. 3 son cargos reales y 1 es la persona en las gradas con una camiseta naranja. Aquí hay dos números interesantes. Uno se llama Recuperación o Recall. La recuperación es de 5 cargas verdaderas que reconoció 3. Esto significa que el Recall es 3/5. El siguiente número es precisión. La precisión es la de 4 cargas reconocidas, 3 donde son correctas. Haciendo la Precisión 3/4. Estos números muchas veces resultan estar inversamente relacionados. Entonces, cuando hay más memoria, la precisión puede disminuir, más falsos positivos. Y cuando el Recall disminuye, puede haber una mayor precisión o menos falsos positivos. Para encontrar una buena forma de representar estos dos números, se calcula otro número. Este se llama Precisión Media (AP). Esto se hace tomando la cantidad de precisión en cada nivel de recuperación, creando una curva de recuperación de precisión. El cálculo para esto es muy interesante y vale la pena buscarlo si está interesado. Todo esto se hace cada 100 ciclos en nuestro caso. Luego, esto se hace para cada una de las clases, Cargo y luego Hatch. Y la media, o promedio, se toma para el AP de cada una de las clases para hacer el promedio de Precisión Media o mAP. Esto nos da una buena sensación de precisión, pero hay una consideración más en torno a la localidad. Si toma el cuadro delimitador de GroundTruth para un objeto y el cuadro delimitador previsto y los superpone, lo óptimo es que al menos el 50% de esos cuadros se intersequen. De lo contrario, el objeto predicho no es lo suficientemente preciso para ser considerado una coincidencia. Esta intersección superpuesta se conoce como Intersección sobre Unión (IoU). Las diferentes comprobaciones de precisión utilizan diferentes porcentajes de IoU, pero nos vamos a quedar con >50%.
fr_ca: Maintenant, pour certaines des nuances relatifs à la précision. Disons que nous avons une image GroundTruth avec 5 Cargaisons et 4 Panneaux d'écoutille, chacuns étiquetées. Pour commencer, regardons simplement les Cargaisons. Le système prend l'image GroundTruth et la compare avec les boîtes englobantes étiquetées à la main et les boîtes englobantes prévues. La prédiction montre 4 cargaisons. 3 sont des cargaisons réelles et 1 est la personne dans les gradins avec une chemise orange. Il y a deux chiffres intéressants ici. L'un est appelé Rappel (Recall). Le rappel est que: sur 5 vraies cargaisons, le réseau en a reconnu 3. Cela signifie que le rappel est de 3/5. Le chiffre suivant est la précision. La précision est que sur 4 cargaisons reconnues, 3 étaient correctes. La précision est donc: 3/4. Ces chiffres s'avèrent souvent être inversement proportionnels. Ainsi, lorsqu'il y a augmentation du rappel, la précision peut diminuer, dû à plus de faux positifs. Et lorsque le rappel diminue, il peut y avoir une meilleure précision ou moins de faux positifs. Afin de trouver une bonne façon de représenter ces deux nombres, un autre nombre est calculé. C'est ce qu'on appelle la précision moyenne (AP). Cela se fait en prenant la quantité de précision à chaque niveau de rappel, créant une courbe de rappel de précision. Le calcul pour cela est très intéressant et vaut la peine d'être recherché sur Google, si cela vous intéresse. Tout cela est fait à toutes les 100 époques dans notre cas. Ensuite, cela est fait pour chacune des classes, Cargaison puis Panneaux d'écoutille. Et la moyenne est ensuite calculée pour l'AP de chacune des classes pour faire la précision moyenne des moyennes ou mAP. Cela nous donne une assez bonne idée de la précision, mais il y a une autre considération autour de la localité. Si vous prenez la zone de délimitation de GroundTruth pour et l'objet et la zone de délimitation prévue et que vous les chevauchez, vous voulez qu'au moins 50% de ces zones se chevauchent. Sinon, l'objet prédit n'est pas suffisamment précis pour être considéré comme une correspondance. Cette intersection qui se chevauche est appelée Intersection over Union (IoU). Différents contrôles de précision utilisent différents pourcentages d'IoU, mais nous allons nous en tenir à ceux qui sont > 50%.
tr_tr: Şimdi doğruluğa bakarken bazı nüanslar için, diyelim ki üzerinde 5 kargo ve 4 kapak etiketli bir GroundTruth imajımız var. Başlangıç olarak sadece Cargo'ya bakalım. Sistemler GroundTruth görüntüsünü alır ve bunu elle etiketli sınırlayıcı kutular ve tahmin edilen sınırlayıcı kutularla karşılaştırır. Tahmin 4 kargoyu gösteriyor. 3'ü gerçek kargo ve 1'i turuncu tişörtlü stantlardaki kişidir. Burada iki ilginç sayı var. Birine Geri Çağırma denir. Geri Çağırma, tanıdığı 5 gerçek kargodan çıktı 3. Bu, geri çağırmanın 3/5 olduğu anlamına gelir. Bir sonraki sayı kesinliktir. Kesinlik, doğru olan 4 kargodan 3 tanesidir. Precision'ı Yapmak 3/4. Bu sayılar çoğu zaman ters orantılıdır. Dolayısıyla, daha fazla hatırlama olduğunda, doğruluk azalabilir, daha fazla yanlış pozitif olabilir. Ve geri çağırma azaldığında daha iyi doğruluk veya daha az yanlış pozitif olabilir. Bu iki sayıyı temsil etmenin iyi bir yolunu bulmak için başka bir sayı hesaplanır. Buna Ortalama Hassasiyet (AP) denir. Bu, her geri çağırma düzeyindeki kesinlik miktarı alınarak ve bir Hassas Geri Çağırma eğrisi oluşturularak yapılır. Bunun hesaplaması çok ilginç ve ilgileniyorsanız bakmaya değer. Bunların hepsi bizim durumumuzda her 100 Epoch'ta yapılır. Daha sonra bu, Cargo ve ardından Hatches sınıflarının her biri için yapılır. Ve ortalama veya ortalama, Ortalama Kesinlik veya eşleme yapmak için sınıfların her birinin AP'si için alınır. Bu bize doğruluk konusunda oldukça iyi bir his veriyor, ancak yerellikle ilgili bir düşünce daha var. GroundTruth'tan sınırlayıcı kutuyu ve nesneyi ve öngörülen sınırlayıcı kutuyu alırsanız ve bunları üst üste getirirseniz, bu kutuların en az% 50'sinin kesişmesini istersiniz. Değilse, tahmin edilen nesne bir eşleşme olarak kabul edilecek kadar doğru değildir. Bu örtüşen kesişme, Birlik Üzerinden Kavşak (IoU) olarak adlandırılır. Farklı doğruluk kontrolleri, farklı IoU yüzdelerini kullanır, ancak% 50'nin üzerinde kalacağız.
zh_cn: 现在来看一下准确性的一些细微差别。假设我们有一个GroundTruth图像，上面有5个货物和4个舱口标记。首先，让我们看一下货运。系统获取GroundTruth图像，并将其与带有手工标记的边界框和预测的边界框进行比较。预测显示有4架货物。 3是实际货物，1是身穿橙色衬衫的看台上的人。这里有两个有趣的数字。一种叫做召回。召回数量是其识别出的5件真实货物中的3件。这意味着召回率是3/5。下一个数字是精度。精度是在4个已识别的货物3中正确的位置。使精度3/4。这些数字多次被证明是成反比的。因此，当召回次数更多时，准确性可能会下降，出现更多的误报。当召回事件减少时，准确性可能更高，或者误报率会更低。为了找到表示这两个数字的好方法，计算了另一个数字。这称为平均精度（AP）。这是通过在每个召回级别上获取精度值，创建精确召回曲线来完成的。对此的计算非常有趣，如果您有兴趣的话，值得查阅。在我们的案例中，所有这些操作都是每100个纪元完成的。然后，针对每个类别（货运和舱口盖）执行此操作。取每个类别的AP的均值或平均值，以得出平均平均精度或mAP。这使我们对准确性有一种很好的感觉，但是围绕局部性还有更多考虑因素。如果从GroundTruth中的和对象取边界框并与预测的边界框重叠，则希望它们中的至少50％相交。如果不是，则预测的对象不够精确，无法被视为匹配。此重叠的交集称为“联合交集”（IoU）。不同的准确性检查使用不同的IoU百分比，但我们将坚持> 50％。

source: So now if we look at the mAP for an IoU greater than 50% it gives us a level of accuracy that we can understand. When training a network you want this number to go up over the number of Epochs. Not too fast, and many times there will be an early peak to this number, but that can be due to what is called overfitting, where it is just matching the validation images, but won't work as well on the general case of the video camera on your robot. So you want to train until this number stops going up when looking at a smoothed curve. If the accuracy never gets up that high, it may be that you need to change some of your hyperparameters, like the number of Epochs or Batch size. Or it could be that you need more labeled or better labeled images in your dataset. This tuning is part of the "magic" of machine learning. Certainly over time one gets a better intuition on how to tune a network, but there is at this time a direct correlation to when you see this type of curve, change this parameter to improve it.
es_mx: Entonces, si miramos el mAP para un IoU mayor al 50%, nos da un nivel de precisión que podemos comprender. Al entrenar una red, desea que este número suba por encima del número de Épocas. No demasiado rápido, y muchas veces habrá un pico temprano en este número, pero eso puede deberse a lo que se llama sobreajuste, donde solo coincide con las imágenes de validación, pero no funcionará tan bien en el caso general de la cámara de video en su robot. Por lo tanto, lo óptimo es entrenar hasta que este número deje de subir cuando observe una curva suavizada. Si la precisión nunca llega a ser tan alta, es posible que deba cambiar algunos de sus hiperparámetros, como el número de Épocas o el tamaño del lote. O podría ser que necesite imágenes más etiquetadas o mejor etiquetadas en su conjunto de datos. Este ajuste es parte de la "magia" del aprendizaje automático. Ciertamente, con el tiempo, uno tiene una mejor intuición sobre cómo sintonizar una red, pero en este momento existe una correlación directa con cuando vea este tipo de curva, cambie este parámetro para mejorarlo.
fr_ca: Donc maintenant, si nous regardons le mAP pour une IoU supérieure à 50%, cela nous donne un niveau de précision que nous pouvons comprendre. Lors de la formation d'un réseau, vous voulez que ce nombre dépasse le nombre d'époques. Pas trop vite, et il y aura souvent un pic précoce à ce nombre, mais cela peut être dû à ce que l'on appelle le surajustement, où il correspond simplement aux images de validation, mais il ne fonctionnera pas aussi bien lors d'images prises par la caméra vidéo sur votre robot. Vous voulez donc vous entraîner jusqu'à ce que ce nombre cesse d'augmenter lorsque vous regardez une courbe lissée. Si la précision n'est jamais aussi élevée, il se peut que vous deviez modifier certains de vos hyperparamètres, comme le nombre d'époques ou la taille du lot. Ou il se peut que vous ayez besoin d'images plus étiquetées ou mieux étiquetées dans votre ensemble de données. Ce réglage fait partie de la «magie» de l'apprentissage automatique. Certes, avec le temps, on obtient une meilleure intuition sur la façon de régler un réseau, mais il existe à ce moment une corrélation directe avec le moment où vous voyez ce type de courbe, changez alors ce paramètre pour l'améliorer.
tr_tr: Şimdi% 50'den büyük bir IoU için haritaya bakarsak, bu bize anlayabileceğimiz bir doğruluk düzeyi verir. Bir ağı eğitirken, bu sayının Epoch sayısının üzerine çıkmasını istersiniz. Çok hızlı değil ve çoğu zaman bu sayı için erken bir zirve olacak, ancak bunun nedeni aşırı uyum denen şey olabilir, burada sadece doğrulama görüntüleriyle eşleşiyor, ancak genel durumda işe yaramayacak durumda olabilir. robotunuzdaki video kamera. Yani, düzleştirilmiş bir eğriye bakarken bu sayı yükselmeyi bırakana kadar antrenman yapmak istersiniz. Doğruluk hiçbir zaman bu kadar yükselmezse, Epoch sayısı veya Batch boyutu gibi bazı hiperparametrelerinizi değiştirmeniz gerekebilir. Veya veri kümenizde daha fazla etiketli veya daha iyi etiketlenmiş görüntülere ihtiyacınız olabilir. Bu ayar, makine öğreniminin "büyüsünün" bir parçasıdır. Kesinlikle zamanla bir ağın nasıl ayarlanacağına dair daha iyi bir sezgi edinir, ancak şu anda bu tür bir eğri gördüğünüzde, onu geliştirmek için bu parametreyi değiştirin.
zh_cn: 因此，现在，如果我们将IoU的mAP视为大于50％，那么它将为我们提供我们可以理解的准确度。训练网络时，您希望此数字超过Epoch的数量。不太快，很多时候这个数字会达到一个高峰，但这可能是由于所谓的过拟合，它只与验证图像匹配，但在一般情况下效果不佳机器人上的视频摄像机。因此，您要进行训练，直到在观察平滑曲线时该数字停止上升为止。如果精度永远不会达到那么高的水平，则可能是您需要更改某些超参数，例如历元数或批处理大小。也可能是您在数据集中需要更多标记或标记更好的图像。这种调整是机器学习“魔术”的一部分。当然，随着时间的流逝，人们对如何调整网络有了更好的直觉，但是此时与看到这种类型的曲线有直接的关联，请更改此参数以对其进行改进。
