Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/machine-learning/uploading-data-to-aws-s3.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Uploading the Data to AWS S3
es_mx: Carga de datos en AWS S3
fr_ca: Téléchargement des données sur AWS S3
tr_tr: Verileri AWS S3'e Yükleme
zh_cn: 将数据上传到AWS S3

source: Unfortunately, this documentation is outdated and the methods described here are no longer functional. We are currently working on an a successor project and advise teams to research into a `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ solution in the meantime.
es_mx: Lamentablemente, esta documentación está obsoleta y los métodos descritos aquí ya no son funcionales. Actualmente estamos trabajando en un proyecto sucesor y aconsejamos a los equipos que investiguen una solución `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ por el momento.
fr_ca: Malheureusement, cette documentation est dépassée et les méthodes décrites ici ne sont plus fonctionnelles. Nous travaillons actuellement sur un projet successeur et conseillons aux équipes de rechercher une solution `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ entre-temps.
tr_tr: Ne yazık ki bu dokümantasyon güncelliğini yitirmiştir ve burada açıklanan yöntemler artık işlevsel değildir. Şu anda bir ardıl proje üzerinde çalışıyoruz ve ekiplere bu arada bir `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>` __ çözümü üzerinde araştırma yapmalarını tavsiye ediyoruz.
zh_cn: 不幸的是，该文档已过时，此处描述的方法不再起作用。我们目前正在进行一个后续项目，并建议团队同时研究`tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__解决方案。

source: Amazon Web Services (AWS) S3 is Amazon's cloud storage service. You must upload your dataset to S3 in order to use for training with Amazon servers.
es_mx: Amazon Web Services (AWS) S3 es el servicio de almacenamiento en la nube de Amazon. Debe cargar su conjunto de datos en S3 para usarlo para entrenar con servidores de Amazon.
fr_ca: Amazon Web Services (AWS) S3 est le service de stockage cloud d'Amazon. Vous devez télécharger votre ensemble de données sur S3 afin de l'utiliser pour la formation avec les serveurs Amazon.
tr_tr: Amazon Web Services (AWS) S3, Amazon'un bulut depolama hizmetidir. Amazon sunucularıyla eğitim amaçlı kullanım için veri kümenizi S3'e yüklemeniz gerekir.
zh_cn: Amazon Web Services（AWS）S3是Amazon的云存储服务。您必须将数据集上传到S3才能用于Amazon服务器的培训。

source: If you can not access Supervisely, you can skip all of these steps.
es_mx: Si no puede acceder a Supervisar, puede omitir todos estos pasos.
fr_ca: Si vous ne pouvez pas accéder à Supervately, vous pouvez ignorer toutes ces étapes.
tr_tr: Supervisely'e erişemiyorsanız, tüm bu adımları atlayabilirsiniz.
zh_cn: 如果您不能以超级用户身份访问，则可以跳过所有这些步骤。

source: While on `Supervisely <https://supervise.ly/>`__, go to your project page in your workspace. Click on the vertical three dots on the dataset, then "Download as", then select the ``.json + images`` option.
es_mx: Mientras esté en Supervisely <https://supervise.ly/>`__, vaya a la página de su proyecto en su espacio de trabajo. Haga clic en los tres puntos verticales en el conjunto de datos, luego en "Descargar como", luego seleccione la opción ``.json + imágenes``.
fr_ca: Lorsque vous êtes sur `Supervately <https://supervise.ly/>`__, accédez à la page de votre projet dans votre espace de travail. Cliquez sur les trois points verticaux du jeu de données, puis sur "Download as", puis sélectionnez l'option ``.json + images``.
tr_tr: `Supervisely <https://supervise.ly/>`__ üzerindeyken, çalışma alanınızdaki proje sayfanıza gidin. Veri kümesindeki birbiri üzerine dikey sıralanmış üç noktaya tıklayın, ardından "Download as" butonuna tıklayın, ardından ".json + images '' seçeneğini seçin.
zh_cn: 在`supervisely <https://supervise.ly/>`__上时，转到工作区中的项目页面。单击数据集上的垂直三个点，然后单击“下载为”，然后选择“ .json + images”选项。

source: If you do not have an AWS Educate account, have a mentor `follow these steps <https://www.firstinspires.org/sites/default/files/uploads/frc/AWSEducate_FIRST_MentorOnboarding.pdf>`__. Once a mentor has completed these steps, students should `follow these steps <https://www.firstinspires.org/sites/default/files/uploads/frc/AWSEducate_FIRST_StudentOnboarding.pdf>`__.
es_mx: Si no tiene una cuenta de AWS Educate, tenga un mentor `siga estos pasos <https://www.firstinspires.org/sites/default/files/uploads/frc/AWSEducate_FIRST_MentorOnboarding.pdf>`__. Una vez que un mentor haya completado estos pasos, los estudiantes deben `seguir estos pasos <https://www.firstinspires.org/sites/default/files/uploads/frc/AWSEducate_FIRST_StudentOnboarding.pdf>`__.
fr_ca: Si vous n'avez pas de compte AWS Educate, demandez à un mentor de `suivre ces étapes <https://www.firstinspires.org/sites/default/files/uploads/frc/AWSEducate_FIRST_MentorOnboarding.pdf>`__. Une fois qu'un mentor a terminé les étapes pré-citées, les étudiants doivent `suivre ces étapes suivantes <https://www.firstinspires.org/sites/default/files/uploads/frc/AWSEducate_FIRST_StudentOnboarding.pdf>`__.
tr_tr: Bir AWS Educate hesabınız yoksa, mentor'ınızdan, şu adımları izlemesini rica edin <https://www.firstinspires.org/sites/default/files/uploads/frc/AWSEducate_FIRST_MentorOnboarding.pdf>` __. Mentor'ınız bu adımları tamamladıktan sonra, öğrenciler `şu adımları <https://www.firstinspires.org/sites/default/files/uploads/frc/AWSEducate_FIRST_StudentOnboarding.pdf>` __ izlemelidir.
zh_cn: 如果您没有AWS Educate账户，请按照以下步骤<https://www.firstinspires.org/sites/default/files/uploads/frc/AWSEducate_FIRST_MentorOnboarding.pdf>`__进行指导。指导者完成这些步骤后，学生应“遵循这些步骤<https://www.firstinspires.org/sites/default/files/uploads/frc/AWSEducate_FIRST_StudentOnboarding.pdf>” __。

source: Open `AWS Educate <https://aws.amazon.com/education/awseducate/>`__. Log in to your account.
es_mx: Abra `AWS Educate <https://aws.amazon.com/education/awseducate/>`__. Ingrese a su cuenta.
fr_ca: Ouvrir `AWS Educate <https://aws.amazon.com/education/awseducate/>`__. Connectez-vous à votre compte.
tr_tr: `AWS Educate <https://aws.amazon.com/education/awseducate/> `__ sayfasını açın. Hesabınıza giriş yapın.
zh_cn: 打开`AWS Educate <https://aws.amazon.com/education/awseducate/>`__。登录到您的帐户。

source: Open up your Classroom.
es_mx: Abre tu salón de clases.
fr_ca: Ouvrir votre salle de classe.
tr_tr: Kendi sınıfınızı açın.
zh_cn: 打开您的教室。

source: Accept the Terms and Conditions, if presented.
es_mx: Acepte los Términos y Condiciones, si se presentan.
fr_ca: Accepter les conditions générales, lorsqu'elles sont présentées.
tr_tr: Eğer sunulmuşsa, Hüküm ve Koşulları kabul edin.
zh_cn: 接受条款和条件（如果有）。

source: Go to your classroom, and click continue.
es_mx: Vaya a su salón de clases y haga clic en continuar.
fr_ca: Accéder à votre classe et cliquer sur Continuer.
tr_tr: Sınıfınıza gidin ve "continue" seçeneğini tıklayın.
zh_cn: 转到您的教室，然后单击继续。

source: Open the AWS Console.
es_mx: Abra la consola de AWS.
fr_ca: Ouvrir la console AWS.
tr_tr: AWS Konsolunu açın.
zh_cn: 打开AWS控制台。

source: Search for S3 in the "Find Services" field. Open S3.
es_mx: Busque S3 en el campo "Buscar servicios". Abra S3.
fr_ca: Recherchez S3 dans le champ "Find Services". Ouvrez S3.
tr_tr: "Find Services" alanında S3'ü bulun. S3'ü açın.
zh_cn: 在“查找服务”字段中搜索S3。打开S3。

source: You will now create an S3 bucket. A bucket is a folder in the cloud with specific permissions.
es_mx: Ahora creará un depósito de S3. Un depósito es una carpeta en la nube con permisos específicos.
fr_ca: Vous allez maintenant créer un compartiment S3. Un "Bucket" est un dossier dans le "cloud" avec des autorisations spécifiques.
tr_tr: Şimdi bir S3 "bucket"ı oluşturacaksınız. Bucket yani paket, bulutta belirli izinlere sahip olan bir klasördür.
zh_cn: 现在，您将创建一个S3存储桶。存储桶是云中具有特定权限的文件夹。

source: Create a new bucket by giving it a unique name. Hit next until you reach the ``Set permissions`` page. On the third page, make sure it has public read permissions if multiple accounts will be using this data.
es_mx: Cree un nuevo depósito dándole un nombre único. Presione Siguiente hasta llegar a la página ``Establecer permisos``. En la tercera página, asegúrese de que tenga permisos de lectura públicos si varias cuentas utilizarán estos datos.
fr_ca: Créez un nouveau Bucket en lui attribuant un nom unique. Appuyez sur Next jusqu'à ce que vous atteigniez la page ``Set permissions``. Sur la troisième page, assurez-vous que votre Bucket dispose des autorisations de lecture publiques si plusieurs comptes utiliseront ces données.
tr_tr: Özgün bir ad vererek yeni bir bucket oluşturun. `` Set Permissions '' sayfasına ulaşana kadar next tuşuna basın. Üçüncü sayfada, bu verileri birden fazla hesap kullanacaksa, genel okuma izinlerine sahip olduğundan emin olun.
zh_cn: 通过为其指定一个唯一的名称来创建一个新的存储桶。单击下一步，直到到达``设置权限''页面。在第三页上，如果多个帐户将使用此数据，请确保它具有公共读取权限。

source: Now that the bucket has been created, go into the bucket, then ``Permission`` -> ``Access Control List``. Then change the public access to allow ``List objects`` and ``Read bucket permissions``.
es_mx: Ahora que se ha creado el depósito, vaya al depósito y luego a ``Permiso`` -> ``Lista de control de acceso``. Luego, cambie el acceso público para permitir ``Listar objetos`` y ``Leer permisos de depósito``.
fr_ca: Maintenant que le Bucket a été créé, aller dans le Bucket, puis sélectionner``Permission`` -> ``Access Control List``. Modifier ensuite l'accès public pour autoriser `List objects`` et ``Read bucket permissions``.
tr_tr: Bucket oluşturulduğuna göre, bucket'a gidin, ardından ``Permission '' -> `` Access Control List '' e tıklayın. Ardından genel erişim izinlerini, `` List objects'' ve `` Read bucket permissions`` komutarına izin verecek şekilde değiştirin.
zh_cn: 现在已经创建了存储桶，进入存储桶，然后进入``Permission''->``Access Control List''。然后更改公共访问权限以允许``列出对象''和``读取存储桶权限''。

source: Upload the ``.tar`` file that you downloaded (or made with Supervise.ly) into the new S3 bucket. Click "Add files", then select the file, click "Next", then make sure it also has public read permissions if multiple accounts will be using this data. Keep the file properties "Standard", and then click "Upload".
es_mx: Cargue el archivo ``.tar`` que descargó (o creó con Supervise.ly) en el nuevo deposito de S3. Haga clic en "Agregar archivos", luego seleccione el archivo, haga clic en "Siguiente", luego asegúrese de que también tenga permisos de lectura públicos si varias cuentas usarán estos datos. Mantenga las propiedades del archivo como "Estándar" y luego haga clic en "Cargar".
fr_ca: Faire un Upload du fichier `` .tar`` que vous avez téléchargé (ou créé avec Supervise.ly) dans le nouveau compartiment S3. Cliquez sur "Add files", puis sélectionnez le fichier, cliquez sur "Next", puis assurez-vous qu'il dispose également des autorisations de lecture publiques si plusieurs comptes utiliseront ces données. Conservez les propriétés du fichier "Standard", puis cliquez sur "Upload".
tr_tr: İndirdiğiniz (veya Supervise.ly ile oluşturduğunuz) “.tar '' dosyasını yeni S3 bucket klasörüne yükleyin. "Add Files" seçeneğini tıklayın, ardından dosyayı seçin, "Next" i tıklayın, ardından bu verileri birden fazla hesap kullanacaksa, genel okuma izinlerine sahip olduğundan emin olun. Dosya özelliklerini "Standard" olarak tutun ve ardından "Upload" seçeneğini tıklayın.
zh_cn: 将您下载（或用Supervise.ly制作）的.tar文件上传到新的S3存储桶中。单击“添加文件”，然后选择文件，单击“下一步”，如果多个帐户将使用此数据，请确保它也具有公共读取权限。保留文件属性为“标准”，然后单击“上传”。

source: Click the AWS logo in the top left to continue to the AWS Console main page.
es_mx: Haga clic en el logotipo de AWS en la parte superior izquierda para continuar a la página principal de la Consola de AWS.
fr_ca: Cliquez sur le logo AWS en haut à gauche pour continuer vers la page principale de la console AWS.
tr_tr: AWS Konsolu ana sayfasına devam etmek için sol üstteki AWS logosuna tıklayın.
zh_cn: 单击左上角的AWS徽标以继续到AWS Console主页。
