Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/machine-learning/using-inference-output.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Using Inference Output
es_mx: Usar salida de inferencia
fr_ca: Utilisant les Sorties d'Inférences
tr_tr: Inference Output'unu Kullanma
zh_cn: 使用推断输出

source: Unfortunately, this documentation is outdated and the methods described here are no longer functional. We are currently working on an a successor project and advise teams to research into a `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ solution in the meantime.
es_mx: Lamentablemente, esta documentación está obsoleta y los métodos descritos aquí ya no son funcionales. Actualmente estamos trabajando en un proyecto sucesor y aconsejamos a los equipos que investiguen una solución `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ por el momento.
fr_ca: Malheureusement, cette documentation est dépassée et les méthodes décrites ici ne sont plus fonctionnelles. Nous travaillons actuellement sur un projet successeur et conseillons aux équipes de rechercher une solution `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__ entre-temps.
tr_tr: Ne yazık ki bu dokümantasyon güncelliğini yitirmiştir ve burada açıklanan yöntemler artık işlevsel değildir. Şu anda bir ardıl proje üzerinde çalışıyoruz ve ekiplere bu arada bir `tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>` __ çözümü üzerinde araştırma yapmalarını tavsiye ediyoruz.
zh_cn: 不幸的是，该文档已过时，此处描述的方法不再起作用。我们目前正在进行一个后续项目，并建议团队同时研究`tensorflow <https://coral.ai/docs/edgetpu/retrain-detection/>`__解决方案。

source: The Raspberry Pi writes all detection information to NetworkTables, which can be used by your robot code. Below is a Java example for parsing and using this data.
es_mx: La Raspberry Pi escribe toda la información de detección en NetworkTables, que puede ser utilizada por su código de robot. A continuación se muestra un ejemplo de Java para analizar y utilizar estos datos.
fr_ca: Le Raspberry Pi écrit tout l'information de détection aux NetworkTables, et celle-ci peut être utilisé par votre code de robot. Ci-dessous, un exemple Java pour analyser et utiliser ces données.
tr_tr: Raspberry Pi, tüm algılama bilgilerini robot kodunuz tarafından kullanılabilen NetworkTables'a yazar. Aşağıda, bu verileri ayrıştırmak ve kullanmak için bir Java örneği verilmiştir.
zh_cn: Raspberry Pi将所有检测信息写入NetworkTables，您的机器人代码可以使用该信息。以下是用于解析和使用此数据的Java示例。

source: **NetworkTables Format**
fr_ca: **Format NetworkTables**
zh_cn: ** NetworkTables格式**

source: ``ML`` – The table containing all inference data.
es_mx: ``ML`` – La tabla que contiene todos los datos de inferencia.
fr_ca: ``ML`` - La table qui contient tout les données d'inférence.
tr_tr: ``ML`` - Tüm inference yani çıkarım verilerini içeren tablodur.
zh_cn: ML –包含所有推断数据的表。

source: ``nb_objects`` – the number (double) of detected objects in the current frame.
es_mx: ``nb_objects`` – el número (doble) de objetos detectados en el cuadro actual.
fr_ca: ``nb_objects`` – le nombre (format: double) d'objets détectés dans le cadre actuel.
tr_tr: ``nb_objects`` - geçerli çerçevede tespit edilen nesnelerin sayısıdır (iki katı görünür).
zh_cn: ``nb_objects`` –当前帧中检测到的对象的数量（双精度）。

source: ``object_classes`` – a string array of the class names of each object. These are in the same order as the coordinates.
es_mx: ``object_classes`` – una matriz de cadenas de los nombres de clase de cada objeto. Están en el mismo orden que las coordenadas.
fr_ca: ``object_classes`` – un tableau de chaînes de caractères des noms de la classe de chaque objet. Ils sont dans le même ordre que les coordonnées.
tr_tr: ``object_classes`` - her nesnenin sınıf adlarının bir dize halinde dizilişidir. Bunlar koordinatlarla aynı sıradadırlar.
zh_cn: ``object_classes`` –每个对象的类名的字符串数组。这些与坐标的顺序相同。

source: ``boxes`` – a double array containing the coordinates of every detected object. The coordinates are in the following format: [top_left__x1, top_left_y1, bottom_right_x1, bottom_right_y1, top_left_x2, top_left_y2, ... ]. There are four coordinates per box. A way to parse this array in Java is shown below.
es_mx: ``boxes`` – una matriz doble que contiene las coordenadas de cada objeto detectado. Las coordenadas están en el siguiente formato: [top_left__x1, top_left_y1, bottom_right_x1, bottom_right_y1, top_left_x2, top_left_y2, ...]. Hay cuatro coordenadas por caja. A continuación se muestra una forma de analizar esta matriz en Java.
fr_ca: ``boxes`` – un tableau (format:double) qui contient les coordonnées de chaque objet détecté. Les coordonnées sont dans le format suivant: [haut_gauche__x1, haut_gauche_y1, bas_droit_x1, bas_droit_y1, haut-gauche_x2, haut_gace_y2, ...]. Il y a quatre coordonnées par boîte. Une façon d'analyser ce tableau en Java est illustré ci-dessous.
tr_tr: ``boxes`` - tespit edilen her nesnenin koordinatlarını içeren çift sıralı dizi. Koordinatlar şu formattadır: [top_left__x1, top_left_y1, bottom_right_x1, bottom_right_y1, top_left_x2, top_left_y2, ...]. Kutu başına dört koordinat bulunur. Bu diziyi Java'da çözümlemenin bir yolu aşağıda gösterilmiştir.
zh_cn: “ boxes” –包含每个检测到的对象的坐标的双精度数组。坐标采用以下格式：[top_left__x1，top_left_y1，bottom_right_x1，bottom_right_y1，top_left_x2，top_left_y2，...]。每个框有四个坐标。下面显示了一种使用Java解析此数组的方法。

source: The below ``VisionSubsystem`` Java class parses the data from NetworkTables and stores it in a usable way.
es_mx: La siguiente clase de Java ``VisionSubsystem`` analiza los datos de NetworkTables y los almacena de una manera utilizable.
fr_ca: La classe Java ci-dessous ``VisionSubsystem`` analyse les données de NetworkTables et les garde de manière utilisable.
tr_tr: Aşağıdaki `` VisionSubsystem`` Java dersi, NetworkTables'daki verileri ayrıştırır ve kullanılabilir bir şekilde depolar.
zh_cn: 下面的VisionSubsystem Java类解析NetworkTables中的数据并以可用的方式存储它。

source: Example code coming soon!
es_mx: ¡Código de ejemplo próximamente!
fr_ca: Exemple de code à venir!
tr_tr: Örnek kod çok yakında verilecek!
zh_cn: 示例代码即将推出！

source: Todo
es_mx: Que hacer
fr_ca: Ce qui reste à faire
tr_tr: Yapılışı
zh_cn: 待办事项

source: Code example should be in allwpilib
es_mx: El ejemplo de código debe estar en allwpilib
fr_ca: L'exemple de code devrait être en allwpilib
tr_tr: Kod örneği allwpilib'de olmalıdır.
zh_cn: 代码示例应该在allwpilib中

source: Using the arrays created by the ``VisionSubsystem``, one can make a simple command to turn to face a game piece. In this example, a hatch is used. One thing to note is the ~15fps of inference attained by a Google Coral is not fast enough for PID input directly, however calculating the relative heading of a game piece and then turning to that heading works accurately.
es_mx: Usando las matrices creadas por el ``VisionSubsystem``, uno puede hacer un comando simple para girar para enfrentar una pieza del juego. En este ejemplo, se utiliza una trampilla. Una cosa a tener en cuenta es que los ~15fps de inferencia alcanzados por Google Coral no son lo suficientemente rápidos para la entrada de PID directamente, sin embargo, calcular el título relativo de una pieza del juego y luego girar a ese título funciona con precisión.
fr_ca: On peut utiliser les tableaux crée par le ``VisionSubsystem`` pour créer une commande simple pour faire face à une pièce de jeu. Dans cette exemple, un panneau d'écoutille est utilisé. Quelque chose à noter est que le ~15fps de l'inférence atteint avec Google Coral n'est pas assez vite pour agir directement comme une entrée PID , cependant, pour calculer le cap relatif d'une pièce de jeu et tourner vers celle-ci, cela fonctionne avec précision.
tr_tr: ``VisionSubsystem`` tarafından oluşturulan dizileri kullanarak, oyunun bir parçasını görüntülemek için basit bir komut verilebilir. Bu örnekte bir "hatch" kullanılmıştır. Bir Google Coral tarafından elde edilen ~ 15 fps'lik inference'ın doğrudan PID girişi için yeterince hızlı olmadığı, ancak bir oyun parçasının göreceli başlığının hesaplanması ve ardından o başlığa dönülmesi halinde doğru şekilde çalıştığını hatırlatmakta fayda var.
zh_cn: 使用``VisionSubsystem''创建的数组，可以做出一个简单的指令来面对游戏作品。在此示例中，使用阴影线。需要注意的一件事是，Google Coral所获得的〜15fps推理速度不足以直接进行PID输入，但是要计算游戏棋子的相对航向，然后准确转向该航向即可。
