Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controls-glossary.po
Languages: es_mx, fr_ca, tr_tr

source: Controls Glossary
es_mx: Glosario de Control
fr_ca: Glossaire des commandes
tr_tr: Kontroller Sözlüğü

source: control effort
es_mx: Esfuerzo de control
fr_ca: Effort de contrôle
tr_tr: Kontrol çabası - control effort

source: A term describing how much force, pressure, etc. an actuator is exerting.
es_mx: Un término que describe cuanta fuerza, presión, etc. un actuador está ejerciendo.
tr_tr: Bir aktüatörün ne kadar kuvvet, basınç vb. uyguladığını açıklayan bir terim.

source: control input
es_mx: entrada de control
tr_tr: Kontrol girişi - control input

source: The input of a :term:`plant` used for the purpose of controlling it
es_mx: La entrada de una :term:`planta` usada con el propósito de controlarla.
tr_tr: Kontrol etmek amacıyla kullanılan bir :term:`plant` girdisi

source: control law
es_mx: ley de control
fr_ca: la loi de commande
tr_tr: Kontrol kanunu - control law

source: A mathematical formula that generates :term:`inputs <input>` to drive a :term:`system` to a desired :term:`state`, given the current :term:`state`. A common example is the control law :math:`\mathbf{u} = \mathbf{K(r - x)}`
es_mx: Una fórmula matemática que genera :term:`entradas <input>`para conducir un :term:`sistema` a un: :term:`estado` deseado, dado el actual :term:`estado`. Un ejemplo común es la ley de control :math:`\mathbf{u} = \mathbf{K(r - x)}`
fr_ca: Une formule mathématique qui génère des :term:`entrées<input>` pour conduire un :term:`Système` vers un :term:`état`, étant donné :term:`l’état` courant. Un exemple courant est la loi de contrôle :math:`\mathbf{u} = \mathbf{K(r - x)}`
tr_tr: Varolan :term:`state` dikkate alınarak bir :term:`system` i istenilen :term:`state` a getirmek için gerekli :term:`inputs <input>` ları üreten matematiksel formüldür. Yaygın bir kontrol yasası örneği :math:`\mathbf{u} = \mathbf{K(r - x)}`

source: controller
fr_ca: manette
tr_tr: Kontrolör - Controller

source: Used in position or negative feedback with a :term:`plant` to bring about a desired :term:`system state <state>` by driving the difference between a :term:`reference` signal and the :term:`output` to zero.
es_mx: Usado en una posición o compensación negativa en una :term:`planta` para llegar al deseado :term:`estado del sistema <state>` haciendo cero la diferencia entre la señal de :term:`referencia` y la :term:`salida`.
fr_ca: Utilisé en position ou rétroaction négative avec l’ :term:`Usine` pour amener un :term:`état du système<state>` souhaité en forçant la différence entre le signal de :term:`Référence` et la :term:`Sortie` vers zéro.
tr_tr: :term:`reference` sinyali ile :term:`output` arasındaki farkı sıfıra sürerek istenen :term:`system state <state>` yi oluşturmak için :term:`plant` i pozisyonlamak veya negatif geri beslemede kullanılır .

source: dynamics
es_mx: dinámica
fr_ca: dynamique
tr_tr: dinamikler - dynamics

source: A branch of physics concerned with the motion of bodies under the action of forces. In modern control, systems evolve according to their dynamics.
es_mx: Rama de la física que se ocupa del movimiento de los cuerpos bajo la acción de fuerzas. En el control moderno, los sistemas evolucionan según su dinámica.
fr_ca: Une branche de la physique concernée par le mouvement des corps sous l'action des forces. Dans le contrôle moderne, les systèmes évoluent en fonction de leur dynamique.
tr_tr: Kuvvetlerin etkisi altındaki cisimlerin hareketiyle ilgilenen bir fizik dalı. Modern kontrolde sistemler dinamiklerine göre gelişir.

source: error
fr_ca: Erreur
tr_tr: hata - error

source: :term:`Reference <reference>` minus an :term:`output` or :term:`state`.
es_mx: Es la :term:`referencia <reference>` menos la :term:`salida` o el :term:`estado`.
fr_ca: :term:`Référence<reference>` moins la :term:`Sortie` ou :term:`état`.
tr_tr: :term:`Reference <reference>` minus an :term:`output` veya :term:`state`.

source: gain
es_mx: ganancia
fr_ca: le gain
tr_tr: kazanç - gain

source: A proportional value that relates the magnitude of an input signal to the magnitude of an output signal. In the signal-dimensional case, gain can be thought of as the proportional term of a PID controller. A gain greater than one would amplify an input signal, while a gain less than one would dampen an input signal. A negative gain would negate the input signal.
es_mx: Un valor proporcional que relaciona la magnitud de una señal de entrada con la magnitud de una señal de salida. En el caso de la dimensión de la señal, la ganancia se puede considerar como el término proporcional de un controlador PID. Una ganancia mayor que uno amplificaría una señal de entrada, mientras que una ganancia menor que uno amortiguaría una señal de entrada. Una ganancia negativa anularía la señal de entrada.
tr_tr: Bir giriş sinyalinin büyüklüğünü bir çıkış sinyalinin büyüklüğüyle ilişkilendiren orantılı bir değer. Sinyal boyutlu durumda, kazanç bir PID kontrolörünün orantılı terimi olarak düşünülebilir. Birden büyük bir kazanç, bir giriş sinyalini yükseltirken, birden az bir kazanç, bir giriş sinyalini zayıflatır. Negatif bir kazanç, giriş sinyalini olumsuz etkileyecektir.

source: hidden state
es_mx: estado oculto
fr_ca: l'état caché
tr_tr: gizli durum - hidden state

source: A :term:`state` that cannot be directly measured, but whose :term:`dynamics` can be related to other states.
es_mx: Un :term:`estado` que no se puede medir directamente, pero cuya :term:`dinámica` puede relacionarse con otros estados.
fr_ca: Un :term:`état` qui ne peut pas être mesuré directement, mais dont la :term:`dynamique` peut être liée à d'autres états.
tr_tr: :term:`state` terimi doğrudan ölçülemeyen, ancak :term:`dynamics` terimi diğer durumlarla ilgili olabilen durum.

source: input
es_mx: entrada
fr_ca: Entrée
tr_tr: giriş - input

source: An input to the :term:`plant` (hence the name) that can be used to change the :term:`plant's <plant>` :term:`state`.
es_mx: Una entrada a la :term:`planta` (circuito) que puede modificar el :term:`estado` de la :term:`planta <plant>`.
fr_ca: Une entrée pour :term:`Usine` (d'où le nom) qui peut être utilisée pour changer :term:`l'état` de :term:`Usine<plant>`.
tr_tr: :term:`plant'in <plant>` :term:`state` - durumu değiştirmek için kullanılabilen :term:`plant` (adı ile ilgili) için bir girdi.

source: Ex. A flywheel will have 1 input: the voltage of the motor driving it.
es_mx: Ej. Un volante tendrá 1 entrada: el voltaje del motor que lo impulsa.
fr_ca: Ex. Un volant d'inertie aura 1 entrée: la tension du moteur qui l'entraîne.
tr_tr: Örn. Bir tekerleği kontrol eden motorun: 1 voltaj girişi olacaktır.

source: Ex. A drivetrain might have 2 inputs: the voltages of the left and right motors.
es_mx: Ej. Un drivetrain puede tener 2 entradas: los voltajes de los motores izquierdo y derecho.
fr_ca: Ex. Un groupe motopropulseur peut avoir 2 entrées: les tensions des moteurs gauche et droit.
tr_tr: Örn. Bir sürüş tasarımının, sol ve sağ motorların voltajları olarak: 2 girişi olabilir .

source: Inputs are often represented by the variable :math:`\mathbf{u}`, a column vector with one entry per :term:`input` to the :term:`system`.
es_mx: Las entradas a menudo son representadas mediante la variable :math:`\mathbf{u}`, un vector de columna con una entrada por :term:`input` a :term:`system`.
fr_ca: Les entrées sont souvent représentées par la variable :math:`\mathbf{u}`, un vecteur de colonne avec une entrée par:term:`Entrées` au :term:`Système`.
tr_tr: Girişler genellikle :math:`\mathbf{u}` değişkeni ile temsil edilir, sütun vektörü :term:`system` için :term:`input` başına bir giriş içerir.

source: measurement
es_mx: medición
fr_ca: la mesure
tr_tr: ölçüm - measurement

source: Measurements are :term:`outputs <output>` that are measured from a :term:`plant`, or physical system, using sensors.
es_mx: Las mediciones son :term:`salidas <output>` que se miden a partir de una :term:`planta`, o sistema físico, utilizando sensores.
fr_ca: Les mesures sont des :term:`Sorties` qui sont mesurées à partir d'un :term:`procédé`, ou un système physique, à l'aide de capteurs.
tr_tr: Ölçümler şunlardır :term:`outputs <output>` , sensörler kullanılarak bir :term:`plant` veya fiziksel sistemden ölçülür.

source: A set of mathematical equations that reflects some aspect of a physical :term:`system's <system>` behavior.
es_mx: Un conjunto de ecuaciones matemáticas que refleja algunos aspectos de un comportamiento físico del :term:`sistema <system>`.
fr_ca: Un ensemble d'équations mathématiques qui reflète certains aspects du comportement physique d'un :term:`Système<system>`.
tr_tr: Fiziksel bir :term:`system'in <system>` davranışının bazı yönlerini yansıtan bir dizi matematiksel denklem.

source: moment of inertia
es_mx: momento de inercia
tr_tr: eylemsizlik momenti - moment of inertia

source: A measurement of a rotating body's resistance to angular acceleration or deceleration. Angular moment of inertia can be thought of as angular mass. See also: `Moment of inertia <https://en.wikipedia.org/wiki/Moment_of_inertia>`__.
es_mx: Una medida de la resistencia de un cuerpo en rotación a la aceleración o desaceleración angular. El momento de inercia angular se puede considerar como una masa angular. Ver también: `Momento de inercia <https://en.wikipedia.org/wiki/Moment_of_inertia>`__.
tr_tr: Dönen bir cismin gövdesinin açısal hızlanma veya yavaşlamaya karşı direncinin bir ölçüsü. Açısal eylemsizlik momenti, açısal kütle olarak düşünülebilir. Ayrıca bkz .: `Moment of inertia <https://en.wikipedia.org/wiki/Moment_of_inertia>`__.

source: observer
es_mx: observador
fr_ca: Observateur
tr_tr: onserver - gözlemci

source: In control theory, a system that provides an estimate of the internal :term:`state` of a given real :term:`system` from measurements of the :term:`input` and :term:`output` of the real :term:`system`. WPILib includes a Kalman Filter class for observing linear systems, and ExtendedKalmanFilter and UnscentedKalmanFilter classes for nonlinear systems.
es_mx: En la teoría de control, un sistema que proporciona una estimación del :term:`estado` interno de un :term:`sistema` real dado a partir de las mediciones del :term:`entrada`y :term:`salida` del :term:`sistema` real. WPILib incluye una clase de filtro de Kalman para observar sistemas lineales y las clases ExtendedKalmanFilter y UnscentedKalmanFilter para sistemas no lineales.
fr_ca: Dans la théorie du contrôle, un système qui fournit une estimation de l' :term:`état` interne d'un :term:`système` réel à partir de mesures des :term:`Entrées` et de la :term:`Sortie` du :term:`système`. WPILib inclut une classe de filtre Kalman pour l'observation des systèmes linéaires, et les classes ExtendedKalmanFilter et UnscentedKalmanFilter pour les systèmes non linéaires.
tr_tr: Kontrol teorisinde, gerçek bir :term:`system` in dahili :term:`state` için verilen gerçek :term:`input` ve :term:`output` ölçümlerinden tahmini :term:`state` sağlayan bir sistemdir. WPILib, doğrusal sistemleri gözlemlemek için bir Kalman Filtresi sınıfı ve doğrusal olmayan sistemler için ExtendedKalmanFilter ve UnscentedKalmanFilter sınıflarını içerir.

source: output
fr_ca: Le paramètre Output (Sortie)
tr_tr: çıktı

source: Measurements from sensors. There can be more measurements then states. These outputs are used in the "correct" step of Kalman Filters.
es_mx: Medidas de sensores. Puede haber más medidas que estados. Estas salidas se utilizan en el paso "correcto" de los filtros de Kalman.
fr_ca: Mesures des capteurs. Il peut y avoir plus de mesures que d'états. Ces sorties sont utilisées dans l'étape «correcte» des filtres de Kalman.
tr_tr: Sensörlerden ölçümler. Durumlardan - state daha fazla ölçüm olabilir. Bu çıktılar Kalman Filtrelerinin "correct-doğru" adımında kullanılır.

source: Ex. A flywheel might have 1 :term:`output` from a encoder that measures it's velocity.
es_mx: Ej. Un volante puede tener 1 :term:`salida` de un codificador que mide su velocidad.
fr_ca: Ex. Un volant peut avoir une :term:`sortie` d'un encodeur qui mesure sa vitesse.
tr_tr: Örn. Bir döner tekerin, hızını ölçen bir encoderin 1 :term:`output` u olabilir.

source: Ex. A drivetrain might use solvePNP and V-SLAM to find it's x/y/heading position on the field. It's fine that there are 6 measurements (solvePNP x/y/heading and V-SLAM x/y/heading) and 3 states (robot x/y/heading).
es_mx: Ej. Un tren motriz puede usar solvePNP y V-SLAM para encontrar su posición x/y/posición de frente en el campo. Está bien que haya 6 medidas (solvePNP x/y/frente y V-SLAM x/y/frente) y 3 estados (robot x/y/frente).
fr_ca: Ex. Un groupe motopropulseur peut utiliser solvePNP et V-SLAM pour trouver sa position x/y/cap sur le terrain. C'est bien qu'il y ait 6 mesures (résoudrePNP x/y/cap et V-SLAM x/y/cap) et 3 états (robot x/y/cap).
tr_tr: Örn. Bir sürüş organı, sahadaki x/y/baş konumunu bulmak için solvePNP ve V-SLAM kullanabilir. 6 ölçüm (solvePNP x/y/baş ve V-SLAM x/y/heading) ve 3 durum (robot x/y/heading) olması sorun değil.

source: Outputs of a :term:`system` are often represented using the variable :math:`\mathbf{y}`, a column vector with one entry per :term:`output` (or thing we can measure). For example, if our :term:`system` had states for velocity and acceleration but our sensor could only measure velocity, our, our :term:`output` vector would only include the :term:`system`\'s velocity.
es_mx: Las salidas de un :term:`sistema` a menudo se representan usando la variable :math:`\mathbf{y}`, un vector de columna con una entrada por :term:`salida` (o cosa que podamos medir). Por ejemplo, si nuestro :term:`sistema` tuviera estados para la velocidad y la aceleración pero nuestro sensor solo pudiera medir la velocidad, nuestro, nuestro el vector de :term:`salida` solo incluiría la velocidad del :term:`sistema`.
fr_ca: Les sorties d'un :term:`Système` sont souvent représentées en utilisant la variable :math:`\mathbf{y}`, un vecteur de colonne avec une entrée par :term:`Sortie` (ou chose que nous pouvons mesurer). Par exemple, si notre :term:`Système` avait des états pour la vitesse et l'accélération mais que notre capteur ne pouvait mesurer que la vitesse, notre vecteur :term:`Sortie` inclurait seulement la vitesse du :term:`Système`.
tr_tr: :term:`system` in çıktıları genellikle :math:`\mathbf{y}` değişkeni kullanılarak, her bir :term:`output` (veya ölçebildiğimiz şey) başına bir giriş içeren bir sütun vektörü ile temsil edilir. Örneğin, :term:`system` hız ve ivme için durumlara sahipse ancak sensörümüz yalnızca hızı ölçebiliyorsa, bizim :term:`output` vektörümüz yalnızca :term:`system` 'in hızını içerecektir.

source: plant
es_mx: planta
fr_ca: Usine
tr_tr: plant - tesis

source: The :term:`system` or collection of actuators being controlled.
es_mx: El :term:`sistema` o el conjunto de actuadores siendo controlados.
fr_ca: Le :term:`Système` ou l'ensemble des actionneurs contrôlés.
tr_tr: :term:`system` veya kontrol edilen aktüatörlerin toplamı.

source: process variable
es_mx: variable de proceso
fr_ca: Variable de procédé
tr_tr: süreç değişkeni - process variable

source: The term used to describe the output of a :term:`plant` in the context of PID control.
es_mx: Término usado para describir la salida de una :term:`planta `en contexto del control PID.
fr_ca: Le terme utilisé pour décrire la sortie de l’ :term:`Usine` dans le contexte du contrôle PID.
tr_tr: PID kontrolü bağlamında :term:`plant` in çıktısını açıklamak için kullanılan terim.

source: reference
es_mx: referencia
fr_ca: Référence
tr_tr: referans - reference

source: The desired state. This value is used as the reference point for a controller's error calculation.
es_mx: El estado deseado. Este valor es usado como punto de referencia para que el controlador calcule el error.
fr_ca: L'état souhaité. Cette valeur est utilisée comme point de référence pour le calcul d'erreur d'un contrôleur.
tr_tr: İstenilen durum. Bu değer, bir kontrol cihazının hata hesaplaması için referans noktası olarak kullanılır.

source: rise time
es_mx: tiempo de subida
fr_ca: Temps de montée
tr_tr: Yükseliş zamanı - rise time

source: The time a :term:`system` takes to initially reach the :term:`reference` after applying a :term:`step input`.
es_mx: Es el tiempo que le lleva al :term:`sistema` alcanzar la :term:`referencia` después de haber aplicado la :term:`entrada unitaria`.
fr_ca: Le temps qu'un :term:`Système` prend pour atteindre initialement la :term:`Référence` après avoir appliqué une :term:`Impulsion d'entrée`.
tr_tr: : term: "system", a: term: "step input" uygulandıktan sonra: term: "reference" ye ulaşmak için gereken süre.

source: setpoint
es_mx: punto de referencia
fr_ca: Point de consigne
tr_tr: ayar noktası - set point

source: The term used to describe the :term:`reference` of a PID controller.
es_mx: Término usada para describir la :term:`referencia` de un controlador PID.
fr_ca: Le terme utilisé pour décrire la :term:`Référence` d'un contrôleur PID.
tr_tr: Bir PID kontrolörünün :term:`reference` nı açıklamak için kullanılan terim.

source: settling time
es_mx: tiempo de estabilización
fr_ca: Temps de stabilisation
tr_tr: yerleşme zamanı - settling time

source: The time a :term:`system` takes to settle at the :term:`reference` after a :term:`step input` is applied.
es_mx: Es el tiempo que le lleva al :term:`sistema` estabilizarse en la :term:`referencia` después de haber aplicado la :term:`entrada unitaria`.
fr_ca: Le temps qu'un :term:`Système` prend pour se stabiliser au point de :term:`Référence` après l'application d'une :term:`Impulsion d'entrée`.
tr_tr: :term:`step input` uygulandıktan sonra :term:`system` in :term:`reference` ye yerleşmesi için geçen süre.

source: state
es_mx: estado
fr_ca: état
tr_tr: durum - state

source: A characteristic of a :term:`system` (e.g., velocity) that can be used to determine the :term:`system's <system>` future behavior. In state-space notation, the state of a system is written as a column vector describing it's position in state-space.
es_mx: Una característica de un :term:`sistema` (por ejemplo, la velocidad) que se puede utilizar para determinar el comportamiento futuro del :term:`sistema<system>`. En la notación del espacio de estados, el estado de un sistema se escribe como un vector de columna que describe su posición en el espacio de estados.
fr_ca: Une caractéristique d'un :term:`Système` (par exemple, la vitesse) qui peut être utilisée pour déterminer le comportement futur du :term:`Système`. Dans la notation d'espace d'états, l'état d'un système est écrit sous la forme d'un vecteur de colonne décrivant sa position dans l'espace d'états.
tr_tr: :term:`system` 'in (örneğin hız) term:`sistem'in <system>` gelecekteki davranışını belirlemek için kullanılabilen bir özelliği. Durum-uzayı gösteriminde, bir sistemin durumu, durum uzayındaki konumunu tanımlayan bir sütun vektörü olarak yazılır.

source: Ex. A drivetrain system might have the states :math:`\begin{bmatrix}x \\ y \\ \theta \end{bmatrix}` to describe it's position on the field.
es_mx: Ej. Un sistema de chasis puede tener los estados :math:`\begin{bmatrix}x \\ y \\ \theta \end{bmatrix}` para describir su posición en la cancha.
fr_ca: Ex. Un système de transmission peut avoir les états :math:`\ begin {bmatrix} x \\ y \\ \ theta \ end {bmatrix}` pour décrire sa position sur le terrain.
tr_tr: Örn. Bir sürüş organı sistemi, alandaki konumunu açıklamak için şu durumlara sahip olabilir :math:`\begin{bmatrix}x \\ y \\ \theta \end{bmatrix}`

source: Ex. An elevator system might have the states :math:`\begin{bmatrix} \text{position} \\ \text{velocity} \end{bmatrix}` to describe its current height and velocity.
es_mx: Ej. Un sistema de elevador puede tener los estados :math:`\begin{bmatrix} \text{position} \\ \text{velocity} \end{bmatrix}` para describir su altura y velocidad actual.
fr_ca: Ex. Un système d'ascenseur peut avoir les états :math:`\ begin {bmatrix} \ text {position} \\ \ text {vitesse} \ end {bmatrix}` pour décrire sa hauteur et sa vitesse actuelles.
tr_tr: Örn. Bir elevator sistemi şu durumlara sahip olabilir, mevcut yüksekliğini ve hızını tanımlamak için :math:`\begin{bmatrix} \text{position} \\ \text{velocity} \end{bmatrix}`.

source: A :term:`system's <system>` state is often represented by the variable :math:`\mathbf{x}`, a column vector with one entry per :term:`state`.
es_mx: Un estado del :term:`sistema <system>` seguido es representado por la variable :math:`\mathbf{x}`, un vector de columna con una entrada por :term:`estado`.
fr_ca: L'état du :term:`Système` est souvent représenté par la variable :math:`\mathbf{x}`, un vecteur de colonne avec une entrée par :terme:`état`.
tr_tr: :term:`systemin <system>` durumu genellikle:math:`\mathbf{x}` değişkeni ile temsil edilir, her bir: :term:`state` için bir giriş içeren bir sütun vektörü.

source: steady-state error
es_mx: error de estado estable
fr_ca: Erreur régime permanant
tr_tr: kararlı durum hatası - steady-state error

source: :term:`Error <error>` after :term:`system` reaches equilibrium.
es_mx: Es el term:`error <error>` después que el :term:`sistema` alcanza el equilibrio.
fr_ca: :term:`Erreur<error>` obtenue après que le :term:`système` a atteint l'équilibre.
tr_tr: :term:`sistem` dengeye ulaştıktan sonraki :term:`Error <error>` .

source: step input
es_mx: entrada unitaria
fr_ca: Impulsion d'entrée
tr_tr: adım girişi - step input

source: A :term:`system` :term:`input` that is :math:`0` for :math:`t < 0` and a constant greater than :math:`0` for :math:`t \geq 0`. A step input that is :math:`1` for :math:`t \geq 0` is called a unit step input.
es_mx: Una :term:`entrada` del :term:`sistema` que es :math:`0` para :math:`t < 0` y una constante mayor que :math:`0` para :math:`t \geq 0`. Una entrada unitaria que es :math:`1` para :math:`t \geq 0` se le llama unit step input.
fr_ca: Une :term:`Entrée` de :term:`Système` prenant la forme :math:`0` pour :math:`t <0` et une constante supérieure à :math:`0` pour :math:`t \geq 0`. Une impulsion d'entrée qui a pour valeur :math:`1` pour :math:`t \geq 0` est appelée une impulsion d'entrée unitaire.
tr_tr: :term:`system` :term:`input` yani :math:`0` için :math:`t < 0` ve şundan büyük bir :math:`t \geq 0` için sabit :math:`0` . :math:`t \geq 0` için :math:`1` olan bir adım girdisine step input denir.

source: step response
es_mx: respuesta Unitaria
fr_ca: Réponse d'impulsion
tr_tr: adım yanıtı - step response

source: The response of a :term:`system` to a :term:`step input`.
es_mx: Es la respuesta del :term:`sistema` a una :term:`entrada unitaria`.
fr_ca: La réponse du :term:`Système` à une :term:`Impulsion d'entrée`.
tr_tr: :term:`system` in :term:`step input` a yanıtı.

source: system
es_mx: sistema
fr_ca: Système
tr_tr: sistem - system
