Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controls-glossary.po
Languages: es_mx, fr_ca, tr_tr

source: A term encompassing a :term:`plant` and it's interaction with a :term:`controller` and :term:`observer`, which is treated as a single entity. Mathematically speaking, a :term:`system` maps :term:`inputs <input>` to :term:`outputs <output>` through a linear combination of :term:`states <state>`.
es_mx: Un término que comprende a la :term:`planta` y su interacción con el :term:`controlador` y el :term:`observador`, que es tratado como una sola entidad. Matemáticamente hablando, un :term:`sistema` mapeado de :term:`entradas <input>` hacia :term:`salidas <output>` a través de una combinación linear de :term:`estados <state>`.
fr_ca: Un terme englobant l’ :term:`Usine` et son intéraction avec le :term:`Contrôleur` et l’ :term:`Observateur`, qui est traité comme une seule entité. Mathématiquement parlant, un :term:`Système` mappe les :term:`Entrées<input>` aux :term:`Sorties<output>` via une combinaison linéaire d’ :term:`États<state>`.
tr_tr: Tek bir varlık olarak değerlendirilen :term:`plant` ve bir:term:`controller` ve :term:`observer` ile etkileşimini kapsayan bir terim. Matematiksel olarak konuşursak, :term:`system` , :term:`states <state>` durumlarının doğrusal bir kombinasyonu aracılığıyla :term:`inputs <input>` 'u :term:`outputs <output>` a bağlar.

source: system identification
es_mx: identificación del sistema
fr_ca: l'identification du système
tr_tr: sistem kimliği - system identification

source: system response
es_mx: Respuesta del sistema
fr_ca: Réponse du système
tr_tr: sistem yanıtı - system response

source: The behavior of a :term:`system` over time for a given :term:`input`.
es_mx: Es el comportamiento de un :term:`sistema` durante un tiempo después de aplicar una :term:`entrada`.
fr_ca: Le comportement d'un :term:`Système` dans le temps pour une :term:`Entrée` donnée.
tr_tr: Belirli bir :term:`input` için :term:`system` in zaman içindeki davranışı.

source: :math:`\dot{\mathbf{x}}`, or x-dot: the derivative of the :term:`state` vector :math:`\mathbf{x}`. If the :term:`system` had just a velocity :term:`state`, then :math:`\dot{\mathbf{x}}` would represent the :term:`system`\'s acceleration.
es_mx: :math:`\dot{\mathbf{x}}`, o punto x: la derivada del vector :term:`state` vector :math:`\mathbf{x}`. Si el :term:`system` tuviera solo una velocidad :term:`state`, entonces :math:`\dot{\mathbf{x}}` representaría la :term:`system`\'s aceleración.
fr_ca: :math:`\dot{\mathbf{x}}`, ou x-point: la dérivée du vecteur :term:`d’état` :math:`\mathbf{x}`. Si le :term:`système` avait juste une vitesse comme :term:`état`, alors :math:`\dot{\mathbf{x}}` représenterait l'accélération du :term:`système`.
tr_tr: :math:`\dot{\mathbf{x}}` veya x-dot, :term:`state` vektörünün türevi :math:`\mathbf{x}`. Eğer :term:`system` sadece bir hıza sahipse :term:`state`, o zaman :math:`\dot{\mathbf{x}}` :term:`system` ivmesini temsil eder.

source: :math:`\hat{\mathbf{x}}`, or x-hat: the estimated :term:`state` of a system, as estimated by an :term:`observer`.
es_mx: :math:`\hat{\mathbf{x}}`, o x-hat: el :term:`estado` estimado de un sistema, como es estimado por un :term:`observador`.
fr_ca: :math:`\hat{\mathbf{x}}`, ou x-châpeau: l'estimation de :term:`l’état` d'un système, tel qu'il serait estimé par un :term:`observateur`.
tr_tr: :math:`\hat{\mathbf{x}}` veya x-hat: bir :term:`observer` tarafından tahmin edildiği gibi, bir sistemin tahmini :term:`state` dir.

source: model
es_mx: modelo
fr_ca: Modèle

source: x-dot
es_mx: punto x
fr_ca: x-point

source: The process of capturing a :term:`systems <system>` :term:`dynamics` in a mathematical model using measured data. The SysId toolsuite uses system identification to find kS, kV and kA terms.
fr_ca: Le processus de capture d'un :term:`systèmes <system>` :term:`dynamique` dans un modèle mathématique à l'aide de données mesurées. La suite d'outils SysId utilise l'identification du système pour trouver les termes kS, kV et kA.

source: x-hat
fr_ca: x-châpeau
