Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controllers/bang-bang.po
Languages: fr_ca, ja

source: Bang-Bang Control with BangBangController
fr_ca: Commande Tout ou Rien en abrégé TOR avec contrôleur BangBang
ja: BangBangControllerによるバンバン制御

source: `"Bang-bang" control <https://en.wikipedia.org/wiki/Bang%E2%80%93bang_control>`__ is a control strategy that employs only two states: on (when the measurement is below the setpoint) and off (otherwise). This is roughly equivalent to a proportional loop with infinite gain.
fr_ca: `La commande "Bang-bang" ou "Tout ou rien" <https://en.wikipedia.org/wiki/Bang%E2%80%93bang_control>`__ est une stratégie de contrôle qui n’utilise que deux états: activé (lorsque la mesure est inférieure au point de consigne) et désactivé (dans le cas contraire). Ceci est à peu près équivalent à une boucle proportionnelle avec un gain infini.

source: This may initially seem like a poor control strategy, as PID loops are known to become unstable as the gains become large - and indeed, it is a *very bad idea to use a bang-bang controller on anything other than velocity control of a high-inertia mechanism*.
fr_ca: Cette approche peut sembler au départ être une mauvaise stratégie de contrôle, car les boucles PID ont la réputation de devenir instables à mesure que les gains deviennent importants - et en effet, c’est une *très mauvaise idée d’utiliser un contrôleur bang-bang sur tout système autre que le contrôle de la vitesse d’un mécanisme à haute inertie*.
ja: PIDループはゲインが大きくなるにつれて不安定になることが知られており、実際、高慣性メカニズムの速度制御以外にバンバンコントローラーを使うのは*最悪の考えです*。

source: However, when controlling the velocity of high-inertia mechanisms under varying loads (like a shooter flywheel), a bang-bang controller can yield faster recovery time and thus better/more consistent performance than a proportional controller. Unlike an ordinary P loop, a bang-bang controller is *asymmetric* - that is, the controller turns on when the process variable is below the setpoint, and does nothing otherwise. This allows the control effort in the forward direction to be made as large as possible without risking destructive oscillations as the control loop tries to correct a resulting overshoot.
fr_ca: Cependant, lors du contrôle de la vitesse des mécanismes à haute inertie sous des charges variables (comme le volant d’inertie d'un tireur), un contrôleur bang-bang peut offrir un temps de récupération plus rapide et donc de meilleures performances/plus cohérentes qu’un contrôleur proportionnel. Contrairement à une boucle P ordinaire, un contrôleur bang-bang est *asymétrique* - c’est-à-dire que le contrôleur est activé lorsque la variable du procédé est en dessous du point de consigne et ne fait rien d’autre. Cela permet de rendre l’effort du contrôle anticipé aussi important que possible sans risque de produire des oscillations destructrices lorsque la boucle de contrôle tenterait de corriger un dépassement résultant.
ja: しかし、（シューターのフライホイールのように）負荷が変化する高慣性メカニズムの速度を制御する場合、バンバンコントローラは比例コントローラよりも回復時間が速く、その結果、より良い/より一貫したパフォーマンスを得ることができます。 通常のPループとは異なり、バンバンコントローラは*非対称*です。つまり、プロセス変数が設定値を下回ったときにコントローラがオンになり、それ以外は何もしません。 これにより、制御ループが結果として生じるオーバーシュートを修正しようとするため、破壊的な振動のリスクを冒すことなく、順方向の制御努力を可能な限り大きくすることができます。

source: Asymmetric bang-bang control is provided in WPILib by the BangBangController class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/controller/BangBangController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_bang_bang_controller.html>`__).
fr_ca: Le contrôle asymétrique bang-bang est pris en charge dans la librairie WPILib par la classe BangBangController (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/controller/BangBangController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_bang_bang_controller.html>`__).

source: Constructing a BangBangController
fr_ca: Construction d’un objet BangBangController
ja: BangBangControllerの作成

source: Since a bang-bang controller does not have any gains, it does not need any constructor arguments (one can optionally specify the controller tolerance used by ``atSetpoint``, but it is not required).
fr_ca: Étant donné qu’un contrôleur bang-bang n’a aucun gain, il n’a pas besoin de constructeur avec argument (on peut éventuellement spécifier la tolérance du contrôleur utilisé par le paramètre ``atSetpoint``, mais ce n’est pas obligatoire).
ja: バンバンコントローラーはゲインを持たないので、コンストラクタの引数は不要です (``atSetpoint`` が使用するコントローラーの許容誤差をオプションで指定できますが、必須ではないです)。

source: Using a BangBangController
fr_ca: Utilisation d'un objet BangBangController
ja: BangBangControllerの使用

source: Bang-bang control is an extremely aggressive algorithm that relies on response asymmetry to remain stable. Be *absolutely certain* that your motor controllers have been set to "coast mode" before attempting to control them with a bang-bang controller, or else the braking action will fight the controller and cause potentially destructive oscillation.
fr_ca: La commande Bang-bang utilise un algorithme extrêmement agressif qui repose sur l’asymétrie de réponse pour assurer la stabilité du système. *Assurez-vous* que vos contrôleurs de moteurs ont été configurés en "coast mode" avant d’essayer de les commander avec un contrôleur bang-bang, sinon le freinage résultant du mode "break" combattra le contrôleur et provoquera une oscillation potentiellement destructrice pour le système.
ja: バンバンコントロールは、安定性を維持するために応答の非対称性に依存する極めてアグレッシブなアルゴリズムです。 バンバンコントローラーでモーターを制御しようとする前に、モーターコントローラーが "coast mode "に設定されていることを*絶対に*確認してください。

source: Using a bang-bang controller is easy:
fr_ca: L’utilisation d’un contrôleur bang-bang est facile:
ja: バンバンコントローラーを使うのは簡単です：

source: Combining Bang Bang Control with Feedforward
fr_ca: Combinaison de la commande Bang Bang et de la commande par anticipation
ja: バンバン制御とフィードフォワードの組み合わせ

source: Like a PID controller, best results are obtained in conjunction with a :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` controller that provides the necessary voltage to sustain the system output at the desired speed, so that the bang-bang controller is only responsible for rejecting disturbances. Since the bang-bang controller can *only* correct in the forward direction, however, it may be preferable to use a slightly conservative feedforward estimate to ensure that the shooter does not over-speed.
fr_ca: Comme dans le cas d'un commande PID, les meilleurs résultats sont obtenus en conjonction avec une commande :ref:`prédictive <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` qui fournit la tension nécessaire pour maintenir la sortie du système à la vitesse souhaitée, de sorte que le contrôleur bang-bang n’est responsable que de l'élimination des perturbations. Étant donné que le contrôleur bang-bang ne peut *que* corriger dans la commande prédictive, il serait sûrement préférable d’utiliser une estimation légèrement conservatrice de la commande prédictive pour s’assurer que le tireur ne dépasse pas la vitesse souhaitée.
ja: PIDコントローラと同様に、システム出力を所望の速度で維持するために必要な電圧を供給する :ref:`フィードフォワード <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` コントローラーと組み合わせることで、最良の結果が得られます。しかし、バンバンコントローラーは *前進方向にしか修正できない* ので、シューターがオーバースピードにならないようにするためには、少し控えめなフィードフォワード推定を使う方が望ましいかもしれません。

source: The :term:`bang-bang control` algorithm is a control strategy that employs only two states: on (when the measurement is below the setpoint) and off (otherwise). This is roughly equivalent to a proportional loop with infinite gain.
ja: :term:`バンバン制御` アルゴリズムとは、オン（測定値が設定値以下の場合）とオフ（それ以外の場合）の2つの状態のみを使用する制御戦略です。これは無限ゲインを持つ比例動作のループとほぼ同じです。

source: Asymmetric bang-bang control is provided in WPILib by the BangBangController class (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/controller/BangBangController.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_bang_bang_controller.html>`__).
ja: WPILibでは、BangBangControllerクラスによって非対称のバンバンコントロールが提供されています (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/math/controller/BangBangController.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_bang_bang_controller.html>`__)。
