Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controllers/combining-feedforward-feedback.po
Languages: es_mx, fr_ca, zh_cn

source: Combining Feedforward and PID Control
fr_ca: Combinaison des contrôles Feedforward ou Prédictif et PID
zh_cn: 前馈与PID控制相结合

source: Todo
fr_ca: Ce qui reste à faire
zh_cn: 待办事项

source: link to conceptual article when available
es_mx: enlace al artículo conceptual cuando esté disponible
fr_ca: lien vers un article conceptuel quand disponible
zh_cn: 可用时链接到概念文章

source: This article covers the in-code implementation of combined feedforward/PID control with WPILib's provided library classes. Documentation describing the involved concepts in more detail is forthcoming.
es_mx: Este artículo cubre la implementación en código del control PID / prealimentación combinado con las clases de biblioteca proporcionadas por WPILib. Próximamente se publicará documentación que describe los conceptos involucrados con más detalle.
fr_ca: N.D.T Le terme Feedforward sera quelquefois utilisé pour alléger le texte. Cet article couvre l'implémentation dans le code du contrôle Feedforward/PID combiné avec les librairies de classes fournies par WPILib. Une documentation décrivant ces concepts de façon plus détaillée est à venir.
zh_cn: 本文介绍了结合前馈/ PID控制和WPILib提供的库类的代码内实现。以及详细描述所涉及概念的文档。

source: Feedforward and feedback controllers can each be used in isolation, but are most effective when combined together. Thankfully, combining these two control methods is *exceedingly* straightforward - one simply adds their outputs together.
es_mx: Los controladores de realimentación y retroalimentación se pueden usar de forma aislada, pero son más efectivos cuando se combinan. Afortunadamente, combinar estos dos métodos de control es *extremadamente* sencillo - uno simplemente suma sus resultados.
fr_ca: Les contrôleurs de commande par anticipation et de rétroaction peuvent être utilisé séparément, cependant ils sont plus efficaces lorsqu'ils sont combinés ensemble. La combinaison de ces deux méthodes de contrôle est d'une simplicité enfantine - on ajoute simplement leurs sorties respectives...
zh_cn: 前馈和反馈控制器可以单独使用，但组合在一起时最有效。值得庆幸的是，将这两种控制方法结合起来*非常*简单明了-只需将它们的输出相加即可。

source: Using Feedforward with a PIDController
es_mx: Usando prealimentación con un PIDController
fr_ca: L'utilisation d'un Feedforward avec un PIDController
zh_cn: 将前馈与PIDController一起使用

source: Users familiar with the old ``PIDController`` class may notice the lack of any feedforward gain in the new controller. As users are expected to use the controller output themselves, there is no longer any need for the ``PIDController`` to implement feedforward - users may simply add any feedforward they like to the output of the controller before sending it to their motors:
es_mx: Los usuarios familiarizados con la antigua clase ``PIDController`` pueden notar la falta de cualquier ganancia de retroalimentación en el nuevo controlador. Como se espera que los usuarios utilicen la salida del controlador ellos mismos, ya no es necesario que el ``PIDController`` implemente el feedforward - los usuarios pueden simplemente agregar cualquier feedforward que deseen a la salida del controlador antes de enviarlo a sus motores:
fr_ca: Les utilisateurs familiers avec la vielle classe ``PIDController`` peuvent remarquer l'absence de gain Feedforward dans le noveau contrôleur. Comme les sorties des contrôleurs sont maintenant disponibles aux usagers, le ``PIDController`` n'a plus besoin d'incorporer la fonction Feedforward - les utilisateurs peut simplement ajouter le Feedforward désiré à la sortie du contrôleur avant d'envoyer le tout aux moteurs:
zh_cn: 熟悉旧的``PIDController''类的用户可能会注意到新控制器中缺少任何前馈增益。由于期望用户自己使用控制器输出，因此不再需要``PIDController''来实现前馈-用户可以在将其喜欢的前馈添加到控制器的输出之前，只需将其发送到电机即可：

source: Moreover, feedforward is a separate feature entirely from feedback, and thus has no reason to be handled in the same controller object, as this violates separation of concerns. WPILib comes with several helper classes to compute accurate feedforward voltages for common FRC\ |reg| mechanisms - for more information, see :ref:`docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib`.
es_mx: Además, feedforward es una característica completamente separada de la retroalimentación y, por lo tanto, no tiene ninguna razón para manejarse en el mismo objeto de controlador, ya que esto viola la separación de preocupaciones. WPILib viene con varias clases auxiliares para calcular voltajes de retroalimentación precisos para mecanismos FRC\|reg| - para obtener más información, consulte :ref:`docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib`.
fr_ca: En outre, la prédiction est une fonctionnalité entièrement distincte de la rétroaction, et n’a donc aucune raison d’être traitée dans le même objet contrôleur, car cela viole la séparation des préoccupations. WPILib est livré avec plusieurs classes d’aide pour calculer des tensions de prédiction précises pour des mécanismes communs en FRC\ |reg| - pour plus d’informations, consulter :ref:`docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib`.
zh_cn: 此外，前馈是与反馈完全独立的功能，因此没有理由在同一控制器对象中进行处理，因为这违反了关注点分离。 WPILib带有多个帮助程序类，可以为常见的FRC \ | reg |计算准确的前馈电压。机制-有关更多信息，请参阅:ref:`docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib`.

source: Using Feedforward Components with PID
es_mx: Uso de componentes Feedforward con PID
fr_ca: L'utilisation des composants Feedforward avec PID
zh_cn: 通过PID使用前馈组件

source: Since feedforward voltages are physically meaningful, it is best to use the ``setVoltage()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/motorcontrol/MotorController.html#setVoltage(double)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_speed_controller.html#a8252b1dbd027218c7966b15d0f9faff7>`__) method when applying them to motors to compensate for "voltage sag" from the battery.
fr_ca: Étant donné que les tensions de contrôle d'anticipation (feedforward) sont physiquement significatives, il est préférable d’utiliser la méthode ``setVoltage()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/motorcontrol/MotorController.html#setVoltage(double)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_speed_controller.html#a8252b1dbd027218c7966b15d0f9faff7>`__) lors de leur application sur des moteurs pour compenser "l’affaissement de la tension" de la batterie.

source: What might a more complete example of combined feedforward/PID control look like? Consider the :ref:`drive example <docs/software/advanced-controls/controllers/feedforward:Using Feedforward to Control Mechanisms>` from the feedforward page. We can easily modify this to include feedback control (with a ``SimpleMotorFeedforward`` component):
es_mx: ¿Cómo sería un ejemplo más completo de control PID / prealimentación combinado? Considera el :ref:`drive example <docs/software/advanced-controls/controllers/feedforward:Using Feedforward to Control Mechanisms>` de la página de prealimentación. Podemos modificar esto fácilmente para incluir control de retroalimentación (con un componente ``SimpleMotorFeedforward``):
fr_ca: À quoi pourrait ressembler un exemple plus complet de contrôle Feedforward/PID combiné? Considerez :ref:`l'exemple de conduite <docs/software/advanced-controls/controllers/feedforward:Using Feedforward to Control Mechanisms>` de la section de contôle anticipé (Feedforward). Nous pouvons facilement modifier les exemples pour ajouter de la rétroaction (avec une composante ``SimpleMotorFeedforward``):
zh_cn: 前馈/ PID组合控制的更完整示例是什么样子？考虑前馈页面上的驱动器示例<docs / software / advanced-controls / controllers / feedforward：将前馈用于控制机制>。我们可以很容易地修改它以包括反馈控制（带有“ SimpleMotorFeedforward”组件）：

source: Other mechanism types can be handled similarly.
es_mx: Otros tipos de mecanismos se pueden manejar de manera similar.
fr_ca: D'autre types de mécanismes peut être traité de la même façon.
zh_cn: 其他机制类型也可以类似地处理。

source: Since feedforward voltages are physically meaningful, it is best to use the ``setVoltage()`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/SpeedController.html#setVoltage(double)>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1SpeedController.html#a8252b1dbd027218c7966b15d0f9faff7>`__) method when applying them to motors to compensate for "voltage sag" from the battery.
es_mx: Dado que los voltajes de alimentación directa son físicamente significativos, es mejor utilizar el ``setVoltage()`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/SpeedController.html#setVoltage(double)>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1SpeedController.html#a8252b1dbd027218c7966b15d0f9faff7>`__) método al aplicarlos a motores para compensar la "caída del voltaje" de la batería.
