Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controllers/feedforward.po
Languages: es_mx, fr_ca, zh_cn

source: The WPILib feedforward classes closely match the available mechanism characterization tools available in the :ref:`SysId toolsuite <docs/software/pathplanning/system-identification/introduction:Introduction to System Identification>`. The system identification toolsuite can be used to quickly and effectively determine the correct gains for each type of feedforward. If you are unable to empirically characterize your mechanism (due to space and/or time constraints), reasonable estimates of ``kG``, ``kV``, and ``kA`` can be obtained by fairly simple computation, and are also available from `ReCalc <https://www.reca.lc/>`__. ``kS`` is nearly impossible to model, and must be measured empirically.
fr_ca: Les classes d'anticipation WPILib correspondent étroitement aux outils de caractérisation des mécanismes disponibles dans la suite d'outils :ref:`SysId <docs/software/pathplanning/system-identification/introduction:Introduction to System Identification>`. La suite d'outils d'identification du système peut être utilisée pour déterminer rapidement et efficacement les gains corrects pour chaque type d'anticipation. Si vous n'êtes pas en mesure de caractériser empiriquement votre mécanisme (en raison de contraintes d'espace et/ou de temps), des estimations raisonnables de ``kG``, ``kV`` et ``kA`` peuvent être obtenues par un calcul assez simple, et sont également disponibles sur `ReCalc <https://www.reca.lc/>`__. ``kS`` est presque impossible à modéliser et doit être mesuré de manière empirique.

source: In C++, the ``ArmFeedforward`` class assumes distances are angular, not linear. The passed-in gains *must* have units consistent with the angular unit, or a compile-time error will be thrown. ``kS`` and ``kG`` should have units of ``volts``, ``kV`` should have units of ``volts * seconds / radians``, and ``kA`` should have units of ``volts * seconds^2 / radians``. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
fr_ca: En C++, la classe ``ArmFeedforward`` suppose que les distances sont angulaires et non linéaires. Les gains transmis *doivent* avoir des unités cohérentes avec l'unité angulaire, sinon une erreur de compilation sera générée. ``kS`` et ``kG`` doivent avoir des unités de ``volts``, ``kV`` doivent avoir des unités de ``volts * secondes / radians``, et ``kA`` doivent avoir des unités de ``volts * secondes^2 / radians``. Pour plus d'informations sur les unités C++, consultez :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.

source: Since feedforward voltages are physically meaningful, it is best to use the ``setVoltage()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/motorcontrol/MotorController.html#setVoltage(double)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_speed_controller.html#a8252b1dbd027218c7966b15d0f9faff7>`__) method when applying them to motors to compensate for "voltage sag" from the battery.
fr_ca: Étant donné que les tensions de contrôle d'anticipation (feedforward) sont physiquement significatives, il est préférable d’utiliser la méthode ``setVoltage()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/motorcontrol/MotorController.html#setVoltage(double)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_speed_controller.html#a8252b1dbd027218c7966b15d0f9faff7>`__) lors de leur application sur des moteurs pour compenser "l’affaissement de la tension" de la batterie.
