Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controllers/feedforward.po
Languages: es_mx, fr_ca, zh_cn

source: Feedforward Control in WPILib
es_mx: Control Feedforward en WPILib
fr_ca: Commande prédictive ou par anticipation en WPILib
zh_cn: WPILib中的前馈控制

source: So far, we've used feedback control for reference tracking (making a system's output follow a desired reference signal). While this is effective, it's a reactionary measure; the system won't start applying control effort until the system is already behind. If we could tell the controller about the desired movement and required input beforehand, the system could react quicker and the feedback controller could do less work. A controller that feeds information forward into the plant like this is called a feedforward controller.
es_mx: Hasta ahora, hemos utilizado el control de retroalimentación para el seguimiento de referencias (hacer que la salida de un sistema siga una señal de referencia deseada). Si bien esto es efectivo, es una medida reaccionaria; el sistema no comenzará a aplicar esfuerzo de control hasta que el sistema ya esté retrasado. Si pudiéramos decirle al controlador sobre el movimiento deseado y la entrada requerida de antemano, el sistema podría reaccionar más rápido y el controlador de retroalimentación podría hacer menos trabajo. Un controlador que envía información a la planta de esta manera se denomina controlador de avance.
fr_ca: N.D.T. le terme anglais Feedforward sera utilisé quelquefois pour alléger le texte. Jusqu'à présent, nous avons utilisé le contrôle de rétroaction pour le suivi des références (faire en sorte que la sortie d'un système suive le signal de référence souhaité). Bien que cela soit efficace, c'est une mesure réactionnaire; le système ne commencera pas à appliquer l'effort de contrôle tant que le système n'a pas pris un certain retard. Si nous pouvions informer le contrôleur du mouvement souhaité et de l'entrée requise à l'avance, le système pourrait réagir plus rapidement et le contrôleur de rétroaction pourrait faire moins de travail. Un contrôleur qui transmet des informations à l'Usine comme celle-ci est appelé contrôleur par anticipation (Feedforward).
zh_cn: 到目前为止，我们已经将反馈控制用于参考跟踪（使系统的输出遵循所需的参考信号）。虽然这很有效，但这是一种反措施。在运行结束之前，系统将不会开始施加控制作用。如果我们可以事先告知控制器所需的运动和所需的输入，则系统可以更快地做出反应，而反馈控制器可以减少工作量。像这样将信息前馈到设备中的控制器称为前馈控制器。

source: A feedforward controller injects information about the system’s dynamics (like a mathematical model does) or the intended movement. Feedforward handles parts of the control actions we already know must be applied to make a system track a reference, then feedback compensates for what we do not or cannot know about the system’s behavior at runtime.
es_mx: Un controlador de retroalimentación inyecta información sobre la dinámica del sistema (como lo hace un modelo matemático) o el movimiento previsto. Feedforward maneja partes de las acciones de control que ya sabemos que deben aplicarse para hacer que un seguimiento del sistema sea una referencia, luego la retroalimentación compensa lo que no sabemos o no podemos saber sobre el comportamiento del sistema en tiempo de ejecución.
fr_ca: Un contrôleur par anticipation injecte des informations sur la dynamique du système (comme le fait un modèle mathématique) ou le mouvement prévu. La composante calculée par anticipation donne le mouvement désiré et la meilleure façon d'atteindre le point de contrôle, et la rétroaction du système compense pour ce que nous ignorons, ou les variations du comportement du système au moment de l'exécution.
zh_cn: 前馈控制器注入有关系统动力学（如数学模型）或预期运动的信息。前馈处理了我们已经知道的部分控制动作，必须应用这些动作才能使系统跟踪参考，然后反馈补偿我们在运行时对系统行为不了解或不了解的内容。

source: There are two types of feedforwards: model-based feedforward and feedforward for unmodeled dynamics. The first solves a mathematical model of the system for the inputs required to meet desired velocities and accelerations. The second compensates for unmodeled forces or behaviors directly so the feedback controller doesn't have to. Both types can facilitate simpler feedback controllers. We'll cover several examples below.
es_mx: Hay dos tipos de feedforwards: feedforward basado en modelos y feedforward para dinámicas no modeladas. El primero resuelve un modelo matemático del sistema para las entradas requeridas para alcanzar las velocidades y aceleraciones deseadas. El segundo compensa directamente las fuerzas o los comportamientos no modelados para que el controlador de retroalimentación no tenga que hacerlo. Ambos tipos pueden facilitar controladores de retroalimentación más simples. Cubriremos varios ejemplos a continuación.
fr_ca: Il existe deux types de contrôleurs par anticipation: Feedforward basé sur un modèle et Feedforward pour une dynamique sans modèle. Le premier résout un modèle mathématique du système pour les entrées nécessaires pour répondre aux vitesses et accélérations souhaitées. Le second compense directement les forces ou les comportements non modélisés afin que le contrôleur de rétroaction n'ait pas à le faire. Les deux types peuvent faciliter des contrôleurs de rétroaction plus simples. Nous couvrirons plusieurs exemples ci-dessous.
zh_cn: 前馈有两种类型：基于模型的前馈和用于未建模动力学的前馈。第一种解决系统的数学模型，以满足要求的速度和加速度所需的输入。第二个可以直接补偿未建模的力或行为，因此反馈控制器不必这样做。两种类型均可简化反馈控制器。我们将在下面介绍几个示例。

source: The WPILib feedforward classes closely match the available mechanism characterization tools available in the :ref:`frc-characterization toolsuite <docs/software/wpilib-tools/robot-characterization/introduction:Introduction to Robot Characterization>` - the characterization toolsuite can be used to quickly and effectively determine the correct gains for each type of feedforward. The toolsuite will indicate the appropriate units for each of the gains.
zh_cn: WPILib前馈类紧密匹配：ref:`frc-characterization toolsuite <docs/software/wpilib-tools/robot-characterization/introduction:Introduction to Robot Characterization>` - 中可用的可用的机制表征工具-可以使用表征工具。快速有效地确定每种前馈类型的正确增益。工具套件将为每种收益指示适当的单位。

source: WPILib provides a number of classes to help users implement accurate feedforward control for their mechanisms. In many ways, an accurate feedforward is more important than feedback to effective control of a mechanism. Since most FRC\ |reg| mechanisms closely obey well-understood system equations, starting with an accurate feedforward is both easy and hugely beneficial to accurate and robust mechanism control.
es_mx: WPILib proporciona una serie de clases para ayudar a los usuarios a implementar un control de retroalimentación preciso para sus mecanismos. En muchos sentidos, una retroalimentación precisa es más importante que la retroalimentación para el control efectivo de un mecanismo. Dado que la mayoría de los mecanismos de FRC\ |reg| obedecen de cerca a las ecuaciones del sistema bien entendidas, comenzar con un feedforward preciso es fácil y enormemente beneficioso para un control de mecanismo preciso y robusto.
fr_ca: WPILib fournit un certain nombre de classes pour aider les utilisateurs à implémenter une commande feedforward pour leurs mécanismes. À bien des égards, un feedforward précis est plus important que la rétroaction au contrôle efficace d’un mécanisme. Comme la plupart des mécanismes en FRC\ |reg| obéissent étroitement aux équations bien comprises du système, en commençant par un feedforward précis est à la fois facile et extrêmement bénéfique pour le contrôle précis et robuste du mécanisme
zh_cn: WPILib提供了许多类来帮助用户实现对其机制的精确前馈控制。在许多方面，准确的前馈比反馈对机制的有效控制更为重要。由于大多数FRC \ | reg |机构严格遵循易于理解的系统方程式，从准确的前馈开始既容易又对精确且鲁棒的机构控制非常有利。

source: WPILib currently provides the following three helper classes for feedforward control:
es_mx: WPILib actualmente proporciona las siguientes tres clases auxiliares para el control anticipado:
fr_ca: WPILib fournit actuellement les trois classes suivantes pour le contrôle Feedforward
zh_cn: WPILib当前提供以下三个帮助程序类用于前馈控制：

source: `SimpleMotorFeedforward`_ (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/SimpleMotorFeedforward.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1SimpleMotorFeedforward.html>`__)
zh_cn: `SimpleMotorFeedforward`_ (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/controller/SimpleMotorFeedforward.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1SimpleMotorFeedforward.html>`__)

source: `ArmFeedforward`_ (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/ArmFeedforward.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ArmFeedforward.html>`__)
zh_cn: `ArmFeedforward`_ (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/controller/ArmFeedforward.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1ArmFeedforward.html>`__)

source: `ElevatorFeedforward`_ (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/ElevatorFeedforward.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ElevatorFeedforward.html>`__)
zh_cn: `ElevatorFeedforward`_ (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/controller/ElevatorFeedforward.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1ElevatorFeedforward.html>`__)

source: SimpleMotorFeedforward
fr_ca: La classe "SimpleMotorFeedforward"
zh_cn: SimpleMotor前馈

source: In C++, the ``SimpleMotorFeedforward`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in gains *must* have units consistent with the distance units, or a compile-time error will be thrown. ``kS`` should have units of ``volts``, ``kV`` should have units of ``volts * seconds / distance``, and ``kA`` should have units of ``volts * seconds^2 / distance``. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
es_mx: En C ++, la clase ``SimpleMotorFeedforward`` se basa en el tipo de unidad utilizada para las mediciones de distancia, que puede ser angular o lineal. Las ganancias pasadas *deben* tener unidades consistentes con las unidades de distancia, o se arrojará un error de tiempo de compilación. ``kS`` debe tener unidades de ``voltios`` , ``kV`` debe tener unidades de ``voltios*segundos / distancia`` y ``kA`` debe tener unidades de ``voltios*segundos^2 / distancia ``. Para obtener más información sobre las unidades C++, consulte :ref:`docs/software/basic-planning/cpp-units:The C ++ Units Library`.
fr_ca: En C ++, la classe ``SimpleMotorFeedforward`` est basée sur le type d'unité utilisé pour les mesures de distance, qui peut être angulaire ou linéaire. Les gains transmis *doivent* avoir des unités cohérentes avec les unités de distance, sinon une erreur de compilation sera générée. ``kS`` doit avoir des unités de ``volts``, ``kV`` doit avoir des unités de ``volts * secondes / distance`` et ``kA`` doit avoir des unités de ``volts * secondes^2 / distance``. Pour plus d'informations sur les unités C ++, voir :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
zh_cn: 在C ++中，``SimpleMotorFeedforward''类以用于距离测量的单位类型为模板，可以是角度或线性的。传递的增益*必须*具有与距离单位一致的单位，否则将引发编译时错误。 ``kS''的单位应为``伏特''，``kV''的单位应为``伏特*秒/距离''，``kA''的单位应为``伏特*秒/秒^ 2 /距离。有关C ++单元的更多信息，请参见：docs / software / basic-programming / cpp-units：C ++单元库。

source: The Java feedforward components will calculate outputs in units determined by the units of the user-provided feedforward gains. Users *must* take care to keep units consistent, as WPILibJ does not have a type-safe unit system.
es_mx: Los componentes de feedforward de Java calcularán los resultados en unidades determinadas por las unidades de las ganancias de feedforward proporcionadas por el usuario. Los usuarios *deben* tener cuidado de mantener las unidades consistentes, ya que WPILibJ no tiene un sistema de unidad de tipo seguro.
fr_ca: Les composants Java Feedforward calculent les sorties en unités déterminées par les unités des gains Feedforward fournis par l'utilisateur. Les utilisateurs *doivent* maintenir la cohérence des unités, car WPILibJ ne dispose pas d'un système d'unités de type sécurisé.
zh_cn: Java前馈组件将以由用户提供的前馈增益的单位确定的单位来计算输出。用户*必须*务必保持单元一致，因为WPILibJ没有类型安全的单元系统。

source: The ``SimpleMotorFeedforward`` class calculates feedforwards for mechanisms that consist of permanent-magnet DC motors with no external loading other than friction and inertia, such as flywheels and robot drives.
es_mx: La clase ``SimpleMotorFeedforward`` calcula el feedforward para mecanismos que constan de motores DC de imanes permanentes sin carga externa más que fricción e inercia, como volantes y accionamientos de robots.
fr_ca: La classe ``SimpleMotorFeedforward`` calcule les valeurs de Feedforward pour les mécanismes qui se composent de moteurs à courant continu à aimant permanent (comme le CIM, Bag, 775...) sans charge externe autre que le frottement et l'inertie, tels que les volants d'inertie et les entraînements de robots.
zh_cn: ``SimpleMotorFeedforward''类计算由永磁直流电机组成的机构的前馈，这些电机除了摩擦和惯性外没有其他负载，例如飞轮和机器人驱动器。

source: To create a ``SimpleMotorFeedforward``, simply construct it with the required gains:
es_mx: Para crear un ``SimpleMotorFeedforward``, simplemente constrúyalo con las ganancias requeridas:
fr_ca: Pour créer un ``SimpleMotorFeedforward``, il suffit de le construire avec les gains requis:
zh_cn: 要创建``SimpleMotorFeedforward''，只需使用所需的增益即可构造它：

source: The ``kA`` gain can be omitted, and if it is, will default to a value of zero. For many mechanisms, especially those with little inertia, it is not necessary.
es_mx: La ganancia de ``kA`` se puede omitir y, si es así, tendrá un valor predeterminado de cero. Para muchos mecanismos, especialmente aquellos con poca inercia, no es necesario.
fr_ca: Le gain ``kA`` peut être omis, et s'il l'est, sera par défaut à une valeur de zéro. Pour de nombreux mécanismes, en particulier ceux avec peu d'inertie, ce n'est pas nécessaire.
zh_cn: 可以省略``kA''增益，如果是，则默认为零。对于许多机构，尤其是惯性很小的机构，没有必要。

source: To calculate the feedforward, simply call the ``calculate()`` method with the desired motor velocity and acceleration:
es_mx: Para calcular el feedforward, simplemente llame al método ``calculate()`` con la velocidad y aceleración deseadas del motor:
fr_ca: Pour calculer le feedforward, il suffit d'appeler la méthode ``calculate()`` avec la vitesse et l'accélération désirées du moteur:
zh_cn: 要计算前馈，只需使用所需的电动机速度和加速度调用calculate（）方法即可：

source: The acceleration argument may be omitted from the ``calculate()`` call, and if it is, will default to a value of zero. This should be done whenever there is not a clearly-defined acceleration setpoint.
es_mx: El argumento de aceleración se puede omitir de la llamada ``calculate()`` y, si es así, se tomará por defecto un valor de cero. Esto debe hacerse siempre que no haya un punto de ajuste de aceleración claramente definido.
fr_ca: L'argument d'accélération peut être omis de l'appel ``calculate()``, et si c'est le cas, sa valeur par défaut sera zéro. Cela doit être fait chaque fois qu'il n'y a pas de point de consigne d'accélération clairement défini.
zh_cn: 可以在calculate（）调用中省略加速度参数，如果是，则默认为零。如果没有明确定义的加速度设定值，则应执行此操作。

source: ArmFeedforward
fr_ca: La classe ArmFeedforward
zh_cn: 臂前馈

source: In C++, the ``ArmFeedforward`` class assumes distances are angular, not linear. The passed-in gains *must* have units consistent with the angular unit, or a compile-time error will be thrown. ``kS`` and ``kCos`` should have units of ``volts``, ``kV`` should have units of ``volts * seconds / radians``, and ``kA`` should have units of ``volts * seconds^2 / radians``. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
zh_cn: 在C ++中，“ ArmFeedforward”类假定距离是成角度的，而不是线性的。 传递的增益*必须*具有与角度单位一致的单位，否则将引发编译时错误。 ``kS''和``kCos''的单位应为``伏特''，``kV''的单位应为``伏特*秒/弧度''，``kA''的单位应为 伏特*秒^ 2 /弧度''。 有关C ++单元的更多信息，请参见 :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.

source: The ``ArmFeedforward`` class calculates feedforwards for arms that are controlled directly by a permanent-magnet DC motor, with external loading of friction, inertia, and mass of the arm. This is an accurate model of most arms in FRC.
es_mx: La clase ``ArmFeedforward`` calcula el feedforwards para brazos que están controlados directamente por un motor DC de imán permanente, con carga externa de fricción, inercia y masa del brazo. Este es un modelo preciso de la mayoría de los brazos en FRC.
fr_ca: La classe ``ArmFeedforward`` calcule les valeurs de Feedforward pour les bras de levier qui sont contrôlés directement par un moteur à courant continu à aimant permanent, avec une charge externe de frottement, d'inertie et de masse du bras. Il s'agit d'un modèle précis qui simule la plupart des bras de levier utilisés en FRC.
zh_cn: ``ArmFeedforward''类可计算由永磁直流电动机直接控制的臂的前馈，并具有外部的摩擦力，惯性和质量。这是FRC中大多数武器的准确模型。

source: To create an ``ArmFeedforward``, simply construct it with the required gains:
es_mx: Para crear un ``ArmFeedforward``, simplemente constrúyalo con las ganancias requeridas:
fr_ca: Pour créer un ``ArmFeedforward``, il suffit de le construire avec les gains requis:
zh_cn: 要创建一个``ArmFeedforward``，只需使用所需的增益构造它即可：

source: To calculate the feedforward, simply call the ``calculate()`` method with the desired arm position, velocity, and acceleration:
es_mx: Para calcular el feedforward, simplemente llame al método `` calculate () `` con la posición, velocidad y aceleración deseadas del brazo:
fr_ca: Pour calculer le Feedforward, il suffit d'appeler la méthode ``calculate()`` avec la position, la vitesse et l'accélération souhaitées du bras de levier:
zh_cn: 要计算前馈，只需使用所需的手臂位置，速度和加速度调用calculate（）方法即可：

source: ElevatorFeedforward
fr_ca: La classe ElevatorFeedforward
zh_cn: 抬升架前馈

source: In C++, the ``ElevatorFeedforward`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in gains *must* have units consistent with the distance units, or a compile-time error will be thrown. ``kS`` and ``kG`` should have units of ``volts``, ``kV`` should have units of ``volts * seconds / distance``, and ``kA`` should have units of ``volts * seconds^2 / distance``. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
es_mx: En C++, la clase``ElevatorFeedforward`` se basa en el tipo de unidad utilizado para las mediciones de distancia, que puede ser angular o lineal. Las ganancias pasadas *deben* tener unidades consistentes con las unidades de distancia, o se arrojará un error de tiempo de compilación. ``kS`` y ``kG`` deben tener unidades de ``voltios``, ``kV`` debe tener unidades de ``voltios * segundos / distancia`` y ``kA`` debe tener unidades de ``voltios * segundos^2 / distancia``. Para obtener más información sobre las unidades C++, consulte :ref:`docs/software/basic-planning/cpp-units:The C ++ Units Library`.
fr_ca: En C++, la classe ``ElevatorFeedforward`` est basée sur le type d'unité utilisé pour les mesures de distance, qui peut être angulaire ou linéaire. Les gains transmis *doivent* avoir des unités cohérentes avec les unités de distance, sinon une erreur de compilation sera levée. ``kS`` et ``kG`` doivent avoir des unités de ``volts``, ``kV`` doivent avoir des unités de ``volts * secondes / distance`` et ``kA`` doivent avoir des unités de ``volts * secondes ^ 2 / distance``. Pour plus d'informations sur les unités C ++, voir :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
zh_cn: 在C ++中，``ElevatorFeedforward''类以用于距离测量的单位类型为模板，可以是角度或线性的。传递的增益*必须*具有与距离单位一致的单位，否则将引发编译时错误。 ``kS''和``kG''的单位应为``伏特''，``kV''的单位应为``伏特*秒/距离''，``kA''的单位应为``伏*秒^ 2 /距离''。有关C ++单元的更多信息，请参见：:ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.

source: The ``ElevatorFeedforward`` class calculates feedforwards for elevators that consist of permanent-magnet DC motors loaded by friction, inertia, and the mass of the elevator. This is an accurate model of most elevators in FRC.
es_mx: La clase ``ElevatorFeedforward`` calcula el feedforwards para ascensores que consisten en motores DC de imán permanente cargados por fricción, inercia y la masa del ascensor. Este es un modelo preciso de la mayoría de los ascensores en FRC.
fr_ca: La classe ``ElevatorFeedforward`` calcule les feed-back pour un mécanisme de type ascenseur qui se composent de moteurs à courant continu à aimant permanent chargés par le frottement, l'inertie et la masse de charge déplacée par l'ascenseur. Il s'agit d'un modèle précis de la plupart des mécanismes d'ascenseurs en FRC.
zh_cn: ``ElevatorFeedforward''类可为电梯计算前馈，该电梯由永磁直流电动机组成，该电动机由电梯的摩擦力，惯性和质量加载。这是FRC中大多数电梯的准确模型。

source: To create a ``ElevatorFeedforward``, simply construct it with the required gains:
es_mx: Para crear un ``ElevatorFeedforward``, simplemente constrúyalo con las ganancias requeridas:
fr_ca: Pour créer un ``ElevatorFeedforward``, il suffit de le construire avec les gains requis:
zh_cn: 要创建``ElevatorFeedforward''，只需使用所需的增益构造它即可：

source: Using Feedforward to Control Mechanisms
es_mx: Uso de Feedforward para controlar los mecanismos
fr_ca: Utilisation de Feedforward pour contrôler les mécanismes
zh_cn: 使用前馈控制机制

source: Since feedforward voltages are physically meaningful, it is best to use the ``setVoltage()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/SpeedController.html#setVoltage(double)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1SpeedController.html#a8252b1dbd027218c7966b15d0f9faff7>`__) method when applying them to motors to compensate for "voltage sag" from the battery.
zh_cn: 由于前馈电压在物理上是有意义的，因此在将其应用于电动机时，最好使用setVoltage（）（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/SpeedController.html#setVoltage(double)>`__，C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1SpeedController.html#a8252b1dbd027218c7966b15d0f9faff7>`__）方法来补偿电池的“电压骤降”。

source: Feedforward control can be used entirely on its own, without a feedback controller. This is known as "open-loop" control, and for many mechanisms (especially robot drives) can be perfectly satisfactory. A ``SimpleMotorFeedforward`` might be employed to control a robot drive as follows:
es_mx: El control Feedforward se puede utilizar completamente por sí solo, sin un controlador de retroalimentación. Esto se conoce como control de "bucle abierto" y para muchos mecanismos (especialmente los accionamientos de robots) puede resultar perfectamente satisfactorio. Se puede emplear un ``SimpleMotorFeedforward`` para controlar el accionamiento de un robot de la siguiente manera:
fr_ca: Le contrôle par anticipation (Feedforward) peut être utilisé à lui seul, sans contrôleur de rétroaction. Ceci est connu sous le nom de contrôle "en boucle ouverte", et pour de nombreux mécanismes (en particulier les moteurs qui font avancer le robot) peuvent être parfaitement satisfaisants. Un ``SimpleMotorFeedforward`` peut être utilisé pour contrôler un entraînement de robot comme suit:
zh_cn: 前馈控制可以完全单独使用，而无需反馈控制器。这就是所谓的“开环”控制，对于许多机构（尤其是机器人驱动器），都可以令人满意。可以使用``SimpleMotorFeedforward''来控制机器人驱动器，如下所示：

source: The WPILib Feedforward Classes
fr_ca: Les classes FeedForward WPILib
