Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controllers/pidcontroller.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: PID Control in WPILib
es_mx: Control PID en WPILib
fr_ca: Contrôle PID dans WPILib
tr_tr: WPILib'de PID Kontrolü
zh_cn: WPILib中的PID控制

source: Todo
fr_ca: Ce qui reste à compléter
tr_tr: Yapılacaklar
zh_cn: 待办事项

source: Link to conceptual PID article when it's finished
es_mx: Enlazar al articulo conceptual de PID cuando esté terminado
fr_ca: Lien vers l'article PID conceptuel une fois terminé
tr_tr: Tamamlandığında kavramsal PID makalesine bağlantı
zh_cn: 完成后链接到概念性PID文章

source: This article covers the in-code implementation of PID Control with WPILib's provided library classes. Documentation describing the involved concepts in more detail is forthcoming.
es_mx: Este articulo cubre la implementación en código de un control PID con las librerías WPILib de clases. Documentación describiendo en más detalle los conceptos relacionados está por venir.
fr_ca: Cet article couvre l'implémentation dans le code du contrôle PID avec les classes de bibliothèque fournies par WPILib. Une documentation décrivant les concepts impliqués plus en détail est à venir.
tr_tr: Bu makale, WPILib'in sağladığı kütüphane sınıflarıyla PID Denetiminin kod içi uygulamasını kapsar. İlgili kavramları daha ayrıntılı olarak açıklayan belgeler yakında çıkacaktır.
zh_cn: 本文介绍了WPILib提供的库类在PID控制中的代码实现。即将详细描述所涉及概念的文档。

source: For a guide on implementing PID control through the :ref:`command-based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`, see :ref:`docs/software/commandbased/pid-subsystems-commands:PID Control through PIDSubsystems and PIDCommands`.
es_mx: Para una guía en implementar controles PID a través de un :ref:`marco de referencia base comandos <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`, ver :ref:`docs/software/commandbased/pid-subsystems-commands:PID Control through PIDSubsystems and PIDCommands`.
fr_ca: Pour un guide sur la mise en œuvre du contrôle PID via un :ref:`environnement basé sur les commandes <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`, regardez :ref:`docs/software/commandbased/pid-subsystems-commands:PID Control through PIDSubsystems and PIDCommands`.
tr_tr: :ref:`Komut Tabanlı framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` aracılığıyla PID kontrolünün uygulanmasına ilişkin bir kılavuz için bkz :ref:`docs/software/commandbased/pid-subsystems-commands:PID Control through PIDSubsystems and PIDCommands`.
zh_cn: 关于通过以下指南来实现PID控制 :ref:`command-based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>`，参见 :ref:`docs/software/commandbased/pid-subsystems-commands:PID Control through PIDSubsystems and PIDCommands`.

source: WPILib supports PID control of mechanisms through the ``PIDController`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDController.html>`__). This class handles the feedback loop calculation for the user, as well as offering methods for returning the error, setting tolerances, and checking if the control loop has reached its setpoint within the specified tolerances.
fr_ca: WPILib prend en charge le contrôle PID des mécanismes via la classe ``PIDController`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDController.html>`__). Cette classe gère le calcul de la boucle de rétroaction pour l'utilisateur, ainsi que des méthodes pour renvoyer l'erreur, définir les tolérances et vérifier si la boucle de contrôle a atteint son point de consigne dans les tolérances spécifiées.
tr_tr: WPILib, ``PIDController`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDController.html>` __) aracılığıyla mekanizmaların PID kontrolünü destekler. Bu sınıf, kullanıcı için geri besleme döngüsü hesaplamasını gerçekleştirmenin yanı sıra hatayı döndürmek, toleransları ayarlamak ve kontrol döngüsünün belirtilen toleranslar dahilinde ayar noktasına ulaşıp ulaşmadığını kontrol etmek için yöntemler sunar.
zh_cn: WPILib通过``PIDController''类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDController.html>`__）支持对机制的PID控制。该类为用户处理反馈回路的计算，并提供返回错误，设置公差以及检查控制回路是否在指定公差内达到设定值的方法。

source: Using the PIDController Class
es_mx: Usando la Clase PIDController
fr_ca: L'utilisation de la classe PIDController
tr_tr: PIDController Sınıfını Kullanma
zh_cn: 使用PIDController类

source: The ``PIDController`` class in the ``frc`` namespace is deprecated - C++ teams should use the one in the ``frc2`` namespace, instead. Likewise, Java teams should use the class in the ``wpilibj.controller`` package.
es_mx: La clase ``PIDController`` en el espacio de nombre ``frc`` es obsoleta - equipos C++ deben usar el que se encuentra en el espacio de nombre ``frc2``, en su lugar. Así mismo, equipos Java deben usar la clase en el paquete ``wpilibj.controller``.
fr_ca: La classe ``PIDController`` dans l'espace de noms ``frc`` est obsolète - les équipes C++ devraient plutôt utiliser celle de l'espace de noms ``frc2``. De même, les équipes Java doivent utiliser la classe dans le package ``wpilibj.controller``.
tr_tr: ``Frc`` namespace içerisinde ``PIDController`` sınıfı kullanımdan kaldırıldı - C ++ takımları bunun yerine ``frc2`` namespace kullanmalıdır. Aynı şekilde Java ekipleri de ``wpilibj.controller`` paketindeki sınıfı kullanmalıdır.
zh_cn: “frc”名称空间中的“PIDController”类是不推荐的——c++团队应该使用“frc2”名称空间中的类。同样，Java团队应使用wpilibj.controller包中的类。

source: Constructing a PIDController
es_mx: Construyendo un PIDController
fr_ca: La construction d'un PIDController
tr_tr: Bir PIDController Oluşturma
zh_cn: 构造一个PIDController

source: While ``PIDController`` may be used asynchronously, it does *not* provide any thread safety features - ensuring threadsafe operation is left entirely to the user, and thus asynchronous usage is recommended only for advanced teams.
es_mx: Mientras que ``PIDController`` puede ser usado de manera asincronica, este *no* provee ninguna función de seguridad de hilos - el asegurar una operación segura para hilos se deja completamente al usuario, y de este modo el uso asincronico es recomendado solamente para equipos avanzados.
fr_ca: Bien que ``PIDController`` puisse être utilisé de manière asynchrone, il ne fournit *aucune* fonctionnalité de sécurité des "threads" - la responsabilité du bon fonctionnement threadsafe est entièrement laissée à l'utilisateur. Par conséquant, l'utilisation asynchrone est recommandée uniquement pour les équipes avancées.
tr_tr: ``PIDController`` eşzamansız olarak kullanılabilirken, herhangi güvenlik özelliği *sağlamaz* - güvenli çalışmanın tamamen kullanıcıya bırakılmasını sağlar ve bu nedenle eşzamansız kullanım yalnızca gelişmiş ekipler için önerilir.
zh_cn: 虽然``PIDController``可以异步使用，但它不提供任何线程安全功能-确保线程安全操作完全留给用户使用，因此仅建议高级团队使用异步方法。

source: In order to use WPILib's PID control functionality, users must first construct a ``PIDController`` object with the desired gains:
es_mx: Para usar las funcionalidades de control PID de WPILib, los usuarios deben primero construir un objeto ``PIDController`` con las ganancias deseadas:
fr_ca: Afin d'utiliser la fonctionnalité de contrôle PID de WPILib, les utilisateurs doivent d'abord construire un objet ``PIDController`` avec les gains souhaités:
tr_tr: WPILib'in PID kontrol fonksiyonelliğini kullanmak için, kullanıcılar önce istenen kazançlarla bir ``PIDController`` nesnesi oluşturmalıdır:
zh_cn: 为了使用WPILib的PID控制功能，用户必须首先构造具有所需增益的“ PIDController”对象：

source: An optional fourth parameter can be provided to the constructor, specifying the period at which the controller will be run. The ``PIDController`` object is intended primarily for synchronous use from the main robot loop, and so this value is defaulted to 20ms.
es_mx: Un cuarto parámetro opcional puede proveerse al constructor, especificando el periodo en el cual el controlador será ejecutado. El objeto ``PIDController`` está echo principalmente para uso sincrónico desde el loop principal del robot, y este valor está puesto por default a 20ms.
fr_ca: Un quatrième paramètre facultatif peut être fourni au constructeur, spécifiant la période durant laquelle le contrôleur sera exécuté. L'objet ``PIDController`` est principalement destiné à une utilisation synchrone à partir de la boucle du robot principal, et cette valeur par défaut est donc de 20 mSec.
tr_tr: Constructor'a, denetleyicinin çalıştırılacağı süreyi belirleyen isteğe bağlı dördüncü bir parametre sağlanabilir. ``PIDController`` nesnesi, esas olarak ana robot döngüsünden senkronize kullanım için tasarlanmıştır ve bu nedenle değeri varsayılan olarak 20ms'dir.
zh_cn: 可以向构造函数提供一个可选的第四个参数，指定控制器将运行的时间段。 PIDController对象主要用于与机器人主循环同步使用，因此该值默认为20ms。

source: Using the Feedback Loop Output
es_mx: Usando la salida del loop de retroalimentación.
fr_ca: Utilisation de la sortie de boucle de rétroaction
tr_tr: Geri Besleme Döngüsü Çıkışını Kullanma
zh_cn: 使用反馈回路输出

source: The ``PIDController`` assumes that the ``calculate()`` method is being called regularly at an interval consistent with the configured period. Failure to do this will result in unintended loop behavior.
es_mx: El ``PIDController`` asume que el método ``calculate()`` es llamado regularmente en un intervalo consistente con el periodo configurado. La falla en esto resultará un resultado no deseado en el comportamiento del loop.
fr_ca: Le ``PIDController`` assume que la méthode ``calculate()`` est appelée régulièrement à un intervalle cohérent avec la période configurée. Le non-respect de cette consigne entraînera un comportement de boucle involontaire.
tr_tr: ``PIDController``, ``calculate()`` yönteminin yapılandırılan periyotla tutarlı bir aralıkta düzenli olarak çağrıldığını varsayar. Bunun yapılmaması, istenmeyen döngü davranışına neden olacaktır.
zh_cn: PIDController假定以与配置的周期一致的时间间隔定期调用calculate（）方法。否则，将导致意外的循环行为。

source: Unlike the old ``PIDController``, the new PIDController does not automatically control an output from its own thread - users are required to call ``calculate()`` and use the resulting output in their own code.
es_mx: Al contrario del anterior ``PIDController``, el nuevo PIDController no controla automáticamente una salida de su propio hilo - Los usuarios requieren llamar a ``calculate()`` y usar la salida resultante en su propio código.
fr_ca: Contrairement à l'ancien ``PIDController``, le nouveau PIDController ne contrôle pas automatiquement une sortie à partir de son propre thread - les utilisateurs doivent appeler ``calculate()`` et utiliser la sortie résultante dans leur propre code.
tr_tr: Eski ``PIDController`` in aksine, yeni PIDController kendi iş parçacığından bir çıktıyı otomatik olarak kontrol etmez - kullanıcıların ``calculate()`` i çağırması ve elde edilen çıktıyı kendi kodlarında kullanması gerekir.
zh_cn: 与旧的PIDController不同，新的PIDController不会自动控制其自己线程的输出-用户需要调用calculate（）并在自己的代码中使用结果输出。

source: Using the constructed ``PIDController`` is simple: simply call the ``calculate()`` method from the robot's main loop (e.g. the robot's ``autonomousPeriodic()`` method):
es_mx: Usar un construido ``PIDController`` es simple: Solo llame el método ``calculate()`` desde el loop principal del robot (ejemplo: El método ``autonomousPeriodic()`` del robot)
fr_ca: L'utilisation de ``PIDController`` est simple: il suffit d'appeler la méthode ``calculate()`` depuis la boucle principale du robot (par exemple la méthode ``autonomousPeriodic()`` du robot):
tr_tr: Oluşturulan ``PIDController`` i kullanmak basittir: basitçe robotun ana döngüsünden ``calculate()`` yöntemini çağırın (örneğin, robotun ``autonomousPeriodic()`` yöntemi):
zh_cn: 使用构造的PIDController很简单：只需从机器人主循环中调用calculate（）方法（例如，机器人的autonomousPeriodic（）方法）：

source: Checking Errors
es_mx: Checando errores
fr_ca: La vérification des erreurs
tr_tr: Hataları Kontrol Etmek
zh_cn: 检查错误

source: ``getPositionError()`` and ``getVelocityError()`` are named assuming that the loop is controlling a position - for a loop that is controlling a velocity, these return the velocity error and the acceleration error, respectively.
es_mx: ``getPositionError()`` y ``getVelocityError()`` son nombrados asumiendo que el loop está controlando una posición - para un loop que está controlando velocidad, estos regresan el error de velocidad y el error de la aceleración, respectivamente.
fr_ca: ``getPositionError()`` et ``getVelocityError()`` sont définis avec l'hypothèse que la boucle contrôle une position - si toutefois la boucle contrôle plutôt une vitesse, ces dernières renvoient respectivement l'erreur de vitesse et l'erreur d'accélération.
tr_tr: ``getPositionError()`` ve ``getVelocityError()``, döngünün bir konumu kontrol ettiği varsayılarak adlandırılır - bir hızı kontrol eden bir döngü için bunlar sırasıyla hız hatasını ve hızlanma hatasını döndürür.
zh_cn: getPositionError（）和getVelocityError（）的命名是假设循环正在控制位置-对于控制速度的循环，它们分别返回速度误差和加速度误差。

source: The current error of the measured process variable is returned by the ``getPositionError()`` function, while its derivative is returned by the ``getVelocityError()`` function:
es_mx: El error actual del proceso medido se regresa por medio de la función ``getPositionError()``, mientras que su derivada regresa por medio de la función ``getVelocityError()``:
fr_ca: L'erreur actuelle de la variable de processus mesurée est retournée par la fonction ``getPositionError()`` , tandis que sa dérivée est retournée par la fonction ``getVelocityError ()``:
tr_tr: Ölçülen işlem değişkeninin mevcut hatası,``getPositionError()`` işlevi tarafından döndürülür, türevi ise ``getVelocityError()`` işlevi tarafından döndürülür:
zh_cn: 测量的过程变量的当前错误由getPositionError（）函数返回，而其派生由getVelocityError（）函数返回：

source: Specifying and Checking Tolerances
es_mx: Especificando y checando tolerancias
fr_ca: La spécification et la vérification des tolérances
tr_tr: Toleransları Belirleme ve Kontrol Etme
zh_cn: 指定和检查公差

source: If only a position tolerance is specified, the velocity tolerance defaults to infinity.
es_mx: Si solo una tolerancia de posición es especificada, la tolerancia de velocidad se pone como default a infinito.
fr_ca: Si seulement une tolérance de position est spécifiée, la tolérance de vitesse par défaut est l'infini.
tr_tr: Yalnızca bir konum toleransı belirtilirse, hız toleransı varsayılan olarak sonsuzdur.
zh_cn: 如果仅指定位置公差，则速度公差默认为无穷大。

source: As above, "position" refers to the process variable measurement, and "velocity" to its derivative - thus, for a velocity loop, these are actually velocity and acceleration, respectively.
es_mx: Tal como arriba, "position" se refiere al proceso de medición variable, y "velocity" a su derivada - de esta forma, para un loop de velocidad, estos son, de hecho, velocidad y aceleración respectivamente.
fr_ca: Comme ci-dessus, «position» fait référence à la mesure de la variable de processus et «vitesse» à sa dérivée - ainsi, pour une boucle de vitesse, ce sont en fait la vitesse et l'accélération, respectivement.
tr_tr: Yukarıdaki gibi, ``position`` işlem değişken ölçümünü ve ``velocity`` bunun türevini ifade eder - dolayısıyla, bir hız döngüsü için bunlar aslında sırasıyla hız ve ivmedir.
zh_cn: 如上所述，“位置”是指过程变量的测量值，“速度”是指其导数-因此，对于速度环，它们实际上分别是速度和加速度。

source: link to article on motion profiles
es_mx: Enlace al articulo sobre perfiles de movimiento
fr_ca: Lien vers l'article sur les profils de mouvement
tr_tr: hareket profilleri hakkındaki makaleye bağlantı
zh_cn: 链接到有关运动轮廓的文章

source: Occasionally, it is useful to know if a controller has tracked the setpoint to within a given tolerance - for example, to determine if a command should be ended, or (while following a motion profile) if motion is being impeded and needs to be re-planned.
es_mx: Ocasionalmente, es útil saber si un controlador ha rastreado el setpoint a una tolerancia dada - por ejemplo, para determinar si un comando debería ser finalizado, o (mientras siguiendo un perfil de movimiento) si el movimiento está siendo impedido y necesita ser planeado otra vez.
fr_ca: Parfois, il est utile de savoir si un contrôleur a suivi le point de consigne dans une tolérance donnée - par exemple, pour déterminer si une commande doit être terminée ou (tout en suivant un profil de mouvement) si le mouvement est entravé et doit être re -prévu.
tr_tr: Bazen, bir denetleyicinin ayar noktasını belirli bir tolerans dahilinde izleyip izlemediğini bilmek yararlıdır - örneğin, bir komutun sonlandırılması gerekip gerekmediğini veya (bir hareket profilini takip ederken) hareketin engellenip engellenmediğini belirlemek yada tekrar planlamak için.
zh_cn: 有时，知道控制器是否跟踪了设定值到给定的容忍范围内是有用的——例如，确定一个命令是否应该结束，或者(在遵循一个运动轮廓时)是否运动被阻碍，需要重新规划。

source: To do this, we first must specify the tolerances with the ``setTolerance()`` method; then, we can check it with the ``atSetpoint()`` method.
es_mx: Para hacer esto, primero necesitamos especificar las tolerancias con el método ``setTolerance()``; entonces, podemos checarlo con el método ``atSetpoint()``.
fr_ca: Pour ce faire, nous devons d'abord spécifier les tolérances avec la méthode ``setTolerance()``; ensuite, nous pouvons le vérifier avec la méthode ``atSetpoint()``.
tr_tr: Bunu yapmak için önce toleransları ``setTolerance()`` yöntemi ile belirlemeliyiz; daha sonra ``atSetpoint()`` metodu ile kontrol edebiliriz.
zh_cn: 为此，我们首先必须使用' ' setTolerance() ' '方法指定公差;然后，我们可以用' ' atSetpoint() ' '方法检查它。

source: Resetting the Controller
es_mx: Reiniciando el controlador
fr_ca: Réinitialisation du contrôleur
tr_tr: Denetleyiciyi Sıfırlama
zh_cn: 重置控制器

source: It is sometimes desirable to clear the internal state (most importantly, the integral accumulator) of a ``PIDController``, as it may be no longer valid (e.g. when the ``PIDController`` has been disabled and then re-enabled). This can be accomplished by calling the ``reset()`` method.
es_mx: Algunas veces es deseable aclarar el estado interno (más importante, el acumulador integral) de un ``PIDController``, teniendo en cuenta que puede que ya no sea valido (ejemplo: cuando el ``PIDController`` ha sido desactivado y luego reactivado). Esto puede lograrse llamando el método ``reset()``.
fr_ca: Il est parfois souhaitable d'effacer l'état interne (le paramètre le plus important étant l'accumulateur intégré) d'un ``PIDController``, car il peut ne plus être valide (par exemple, lorsque le ``PIDController`` a été désactivé puis réactivé) . Cela peut être accompli en appelant la méthode ``reset()``.
tr_tr: Artık geçerli olmayabileceğinden (örneğin, ``PIDController`` devre dışı bırakıldığında ve ardından yeniden etkinleştirildiğinde) bir ``PIDController`` in dahili durumunu (en önemlisi, integral akümülatörü) temizlemek istenebilir. . Bu, ``reset()`` yöntemi çağrılarak gerçekleştirilebilir.
zh_cn: 有时需要清除``PIDController ``的内部状态(最重要的是，积分累加器)，因为它可能不再有效(例如，``PIDController ``已禁用，然后重新启用)。这可以通过调用`` reset() ``方法来完成。

source: Setting a Max Integrator Value
es_mx: Ajustando un valor integrador máximo.
fr_ca: La définition d'une valeur d'intégrateur maximale
tr_tr: Max Integrator Değeri Ayarlama
zh_cn: 设置最大积分器值

source: Integrators introduce instability and hysteresis into feedback loop systems. It is strongly recommended that teams avoid using integral gain unless absolutely no other solution will do - very often, problems that can be solved with an integrator can be better solved through use of a more-accurate :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`.
es_mx: Los integradores introducen inestabilidad e histéresis al sistema de retroalimentación del loop. Se recomienda fuertemente que los equipos eviten usar ganancias integrales a menos de que ninguna otra opción sirva - muy a menudo, los problemas que pueden ser resueltos con un integrador pueden ser resueltos por medio del uso de un :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` más preciso.
fr_ca: Les intégrateurs introduisent l'instabilité et l'hystérésis dans les systèmes de boucle de rétroaction. Il est fortement recommandé aux équipes d'éviter d'utiliser le gain intégral sauf si aucune autre solution ne fera l'affaire - très souvent, les problèmes qui peuvent être résolus avec un intégrateur peuvent être mieux résolus en utilisant un outil plus précis, comme le :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`.
tr_tr: Entegratörler, geri besleme döngü sistemlerine kararsızlık ve histerezis getirir. Kesinlikle başka hiçbir çözüm işe yaramayacaksa ekiplerin integral kazanımı kullanmaktan kaçınmaları şiddetle tavsiye edilir - çoğu zaman, bir entegratörle çözülebilecek sorunlar daha doğru bir :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` kullanılarak daha iyi çözülebilir.
zh_cn: 积分器将不稳定性和迟滞引入反馈回路系统。强烈建议团队避免使用积分增益除非绝对没有其他解决方案——通常,问题可以解决一个积分器可以更好的通过使用更为精确的解决 :ref:`feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`.

source: A typical problem encountered when using integral feedback is excessive "wind-up" causing the system to wildly overshoot the setpoint. This can be alleviated in a number of ways - the WPILib ``PIDController`` class enforces an integrator range limiter to help teams overcome this issue.
fr_ca: Un problème typique rencontré lors de l'utilisation de la rétroaction intégrale est un « emballement » excessif qui fait que le système dépasse largement le point de consigne. Cela peut être atténué de plusieurs manières - la classe WPILib ``PIDController`` applique un limiteur de plage d'intégrateur pour aider les équipes à surmonter ce problème.

source: By default, the total output contribution from the integral gain is limited to be between -1.0 and 1.0.
fr_ca: Par défaut, la contribution de sortie totale du gain intégral est limitée entre -1,0 et 1,0.

source: The range limits may be increased or decreased using the ``setIntegratorRange()`` method.
fr_ca: Les limites de plage peuvent être augmentées ou diminuées à l'aide de la méthode ``setIntegratorRange()``.

source: Setting Continuous Input
es_mx: Ajustando entradas continuas
fr_ca: Le réglage de l'entrée continue
tr_tr: Sürekli Girişi - Continuous Input Ayarlama
zh_cn: 设置连续输入
