Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controllers/pidcontroller.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: If your mechanism is not capable of fully continuous rotational motion (e.g. a turret without a slip ring, whose wires twist as it rotates), *do not* enable continuous input unless you have implemented an additional safety feature to prevent the mechanism from moving past its limit!
es_mx: Si su mecanismo no es capaz de usar un movimiento de rotación continua completo (ejemplo: una torreta con cables que se giran mientras rota), *no* active la entrada continua a menos de que tenga implementada una característica de seguridad adicional para prevenir que el mecanismo se mueva más allá de sus limites.
fr_ca: Si votre mécanisme n'est pas capable d'un mouvement de rotation entièrement continu (par exemple, une tourelle sans bague collectrice, dont les fils se tordent en tournant), il ne faut pas alors utiliser une entrée continue sauf si vous avez mis en place une fonction de sécurité supplémentaire pour empêcher le mécanisme de passer sa limite!
tr_tr: Mekanizmanız tamamen sürekli dönme kabiliyetine sahip değilse (örneğin, kabloları döndükçe bükülen, kayma halkası olmayan bir turret), mekanizmanın limitlerini geçmesini önlemek için ek bir güvenlik özelliği uygulamadıysanız sürekli girişi *etkinleştirmeyin* !
zh_cn: 如果你的机械装置不能完全连续旋转运动(例如，一个没有滑环的炮塔，它的电线在旋转时扭曲)，*不要*开启连续输入，除非你安装了额外的安全装置，以防止机械装置移动超过其限制!

source: The continuous input function does *not* automatically wrap your input values - be sure that your input values, when using this feature, are never outside of the specified range!
es_mx: La función de entrada continua *no* envuelve automáticamente sus valores de entrada - asegúrese que sus valores de entrada, mientras use esta función, nunca estén fuera del rango establecido.
fr_ca: La fonction d'entrée continue ne limite *pas* automatiquement vos valeurs d'entrée - assurez-vous que vos valeurs d'entrée, lorsque vous utilisez cette fonction, ne sont jamais en dehors de la plage spécifiée!
tr_tr: Sürekli giriş işlevi, giriş değerlerinizi otomatik olarak *kaydırmaz* - bu özelliği kullanırken, giriş değerlerinin asla belirtilen aralığın dışında olmadığından emin olun!
zh_cn: 连续输入函数*不会*自动包装您的输入值-请确保您的输入值，在使用此功能时，永远不会超出指定的范围!

source: Some process variables (such as the angle of a turret) are measured on a circular scale, rather than a linear one - that is, each "end" of the process variable range corresponds to the same point in reality (e.g. 360 degrees and 0 degrees). In such a configuration, there are two possible values for any given error, corresponding to which way around the circle the error is measured. It is usually best to use the smaller of these errrors.
es_mx: Algunos procesos variables (como el angulo de una torreta) son medidos en una escala circular, en vez de una linear - esto es, que cada "fin" del proceso variable corresponde a algún punto en la realidad (ejemplo: 360 grados y 0 grados). En esa configuración, solo hay dos valores posibles para el error dado, correspondiente a la manera en la que el error circular es medido. Normalmente es mejor usar los más pequeños para estos errores.
fr_ca: Certaines variables de processus (telles que l'angle d'une tourelle) sont mesurées sur une échelle circulaire, plutôt que linéaire - c'est-à-dire que chaque "fin" de la plage de variables de processus correspond au même point dans la réalité (par exemple 360 ​​degrés et 0 degrés). Dans une telle configuration, il existe deux valeurs possibles pour une erreur donnée, correspondant à la direction du cercle dans laquelle l'erreur est mesurée. Il est généralement préférable d'utiliser la plus petite de ces erreurs.
tr_tr: Bazı işlem değişkenleri (bir taretin açısı gibi) doğrusal bir ölçek yerine dairesel bir ölçekte ölçülür - yani, proses değişken aralığının her "sonu" gerçekte aynı noktaya karşılık gelir (örneğin, 360 derece ve 0 derece). Böyle bir konfigürasyonda, herhangi bir hata için, hatanın daire etrafında hangi yoldan ölçüldüğüne karşılık gelen iki olası değer vardır. Bu hatalardan daha küçük olanı kullanmak genellikle en iyisidir.
zh_cn: 有些过程变量(比如炮塔的角度)是用圆形尺度而不是线性尺度来测量的——也就是说，过程变量范围的每一个“末端”都对应于现实中的同一点(例如360度和0度)。在这种结构中，任何给定的误差都有两个可能的值，对应于测量误差在圆内的位置。通常最好使用较小的错误。

source: To configure a ``PIDController`` to automatically do this, use the ``enableContinuousInput()`` method:
es_mx: Para configurar un ``PIDController`` para automáticamente hacer esto, use el método ``enableContinuousInput()``:
fr_ca: Pour configurer un ``PIDController`` pour le faire automatiquement, utilisez la méthode ``enableContinuousInput()`` :
tr_tr: Bunu otomatik olarak yapacak bir ``PIDController`` yapılandırmak için, ``enableContinuousInput()`` yöntemini kullanın:
zh_cn: 要配置一个`` PIDController ``来自动执行此操作，请使用``enableContinuousInput() ``方法:

source: Clamping Controller Output
es_mx: Salida del controlador de sujeción
fr_ca: Le cramponnage de la sortie du contrôleur
tr_tr: Kontrol Çıkışını Bağlama
zh_cn: 钳位控制器输出

source: Unlike the old ``PIDController``, the new controller does not offer any output clamping features, as the user is expected to use the loop output themselves. Output clamping can be easily achieved by composing the controller with WPI's ``clamp()`` function (or ``std::clamp`` in c++):
es_mx: Al contrario del viejo ``PIDController``, el nuevo controlador no ofrece ninguna función para salidas del controlador de sujeción, ya que se espera que el usuario use este loop de salida por el mismo. La salida de sujeción puede ser alcanzada fácilmente componiendo el controlador con la función ``clamp()`` de WPI (o ``std::clamp`` en c++):
fr_ca: Contrairement à l'ancien ``PIDController``, le nouveau contrôleur n'offre aucune fonction de cramponnage (clamp) de la sortie, car l'utilisateur est censé utiliser lui-même la sortie de boucle. Le cramponnage de sortie peut être facilement réalisé en ajoutant au contrôleur une fonction ``clamp()`` (ou ``std::clamp`` en C++):
tr_tr: Eski ``PIDController`` in aksine, kullanıcının döngü çıkışını kendisinin kullanması beklendiğinden, yeni kontrolör herhangi bir çıkış bağlama özelliği sunmamaktadır. Çıkış bağlama, denetleyiciyi WPI'nin ``clamp()`` işlevi (veya c++ 'da ``std::clamp``) ile oluşturarak kolayca elde edilebilir:
zh_cn: 与旧的``PIDController''不同，新的控制器不提供任何输出钳位功能，因为希望用户自己使用循环输出。通过使用WPI的``clamp（）''函数（或c ++中的``std :: clamp``）组合控制器，可以轻松实现输出钳位：

source: A typical problem encountered when using integral feedback is excessive "wind-up" causing the system to wildly overshoot the setpoint. This can be alleviated in a number of ways - the WPILib ``PIDController`` offers an integrator range limiter to help teams overcome this issue.
es_mx: Un problema típico que se encuentra cuando se usa una retroalimentación integral es el exceso de "wind-up" causando que el sistema exceda el setpoint extensamente. Esto puede ser remediado de varias maneras - el ``PIDController`` de WPILib ofrece un limitador de rango de integrador para ayudar a los equipos a salir de este problema.
tr_tr: İntegral geri besleme kullanılırken karşılaşılan tipik bir sorun, sistemin ayar noktasını çılgınca aşmasına neden olan aşırı "tetiklemedir". Bu, birkaç yolla hafifletilebilir - WPILib ``PIDController``, takımların bu sorunun üstesinden gelmesine yardımcı olmak için bir entegratör menzil sınırlayıcısı sunar.

source: Enabling this setting with the ``setIntegratorRange()`` method will prevent the total output contribution from the integral gain from exceeding the user-specified bounds.
es_mx: Activando esta configuración con el método ``setIntegratorRange()`` prevendrá que la contribución de la salida total de la ganancia integral se exceda de los limites especificados por el usuario.
tr_tr: Bu ayarın ``setIntegratorRange()`` yöntemiyle etkinleştirilmesi, integral kazancın toplam çıktı katkısının kullanıcı tarafından belirlenen sınırları aşmasını önleyecektir.

source: WPILib supports PID control of mechanisms through the ``PIDController`` class (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1PIDController.html>`__). This class handles the feedback loop calculation for the user, as well as offering methods for returning the error, setting tolerances, and checking if the control loop has reached its setpoint within the specified tolerances.
es_mx: WPILib soporta el control PID de mecanismos a través de la clase (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/controller/PIDController.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc2_1_1PIDController.html>`__). Esta clase maneja el cálculo del bucle de retroalimentación por el usuario. De igual manera ofrece métodos para devolver el error, ajustar tolerancias, y checar si el bucle de control ha alcanzado su punto de ajuste dentro de las tolerancias especificadas,
