Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controllers/profiled-pidcontroller.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Combining Motion Profiling and PID Control with ProfiledPIDController
es_mx: Combinando perfiles de movimiento y control de PID con ProfiledPIDController
fr_ca: Combinaison du profilage de mouvement et du contrôle PID avec ProfiledPIDController
tr_tr: Motion Profiling ve PID Control'ü ProfiledPIDController ile Birleştirme
zh_cn: 将运动分析和PID控制与ProfiledPIDController相结合

source: For a guide on implementing the ``ProfiledPIDController`` class in the :ref:`command-based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` framework, see :ref:`docs/software/commandbased/profilepid-subsystems-commands:Combining Motion Profiling and PID in Command-Based`.
es_mx: Para una guia implementando la clase ``ProfiledPIDController`` en el :ref:`command-based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` entorno de trabajo, vea :ref:`docs/software/commandbased/profilepid-subsystems-commands:Combining Motion Profiling and PID in Command-Based`.
fr_ca: Pour un guide sur l'implémentation de la classe ``ProfiledPIDController`` dans le cadre du :ref:`command-based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` framework, see :ref:`docs/software/commandbased/profilepid-subsystems-commands:Combining Motion Profiling and PID in Command-Based`.
tr_tr: ``ProfiledPIDController`` sınıfının :ref:`command-based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` Çerçevesine uygulanmasına ilişkin bir kılavuz için, bkz: :ref:`docs/software/commandbased/profilepid-subsystems-commands:Combining Motion Profiling and PID in Command-Based`.
zh_cn: 有关在基于命令的框架:ref:`command-based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` framework，请参阅 :ref:`docs/software/commandbased/profilepid-subsystems-commands:Combining Motion Profiling and PID in Command-Based`.

source: In the previous article, we saw how to use the ``TrapezoidProfile`` class to create and use a trapezoidal motion profile. The example code from that article demonstrates manually composing the ``TrapezoidProfile`` class with the external PID control feature of a "smart" motor controller.
es_mx: En el artículo anterior, vimos cómo usar la clase ``TrapezoidProfile`` para crear y usar un perfil de movimiento trapezoidal. El código de ejemplo de ese artículo demuestra la composición manual de la clase ``TrapezoidProfile`` con la función de control PID externo de un controlador de motor "smart".
fr_ca: Dans l'article précédent, nous avons vu comment utiliser la classe ``TrapezoidProfile`` pour créer et utiliser un profil de mouvement trapézoïdal. L'exemple de code de cet article montre comment créer manuellement la classe ``TrapezoidProfile`` avec la fonction de contrôle PID externe d'un contrôleur de moteur "intelligent".
tr_tr: Önceki makalede, trapezoidal hareket profili oluşturmak ve kullanmak için `` TrapezoidProfile`` sınıfının nasıl kullanılacağını gördük. Bu makaledeki örnek kod, bir "akıllı" motor kontrol cihazının harici PID kontrol özelliği ile ``TrapezoidProfile`` sınıfını manuel olarak oluşturmayı gösterir.
zh_cn: 在上一篇文章中，我们看到了如何使用TrapezoidProfile类来创建和使用梯形运动轮廓。该文章中的示例代码演示了如何使用“智能”电机控制器的外部PID控制功能手动组合“ TrapezoidProfile”类。

source: This combination of functionality (a motion profile for generating setpoints combined with a PID controller for following them) is extremely common. To facilitate this, WPILib comes with a ``ProfiledPIDController`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/controller/ProfiledPIDController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_profiled_p_i_d_controller.html>`__) that does most of the work of combining these two functionalities. The API of the ``ProfiledPIDController`` is very similar to that of the ``PIDController``, allowing users to add motion profiling to a PID-controlled mechanism with very few changes to their code.
fr_ca: Cette combinaison de fonctionnalités (un profil de mouvement pour générer des points de consigne combiné à un contrôleur PID pour les suivre) est extrêmement courante. Pour faciliter cela, WPILib est livré avec une classe ``ProfiledPIDController`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/controller/ProfiledPIDController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_profiled_p_i_d_controller.html>`__) qui fait la majeure partie du travail de combinaison de ces deux fonctionnalités. L’API du ``ProfiledPIDController`` est très similaire à celle du ``PIDController``, permettant aux utilisateurs d’ajouter un profilage de mouvement à un mécanisme contrôlé par PID avec très peu de modifications à leur code.

source: Using the ProfiledPIDController class
es_mx: Usando la clase ProfiledPIDController
fr_ca: L'utilisation de la classe ProfiledPIDController
tr_tr: ProfiledPIDController sınıfını kullanma
zh_cn: 使用ProfiledPIDController类

source: In C++, the ``ProfiledPIDController`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in values *must* have units consistent with the distance units, or a compile-time error will be thrown. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
es_mx: En C ++, la clase ``ProfiledPIDController`` se basa en el tipo de unidad utilizada para las mediciones de distancia, que puede ser angular o lineal. Los valores pasados ​​*deben* tener unidades consistentes con las unidades de distancia, o se lanzará un error en tiempo de compilación. Para obtener más información sobre las unidades C ++, consulte :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
fr_ca: En C ++, la classe ``ProfiledPIDController`` est basée sur le type d'unité utilisé pour les mesures de distance, qui peut être angulaire ou linéaire. Les valeurs transmises *doivent* avoir des unités cohérentes avec les unités de distance, sinon une erreur de compilation sera levée. Pour plus d'informations sur les unités C++, voir :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
tr_tr: C ++ 'da, ``ProfiledPIDController``sınıfı, açısal veya doğrusal olabilen mesafe ölçümleri için kullanılan birim türüne göre şablonlanır. İletilen değerler * zorunlu * mesafe birimleriyle tutarlı birimlere sahip olmalıdır, aksi takdirde derleme zamanı hatası atılır. C ++ birimleri hakkında daha fazla bilgi için bkz :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`..
zh_cn: 在C ++中，“ ProfiledPIDController”类在用于距离测量的单位类型（可能是角度的或线性的）上模板化。传入的值*必须*具有与距离单位一致的单位，否则将引发编译时错误。有关C ++单元的更多信息，请参阅：docs / software / basic-programming / cpp-units：C ++单元库。

source: Much of the functionality of ``ProfiledPIDController`` is effectively identical to that of ``PIDController``. Accordingly, this article will only cover features that are substantially-changed to accommodate the motion profiling functionality. For information on standard ``PIDController`` features, see :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
es_mx: Gran parte de la funcionalidad de ``ProfiledPIDController`` es efectivamente idéntica a la de ``PIDController``. En consecuencia, este artículo solo cubrirá las características que han cambiado sustancialmente para adaptarse a la funcionalidad de creación de perfiles de movimiento. Para obtener información sobre las características estándar del ``PIDController``, consulte :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
fr_ca: La plupart des fonctionnalités de ``ProfiledPIDController`` sont relativement identiques à celle de ``PIDController``. Par conséquent, cet article ne couvrira que les fonctionnalités qui ont été substantiellement modifiées pour s'adapter à la fonctionnalité de profilage de mouvement. Pour plus d'informations sur les fonctionnalités standard de ``PIDController``, voir :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
tr_tr: ``ProfiledPIDController`` işlevinin çoğu, `` PIDController`` ile etkin bir şekilde aynıdır. Buna göre, bu makale yalnızca hareket profili oluşturma işlevini barındırmak için büyük ölçüde değiştirilmiş özellikleri kapsayacaktır. Standart ``PIDController`` özellikleri hakkında bilgi için bkz .: ref: `docs / software / advanced-controls / controllers / pidcontroller: PID Control in WPILib`.
zh_cn: ProfiledPIDController的许多功能实际上与PIDController的功能相同。因此，本文将仅涵盖经过实质性更改以适应运动分析功能的功能。有关标准``PIDController''功能的信息，请参阅 :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.

source: Constructing a ProfiledPIDController
es_mx: Construyendo un ProfiledPIDController
fr_ca: La construction d'un objet ProfiledPIDController
tr_tr: Profilli PIDController Oluşturma
zh_cn: 构造一个ProfiledPIDController

source: C++ is often able to infer the type of the inner classes, and thus a simple initializer list (without the class name) can be sent as a parameter. The full class name is included in the example below for clarity.
es_mx: C++ a menudo puede inferir el tipo de las clases internas y, por lo tanto, se puede enviar una lista de inicializadores simple (sin el nombre de la clase) como parámetro. El nombre completo de la clase se incluye en el siguiente ejemplo para mayor claridad.
fr_ca: C ++ est souvent capable d'inférer le type des classes internes, et donc une simple liste d'initialisation (sans le nom de la classe) peut être envoyée en tant que paramètre. Le nom complet de la classe est inclus dans l'exemple ci-dessous pour plus de clarté.
tr_tr: C ++ genellikle iç sınıfların türünü çıkarabilir ve bu nedenle basit bir başlatıcı listesi (sınıf adı olmadan) parametre olarak gönderilebilir. Tam sınıf adı, netlik açısından aşağıdaki örnekte verilmiştir.
zh_cn: C ++通常能够推断内部类的类型，因此可以将简单的初始化列表（没有类名）作为参数发送。为了清楚起见，完整的类名包含在下面的示例中。

source: Creating a ``ProfiledPIDController`` is nearly identical to :ref:`creating a PIDController <docs/software/advanced-controls/controllers/pidcontroller:Constructing a PIDController>`. The only difference is the need to supply a set of :ref:`trapezoidal profile constraints <docs/software/advanced-controls/controllers/trapezoidal-profiles:Constraints>`, which will be automatically forwarded to the internally-generated ``TrapezoidProfile`` instances:
es_mx: Crear un ``ProfiledPIDController`` es casi idéntico a :ref:`creating a PIDController <docs/software/advanced-controls/controllers/pidcontroller:Constructing a PIDController>`. La única diferencia es la necesidad de suministrar un conjunto de :ref:`trapezoidal profile constraints <docs/software/advanced-controls/controllers/trapezoidal-profiles:Constraints>`, que se reenviará automáticamente a las instancias ``TrapezoidProfile`` generadas internamente:
fr_ca: La création d'un ``ProfiledPIDController`` est presque identique à :ref:`creating a PIDController <docs/software/advanced-controls/controllers/pidcontroller:Constructing a PIDController>`. La seule différence est la nécessité de fournir un ensemble de :ref:`trapezoidal profile constraints <docs/software/advanced-controls/controllers/trapezoidal-profiles:Constraints>`, qui seront automatiquement transmises aux instances du "TrapezoidProfile" :
tr_tr: Bir ``ProfiledPIDController`` oluşturmak, :ref:`creating a PIDController <docs/software/advanced-controls/controllers/pidcontroller:Constructing a PIDController>` oluşturmak ile neredeyse aynıdır. Tek fark, dahili olarak oluşturulan `` TrapezoidProfile '' örneklerine otomatik olarak iletilecek olan bir dizi :ref:`trapezoidal profile constraints <docs/software/advanced-controls/controllers/trapezoidal-profiles:Constraints>`, sağlama ihtiyacıdır:
zh_cn: 创建``ProfiledPIDController''几乎与创建PIDController :ref:`creating a PIDController <docs/software/advanced-controls/controllers/pidcontroller:Constructing a PIDController>`. 完全相同。唯一的区别是需要提供一组梯形轮廓约束<docs/software/advanced-controls/controllers/trapezoidal-profiles:Constraints>`,这些约束将自动转发到内部生成的``TrapezoidProfile ``实例：

source: Goal vs Setpoint
es_mx: Objetivo vs punto de ajuste
fr_ca: Objectif vs point de consigne
tr_tr: Hedef ve Ayar Noktası
zh_cn: 目标与设定点

source: A major difference between a standard ``PIDController`` and a ``ProfiledPIDController`` is that the actual *setpoint* of the control loop is not directly specified by the user. Rather, the user specifies a *goal* position or state, and the setpoint for the controller is computed automatically from the generated motion profile between the current state and the goal. So, while the user-side call looks mostly identical:
es_mx: Una diferencia importante entre un ``PIDController`` estándar y un ``ProfiledPIDController`` es que el usuario no especifica directamente el *setpoint* real del lazo de control. Más bien, el usuario especifica una posición o estado *meta*, y el punto de ajuste para el controlador se calcula automáticamente a partir del perfil de movimiento generado entre el estado actual y el objetivo. Entonces, mientras que la llamada del lado del usuario parece casi idéntica:
fr_ca: Une différence majeure entre un ``PIDController`` normal et un ``ProfiledPIDController`` est que le *point de consigne* réel de la boucle de régulation n'est pas directement spécifié par l'utilisateur. Au contraire, l'utilisateur spécifie une position ou un état souhaité, ou *objectif*, et le point de consigne pour le contrôleur est calculé automatiquement à partir du profil de mouvement généré entre l'état actuel et l'état objectif. Alors que la commande pour appeler cette classe semble essentiellement identique:
tr_tr: Standart bir `` PIDController`` ile `` ProfiledPIDController`` arasındaki en büyük fark, kontrol döngüsünün gerçek* ayar noktasının * kullanıcı tarafından doğrudan belirtilmemesidir. Bunun yerine, kullanıcı bir *hedef * konumu veya durumu belirtir ve kontrolör için ayar noktası, mevcut durum ile hedef arasında oluşturulan hareket profilinden otomatik olarak hesaplanır. Dolayısıyla, kullanıcı tarafı arama çoğunlukla aynı görünürken:
zh_cn: 标准``PIDController''和``ProfiledPIDController''之间的主要区别在于控制环的实际*设置点*不是由用户直接指定的。而是由用户指定目标位置或状态，并根据当前状态和目标之间生成的运动曲线自动计算控制器的设定点。因此，尽管用户端调用看起来大致相同：

source: The specified ``goal`` value (which can be either a position value or a ``TrapezoidProfile.State``, if nonzero velocity is desired) is *not* necessarily the *current* setpoint of the loop - rather, it is the *eventual* setpoint once the generated profile terminates.
es_mx: El valor de ``meta`` especificado (que puede ser un valor de posición o un ``TrapezoidProfile.State``, si se desea una velocidad distinta de cero) *no* es necesariamente el *actual* del bucle, sino que es el *eventual* punto de ajuste una vez que finaliza el perfil generado.
fr_ca: La valeur ``objectif`` spécifiée (qui peut être une valeur de position ou un ``TrapezoidProfile.State``, si une vitesse non nulle est souhaitée) n'est *pas* nécessairement le point de consigne *actuel* de la boucle - plutôt, elle est le point de consigne *éventuel* une fois le profil généré terminé.
tr_tr: Belirtilen ``hedef`` değeri (sıfırdan farklı bir hız isteniyorsa, bir konum değeri veya bir ``TrapezProfile.State`` olabilir), döngünün *zorunlu* akım *ayar noktası değildir - daha ziyade, oluşturulan profil sona erdiğinde *nihai * ayar noktasıdır.
zh_cn: 指定的“目标”值（如果需要非零速度，则可以是位置值或“ TrapezoidProfile.State”）*不一定*一定是回路的*当前*设定值-而是一旦生成的配置文件终止，*最终*设定点。

source: Getting/Using the Setpoint
es_mx: Obtención / uso del punto de ajuste
fr_ca: L'obtention / l'utilisation du point de consigne
tr_tr: Ayar Noktasını Alma / Kullanma
zh_cn: 获取/使用设定值

source: Since the ``ProfiledPIDController`` goal differs from the setpoint, is if often desirable to poll the current setpoint of the controller (for instance, to get values to use with :ref:`feedforward <docs/software/advanced-controls/controllers/combining-feedforward-feedback:Using Feedforward Components with PID>`). This can be done with the ``getSetpoint()`` method.
es_mx: Dado que el objetivo del ``ProfiledPIDController`` difiere del punto de ajuste, si a menudo es deseable sondear el punto de ajuste actual del controlador (por ejemplo, para obtener valores para usar con:ref:`feedforward <docs/software/advanced-controls/controllers/combining-feedforward-feedback:Using Feedforward Components with PID>`). Esto se puede hacer con el método ``getSetpoint()``.
fr_ca: Étant donné que l'objectif ``ProfiledPIDController`` diffère du point de consigne, il est souvent souhaitable d'interroger le contrôleur pour obtenir le point de consigne actuel (par exemple, pour obtenir des valeurs à utiliser avec :ref:`feedforward <docs/software/advanced-controls/controllers/combining-feedforward-feedback:Using Feedforward Components with PID>`). Cela peut être fait avec la méthode ``getSetpoint()``.
tr_tr: ``ProfiledPIDController`` hedefi ayar noktasından farklı olduğundan, genellikle kontrolörün mevcut ayar noktasını sorgulamak istenir (örneğin, kullanılacak değerleri almak için: ref: `ileri besleme <docs/software/advanced-controls/controllers/combining-feedforward-feedback:Using Feedforward Components with PID>`). Bu, ``getSetpoint ()`` yöntemi ile yapılabilir.
zh_cn: 由于ProfiledPIDController目标不同于设定值，因此通常需要轮询控制器的当前设定值（例如，获取:ref:`feedforward <docs/software/advanced-controls/controllers/combining-feedforward-feedback:Using Feedforward Components with PID>`). 这可以通过getSetpoint（）方法来完成。

source: The returned setpoint might then be used as in the following example:
es_mx: El punto de ajuste devuelto podría usarse como en el siguiente ejemplo:
fr_ca: Le point de consigne renvoyé peut alors être utilisé comme dans l'exemple suivant.
tr_tr: Döndürülen ayar noktası daha sonra aşağıdaki örnekte olduğu gibi kullanılabilir:
zh_cn: 然后，可以将返回的设定值用于以下示例：

source: Complete Usage Example
es_mx: Ejemplo de uso completo
fr_ca: Un exemple complet d'utilisation
tr_tr: Tam Kullanım Örneği
zh_cn: 完整用法示例

source: A more complete example of ``ProfiledPIDController`` usage is provided in the ElevatorProfilePID example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorprofiledpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorProfiledPID/cpp>`__):
es_mx: Un ejemplo más completo del uso de ``ProfiledPIDController`` se proporciona en el proyecto de ejemplo ElevatorProfilePID (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorprofiledpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorProfiledPID/cpp>`__):
fr_ca: Un exemple plus complet de l’utilisation de ``ProfiledPIDController`` est fourni dans le projet d’exemple ElevatorProfilePID (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorprofiledpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorProfiledPID/cpp>`__):
tr_tr: ElevatorProfilePID örnek projesinde ``ProfiledPIDController`` kullanımının daha eksiksiz bir örneği verilmiştir (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorprofiledpid>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorProfiledPID/cpp>` __):
zh_cn: ElevatorProfilePID示例项目(`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorprofiledpid>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/ElevatorProfiledPID/cpp>`__):

source: This combination of functionality (a motion profile for generating setpoints combined with a PID controller for following them) is extremely common. To facilitate this, WPILib comes with a ``ProfiledPIDController`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/ProfiledPIDController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ProfiledPIDController.html>`__) that does most of the work of combining these two functionalities. The API of the ``ProfiledPIDController`` is very similar to that of the ``PIDController``, allowing users to add motion profiling to a PID-controlled mechanism with very few changes to their code.
zh_cn: 这种功能组合（用于生成设定值的运动曲线与用于跟随设定值的PID控制器相结合）非常普遍。为此，WPILib带有一个ProfiledPIDController类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/ProfiledPIDController.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ProfiledPIDController.html>`__），它完成了将这两种功能结合在一起的大部分工作。 ``ProfiledPIDController''的API与``PIDController''的API非常相似，允许用户在很少更改其代码的情况下将运动曲线添加到PID控制的机制中。
