Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controllers/trapezoidal-profiles.po
Languages: es_mx, fr_ca, tr_tr

source: Trapezoidal Motion Profiles in WPILib
es_mx: Perfil de movimiento trapezoidal en WPILib
fr_ca: Profils de mouvement trapézoïdal dans WPILib
tr_tr: WPILib'de Trapezoid Hareket Profilleri

source: Todo
fr_ca: Ce qui reste à faire
tr_tr: Yapılacaklar

source: link to conceptual motion profiling article
es_mx: enlace al artículo de generación de perfiles de movimiento conceptual
fr_ca: Lien vers l'article sur le profil de mouvement conceptuel
tr_tr: kavramsal hareket profili oluşturma makalesine bağlantı

source: This article covers the in-code generation of trapezoidal motion profiles. Documentation describing the involved concepts in more detail is forthcoming.
es_mx: Este artículo cubre la generación en código de perfil de movimiento trapezoidal. A continuación se presentan más detalles que describen los conceptos involucrados.
fr_ca: Cet article couvre la génération de profils de mouvement trapézoïdaux. Une documentation plus détaillée décrivant les concepts impliqués est à venir.
tr_tr: Bu makale, trapezoidal hareket profillerinin kod içi üretimini kapsar. İlgili kavramları daha ayrıntılı olarak açıklayan belgeler yakında çıkacaktır.

source: For a guide on implementing the ``TrapezoidProfile`` class in the :ref:`command-based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` framework, see :ref:`docs/software/commandbased/profile-subsystems-commands:Motion Profiling through TrapezoidProfileSubsystems and TrapezoidProfileCommands`.
es_mx: Para obtener una guía sobre la implementación de la clase `TrapezoidProfile`` en :ref:`command-based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` framework, ver :ref:`docs/software/commandbased/profile-subsystems-commands:Motion Profiling through TrapezoidProfileSubsystems and TrapezoidProfileCommands`.
fr_ca: Pour un guide sur la mise en œuvre de la classe ``TrapezoidProfile`` dans le cadre du :ref:`command-based framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` voir :ref:`docs/software/commandbased/profile-subsystems-commands:Motion Profiling through TrapezoidProfileSubsystems and TrapezoidProfileCommands`.
tr_tr: ``TrapezoidProfile`` sınıfının :ref:`komut tabanlı framework <docs/software/commandbased/what-is-command-based:What Is "Command-Based" Programming?>` çerçevesinde uygulanmasına ilişkin bir kılavuz için bkz :ref:`docs/software/commandbased/profile-subsystems-commands:Motion Profiling through TrapezoidProfileSubsystems and TrapezoidProfileCommands` .

source: The ``TrapezoidProfile`` class, used on its own, is most useful when composed with a custom controller (such as a "smart" motor controller with a built-in PID functionality). To integrate it with a WPILib ``PIDController``, see :doc:`profiled-pidcontroller`.
es_mx: La clase ``TrapezoidProfile``, utilizada por su cuenta, es más útil cuando se compone con un controlador personalizado (tales como un controlador de motor "inteligente" con una funcionalidad PID integrada). Para integrarlo con un WPILib ``ControladorPID``, vea :doc:`profiled-pidcontroller`.
fr_ca: Lorsque la classe ``TrapezoidProfile`` est utilisée seule, elle est mieux servie quand elle est pairée avec un contrôleur de type "intelligent" (tel qu'un contrôleur de moteur avec une fonctionnalité PID intégrée). Pour l'intégrer à la classe ``PIDController`` de WPILib, voir :doc:`profiled-pidcontroller`.
tr_tr: Kendi başına kullanılan ``TrapezoidProfile`` sınıfı, özel bir kontrolörle (yerleşik PID işlevselliğine sahip "akıllı" bir motor kontrolörü gibi) oluşturulduğunda çok kullanışlıdır. Bir WPILib ``PIDController`` ile entegre etmek için, bakınız :doc:`profiled-pidcontroller`.

source: While feedforward and feedback control offer convenient ways to achieve a given setpoint, we are often still faced with the problem of generating setpoints for our mechanisms. While the naive approach of immediately commanding a mechanism to its desired state may work, it is often suboptimal. To improve the handling of our mechanisms, we often wish to command mechanisms to a *sequence* of setpoints that smoothly interpolate between its current state, and its desired goal state.
es_mx: Mientras el avance y el control de la retroalimentación ofrecen maneras convenientes de lograr un punto fijo, estamos constantemente enfrentándonos al problema de la generación de un punto fijo para nuestros mecanismos. Si bien el enfoque ingenuo de comandar inmediatamente un mecanismo a su estado deseado puede funcionar, usualmente no es óptimo. Para mejorar el manejo de nuestros mecanismos, normalmente deseamos ordenar mecanismos a una *secuencia* de puntos fijos que interpolan suavemente entre su estado actual, y su estado deseado.
fr_ca: Bien que le contrôle par anticipation (Feedforward) et la rétroaction offrent des moyens pratiques d'atteindre un point de consigne donné, nous sommes souvent confrontés au problème de la génération de points de consigne pour nos mécanismes. Bien que l'approche naïve de commander immédiatement un mécanisme à son état souhaité puisse fonctionner, elle est souvent sous-optimale. Pour améliorer la gestion de nos mécanismes, nous voulons commander ces derniers en suivant une *séquence* de points de consigne qui interpolent en douceur la transition entre son état actuel et son état cible souhaité.
tr_tr: İleri besleme ve geri bildirim kontrolü, belirli bir ayar noktasına ulaşmak için uygun yollar sunsa da, çoğu zaman mekanizmalarımız için ayar noktaları oluşturma sorunuyla karşı karşıyayız. Bir mekanizmaya derhal istenen duruma getirme komutu yaklaşımı işe yarayabilirken, çoğu zaman yetersizdir. Mekanizmalarımızın işlevini iyileştirmek için, mekanizmalara, mevcut durumu ile istenen hedef durumu arasında sorunsuz bir şekilde geçiş yapan bir *dizi ayar noktasına* komut vermek isteriz.

source: To help users do this, WPILib provides a ``TrapezoidProfile`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/TrapezoidProfile.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_trapezoid_profile.html>`__).
fr_ca: Pour aider les utilisateurs à le faire, WPILib fournit une classe ``TrapezoidProfile`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/TrapezoidProfile.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_trapezoid_profile.html>`__).

source: Creating a TrapezoidProfile
es_mx: Creando un Perfil Trapezoidal
fr_ca: La création d'un profil trapézoïdal
tr_tr: Trapezoidal Profil Oluşturma

source: In C++, the ``TrapezoidProfile`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in values *must* have units consistent with the distance units, or a compile-time error will be thrown. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
es_mx: En C++, la clase ``TrapezoidProfile`` está basada en el tipo de unidad utilizada para medidas de distancia, las cuales pueden ser angulares o lineales. Los valores pasados *deben* tener unidades consistentes con las unidades de distancia, o se producirá un error de compilación de tiempo. Para más información de las unidades C++, vea :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
fr_ca: En C ++, la classe ``TrapezoidProfile`` est basée sur le type d'unité utilisé pour les mesures de distance, qui peut être angulaire ou linéaire. Les valeurs transmises *doivent* avoir des unités cohérentes avec les unités de distance, sinon une erreur de compilation sera levée. Pour plus d'informations sur les unités C ++, voir :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
tr_tr: C ++ 'da, ``TrapezoidProfile`` 'sınıfı, açısal veya doğrusal olabilen mesafe ölçümleri için kullanılan birim tipine göre şablonlanır. İletilen değerler zorunlu mesafe birimleriyle tutarlı birimlere sahip *olmalıdır*; aksi takdirde derleme zamanı hatası atılır. C ++ birimleri hakkında daha fazla bilgi için bkz . :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.

source: Constraints
es_mx: Restricciones
fr_ca: Les contraintes
tr_tr: Kısıtlamalar

source: The various :ref:`feedforward helper classes <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` provide methods for calculating the maximum simultaneously-achievable velocity and acceleration of a mechanism. These can be very useful for calculating appropriate motion constraints for your ``TrapezoidProfile``.
es_mx: Los diversos :ref:`feedforward helper classes <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` proporcionan métodos para calcular la máxima velocidad simultáneamente alcanzable y la aceleración de un mecanismo. Esto puede ser muy útil para calcular restricciones de movimientos adecuadas para ``Perfil Trapezoidal`.
fr_ca: Les différentes :ref:`classes de Feedforward <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` fournissent des méthodes pour calculer la vitesse et l'accélération maximales d'un mécanisme, de façon simultanée. Celles-ci peuvent être très utiles pour calculer les contraintes de mouvement appropriées générer un ``TrapezoidProfile``
tr_tr: Çeşitli :ref:`ileribesleme yardımcı sınıfları <docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`, bir mekanizmanın aynı anda elde edilebilen maksimum hızını ve ivmesini hesaplamak için yöntemler sağlar. Bunlar, ``TrapezoidProfile`` için uygun hareket kısıtlamalarını hesaplamak için çok yararlı olabilir.

source: In order to create a trapezoidal motion profile, we must first impose some constraints on the desired motion. Namely, we must specify a maximum velocity and acceleration that the mechanism will be expected to achieve during the motion. To do this, we create an instance of the ``TrapezoidProfile.Constraints`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/TrapezoidProfile.Constraints.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_trapezoid_profile_1_1_constraints.html>`__):
fr_ca: Afin de créer un profil de mouvement trapézoïdal, nous devons d’abord imposer certaines contraintes sur le mouvement souhaité. À savoir, nous devons spécifier une vitesse et une accélération maximales que le mécanisme devra atteindre pendant le mouvement. Pour ce faire, nous créons une instance de la classe ``TrapezoidProfile.Constraints`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/TrapezoidProfile.Constraints.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_trapezoid_profile_1_1_constraints.html>`__):

source: Start and End States
es_mx: Estados de Inicio y Fin
fr_ca: Les états de départ et de fin
tr_tr: Başlangıç ve Bitiş Durumları

source: Next, we must specify the desired starting and ending states for our mechanisms using the ``TrapezoidProfile.State`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/TrapezoidProfile.State.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_trapezoid_profile_1_1_state.html>`__). Each state has a position and a velocity:
fr_ca: Ensuite, nous devons spécifier les états de début et de fin souhaités pour nos mécanismes à l’aide de la classe ``TrapezoidProfile.State`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/trajectory/TrapezoidProfile.State.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_trapezoid_profile_1_1_state.html>`__). Chaque état a une position et une vitesse :

source: Putting It All Together
es_mx: Poniéndolo todo junto
fr_ca: Combiner tout cela ensemble
tr_tr: Hepsini bir araya koymak

source: C++ is often able to infer the type of the inner classes, and thus a simple initializer list (without the class name) can be sent as a parameter. The full class names are included in the example below for clarity.
es_mx: C++ normalmente es capaz de inferir el tipo de las clases internas y, por lo tanto, se puede enviar una lista de inicializadores simple (sin el nombre de clase) como parámetro. Los nombres completos de la clase están incluidos en el siguiente ejemplo.
fr_ca: C ++ est souvent capable d'inférer le type des classes internes, et donc une simple liste d'initialisation (sans le nom de la classe) peut être envoyée en tant que paramètre. Les noms de classe complets sont inclus dans l'exemple ci-dessous pour plus de clarté.
tr_tr: C++ genellikle iç sınıfların türünü çıkarabilir ve bu nedenle basit bir başlatıcı listesi (sınıf adı olmadan) parametre olarak gönderilebilir. Tam sınıf adları, netlik açısından aşağıdaki örnekte verilmiştir.

source: Now that we know how to create a set of constraints and the desired start/end states, we are ready to create our motion profile. The ``TrapezoidProfile`` constructor takes 3 parameters, in order: the constraints, the goal state, and the initial state.
es_mx: Ahora que sabemos cómo crear un conjunto de restricciones y los estados de inicio/fin deseados, estamos listos para crear nuestro perfil de movimiento. El constructor ''PerfilTrapezoidal'' toma 3 parámetros, para: las restricciones, el estado del objetivo y el estado inicial.
fr_ca: Maintenant que nous savons comment créer un ensemble de contraintes et les états de départ / fin souhaités, nous sommes prêts à créer notre profil de mouvement. Le constructeur ``TrapezoidProfile`` prend 3 paramètres, dans l'ordre: les contraintes, l'état souhaité et l'état initial.
tr_tr: Artık bir dizi kısıtlamayı ve istenen başlangıç / bitiş durumlarını nasıl oluşturacağımızı bildiğimize göre, hareket profilimizi oluşturmaya hazırız. ``TrapezoidProfile`` yapıcısı sırayla 3 parametre alır: kısıtlamalar-constraints, hedef durumu-goal state ve başlangıç durumu-initial state.

source: Using a ``TrapezoidProfile``
es_mx: Usando un ``Perfil Trapezoidal``
fr_ca: L'utilisation de ``TrapezoidProfile``
tr_tr: Bir ``TrapezoidProfile`` Kullanmak

source: Sampling the Profile
es_mx: Muestreo del Perfil
fr_ca: Échantillonnage du profil
tr_tr: Profili Örnekleme

source: Once we've created a ``TrapezoidProfile``, using it is very simple: to get the profile state at the given time after the profile has started, call the ``calculate()`` method:
es_mx: Una vez que hemos creado un ``Perfil Trapezoide``, su uso es muy simple: para obtener el estado del perfil en el momento dado después de que el perfil ha comenzado, llame al método ``calculate()``:
fr_ca: Une fois que nous avons créé un ``TrapezoidProfile``, son utilisation est très simple: pour obtenir l'état du profil à un moment donné après le démarrage du profil, appelez la méthode ``calculate()`` :
tr_tr: Bir ``TrapezoidProfile`` oluşturduktan sonra, onu kullanmak çok basittir: profil başladıktan sonra verilen zamanda profil durumunu elde etmek için ``calculate()`` yöntemini çağırın:

source: Using the State
es_mx: Usando el Estado
fr_ca: Utiliser l'État
tr_tr: Profil Durumunun Kullanılması

source: The ``calculate`` method returns a ``TrapezoidProfile.State`` class (the same one that was used to specify the initial/end states when constructing the profile). To use this for actual control, simply pass the contained position and velocity values to whatever controller you wish (for example, a PIDController):
es_mx: El método ``calculate`` devuelve una clase ``TrapezoidProfile.State`` (la misma que se usó para especificar los estados iniciales/finales al construir el perfil). Para usar esto para el control real, simplemente pasa los valores de posición y velocidad contenidos a cualquier controlador que desees (por ejemplo, un ControladorPID):
fr_ca: La méthode ``calculate`` renvoie une classe ``TrapezoidProfile.State`` (la même qui a été utilisée pour spécifier les états initiaux / finaux lors de la construction du profil). Afin de l'utiliser pour un contrôle réel, transmettez simplement les valeurs de position et de vitesse à n'importe quel contrôleur que vous souhaitez (par exemple, un PIDController):
tr_tr: ``calculate`` yöntemi, bir ``TrapezoidProfile.State`` sınıfını döndürür (profili oluştururken başlangıç / bitiş durumlarını belirtmek için kullanılanla aynı). Bunu gerçek kontrol için kullanmak için, içerilen konum ve hız değerlerini dilediğiniz kontrolöre (örneğin, bir PIDController) aktarmanız yeterlidir:

source: Complete Usage Example
es_mx: Ejemplo de Uso Completo
fr_ca: Un exemple d'utilisation complet
tr_tr: Tam Kullanım Örneği

source: In this example, the profile is re-computed every timestep. This is a somewhat different usage technique than is detailed above, but works according to the same principles - the profile is sampled at at a time corresponding to the loop period to get the setpoint for the next loop iteration.
es_mx: En este ejemplo, el perfil se recalcula a cada paso de tiempo. Se trata de una técnica de uso algo diferente a la que se detalla más arriba, pero funciona según los mismos principios: el perfil se muestrea en un momento correspondiente al período de bucle para obtener el punto fijo para la siguiente iteración del bucle.
fr_ca: Dans cet exemple, le profil est recalculé à chaque intervalle de temps. Il s'agit d'une technique d'utilisation quelque peu différente de celle décrite ci-dessus, mais qui fonctionne selon les mêmes principes - le profil est échantillonné à un moment correspondant à la période de boucle (typiquement 20 mSec) pour obtenir le point de consigne pour la prochaine itération de boucle.
tr_tr: Bu örnekte, profil her seferinde yeniden hesaplanmaktadır. Bu, yukarıda detaylandırılandan biraz farklı bir kullanım tekniğidir, ancak aynı ilkelere göre çalışır - profil, bir sonraki döngü yinelemesi için ayar noktasını elde etmek için döngü periyoduna karşılık gelen bir zamanda örneklenir.

source: A more complete example of ``TrapezoidProfile`` usage is provided in the ElevatorTrapezoidProfile example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatortrapezoidprofile>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorTrapezoidProfile/cpp>`__):
fr_ca: Un exemple plus complet de l’utilisation de ``TrapezoidProfile`` est fourni dans le projet d’exemple ElevatorTrapezoidProfile (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatortrapezoidprofile>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorTrapezoidProfile/cpp>`__):
tr_tr: ElevatorTrapezoidProfile örnek projesinde ``TrapezoidProfile`` kullanımının daha eksiksiz bir örneği verilmiştir (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatortrapezoidprofile>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ElevatorTrapezoidProfile/cpp>` __):

source: To help users do this, WPILib provides a ``TrapezoidProfile`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/TrapezoidProfile.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TrapezoidProfile.html>`__).
es_mx: Para ayudar a los usuarios a hacer esto, WPILib proporciona una clase ``TrapezoidProfile`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/TrapezoidProfile.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TrapezoidProfile.html>`__).

source: In order to create a trapezoidal motion profile, we must first impose some constraints on the desired motion. Namely, we must specify a maximum velocity and acceleration that the mechanism will be expected to achieve during the motion. To do this, we create an instance of the ``TrapezoidProfile.Constraints`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/TrapezoidProfile.Constraints.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TrapezoidProfile_1_1Constraints.html>`__):
es_mx: Para crear un perfil de movimiento trapezoidal, primero debemos imponer algunas restricciones al movimiento deseado. En concreto, debemos especificar una velocidad y una aceleración máximas que se espera que el mecanismo alcance durante el movimiento. Para ello, creamos una instancia de la clase ``TrapezoidProfile.Constraints`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/TrapezoidProfile.Constraints.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TrapezoidProfile_1_1Constraints.html>`__):

source: Next, we must specify the desired starting and ending states for our mechanisms using the ``TrapezoidProfile.State`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/TrapezoidProfile.State.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TrapezoidProfile_1_1State.html>`__). Each state has a position and a velocity:
es_mx: A continuación, debemos especificar los estados inicial y final deseados para nuestros mecanismos utilizando la clase ``TrapezoidProfile.State`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/TrapezoidProfile.State.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TrapezoidProfile_1_1State.html>`__). Cada estado tiene una posición y una velocidad:
