Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/sensors/accelerometers-software.po
Languages: fr_ca

source: Accelerometers - Software
fr_ca: Accéléromètres - Partie logicielle

source: This section covers accelerometers in software. For a hardware guide to accelerometers, see :ref:`docs/hardware/sensors/accelerometers-hardware:Accelerometers - Hardware`.
fr_ca: Cette section couvre le logiciel spécifique aux accéléromètres. Pour un guide qui explique le raccordement électrique des accéléromètres, voir :ref:`docs/hardware/sensors/accelerometers-hardware:Accelerometers - Hardware`.

source: An accelerometer is a device that measures acceleration.
fr_ca: Un accéléromètre est un appareil qui mesure l'accélération.

source: Accelerometers generally come in two types: single-axis and 3-axis. A single-axis accelerometer measures acceleration along one spatial dimension; a 3-axis accelerometer measures acceleration along all three spatial dimensions at once.
fr_ca: Les accéléromètres se présentent généralement en deux types: axe unique et 3-axes. Un accéléromètre à axe unique mesure l'accélération le long d'une seule dimension spatiale; un accéléromètre à 3 axes mesure l'accélération le long des trois dimensions spatiales à la fois.

source: WPILib supports single-axis accelerometers through the `AnalogAccelerometer`_ class.
fr_ca: WPILib prend en charge les accéléromètres à axe unique via la classe `AnalogAccelerometer`_.

source: Three-axis accelerometers often require more complicated communications protocols (such as SPI or I2C) in order to send multi-dimensional data. WPILib has native support for the following 3-axis accelerometers:
fr_ca: Les accéléromètres à trois axes nécessitent souvent des protocoles de communication plus complexes (tels que SPI ou I2C) pour envoyer des données multidimensionnelles. WPILib a supporte les accéléromètres 3 axes suivants:

source: AnalogAccelerometer
fr_ca: La classe AnalogAccelerometer

source: If users have a 3-axis analog accelerometer, they can use three instances of this class, one for each axis.
fr_ca: Si les utilisateurs disposent d'un accéléromètre analogique à 3 axes, ils peuvent utiliser trois instances de cette classe, une pour chaque axe.

source: There are getters for the acceleration along each cardinal direction (x, y, and z), as well as a setter for the range of accelerations the accelerometer will measure.
fr_ca: Il existe des accesseurs en lecture (getters) pour l'accélération le long de chaque direction cardinale (x, y et z), ainsi qu'un accesseur en écriture (setter) pour la plage d'accélérations que l'accéléromètre mesurera.

source: ADXL345_I2C
fr_ca: La classe ADXL345_I2C

source: ADXL345_SPI
fr_ca: La classe ADXL345_SPI

source: ADXL362
fr_ca: La classe ADXL362

source: BuiltInAccelerometer
fr_ca: La classe BuiltInAccelerometer

source: Third-party accelerometers
fr_ca: Les accéléromètres provenant de tierce-parties

source: While WPILib provides native support for a number of accelerometers that are available in the kit of parts or through FIRST Choice, there are a few popular AHRS (Attitude and Heading Reference System) devices commonly used in FRC that include accelerometers. These are generally controlled through vendor libraries, though if they have a simple analog output they can be used with the `AnalogAccelerometer`_ class.
fr_ca: Alors que WPILib fournit un support intégré pour un certain nombre d'accéléromètres disponibles dans le kit de pièces ou via FIRST Choice, il existe certains dispositifs AHRS (Attitude and Heading Reference System) qui contiennent des accéléromètres. Ceux-ci sont généralement pris en charge à partir des librairies des manufacturiers. Par contre, si ces dispositifs ont une sortie analogique simple, ils peuvent être utilisées avec la classe `AnalogAccelerometer`_.

source: Using accelerometers in code
fr_ca: Utilisation des accéléromètres dans le logiciel

source: Accelerometers, as their name suggests, measure acceleration. Precise accelerometers can be used to determine position through double-integration (since acceleration is the second derivative of position), much in the way that gyroscopes are used to determine heading. However, the accelerometers available for use in FRC are not nearly high-enough quality to be used this way.
fr_ca: Les accéléromètres, comme leur nom l'indique, mesurent l'accélération. Des accéléromètres précis peuvent être utilisés pour déterminer la position grâce à une double intégration (puisque l'accélération est la deuxième dérivée de la position), de la même manière que les gyroscopes sont utilisés pour déterminer le cap. Cependant, les accéléromètres disponibles pour une utilisation en FRC n'ont pas le degré de performance nécessaire pour être utilisés de cette façon.

source: It is recommended to use accelerometers in FRC\ |reg| for any application which needs a rough measurement of the current acceleration. This can include detecting collisions with other robots or field elements, so that vulnerable mechanisms can be automatically retracted. They may also be used to determine when the robot is passing over rough terrain for an autonomous routine (such as traversing the defenses in FIRST Stronghold).
fr_ca: Il est recommandé d’utiliser des accéléromètres en FRC\ |reg| pour toute application qui a besoin d’une mesure approximative de l’accélération actuelle. Cela peut inclure la détection de collisions avec d’autres robots ou éléments de terrain, de sorte que les mécanismes vulnérables puissent être automatiquement rétractés. Ils peuvent également être utilisés pour déterminer quand le robot passe sur un terrain accidenté pour une routine du mode autonome (comme traverser les défenses comme dans FIRST Stronghold).

source: For detecting collisions, it is often more robust to measure the jerk than the acceleration. The jerk is the derivative (or rate of change) of acceleration, and indicates how rapidly the forces on the robot are changing - the sudden impulse from a collision causes a sharp spike in the jerk. Jerk can be determined by simply taking the difference of subsequent acceleration measurements, and dividing by the time between them:
fr_ca: Pour détecter les collisions, il est préférable de mesurer le paramètre de secousse (Jerk) plutôt que l'accélération. La secousse est la dérivée (ou le taux de changement) de l'accélération, et indique à quelle vitesse les forces sur le robot changent - l'impulsion soudaine d'une collision provoque une forte pointe dans la valeur de la secousse. La secousse peut être calculée en prenant simplement la différence entre deux mesures d'accélération subséquentes et en divisant par le temps entre elles:
