Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/sensors/analog-potentiometers-software.po
Languages: es_mx, fr_ca

source: Analog Potentiometers - Software
es_mx: Potenciómetros analógicos - Software
fr_ca: Potentiomètres analogiques - Partie logicielle

source: This section covers analog potentiometers in software. For a hardware guide to analog potentiometers, see :ref:`docs/hardware/sensors/analog-potentiometers-hardware:Analog Potentiometers - Hardware`.
es_mx: Esta sección cubre el software del analizador de potenciómetros. Para una guía de hardware a potenciómetros analógicos, ver :ref:`docs/hardware/sensors/analog-potentiometers-hardware:Analog Potentiometers - Hardware`.
fr_ca: Cette section couvre le logiciel associé aux potentiomètres analogiques. Pour un guide sur le branchement électrique des potentiomètres analogiques, voir :ref:`docs/hardware/sensors/analog-potentiometers-hardware:Analog Potentiometers - Hardware`.

source: Potentiometers are variable resistors that allow information about position to be converted into an analog voltage signal. This signal can be read by the roboRIO to control whatever device is attached to the potentiometer.
es_mx: Los potenciómetros son resistencias variables que permiten que la información sobre la posición se convierta en una señal de voltaje analógica. La roboRIO puede leer esta señal para controlar cualquier dispositivo conectado al potenciómetro.
fr_ca: Les potentiomètres sont des résistances variables qui permettent de convertir des informations sur la position en un signal de tension analogique. Ce signal peut être lu par le roboRIO pour contrôler tout appareil connecté au potentiomètre.

source: While it is possible to read information from a potentiometer directly with an :doc:`analog-inputs-software`, WPILib provides an :code:`AnalogPotentiometer` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogPotentiometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_analog_potentiometer.html>`__) that handles re-scaling the values into meaningful units for the user. It is strongly encouraged to use this class.
fr_ca: Bien qu'il soit possible de lire les informations d'un potentiomètre directement à partir des :doc:`analog-inputs-software`, WPILib fournit une classe :code:`AnalogPotentiometer` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogPotentiometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_analog_potentiometer.html>`__) qui gère la mise à l'échelle des valeurs en unités significatives pour l'utilisateur. Il est fortement encouragé d'utiliser cette classe.

source: In fact, the :code:`AnalogPotentiometer` name is something of a misnomer - this class should be used for the vast majority of sensors that return their signal as a simple, linearly-scaled analog voltage.
es_mx: De hecho, el nombre `AnalogPotentiometer` es un nombre poco apropiado: esta clase se debe utilizar para la gran mayoría de los sensores que devuelven su señal como un voltaje analógico simple y de escala lineal.
fr_ca: En fait, le nom :code:`AnalogPotentiometer` est un nom qui suggère un usage restraint - cette classe peut être aussi utilisée pour la grande majorité des capteurs qui envoient leur signal sous la forme d'une tension analogique simple à échelle linéaire.

source: The AnalogPotentiometer class
es_mx: La clase AnalogPotentiometer
fr_ca: La classe AnalogPotentiometer

source: The "full range" or "scale" parameters in the :code:`AnalogPotentiometer` constructor are scale factors from a range of 0-1 to the actual range, *not* from 0-5. That is, they represent a native fractional scale, rather than a voltage scale.
es_mx: Los parámetros de "rango completo" o "escala" en el constructor AnalogPotentiometer son factores de escala de un rango de 0-1 al rango real, no de 0-5. Es decir, representan una escala fraccional nativa, en lugar de una escala de voltaje.
fr_ca: Les paramètres "full range" ou "scale" dans le constructeur :code:`AnalogPotentiometer` sont des facteurs d'échelle dans une plage comprenant les valeurs entre 0 à 1 , et non *pas* la valeur réelle (en voltage) de la lecture, comprise entre 0 à 5 volts. Autrement dit, ils représentent une échelle fractionnaire normalisée, plutôt qu'une échelle de tension.

source: An AnalogPotentiometer can be initialized as follows:
es_mx: Para inicializar la AnalogPotentiometer puede utilizar lo siguiente:
fr_ca: AnalogPotentiometer peut être initialisé comme suit:

source: Customizing the underlying AnalogInput
es_mx: Personalizando la entrada analógica subyacente
fr_ca: Personnalisation de AnalogInput

source: If the user changes the scaling of the :code:`AnalogInput` with oversampling, this must be reflected in the scale setting passed to the :code:`AnalogPotentiometer`.
es_mx: Si el usuario cambia la escala de la entrada analógica con sobremuestreo, esto debe reflejarse en la configuración de escala que se pasa a la clase `AnalogPotentiometer`.
fr_ca: Si l'utilisateur modifie l'échelle de :code:`AnalogInput` avec un suréchantillonnage, cela doit se refléter dans le paramètre d'échelle transmis au :code:`AnalogPotentiometer`.

source: If the user would like to apply custom settings to the underlying :code:`AnalogInput` used by the :code:`AnalogPotentiometer`, an alternative constructor may be used in which the :code:`AnalogInput` is injected:
es_mx: Si el usuario desea aplicar configuraciones personalizadas a la entrada `AnalogInput` utilizada por el `AnalogPotentiometer`, se puede usar un constructor alternativo en el que se introduzca la entrada analógica:
fr_ca: Si l'utilisateur souhaite appliquer des paramètres personnalisés au :code:`AnalogInput` utilisé par le :code:`AnalogPotentiometer`, un constructeur alternatif peut être utilisé dans lequel le :code:`AnalogInput` est injecté:

source: Reading values from the AnalogPotentiometer
es_mx: Leyendo valores de AnalogPotentiometer
fr_ca: Lecture des valeurs à partir de AnalogPotentiometer

source: The scaled value can be read by simply calling the :code:`get` method:
es_mx: El valor escalado se puede leer simplemente llamando al método :code:`get` :
fr_ca: La valeur mise à l'échelle peut être lue en appelant simplement la méthode :code:`get`:

source: Using AnalogPotentiometers in code
es_mx: Cómo usar potenciómetros analógicos en el código
fr_ca: Utilisation de AnalogPotentiometers dans le code

source: Analog sensors can be used in code much in the way other sensors that measure the same thing can be. If the analog sensor is a potentiometer measuring an arm angle, it can be used similarly to an :doc:`encoder <encoders-software>`. If it is an ultrasonic sensor, it can be used similarly to other :doc:`ultrasonics <ultrasonics-software>`.
es_mx: Los sensores analógicos se pueden usar en código de la misma manera que otros sensores que miden lo mismo. Si el sensor analógico es un potenciómetro que mide el ángulo de un brazo, puede usarse de manera similar a un codificador.<encoders-software> Si es un sensor ultrasónico, puede usarse de manera similar a otros ultrasonidos.<ultrasonics-software>
fr_ca: Les capteurs analogiques peuvent être utilisés dans le code de la même façon qu'un autre type de capteur qui effectue la même fonction. Si le capteur analogique est un potentiomètre mesurant un angle de bras, il peut être utilisé de manière similaire à un :doc:`encodeur<encoders-software>`. S'il s'agit d'un capteur à ultrasons, il peut être utilisé de manière similaire à d'autres :doc:`ultrasonics<ultrasonics-software>`.

source: It is very important to keep in mind that actual, physical potentiometers generally have a limited range of motion. Safeguards should be present in both the physical mechanism and the code to ensure that the mechanism does not break the sensor by traveling past its maximum throw.
es_mx: Es muy importante tener en cuenta que los potenciómetros físicos reales generalmente tienen un rango de movimiento limitado. Las salvaguardas deben estar presentes tanto en el mecanismo físico como en el código para garantizar que el mecanismo no rompa el sensor al pasar su alcance máximo.
fr_ca: Il est très important de garder à l'esprit que les potentiomètres ont des limites physiques réelles, et par conséquant, ont généralement une amplitude de mouvement limitée. Des précautions doivent être prises à la fois dans le mécanisme physique et dans le code pour garantir que le mécanisme n'abîme pas le capteur en dépassant sa portée maximale.
