Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/sensors/counters.po
Languages: fr_ca

source: Counters
fr_ca: Compteurs - Partie logicielle

source: IO Diagram showing the up/down pulses the counter is counting.
fr_ca: Diagramme d’E/S montrant les impulsions haut/bas que le compteur est en train de compter.

source: The :code:`Counter` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Counter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_counter.html>`__) is a versatile class that allows the counting of pulse edges on a digital input. :code:`Counter` is used as a component in several more-complicated WPILib classes (such as :ref:`Encoder <docs/software/hardware-apis/sensors/encoders-software:Encoders - Software>` and :ref:`Ultrasonic <docs/software/hardware-apis/sensors/ultrasonics-software:Ultrasonics - Software>`), but is also quite useful on its own.
fr_ca: La classe :code:`Counter` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Counter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_counter.html>`__) est une classe polyvalente qui permet de compter les fronts d'impulsion sur une entrée numérique. :code:`Counter` est utilisé comme composant dans plusieurs classes WPILib plus compliquées (telles que :ref:`Encoder <docs/software/hardware-apis/sensors/encoders-software:Encoders - Software>` et :ref:`Ultrasonic <docs/software/hardware-apis/sensors/ultrasonics-software:Ultrasonics - Software>`), mais est également très utile en soi.

source: There are a total of 8 counter units in the roboRIO FPGA, meaning no more than 8 :code:`Counter` objects may be instantiated at any one time, including those contained as resources in other WPILib objects. For detailed information on when a :code:`Counter` may be used by another object, refer to the official API documentation.
fr_ca: Il y a un total de 8 dispositifs de type "compteur" dans le roboRIO FPGA, ce qui signifie pas plus de 8 objets :code:`Counter` peuvent être instanciés à tout moment, y compris ceux contenus comme ressources dans d'autres objets WPILib. Pour des informations détaillées sur quand un: code:`Counter` peut être utilisé par un autre objet, reportez-vous à la documentation officielle de l'API.

source: Configuring a counter
fr_ca: Configuration d'un compteur

source: The :code:`Counter` class can be configured in a number of ways to provide differing functionalities.
fr_ca: La classe :code:`Counter` peut être configurée de différentes manières pour fournir des fonctionnalités différentes.

source: Counter Modes
fr_ca: Modes de l'objet Counter

source: The :code:`Counter` object may be configured to operate in one of four different modes:
fr_ca: L'objet :code:`Counter` peut être configuré pour fonctionner dans l'un des quatre modes différents:

source: `Two-pulse mode`_: Counts up and down based on the edges of two different channels.
fr_ca: `Two-pulse mode`_: compte de haut en bas en fonction des fronts de deux canaux différents.

source: `Semi-period mode`_: Measures the duration of a pulse on a single channel.
fr_ca: `Semi-period mode`_: mesure la durée d'une impulsion sur un seul canal.

source: `Pulse-length mode`_: Counts up and down based on the edges of one channel, with the direction determined by the duration of the pulse on that channel.
fr_ca: `Mode de longueur d'impulsion`_: compte en haut et en bas en fonction des bords d'un canal, la direction étant déterminée par la durée de l'impulsion sur ce canal.

source: `External direction mode`_: Counts up and down based on the edges of one channel, with a separate channel specifying the direction.
fr_ca: `External direction mode`_: compte vers le haut et vers le bas en fonction des fronts d'un canal. Un autre canal séparé spécifie la direction.

source: In all modes except semi-period mode, the counter can be configured to increment either once per edge (2X decoding), or once per pulse (1X decoding). By default, counters are set to two-pulse mode, if only one channel is specified, the counter will only count up.
fr_ca: Dans tous les modes sauf le mode demi-période, le compteur peut être configuré pour incrémenter soit une fois par front (décodage 2X), soit une fois par impulsion (décodage 1X). Par défaut, les compteurs sont réglés sur le mode "Two-pulse mode", si un seul canal est spécifié, le compteur ne fera que compter.

source: Two-pulse mode
fr_ca: Mode deux-impulsions ("Two-pulse mode")

source: In two-pulse mode, the :code:`Counter` will count up for every edge/pulse on the specified "up channel," and down for every edge/pulse on the specified "down channel." A counter can be initialized in two-pulse with the following code:
fr_ca: En mode deux-impulsions , le :code:`Counter` comptera vers le haut pour chaque front / impulsion sur le "canal montant" spécifié et vers le bas pour chaque front / impulsion sur le "'canal descendant" spécifié. Un compteur peut être initialisé en deux impulsions avec le code suivant:

source: Semi-period mode
fr_ca: Mode demi-période ("Semi-period mode")

source: In semi-period mode, the :code:`Counter` will count the duration of the pulses on a channel, either from a rising edge to the next falling edge, or from a falling edge to the next rising edge. A counter can be initialized in semi-period mode with the following code:
fr_ca: En mode demi-période, le :code:`Counter` comptera la durée des impulsions sur un canal, soit d'un front montant au front descendant suivant, soit d'un front descendant au front montant suivant. Un compteur peut être initialisé en mode demi-période avec le code suivant:

source: To get the pulse width, call the :code:`getPeriod()` method:
fr_ca: Pour obtenir la largeur d'impulsion, appelez la méthode :code:`getPeriod ()`:

source: Pulse-length mode
fr_ca: Mode durée d'impulsion ("Pulse-length mode")

source: In pulse-length mode, the counter will count either up or down depending on the length of the pulse. A pulse below the specified threshold time will be interpreted as a forward count and a pulse above the threshold is a reverse count. This is useful for some gear tooth sensors which encode direction in this manner. A counter can be initialized in this mode as follows:
fr_ca: En mode durée d'impulsion, le compteur comptera vers le haut ou vers le bas selon la durée de l'impulsion. Une impulsion au-dessous du temps seuil spécifié sera interprétée comme un compte vers le haut et une impulsion au-dessus du seuil est un compte vers le bas. (Notez l'inversion logique). Ceci est utile pour certains capteurs qui codent la direction de cette manière, comme ceux qui mesurent la position sur les dents d'un engrenage . Un compteur peut être initialisé dans ce mode comme suit:

source: External direction mode
fr_ca: Mode direction externe ("External direction mode")

source: In external direction mode, the counter counts either up or down depending on the level on the second channel. If the direction source is low, the counter will increase, if the direction source is high, the counter will decrease (to reverse this, see the next section). A counter can be initialized in this mode as follows:
fr_ca: En mode direction externe, le compteur compte vers le haut ou vers le bas selon le niveau sur le deuxième canal. Si la source de direction est faible, le compteur augmentera, si la source de direction est élevée, le compteur diminuera (pour inverser cela, voir la section suivante). Un compteur peut être initialisé dans ce mode comme suit:

source: Configuring counter parameters
fr_ca: Configuration des paramètres des compteurs

source: The :code:`Counter` class does not make any assumptions about units of distance; it will return values in whatever units were used to calculate the distance-per-pulse value. Users thus have complete control over the distance units used. However, units of time are *always* in seconds.
fr_ca: La classe :code:`Counter` ne fait aucune hypothèse sur les unités de distance; comme elle compte seulement les impulsions, elle retournera les valeurs dans le système d'unités utilisées pour calculer la distance. Les utilisateurs ont ainsi un contrôle total sur les unités de distance utilisées. Cependant, les unités de temps sont *toujours* en secondes.

source: The number of pulses used in the distance-per-pulse calculation does *not* depend on the decoding type - each "pulse" should always be considered to be a full cycle (rising and falling).
fr_ca: Le nombre d'impulsions utilisé dans le calcul de la distance par impulsion ne dépend *pas* du type de décodage - chaque "impulsion" doit toujours être considérée comme un cycle complet (montant et descendant).

source: Apart from the mode-specific configurations, the :code:`Counter` class offers a number of additional configuration methods:
fr_ca: Outre les configurations spécifiques au mode, la classe :code:`Counter` propose un certain nombre de méthodes de configuration supplémentaires:

source: Reading information from counters
fr_ca: Lecture des informations des compteurs

source: Regardless of mode, there is some information that the :code:`Counter` class always exposes to users:
fr_ca: Quel que soit le mode, il existe des informations que la classe :code:`Counter` rend toujours disponibles aux utilisateurs:

source: Count
fr_ca: Le compte

source: Users can obtain the current count with the :code:`get()` method:
fr_ca: Les utilisateurs peuvent obtenir le compte actuel avec la méthode :code:`get()`:

source: Distance
fr_ca: La distance

source: Counters measure *relative* distance, not absolute; the distance value returned will depend on the position of the encoder when the robot was turned on or the encoder value was last :ref:`reset <docs/software/hardware-apis/sensors/counters:Resetting a Counter>`.
fr_ca: Les compteurs mesurent la distance *relative*, pas absolue ; la valeur de distance renvoyée dépendra de la position de l'encodeur lorsque le robot a été allumé ou la dernière valeur de l'encodeur :ref:`reset <docs/software/hardware-apis/sensors/counters:Reset a Counter>`.

source: If the :ref:`distance per pulse <docs/software/hardware-apis/sensors/counters:Configuring counter parameters>` has been configured, users can obtain the total distance traveled by the counted sensor with the :code:`getDistance()` method:
fr_ca: Si la :ref:`distance par impulsion <docs/software/hardware-apis/sensors/counters:Configuration des paramètres du compteur>` a été configurée, les utilisateurs peuvent obtenir la distance totale parcourue par le capteur compté avec la méthode :code:`getDistance( )` :

source: Rate
fr_ca: Le taux

source: Units of time for the :code:`Counter` class are *always* in seconds.
fr_ca: Les unités de temps pour la classe :code:`Counter` sont *toujours* en secondes.

source: Users can obtain the current rate of change of the counter with the :code:`getRate()` method:
fr_ca: Les utilisateurs peuvent obtenir le taux de changement actuel du compteur avec la méthode :code:`getRate()` :

source: Stopped
fr_ca: Mode stationnaire

source: Users can obtain whether the counter is stationary with the :code:`getStopped()` method:
fr_ca: Les utilisateurs peuvent savoir si le compteur est stationnaire avec la méthode :code:`getStopped()`:

source: Direction
fr_ca: La direction

source: Users can obtain the direction in which the counter last moved with the :code:`getDirection()` method:
fr_ca: Les utilisateurs peuvent obtenir la direction vers laquelle le compteur incrémente ou décrémente avec le code:

source: Period
fr_ca: La période

source: In :ref:`semi-period mode <docs/software/hardware-apis/sensors/counters:Semi-period mode>`, this method returns the duration of the pulse, not of the period.
fr_ca: Dans le :ref:`mode semi-période <docs/software/hardware-apis/sensors/counters:Semi-period mode>`, cette méthode renvoie la durée de l'impulsion, pas de la période.

source: Users can obtain the duration (in seconds) of the most-recent period with the :code:`getPeriod()` method:
fr_ca: Les utilisateurs peuvent obtenir la durée (en secondes) de la période la plus récente avec la méthode :code:`getPeriod()`:

source: Resetting a counter
fr_ca: Réinitialisation d'un compteur

source: To reset a counter to a distance reading of zero, call the :code:`reset()` method. This is useful for ensuring that the measured distance corresponds to the actual desired physical measurement.
fr_ca: Pour réinitialiser un compteur à une lecture de distance de zéro, appelez la méthode :code:`reset()`. Ceci est utile pour garantir que la distance mesurée correspond à la mesure physique réelle souhaitée.

source: Using counters in code
fr_ca: Utilisation de compteurs dans le code

source: Counters are useful for a wide variety of robot applications - but since the :code:`Counter` class is so varied, it is difficult to provide a good summary of them here. Many of these applications overlap with the :code:`Encoder` class - a simple counter is often a cheaper alternative to a quadrature encoder. For a summary of potential uses for encoders in code, see :ref:`docs/software/hardware-apis/sensors/encoders-software:Encoders - Software`.
fr_ca: Les compteurs sont utiles pour une grande variété d'applications robotiques - mais comme la classe :code:`Counter` est si variée, il est difficile d'en fournir un bon résumé ici. Beaucoup de ces applications se chevauchent avec la classe :code:`Encoder` - un simple compteur est souvent une alternative moins chère à un encodeur en quadrature. Pour un résumé des utilisations potentielles des encodeurs dans le code, voir :ref:`docs/software/hardware-apis/sensors/encoders-software:Encoders - Software`.
