Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/sensors/digital-inputs-software.po
Languages: es_mx, fr_ca, tr_tr

source: Digital Inputs - Software
es_mx: Entradas digitales - Software
fr_ca: Entrées numériques - Partie logicielle
tr_tr: Dijital Girişler - Yazılım

source: This section covers digital inputs in software. For a hardware guide to digital inputs, see :ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`.
es_mx: Esta sección cubre entradas digitales en software. Para obtener una guía de hardware para entradas digitales, consulte :ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`.
fr_ca: Cette section couvre le logiciel relatif aux entrées numériques. Pour un guide sur le branchement électrique aux entrées numériques, voir :ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`.
tr_tr: Bu bölüm yazılımdaki dijital girişler hakkındadır. Dijital girişlere yönelik bir donanım kılavuzu için bkz. :ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`.

source: The roboRIO's FPGA supports up to 26 digital inputs. 10 of these are made available through the built-in DIO ports on the RIO itself, while the other 16 are available through the MXP breakout port.
fr_ca: Le FPGA du roboRIO prend en charge jusqu'à 26 entrées numériques. 10 d'entre elles sont disponibles via les ports DIO intégrés sur le roboRIO lui-même, tandis que les 16 autres sont disponibles via le port MXP.

source: Digital inputs read one of two states - "high" or "low." By default, the built-in ports on the RIO will read "high" due to internal pull-up resistors (for more information, see :ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`). Accordingly, digital inputs are most-commonly used with switches of some sort. Support for this usage is provided through the :code:`DigitalInput` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/DigitalInput.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1DigitalInput.html>`__).
fr_ca: Les entrées numériques lisent l’un des deux États - "haut" ou "bas". Par défaut, les ports intégrés de la RIO se liront "haut" en raison des résistances internes (pour plus d’informations, voir :ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`). Par conséquent, les entrées numériques sont le plus couramment utilisées avec des interrupteurs de toute sorte. La prise en charge de cet usage est fournie par le biais de la classe :code:`DigitalInput` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/DigitalInput.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1DigitalInput.html>`__).

source: The DigitalInput class
es_mx: La clase DigitalInput
fr_ca: La classe DigitalInput
tr_tr: DigitalInput sınıfı

source: A :code:`DigitalInput` can be initialized as follows:
es_mx: Una entrada digital :code:`DigitalInput` se puede inicializar de la siguiente manera:
fr_ca: Une entrée :code:`DigitalInput` peut être initialisée comme suit:
tr_tr: Bir :code:`DigitalInput` aşağıdaki gibi başlatılabilmektedir:

source: Reading the value of the DigitalInput
es_mx: Leyendo el valor de DigitalInput
fr_ca: Lecture de la valeur du DigitalInput
tr_tr: DigitalInput değerinin okunması

source: The state of the :code:`DigitalInput` can be polled with the :code:`get` method:
es_mx: El estado de :code:`DigitalInput` se puede consultar con el método :code:`get`:
fr_ca: L'état de :code:`DigitalInput` peut être interrogé avec la méthode :code:`get`:
tr_tr: :code:`DigitalInput` durumu, :code:`get` metoduyla sorgulanabilmektedir:

source: Creating a DigitalInput from an AnalogInput
es_mx: Crear una DigitalInput a partir de un AnalogInput.
fr_ca: Création d'une entrée numérique à partir d'une entrée analogique
tr_tr: AnalogInput'dan DigitalInput Oluşturmak

source: An :code:`AnalogTrigger` constructed with a port number argument can share that analog port with a separate :code:`AnalogInput`, but two `AnalogInput` objects may not share the same port.
es_mx: Un :code:`AnalogTrigger` construido con un argumento de número de puerto puede compartir ese puerto analógico con un :code:`AnalogInput` separado, pero dos objetos` AnalogInput `pueden no compartir el mismo puerto.
fr_ca: Un :code:`AnalogTrigger` construit avec un argument de numéro de port peut partager ce port analogique avec un :code:`AnalogInput` séparé, mais deux objets `AnalogInput` peuvent ne pas partager le même port.

source: Sometimes, it is desirable to use an analog input as a digital input. This can be easily achieved using the :code:`AnalogTrigger` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogTrigger.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogTrigger.html>`__).
fr_ca: Parfois, il est souhaitable d'utiliser une entrée analogique comme entrée numérique. Ceci peut être facilement réalisé en utilisant la classe :code:`AnalogTrigger` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogTrigger.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogTrigger.html>`__).

source: An :code:`AnalogTrigger` may be initialized as follows. As with :code:`AnalogPotentiometer`, an :code:`AnalogInput` may be passed explicitly if the user wishes to customize the sampling settings:
es_mx: Un :code:`AnalogTrigger` disparador análogo puede iniciarse como sigue. Al igual que con el :code:`AnalogPotentiometer`, un :code:`AnalogInput` se puede pasar una Entrada Analógica explícitamente si el usuario desea personalizar la configuración de muestreo:
fr_ca: Un :code:`AnalogTrigger` peut être initialisé comme suit. Comme avec :code:`AnalogPotentiometer`, un :code:`AnalogInput` peut être transmis explicitement si l'utilisateur souhaite personnaliser les paramètres d'échantillonnage:

source: Setting the trigger points
es_mx: Estableciendo los puntos del gatillo
fr_ca: Définition des points de déclenchement

source: For details on the scaling of "raw" :code:`AnalogInput` values, see :doc:`analog-inputs-software`.
es_mx: Para obtener detalles sobre la escala de los valores de :code:`AnalogInput` "sin procesar", consulte :doc:`analog-inputs-software`.
fr_ca: Pour plus de détails sur la mise à l'échelle des données "brutes" :code:`AnalogInput`, voir :doc:`analog-inputs-software`.

source: To convert the analog signal to a digital one, it is necessary to specify at what values the trigger will enable and disable. These values may be different to avoid "dithering" around the transition point:
es_mx: Para convertir la señal analógica a digital, es necesario especificar a qué valores habilitará y deshabilitará el disparador. Estos valores pueden ser diferentes para evitar "dithering" alrededor del punto de transición:
fr_ca: Pour convertir le signal analogique en signal numérique, il est nécessaire de spécifier à quelles valeurs le déclencheur sera activé et désactivé. Ces valeurs sont préférablement différentes, pour que les changement d'états autour du point de transition se fassent de façon nette (sans oscillations):

source: Using DigitalInputs in code
es_mx: Uso de entradas digitales en el código
fr_ca: Utilisation de DigitalInputs dans le code
tr_tr: Kod içerisinde DigitalInputs'un kullanımı

source: As almost all switches on the robot will be used through a :code:`DigitalInput`, this class is extremely important for effective robot control.
fr_ca: Comme presque tous les commutateurs reliés au roboRIOt seront utilisés via un :code:`DigitalInput`, cette classe est extrêmement importante pour un contrôle efficace du robot.

source: Limiting the motion of a mechanism
es_mx: Limitar el rango de movimiento de un mecanismo
fr_ca: Limiter le mouvement d'un mécanisme
tr_tr: Bir düzenekteki hareketin sınırlandırılması

source: Nearly all motorized mechanisms (such as arms and elevators) in FRC\ |reg| should be given some form of "limit switch" to prevent them from damaging themselves at the end of their range of motions. A short example is given below:
fr_ca: Presque tous les mécanismes motorisés (tels que les bras et les élévateurs) en FRC \ | reg | devrait recevoir une certaine forme d'interrupteur de "fin de course" pour éviter qu'ils ne s'endommagent à la fin de leur plage de mouvements. Un court exemple est donné ci-dessous:

source: Homing a mechanism
es_mx: Dirigiendo un mecanismo
fr_ca: La mise à zéro d'un mécanisme
tr_tr: Bir düzeneğin özgüdümlenmesi

source: Limit switches are very important for being able to "home" a mechanism with a encoder. For an example of this, see :ref:`docs/software/hardware-apis/sensors/encoders-software:Homing a mechanism`.
fr_ca: Les interrupteurs "fins de course" sont très importants pour pouvoir remettre à zéro un mécanisme avec un encodeur. Pour un exemple de ceci, voir :ref:`docs/software/hardware-apis/sensors/encoders-software:Homing a mechanism`.

source: The roboRIO's FPGA supports up to 26 digital inputs. 10 of these are made available through the built-in DIO ports on the RIO itself, while the other 16 are available through the :term:`MXP` breakout port.
tr_tr: roboRIO'nun FPGA'sı 26 adede kadar dijital giriş desteklemektedir. Bu girişlerin 10 tanesi RIO'nun üzerindeki gömülü DIO bağlantı noktaları tarafından, geri kalan 16 tanesi ise :term:`MXP` ara bağlantı noktaları tarafından sağlanmaktadır.

source: Digital inputs read one of two states - "high" or "low." By default, the built-in ports on the RIO will read "high" due to internal pull-up resistors (for more information, see :ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`). Accordingly, digital inputs are most-commonly used with switches of some sort. Support for this usage is provided through the :code:`DigitalInput` class (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/DigitalInput.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_digital_input.html>`__).
tr_tr: Gijital girişeler iki durumdan birini okumaktadır: "yüksek" ve "alçak". Varsayılan olarak RIO üzerindeki gömülü bağlantı noktaları, dahili kaldırma dirençleri sebebiyle "yüksek" okuma gerçekleştirecektir (daha fazla bilgi için bkz. :ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`). Dolayısıyla dijital girişler sıklıkla bir çeşit anahtarla beraber kullanılmaktadır. Bu kullanıma yönelik destek :code:`DigitalInput` sınıfı (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/DigitalInput.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_digital_input.html>`__) tarafından sağlanmaktadır

source: Sometimes, it is desirable to use an analog input as a digital input. This can be easily achieved using the :code:`AnalogTrigger` class (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogTrigger.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_analog_trigger.html>`__).
tr_tr: Bazen analog bir girişin dijital bir giriş olarak kullanımı tercih edilmektedir. Bu kullanım :code:`AnalogTrigger` sınıfı (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogTrigger.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_analog_trigger.html>`__) ile kolayca gerçekleştirilebilmektedir.

source: As almost all switches on the robot will be used through a :code:`DigitalInput`. This class is extremely important for effective robot control.
tr_tr: Robot üzerindeki neredeyse tüm anahtarlar bir :code:`DigitalInput` aracılığıyla kullanılacağı için, bu sınıf etkili robot kontrolü söz konusu olduğunda son derece önemlidir.

source: Nearly all motorized mechanisms (such as arms and elevators) in FRC\ |reg| should be given some form of "limit switch" to prevent them from damaging themselves at the end of their range of motions. For an example of this, see :doc:`/docs/software/hardware-apis/sensors/limit-switch`.
tr_tr: FRC\ |reg|'deki neredeyse tüm (kollar ve asansörler gibi) motorlu düzeneklere, hareket aralıklarının sonunda kendilerine zarar vermemeleri için, bir çeşit "limit anahtarı" verilmelidir. Bu anahtarların bir örneği için bkz. :doc:`/docs/software/hardware-apis/sensors/limit-switch`.

source: Limit switches are very important for being able to "home" a mechanism with an encoder. For an example of this, see :ref:`docs/software/hardware-apis/sensors/encoders-software:Homing a mechanism`.
tr_tr: Limit anahtarları bir düzeneğin, bir kodlayıcı aracılığıyla, öz güdümlenmesi için çok önemlidir. Bu duruma bir örnek için bkz. :ref:`docs/software/hardware-apis/sensors/encoders-software:Homing a mechanism`.
