Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/sensors/encoders-software.po
Languages: fr_ca, tr_tr

source: Encoders - Software
fr_ca: Encodeurs - Partie logicielle
tr_tr: Kodlayıcılar - Yazılım

source: This section covers encoders in software. For a hardware guide to encoders, see :ref:`docs/hardware/sensors/encoders-hardware:Encoders - Hardware`.
fr_ca: Cette section couvre le logiciel associé aux encodeurs. Pour un guide sur le branchement électrique des encodeurs, voir :ref:`docs/hardware/sensors/encoders-hardware:Encoders - Hardware`.

source: Encoders are devices used to measure motion (usually, the rotation of a shaft).
fr_ca: Les encodeurs sont des composants utilisés pour mesurer le mouvement (généralement la rotation d'un arbre).
tr_tr: Kodlayıcılar hareket (genellikle bir milin rotasyon) ölçümünde kullanılan cihazlardır.

source: The classes in this document are only used for encoders that are plugged directly into the roboRIO! Please reference the appropriate vendors' documentation for using encoders plugged into motor controllers.
fr_ca: Les classe dans ce document ne sont utilisées que pour les encodeurs qui sont branchés directement sur le roboRIO ! Veuillez consulter la documentation appropriée des fournisseurs pour l’utilisation d’encodeurs branchés sur des contrôleurs de moteur.
tr_tr: Bu belgedeki sınıflar yalnızca roboRIO'ya doğrudan bağlanan kodlayıcılar için geçerlidir! Motor kontrolörlere bağlanan kodlayıcılar için lütfen ilgili satıcıların belgelerine danışınız.

source: Quadrature Encoders - The :code:`Encoder` Class
fr_ca: Encodeurs en quadrature - la classe :code:`Encoder`
tr_tr: Dördün Kodlayıcılar - :code:`Encoder` Sınıfı

source: Quadrature Encoders determine direction by observing which pulse channel (A or B) receives a pulse first.
fr_ca: Les encodeurs en quadrature déterminent la direction en observant quel canal d’impulsion (A ou B) reçoit une impulsion en premier.
tr_tr: Dördün Kodlayıcılar, bir darbenin (A veya B) darbe kanallarından ilk hangisine ulaştığını gözlemleyerek yön belirlemektedir.

source: These encoders produce square-wave signals on two channels that are a quarter-period out-of-phase (hence the term, "quadrature"). The pulses are used to measure the rotation, and the direction of motion can be determined from which channel "leads" the other.
fr_ca: Ces encodeurs produisent des signaux rectangulaires sur deux canaux qui sont déphasés d'un quart de période (d'où le terme "quadrature"). Les impulsions sont utilisées pour mesurer la rotation, et la direction du mouvement peut être déterminée à partir de quel canal "est en avance" par rapport à l'autre.
tr_tr: Bu kodlayıcılar; iki kanal üzerinden, (adı üzerinde dördün) çeyrek aralıkla birbirleriyle örtüşmeyen kare dalga sinyalleri oluşturmaktadır. Darbeler, rotasyonun ölçümünde kullanılmakta ve ölçülen hareketin yönü hangi kanalın diğerinden "önce geldiğine" göre belirlenebilmektedir.

source: A Quadrature Decoder analyzing the A, B, and Index signals.
fr_ca: Un décodeur en quadrature analysant les signaux A, B et Index.
tr_tr: A, B ve indeks sinyallerini çözümleyen bir Dördün Kodlayıcı.

source: The FPGA handles quadrature encoders either through a counter module or an encoder module, depending on the :ref:`decoding type <docs/software/hardware-apis/sensors/encoders-software:Decoding type>` - the choice is handled automatically by WPILib. The FPGA contains 8 encoder modules.
fr_ca: Le FPGA gère les encodeurs en quadrature via un module compteur ou un module encodeur, selon le :ref:`decoding type <docs/software/hardware-apis/sensors/encoders-software:Decoding type>` - le choix est géré automatiquement par WPILib . Le FPGA contient 8 modules encodeurs.
tr_tr: FPGA dördün kodlayıcıları :ref:`kod çözme türüne <docs/software/hardware-apis/sensors/encoders-software:Decoding type>` göre ya bir sayaç modülü ya da bir kodlayıcı modülü üzerinden yönetmektedir. Bu seçim WPILib'de kendiliğinden yapılmaktadır. FPGA 8 adet kodlayıcı modülüne sahiptir.

source: Examples of quadrature encoders:
fr_ca: Exemples d'encodeurs en quadrature:
tr_tr: Dördün kodlayıcı örnekleri:

source: `AMT103-V <https://www.cuidevices.com/product/motion/rotary-encoders/incremental/modular/amt10-v-kit/amt103-v>`__ available through FIRST Choice
fr_ca: `AMT103-V <https://www.cuidevices.com/product/motion/rotary-encoders/incremental/modular/amt10-v-kit/amt103-v>`__ disponible via FIRST Choice

source: Initializing a Quadrature Encoder
fr_ca: Initialisation d'un encodeur en quadrature
tr_tr: Dördün Bir Kodlayıcının Başlatılması

source: A quadrature encoder can be instantiated as follows:
fr_ca: Un encodeur en quadrature peut être instancié comme suit:
tr_tr: Dördün bir kodlayıcı aşağıdaki şekilde örneklendirilebilmektedir:

source: Decoding Type
fr_ca: Type de décodage
tr_tr: Kod Çözme Türü

source: The WPILib :code:`Encoder` class can decode encoder signals in three different modes:
fr_ca: La classe WPILib :code:`Encoder` peut décoder les signaux d'encodeur dans trois modes différents:
tr_tr: WPILib :code:`Encoder` sınıfı, kodlayıcı sinyallerinin kodunu üç farklı modda çözebilmektedir:

source: **1X Decoding**: Increments the distance for every complete period of the encoder signal (once per four edges).
fr_ca: **Décodage 1X**: Augmente la distance pour chaque période complète du signal de l'encodeur (une fois par quatre fronts).

source: **2X Decoding**: Increments the distance for every half-period of the encoder signal (once per two edges).
fr_ca: **Décodage 2X**: Augmente la distance pour chaque demi-période du signal de l'encodeur (une fois par deux fronts).

source: **4X Decoding**: Increments the distance for every edge of the encoder signal (four times per period).
fr_ca: **Décodage 4X**: Incrémente la distance pour chaque front du signal de l'encodeur (quatre fois par période).

source: 4X decoding offers the greatest precision, but at the potential cost of increased "jitter" in rate measurements. To use a different decoding type, use the following constructor:
fr_ca: Le décodage 4X offre la plus grande précision, mais au prix potentiel de "fluctuations" (jitter) accrue dans les mesures de débit. Pour utiliser un type de décodage différent, utilisez le constructeur suivant:

source: Configuring Quadrature Encoder Parameters
fr_ca: Configuration des paramètres de l'encodeur en quadrature
tr_tr: Dördün Kodlayıcı Parametrelerinin Yapılandırılması

source: The :code:`Encoder` class does not make any assumptions about units of distance; it will return values in whatever units were used to calculate the distance-per-pulse value. Users thus have complete control over the distance units used. However, units of time are *always* in seconds.
fr_ca: La classe :code:`Encoder` ne fait aucune hypothèse sur les unités de distance; comme elle compte seulement les impulsions, elle retournera les valeurs dans le système d'unités utilisées pour calculer la distance. Les utilisateurs ont ainsi un contrôle total sur les unités de distance utilisées. Cependant, les unités de temps sont *toujours* en secondes.

source: The number of pulses used in the distance-per-pulse calculation does *not* depend on the :ref:`decoding type <docs/software/hardware-apis/sensors/encoders-software:Decoding type>` - each "pulse" should always be considered to be a full cycle (four edges).
fr_ca: Le nombre d'impulsions utilisées dans le calcul de la distance par impulsion ne dépend *pas* du :ref:`type de décodage <docs/software/hardware-apis/sensors/encoders-software:Decoding type>` - chaque "impulsion" doit toujours être considéré comme un cycle complet (quatre fronts).
tr_tr: Mesafe başı darbe hesaplamasındaki darbe sayısı :ref:`kod çözme türüne <docs/software/hardware-apis/sensors/encoders-software:Decoding type>` bağlı *değildir*, her bir "darbe" tam bir döngü (dört kenarlı) sayılmalıdır.

source: The :code:`Encoder` class offers a number of configuration methods:
fr_ca: La classe :code:`Encoder` propose plusieurs méthodes de configuration:

source: Reading information from Quadrature Encoders
fr_ca: Lecture des informations des encodeurs en quadrature
tr_tr: Dördün Kodlayıcılar Üzerinden Bilgi Okumak

source: The :code:`Encoder` class provides a wealth of information to the user about the motion of the encoder.
fr_ca: La classe :code:`Encoder` fournit une multitude d'informations à l'utilisateur sur le mouvement de l'encodeur.
tr_tr: :code:`Encoder` sınıfı, kullanıcıya kodlayıcının hareketi hakkında bir sürü bilgi sağlamaktadır.

source: Distance
fr_ca: La distance
tr_tr: Mesafe

source: Quadrature encoders measure *relative* distance, not absolute; the distance value returned will depend on the position of the encoder when the robot was turned on or the encoder value was last :ref:`reset <docs/software/hardware-apis/sensors/encoders-software:Resetting a quadrature encoder>`.
fr_ca: Les encodeurs en quadrature mesurent la distance *relative*, pas absolue; la valeur de distance renvoyée dépendra de la position de l'encodeur lorsque le robot a été allumé ou la dernière valeur de l'encodeur :ref:`reset <docs/software/hardware-apis/sensors/encoders-software:Resetting a quadrature encoder>`.
tr_tr: Dördün kodlayıcılar mutlak değil, *göreceli* mesafeyi ölçmektedir; geri döndürülen mesafe değeri, kodlayıcının robotun başlatıldığı veya kodlayıcı değerinin en son :ref:`yeniden başlatıldığı <docs/software/hardware-apis/sensors/encoders-software:Resetting a quadrature encoder>` andaki konumuna bağlı olacaktır.

source: Users can obtain the total distance traveled by the encoder with the :code:`getDistance()` method:
fr_ca: Les utilisateurs peuvent obtenir la distance totale parcourue par l'encodeur avec la méthode :code:`getDistance()`:

source: Rate
fr_ca: Le taux

source: Units of time for the :code:`Encoder` class are *always* in seconds.
fr_ca: Les unités de temps pour la classe :code:`Encoder` sont *toujours* en secondes.

source: Users can obtain the current rate of change of the encoder with the :code:`getRate()` method:
fr_ca: Les utilisateurs peuvent obtenir le taux de changement actuel de l'encodeur avec la méthode :code:`getRate()`:

source: Stopped
fr_ca: Mode stationnaire

source: Users can obtain whether the encoder is stationary with the :code:`getStopped()` method:
fr_ca: Les utilisateurs peuvent savoir si l'encodeur est stationnaire avec la méthode :code:`getStopped()`:

source: Direction
fr_ca: La direction

source: Users can obtain the direction in which the encoder last moved with the :code:`getDirection()` method:
fr_ca: Les utilisateurs peuvent obtenir la direction dans laquelle l'encodeur s'est déplacé pour la dernière fois avec la méthode :code:`getDirection()`:

source: Period
fr_ca: La période

source: Users can obtain the period of the encoder pulses (in seconds) with the :code:`getPeriod()` method:
fr_ca: Les utilisateurs peuvent obtenir la période des impulsions du codeur (en secondes) avec la méthode :code:`getPeriod()`:

source: Resetting a Quadrature Encoder
fr_ca: Réinitialisation d'un encodeur en quadrature
tr_tr: Dördün Bir Kodlayıcının Yeniden Başlatılması

source: To reset a quadrature encoder to a distance reading of zero, call the :code:`reset()` method. This is useful for ensuring that the measured distance corresponds to the actual desired physical measurement, and is often called during a :ref:`homing <docs/software/hardware-apis/sensors/encoders-software:Homing a mechanism>` routine:
fr_ca: Pour réinitialiser un encodeur en quadrature à une lecture de distance de zéro, appelez la méthode :code:`reset()`. Ceci est utile pour s'assurer que la distance mesurée correspond à la mesure physique réelle souhaitée, et est souvent appelée lors d'une routine :ref:`de mise à zéro <docs/software/hardware-apis/sensors/encoders-software:Homing a Mechanism>` :
tr_tr: Dördün kodlayıcıyı mesafe okuması sıfır olacak bir şekilde yeniden başlatmak istiyorsanız, :code:`reset()` metodunu çağırınız. Yeniden başlatma ölçülen mesafenin istenen fiziksel mesafe ile örtüşmesini sağlamak için faydalı ve genellikle :ref:`özgüdümleme <docs/software/hardware-apis/sensors/encoders-software:Homing a mechanism>` rutininde çağrılmaktadır:

source: Duty Cycle Encoders - The :code:`DutyCycleEncoder` class
fr_ca: Encodeurs de rapport cyclique - La classe :code:`DutyCycleEncoder`

source: The roboRIO's FPGA handles duty cycle encoders automatically.
fr_ca: Le FPGA du roboRIO gère automatiquement les encodeurs de rapport cyclique.
tr_tr: roboRIO'nın FPGA'sı görev döngüsü kodlayıcılarını kendiliğinden yönetmektedir.

source: Examples of duty cycle encoders:
fr_ca: Exemples d'encodeurs de rapport cyclique:
tr_tr: Görev döngüsü kodlayıcıları örnekleri:

source: Initializing a Duty Cycle Encoder
fr_ca: Initialisation d'un encodeur de rapport cyclique
tr_tr: Bir Görev Döngüsü Kodlayıcısının Başlatılması

source: A duty cycle encoder can be instantiated as follows:
fr_ca: Un encodeur de rapport cyclique («duty cycle») peut être instancié comme suit:

source: Configuring Duty Cycle Encoder Parameters
fr_ca: Configuration des paramètres de l'encodeur de rapport cyclique

source: The :code:`DutyCycleEncoder` class does not make any assumptions about units of distance; it will return values in whatever units were used to calculate the distance-per-rotation value. Users thus have complete control over the distance units used.
fr_ca: La classe :code:`DutyCycleEncoder` ne fait aucune hypothèse sur les unités de distance; comme elle compte seulement les rotations, elle retournera les valeurs dans le système d'unités utilisées pour calculer la distance. Les utilisateurs ont ainsi un contrôle total sur les unités de distance utilisées.

source: The :code:`DutyCycleEncoder` class offers a number of configuration methods:
fr_ca: La classe :code:`DutyCycleEncoder` propose plusieurs méthodes de configuration:

source: Reading Distance from Duty Cycle Encoders
fr_ca: Lire une distance avec un encodeur de rapport cyclique

source: Duty Cycle encoders measure absolute distance. It does not depend on the starting position of the encoder.
fr_ca: L’encodeur de rapport cyclique mesure une distance absolue. Celle-ci ne dépend pas de la position de départ de l’encodeur.

source: Users can obtain the distance measured by the encoder with the :code:`getDistance()` method:
fr_ca: Les utilisateurs peuvent obtenir la distance mesurée par l'encodeur avec la méthode :code:`getDistance()`:

source: Detecting a Duty Cycle Encoder is Connected
fr_ca: Détecter si un encodeur de rapport cyclique est connecté
tr_tr: Görev Döngüsü Kodlayıcısının Bağlandığını Tespit Etmek

source: As duty cycle encoders output a continuous set of pulses, it is possible to detect that the encoder has been unplugged.
fr_ca: Comme un encodeur de rapport cyclique génère un ensemble continu d’impulsions, il est possible de détecter qu’un encodeur a été débranché.
tr_tr: Görev döngüsü kodlayıcıları sürekli bir darbe dizisi ürettikleri için kodlayıcının bağlanıp bağlanmadığını belirlemek mümkündür.

source: Resetting a Duty Cycle Encoder
fr_ca: Réinitialisation d'un encodeur de rapport cyclique

source: To reset an encoder so the current distance is 0, call the :code:`reset()` method. This is useful for ensuring that the measured distance corresponds to the actual desired physical measurement. Unlike quadrature encoders, duty cycle encoders don't need to be homed. However, after reset, the position offset can be stored to be set when the program starts so that the reset doesn't have to be performed again. The :doc:`Preferences class </docs/software/basic-programming/robot-preferences>` provides a method to save and retrieve the values on the roboRIO.
fr_ca: Pour réinitialiser un encodeur afin que la distance actuelle soit de 0, appelez la méthode :code:`reset()`. Ceci est utile pour garantir que la distance mesurée correspond à la mesure physique réelle souhaitée. Contrairement aux encodeurs en quadrature, les encodeurs de rapport cyclique n'ont pas besoin de retour au repos (homing). Cependant, après la réinitialisation, le décalage de position peut être stocké pour être défini au démarrage du programme afin d’éviter une nouvelle réinitialisation. La :doc:`Preferences class 1` fournit une méthode pour enregistrer et récupérer les valeurs sur le roboRIO.

source: Analog Encoders - The :code:`AnalogEncoder` Class
fr_ca: Encodeurs analogiques - la classe :code:`AnalogEncoder`
tr_tr: Analog Kodlayıcılar - :code:`AnalogEncoder` Sınıfı

source: Examples of analog encoders:
fr_ca: Exemples d'encodeurs analogiques:
tr_tr: Analog kodlayıcı örnekleri:

source: Initializing an Analog Encoder
fr_ca: Initialisation d'un encodeur analogique
tr_tr: Analog Bir Kodlayıcının Başlatılması

source: An analog encoder can be instantiated as follows:
fr_ca: Un encodeur analogique peut être instancié comme suit:
tr_tr: Analog bir kodlayıcı aşağıdaki şekilde örneklendirilebilmektedir:

source: Configuring Analog Encoder Parameters
fr_ca: Configuration des paramètres de l'encodeur analogique

source: The :code:`AnalogEncoder` class does not make any assumptions about units of distance; it will return values in whatever units were used to calculate the distance-per-rotation value. Users thus have complete control over the distance units used.
fr_ca: La classe :code:`AnalogEncoder` ne fait aucune hypothèse sur les unités de distance; comme elle compte seulement les rotations, elle retournera les valeurs dans le système d'unités utilisées pour calculer la distance. Les utilisateurs ont ainsi un contrôle total sur les unités de distance utilisées.

source: The :code:`AnalogEncoder` class offers a number of configuration methods:
fr_ca: La classe :code:`AnalogEncoder` propose plusieurs méthodes de configuration:

source: Reading Distance from Analog Encoders
fr_ca: Lire une distance avec un encodeur analogique

source: Analog encoders measure absolute distance. It does not depend on the starting position of the encoder.
fr_ca: L’encodeur analogique mesure une distance absolue. Celle-ci ne dépend pas de la position de départ de l’encodeur.

source: Resetting an Analog Encoder
fr_ca: Réinitialisation d'un encodeur analogique

source: To reset an analog encoder so the current distance is 0, call the :code:`reset()` method. This is useful for ensuring that the measured distance corresponds to the actual desired physical measurement. Unlike quadrature encoders, duty cycle encoders don't need to be homed. However, after reset, the position offset can be stored to be set when the program starts so that the reset doesn't have to be performed again. The :doc:`Preferences class </docs/software/basic-programming/robot-preferences>` provides a method to save and retrieve the values on the roboRIO.
fr_ca: Pour réinitialiser un encodeur analogique afin que la distance actuelle soit de 0, appelez la méthode :code:`reset()`. Ceci est utile pour garantir que la distance mesurée correspond à la mesure physique réelle souhaitée. Contrairement aux encodeurs en quadrature, les encodeurs de rapport cyclique («duty cycle») n'ont pas besoin de retour au repos (homing). Cependant, après la réinitialisation, le décalage de position peut être stocké pour être défini au démarrage du programme afin d’éviter une nouvelle réinitialisation. La :doc:`Preferences class 1` fournit une méthode pour enregistrer et récupérer les valeurs sur le roboRIO.

source: Using Encoders in Code
fr_ca: Utilisation des encodeurs dans le code
tr_tr: Kodlayıcıların Kod içerisinde Kullanımı

source: Encoders are some of the most useful sensors in FRC\ |reg|; they are very nearly a requirement to make a robot capable of nontrivially-automated actuations and movement. The potential applications of encoders in robot code are too numerous to summarize fully here, but an example is provided below:
fr_ca: Les encodeurs sont parmi les capteurs les plus utiles de FRC; ils sont essentiels pour automatiser un mouvement de robot qui nécessite une certaine complexité. Les applications potentielles des encodeurs dans le code robot sont trop nombreuses pour être toutes énumérées ici, mais un exemple est fourni ci-dessous:

source: Driving to a Distance
fr_ca: Parcourir une certaine distance

source: Encoders can be used on a robot drive to create a simple "drive to distance" routine. This is useful in autonomous mode, but has the disadvantage that the robot's momentum will cause it to overshoot the intended distance. Better methods include using a :doc:`PID Controller </docs/software/advanced-controls/introduction/introduction-to-pid>` or using :doc:`Path Planning </docs/software/pathplanning/index>`
fr_ca: Les encodeurs peuvent être utilisés pour créer une routine simple de type « parcourir une certaine distance ». Ceci est utile en mode autonome, mais présente l'inconvénient que l'élan du robot l’amènera au-delà de la distance prévue. Les meilleures méthodes incluent l'utilisation d'un :doc:`PID Controller 1` ou l'utilisation de :doc:`Path Planning 2`

source: The following example uses the `Encoder` class, but is similar if other `DutyCycleEncoder` or `AnalogEncoder` is used. However, quadrature encoders are typically better suited for drivetrains since they roll over many times and don't have an absolute position.
fr_ca: L'exemple suivant utilise la classe `Encoder`, mais est similaire si un autre type (`DutyCycleEncoder` ou `AnalogEncoder`) est utilisé. Cependant, les encodeurs en quadrature sont généralement mieux adaptés aux transmissions car ils retournent à zéro (roll over) plusieurs fois et n'ont pas de position absolue.

source: Homing a Mechanism
fr_ca: La mise à zéro d'un mécanisme

source: Since quadrature encoders measure *relative* distance, it is often important to ensure that their "zero-point" is in the right place. A typical way to do this is a "homing routine," in which a mechanism is moved until it hits a known position (usually accomplished with a limit switch), or "home," and then the encoder is reset. The following code provides a basic example:
fr_ca: Comme les encodeurs en quadrature mesurent la distance *relative*, il est souvent important de s'assurer que leur "point zéro" est au bon endroit. Une façon typique de le faire est une "routine de référencement", dans laquelle un mécanisme est déplacé jusqu'à ce qu'il atteigne une position connue (généralement accomplie avec un interrupteur de fin de course), ou "point zéro", puis l'encodeur est réinitialisé. Le code suivant fournit un exemple de base:

source: Homing is not necessary for absolute encoders like duty cycle encoders and analog encoders.
fr_ca: La mise à zéro n’est pas nécessaire pour les encodeurs absolus comme les encodeurs de rapport cyclique et les encodeurs analogiques.

source: WPILib provides support for quadrature encoders through the :code:`Encoder` class (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Encoder.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_encoder.html>`__). This class provides a simple API for configuring and reading data from encoders.
tr_tr: WPILib, :code:`Encoder` sınııfı (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Encoder.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_encoder.html>`__) aracılığıyla dördün kodlayıcılar için destek sağlamaktadır. Bu sınıf, kodlayıcılar üzerinden verilerin yapılandırılması ve okunması için basit bir API sunmaktadır.
