Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/sensors/encoders-software.po
Languages: fr_ca, tr_tr

source: WPILib provides support for duty cycle (also marketed as :term:`PWM`) encoders through the :code:`DutyCycleEncoder` class (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/DutyCycleEncoder.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_duty_cycle_encoder.html>`__). This class provides a simple API for configuring and reading data from duty cycle encoders.
tr_tr: WPILib, :code:`DutyCycleEncoder` sınııfı (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/DutyCycleEncoder.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_duty_cycle_encoder.html>`__) aracılığıyla görev döngüsü kodlayıcıları (ya da diğer adıyla :term:`PWM`) için destek sağlamaktadır. Bu sınıf, kodlayıcılar üzerinden verilerin yapılandırılması ve okunması için basit bir API sunmaktadır.

source: The :code:`DutyCycleEncoder` class provides an alternate constructor that allows control over the full range and the zero position of the encoder.
tr_tr: :code:`DutyCycleEncoder` sınıfı, kullanıcılara kodlayıcının tam hareket alanı ve sıfır konumu üzerinde eksiksiz kontrol olanağı tanıyan başka constructor seçenekleri sağlamaktadır.

source: The zero position is useful for ensuring that the measured rotation corresponds to the desired physical measurement. Unlike quadrature encoders, duty cycle encoders don't need to be homed. The desired rotation can be read and stored to be set when the program starts. The :doc:`Preferences class </docs/software/basic-programming/robot-preferences>` provides methods to save and retrieve these values on the roboRIO.
tr_tr: Sıfır konumu ölçülen rotasyonun istenen fiziksel rotasyonla örtüştüğünden emin olmak adına faydalıdır. Dördün kodlayıcıların aksine görev döngüsü kodlayıcılarının özgüdümlenmesi şart değildir. İstenilen rotasyon, program başlatıldığı zaman okunup depolanacak şekilde ayarlanabilmektedir. :doc:`Tercihler sınıfı </docs/software/basic-programming/robot-preferences>` bu değerleri roboRIO'ya kaydetmek ve değerlere roboRIO'dan erişmek için metodlar sağlamaktadır.

source: Reading Rotation from Duty Cycle Encoders
tr_tr: Görev Döngüsü Kodlayıcıları Üzerinden Rotasyonun Okunması

source: Duty Cycle encoders measure absolute rotation. It does not depend on the starting position of the encoder.
tr_tr: Görev Döngüsü kodlayıcıları mutlak rotasyon ölçümü yaptıkları için ölçüm kodlayıcının başlangıç konumuna bağlı değildir.

source: Users can obtain the rotation measured by the encoder with the :code:`get()` method:
tr_tr: Kullanıcılar, kodlayıcı tarafından ölçülmüş rotasyona :code:`get()` metodu ile erişebilmektedir:

source: WPILib provides support for analog absolute encoders through the :code:`AnalogEncoder` class (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogEncoder.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_analog_encoder.html>`__). This class provides a simple API for configuring and reading data from analog encoders.
tr_tr: WPILib, :code:`AnalogEncoder` sınıfı (`Java <https://github.wpilib.org/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogEncoder.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/release/cpp/classfrc_1_1_analog_encoder.html>`__) aracılığıyla analog mutlak kodlayıcılar için destek sağlamaktadır. Bu sınıf, analog kodlayıcılar üzerinden verilerin yapılandırılması ve okunması için basit bir API sunmaktadır.

source: Configuring Analog Encoder Range and Zero
tr_tr: Analog Kodlayıcının Etki Alanı ve Sıfırının Yapılandırılması

source: The :code:`AnalogEncoder` class makes no assumptions about rotation units, returning values in the same units used to calculate the full range. This gives users complete control over the choice of rotation units.
tr_tr: :code:`AnalogEncoder` sınıfı, belirli rotasyon birimleri varsaymamaktadır. Sınıf değerleri bütün bir rotasyon açıklığının hesaplanmasında kullanılan birimlerin aynılarıyla döndürerek kullanıcılara rotasyon birimleri üzerinde eksiksiz bir kontrol olanağı tanımaktadır.

source: The :code:`AnalogEncoder` class offers an alternate constructor that offers control over the full range of rotation and zero position of the encoder.
tr_tr: :code:`AnalogEncoder` sınıfı, kullanıcılara kodlayıcının tam hareket alanı ve sıfır konumu üzerinde eksiksiz kontrol olanağı tanıyan başka constructor seçenekleri sağlamaktadır.

source: The zero position is useful for ensuring that the measured rotation corresponds to the desired physical measurement. Unlike quadrature encoders, analog encoders don't need to be homed. The desired rotation can be read and stored to be set when the program starts. The :doc:`Preferences class </docs/software/basic-programming/robot-preferences>` provides methods to save and retrieve these values on the roboRIO.
tr_tr: Sıfır konumu ölçülen rotasyonun istenen fiziksel rotasyonla örtüştüğünden emin olmak adına faydalıdır. Dördün kodlayıcıların aksine analog kodlayıcıların özgüdümlenmesi şart değildir. İstenilen rotasyon, program başlatıldığı zaman okunup depolanacak şekilde ayarlanabilmektedir. :doc:`Tercihler sınıfı </docs/software/basic-programming/robot-preferences>` bu değerleri roboRIO'ya kaydetmek ve değerlere roboRIO'dan erişmek için metodlar sağlamaktadır.

source: Reading Rotation from Analog Encoders
tr_tr: Analog Kodlayıcılar Üzerinden Rotasyonun Okunması

source: Analog encoders measure absolute rotation. It does not depend on the starting position of the encoder.
tr_tr: Analog kodlayıcılar mutlak rotasyon ölçümü yaptıkları için ölçüm kodlayıcının başlangıç konumuna bağlı değildir.
