Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/sensors/gyros-software.po
Languages: es_mx, fr_ca

source: Gyroscopes - Software
es_mx: Giroscopios - Software
fr_ca: Gyroscopes - Partie logicielle

source: This section covers gyros in software. For a hardware guide to gyros, see :ref:`docs/hardware/sensors/gyros-hardware:Gyroscopes - Hardware`.
es_mx: Esta sección cubre la parte de software de los giroscopios. Para una guía mecánica de estos, véase :ref:`docs/hardware/sensors/gyros-hardware:Giroscopios - Hardware`.
fr_ca: Cette section couvre le logiciel associé aux gyroscopes. Pour un guide sur le branchement électrique des gyroscopes, consulter :ref:`docs/hardware/sensors/gyros-hardware:Gyroscopes - Hardware`.

source: A gyroscope, or "gyro," is an angular rate sensor typically used in robotics to measure and/or stabilize robot headings. WPILib natively provides specific support for the ADXRS450 gyro available in the kit of parts, as well as more general support for a wider variety of analog gyros through the `AnalogGyro`_ class. Most common 3rd party gyros inherit from the :code:`Gyro` interface making them easily usable too!
fr_ca: Un gyroscope, ou "gyro" , est un capteur de vitesse angulaire généralement utilisé en robotique pour mesurer et/ou stabiliser les caps des robots. WPILib fournit nativement un support spécifique pour le gyroscope ADXRS450 disponible dans le kit de pièces, ainsi qu’un support plus général pour une plus grande variété de gyroscopes analogiques via la classe `AnalogGyro`_. Les gyroscopes tiers partie les plus courants héritent de l’interface :code:`Gyro`, ce qui les rend également facilement utilisables!

source: The Gyro interface
es_mx: La interfaz Gyro
fr_ca: L'interface Gyro

source: All natively-supported gyro objects in WPILib implement the :code:`Gyro` interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/interfaces/Gyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_gyro.html>`__). This interface provides methods for getting the current angular rate and heading, zeroing the current heading, and calibrating the gyro.
fr_ca: Tous les objets gyro nativement pris en charge par WPILib implémentent l’interface :code:`Gyro` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/interfaces/Gyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_gyro.html>`__). Cette interface fournit des méthodes pour obtenir le taux angulaire actuel et la position angulaire, la mise à zéro de la position angulaire actuelle, et la calibration du gyro.

source: It is crucial that the robot remain stationary while calibrating a gyro.
es_mx: Es crucial que el robot permanezca inmóvil al calibrar el giroscopio.
fr_ca: Il est primordial que le robot reste immobile pendant l'étalonnage d'un gyroscope.

source: The ADIS16448 uses the :code:`ADIS16448_IMU` class and implements the :code:`Gyro` interface. See the `ADIS16448 documentation <https://wiki.analog.com/first/adis16448_imu_frc>`__ for additional information and examples.
fr_ca: L’ADIS16448 utilise la classe :code:`ADIS16448_IMU` et implémente l’interface :code:`Gyro`. Consultez la documentation `ADIS16448 <https://wiki.analog.com/first/adis16448_imu_frc>`__ pour plus d’informations et d’exemples.

source: The ADIS16470 uses the :code:`ADIS16470_IMU` class and implements the :code:`Gyro` interface. See the `ADIS16470 documentation <https://wiki.analog.com/first/adis16470_imu_frc>`__ for additional information and examples.
fr_ca: L’ADIS16470 utilise la classe :code:`ADIS16470_IMU` et implémente l’interface :code:`Gyro`. Consultez la documentation `ADIS16470 <https://wiki.analog.com/first/adis16470_imu_frc>`__ pour plus d’informations et d’exemples.

source: The :code:`ADXRS450_Gyro` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXRS450_Gyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_a_d_x_r_s450___gyro.html>`__) provides support for the Analog Devices ADXRS450 gyro available in the kit of parts, which connects over the SPI bus.
fr_ca: La classe :code:`ADXRS450_Gyro` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXRS450_Gyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_a_d_x_r_s450___gyro.html>`__) fournit une prise en charge pour le gyroscope Analog Devices ADXRS450 disponible dans le kit de pièces, qui se connecte au bus SPI.

source: ADXRS450 Gyro accumulation is handled through special circuitry in the FPGA; accordingly only a single instance of :code:`ADXRS450_Gyro` may be used.
es_mx: El uso de varios ADXRS450 Gyro se maneja a través de circuitos especiales en la FPGA, así que solo se debería usar una instancia :code:`ADXRS450_Gyro` .
fr_ca: L'accumulation des données du gyroscope ADXRS450 est gérée par des circuits spéciaux dans le FPGA; en conséquence, une seule instance de :code:`ADXRS450_Gyro` peut être utilisée.

source: The :code:`AnalogGyro` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogGyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_analog_gyro.html>`__) provides support for any single-axis gyro with an analog output.
fr_ca: La classe :code:`AnalogGyro` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogGyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_analog_gyro.html>`__) fournit un support pour tout gyroscope à 1 axe pourvu d’une sortie analogique.

source: Gyro accumulation is handled through special circuitry in the FPGA; accordingly, :code:`AnalogGyro`\`s may only be used on analog ports 0 and 1.
es_mx: El uso de varios ADXRS450 Gyro se maneja a través de circuitos especiales en la FPGA, de acuerdo a esto solo se debería usar :code:`AnalogGyro`\`s en los puertos analógicos 0 y 1.
fr_ca: L'accumulation des données du gyroscope est gérée par des circuits spéciaux dans le FPGA; en conséquence, :code:`AnalogGyro`\`s ne peut être utilisé que sur les ports analogiques 0 et 1.

source: The navX uses the :code:`AHRS` class and implements the :code:`Gyro` interface. See the `navX documentation <https://pdocs.kauailabs.com/navx-mxp/guidance/selecting-an-interface/>`__ for additional connection types.
fr_ca: Le navX utilise la classe :code:`AHRS` et implémente l’interface :code:`Gyro`. Consultez la documentation `navX <https://pdocs.kauailabs.com/navx-mxp/guidance/selecting-an-interface/>`__ pour d’autres types de connexion.

source: Using gyros in code
es_mx: Usando giroscopios en código
fr_ca: Utilisation de gyroscopes dans le code

source: As gyros measure rate rather than position, position is inferred by integrating (adding up) the rate signal to get the total change in angle. Thus, gyro angle measurements are always relative to some arbitrary zero angle (determined by the angle of the gyro when either the robot was turned on or a zeroing method was called), and are also subject to accumulated errors (called "drift") that increase in magnitude the longer the gyro is used. The amount of drift varies with the type of gyro.
es_mx: Como los gyros miden la velocidad en vez de la posición, la posición se infiere integrando (sumando) la señal de la velocidad para obtener el cambio total en el ángulo. Así, todas las mediciones del giroscopio son relativas a un punto cero arbitrario (determinado por el ángulo del giroscopio ya sea cuando se encendió el robot o restableciendo este punto), sufren una acumulación de errores (llamada desvío) que incrementa a medida que el gyro se usa. La cantidad de desvió varía de acuerdo al tipo de gyro.
fr_ca: Comme les gyroscopes mesurent le taux (variation) plutôt que la position angulaire, la position est calculée en intégrant (additionnant) les taux pour obtenir la valeur d'angle actuel. Par conséquant, les mesures d'angle gyroscopique sont toujours relatives à un angle zéro arbitraire (déterminé par l'angle du gyroscope lorsque le robot est mis en marche ou lorsqu'une méthode de mise à zéro a été appelée). Ces mesures sont également sujettes à des erreurs accumulées (appelées "dérives") qui vont en s'augmentant, au fur et à mesure que le gyroscope est utilisé. La quantité de dérive varie selon le type de gyroscope.

source: Gyros are extremely useful in FRC for both measuring and controlling robot heading. Since FRC matches are generally short, total gyro drift over the course of an FRC match tends to be manageably small (on the order of a couple of degrees for a good-quality gyro). Moreover, not all useful gyro applications require the absolute heading measurement to remain accurate over the course of the entire match.
es_mx: Los gyros son extremadamente útiles en el FRC tanto para medir como para controlar el rumbo de los robots. Dado que las coincidencias de FRC son generalmente cortas, la deriva total del giróscopo en el curso de un partido de FRC tiende a ser manejablemente pequeña (del orden de un par de grados para un giróscopo de buena calidad). Además, no todas las aplicaciones útiles de los giroscopios requieren que la medición absoluta del rumbo sea precisa durante todo el partido.
fr_ca: Les gyroscopes sont extrêmement utiles en FRC pour mesurer et contrôler le cap du robot. Étant donné que les jeux FRC sont de courte durée (moins de 3 minutes), la dérive totale du gyroscope au cours d'un jeu FRC a tendance à être gérable (de l'ordre de quelques degrés pour un gyroscope de bonne qualité). De plus, ce ne sont pas toutes les applications gyroscopiques qui nécessitent que la mesure du cap reste précise tout au long du jeu.

source: Displaying the robot heading on the dashboard
es_mx: Mostrando el rumbo del robot en la dashboard
fr_ca: Affichage du cap du robot sur le tableau de bord

source: :ref:`Shuffleboard <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>` includes a widget for displaying heading data from a :code:`Gyro` in the form of a compass. This can be helpful for viewing the robot heading when sight lines to the robot are obscured:
fr_ca: :ref:`Shuffleboard <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>` inclut un widget pour afficher les données de cap d'un :code:`Gyro` sous la forme d'une boussole. Cela peut être utile pour visualiser le cap du robot lorsque les lignes de vue vers le robot sont obscurcies :

source: Stabilizing heading while driving
es_mx: Estabilizando el rumbo mientras se maneja
fr_ca: Stabilisation du cap pendant la conduite

source: A very common use for a gyro is to stabilize robot heading while driving, so that the robot drives straight. This is especially important for holonomic drives such as mecanum and swerve, but is extremely useful for tank drives as well.
es_mx: Un uso muy común de un gyro es estabilizar el rumbo del robot mientras conduce, para que el robot conduzca recto. Esto es especialmente importante para los impulsos holonómicos como el mecanismo y el desvío, pero también es muy útil para los impulsos de los tanques.
fr_ca: Une utilisation très courante d'un gyroscope est de stabiliser le cap du robot pendant la conduite, de sorte que le robot roule en ligne droite. Ceci est particulièrement important pour les entraînements holonomiques tels que Mécanum et Swerve, mais aussi utile pour les entraînements différentiels, style "char d'assaut".

source: This is typically achieved by closing a PID controller on either the turn rate or the heading, and piping the output of the loop to one's turning control (for a tank drive, this would be a speed differential between the two sides of the drive).
es_mx: Esto se logra típicamente cerrando un controlador PID en la velocidad de giro o en el rumbo, y canalizando la salida del lazo hacia el control de giro de uno (en el caso del accionamiento de un tanque, esto sería una diferencia de velocidad entre los dos lados de la unidad).
fr_ca: Ceci est généralement réalisé en utilisant une boucle de contrôle PID axée sur la vitesse de rotation angulaire ou le cap du robot. La sortie de cette boucle est dirigée vers les contrôleurs de moteurs, et le code génère alors un léger différentiel de vitesse entre les deux côtés de l'entraînement (gauche et droite) afin de corriger le cap du robot. Pour les robots avec Mécanum ou Swerve, cette correction de cap est gérée de façon différente.

source: Like with all control loops, users should be careful to ensure that the sensor direction and the turning direction are consistent. If they are not, the loop will be unstable and the robot will turn wildly.
es_mx: Como con todos los bucles de control, los usuarios deben tener cuidado de asegurarse de que la dirección del sensor y la dirección de giro sean consistentes. Si no lo son, el bucle será inestable y el robot girará salvajemente.
fr_ca: Comme pour toutes les boucles de contrôle, les utilisateurs doivent veiller à ce que la direction du capteur et la direction de rotation soient cohérentes. Si ce n'est pas le cas, la boucle sera instable et le robot pivotera autour de son axe central de manière incontrôlée.

source: Example: Tank drive stabilization using turn rate
es_mx: Ejemplo: Estabilización de la conducción del tanque usando la velocidad de giro
fr_ca: Exemple: stabilisation de l'entraînement de type différentiel à l'aide du taux de rotation

source: The following example shows how to stabilize heading using a simple P loop closed on the turn rate. Since a robot that is not turning should have a turn rate of zero, the setpoint for the loop is implicitly zero, making this method very simple.
es_mx: El siguiente ejemplo muestra cómo estabilizar el rumbo utilizando un simple bucle P cerrado en la velocidad de giro. Dado que un robot que no está girando debería tener una tasa de giro de cero, el punto de ajuste del bucle es implícitamente cero, lo que hace que este método sea muy simple.
fr_ca: L'exemple suivant montre comment stabiliser le cap à l'aide d'une simple boucle P axée sur le taux de rotation angulaire. Étant donné qu'un robot qui ne tourne pas devrait avoir un taux de rotation égal à zéro, le point de consigne pour la boucle est implicitement nul, ce qui rend cette méthode très simple.

source: More-advanced implementations can use a more-complicated control loop. When closing the loop on the turn rate for heading stabilization, PI loops are particularly effective.
es_mx: Las implementaciones más avanzadas pueden utilizar un bucle de control más complicado. Al cerrar el bucle en la tasa de giro para la estabilización del rumbo, los bucles PI son particularmente efectivos.
fr_ca: D'autres implémentations plus avancées peuvent utiliser une boucle de contrôle plus complexe. Les boucles PI sont particulièrement efficaces pour l'autorégulation de la direction basée sur le taux de rotation angulaire.

source: Example: Tank drive stabilization using heading
es_mx: Ejemplo: Estabilización de la conducción del tanque usando el rumbo
fr_ca: Exemple: stabilisation de l'entraînement du réservoir à l'aide du cap

source: The following example shows how to stabilize heading using a simple P loop closed on the heading. Unlike in the turn rate example, we will need to set the setpoint to the current heading before starting motion, making this method slightly more-complicated.
es_mx: El siguiente ejemplo muestra cómo estabilizar el rumbo utilizando un simple bucle P cerrado en el rumbo. A diferencia del ejemplo de la velocidad de giro, necesitaremos establecer el punto de ajuste del rumbo actual antes de iniciar el movimiento, lo que hace que este método sea un poco más complicado.
fr_ca: L'exemple suivant montre comment stabiliser le cap à l'aide d'une simple boucle P axée sur le cap. Contrairement à l'exemple précédent, nous devrons régler le point de consigne sur le cap actuel du robot avant de commencer le mouvement, ce qui rend cette méthode légèrement plus compliquée.

source: More-advanced implementations can use a more-complicated control loop. When closing the loop on the heading for heading stabilization, PD loops are particularly effective.
es_mx: Las implementaciones más avanzadas pueden utilizar un bucle de control más complicado. Cuando se cierra el bucle en el rumbo para la estabilización del rumbo, los bucles PD son particularmente efectivos.
fr_ca: Les implémentations plus avancées peuvent utiliser une boucle de contrôle plus complexe. Les boucles PD sont particulièrement efficaces pour l'autorégulation de la direction basée sur le cap.

source: Turning to a set heading
es_mx: Pasando a un rumbo fijo
fr_ca: Rotation vers un cap défini

source: Another common and highly-useful application for a gyro is turning a robot to face a specified direction. This can be a component of an autonomous driving routine, or can be used during teleoperated control to help align a robot with field elements.
es_mx: Otra aplicación común y muy útil para un gyro es hacer girar a un robot para que se dirija a una dirección específica. Esto puede ser un componente de una rutina de conducción autónoma, o puede utilizarse durante el control teleoperado para ayudar a alinear un robot con los elementos de campo.
fr_ca: Une autre application courante et très utile pour un gyroscope consiste à faire tourner le robot pour qu'il pointe vers une direction spécifiée. Cela peut être utile lors de la période de conduite autonome, ou encore, pendant le contrôle téléopéré pour aider à aligner le robot avec un élément du terrain de jeu.

source: Much like with heading stabilization, this is often accomplished with a PID loop - unlike with stabilization, however, the loop can only be closed on the heading. The following example code will turn the robot to face 90 degrees with a simple P loop:
es_mx: Al igual que con la estabilización del rumbo, esto se logra a menudo con un bucle PID - a diferencia de la estabilización, sin embargo, el bucle sólo puede cerrarse en el rumbo. El siguiente código de ejemplo hará que el robot se enfrente a 90 grados con un simple bucle P:
fr_ca: Tout comme avec la stabilisation de cap, ceci est accompli avec une boucle PID - contrairement à la stabilisation, la boucle doit être axée sur le cap uniquement. L'exemple de code suivant fera tourner le robot de 90 degrés avec une simple boucle P:

source: As before, more-advanced implementations can use more-complicated control loops.
es_mx: Al igual que antes, las implementaciones más avanzadas pueden utilizar bucles de control más complicados.
fr_ca: Comme précédemment, les implémentations plus avancées peuvent utiliser des boucles de contrôle plus compliquées.

source: Turn-to-angle loops can be tricky to tune correctly due to static friction in the drivetrain, especially if a simple P loop is used. There are a number of ways to account for this; one of the most common/effective is to add a "minimum output" to the output of the control loop. Another effective strategy is to cascade to well-tuned velocity controllers on each side of the drive.
es_mx: Los bucles de giro-a-ángulo pueden ser difíciles de afinar correctamente debido a la fricción estática en la transmisión, especialmente si se utiliza un simple bucle P. Hay varias maneras de explicar esto; una de las más comunes/efectivas es añadir una "salida mínima" a la salida del bucle de control. Otra estrategia efectiva es la de conectar en cascada a controladores de velocidad bien ajustados a cada lado de la unidad.
fr_ca: Les boucles de rotation à angle peuvent être difficiles à régler correctement en raison de la force de friction existante dans la transmission, surtout si une simple boucle P est utilisée. Il existe plusieurs façons de contrebalancer cela; l'une des plus courantes/efficaces consiste à ajouter une valeur de "sortie minimale" à la sortie de la boucle de contrôle. Une autre stratégie efficace consiste à pré-régler les contrôleurs de vitesse pour chaque moteur, sur chaque côté du robot.
