Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/sensors/sensor-overview-software.po
Languages: fr_ca, tr_tr

source: Sensor Overview - Software
fr_ca: Un bref aperçu du logiciel associé aux capteurs
tr_tr: Sensörlere Genel Bakış - Yazılım

source: This section covers using sensors in software. For a guide to sensor hardware, see :ref:`docs/hardware/sensors/sensor-overview-hardware:Sensor Overview - Hardware`.
fr_ca: Cette section couvre l'usage des capteurs dans le logiciel. Pour un guide sur le branchement électrique des capteurs, voir :ref:`docs/hardware/sensors/sensor-overview-hardware:Sensor Overview - Hardware`.
tr_tr: Bu bölüm, yazılımda sensörlerin kullanımını kapsamaktadır. Sensör donanımıyla ilgili bir kılavuz için bkz. :ref:`docs/hardware/sensors/sensor-overview-hardware:Sensor Overview - Hardware`.

source: While cameras may definitely be considered "sensors", vision processing is a sufficiently-complicated subject that it is covered in :ref:`its own section <docs/software/vision-processing/introduction/strategies-for-vision-programming:Strategies for Vision Programming>`, rather than here.
fr_ca: Alors que les caméras peuvent certainement être considérées comme des "capteurs", le traitement de la vision est un sujet suffisamment compliqué pour être traité dans :ref:`sa propre section <docs/software/vision-processing/introduction/strategies-for-vision-programming:Strategies for Vision Programming>`, plutôt qu'ici.
tr_tr: Kameralar kesinlikle "sensör" sayılsalar da görüntü işleme buradan çok :ref:`kendisine özel bir bölümde <docs/software/vision-processing/introduction/strategies-for-vision-programming:Strategies for Vision Programming>` incelenmiş yeterince karmaşık bir konudur.

source: In order to be effective, it is often vital for robots to be able to gather information about their surroundings. Devices that provide feedback to the robot on the state of its environment are called "sensors." WPILib innately supports a large variety of sensors through classes included in the library. This section will provide a guide to both using common sensor types through WPILib, as well as writing code for sensors without official support.
fr_ca: Pour être efficace, il est souvent vital pour les robots de pouvoir obtenir des informations sur leur environnement. Les dispositifs qui fournissent au robot des informations sur l'état de son environnement sont appelés «capteurs». WPILib prend en charge de manière innée une grande variété de capteurs via des classes incluses dans ses librairies. Cette section fournira un guide à la fois sur l'utilisation des types de capteurs courants via WPILib, ainsi que sur l'écriture de code pour les capteurs sans support officiel.
tr_tr: Etkili olabilmeleri için robotların çevreleri hakkında bilgi toplayabilmeleri sık sık büyük önem taşımaktadır. Robota ortamının durumu hakkında geri bildirim sağlayan cihazlara "sensör" denmektedir. WPILib, kütüphanesinde bulunan sınıflar aracılığıyla çok çeşitli sensörleri ek bir işlem gerekmeden desteklemektedir. Bu bölüm, hem WPILib aracılığıyla yaygın sensör türlerini kullanma hem de resmi destek olmadan sensörler için kod yazma konusunda bir kılavuz görevi görecektir.

source: What sensors does WPILIB support?
fr_ca: Quels capteurs WPILIB prend-il en charge?
tr_tr: WPILIB hangi sensörleri desteklemektedir?

source: The roboRIO includes an :term:`FPGA` which allows accurate real-time measuring of a variety of sensor input. WPILib, in turn, provides a number of classes for accessing this functionality.
tr_tr: roboRIO; çeşitli sensörlerin isabetli, gerçek zamanlı ölçümler yapmasına olanak tanıyan bir :term:`FPGA` içermektedir. WPILib buna karşılık bu işlevselliğe erişimi mümkün kılan birçok sınıf sağlamaktadır.

source: WPILib provides native support for:
fr_ca: WPILib fournit un support intégré pour les capteurs suivants:
tr_tr: WPILib, aşağıdakiler için ek bir işlem gerekmesizin destek sağlamaktadır:

source: :ref:`Accelerometers <docs/software/hardware-apis/sensors/accelerometers-software:Accelerometers - Software>`
fr_ca: :ref:`Acceleromètres <docs/software/hardware-apis/sensors/accelerometers-software:Accelerometers - Software>`
tr_tr: :ref:`İvmeölçerler <docs/software/hardware-apis/sensors/accelerometers-software:Accelerometers - Software>`

source: :ref:`Gyroscopes <docs/software/hardware-apis/sensors/gyros-software:Gyroscopes - Software>`
tr_tr: :ref:`Jiroskoplar <docs/software/hardware-apis/sensors/gyros-software:Gyroscopes - Software>`

source: :ref:`Ultrasonic rangefinders <docs/software/hardware-apis/sensors/ultrasonics-software:Ultrasonics - Software>`
fr_ca: :ref:`Capteurs ultrasoniques <docs/software/hardware-apis/sensors/ultrasonics-software:Ultrasonics - Software>`
tr_tr: :ref:`Ultrasonik telemetreler <docs/software/hardware-apis/sensors/ultrasonics-software:Ultrasonics - Software>`

source: :ref:`Potentiometers <docs/software/hardware-apis/sensors/analog-potentiometers-software:Analog Potentiometers - Software>`
fr_ca: :ref:`Potentiomètres <docs/software/hardware-apis/sensors/analog-potentiometers-software:Analog Potentiometers - Software>`
tr_tr: :ref:`Potansiyometreler <docs/software/hardware-apis/sensors/analog-potentiometers-software:Analog Potentiometers - Software>`

source: :ref:`Counters <docs/software/hardware-apis/sensors/counters:Counters>`
fr_ca: :ref:`Compteurs <docs/software/hardware-apis/sensors/counters:Counters>`
tr_tr: :ref:`Sayaçlar <docs/software/hardware-apis/sensors/counters:Counters>`

source: :ref:`Quadrature encoders <docs/software/hardware-apis/sensors/encoders-software:Encoders - Software>`
fr_ca: :ref:`Encodeurs <docs/software/hardware-apis/sensors/encoders-software:Encoders - Software>`
tr_tr: ref:`Dördün kodlayıcılar <docs/software/hardware-apis/sensors/encoders-software:Encoders - Software>`

source: :ref:`Limit switches <docs/software/hardware-apis/sensors/digital-inputs-software:Digital Inputs - Software>`
fr_ca: :ref:`Interrupteurs fin de course <docs/software/hardware-apis/sensors/digital-inputs-software:Digital Inputs - Software>`
tr_tr: :ref:`Limit anahtarları <docs/software/hardware-apis/sensors/digital-inputs-software:Digital Inputs - Software>`

source: Additionally, WPILib includes lower-level classes for interfacing directly with the FPGA's digital and analog inputs and outputs.
fr_ca: De plus, WPILib comprend des classes de niveau inférieur pour une interface directe avec les entrées et sorties numériques et analogiques du FPGA.
tr_tr: Bunlara ek olarak, WPILib, FPGA'nın dijital ve analog giriş ve çıkışlarını doğrudan arayüzlemek için daha düşük seviyeli sınıflar içermektedir.
