Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/grip/generating-code-from-grip.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Generating Code from GRIP
es_mx: Generando código desde GRIP
fr_ca: Génération de code à partir de GRIP
tr_tr: GRIP'den Kod Oluşturma
zh_cn: 从GRIP生成代码

source: GRIP Code Generation
es_mx: Generación de código con GRIP
fr_ca: Génération de code GRIP
tr_tr: GRIP Kod Üretimi
zh_cn: GRIP代码生成

source: When running your vision algorithm on a small processor such as a roboRIO or Raspberry PI it is encouraged to run OpenCV directly on the processor without the overhead of GRIP. To facilitate this, GRIP can generate code in C++, Java, and Python for the pipeline that you have created. This generated code can be added to your robot project and called directly from your existing robot code.
es_mx: Cuando ejecute su algoritmo de visión en un procesador pequeño como un roboRIO o Raspberry PI se recomienda ejecutar OpenCV directamente en el procesador sin la sobrecarga de GRIP. Para facilitar esto, GRIP puede generar código en C ++, Java y Python para la pipeline que usted cree. Este código generado se puede agregar a su proyecto de robot y ser llamado directamente desde su código de robot existente.
fr_ca: Lorsque vous exécutez votre algorithme de vision sur un petit processeur tel qu'un roboRIO ou Raspberry PI, il est encouragé d'exécuter OpenCV directement sur le processeur sans la surcharge de GRIP. Pour faciliter cela, GRIP peut générer du code en C++, Java et Python pour le pipeline que vous avez créé. Ce code généré peut être ajouté à votre projet de robot et appelé directement à partir de votre code de robot existant.
tr_tr: Görsel algoritmanızı roboRIO veya Raspberry PI gibi küçük bir işlemci üzerinde çalıştırırken, OpenCV'yi GRIP ek yükü olmadan doğrudan işlemci üzerinde çalıştırmanız önerilir. Bunu kolaylaştırmak için GRIP, oluşturduğunuz ardışık düzen için C ++, Java ve Python'da kod üretebilir. Oluşturulan bu kod, robot projenize eklenebilir ve doğrudan mevcut robot kodunuzdan çağrılabilir.
zh_cn: 在像roboRIO或Raspberry PI这样的小型处理器上运行视觉算法时，建议直接在处理器上运行OpenCV，而无需GRIP开销。为此，GRIP可以使用C ++，Java和Python为您创建的管道生成代码。可以将生成的代码添加到您的机器人项目中，并直接从您现有的机器人代码中调用。

source: Input sources such as cameras or image directories and output steps such as NetworkTables are not generated. Your code must supply images as OpenCV mats. On the roboRIO, the CameraServer class supplies images in that format. For getting results you can just use generated getter methods for retrieving the resultant values such as contour x and y values.
es_mx: Fuentes de entrada como cámaras o directorios de imágenes y pasos de salida como NetworkTables no son generados. Su código debe proporcionar imágenes como matrices de OpenCV. En el roboRIO, la clase CameraServer proporciona imágenes en ese formato. Para obtener resultados, solo puede usar métodos getter generados para recuperar los valores resultantes, como los valores x e y de un contorno.
fr_ca: Les sources d'entrée telles que les caméras ou les répertoires d'images et les étapes de sortie telles que NetworkTables ne sont pas générées. Votre code doit fournir des images sous forme compatible avec OpenCV. Sur le roboRIO, la classe CameraServer fournit des images dans ce format. Pour obtenir des résultats, vous pouvez simplement utiliser des méthodes pour récupérer les valeurs résultantes telles que les valeurs de contour x et y.
tr_tr: Kameralar veya görüntü dizinleri gibi giriş kaynakları ve Ağ Tabloları gibi çıktı adımları oluşturulmaz. Kodunuz görüntüleri OpenCV matları olarak sağlamalıdır. RoboRIO'da, CameraServer sınıfı bu formattaki görüntüleri sağlar. Sonuç almak için, kontur x ve y değerleri gibi sonuç değerlerini almak için yalnızca oluşturulmuş alıcı yöntemlerini kullanabilirsiniz.
zh_cn: 不会生成输入源（例如摄像机或图像目录）和输出步骤（例如NetworkTables）。您的代码必须提供图像作为OpenCV垫。在roboRIO上，CameraServer类提供该格式的图像。为了获得结果，您可以仅使用生成的吸气剂方法来检索结果值，例如轮廓x和y值。

source: Generating Code
es_mx: Generando el código
fr_ca: Génération de code
tr_tr: Kod Oluşturma
zh_cn: 生成代码

source: To generate code, go to ``Tools > Generate Code``. This will bring up a save dialog that lets you create a C++, Java, or Python class that performs the steps in the GRIP pipeline.
es_mx: Para generar código, vaya a ``Tools > Generate Code``. Aparecerá un cuadro de diálogo para guardar que le permite crear una clase C++, Java o Python que realiza los pasos de la pipeline GRIP.
fr_ca: Pour générer du code, allez dans ``Tools > Generate Code``. Cela fera apparaître une boîte de dialogue d'enregistrement qui vous permet de créer une classe C++, Java ou Python qui exécute les étapes du pipeline GRIP.
tr_tr: Kod oluşturmak için "Araçlar> Kod Oluştur'' seçeneğine gidin. Bu, GRIP ardışık düzenindeki adımları gerçekleştiren bir C ++, Java veya Python sınıfı oluşturmanıza olanak tanıyan bir kaydetme iletişim kutusu açar.
zh_cn: 要生成代码，请转到``工具>生成代码''。这将打开一个保存对话框，使您可以创建执行GRIP线程中的步骤的C ++，Java或Python类。

source: If generating code to be used in a pre-existing project, choose a relevant directory to save the pipeline to.
es_mx: Si genera código para ser usado en un proyecto preexistente, elija un directorio relevante para guardar la pipeline.
fr_ca: Si vous générez du code à utiliser dans un projet préexistant, choisissez un répertoire approprié dans lequel enregistrer le pipeline.
tr_tr: Önceden var olan bir projede kullanılacak kod üretiliyorsa, ardışık düzeni kaydetmek için ilgili bir dizin seçin.
zh_cn: 如果生成要在现有项目中使用的代码，请选择一个相关目录以将线程保存到该目录。

source: **C++ Users**: the pipeline class is split into a header and implementation file
es_mx: **Usuarios de C++**: la clase de la pipeline se divide en un encabezado y un archivo para ser implementado
fr_ca: **Utilisateurs C++**: la classe du pipeline est divisée en un fichier d'en-tête et un fichier d'implémentation
tr_tr: ** C ++ Kullanıcıları **: ardışık düzen sınıfı bir başlık ve uygulama dosyasına bölünmüştür
zh_cn: ** C ++用户**：线程类分为头文件和实现文件

source: **Java Users**: the generated class lacks a package declaration, so a declaration should be added to match the directory where the file was saved.
es_mx: **Java Users**: la clase generada carece de una declaración de paquete, por lo que una declaración debe ser agregada para que coincida con el directorio donde se guardó el archivo.
fr_ca: **Utilisateurs Java**: la classe générée n'a pas de déclaration de package, donc une déclaration doit être ajoutée pour correspondre au répertoire où le fichier a été enregistré.
tr_tr: ** Java Kullanıcıları **: Oluşturulan sınıfta paket bildirimi bulunmadığından, dosyanın kaydedildiği dizine uyması için bir bildirim eklenmelidir.
zh_cn: ** Java用户**：生成的类缺少包声明，因此应添加一个声明以匹配保存文件的目录。

source: **Python Users**: the module name will be identical to the class, so the import statement will be something like ``from Pipeline import Pipeline``
es_mx: **Usuarios de Python**: el nombre del módulo será idéntico a la clase, así que la declaración de importación será algo así como ``from Pipeline import Pipeline``
fr_ca: **Utilisateurs Python**: le nom du module sera identique à la classe, donc l'instruction import sera quelque chose comme ``from Pipeline import Pipeline``
tr_tr: ** Python Kullanıcıları **: modül adı sınıfla aynı olacaktır, bu nedenle import ifadesi "Pipeline import Pipeline'' gibi olacaktır.
zh_cn: ** Python Users **：模块名称将与该类相同，因此import语句将类似于``from Pipeline import Pipeline``

source: Structure of the Generated Code
es_mx: Estructura del código generado
fr_ca: Structure du code généré
tr_tr: Oluşturulan Kodun Yapısı
zh_cn: 生成代码的结构

source: Running the Pipeline
es_mx: Ejecutando la pipeline
fr_ca: Exécution du pipeline
tr_tr: Ardışık Düzeni Çalıştırma
zh_cn: 运行线程

source: To run the Pipeline, call the process method with the sources (webcams, IP camera, image file, etc) as arguments. This will expose the outputs of every operation in the pipeline with the ``getFooOutput`` methods.
es_mx: Para ejecutar la Pipeline, llame al método de proceso con las fuentes (cámaras web, cámaras IP, archivos de imagen, etc.) como argumentos. Esto mostrará los resultados de cada operación en la pipeline con los métodos ``getFooOutput``.
fr_ca: Pour exécuter le Pipeline, appelez la méthode du processus avec les sources (webcams, caméra IP, fichier image, etc.) comme arguments. Cela rendra disponible les sorties de chaque opération dans le pipeline avec les méthodes ``getFooOutput``.
tr_tr: Ardışık Düzeni çalıştırmak için, bağımsız değişken olarak kaynaklarla (web kameraları, IP kamera, görüntü dosyası vb.) İşlem yöntemini çağırın. Bu, ardışık düzen içindeki her işlemin çıktılarını `` getFooOutput '' yöntemleriyle ortaya çıkaracaktır.
zh_cn: 要运行线程，请使用源（网络摄像机，IP摄像机，图像文件等）作为参数来调用处理方法。这将使用getFooOutput方法公开线程中每个操作的输出。

source: Getting the Results
es_mx: Obteniendo los resultados
fr_ca: Obtenir les résultats
tr_tr: Sonuçları Alma
zh_cn: 得到结果

source: Users are able to the outputs of every step in the pipeline. The outputs of these operations would be accessible through their respective accessors. For example:
es_mx: Los usuarios pueden obtener los resultados de cada paso en la pipeline. Los resultados de estas operaciones serían accesibles a través de sus respectivos accesos. Por ejemplo:
fr_ca: Les utilisateurs peuvent accéder aux sorties de chaque étape du pipeline. Les résultats de ces opérations seraient accessibles via leurs accesseurs respectifs. Par exemple:
tr_tr: Kullanıcılar, ardışık düzendeki her adımın çıktılarını alabilirler. Bu işlemlerin çıktılarına, ilgili erişimcilerin aracılığıyla erişilebilir. Örneğin:
zh_cn: 用户能够获得线程中每个步骤的输出。这些操作的输出可以通过它们各自的访问器访问。例如：

source: Operation
es_mx: Operación
fr_ca: Opération
tr_tr: İşlem
zh_cn: 运作方式

source: Java/C++ getter
es_mx: getter en Java/C++
tr_tr: Java / C ++ alıcı

source: Python variable
es_mx: variable de Python
fr_ca: Variable Python
tr_tr: Python değişkeni
zh_cn: Python变量

source: RGB Threshold
es_mx: Umbral del RGB
fr_ca: Seuil RGB
tr_tr: RGB Eşiği
zh_cn: RGB阈值

source: Blur
es_mx: Difuminación
fr_ca: Flou (Blur)
tr_tr: Blur-Bulanıklık
zh_cn: 模糊

source: CV Erode
es_mx: Erosión CV
fr_ca: Érosion (CV Erode)
tr_tr: CV Aşınması
zh_cn: CV侵蚀

source: Find Contours
es_mx: Encontrar contornos
fr_ca: Identifer les contours
tr_tr: Kontürleri Bulma
zh_cn: 查找轮廓

source: Filter Contours
es_mx: Filtrar contornos
fr_ca: Filtrer les contours
tr_tr: Kontürleri Filtrele
zh_cn: 过滤轮廓

source: If an operation appears multiple times in the pipeline, the accessors for those operations have the number of that operation:
es_mx: Si una operación aparece varias veces en la pipeline, los accesores para esas operaciones tienen el numero de esa operación:
fr_ca: Si une opération apparaît plus d'une fois dans le pipeline, les accesseurs de ces opérations identiques seront numérotés, en commençant par le chiffre 0 pour le premier accesseur :
tr_tr: Bir işlem ardışık düzen içinde birden çok kez görünürse, bu işlemlerin erişimcileri o işlemin numarasına sahiptir:
zh_cn: 如果一个操作在线程中多次出现，则这些操作的访问器具有该操作的编号：

source: Which appearance
es_mx: Aparición
fr_ca: Ordre d'apparition
tr_tr: Hangi görünüm
zh_cn: 哪个外观

source: Accessor
es_mx: Accesor
fr_ca: Accesseur
tr_tr: Accessor-Erişimci
zh_cn: 存取器

source: First
es_mx: Primera
fr_ca: Première
tr_tr: First-Birinci
zh_cn: 第一

source: Second
es_mx: Segunda
fr_ca: Deuxième
tr_tr: Second-İkinci
zh_cn: 第二

source: Third
es_mx: Tercera
fr_ca: Troisième
tr_tr: Third-Üçüncü
zh_cn: 第三
