Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/grip/introduction-to-grip.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: This looks pretty good so far, but sometimes there is noise from other things that couldn't quite be filtered out. To illustrate one possible technique to reduce those occasional pixels that were detected, an Erosion operation is chosen. Erosion will remove small groups of pixels that are not part of the area of interest.
es_mx: Esto se ve bastante bien hasta ahora, pero a veces hay ruido de otras cosas que no pudieron ser filtradas. Para ilustrar una posible técnica para reducir esos píxeles ocasionales que se detectaron, se elige una operación de erosión. La erosión eliminará pequeños grupos de píxeles que no forman parte del área de interés.
fr_ca: Cela semble bien jusqu'à présent, mais parfois il y a du bruit provenant d'autres objets qui ne peuvent pas être complètement filtrées. Une technique pour réduire la détection de ces pixels occasionnels, qui s'avèrent être du bruit, consiste à effectuer une opération d'érosion. L'érosion supprimera les petits groupuscules de pixels qui ne font pas partie de la zone d'intérêt.
tr_tr: Şimdiye kadar oldukça iyi görünüyor, ancak bazen başka şeylerden tam olarak filtrelenemeyen kirlilik geliyor. Tespit edilen bu ara sıra pikselleri azaltmak için olası bir tekniği göstermek için bir Erozyon işlemi seçilmiştir. Erozyon, ilgilenilen alanın parçası olmayan küçük piksel gruplarını kaldıracaktır.
zh_cn: 到目前为止，这看起来还不错，但有时会出现其他无法完全滤除的噪声。为了说明减少某些偶然像素的一种可能的技术，选择了腐蚀操作。侵蚀会去除不属于关注区域的一小组像素。

source: Mask just the yellow area from the original image
es_mx: Enmascarar solo el área amarilla de la imagen original
fr_ca: Masquer uniquement la zone jaune de l'image d'origine
tr_tr: Orijinal görüntüde yalnızca sarı alanı maskeleyin
zh_cn: 仅遮盖原始图像的黄色区域

source: Here a new image is generated by taking the original image and masking (and operation) it with the the results of the erosion. This leaves just the yellow card as seen in the original image with nothing else shown. And it makes it easy to visualize exactly what was being found through the series of filters.
es_mx: Aquí se genera una nueva imagen tomando la imagen original y enmascarando (y operando) con los resultados de la erosión. Esto deja solo la tarjeta amarilla como se ve en la imagen original con nada más que se muestra. Y hace que sea fácil visualizar exactamente lo que se estaba encontrando a través de la serie de filtros.
fr_ca: Ici, une nouvelle image est générée en prenant l'image d'origine et en la masquant avec les résultats de l'érosion. Cela ne laisse que le carton jaune comme on le voit dans l'image d'origine avec rien d'autre. Ceci permet de visualiser facilement ce qui devait être trouvé, par l'entremise de la série de filtres dans notre pipeline.
tr_tr: Burada orijinal görüntü alınarak ve erozyonun sonuçlarıyla maskeleyerek (ve çalıştırılarak) yeni bir görüntü oluşturulur. Bu, orijinal resimde görüldüğü şekliyle sarı kartı başka hiçbir şey göstermeden bırakır. Ve bir dizi filtre aracılığıyla tam olarak ne bulunduğunu görselleştirmeyi kolaylaştırır.
zh_cn: 在这里，通过获取原始图像并用腐蚀的结果对其进行遮罩（和操作）来生成新图像。这样就只剩下黄卡了，如原始图像中所示，没有其他任何显示。而且，它可以很容易地直观显示通过一系列过滤器发现的内容。

source: Find the yellow area (blob)
es_mx: Encuentre el área amarilla (blob)
fr_ca: Trouver la zone jaune (blob)
tr_tr: Sarı alanı (blob) bulun
zh_cn: 查找黄色区域（斑点）

source: The last step is actually detecting the yellow card using a Blob Detector. This operation looks for a grouping of pixels that have some minimum area. In this case, the only non-black pixels are from the yellow card after the filtering is done. You can see that a circle is drawn around the detected portion of the image. In the release version of GRIP (watch for more updates between now and kickoff) you will be able to send parameters about the detected blob to your robot program using Network Tables.
es_mx: El último paso es detectar la tarjeta amarilla usando un Blob Detector. Esta operación se ve para una agrupación de píxeles que tienen un área mínima. En este caso, los únicos píxeles no negros son de la tarjeta amarilla después de que se realiza el filtrado. Puedes ver que se dibuja un círculo alrededor la parte detectada de la imagen. En la versión de lanzamiento de GRIP (vea más actualizaciones entre ahora y el kickoff) podrá enviar parámetros sobre el blob detectado a su programa de robot utilizando NetworkTables.

source: Status of GRIP
es_mx: Estado de GRIP
fr_ca: Statut du GRIP
tr_tr: GRIP Konumu
zh_cn: GRIP的状态

source: As you can see from this example, it is very easy and fast to be able to do simple object recognition using GRIP. While this is a very simple example, it illustrates the basic principles of using GRIP and feature extraction in general. Over the coming weeks the project team will be posting updates to GRIP as more features are added. Currently it supports cameras (Axis ethernet camera and web cameras) and image inputs. There is no provision for output yet although Network Tables and ROS (Robot Operating System) are planned.
es_mx: Como puede ver en este ejemplo, es muy fácil y rápido poder hacer reconocimiento de objetos simples mediante GRIP. Si bien este es un ejemplo muy simple, ilustra los principios básicos de usar GRIP y extracción de características en general. En las próximas semanas, el equipo del proyecto publicará actualizaciones en GRIP a medida que se agreguen más funciones. Actualmente es compatible con cámaras (cámara ethernet Axis y cámaras web) y entradas de imagen. No hay ninguna disposición para la salida todavía aunque las Network Tables y ROS (sistema operativo de robot) están planificadas.

source: You can either download a pre-built release of the code from the github page "Releases" section (https://github.com/WPIRoboticsProjects/GRIP) or you can clone the source repository and built it yourself. Directions on building GRIP are on the project page. There is also additional documentation on the project wiki.
es_mx: Puede descargar una versión del código precompilada desde la sección "Versiones" de la página de github (https://github.com/WPIRoboticsProjects/GRIP) o puede clonar el repositorio de origen y construirlo usted mismo. Las instrucciones para construir GRIP se encuentran en la página del proyecto. También hay documentación adicional en el proyecto wiki.

source: So, please play with GRiP and give us feedback here on the forum. If you find bugs, you can either post them here or as a Github project issue on the project page.
es_mx: Por lo tanto, juegue con GRiP y envíenos sus comentarios aquí en el foro. Si encuentra errores, puede publicarlos aquí o como un problema del proyecto Github en la página del proyecto.

source: The last step is actually detecting the yellow card using a Blob Detector. This operation looks for a grouping of pixels that have some minimum area. In this case, the only non-black pixels are from the yellow card after the filtering is done. You can see that a circle is drawn around the detected portion of the image. In the release version of GRIP (watch for more updates between now and kickoff) you will be able to send parameters about the detected blob to your robot program using :term:`NetworkTables`.
fr_ca: La dernière étape consiste en fait à détecter la carte jaune à l'aide d'un détecteur de Blobs. Cette opération recherche un regroupement de pixels ayant une surface minimale. Dans ce cas, les seuls pixels non noirs proviennent de la carte jaune une fois le filtrage effectué. Vous pouvez voir qu'un cercle est dessiné autour de la partie détectée de l'image. Dans la version finale de GRIP (surveillez les mises à jour durant la saison), vous pourrez envoyer des paramètres sur le blob détecté à votre programme de robot en utilisant les :term:`NetworkTables`.
zh_cn: 最后一步实际上是使用斑点检测器检测黄牌。此操作将查找具有最小面积的一组像素。在这种情况下，过滤完成后，唯一的非黑色像素来自黄卡。您可以看到在检测到的图像部分周围绘制了一个圆圈。在GRIP的发行版本中（请注意从现在到启动之间的更多更新），您将能够使用NetworkTables将有关检测到的Blob的参数发送到您的机器人程序。

source: As you can see from this example, it is very easy and fast to be able to do simple object recognition using GRIP. While this is a very simple example, it illustrates the basic principles of using GRIP and feature extraction in general. Over the coming weeks the project team will be posting updates to GRIP as more features are added. Currently it supports cameras (Axis ethernet camera and web cameras) and image inputs. There is no provision for output yet although NetworkTables and ROS (Robot Operating System) are planned.
fr_ca: Comme vous pouvez le voir sur cet exemple, il est très facile et rapide de pouvoir faire une reconnaissance d'objet simple à l'aide de GRIP. Bien qu'il s'agisse d'un exemple très simple, il illustre les principes de base de l'utilisation de GRIP et de l'extraction de fonctionnalités en général. Au cours des prochaines semaines, l'équipe du projet publiera des mises à jour sur GRIP à mesure que de nouvelles fonctionnalités seront ajoutées. Actuellement, GRIP prend en charge les caméras (caméra Ethernet Axis et caméras Web) et les entrées d'image. Il n'y a pas encore de disposition pour la sortie bien que NetworkTables et ROS (Robot Operating System) soient prévus.
zh_cn: 从该示例中可以看到，使用GRIP进行简单的对象识别非常简单快捷。尽管这是一个非常简单的示例，但它说明了使用GRIP和特征提取的基本原理。在接下来的几周中，随着更多功能的添加，项目团队将向GRIP发布更新。当前，它支持摄像机（Axis以太网摄像机和网络摄像机）和图像输入。尽管计划了NetworkTables和ROS（机器人操作系统），但仍未提供输出。

source: You can either download a pre-built release of the code from the GitHub page "Releases" section (https://github.com/WPIRoboticsProjects/GRIP) or you can clone the source repository and built it yourself. Directions on building GRIP are on the project page. There is also additional documentation on the project wiki.
fr_ca: Vous pouvez soit télécharger une version prédéfinie du code à partir de la section «Releases» de la page GitHub (https://github.com/WPIRoboticsProjects/GRIP) ou vous pouvez cloner le référentiel source et le créer vous-même. Les instructions sur la construction de GRIP sont sur la page du projet. Il existe également une documentation supplémentaire sur le wiki du projet.
tr_tr: Kodun önceden oluşturulmuş bir sürümünü GitHub sayfasındaki "Releases-Sürümler" bölümünden (https://github.com/WPIRoboticsProjects/GRIP) indirebilir veya kaynak havuzunu klonlayıp kendiniz oluşturabilirsiniz. GRIP oluşturma ile ilgili talimatlar proje sayfasındadır. Wiki projesine belgeler eklenmiştir.
zh_cn: 您可以从GitHub页面“发布”部分（https://github.com/WPIRoboticsProjects/GRIP）下载代码的预构建版本，也可以克隆源存储库并自行构建。有关构建GRIP的说明，请参见项目页面。项目Wiki上还有其他文档。

source: So, please play with GRiP and give us feedback here on the forum. If you find bugs, you can either post them here or as a GitHub project issue on the project page.
fr_ca: Alors, utilisez GRiP et faites nous part de vos commentaires ici sur le forum. Si vous trouvez des bogues, vous pouvez les publier ici ou en tant que problème de projet GitHub sur la page du projet.
tr_tr: Bu nedenle, lütfen GRiP ile oynayın ve forumda bize geri bildirimde bulunun. Hatalar bulursanız, bunları buraya veya proje sayfasında GitHub proje sorunu olarak gönderebilirsiniz.
zh_cn: 因此，请与GRIP一起玩，并在论坛上向我们提供反馈。如果发现错误，则可以在此处发布它们，也可以在项目页面上将其发布为GitHub项目。
