Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/grip/introduction-to-grip.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Introduction to GRIP
es_mx: Introducción a GRIP
fr_ca: Introduction à GRIP
tr_tr: GRIP 'e Giriş
zh_cn: GRIP简介

source: GRIP is a tool for developing computer vision algorithms interactively rather than through trial and error coding. After developing your algorithm you may run GRIP in headless mode on your roboRIO, on a Driver Station Laptop, or on a coprocessor connected to your robot network. With Grip you choose vision operations to create a graphical pipeline that represents the sequence of operations that are performed to complete the vision algorithm.
es_mx: GRIP es una herramienta para desarrollar algoritmos de visión por computadora de forma interactiva en lugar de a través de codificación de prueba y error. Después de desarrollar su algoritmo, puede ejecutar GRIP en modo sin cabeza en su roboRIO, en una computadora portátil Driver Station o en un coprocesador conectado a la red de su robot. Con Grip, eliges operaciones de visión para crear una pipeline gráfica que represente la secuencia de operaciones que se realizan para completar el algoritmo de visión.
fr_ca: GRIP est un outil pour développer des algorithmes de vision par ordinateur de manière interactive plutôt que par le biais de codage d'essai et d'erreur. Après avoir développé votre algorithme, vous pouvez exécuter GRIP en mode réduit (headless) sur votre roboRIO, sur un ordinateur portable Driver Station ou sur un coprocesseur connecté sur le port réseau de votre robot. Avec Grip, vous choisissez les opérations de vision pour créer un pipeline graphique qui représente la séquence d'opérations qui sont effectuées pour exécuter l'algorithme de vision.
tr_tr: GRIP, deneme yanılma kodlaması yerine etkileşimli olarak bilgisayarla görme algoritmalarını geliştirmek için bir araçtır. Algoritmanızı geliştirdikten sonra, GRIP 'i roboRIO 'nuzda, Sürücü İstasyonu Dizüstü Bilgisayarınızda veya robot ağınıza bağlı bir yardımcı işlemci üzerinde isimsiz modda çalıştırabilirsiniz. Grip ile, görsel algoritmayı tamamlamak için gerçekleştirilen işlemlerin sırasını temsil eden bir grafik işlem hattı oluşturmak için görüntü işlemlerini seçersiniz.
zh_cn: GRIP是一种用于交互式开发计算机视觉算法的工具，而不是通过反复试验来开发。开发算法之后，您可以在roboRIO，Driver Station Laptop或连接到机器人网络的协处理器上以headless模式运行GRIP。使用Grip，您可以选择视觉操作来创建一个图形线程，该线程代表完成视觉算法所执行的操作顺序。

source: GRIP is based on OpenCV, one of the most popular computer vision software libraries used for research, robotics, and vision algorithm implementations. The operations that are available in GRIP are almost a 1 to 1 match with the operations available if you were hand coding the same algorithm with some text-based programming language.
es_mx: GRIP se basa en OpenCV, una de las bibliotecas de software de visión por computadora más populares utilizadas para investigaciones, robótica e implementaciones de algoritmos de visión. Las operaciones que están disponibles. en GRIP son casi una coincidencia de 1 a 1 con las operaciones disponibles si estaba codificando manualmente el mismo algoritmo con algún lenguaje de programación basado en texto.
fr_ca: GRIP est basé sur OpenCV, l'une des bibliothèques de logiciels de vision par ordinateur les plus populaires utilisées pour la recherche, la robotique et les implémentations d'algorithmes de vision. Les opérations disponibles dans GRIP correspondent presque ligne pour ligne avec les opérations disponibles si vous codiez manuellement le même algorithme avec un langage de programmation textuel.
tr_tr: GRIP, araştırma, robotik ve vizyon algoritması uygulamaları için kullanılan en popüler bilgisayarla görme yazılımı kitaplıklarından biri olan OpenCV'ye dayanmaktadır. GRIP'te mevcut olan işlemler, aynı algoritmayı bazı metin tabanlı programlama dilleriyle elle kodluyorsanız, mevcut işlemlerle neredeyse 1'e 1 eşleşir.
zh_cn: GRIP基于OpenCV，OpenCV是最流行的计算机视觉软件库之一，用于研究，机器人技术和视觉算法实现。如果您使用某种基于文本的编程语言对同一算法进行手工编码，则GRIP中可用的操作几乎与可用的操作一对一匹配。

source: The GRIP user interface
es_mx: La interfaz de usuario GRIP
fr_ca: L'interface utilisateur GRIP
tr_tr: GRIP kullanıcı arayüzü
zh_cn: GRIP用户界面

source: The GRIP user interface consists of 4 parts:
es_mx: La interfaz de usuario GRIP consta de 4 partes:
fr_ca: L'interface utilisateur GRIP se compose de 4 parties:
tr_tr: GRIP kullanıcı arayüzü 4 bölümden oluşur:
zh_cn: GRIP用户界面包括4个部分：

source: **Image Sources** are the ways of getting images into the GRIP pipeline. You can provide images through attached cameras or files. Sources are almost always the beginning of the image processing algorithm.
es_mx: **Image Sources** son las formas de obtener imágenes en la pipeline GRIP. Usted puede proporcionar imágenes a través de cámaras o archivos adjuntos. Las fuentes son casi siempre el comienzo del algoritmo de procesamiento de imágenes.
fr_ca: **Les sources d'images** sont les moyens d'obtenir des images dans le pipeline GRIP. Vous pouvez fournir des images via des caméras ou des fichiers joints. Les sources sont presque toujours le début de l'algorithme de traitement d'image.
tr_tr: ** Image Sources-Görüntü Kaynakları ** görüntüleri GRIP ardışık düzenine aktarmanın yollarıdır. Ekli kameralar veya dosyalar aracılığıyla görüntü sağlayabilirsiniz. Kaynaklar neredeyse her zaman görüntü işleme algoritmasının başlangıcıdır.
zh_cn: **图像来源**是将图像导入GRIP线程的方法。您可以通过连接的相机或文件来提供图像。来源几乎总是图像处理算法的开始。

source: **Operation Palette** contains the image processing steps from the OpenCV library that you can chain together in the pipeline to form your algorithm. Clicking on an operation in the palette adds it to the end of the pipeline. You can then use the left and right arrows to move the operation within the pipeline.
es_mx: **Operation Palette** contiene los pasos de procesamiento de imágenes de la librería OpenCV que puedes encadenar en la pipeline para formar tu algoritmo. Al hacer clic en una operación en la paleta lo agrega al final de la pipeline. Luego puedes usar las flechas izquierda y derecha para mover la operación dentro de la pipeline.
fr_ca: **Operation Palette** contient les étapes de traitement d'image de la librairie OpenCV que vous pouvez enchaîner dans le pipeline pour former votre algorithme. Cliquer sur une opération dans la palette l'ajoute à la fin du pipeline. Vous pouvez ensuite utiliser les flèches gauche et droite pour déplacer l'opération à l'intérieur du pipeline.
tr_tr: ** Operation Palette-İşlem Paleti ** algoritmanızı oluşturmak için ardışık düzen içinde zincirleyebileceğiniz OpenCV kitaplığından görüntü işleme adımlarını içerir. Paletteki bir işleme tıklamak, onu boru hattının sonuna ekler. İşlemi ardışık düzen içinde hareket ettirmek için sol ve sağ okları kullanabilirsiniz.
zh_cn: ** Operation Palette **包含OpenCV库中的图像处理步骤，您可以在线程中将它们链接在一起以形成算法。单击调色板中的一个操作会将其添加到线程的末尾。然后，您可以使用左右箭头在线程中移动操作。

source: **Pipeline** is the sequence of steps that make up the algorithm. Each step (operation) in the pipeline is connected to a previous step from the output of one step to an input to the next step. The data flows from generally from left to right through the connections that you create.
es_mx: **Pipeline** es la secuencia de pasos que componen el algoritmo. Cada paso (operación) en la pipeline está conectada a un paso anterior desde la salida de un paso a una entrada para el siguiente paso. Los datos fluyen generalmente de izquierda a derecha a través de las conexiones que creas
fr_ca: **Pipeline** est la séquence d'étapes qui composent l'algorithme. Chaque étape (opération) dans le pipeline est connectée à une étape précédente de la sortie d'une étape à une entrée à l'étape suivante. Les données circulent généralement de gauche à droite via les connexions que vous créez.
tr_tr: **Pipeline-Boru hattı **, algoritmayı oluşturan adımların dizisidir. Boru hattındaki her adım (işlem), bir adımın çıkışından bir sonraki adıma bir önceki adıma bağlanır. Veriler, oluşturduğunuz bağlantılar aracılığıyla genellikle soldan sağa doğru akar.
zh_cn: "线程"是构成算法的步骤序列。流水线中的每个步骤（操作）都连接到从一个步骤的输出到下一个步骤的输入的上一步。数据通常通过您创建的连接从左到右流动。

source: **Image Preview** are shows previews of the result of each step that has it's preview button pressed. This makes it easy to debug algorithms by being able to preview the outputs of each intermediate step.
es_mx: **Image Preview** La vista previa de la imagen muestra vistas previas del resultado de cada paso que tiene su botón de vista previa presionado. Esto facilita la depuración de algoritmos al poder obtener una vista previa de las salidas de cada paso intermedio.
fr_ca: **Image Preview** sont des aperçus du résultat de chaque étape sur laquelle le bouton d'aperçu (Preview) est selectionné. Cela facilite le débogage des algorithmes en pouvant prévisualiser les sorties de chaque étape intermédiaire.
tr_tr: ** Image Preview-Görüntü Önizleme ** ön izleme düğmesine basılan her adımın sonucunun ön izlemesini gösterir. Bu, her bir ara adımın çıktılarının ön izlemesini göstererek algoritmalarda hata ayıklamayı kolaylaştırır.
zh_cn: **“图像预览 **显示已按下预览按钮的每个步骤的结果预览。通过预览每个中间步骤的输出，可以轻松调试算法。

source: Finding the yellow square
es_mx: Encontrando el cuadro amarillo
fr_ca: Une application: Trouver le carré jaune
tr_tr: Sarı kareyi bulmak
zh_cn: 寻找黄色方块

source: In this application we will try to find the yellow square in the image and display it's position. The setup is pretty simple, just a USB web camera connected to the computer looking down at some colorful objects. The yellow plastic square is the thing that we're interested in locating in the image.
es_mx: En esta aplicación intentaremos encontrar el cuadrado amarillo en la imagen y mostrar su posición. La configuración es bastante simple, solo una cámara web USB conectada a la computadora mirando hacia abajo algunos objetos coloridos. El cuadrado de plástico amarillo es lo que nos interesa ubicar en la imagen.
fr_ca: Dans cette application, nous essaierons de trouver le carré jaune dans l'image et d'afficher sa position. La configuration est assez simple, juste une caméra Web USB connectée à l'ordinateur qui regarde des objets colorés. Le carré en plastique jaune est la chose que nous souhaitons localiser dans l'image.
tr_tr: Bu uygulamada resimdeki sarı kareyi bulmaya ve konumunu göstermeye çalışacağız. Kurulum oldukça basit, sadece bilgisayara bağlı bir USB web kamerası bazı renkli nesnelere bakıyor. Sarı plastik kare, resimde bulmak istediğimiz şeydir.
zh_cn: 在此应用程序中，我们将尝试在图像中找到黄色方块并显示其位置。设置非常简单，只需将USB网络摄像头连接到计算机，即可向下看一些五颜六色的物体。黄色的塑料方块是我们感兴趣的位于图像中的东西。

source: Enable the image source
es_mx: Habilitar la fuente de la imagen
fr_ca: Activer la source d'image
tr_tr: Görüntü kaynağını etkinleştirin
zh_cn: 启用图片来源

source: The first step is to acquire an image. To use the source, click on the "Add Webcam" button and select the camera number. In this case the Logitech USB camera that appeared as Webcam 0 and the computer monitor camera was Webcam 1. The web camera is selected in this case to grab the image behind the computer as shown in the setup. Then select the image preview button and the real-time display of the camera stream will be shown in the preview area.
es_mx: El primer paso es adquirir una imagen. Para usar la fuente, haga clic en el botón "Add Webcam" y seleccione el número de cámara. En este caso, la cámara USB Logitech que apareció como Webcam 0 y la cámara del monitor de la computadora era Webcam 1. La cámara web está seleccionada en este caso para tomar la imagen detrás de la computadora como se muestra en la configuración. Luego seleccione el botón de vista previa de la imagen y la visualización en tiempo real de la transmisión de la cámara se mostrará en el área de vista previa.
fr_ca: La première étape consiste à acquérir une image. Pour utiliser la source, cliquez sur le bouton "Add Webcam" et sélectionnez le numéro de la caméra. Dans ce cas, la caméra USB Logitech qui est apparue sous le nom de Webcam 0 et la caméra du moniteur de l'ordinateur était la Webcam 1. La caméra Web est sélectionnée dans ce cas pour saisir l'image derrière l'ordinateur comme indiqué dans la configuration. Sélectionnez ensuite le bouton de prévisualisation de l'image et l'affichage en temps réel du flux de la caméra sera affiché dans la zone de prévisualisation.
tr_tr: İlk adım, bir görüntü elde etmektir. Kaynağı kullanmak için, "Add Webcam-Web Kamerası Ekle" düğmesini tıklayın ve kamera numarasını seçin. Bu durumda Web Kamerası 0 olarak görünen Logitech USB kamera ve Bilgisayar monitörü kamerası Web Kamerası 1 'dir. Bu durumda web kamerası, kurulumda gösterildiği gibi bilgisayarın arkasındaki görüntüyü almak için seçilir. Ardından görüntü ön izleme düğmesini seçin ve kamera akışının gerçek zamanlı görüntüsü ön izleme alanında gösterilecektir.
zh_cn: 第一步是获取图像。要使用信号源，请单击“添加网络摄像头”按钮，然后选择摄像头编号。在这种情况下，Logitech USB摄像头显示为Webcam 0，而计算机监控摄像头为Webcam1。在这种情况下，选择Web摄像头以捕获计算机后面的图像，如设置所示。然后选择图像预览按钮，摄像机流的实时显示将显示在预览区域中。

source: Resize the image
es_mx: Cambiar el tamaño de la imagen
fr_ca: Redimensionner l'image
tr_tr: Görüntüyü yeniden boyutlandırın
zh_cn: 调整图像大小

source: In this case the camera resolution is too high for our purposes, and in fact the entire image cannot even be viewed in the preview window. The "Resize" operation is clicked from the Operation Palette to add it to the end of the pipeline. To help locate the Resize operation, type "Resize" into the search box at the top of the palette. The steps are:
es_mx: En este caso, la resolución de la cámara es demasiado alta para nuestros propósitos, y de hecho toda la imagen ni siquiera se puede ver en la ventana de vista previa. Se hace clic en la operación "Resize" desde la paleta de operaciones para agregarlo al final de la pipeline. Para ayudar a localizar la operación de cambio de tamaño, escriba "Resize" en el cuadro de búsqueda en la parte superior de la paleta. Los pasos son:
fr_ca: Dans ce cas, la résolution de la caméra est trop élevée pour nos besoins, et en fait, l'image entière ne peut même pas être affichée dans la fenêtre d'aperçu. L'opération "Resize" peut être choisie dans la palette d'opérations pour l'ajouter à la fin du pipeline. Pour aider à localiser l'opération de redimensionnement, écrivez "Resize" dans la zone de recherche en haut de la palette. Les étapes sont les suivantes:
tr_tr: Bu durumda, kamera çözünürlüğü bizim amacımız için çok yüksektir ve aslında görüntünün tamamı ön izleme penceresinde bile görüntülenemez. "Resize-Yeniden Boyutlandır" işlemi, işlem paletinin sonuna eklemek için İşlem Paletinden tıklanır. Yeniden Boyutlandırma işleminin bulunmasına yardımcı olmak için, paletin üst kısmındaki arama kutusuna "Resize-Yeniden Boyutlandır" yazın. Adımlar:
zh_cn: 在这种情况下，相机分辨率对于我们的目的来说太高了，实际上，整个图像甚至都无法在预览窗口中查看。从“操作面板”中单击“调整大小”操作，以将其添加到线程的末尾。为了帮助找到“调整大小”操作，请在面板顶部的搜索框中键入“调整大小”。这些步骤是：

source: Type "Resize" into the search box on the palette
es_mx: Escriba "Resize" en el cuadro de búsqueda en la paleta
fr_ca: Tapez "Resize" dans la boîte de recherche sur la palette
tr_tr: Paletteki arama kutusuna "Resize-Yeniden Boyutlandır" yazın
zh_cn: 在面板上的搜索框中输入“调整大小”

source: Click the Resize operation from the palette. It will appear in the pipeline.
es_mx: Haga clic en la operación Resize de la paleta. Aparecerá en la pipeline.
fr_ca: Cliquez sur l'opération de redimensionnement dans la palette. Elle apparaîtra dans le pipeline.
tr_tr: Paletten Resize-Yeniden Boyutlandır işlemine tıklayın. Katman-level bilgisinde görünecektir.
zh_cn: 单击调色板中的“调整大小”操作。它将出现在线程中。

source: Enter the x and y resize scale factor into the resize operation in the pipeline. In this case 0.25 was chosen for both.
es_mx: Ingrese el factor de escala de cambio de tamaño x & y en la operación de cambio de tamaño en la pipeline. En este caso 0.25 fue elegido para ambos.
fr_ca: Entrez le facteur d'échelle (redimensionnement) x et y. Dans ce cas, 0,25 a été choisi pour les deux.
tr_tr: Katman-level bilgisinde yeniden boyutlandırma işlemine x ve y yeniden boyutlandırma ölçek faktörünü girin. Bu durumda her ikisi için de 0.25 seçildi.
zh_cn: 在线程的调整大小操作中输入x和y调整大小比例因子。在这种情况下，两者均选择0.25。

source: Drag from the Webcam image output mat socket to the Resize image source mat socket. A connection will be shown indicating that the camera output is being sent to the resize input.
es_mx: Arrastre desde el socket del tapete de salida de imagen de la cámara web al socket del tapete fuente de cambio de tamaño de imagen. Se mostrará una conexión que indica que la salida de la cámara se está enviando a la entrada de cambio de tamaño.
fr_ca: Tracer une ligne en provenance de la sortie de l'image webcam vers l'entrée de la fonction "Resize". Une connexion s'affiche pour indiquer que la sortie de la caméra est envoyée à l'entrée de redimensionnement.
tr_tr: Web kamerası görüntü çıkış paspası soketinden Yeniden boyutlandırma görüntü kaynağı mat soketine sürükleyin. Kamera çıkışının yeniden boyutlandırma girişine gönderildiğini gösteren bir bağlantı gösterilecektir.
zh_cn: 从网络摄像头图像输出垫插槽中拖动到调整图像源垫插槽。将显示一个连接，指示摄像头输出正在发送到调整大小输入。

source: Click on the destination preview button on the "Resize" operation in the pipeline. The smaller image will be displayed alongside the larger original image. You might need to scroll horizontally to see both as shown.
es_mx: Haga clic en el botón de vista previa de destino en la operación "Cambiar tamaño" en la pipeline. Se mostrará una imagen más pequeña junto con la imagen original más grande. Es posible que necesites desplazarse horizontalmente para ver ambos como se muestra.
fr_ca: Cliquez sur le bouton "Preview" sur l'opération "Resize". L'image plus petite sera affichée à côté de l'image originale plus grande. Vous devrez peut-être faire défiler horizontalement pour voir les deux comme indiqué.
tr_tr: İşlem hattındaki "Resize-Yeniden Boyutlandır" işleminde hedef ön izleme düğmesine tıklayın. Küçük görüntü, daha büyük orijinal görüntünün yanında görüntülenecektir. Her ikisini de gösterildiği gibi görmek için yatay olarak kaydırmanız gerekebilir.
zh_cn: 单击线程中“调整大小”操作上的目标预览按钮。较小的图像将与较大的原始图像一起显示。您可能需要水平滚动才能看到两者，如图所示。

source: Lastly, click the Webcam source preview button since there is no reason to look at both the large image and the smaller image at the same time.
es_mx: Por último, haga clic en el botón de vista previa de la fuente de la cámara web, ya que no hay razón para ver la imagen grande y la imagen más pequeña al mismo tiempo.
fr_ca: Enfin, cliquez sur le bouton "Preview" la source de la webcam, pour fermer celle-ci, car il n'y a aucune raison de regarder à la fois la grande image et la petite image en même temps.
tr_tr: Son olarak, aynı anda hem büyük hem de daha küçük görüntüye bakmak için bir neden olmadığından, Web kamerası kaynak önizleme düğmesini tıklayın.
zh_cn: 最后，单击Webcam源预览按钮，因为没有理由同时查看大图像和小图像。

source: Find only the yellow parts of the image
es_mx: Encuentra solo las partes amarillas de la imagen
fr_ca: Rechecher uniquement les parties jaunes de l'image
tr_tr: Görüntünün yalnızca sarı parçalarını bulun
zh_cn: 仅查找图像的黄色部分

source: The next step is to remove everything from the image that doesn't match the yellow color of the piece of plastic that is the object being detected. To do that a HSV Threshold operation is chosen to set upper and lower limits of HSV values to indicate which pixels should be included in the resultant binary image. Notice that the target area is white while everything that wasn't within the threshold values are shown in black. Again, as before:
es_mx: El siguiente paso es eliminar todo de la imagen que no coincida con el color amarillo de la pieza de plástico que es el objeto que se detecta. Para hacer eso, una operación de umbral de HSV se elige para establecer los límites superior e inferior de los valores de HSV para indicar qué píxeles deben ser incluido en la imagen binaria resultante. Observe que el área objetivo es blanca mientras todo que no estaban dentro de los valores umbral se muestran en negro. De nuevo, como antes:
fr_ca: L'étape suivante consiste à supprimer tout pixel de l'image qui ne correspond pas à la teinte de jaune du morceau de plastique choisi. Pour ce faire, le seuillage HSV est choisi pour définir les limites supérieure et inférieure des valeurs HSV, permettant d'isoler les pixels à inclure dans l'image binaire résultante. Notez que la cible est blanche tandis que tout pixel ne satisfaisant pas le seuillage sera en noir. Comme précédemment :
tr_tr: Bir sonraki adım, görüntüdeki algılanan nesnenin sarı rengiyle eşleşmeyen her şeyi kaldırmaktır. Bunu yapmak için, sonuçta ortaya çıkan ikili görüntüye hangi piksellerin dahil edilmesi gerektiğini belirtmek için HSV değerlerinin üst ve alt sınırlarını ayarlamak üzere bir HSV Eşiği işlemi seçilir. Eşik değerleri dahilinde olmayan her şey siyah renkte gösterilirken hedef alanın beyaz olduğuna dikkat edin. Yine, daha önce olduğu gibi:
zh_cn: 下一步是从图像中删除与被检测物体塑料片的黄色不匹配的所有东西。为此，选择HSV阈值操作以设置HSV值的上限和下限，以指示在最终的二进制图像中应包含哪些像素。请注意，目标区域为白色，而未超出阈值的所有区域均显示为黑色。再次，和以前一样：

source: Type HSV into the search box to find the HSV Threshold operation.
es_mx: Escriba HSV en el cuadro de búsqueda para encontrar la operación HSV Threshold
fr_ca: Écrivez HSV dans la zone de recherche pour trouver l'opération HSV Threshold.
tr_tr: HSV Eşiği işlemini bulmak için arama kutusuna HSV yazın.
zh_cn: 在搜索框中键入HSV以查找HSV阈值操作。

source: Click on the operation in the palette and it will appear at the end of the pipeline.
es_mx: Haga clic en la operación en la paleta y aparecerá al final de la pipeline.
fr_ca: Cliquez sur l'opération dans la palette et elle apparaîtra à la fin du pipeline.
tr_tr: Paletteki işleme tıklayın ve katman-level bilgisinin sonunda görünecektir.
zh_cn: 单击面板中的操作，它将出现在线程的结尾。

source: Connect the dst (output) socket on the resize operation to the input of the HSV Threshold.
es_mx: Conecte el socket dst (salida) en la operación de cambio de tamaño a la entrada de HSV Threshold.
fr_ca: Connectez la prise dst (sortie) de l'opération de redimensionnement à l'entrée de HSV Threshold.
tr_tr: Yeniden boyutlandırma işlemindeki dst (çıkış) soketini HSV Eşiğinin girişine bağlayın.
zh_cn: 将调整大小操作上的dst（输出）插座连接到HSV阈值的输入。

source: Enable the preview of the HSV Threshold operation so the result of the operation is displayed in the preview window.
es_mx: Habilite la vista previa de la operación HSV Threshold para que el resultado de la operación sea mostrada en la ventana de vista previa.
fr_ca: Activez Preview sur HSV Threshold pour que le résultat de l'opération s'affiche dans la fenêtre d'aperçu.
tr_tr: HSV Eşiği işleminin önizlemesini etkinleştirin, böylece işlemin sonucu önizleme penceresinde görüntülenir.
zh_cn: 启用“ HSV阈值”操作的预览，以便操作结果显示在预览窗口中。

source: Adjust the Hue, Saturation, and Value parameters only the target object is shown in the preview window.
es_mx: Ajuste los parámetros de Tono, Saturación y Valor, solo el objeto de destino se muestra en la ventana de vista previa.
fr_ca: Ajustez les paramètres Teinte, Saturation et Valeur (Hue, Saturation, Value), pour que seulement l’objet cible soit affiché dans la fenêtre d’aperçu.
tr_tr: Ton, Doygunluk ve Değer parametrelerini ayarlayın, önizleme penceresinde yalnızca hedef nesne gösterilir.
zh_cn: 调整“色相”，“饱和度”和“值”参数，只有目标对象显示在预览窗口中。

source: Get rid of the noise and extraneous hits
es_mx: Deshazte del ruido y los golpes extraños
fr_ca: Limiter l'effet des éléments extérieurs
tr_tr: Kirlilikten ve gereksiz darbelerden kurtulun
zh_cn: 摆脱噪音和无关紧要的干扰
