Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/grip/using-grip-with-a-kangaroo-computer.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Using GRIP with a Kangaroo Computer
es_mx: Usando el GRIP con un ordenador Kangaroo
fr_ca: Utilisation de GRIP avec un ordinateur de type Kangaroo
tr_tr: GRIP'i Kanguru Bilgisayarı ile Kullanma
zh_cn: 在袋鼠计算机上使用GRIP

source: A recently available computer called the Kangaroo looks like a great platform for running GRIP on FRC\ |reg| robots. Some of the specs for this processor include:
es_mx: Una computadora recientemente disponible llamada Kangaroo parece una gran plataforma para ejecutar GRIP en los robots FRC\ |reg|. Algunas de las especificaciones de este procesador incluyen:
fr_ca: Un ordinateur récemment disponible appelé kangourou se présente comme une excellente plate-forme pour exécuter GRIP sur les robots FRC\ |reg|. Voici quelques-unes des spécifications de ce processeur :
tr_tr: Kanguru adı verilen yeni bir bilgisayar, robotları FRC \ | reg | üzerinde GRIP ile çalıştırmak için harika bir platform gibi görünüyor .Bu işlemcinin bazı özellikleri şunları içerir:
zh_cn: 最近使用的名为“袋鼠”的计算机看起来像是在FRC上运行GRIP的绝佳平台。机器人。该处理器的一些规格包括：

source: Quad core 1.4Ghz Atom processor
es_mx: Procesador de átomos de cuádruple núcleo a 1,4Ghz
fr_ca: Processeur quad core 1.4Ghz Atom
tr_tr: Quad core 1.4Ghz Atom işlemci
zh_cn: 四核1.4Ghz Atom处理器

source: HDMI port
es_mx: Puerto HDMI
fr_ca: Port HDMI
zh_cn: HDMI端口

source: 2 USB ports (1 USB2 and 1 USB3)
es_mx: 2 puertos USB (1 USB2 y un USB3)
fr_ca: 2 ports USB (1 USB2 et 1 USB3)
zh_cn: 2个USB端口（1个USB2和1个USB3）

source: 2GB RAM
es_mx: 2GB de RAM
fr_ca: 2 Go de RAM

source: 32GB Flash
fr_ca: Flash 32 Go
zh_cn: 32GB闪存

source: Flash card slot
es_mx: Ranura para tarjetas de memoria
fr_ca: Emplacement pour carte flash
zh_cn: 闪存卡插槽

source: Battery with 4 hours running time
es_mx: Batería con 4 horas de duración
fr_ca: Batterie avec 4 heures d'autonomie
tr_tr: 4 saat çalışma süresine sahip pil
zh_cn: 电池续航时间为4小时

source: Power supply
es_mx: Fuente de energía
fr_ca: Source d'alimentation
zh_cn: 电源

source: and a fingerprint reader
es_mx: y un lector de huellas dactilares
fr_ca: et un lecteur d'empreintes digitales
tr_tr: ve bir parmak izi okuyucu
zh_cn: 和指纹读取器

source: The advantage of this setup is that it offloads the roboRIO from doing image processing and it is a normal Windows system so all of our software should work without modification. Be sure to read the caveats at the end of this page before jumping in.
es_mx: La ventaja de esta configuración es que le quita al roboRIO hacer el procesamiento de imágenes y es un sistema normal de Windows por lo que todo nuestro software debería funcionar sin modificaciones. Asegúrate de leer las advertencias al final de esta página antes de entrar.
fr_ca: L'avantage de joindre un Kangaroo au RoboRio est qu'il décharge ce dernier du traitement d'image et comme il s'agit d'un système Windows normal, théroquement tous nos logiciels devraient fonctionner sans modification. Assurez-vous de lire les mises en garde à la fin de cette page avant de commencer.
tr_tr: Bu kurulumun avantajı, roboRIO'yu görüntü işleme yapmaktan alıkoyması ve normal bir Windows sistemi olması, dolayısıyla tüm yazılımımızın herhangi bir değişiklik yapmadan çalışması gerektiğidir. İçeri girmeden önce bu sayfanın sonundaki uyarıları okuduğunuzdan emin olun.
zh_cn: 此设置的优点是它可以减轻roboRIO的图像处理负担，并且它是一个正常的Windows系统，因此我们的所有软件都可以正常运行而无需修改。在跳入之前，请务必先阅读本页面末尾的注意事项。

source: **More detailed instructions** for using a Kangaroo for running GRIP can be found in the following PDF document created by Scott Taylor and FRC 1735. His explanation goes beyond what is shown here, detailing how to get the GRIP program to auto-start on boot and many other details.
es_mx: **Más instrucciones detalladas** para usar un Kangaroo para ejecutar el GRIP se pueden encontrar en el siguiente documento PDF creado por Scott Taylor y FRC 1735. Su explicación va más allá de lo que se muestra aquí, detallando cómo hacer que el programa GRIP se inicie automáticamente en el arranque y muchos otros detalles.
fr_ca: **Des instructions plus détaillées** pour utiliser un Kangaroo afin d'exécuter GRIP peuvent être trouvées dans le document PDF suivant créé par Scott Taylor et FRC 1735. Son explication va au-delà de ce qui est montré ici, détaillant comment un programme GRIP pour automatiquement démarrer lors de la mise sous tension du robot et de nombreux autres détails.
tr_tr: ** GRIP çalıştırmak için bir Kanguru kullanmak için daha ayrıntılı talimatlar ** Scott Taylor ve FRC 1735 tarafından oluşturulan aşağıdaki PDF belgesinde bulunabilir. Onun açıklaması, burada gösterilenin ötesine geçerek GRIP programını otomatik başlatmaya nasıl getireceğinizi ayrıntılarıyla anlatmaktadır. önyükleme ve diğer birçok ayrıntıda.
zh_cn: **可在以下由Scott Taylor和FRC 1735创建的PDF文档中找到有关使用袋鼠运行GRIP的更多详细说明**。他的解释超出了此处显示的内容，详细说明了如何使GRIP程序自动启动。在启动和许多其他细节。

source: Setup
es_mx: Configuración
fr_ca: Installation
tr_tr: Kurulum
zh_cn: 设置

source: The nice thing about this setup is that you just need to plug in a monitor, keyboard, mouse and (in this case) the Microsoft web camera and you are good to go with programming the GRIP pipeline. When you are finished, disconnect the keyboard, mouse and monitor and put the Kangaroo on your robot. You will need to disable the WiFi on the Kangaroo and connect it to the robot with a USB ethernet dongle to the extra ethernet port on the robot radio.
es_mx: Lo bueno de esta configuración es que sólo tienes que conectar un monitor, un teclado, un ratón y (en este caso) la cámara web de Microsoft y ya puedes programar el canal GRIP. Cuando termines, desconecta el teclado, el ratón y el monitor y pon el Canguro en tu robot. Necesitará deshabilitar el WiFi del Canguro y conectarlo al robot con un cable ethernet USB al puerto ethernet extra de la radio del robot.
fr_ca: Un des avantages à propos de cette configuration est que vous avez juste besoin de brancher un moniteur, un clavier, une souris et (dans ce cas) la caméra Web Microsoft et vous êtes prêt à programmer le pipeline GRIP. Lorsque vous avez terminé, déconnectez le clavier, la souris et le moniteur et placez le Kangaroo sur votre robot. Vous devrez désactiver le WiFi sur le Kangaroo et le connecter au robot avec une clé USB Ethernet sur le port Ethernet supplémentaire de la radio du robot.
tr_tr: Bu kurulumun güzel yanı, sadece bir monitör, klavye, fare ve (bu durumda) Microsoft web kamerasını takmanız gerekmesi ve GRIP boru hattını programlamaya devam etmenizdir. Bitirdiğinizde klavye, fare ve monitörün bağlantısını kesin ve Kanguru'nuzu robotunuzun üzerine koyun. Kanguru üzerindeki WiFi'yi devre dışı bırakmanız ve robota bir USB ethernet dongle ile robot radyosundaki ekstra ethernet bağlantı noktasına bağlamanız gerekecektir.
zh_cn: 这种设置的好处是，您只需要插入监视器，键盘，鼠标和Microsoft网络摄像头（在这种情况下），就可以对GRIP管道进行编程了。完成后，断开键盘，鼠标和显示器的连接，然后将袋鼠放到机器人上。您将需要在袋鼠上禁用WiFi，并通过USB以太网加密狗将其连接到机器人，并将其连接到机器人无线电上的额外以太网端口。

source: In this example you can see the Kangaroo computer (1) connected to a USB hub (3), keyboard, and an HDMI monitor for programming. The USB hub is connected to the camera and mouse.
es_mx: En este ejemplo se puede ver la computadora Kangaroo (1) conectada a un USB hub (3), un teclado y un monitor HDMI para la programación. El concentrador USB está conectado a la cámara y al ratón.
fr_ca: Dans cet exemple, vous pouvez voir l'ordinateur Kangaroo (1) connecté à un concentrateur USB (3), un clavier et un moniteur HDMI pour la programmation. Le concentrateur USB est connecté à l'appareil photo et à la souris.
tr_tr: Bu örnekte, programlama için bir USB hub'a (3), klavyeye ve bir HDMI monitöre bağlı Kanguru bilgisayarını (1) görebilirsiniz. USB hub'ı kameraya ve fareye bağlanır.
zh_cn: 在此示例中，您可以看到袋鼠计算机（1）连接到USB集线器（3），键盘和HDMI监视器以进行编程。 USB集线器已连接到相机和鼠标。

source: Sample GRIP program
es_mx: Muestra del programa GRIP
fr_ca: Exemple de programme GRIP
zh_cn: GRIP程序示例

source: Attached is the sample program running on the Kangaroo detecting the red heart on the little foam robot in the image (left panel). It is doing a HSV threshold to only get that red color then finding contours, and then filtering the contours using the size and solidity. At the end of the pipeline, the values are being published to NetworkTables.
es_mx: Se adjunta el programa de muestra que se ejecuta en el Kangaroo detectando el corazón rojo en el pequeño robot de espuma de la imagen (panel izquierdo). Está haciendo un umbral de HSV para obtener sólo ese color rojo, luego encontrando los contornos, y luego filtrando los contornos usando el tamaño y la solidez. Al final de la tubería, los valores se están publicando en NetworkTables.
fr_ca: Vous trouverez ci-joint l'exemple de programme exécuté sur le Kangaroo détectant le cœur rouge sur le petit robot en mousse dans l'image (panneau de gauche). Il fait un seuil HSV pour obtenir uniquement cette couleur rouge, puis recherche les contours, puis filtre les contours en utilisant la taille et la solidité. À la fin du pipeline, les valeurs sont publiées sur NetworkTables.
tr_tr: Resimdeki küçük köpük robot üzerindeki kırmızı kalbi algılayan Kanguru üzerinde çalışan örnek program eklenmiştir (sol panel). Yalnızca o kırmızı rengi elde etmek için bir HSV eşiği yapıyor, ardından konturları buluyor ve ardından boyutu ve sağlamlığı kullanarak konturları filtreliyor. Ardışık düzenin sonunda, değerler NetworkTables'da yayınlanmaktadır.
zh_cn: 随附的是在袋鼠上运行的示例程序，该程序在图像中检测到小泡沫机器人上的红心（左图）。它正在执行HSV阈值，以仅获得红色，然后找到轮廓，然后使用大小和实心度过滤轮廓。在管道的最后，这些值将发布到NetworkTables。

source: Viewing Contours Report in NetworkTables
es_mx: Ver Informe de Contornos en NetworkTables
fr_ca: Affichage du rapport des contours dans NetworkTables
tr_tr: Ağ Tablolarında Kontur Raporunu Görüntüleme
zh_cn: 在NetworkTables中查看轮廓报告

source: This is the output from the OutlineViewer (<username>/WPILib/tools/OutlineViewer.jar), running on a different computer as a server (since there is no roboRIO on the network in this example) and the values being reported back for the single contour that the program detected that met the requirements of the Filter Contours operation.
es_mx: Esta es la salida del OutlineViewer (/WPILib/tools/OutlineViewer.jar), que se ejecuta en un ordenador diferente como servidor (ya que no hay ningún roboRIO en la red en este ejemplo) y los valores que se reportan para el único contorno que el programa detectó que cumplía con los requisitos de la operación contornos de filtro.
fr_ca: Il s'agit de la sortie de "OutlineViewer" (<username>/WPILib/tools/OutlineViewer.jar), exécutée sur un autre ordinateur en tant que serveur (car il n'y a pas de roboRIO sur le réseau dans cet exemple) et des valeurs renvoyées pour le contour unique qui le programme a détecté qu'il répondait aux exigences de l'opération "Filter Contours".
tr_tr: Bu, OutlineViewer'dan (<username> /WPILib/tools/OutlineViewer.jar), sunucu olarak farklı bir bilgisayarda çalışan (bu örnekte ağda roboRIO olmadığı için) ve değerlerin geri bildirilmesidir. Programın Filtre Konturları işleminin gereksinimlerini karşıladığını tespit ettiği tek kontur.
zh_cn: 这是OutlineViewer（<username> /WPILib/tools/OutlineViewer.jar）的输出，它在作为服务器的另一台计算机上运行（因为在此示例中网络上没有roboRIO），并且针对单个轮廓报告了该值程序检测到满足“过滤轮廓”操作的要求。

source: Considerations
es_mx: Consideraciones
fr_ca: Considérations
tr_tr: Düşünceler
zh_cn: 注意事项

source: The Kangaroo runs Windows 10, so care must to be taken to make sure GRIP will keep running on the robot during a match or testing. For example, it should not try to do a Windows Update, Virus scan refresh, go to sleep, etc. Once configured, it has the advantage of being a normal Intel Architecture and should give predictable performance since it is running only one application.
es_mx: El Kangaroo funciona con Windows 10, así que hay que tener cuidado para asegurarse de que GRIP siga funcionando en el robot durante un partido o una prueba. Por ejemplo, no debe intentar hacer una actualización de Windows Update, refrescar el escaneo de virus, ir a dormir, etc. Una vez configurado, tiene la ventaja de ser una arquitectura Intel normal y debería dar un rendimiento predecible ya que sólo está ejecutando una aplicación.
fr_ca: Le Kangaroo fonctionne sous Windows 10, il faut donc veiller à ce que GRIP continue de fonctionner sur le robot pendant un match ou un test. Par exemple, le Kangaroo ne doit pas essayer de faire une mise à jour Windows, une actualisation de l'analyse antivirus, une mise en veille, etc. Une fois configuré, il a l'avantage d'être une architecture Intel normale et devrait donner des performances prévisibles puisqu'il n'exécute qu'une seule application.
tr_tr: Kanguru, Windows 10 çalıştırmaktadır, bu nedenle GRIP'in bir maç veya test sırasında robot üzerinde çalışmaya devam etmesini sağlamak için özen gösterilmelidir. Örneğin, bir Windows Güncellemesi, Virüs taraması yenilemesi, uykuya geçme, vb. Yapmaya çalışmamalıdır. Yapılandırıldıktan sonra, normal bir Intel Mimarisi olma avantajına sahiptir ve yalnızca bir uygulama çalıştırdığı için tahmin edilebilir performans vermelidir.
zh_cn: 袋鼠运行Windows 10，因此必须注意确保GRIP在比赛或测试期间将继续在机器人上运行。例如，它不应尝试执行Windows Update，病毒扫描刷新，进入睡眠状态等。配置后，它具有作为常规英特尔架构的优势，并且由于仅运行一个应用程序，因此应具有可预测的性能。

source: WiFi
zh_cn: 无线网络

source: `Grip Plus Kangaroo <grip-plus-kangaroo.pdf>`_
tr_tr: `Grip Plus Kanguru <grip-plus-kangaroo.pdf>` _
