Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/grip/using-generated-code-*-a-robot-program.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Using Generated Code in a Robot Program
es_mx: Usar el código generado en un programa de robot
fr_ca: Utilisation du code généré dans un programme de robot
tr_tr: Oluşturulan Kodu Bir Robot Programında Kullanma
zh_cn: 在机器人程序中使用生成的代码

source: GRIP generates a class that can be added to an FRC\ |reg| program that runs on a roboRIO and without a lot of additional code, drive the robot based on the output.
es_mx: GRIP genera una clase que puede ser añadida a un programa FRC\ |reg| que se ejecuta en una roboRIO y sin mucho código adicional, conduce el robot según la salida.
fr_ca: GRIP génère une classe qui peut être ajoutée à un programme FRC\ |reg| qui fonctionne sur un roboRIO et sans beaucoup de code supplémentaire, permet de conduire le robot en fonction de la sortie.
tr_tr: GRIP, roboRIO üzerinde ve çok fazla ek kod olmadan çalışan FRC \ | reg | 'e eklenebilecek bir program sınıfı üretir, çıktıya göre robotu sürün.
zh_cn: GRIP生成可添加到FRC \ | reg |的类。在roboRIO上运行且没有大量其他代码的程序，根据输出结果驱动机器人。

source: Included here is a complete sample program that uses a GRIP pipeline that drives a robot towards a piece of retroreflective material.
es_mx: Aquí se incluye un programa de muestra completo que utiliza una tubería GRIP que conduce a un robot hacia un trozo de material retrorreflectante.
fr_ca: Voici un exemple de programme complet qui utilise un pipeline GRIP qui dirige un robot vers un morceau de matériau rétroréfléchissant.
tr_tr: Burada, bir robotu bir retroreflektif malzemeye doğru yönlendiren bir GRIP katmanı kullanan eksiksiz bir örnek program bulunmaktadır.
zh_cn: 这里包括一个完整的示例程序，该程序使用GRIP线程将机器人驱动到一块逆向反射材料上。

source: This program is designed to illustrate how the vision code works and does not necessarily represent the best technique for writing your robot program. When writing your own program be aware of the following considerations:
es_mx: Este programa está diseñado para ilustrar cómo funciona el código de visión y no representa necesariamente la mejor técnica para escribir su programa de robot. Cuando escriba su propio programa, tenga en cuenta las siguientes consideraciones:
fr_ca: Ce programme est conçu pour illustrer le fonctionnement du code de vision et ne représente pas nécessairement la meilleure technique pour écrire votre programme de robot. Lorsque vous écrivez votre propre programme, tenez compte des considérations suivantes:
tr_tr: Bu program, görüntü kodunun nasıl çalıştığını göstermek için tasarlanmıştır ve robot programınızı yazmak için en iyi tekniği temsil etmesi gerekmez. Kendi programınızı yazarken aşağıdaki hususlara dikkat edin:
zh_cn: 该程序旨在说明视觉代码的工作原理，并不一定代表编写机器人程序的最佳技术。在编写自己的程序时，请注意以下注意事项：

source: **Using the camera output for steering the robot could be problematic**. The camera code in this example that captures and processes images runs at a much slower rate that is desirable for a control loop for steering the robot. A better, and only slightly more complex solution, is to get headings from the camera and it's processing rate, then have a much faster control loop steering to those headings using a gyro sensor.
es_mx: **Utilizar la salida de la cámara para dirigir el robot podría ser problemático**. El código de la cámara en este ejemplo que captura y procesa las imágenes funciona a una velocidad mucho más lenta que la deseable para un bucle de control para dirigir el robot. Una mejor solución, y sólo ligeramente más compleja, es obtener los encabezados de la cámara y su tasa de procesamiento, y luego tener un bucle de control mucho más rápido para dirigir esos encabezados usando un sensor giroscópico.
fr_ca: **L'utilisation de la sortie de la caméra pour diriger le robot peut être problématique**. Dans cet exemple, le code de la caméra qui capture et traite les images s'exécute à un rythme beaucoup trop lent de ce qui est souhaitable pour diriger le robot à l'aide d'une boucle d'asservissement. Une meilleure solution, légèrement plus complexe, consiste à obtenir la direction (Headings) relatif au robot à partir de la position de la caméra sur le robot. Ensuite, rafraîchir cette direction à la fréquence de traitement d'image. Finalement, utiliser un gyroscope comme senseur pour compléter la boucle de contrôle.
tr_tr: ** Robotu yönlendirmek için kamera çıktısını kullanmak sorunlu olabilir **. Bu örnekteki görüntüleri yakalayan ve işleyen kamera kodu, robotu yönlendirmek için bir kontrol döngüsü için arzu edilen çok daha yavaş bir hızda çalışır. Daha iyi ve yalnızca biraz daha karmaşık bir çözüm, kameradan başlıkları ve işlem oranını almak, ardından bir jiroskop sensörü kullanarak bu başlıklara çok daha hızlı bir kontrol döngüsü yönlendirmesi sağlamaktır.
zh_cn: **使用相机输出来操纵机器人可能会出现问题**。在此示例中，捕获和处理图像的相机代码以慢得多的速率运行，这对于操纵机器人的控制回路是理想的。一个更好的，只是稍微复杂一点的解决方案是从摄像机获取航向及其处理速率，然后使用陀螺仪传感器将控制环转向这些航向的速度更快。

source: **Keep the vision code in the class that wraps the pipeline**. A better way of writing object oriented code is to subclass or instantiate the generated pipeline class and process the OpenCV results there rather than in the robot program. In this example, the robot code extracts the direction to drive by manipulating the resultant OpenCV contours. By having the OpenCV code exposed throughout the robot program it makes it difficult to change the vision algorithm should you have a better one.
es_mx: **Mantenga el código de visión en la clase que envuelve la pipeline/tubería**. Una mejor manera de escribir código orientado a objetos es subclasificar o instanciar la clase de tubería generada y procesar los resultados de OpenCV allí en vez de en el programa de robot. En este ejemplo, el código del robot extrae la dirección a conducir manipulando los contornos de OpenCV resultantes. Al tener el código de OpenCV expuesto a lo largo del programa del robot hace difícil cambiar el algoritmo de visión en caso de tener uno mejor.
fr_ca: **Gardez le code de vision dans la classe qui enveloppe le pipeline**. Une meilleure façon d'écrire du code orienté objet est de sous-classer ou d'instancier la classe de pipeline générée et d'y traiter les résultats OpenCV plutôt que dans le programme du robot. Dans cet exemple, le code du robot détermine la direction ou cap du robot en manipulant les contours OpenCV résultants. En ayant le code OpenCV éparpillé tout au long du programme de robot, il est difficile de changer l'algorithme de vision si vous en avez un meilleur.
tr_tr: ** Görüş kodunu ardışık düzeni saran sınıfta tutun **. Nesne yönelimli kod yazmanın daha iyi bir yolu, oluşturulan boru hattı sınıfını alt sınıflara ayırmak veya örneklendirmek ve OpenCV sonuçlarını robot programı yerine orada işlemektir. Bu örnekte robot kodu, ortaya çıkan OpenCV konturlarını değiştirerek sürüş yönünü çıkarır. OpenCV kodunun robot programı boyunca ifşa edilmesi, daha iyi bir algoritmaya sahip olmanız durumunda vizyon algoritmasını değiştirmeyi zorlaştırır.
zh_cn: **将视觉代码保留在包装线程的类中**。编写面向对象代码的一种更好的方法是子类化或实例化生成的线程类，然后在其中处理OpenCV结果，而不是在机器人程序中进行处理。在此示例中，机器人代码通过操纵所得的OpenCV轮廓来提取行驶方向。通过在整个机器人程序中公开OpenCV代码，如果您拥有更好的视觉算法，则很难更改视觉算法。

source: Iterative program definitions
es_mx: Definiciones de programas iterativos
fr_ca: Définitions de programme itératives
tr_tr: Iterative-Yinelemeli program tanımları
zh_cn: 迭代程序定义

source: In this first part of the program you can see all the import statements for the WPILib classes used for this program.
es_mx: En esta primera parte del programa se pueden ver todas las declaraciones de importación de las clases WPILib utilizadas para este programa.
fr_ca: Dans cette première partie du programme, vous pouvez voir toutes les instructions d'importation pour les classes WPILib utilisées pour ce programme.
tr_tr: Programın bu ilk bölümünde, bu program için kullanılan WPILib sınıfları için tüm içe aktarma ifadelerini görebilirsiniz.
zh_cn: 在程序的第一部分，您可以看到用于该程序的WPILib类的所有import语句。

source: The **image width and height** are defined as 320x240 pixels.
es_mx: El **ancho y alto de la imagen** se definen como 320x240 píxeles.
fr_ca: **La largeur et la hauteur de l'image** sont définies comme 320x240 pixels.
tr_tr: ** image width and height-görüntü genişliği ve yüksekliği ** 320x240 piksel olarak tanımlanmıştır.
zh_cn: 图像宽度和高度**定义为320x240像素。

source: The **VisionThread** is a WPILib class makes it easy to do your camera processing in a separate thread from the rest of the robot program.
es_mx: El **VisionThread** es una clase de WPILib que facilita el procesamiento de la cámara en un hilo separado del resto del programa del robot.
fr_ca: Le **VisionThread** est une classe WPILib qui facilite le traitement de votre caméra dans un thread séparé du reste du programme du robot.
tr_tr: ** VisionThread ** bir WPILib sınıfıdır, kamera işlemenizi robot programının geri kalanından ayrı bir iş parçacığında yapmanızı kolaylaştırır.
zh_cn: ** VisionThread **是WPILib类，可轻松在与机器人程序其余部分不同的线程中进行相机处理。

source: **centerX** value will be the computed center X value of the detected target.
es_mx: El valor **centerX** será calculado del valor centro X del objetivo detectado.
fr_ca: **centerX** value sera la valeur X centrale calculée de la cible détectée.
tr_tr: **centerX** değeri, tespit edilen hedefin hesaplanan merkez X değeri olacaktır.
zh_cn: “ centerX ”值将是检测到的目标的计算出的中心X值。

source: **DifferentialDrive** encapsulates the drive motors on this robot and allows simplified driving.
es_mx: **DifferentialDrive** encapsula los motores de accionamiento de este robot y permite una conducción simplificada.
fr_ca: **DifferentialDrive** encapsule les moteurs d'entraînement de ce robot et permet une conduite simplifiée.
zh_cn: **DifferentialDrive**将驱动电机封装在这个机器人上，并简化了驱动。

source: **imgLock** is a variable to synchronize access to the data being simultaneously updated with each image acquisition pass and the code that's processing the coordinates and steering the robot.
es_mx: **imgLock** es una variable para sincronizar el acceso a los datos que se actualizan simultáneamente con cada pasada de adquisición de imágenes y el código que está procesando las coordenadas y dirigiendo el robot.
fr_ca: **imgLock** est une variable pour synchroniser l'accès aux données mises à jour simultanément avec chaque passe d'acquisition d'image et le code qui traite les coordonnées et dirige le robot.
tr_tr: **imgLock**, her görüntü edinme geçişi ve koordinatları işleyen ve robotu yönlendiren koda eşzamanlı olarak güncellenen verilere erişimi senkronize etmek için bir değişkendir.
zh_cn: ** imgLock **是一个变量，用于同步访问每次图像获取过程中同时更新的数据以及处理坐标和操纵机器人的代码。

source: The **robotInit()** method is called once when the program starts up. It creates a **CameraServer** instance that begins capturing images at the requested resolution (IMG_WIDTH by IMG_HEIGHT).
es_mx: El método **robotInit()** se llama una vez cuando el programa se inicia. Crea una instancia **CameraServer** que comienza a capturar imágenes con la resolución solicitada (IMG_WIDTH por IMG_HEIGHT).
fr_ca: La méthode **robotInit()** est appelée une fois au démarrage du programme. Il crée une instance de **CameraServer** qui commence à capturer des images à la résolution demandée (IMG_WIDTH par IMG_HEIGHT).
tr_tr: **robotInit()** methodu, program başladığında bir kez çağrılır. İstenen çözünürlükte (IMG_WIDTH, IMG_HEIGHT) görüntüleri yakalamaya başlayan bir ** CameraServer ** örneği oluşturur.
zh_cn: 程序启动时，** robotInit（）**方法将被调用一次。它创建一个“ CameraServer”实例，该实例开始以请求的分辨率（IMG_HEIGHT的IMG_WIDTH）捕获图像。

source: Next an instance of the class **VisionThread** is created. VisionThread begins capturing images from the camera asynchronously in a separate thread. After processing each image, the pipeline computed **bounding box** around the target is retrieved and it's **center X** value is computed. This centerX value will be the x pixel value of the center of the rectangle in the image.
es_mx: A continuación se crea una instancia de la clase **VisionThread**. VisionThread comienza a capturar imágenes de la cámara asincrónicamente en un hilo separado. Después de procesar cada imagen, se recupera el conducto calculado **bounding box** alrededor del objetivo y se calcula su valor **center X**. Este valor centerX será el valor de x píxeles del centro del rectángulo en la imagen.
fr_ca: Ensuite, une instance de la classe **VisionThread** est créée. VisionThread commence à capturer des images de la caméra de manière asynchrone dans un thread séparé. Après le traitement de chaque image, le pipeline calculé **boîte englobante** autour de la cible est récupéré et sa valeur **centre X** est calculée. Cette valeur centerX sera la valeur x pixels du centre du rectangle dans l'image.
tr_tr: Daha sonra **VisionThread** sınıfının bir örneği oluşturulur. VisionThread, kameradaki görüntüleri eşzamansız olarak ayrı bir iş parçacığında yakalamaya başlar. Her bir görüntüyü işledikten sonra, hedefin etrafındaki hesaplanan **bounding box-sınırlayıcı kutu** geri alınır ve **center X** değeri hesaplanır. Bu centerX değeri, görüntüdeki dikdörtgenin merkezinin x piksel değeri olacaktır.
zh_cn: 接下来，将创建** VisionThread **类的实例。 VisionThread开始在单独的线程中异步捕获来自相机的图像。处理完每张图像后，将检索流水线在目标周围的“边界框”，并计算其“中心X”值。这个centerX值将是图像中矩形中心的x像素值。

source: The VisionThread also takes a **VisionPipeline** instance (here, we have a subclass **MyVisionPipeline** generated by GRIP) as well as a callback that we use to handle the output of the pipeline. In this example, the pipeline outputs a list of contours (outlines of areas in an image) that mark goals or targets of some kind. The callback finds the bounding box of the first contour in order to find its center, then saves that value in the variable centerX. Note the synchronized block around the assignment: this makes sure the main robot thread will always have the most up-to-date value of the variable, as long as it also uses **synchronized** blocks to read the variable.
es_mx: El VisionThread también toma una instancia de **VisionPipeline** (aquí, tenemos una subclase **MyVisionPipeline** generada por el GRIP) así como una llamada de retorno que usamos para manejar la salida de la tubería/pipeline. En este ejemplo, la tubería produce una lista de contornos (contornos de áreas en una imagen) que marcan objetivos o metas de algún tipo. La llamada de retorno encuentra el cuadro delimitador del primer contorno para encontrar su centro, luego guarda ese valor en la variable centerX. Observe el bloque sincronizado alrededor de la asignación: esto asegura que el hilo principal del robot siempre tendrá el valor más actualizado de la variable, siempre y cuando también utilice bloques **sincronizados** para leer la variable.
fr_ca: Le VisionThread prend également une instance **VisionPipeline** (ici, nous avons une sous-classe **MyVisionPipeline** générée par GRIP) ainsi qu'un rappel que nous utilisons pour gérer la sortie du pipeline. Dans cet exemple, le pipeline génère une liste de contours (contours de zones dans une image) qui marquent des objectifs ou des cibles d'une certaine sorte. Le rappel trouve la boîte englobante du premier contour afin de trouver son centre, puis enregistre cette valeur dans la variable "centerX". Notez le bloc synchronisé autour de l'affectation: cela garantit que le thread du robot principal aura toujours la valeur à jour de la variable, tant qu'il utilise également des blocs **synchronisés** pour lire la variable.
tr_tr: VisionThread ayrıca bir **VisionPipeline** örneğini (burada GRIP tarafından oluşturulan bir alt sınıfımız **MyVisionPipeline** var) ve ayrıca ardışık düzen çıkışını işlemek için kullandığımız bir geri arama var. Bu örnekte, boru hattı, bir türden hedefleri veya hedefleri işaretleyen bir kontur listesi (bir görüntüdeki alanların ana hatları) çıkarır. Geri arama, merkezini bulmak için ilk konturun sınırlayıcı kutusunu bulur ve ardından bu değeri centerX değişkenine kaydeder. Atamanın etrafındaki senkronize bloğa dikkat edin: Bu, değişkeni okumak için **senkronize** bloklar kullandığı sürece ana robot iş parçacığının her zaman değişkenin en güncel değerine sahip olmasını sağlar.
zh_cn: VisionThread还带有** VisionPipeline **实例（在这里，我们有一个由GRIP生成的子类** MyVisionPipeline **），以及一个用于处理线程输出的回调。在此示例中，线程输出标记了某种目的或目标的轮廓列表（图像中区域的轮廓）。回调会找到第一个轮廓的边界框以找到其中心，然后将该值保存在变量centerX中。请注意分配周围的同步块：确保主机器人线程始终具有变量的最新值，只要它还使用**同步**块读取变量即可。

source: This, the final part of the program, is called repeatedly during the **autonomous period** of the match. It gets the **centerX** pixel value of the target and **subtracts half the image width** to change it to a value that is **zero when the rectangle is centered** in the image and **positive or negative when the target center is on the left or right side of the frame.** That value is used to steer the robot towards the target.
es_mx: Esta, la parte final del programa, se llama repetidamente durante el **período autónomo** del partido. Obtiene el valor de **centerX** píxeles del objetivo y **sustrae la mitad del ancho de la imagen** para cambiarlo a un valor que es **cero cuando el rectángulo está centrado** en la imagen y **positivo o negativo cuando el centro del objetivo está a la izquierda o a la derecha del cuadro.** Ese valor se utiliza para dirigir el robot hacia el objetivo.
fr_ca: Ceci, la dernière partie du programme, est appelé à plusieurs reprises pendant la **période autonome** du match. Il obtient la valeur **centerX** pixel de la cible et **soustrait la moitié de la largeur de l'image** pour la changer en une valeur qui est **zéro lorsque le rectangle est centré** dans l'image et **positif ou négatif lorsque le centre de la cible est sur le côté gauche ou droit du cadre.** Cette valeur est utilisée pour diriger le robot vers la cible.
tr_tr: Bu, programın son kısmı, maçın **otonom süresi** boyunca tekrar tekrar çağrılır. Hedefin **centerX** piksel değerini alır **görüntüde dikdörtgen ortalandığında** sıfır olan bir değere değiştirmek için görüntü genişliğinin yarısını çıkarır. ** hedef merkez çerçevenin solunda veya sağında olduğunda pozitif veya negatif. ** bir değer ile değiştirir. Bu değer, robotu hedefe yönlendirmek için kullanılır.
zh_cn: 这是程序的最后部分，在比赛的“自动阶段”中被重复调用。它获得目标的** centerX **像素值，并**减去图像宽度的一半**，以将其更改为**当矩形在图像中居中时为零且为正或负的值。当目标中心位于框架的左侧或右侧时。**该值用于将机器人导向目标。

source: Note the **synchronized** block at the beginning. This takes a snapshot of the most recent centerX value found by the VisionThread.
es_mx: Fíjese en el bloque **sincronizado** al principio. Esto toma una instantánea del valor centerX más reciente encontrado por el VisionThread.
fr_ca: Notez le bloc **synchronisé** au début. Ce dernier conserve la valeur la plus récente de centerX trouvée par VisionThread.
tr_tr: Başlangıçta ** senkronize ** bloğuna dikkat edin. Bu, VisionThread tarafından bulunan en son centerX değerinin anlık görüntüsünü alır.
zh_cn: 请注意开头的“同步”块。这将捕获VisionThread发现的最新centerX值的快照。

source: **RobotDrive** encapsulates the 4 motors on this robot and allows simplified driving.
tr_tr: **RobotDrive**, bu robot üzerindeki 4 motoru kapsüller ve basitleştirilmiş sürüş sağlar.
