Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/old-commandbased/commands/limit-switches-control-behavior.po
Languages: es_mx, fr_ca, tr_tr

source: Using Limit Switches to Control Behavior
es_mx: Uso de interruptores de límite para controlar el comportamiento
fr_ca: Utilisation des interrupteurs de fin de course pour contrôler le comportement
tr_tr: Kontrol Davranışını Kontrol Etmek İçin Limit Anahtarlarını Kullanma

source: This documentation describes the use of the legacy command-based library. While this documentation has been preserved to help teams that have yet to do so, teams are strongly encouraged to migrate to the :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
es_mx: Esta documentación describe el uso de la biblioteca basada en comandos. Si bien esta documentación se ha conservado para ayudar a los equipos que aún no lo han hecho, se recomienda encarecidamente a los equipos que migren a: ref: `nueva biblioteca basada en comandos <docs/software/commandbased/index:Command-Based Programming>`
fr_ca: Cette documentation décrit l'utilisation de l'ancienne librairie basée sur les commandes. Bien que cette documentation ait été préservée pour aider les équipes qui ne l'ont pas encore fait, les équipes sont fortement encouragées à migrer vers la :ref:`nouvelle librairie orientée commandes <docs/software/commandbased/index:Command-Based Programming>`.
tr_tr: Bu belge, eski komut tabanlı kitaplığın kullanımını açıklar. Bu belgeler henüz bunu yapmamış takımlara yardımcı olmak için korunmuş olsa da, ekiplerin :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`. 'e geçmeleri şiddetle tavsiye edilir.

source: Limit switches are often used to control mechanisms on robots. While limit switches are simple to use, they only can sense a single position of a moving part. This makes them ideal for ensuring that movement doesn't exceed some limit but not so good at controlling the speed of the movement as it approaches the limit. For example, a rotational shoulder joint on a robot arm would best be controlled using a potentiometer or an absolute encoder, the limit switch could make sure that if the potentiometer ever failed, the limit switch would stop the robot from going to far and causing damage.
es_mx: Los interruptores de Límite normalmente son usados para controlar el mecanismo de los robot. Mientras que los interruptores de Límite son fáciles de usar estos sólo pueden tener sentido a una simple posición para mover una parte. Este los vuelve ideales para asegurar que el movimiento no exceda algún límite pero no tan buenos al controlar la velocidad de algo en movimiento aproximado al límite. Ejemplo en el brazo del robot el hombro rotador será mejor controlado usando un potencializador o un codificador absoluto el interruptor de Límite puede puede asegurar que si él potencializador llega a fallar el interruptor de Límite detendrá al robot de ir más allá y causar algún daño
fr_ca: Les interrupteurs de fin de course sont souvent utilisés pour contrôler les mécanismes des robots. Bien que les interrupteurs de fin de course soient simples à utiliser, ils ne peuvent détecter qu'une seule position d'une pièce mobile. Cela les rend parfaits pour s'assurer que le mouvement ne dépasse pas une certaine limite, mais pas si idéal pour contrôler la vitesse du mouvement à mesure qu'il s'approche de la limite. Par exemple, un bras articulé de robot serait mieux contrôlé à l'aide d'un potentiomètre ou d'un encodeur, par contre, l'interrupteur de fin de course pourrait garantir qu'en cas de panne du potentiomètre, l'interrupteur de fin de course empêcherait le robot d'aller trop loin et de causer des dommages. .
tr_tr: Limit anahtarları genellikle robotlardaki mekanizmaları kontrol etmek için kullanılır. Limit anahtarlarının kullanımı basit olsa da, hareketli bir parçanın yalnızca tek bir konumunu algılayabilirler. Bu, hareketin bir sınırı aşmamasını sağlamak için onları ideal kılar, ancak sınıra yaklaştıkça hareketin hızını kontrol etmede çok iyi değildir. Örneğin, bir robot kolundaki bir rotasyonel omuz eklemi, bir potansiyometre veya mutlak bir kodlayıcı kullanılarak en iyi şekilde kontrol edilir; limit anahtarı, potansiyometre başarısız olursa, limit anahtarının robotun uzağa gitmesini ve hasara neden olmasını durdurmasını sağlayabilir. .

source: Values Provided
es_mx: Valores proporcionados
fr_ca: Valeurs fournies
tr_tr: Sağlanan Değerler

source: Limit switches can have "normally opened" or "normally closed" outputs. The usual way of wiring the switch is between a digital input signal connection and ground. The digital input has pull-up resistors that will make the input be high (1 value) when the switch is open, but when the switch closes the value goes to 0 since the input is now connected to ground. The switch shown here has both normally open and normally closed outputs.
es_mx: Los interruptores de límite pueden tener salidas "normalmente abiertas" o "normalmente cerradas". La forma habitual del cableado del interruptor está entre una conexión de señal de entrada digital y tierra. La entrada digital tiene resistencias a levantarse que harán que la entrada sea alta (1 valor) cuando el interruptor esté abierto, pero cuando el interruptor se cierra, el valor va a 0 ya que la entrada ahora está conectada a tierra. El interruptor que se muestra aquí tiene salidas normalmente abiertas y normalmente cerradas.
fr_ca: Les interrupteurs de fin de course peuvent avoir des sorties «normalement ouvertes» ou «normalement fermées». La manière habituelle de câbler le commutateur est d'utiliser une connexion de signal d'entrée numérique et la masse. L'entrée numérique a des résistances de rappel qui rendront l'entrée haute (1 valeur) lorsque l'interrupteur est ouvert, mais lorsque qu'il se ferme, la valeur passe à 0 puisque l'entrée est maintenant connectée à la masse. L'interrupteur illustré ici a des sorties normalement ouvertes et normalement fermées.
tr_tr: Limit anahtarları "normalde açık" veya "normalde kapalı" çıkışlara sahip olabilir. Anahtarı kablolamanın olağan yolu, dijital giriş sinyali bağlantısı ile toprak arasındadır. Dijital giriş, anahtar açıkken girişi yüksek (1 değeri) yapacak olan çekme dirençlerine sahiptir, ancak anahtar kapandığında giriş artık toprağa bağlı olduğundan değer 0'a gider. Burada gösterilen anahtarın hem normalde açık hem de normalde kapalı çıkışları vardır.

source: Polling - Waiting for a Switch to Close
es_mx: Encuestar - en espera de un cambio para cerrar
fr_ca: Interrogation - En attente de la fermeture d'un interrupteur
tr_tr: Polling - Anahtarın Kapatılması Bekleniyor

source: You can write a very simple piece of code that just reads the limit switch over and over again waiting until it detects that its value transitions from 1 (opened) to 0 (closed). While this works, it's usually impractical for the program to be able to just wait for the switch to operate and not be doing anything else, like responding to joystick input. This example shows the fundamental use of the switch, but while the program is waiting, nothing else is happening.
es_mx: Puede escribir un código muy simple que solo lea el interruptor de límite una y otra vez esperando hasta que detecte que su valor pasa de 1 (abierto) a 0 (cerrado). Mientras esto funciona, por lo general no es práctico que el programa pueda esperar a que el switch funcione y no estar haciendo nada más, cómo responder a la entrada del joystick. Este ejemplo muestra el uso fundamental del interruptor, pero mientras el programa está esperando, no sucede nada más.
fr_ca: Vous pouvez écrire un bout de code très simple qui lit simplement l'interrupteur de fin de course encore et encore en attendant qu'il détecte que sa valeur passe de 1 (ouvert) à 0 (fermé). Bien que cela fonctionne, il est généralement peu pratique pour un programme d'attendre simplement que l'interrupteur fonctionne et de ne rien faire d'autre, comme répondre à une entrée de joystick. Cet exemple montre l'utilisation fondamentale d'un interrupteur, mais pendant que le programme attend, rien d'autre ne se passe.
tr_tr: Limit anahtarını tekrar tekrar okuyan ve değerinin 1'den (açık) 0'a (kapalı) geçtiğini algılayana kadar bekleyen çok basit bir kod parçası yazabilirsiniz. Bu işe yararken, programın sadece anahtarın çalışmasını beklemesi ve joystick girdisine yanıt vermek gibi başka bir şey yapmaması genellikle pratik değildir. Bu örnek, anahtarın temel kullanımını gösterir, ancak program beklerken başka hiçbir şey olmamaktadır.

source: Operating until Limit Closed
es_mx: Operando hasta el límite cerrado
fr_ca: Fonctionnement jusqu'à la fermeture de la limite
tr_tr: Limit Kapanana Kadar Çalışıyor

source: Commands call their ``execute()`` and ``isFinished()`` methods about 50 times per second, or at a rate of every 20ms. A command that will operate a motor until the limit switch is closed can read the digital input value in the ``isFinished()`` method and return true when the switch changes to the correct state. Then the command can stop the motor.
es_mx: Los comandos llaman a sus métodos ``execute()`` y el ``isFinished()`` unas 50 veces por segundo, o a una velocidad de cada 20 ms. Un comando operará un motor hasta que se cierre el interruptor de límite, puede leer el valor de entrada digital en el método ``isFinished()`` y devolver a verdadero cuando el interruptor cambia al estado correcto. Entonces el comando puede detener el motor.
fr_ca: Les commandes appellent leurs méthodes ``execute()`` et ``isFinished()`` environ 50 fois par seconde, ou à une fréquence de 20 mSec. Une commande qui fera fonctionner un moteur jusqu'à ce que l'interrupteur de fin de course soit fermé peut lire la valeur d'entrée numérique dans la méthode ``isFinished()`` et retourner l'état "True" lorsque l'interrupteur passe à l'état correct. Ensuite, la commande peut arrêter le moteur.
tr_tr: Komutlar ``execute()`` ve ``isFinished()`` yöntemlerini saniyede yaklaşık 50 kez veya her 20 ms hızında çağırır. Limit anahtarı kapanana kadar motoru çalıştıracak bir komut, ``isFinished()`` yöntemindeki dijital giriş değerini okuyabilir ve anahtar doğru duruma geçtiğinde true değerini döndürebilir. Ardından komut motoru durdurabilir.

source: Remember, the mechanism (an Arm in this case) has some inertia and won't stop immediately so it's important to make sure things don't break while the arm is slowing.
es_mx: Importante: Recuerde, el mecanismo (un Brazo en este caso) tiene algo de inercia y no podra detenerse de inmediato, así que es importante asegurarse de que las cosas no se rompan mientras el brazo se desacelera
fr_ca: Rappelez-vous que le mécanisme (un bras articulé dans ce cas) a une certaine inertie et ne s'arrêtera pas immédiatement, il est donc important de s'assurer que les choses ne se brisent pas pendant que le bras ralentit.
tr_tr: Unutmayın, mekanizmanın (bu durumda bir Kol) bir miktar ataleti vardır ve hemen durmaz, bu nedenle kol yavaşlarken eşyaların kırılmamasını sağlamak önemlidir.

source: Counter to detect Switch Close
es_mx: Contador para detectar el Switch Close
fr_ca: Compteur pour détecter "Switch Close"
tr_tr: Kapat Anahtarını algılamak için sayaç

source: It's possible that a limit switch might close then open again as a mechanism moves past the switch. If the closure is fast enough the program might not notice that the switch closed. An alternative method of catching the switch closing is use a Counter object. Since counters are implemented in hardware, it will be able to capture the closing of the fastest switches and increment it's count. Then the program can simply notice that the count has increased and take whatever steps are needed to do the operation.
es_mx: Es posible que un interruptor de límite se cierre y luego se abra nuevamente a medida que un mecanismo pasa del switch. Si el cierre es lo suficientemente rápido, el programa podría no notar que el interruptor se cerró. Un método alternativo para atrapar el cierre del interruptor es usar un objeto Counter. Como los counters son implementados en hardware, podrá capturar el cierre de los interruptores más rápidos y el incremento cuenta. Entonces el programa simplemente puede notar que la cuenta ha aumentado y tome los pasos necesarios para realizar la operación. Arriba hay un subsistema que usa un counter para mirar el interruptor de límite y esperar a que el valor cambie. Cuando lo hace, el counter se incrementará y eso se puede ver en un comando.
fr_ca: Il est possible qu'un interrupteur de fin de course se ferme puis s'ouvre à nouveau lorsqu'un mécanisme passe devant l'interrupteur. Si la fermeture est assez rapide, le programme peut ne pas remarquer que l'interrupteur est fermé. Pour remédier à cela, une autre méthode pour saisir la fermeture de l'interrupteur consiste à utiliser un objet Counter. Puisque les compteurs sont implémentés dans l'électronique du roboRIO, il seront en mesure de capturer la petite impulsion de fermeture issue de l'interrupteur et d'incrémenter le compte. Ensuite, le programme peut simplement remarquer que le compte a augmenté et prendre toutes les mesures nécessaires pour effectuer l'opération.
tr_tr: Bir mekanizma anahtarın yanından geçerken bir limit anahtarının kapanıp sonra tekrar açılması mümkündür. Kapatma yeterince hızlıysa, program anahtarın kapandığını fark etmeyebilir. Anahtarın kapanmasını yakalamanın alternatif bir yöntemi, bir counter nesnesi kullanmaktır. Sayaçlar donanımda uygulandığından, en hızlı anahtarların kapanmasını yakalayabilecek ve sayısını artırabilecektir. Daha sonra program sayının arttığını fark edebilir ve işlemi yapmak için gereken adımları atabilir.

source: Above is a subsystem that uses a counter to watch the limit switch and wait for the value to change. When it does, the counter will increment and that can be watched in a command.
es_mx: Arriba hay un subsistema que usa un contador para observar el interruptor de límite y esperar a que cambie el valor. Cuando lo hace, el contador se incrementará y eso se puede ver en un comando.
fr_ca: Ci-dessus, un sous-système qui utilise un compteur pour surveiller l'interrupteur de fin de course et attendre que la valeur change. Quand c'est le cas, le compteur s'incrémentera et cela peut être observé dans une commande.
tr_tr: Yukarıda, limit anahtarını izlemek için bir sayaç kullanan ve değerin değişmesini bekleyen bir alt sistem var. Sayaç arttığında artar ve bu bir komutla izlenebilir.

source: Using a Command with a Counter to detect Limit Switch Close
es_mx: Uso de un comando con un contador para detectar el interruptor de límite Cerrado
fr_ca: Utilisation d'une commande avec un compteur pour détecter la fermeture de l'interrupteur de fin de course
tr_tr: Limit Switch Close'u algılamak için Sayaçlı bir Komut Kullanma

source: This command initializes the counter in the above subsystem then starts the motor moving. It then tests the counter value in the isFinished() method waiting for it to count the limit switch changing. When it does, the arm is stopped. By using a hardware counter, a switch that might close then open very quickly can still be caught by the program.
es_mx: Este comando inicializa el contador en el subsistema anterior y luego inicia el movimiento del motor. Luego prueba el valor del contador en el método isFinished() esperando que cuente el interruptor de límite cambiando. Cuando lo hace, el brazo se detiene. Al usar un contador de hardware, un interruptor que podría cerrar y abrir muy rápido aún puede ser detectado por el programa.
fr_ca: Cette commande initialise le compteur dans le sous-système ci-dessus puis démarre le moteur en mouvement. Elle teste ensuite la valeur du compteur dans la méthode isFinished() en attendant qu'elle remarque le changement de compte, qui indique la fin de course. Quand c'est le cas, le bras est arrêté. En utilisant un compteur intégré dans le roboRIO, un interrupteur qui pourrait se fermer puis s'ouvrir très rapidement peut toujours être intercepté par le programme.
tr_tr: Bu komut, yukarıdaki alt sistemdeki sayacı başlatır ve ardından motorun hareketini başlatır. Daha sonra, limit anahtarı değişimini saymasını beklerken isFinished() yöntemindeki sayaç değerini test eder. Olduğunda kol durdurulur. Bir donanım sayacı kullanılarak, kapanıp çok hızlı açılabilen bir anahtar yazılım tarafından yine de yakalanabilir.
