Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/old-commandbased/commands/running-commands-joystick-input.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Running Commands on Joystick Input
es_mx: Ejecución de comandos en la entrada del joystick
fr_ca: Exécution des commandes sur l’entrée Joystick
tr_tr: Kumanda Kolu Girişiyle Komut Çalıştırma
zh_cn: 随着操纵杆输入运行指令

source: This documentation describes the use of the legacy command-based library. While this documentation has been preserved to help teams that have yet to do so, teams are strongly encouraged to migrate to the :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
es_mx: Esta documentación describe el uso de la biblioteca dejada basada en comandos. Si bien esta documentación se ha conservado para ayudar a los equipos que aún no lo han hecho, se recomienda encarecidamente a los equipos que migren a la nueva biblioteca basada en comandos.
fr_ca: Cette documentation décrit l’utilisation de la bibliothèque patrimoniale orientée commande. Bien que cette documentation ait été conservée pour aider les équipes qui ne l’ont pas encore fait, les équipes sont fortement encouragées à migrer vers la :ref:`nouvelle bibliothèque orientée commande <docs/software/commandbased/index:Command-Based Programming>`.
tr_tr: Bu belge, eski komut tabanlı kitaplığın kullanımını açıklar. Bu belgeler henüz bunu yapmamış takımlara yardımcı olmak için korunmuş olsa da, ekiplerin :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`. 'e geçmeleri şiddetle tavsiye edilir.
zh_cn: 本文档描述了旧式基于指令的库的用法。尽管保留了该文档以帮助尚未这样做的团队，但强烈建议团队迁移到新的基于指令的库<docs/software/commandbased/index:Command-Based Programming>。

source: You can cause commands to run when joystick buttons are pressed, released, or continuously while the button is held down. This is extremely easy to do only requiring a few lines of code.
es_mx: Puede hacer que se ejecuten comandos cuando se presionan, sueltan o continuamente los botones del joystick mientras se mantiene presionado el botón. Esto es extremadamente fácil de hacer, solo requiere unas pocas líneas de código.
fr_ca: Vous pouvez provoquer l’exécution des commandes lorsque les boutons joystick sont appuyés, libérés ou en continu pendant que le bouton est maintenu en foncé. C’est extrêmement facile à faire, seulement quelques lignes de code sont nécessaires.
tr_tr: Komutların kumanda kolu düğmelerine basıldığında, bırakıldığında veya düğme basılıyken sürekli olarak çalışmasına neden olabilirsiniz. Bu, yalnızca birkaç satır kod gerektiren son derece kolaydır.
zh_cn: 你可以在按下、释放或者连续按住操纵杆按钮时使指令运行。这仅需几行代码就能非常容易地做到。

source: The OI Class
es_mx: La clase OI
fr_ca: La classe OI
tr_tr: OI Sınıfı
zh_cn: OI类

source: The command based template contains a class called OI, located in ``OI.java``, where **Operator Interface** behaviors are typically defined.
es_mx: La plantilla basada en comandos contiene una clase llamada OI, ubicada en OI.java, donde los comportamientos de la interfaz del operador se definen típicamente.
fr_ca: Le modèle orienté commande contient une classe appelée OI, localisée dans le fichier ``OI.java`` où les comportements **Operator Interface** sont généralement définis.
tr_tr: Komut tabanlı şablon, **Operatör Arayüzü** davranışlarının tipik olarak tanımlandığı ``OI.java`` içinde bulunan OI adlı bir sınıf içerir.
zh_cn: 基于指令的模板包含一个名为OI的类，位于OI.java中，通常在其中定义** Operator Interface **行为。

source: Create the Joystick object and JoystickButton Objects
es_mx: Crear el objeto Joystick y los objetos JoystickButton
fr_ca: Créer l’objet Joystick et des objets joystickButton
tr_tr: Joystick nesnesini ve JoystickButton Nesnelerini oluşturma
zh_cn: 创建Joystick对象和JoystickButton对象

source: In this example there is a Joystick object connected as Joystick 0. Then 8 buttons are defined on that joystick to control various aspects of the robot. This is especially useful for testing although generating buttons on SmartDashboard is another alternative for testing commands.
es_mx: En este ejemplo, hay un objeto Joystick conectado como Joystick 0. Luego, se definen 8 botones en ese joystick para controlar varios aspectos del robot. Esto es especialmente útil para las pruebas, aunque los botones generadores de SmartDashboard abordan otros comandos alternativos para comandos de prueba.
fr_ca: Dans cet exemple, il y a un objet Joystick connecté sous le nom de Joystick0. Ensuite, 8 boutons sont définis sur ce joystick pour contrôler divers aspects du robot. Ceci est particulièrement utile pour les tests, bien que la génération de boutons sur SmartDashboard soit une autre alternative pour tester les commandes.
tr_tr: Bu örnekte, Joystick 0 olarak bağlı bir Joystick nesnesi vardır. Ardından, robotun çeşitli yönlerini kontrol etmek için bu joystick üzerinde 8 düğme tanımlanmıştır. SmartDashboard'da düğme oluşturmak, komutları test etmek için başka bir alternatif olsa da, bu özellikle test etmek için kullanışlıdır.
zh_cn: 在此示例中，有一个连接为操纵杆0的操纵杆对象。然后在该操纵杆上定义了8个按钮，以控制机器人的各个方面。这对测试特别有用，即使在SmartDashboard上生成按钮是测试指令的另一种方法。

source: Associate the Buttons with Commands
es_mx: Asociar Botones con comandos
fr_ca: Associer les boutons aux commandes
tr_tr: Düğmeleri Komutlarla İlişkilendirin
zh_cn: 将按钮与指令关联

source: In this example most of the joystick buttons from the previous code fragment are associated with commands. When the associated button is pressed the command is run. This is an excellent way to create a teleop program that has buttons to do particular actions.
es_mx: En este ejemplo, la mayoría de los botones de joystick del fragmento de código anterior están asociados con comandos. Cuando se presiona el botón asociado, se ejecuta el comando. Esta es una excelente manera de crear un programa de teleoperación que tenga botones para realizar acciones particulares.
fr_ca: Dans cet exemple, la plupart des boutons joystick du fragment de code précédent sont associés à des commandes. Lorsque le bouton associé est appuyé, la commande est exécutée. C’est une excellente façon de créer un programme de téléop qui a des boutons pour faire des actions particulières.
tr_tr: Bu örnekte, önceki kod parçasındaki oyun çubuğu düğmelerinin çoğu komutlarla ilişkilendirilmiştir. İlişkili düğmeye basıldığında komut çalıştırılır. Bu, belirli eylemleri yapmak için düğmeleri olan bir teleop programı oluşturmanın mükemmel bir yoludur.
zh_cn: 在此示例中，前一个代码片段中的大多数操纵杆按钮都与指令相关联。当按下相关按钮时，指令将运行。这是创建按下按钮时执行特定操作的操控程序的绝佳方法。

source: Other Options
es_mx: Otras opciones
fr_ca: Autres options
tr_tr: Diğer seçenekler
zh_cn: 其他选择

source: In addition to the ``whenPressed()`` condition showcased above, there are a few other conditions you can use to link buttons to commands:
es_mx: Además de la condición whenPressed () mostrada anteriormente, hay algunas otras condiciones que puede usar para vincular botones a comandos:
fr_ca: En plus de la condition ``whenPressed()`` présentée ci-dessus, il y a quelques autres conditions que vous pouvez utiliser pour lier des boutons à des commandes :
tr_tr: Yukarıda gösterilen ``whenPressed()`` durumuna ek olarak, düğmeleri komutlara bağlamak için kullanabileceğiniz birkaç başka koşul vardır:
zh_cn: 除了上面显示的“ whenPressed（）”条件外，还有一些其他条件可用于将按钮链接到指令：

source: Commands can run when a button is released by using ``whenReleased()`` instead of ``whenPressed()``.
es_mx: Los comandos pueden ejecutarse cuando se suelta un botón usando ``whenReleased()`` en lugar de ``whenPressed()``.
fr_ca: Les commandes peuvent s’exécuter lorsqu’un bouton est libéré à l’aide de ``whenReleased()`` au lieu de ``whenPressed()``.
tr_tr: Komutlar, ``whenPressed()`` yerine ``whenReleased()`` kullanılarak bir düğme bırakıldığında çalışabilir.
zh_cn: 当使用“ whenReleased（）”而不是“ whenPressed（）”释放按钮时，可以运行指令。

source: Commands can run continuously while the button is depressed by calling ``whileHeld()``.
es_mx: Los comandos pueden ejecutarse continuamente mientras se presiona el botón al llamar a ``whileHeld()``.
fr_ca: Les commandes peuvent s’exécuter en continu pendant que le bouton est appuyé en appelant ``whileHeld()``.
tr_tr: Komutlar, düğmeye basılıyken ``whileHeld()`` çağrısı yapılarak sürekli olarak çalışabilir.
zh_cn: 通过调用``whileHeld（）''，可以在按下按钮时连续运行指令。

source: Commands can be toggled when a button is pressed using ``toggleWhenPressed()``.
es_mx: Los comandos se pueden alternar cuando se presiona un botón usando ``toggleWhenPressed()``.
fr_ca: Les commandes peuvent être basculées lorsqu’un bouton est appuyé à l’aide de ``toggleWhenPressed()``.
tr_tr: ``ToggleWhenPressed()`` kullanılarak bir düğmeye basıldığında komutlar değiştirilebilir.
zh_cn: 使用toggleWhenPressed（）按下按钮时可以切换指令。

source: A command can be canceled when a button is pressed using ``cancelWhenPressed()``.
es_mx: Un comando se puede cancelar cuando se presiona un botón usando ``cancelWhenPressed()``.
fr_ca: Une commande peut être annulée lorsqu’un bouton est appuyé à l’aide de ``cancelWhenPressed()``.
tr_tr: ``CancelWhenPressed()`` kullanılarak bir düğmeye basıldığında bir komut iptal edilebilir.
zh_cn: 使用cancelWhenPressed（）按下按钮时可以取消指令。

source: Additionally commands can be triggered by arbitrary conditions of your choosing by using the Trigger class instead of Button. Triggers (and Buttons) are usually polled every 20ms or whenever the scheduler is called.
es_mx: Además, los comandos pueden ser activados por condiciones arbitrarias de su elección utilizando la clase Trigger en lugar de Button. Los disparadores (y botones) generalmente se sondean cada 20 ms o cada vez que se llama al planificador.
fr_ca: Additionnellement, les commandes peuvent être déclenchées par des conditions arbitraires de votre choix en utilisant la classe Trigger au lieu de Button. Les déclencheurs (et les boutons) sont généralement scrutés tous les 20 ms ou chaque fois que le planificateur est appelé.
tr_tr: Ayrıca, Button yerine Trigger sınıfını kullanarak seçtiğiniz keyfi koşullar tarafından komutlar tetiklenebilir. Tetikleyiciler (ve Düğmeler) genellikle her 20 ms'de bir veya scheduler her çağrıldığında sorgulanır.
zh_cn: 另外，可以通过使用Trigger类而不是Button类在任何你选择的条件下触发指令。Trigger（和Button）通常每20毫秒或每当调度程序被调用时进行条件检测。
