Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/old-commandbased/commands/running-commands-autonomous.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Running Commands during Autonomous
es_mx: Ejecución de comandos durante el autónomo.
fr_ca: Exécution des commandes pendant le mode Autonome
tr_tr: Otonom sırasında Komutları Çalıştırma
zh_cn: 自动阶段运行指令

source: This documentation describes the use of the legacy command-based library. While this documentation has been preserved to help teams that have yet to do so, teams are strongly encouraged to migrate to the :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
es_mx: Esta documentación describe el uso de la biblioteca dejada basada en comandos. Si bien esta documentación se ha conservado para ayudar a los equipos que aún no lo han hecho, se recomienda encarecidamente a los equipos que migren a la nueva biblioteca basada en comandos.
fr_ca: Cette documentation décrit l’utilisation de la bibliothèque patrimoniale orientée commande. Bien que cette documentation ait été conservée pour aider les équipes qui ne l’ont pas encore fait, les équipes sont fortement encouragées à migrer vers la :ref:`nouvelle bibiothèque orientée commande <docs/software/commandbased/index:Command-Based Programming>`.
tr_tr: Bu belge, eski komut tabanlı kitaplığın kullanımını açıklar. Bu belgeler henüz bunu yapmamış takımlara yardımcı olmak için korunmuş olsa da, ekiplerin :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`. 'e geçmeleri şiddetle tavsiye edilir.
zh_cn: 本文档描述了旧式基于指令的库的用法。尽管保留了该文档以帮助尚未这样做的团队，但强烈建议团队迁移到新的基于指令的库<docs/software/commandbased/index:Command-Based Programming>。

source: Once commands are defined they can run in either the teleop or autonomous part of the program. In fact, the power of the command based programming approach is that you can reuse the same commands in either place. If the robot has a command that can shoot Frisbees during autonomous with camera aiming and accurate shooting, there is no reason not to use it to help the drivers during the teleop period of the game.
es_mx: Una vez que se definen los comandos, pueden ejecutarse en la parte teleop o autónoma del programa. De hecho, el poder del enfoque de programación basado en comandos es que puede reutilizar los mismos comandos en cualquier lugar. Si el robot tiene un comando que puede disparar Frisbees durante el modo autónomo con el objetivo de la cámara y el disparo preciso, no hay razón para no usarlo para ayudar a los conductores durante el período teleoperado del juego.
fr_ca: Une fois les commandes définies, elles peuvent s’exécuter dans la partie teleop ou autonome du programme. En fait, la puissance de l’approche de programmation orientée commande est que vous pouvez réutiliser les mêmes commandes à l’un ou l’autre endroit. Si le robot a une commande qui peut tirer des Frisbees pendant le mode autonome avec la caméra pour viser et avoir un tir précis, il n’y a aucune raison de ne pas l’utiliser pour aider les pilotes pendant le mode téléop du jeu.
tr_tr: Komutlar tanımlandıktan sonra, programın teleop veya otonom kısmında çalışabilirler. Aslında, komut tabanlı programlama yaklaşımının gücü, her iki yerde de aynı komutları yeniden kullanabilmenizdir. Robotun otonom olarak kamerayla nişan alarak ve isabetli atışla Frizbi vurabilecek bir komutu varsa, oyunun teleop döneminde sürücülere yardımcı olmak için kullanmaması için bir sebep yok.
zh_cn: 定义指令后，它们可以在程序的操控部分或自动部分中运行。实际上，基于指令的编程方法的强大之处在于，您可以在任何地方重用相同的指令。如果机器人具有可以在自动阶段中通过相机瞄准和精确射击来射击飞盘的指令，则完全可以在比赛的操控阶段使用它来帮助驾驶员。

source: Our robot must do the following tasks during the autonomous period: pick up a soda can off the floor then drive a set distance from a table and deliver the can there. The process consists of:
es_mx: Nuestro robot debe realizar las siguientes tareas durante el período autónomo: recoger una lata de refresco del piso, luego conducir una distancia establecida de una mesa y entregar la lata allí. El proceso consiste en:
fr_ca: Notre robot doit effectuer les tâches suivantes pendant le mode autonome : ramasser une canette de soda sur le sol, puis se déplacer d'une distance définie à partir d’une table et y livrer la boîte. Le processus consiste en :
tr_tr: Robotumuz, otonom dönem boyunca aşağıdaki görevleri yerine getirmelidir: yerden bir soda kutusu alıp, bir masadan belirli bir mesafeyi sürün ve kutuyu oraya teslim edin. Süreç şunlardan oluşur:
zh_cn: 我们的机器人在自主期内必须执行以下任务：从地板上捡起一个汽水罐，然后从桌子上开过一段固定的距离，并将汽水罐运到那里。该过程包括：

source: Prepare to grab (move elevator, wrist, and gripper into position)
es_mx: Prepárese para agarrar (mueva el elevador, la muñeca y la pinza a su posición)
fr_ca: Préparez-vous à saisir (mettre en position l’élevateur, le poignet et la pince )
tr_tr: Tutmaya hazırlanın (kaldırıcıyı, bileği ve tutucuyu yerine getirin)
zh_cn: 准备抓握（将升降机，腕部和抓手移动到位）

source: Grab the soda can
es_mx: Agarra la lata de refresco
fr_ca: Saisir la canette de soda
tr_tr: Grab the soda cadn - Soda kutusunu kap
zh_cn: 抓住汽水罐

source: Drive to a distance from the table indicated by an ultrasonic rangefinder
es_mx: Conduzca a una distancia de la mesa indicada por un telémetro ultrasónico
fr_ca: Se déplacer de la table d'une distance indiquée par un télémètre ultrasonique
tr_tr: Ultrasonik telemetre ile gösterilen tablodan belirli bir mesafeye sürün
zh_cn: 开车到超声波测距仪指示的桌子旁一定距离

source: Place the soda
es_mx: Coloca el refresco
fr_ca: Placer le soda
tr_tr: Sodayı yerleştirin
zh_cn: 放苏打水

source: Back off to a distance from the rangefinder
es_mx: Retroceda a una distancia del telémetro
fr_ca: Reculer à une distance du télémètre
tr_tr: Telemetreden uzak bir mesafeye geri git
zh_cn: 返回到测距仪一定距离外

source: Re-stow the gripper
es_mx: Vuelva a guardar la pinza
fr_ca: Ranger à nouveau la pince
tr_tr: Gripper-Kavrayıcıyı yeniden ayarlayın
zh_cn: 重新存放抓爪

source: To do these tasks there are 6 commands that are executed sequentially as shown in this example (note that some of these, such as PlaceSoda are other command groups).
es_mx: Para realizar estas tareas, hay 6 comandos que se ejecutan secuencialmente como se muestra en este ejemplo (tenga en cuenta que algunos de estos, como PlaceSoda, son otros grupos de comandos).
fr_ca: Pour effectuer ces tâches, il y a 6 commandes qui sont exécutées séquentiellement comme indiqué dans cet exemple (notez que certaines d’entre elles, telle que PlaceSoda, sont d’autres groupes de commandes).
tr_tr: Bu görevleri gerçekleştirmek için, bu örnekte gösterildiği gibi sırayla yürütülen 6 komut vardır (bunlardan bazılarının, örneğin PlaceSoda'nın diğer komut grupları olduğunu unutmayın).
zh_cn: 要执行这些任务，有6个指令按顺序执行，如本示例所示（请注意，其中一些指令（例如PlaceSoda）是其他指令组）。

source: Setting the Command to Run during Autonomous
es_mx: Configurar el comando para ejecutarse durante el autónomo
fr_ca: Définition de la commande à exécuter pendant le mode autonome
tr_tr: Otonom sırasında Komutu Çalıştırmak için Ayarlama
zh_cn: 将指令设置为在自动阶段运行

source: To get the SodaDelivery command to run as the Autonomous program,
es_mx: Para que el comando SodaDelivery se ejecute como programa autónomo,
fr_ca: Pour que la commande SodaDelivery fonctionne comme le programme autonome,
tr_tr: SodaDelivery komutunun Otonom program olarak çalışmasını sağlamak için,
zh_cn: 要使SodaDelivery指令作为自动程序运行，

source: Instantiate it in the ``RobotInit()`` method. ``RobotInit()`` is called only once when the robot starts so it is a good time to create the command instance.
es_mx: Ejecútelo en el método ``RobotInit()``. ``RobotInit()`` se llama solo una vez cuando se inicia el robot, por lo que es un buen momento para crear la instancia de comando.
fr_ca: Instanciez-la dans la méthode ``RobotInit()``. ``RobotInit()`` n’est appelée qu’une seule fois lorsque le robot démarre, c’est donc le bon moment pour créer l’instance de commande.
tr_tr: Bunu `` RobotInit () '' yönteminde örnekleyin. `` RobotInit () ``, robot başladığında yalnızca bir kez çağrılır, bu nedenle komut örneğini oluşturmak için iyi bir zamandır.
zh_cn: 用RobotInit（）方法将它实例化。机器人启动时，只会调用一次“ RobotInit（）”，因此现在是创建指令实例的好时机。

source: Start it during the ``AutonomousInit()`` method. ``AutonomousInit()`` is called once at the start of the autonomous period so we schedule the command there.
es_mx: Inicie durante el método ``AutonomousInit()``. ``AutonomousInit()`` se llama una vez al comienzo del período autónomo, por lo que programamos el comando allí.
fr_ca: Démarrez-le pendant la méthode ``AutonomousInit()``. ``AutonomousInit()`` est appelée une fois au début de la période autonome, donc nous y programmons la commande.
tr_tr: ``AutonomousInit()`` yöntemi sırasında başlatın. Otonom dönemin başlangıcında bir kez ``AutonomousInit()`` çağrılır, böylece komutu orada programlıyoruz.
zh_cn: 在AutonomousInit（）方法中启动它。 ``AutonomousInit（）''在自动周期开始时会被调用一次，因此我们在此计划该指令。

source: Be sure the scheduler is called repeatedly during the ``AutonomousPeriodic()`` method. ``AutonomousPeriodic()`` is called (nominally) every 20ms so that is a good time to run the scheduler which makes a pass through all the currently scheduled commands.
es_mx: Asegúrese de que se llame repetidamente al planificador durante el método ``AutonomousPeriodic()``. ``AutonomousPeriodic()`` se llama (nominalmente) cada 20 ms, por lo que es un buen momento para ejecutar el planificador que realiza un pase a través de todos los comandos programados actualmente.
fr_ca: Assurez-vous que le planificateur est appelé à plusieurs reprises pendant la méthode ``AutonomousPeriodic()``. ``AutonomousPeriodic()`` est appelée (nominalement) tous les 20ms, ce qui est un bon moment pour exécuter le planificateur qui défile à travers toutes les commandes actuellement planifiées.
tr_tr: Planlayıcının-schedular ``AutonomousPeriodic()`` yöntemi sırasında tekrar tekrar çağrıldığından emin olun. ``AutonomousPeriodic()`` her 20 ms'de bir (nominal olarak) çağrılır, bu nedenle, şu anda planlanan tüm komutlardan geçiş yapan zamanlayıcıyı çalıştırmak için iyi bir zamandır.
zh_cn: 确保在“ AutonomousPeriodic（）”方法期间重复调用调度程序。每20毫秒（名义上）会调用一次AutonomousPeriodic（），因此这是运行调度程序的好时机，该调度程序会传递所有当前计划的指令。
