Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/old-commandbased/commands/scheduling-commands.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: In the Pickup command shown in the example above, the command is finished when ``CloseClaw``, ``SetWristSetpoint``, and ``SetElevatorSetpoint`` all finish. It doesn't matter that some of the commands are sequential and some parallel.
es_mx: El comando Pickup mostrado en el ejemplo superior, el comando es terminado cuando todos los otros comandos ``CloseClaw``, ``SetWristSetpoint``, y ``SetElevatorSetpoint`` terminen . No importa que algunos de los comandos sean secuenciales y algunos paralelos.
fr_ca: Dans la commande Pickup indiquée dans l’exemple ci-dessus, la commande est terminée lorsque ``CloseClaw``, ``SetWristSetpoint``, et ``SetElevatorSetpoint`` tous se terminent. Il n’a pas d’importance que certaines des commandes soient séquentielles et certaines parallèles.
tr_tr: Yukarıdaki örnekte gösterilen Başlatma komutunda, ```CloseClaw``, ``SetWristSetpoint``, ve ``SetElevatorSetpoint`` tamamlandığında komut tamamlanmış olur. Komutların bazılarının sıralı ve bazılarının paralel olması önemli değil.
zh_cn: 在上面示例中显示的Pickup指令中，当CloseClaw，SetWristSetpoint和SetElevatorSetpoint都完成时，该指令完成。某些指令是顺序的，而某些指令是并行的，这并不重要。

source: Schedule a Command within a Running Command
es_mx: Programar un Comando dentro un comando en funcionamiento
fr_ca: Planifier une commande au sein d’une commande en cours d’exécution
tr_tr: Çalışan Komut İçinde Bir Komut Planlayın
zh_cn: 在正在运行的指令中安排指令

source: Commands can be scheduled by calling the ``start()`` method (Java) or ``Start()`` method (C++) on a command instance. This will cause the command to be added to the currently running set of commands in the scheduler. This is often useful when a program needs to conditionally schedule one command or another. The newly scheduled command will be added to a list of new commands on this pass through the run method of the scheduler and actually will run the first time on the next pass through the run method. Newly created commands are never executed in the same call to the scheduler run method, always queued for the next call which usually occurs 20ms later.
es_mx: Los comandos pueden ser programados al llamar el método ``start()``(Java) o ``Start()``(C++) en una instancia de comandos. Esto puede causar que el comando sea añadido a el conjunto de comandos en funcionamiento en el programa. Esto resulta útil cuando un programa necesita programar un comando u otro condicionalmente. El nuevo comando programado será agregado a una lista de nuevos comandos en este paso a través del método run del programa y en realidad ejecutará la primera vez en el siguiente paso a través del método run. Comandos creados recientemente nunca son ejecutados por el mismo llamado al método run del programa , siempre son enlistados para la siguiente llamada la cual normalmente ocurre 20ms más tarde.
fr_ca: Les commandes peuvent être planifiées en appelant la méthode ``start()`` (Java) ou ``Start()`` (C++) sur une instance de commande. Cela entraînera l’ajout de la commande au jeu de commandes en cours d’exécution dans le planificateur. Ceci est souvent utile lorsqu’un programme doit, sous certaines conditions, planifier une commande ou une autre. La commande nouvellement planifiée sera ajoutée à une liste de nouvelles commandes sur ce passage de la méthode ``Scheduler.Run`` (C++) ou ``Scheduler.run`` (Java) du planificateur et s’exécutera en fait la première fois sur le passage suivant à travers la méthode ``Scheduler.Run`` (C++) ou ``Scheduler.run`` (Java) . Les commandes nouvellement créées ne sont jamais exécutées dans le même appel à la méthode ``Scheduler.Run`` (C++) ou ``Scheduler.run`` (Java) du planificateur mais toujours en file d’attente pour l’appel suivant qui se produit habituellement 20 ms plus tard.
tr_tr: Komutlar, bir komut örneğinde ``start()`` yöntemi (Java) veya ``Start()`` yöntemi (C ++) çağrılarak planlanabilir. Bu, komutun zamanlayıcıda o anda çalışan komut kümesine eklenmesine neden olacaktır. Bu, genellikle bir programın bir komutu veya diğerini koşullu olarak planlaması gerektiğinde kullanışlıdır. Yeni programlanan komut, bu geçişte zamanlayıcının çalıştırma yöntemiyle yeni komutların bir listesine eklenecek ve ilk kez çalıştırma yönteminden sonraki geçişte çalıştırılacaktır. Yeni oluşturulan komutlar, zamanlayıcı çalıştırma yöntemine yapılan aynı çağrıda asla yürütülmez, her zaman genellikle 20 ms sonra gerçekleşen bir sonraki çağrı için kuyruğa alınır.
zh_cn: 可以通过在指令实例上调用start（）方法（Java）或Start（）方法（C ++）来调度指令。这将导致指令被添加到调度程序中当前正在运行的指令集中。当程序需要有条件地调度一个或另一个指令时，这通常很有用。通过调度程序的run方法，新调度的指令将添加到新指令列表中，并且实际上将在下次通过run方法的第一次运行。新创建的指令永远不会在对调度程序run方法的同一调用中执行，而总是排队等待通常在20毫秒后发生的下一次调用。

source: Removing all Commands from the Scheduler
es_mx: Quitar todos los Comandos del Programa
fr_ca: Suppression de toutes les commandes du planificateur
tr_tr: Tüm Komutları Zamanlayıcıdan Kaldırma
zh_cn: 从调度程序中删除所有指令

source: It is occasionally useful to make sure that there are no running commands in the scheduler. To remove all running commands use the ``Scheduler.removeAll()`` method (Java) or ``Scheduler::RemoveAll()`` method (C++). This will cause all currently running to have their ``interrupted()`` method (Java) or ``Interrupted()`` method (C++) called. Commands that have not yet started will have their ``end()`` method (Java) or ``End()`` method (C++) called.
es_mx: Ocasionalmente es útil asegurarse que no hay comandos en funcionamiento en el programa. Para quitar todos los programas en funcionamiento use el método ``Scheduler.removeAll()`` (Java) o ``Scheduler::RemoveAll()`` (C++). Esto causara que todos los comandos que estén en funcionamiento tengan sus métodos ``interrupted()`` (Java) o ``Interrupted()`` (C++) llamados.Los comandos que no han iniciado van a tener el método ``end()`` (Java) o ``End()`` (C++) llamado.
fr_ca: Il est parfois utile de s’assurer qu’il n’y a pas de commandes en cours d’exécution dans le planificateur. Pour supprimer toutes les commandes en cours d’exécution, utilisez la méthode ``Scheduler.removeAll()`` (Java) ou ``Scheduler::RemoveAll()`` (C++). Ce qui fera en sorte que toutes les méthodes actuellement en cours d’exécution verront leur méthode ``interrupted()`` (Java) ou``Interrupted()``(C++) appelée. Les commandes qui n’ont pas encore démarrées auront leur méthode ``end()`` (Java) ou ``End()`` (C++) appelée.
tr_tr: Zamanlayıcıda çalışan komutların olmadığından emin olmak bazen yararlıdır. Çalışan tüm komutları kaldırmak için ``Scheduler.removeAll()`` yöntemini (Java) veya ``Scheduler::RemoveAll()`` yöntemini (C ++) kullanın. Bu, şu anda çalışan tüm çalışanların ``interrupted()`` yönteminin (Java) veya ``Interrupted()`` yönteminin (C ++) çağrılmasına neden olur. Henüz başlamamış komutların ``end()`` yöntemi (Java) veya ``End()`` yöntemi (C ++) çağrılır.
zh_cn: 确保调度程序中没有正在运行的指令有时会很有用。要删除所有正在运行的指令，请使用Scheduler.removeAll（）方法（Java）或Scheduler :: RemoveAll（）方法（C ++）。这将导致当前正在运行的所有程序都调用其Interrupted（）方法（Java）或Interrupted（）方法（C ++）。尚未启动的指令将调用其end（）方法（Java）或End（）方法（C ++）。

source: The "requires" method
es_mx: El método "requires"
fr_ca: La méthode ``requires()``
tr_tr: "requires" yöntemi
zh_cn: “需要”方法

source: If you have multiple commands that use the same subsystem it makes sense that they don't run at the same time. For example, if there is a Claw subsystem with OpenClaw and CloseClaw commands, they can't both run at the same time. Each command that uses the Claw subsystem declares that by 1 calling the ``requires()`` method (Java) or ``Requires()`` method (C++). When one of the commands is running, say from a joystick button press, and you try to run another command that also requires the Claw, the second one preempts the first one. Suppose that OpenClaw was running, and you press the button to run the CloseClaw command. The OpenClaw command is interrupted - 2 it's interrupted method is called on the next run cycle and the CloseClaw command is scheduled. If you think about it, this is almost always the desired behavior. If you pressed a button to start opening the claw and you change your mind and want to close it, it makes sense for the OpenClaw command to be stopped and the CloseClaw to be started.
es_mx: Si tiene varios comandos que usan el mismo subsistema, tiene sentido que no se ejecuten al mismo tiempo. Por ejemplo, si hay un subsistema Claw con comandos OpenClaw y CloseClaw, ambos no pueden ejecutarse al mismo tiempo. Cada comando que usa el subsistema Claw declara que 1 llamando al método ``requires()`` (Java) o al método ``Requieres()`` (C ++). Cuando uno de los comandos se está ejecutando, digamos desde la pulsación de un botón del joystick, e intentas ejecutar otro comando que también requiera el Claw, el segundo se adelanta al primero. Suponga que OpenClaw se estaba ejecutando y presiona el botón para ejecutar el comando CloseClaw. Se interrumpe el comando OpenClaw - 2 se llama al método interrumpido en el siguiente ciclo de ejecución y se programa el comando CloseClaw. Si lo piensa, este es casi siempre el comportamiento deseado. Si presionó un botón para comenzar a abrir la garra y cambia de opinión y desea cerrarla, tiene sentido que se detenga el comando OpenClaw y se inicie CloseClaw.
fr_ca: Si vous avez plusieurs commandes qui utilisent le même sous-système, il est logique qu’elles ne s’exécutent pas en même temps. Par exemple, s’il existe un sous-système Claw avec des commandes OpenClaw et CloseClaw, elles ne peuvent pas tous deux s’exécuter en même temps. Chaque commande qui utilise le sous-système Claw déclare 1 qu’en appelant la méthode ``requires()`` (Java) ou ``Requires()`` (C++). Lorsque l’une des commandes est en cours d’exécution, par exemple à partir d’un bouton de joystick appuyé, et que vous essayez d’exécuter une autre commande qui nécessite également la pince, la seconde préempte la première. Supposons qu’OpenClaw soit en cours d’exécution et que vous appuyez sur le bouton pour exécuter la commande CloseClaw. La commande OpenClaw est interrompue - 2, la méthode ``interrupted()`` est appelée sur le cycle d’exécution suivant et la commande CloseClaw est planifiée. Si vous y réfléchissez, c’est presque toujours le comportement souhaité. Si vous avez appuyé sur un bouton pour commencer à ouvrir la pince, que vous changez d’avis et que vous voulez la fermer, il est logique que la commande OpenClaw soit arrêtée et que la commande CloseC soit démarrée.
tr_tr: Aynı alt sistemi kullanan birden fazla komutunuz varsa, aynı anda çalışmamaları mantıklıdır. Örneğin, OpenClaw ve CloseClaw komutlarına sahip bir Claw alt sistemi varsa, ikisi de aynı anda çalışamaz. Claw alt sistemini kullanan her komut, 1 tarafından ``require()`` yöntemini (Java) veya ``Requires()`` yöntemini (C ++) çağırarak bildirir. Komutlardan biri çalışırken, mesela bir joystick düğmesine basıldığında ve Pençe gerektiren başka bir komutu çalıştırmaya çalıştığınızda, ikincisi birincisini tercih eder. OpenClaw'ın çalıştığını ve CloseClaw komutunu çalıştırmak için düğmeye bastığınızı varsayalım. OpenClaw komutu kesintiye uğrar - 2 kesintiye uğrayan yöntem bir sonraki çalıştırma döngüsünde çağrılır ve CloseClaw komutu planlanır. Düşünürseniz, bu neredeyse her zaman istenen davranıştır. Pençeyi açmaya başlamak için bir düğmeye bastıysanız ve fikrinizi değiştirip kapatmak istiyorsanız, OpenClaw komutunun durdurulması ve CloseClaw'un başlatılması mantıklıdır.
zh_cn: 如果您有多个使用同一子系统的指令，则可以认为它们不能同时运行。例如，如果有一个带有OpenClaw和CloseClaw指令的Claw子系统，则它们不能同时运行。每个使用Claw子系统的指令都通过1调用requires（）方法（Java）或Requires（）方法（C ++）来声明。当其中一个指令正在运行时（例如，按下操纵杆按钮），而您尝试运行另一个也需要爪的指令，则第二个指令将抢占第一个指令。假设OpenClaw正在运行，然后按按钮以运行CloseClaw指令。 OpenClaw指令被中断-2它的中断方法在下一个运行周期被调用，并且CloseClaw指令被调度。如果您考虑一下，这几乎总是所需的行为。如果按下按钮开始打开爪子，并且改变主意并想要将其关闭，则可以停止OpenClaw指令并启动CloseClaw。

source: A command may require many subsystems, for example a complex autonomous sequence might use a number of subsystems to complete its task.
es_mx: Un comando puede requerir muchos subsistemas, por ejemplo, una secuencia de autónomo compleja puede usar un número de subsistemas para completar su tarea.
fr_ca: Une commande peut nécessiter de nombreux sous-systèmes, par exemple une séquence autonome complexe peut utiliser un certain nombre de sous-systèmes pour mener à bien sa tâche.
tr_tr: Bir komut birçok alt sistem gerektirebilir, örneğin karmaşık bir otonom sıra, görevini tamamlamak için bir dizi alt sistem kullanabilir.
zh_cn: 指令可能需要许多子系统，例如，复杂的自治序列可能会使用许多子系统来完成其任务。

source: Command groups automatically require all the subsystems for each of the commands in the group. There is no need to call the requires method for a group.
es_mx: Los grupos de comandos requieren automáticamente a todos los subsistemas para cada comando en el grupo. No hay necesidad para llamar el método requires para un grupo.
fr_ca: Les groupes de commande requièrent automatiquement tous les sous-systèmes pour chacune des commandes du groupe. Il n’est pas nécessaire d’appeler la méthode ``requires()`` pour un groupe.
tr_tr: Komut grupları, gruptaki komutların her biri için otomatik olarak tüm alt sistemleri gerektirir. Bir grup için gerekli yöntemi çağırmaya gerek yoktur.
zh_cn: 指令组自动需要该组中每个指令的所有子系统。无需为组调用require方法。

source: How are the requirements of a group evaluated?
es_mx: ¿Cómo son los requerimientos de un grupo evaluados?
fr_ca: Comment les exigences d’un groupe sont-elles évaluées?
tr_tr: Bir grubun gereksinimleri nasıl değerlendirilir?
zh_cn: 小组的要求如何评估？

source: The subsystems that a command group requires is the union of the set of subsystems that are required for all of the child commands. If a 4 commands are added to a group, then the group will require all of the subsystems required by each of the 4 commands in the group. For example, if are three commands scheduled in a group - the first requires subsystem A, the second requires subsystem B, and the third requires subsystems C and D. The group will require subsystems A, B, C, and D. If another command is started, say from a joystick button, that requires either A, B, C, or D it will interrupt the entire group including any parallel or sequential commands that might be running from that group.
es_mx: Los subsistemas que requiere un grupo de comandos es la unión del conjunto de subsistemas que se requieren para todos los comandos secundarios. Si se agregan 4 comandos a un grupo, entonces el grupo requerirá todos los subsistemas requeridos por cada uno de los 4 comandos del grupo. Por ejemplo, si hay tres comandos programados en un grupo: el primero requiere el subsistema A, el segundo requiere el subsistema B y el tercero requiere los subsistemas C y D. El grupo requerirá los subsistemas A, B, C y D. Si otro comando se inicia, digamos desde un botón de joystick, que requiere A, B, C o D, interrumpirá a todo el grupo, incluidos los comandos paralelos o secuenciales que puedan estar ejecutándose desde ese grupo.
fr_ca: Les sous-systèmes requis par un groupe de commandes sont l’union de l’ensemble de sous-systèmes requis pour toutes les commandes enfants. Si un 4 commandes sont ajoutées à un groupe, le groupe exigera tous les sous-systèmes requis par chacune des 4 commandes du groupe. Par exemple, si trois commandes sont planifiées dans un groupe - la première nécessite le sous-système A, la seconde nécessite le sous-système B et la troisième nécessite des sous-systèmes C et D. Le groupe aura besoin des sous-systèmes A, B, C et D. Si une autre commande est démarrée, par exemple à partir d’un bouton de joystick, qui nécessite A, B, C ou D, elle interrompra l’ensemble du groupe, y compris les commandes parallèles ou séquentielles qui pourraient être en cours d’exécution à partir de ce groupe.
tr_tr: Bir komut grubunun gerektirdiği alt sistemler, tüm alt komutlar için gerekli olan alt sistemler kümesinin birleşimidir. Bir gruba 4 komut eklenirse, grup, gruptaki 4 komutun her biri için gereken tüm alt sistemleri gerektirecektir. Örneğin, bir grupta planlanmış üç komut varsa - ilki alt sistem A'yı, ikincisi alt sistemi B'yi ve üçüncüsü alt sistemleri C ve D'yi gerektirir. Grup, A, B, C ve D alt sistemlerini gerektirir. Başka bir komut varsa A, B, C veya D gerektiren bir joystick düğmesinden başlatıldığında, bu gruptan çalıştırılabilecek herhangi bir paralel veya sıralı komut dahil olmak üzere tüm grubu kesecektir.
zh_cn: 指令组所需的子系统是所有子指令所需的子系统集合的并集。如果将4个指令添加到组中，则该组将需要该组中4个指令中的每一个都需要的所有子系统。例如，如果在一个组中调度了三个指令-第一个需要子系统A，第二个需要子系统B，第三个需要子系统C和D。该组将需要子系统A，B，C和D。从需要A，B，C或D的操纵杆按钮启动后，它将中断整个组，包括可能从该组运行的任何并行或顺序指令。
