Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/old-commandbased/commands/scheduling-commands.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Scheduling Commands
es_mx: Programar comandos
fr_ca: Planification des commandes
tr_tr: Komutları Planlama
zh_cn: 调度指令

source: This documentation describes the use of the legacy command-based library. While this documentation has been preserved to help teams that have yet to do so, teams are strongly encouraged to migrate to the :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
es_mx: Esta documentación describe el uso del legado de la biblioteca de programación basada en comandos. Mientras esta documentación ha sido preservada para ayudar a equipos que aún lo necesiten, los equipos son fuertemente alentados a avanzar a :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
fr_ca: Cette documentation décrit l’utilisation de la bibliothèque patrimoniale orientée commande. Bien que cette documentation ait été conservée pour aider les équipes qui ne l’ont pas encore fait, les équipes sont fortement encouragées à migrer vers la :ref:`nouvelle bibliothèque orientée commande <docs/software/commandbased/index:Command-Based Programming>`.
tr_tr: Bu belge, eski komut tabanlı kitaplığın kullanımını açıklar. Bu belgeler henüz bunu yapmamış takımlara yardımcı olmak için korunmuş olsa da, ekiplerin :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`. 'e geçmeleri şiddetle tavsiye edilir.
zh_cn: 本文档描述了旧式基于指令的库的用法。尽管保留了该文档以帮助尚未这样做的团队，但强烈建议团队迁移到新的基于指令的库<docs/software/commandbased/index:Command-Based Programming>。

source: Commands are scheduled to run based on a number of factors such as triggers, default commands when no other running commands require a subsystem, a prior command in a group finishes, button presses, autonomous period starting, etc. Although many commands may be running virtually at the same time, there is only a single thread (the main robot thread). This is to reduce the complexity of synchronization between threads. There are threads that run in the system for systems like PID loops, communications, etc. but those are all self contained with very little interaction requiring complex synchronization. This makes the system much more robust and predictable.
es_mx: Los comandos son programados para ejecutarse en base a un número de factores como cadenas, comandos predeterminados cuando ningún otro comando en funcionamiento requiere un subsistema, un comando principal en un grupo termina, un botón se presiona, el inicio del periodo autónomo, etc. A pesar de esto muchos comandos pueden estar funcionando virtualmente al mismo tiempo, solo hay un solo hilo (el hilo principal del robot). Esto es para reducir la complejidad de la sincronización entre hilos. Existen hilos que funcionan en el sistema para sistemas como bucles de PID, comunicaciones, etc, pero ellos son contenidos en si mismos con solo poca interacción requiriendo una sincronización compleja. Esto hace el sistema mucho más robusto y predecible.
fr_ca: Les commandes sont planifiées pour s’exécuter en fonction d’un certain nombre de facteurs tels que les déclencheurs, les commandes par défaut lorsqu’aucune autre commande en cours d’exécution ne nécessite un sous-système, une commande précedente qui se termine dans un groupe de commandes, des boutons de joystick qu'on appuie, le démarrage de modes autonomes, etc. Bien que de nombreuses commandes puissent être en cours d’exécution pratiquement en même temps, il n’y a qu’un seul fil d'exécution (le principal fil d'exécution du robot). Il s’agit de réduire la complexité de la synchronisation entre les fils d'exécution. Il y a des fils d'exécution qui s’exécutent dans le système pour des systèmes comme les boucles PID, les communications, etc, mais ceux-ci sont tous autonomes avec très peu d’interaction nécessitant une synchronisation complexe. Ce qui rend le système beaucoup plus robuste et prévisible.
tr_tr: Komutlar, tetikleyiciler, başka hiçbir çalışan komut bir alt sistem gerektirmediğinde varsayılan komutlar, bir gruptaki önceki bir komut tamamlandığında, düğmeye basılması, otonom dönem başlangıcı vb. Gibi bir dizi faktöre göre çalışacak şekilde programlanır. Ancak birçok komut sanal olarak çalışıyor olabilir. aynı zamanda sadece tek bir iş parçacığı (main robot tread -ana robot iş parçacığı) vardır. Bu, iş parçacıkları arasındaki senkronizasyonun karmaşıklığını azaltmak içindir. Sistemde PID döngüleri, iletişimler, vb. sistemler için çalışan iş parçacıkları vardır, ancak bunların tümü karmaşık senkronizasyon gerektiren çok az etkileşimle bağımsızdır. Bu, sistemi çok daha sağlam ve öngörülebilir hale getirir.
zh_cn: 计划根据多种因素来计划指令的运行，例如触发器，没有其他正在运行的指令需要子系统时的默认指令，组中的先前指令完成，按钮按下，自主周期启动等。尽管许多指令可能实际上正在运行同时，只有一个线程（机器人主线程）。这是为了减少线程之间同步的复杂性。系统中运行着一些线程，用于PID循环，通信等系统，但是这些线程都是自包含的，几乎没有交互，需要复杂的同步。这使系统更加健壮和可预测。

source: This is accomplished by a class called Scheduler. It has a ``run()`` method that is called periodically (typically every 20ms in response to a driver station update) that tries to make progress on every command that is currently running. This is done by calling the ``execute()`` method on the command followed by the ``isFinished()`` method. If ``isFinished()`` returns true, the command is marked to be removed from execution on the next pass through the scheduler. So if there are a number of commands all scheduled to run at the same time, then every time the ``Scheduler.run()`` method is called, each of the active commands execute() and ``isFinished()`` methods are called. This has the same effect as using multiple threads.
es_mx: Esto es logrado por la clase llamada Scheduler. Tiene un método ``run()`` que es llamado periódicamente (típicamente cada 20ms en respuesta a una actualización de la driver station) que intenta hacer un avance en cada comando que se esta ejecutando. Esto es hecho al llamar el método ``execute()`` seguido por el método ``isFinished()``. Si ``isFinished()`` devuelve un valor verdadero, el comando es marcado para ser removido de ejecutarse en su siguiente paso a través del programa. Entonces, si hay un número de comandos todos programados para ejecutarse al mismo tiempo, entonces cada vez que el método ``Scheduler.run()``, los métodos execute() and ``isFinished()`` de cada uno de los comandos activos son llamados. Esto tiene el mismo resultado que usar múltiples hilos.
fr_ca: Ceci est accompli par une classe appelée Scheduler. Il dispose d’une méthode ``run()`` qui est appelée périodiquement (généralement tous les 20ms en réponse à une mise à jour de la station de pilote) qui tente de faire des progrès sur chaque commande qui est actuellement en cours d’exécution. Pour ce faire, il s’agit d’appeler la méthode ``execute()`` sur la commande suivie de la méthode ``isFinished()``. Si ``isFinished()`` retourne TRUE, la commande est marquée pour être supprimée de l’exécution au passage suivant dans le planificateur. Ainsi, s’il y a un certain nombre de commandes toutes planifiées pour s’exécuter en même temps, ainsi à chaque fois que la méthode ``Scheduler.run()`` est appelée, les méthodes ``execute()`` et ``isFinished()`` de chacune des commandes sont appelées. Cela a le même effet que l’utilisation de plusieurs fils d'exécution.
tr_tr: Bu, Scheduler adlı bir sınıf tarafından gerçekleştirilir. Periyodik olarak çağrılan (tipik olarak bir sürücü istasyonu güncellemesine yanıt olarak her 20 ms'de bir), şu anda çalışan her komutta ilerleme kaydetmeye çalışan bir ``run()`` yöntemine sahiptir. Bu, komutta ``execute()`` yöntemini ve ardından ``isFinished()`` yöntemini çağırarak yapılır. ``İsFinished()`` true döndürürse, komut zamanlayıcıdan sonraki geçişte yürütmeden kaldırılmak üzere işaretlenir. Dolayısıyla, tümü aynı anda çalışmak üzere programlanmış birkaç komut varsa, ``Scheduler.run()`` yöntemi her çağrıldığında, etkin komutların her biri ``execute()`` ve ``isFinished ()`` çağrılır. Bu, birden çok iş parçacığı kullanmakla aynı etkiye sahiptir.
zh_cn: 这是通过称为Scheduler的类完成的。它有一个“ run（）”方法，该方法会定期调用（通常每20毫秒响应一次驱动程序站更新），该方法会尝试在当前正在运行的每个指令上取得进展。这是通过在指令上调用“ execute（）”方法，然后再调用“ isFinished（）”方法来完成的。如果isFinished（）返回true，则该指令被标记为在下一次通过调度程序时从执行中删除。因此，如果有多个指令都计划同时运行，那么每次调用Scheduler.run（）方法时，每个活动指令execute（）和isFinished（）方法被调用。这与使用多个线程具有相同的效果。

source: Command-Based Program Anatomy
es_mx: Estructura de un Programa a Base de Comandos
fr_ca: Anatomie d'un programme orienté commandes
tr_tr: Komut Tabanlı Program Anatomisi
zh_cn: 基于指令的程序剖析

source: This shows a typical command-based Robot program and all the code needed to ensure that commands are scheduled correctly. The ``Scheduler.run`` method causes one pass through the scheduler which will let each currently active command run through its ``execute()`` and ``isFinished()`` methods. Ignore the ``log()`` methods in the Java example.
es_mx: Esto muestra un típico programa del robot a base de comandos y todo el código necesario para asegurar que los comandos son programados correctamente. El método ``Scheduler.run`` provoca el paso a tráves de el programa el cual permitirá a cada comando activo ejecutarse a través de sus métodos ``execute()`` e ``isFinished()``. Ignore el método ``log()`` en el ejemplo de Java.
fr_ca: Ceci montre un programme robot orienté commande typique et tout le code nécessaire pour s’assurer que les commandes sont planifiées correctement. La méthode ``Scheduler.run`` crée un défilé à travers le planificateur qui permet à chaque commande actuellement active de passer par ses méthodes ``execute()`` et ``isFinished()``. Ignorer les méthodes ``log()`` dans l’exemple Java.
tr_tr: Bu, tipik bir komut tabanlı Robot programını ve komutların doğru şekilde programlanmasını sağlamak için gereken tüm kodu gösterir. ``Scheduler.run`` yöntemi, zamanlayıcıdan bir geçişe neden olur ve bu, şu anda etkin olan her komutun ``execute()`` ve ``isFinished()`` yöntemlerini çalıştırmasına izin verir. Java örneğindeki ``log()`` yöntemlerini göz ardı edin.
zh_cn: 这显示了一个典型的基于指令的Robot程序以及确保正确调度指令所需的所有代码。 Scheduler.run方法导致一次通过调度程序，这将使每个当前活动的指令通过其execute（）和isFinished（）方法运行。忽略Java示例中的log（）方法。

source: Command Life Cycle
es_mx: Ciclo de Vida de un Comando
fr_ca: Cycle de vie d'une commande
tr_tr: Komut Yaşam Döngüsü
zh_cn: 指令生命周期

source: The work in command-based programs occurs whenever the ``Scheduler.Run`` (C++) or ``Scheduler.run`` (Java) method is called. This is typically called on each driver station update which occurs every 20 ms or 50 times per second. The pseudo code illustrates what happens on each call to the run method.
es_mx: El trabajo en programas a base de comandos ocurre cuando el método ``Scheduler.Run`` (C++) o ``Scheduler.run`` (Java) es llamado. Este es llamado típicamente en cada actualización de la driver station lo cual ocurre cada 20 ms o 50 veces por segundo. El pseudocódigo ilustra que sucede en cada vez que se llama al método run.
fr_ca: Le travail dans les programmes orienté commandes se produit à chaque fois que la méthode ``Scheduler.Run`` (C++) ou ``Scheduler.run`` (Java) est appelée. Celle-ci est généralement appelée à chaque mise à jour de la Driver Station qui se produit tous les 20 ms ou 50 fois par seconde. Le pseudo code illustre ce qui se passe à chaque appel à la méthode ``Scheduler.Run`` (C++) ou ``Scheduler.run`` (Java).
tr_tr: Komut tabanlı programlardaki çalışma, ``Scheduler.Run`` (C ++) veya ``Scheduler.run`` (Java) yöntemi her çağrıldığında gerçekleşir. Bu genellikle her 20 ms'de bir veya saniyede 50 kez gerçekleşen her sürücü istasyonu güncellemesinde çağrılır. Sözde kod, çalıştırma yöntemine yapılan her çağrıda ne olduğunu gösterir.
zh_cn: 每当调用Scheduler.Run（C ++）或Scheduler.run（Java）方法时，都会在基于指令的程序中进行工作。通常在每个20毫秒或每秒50次的每次驱动程序站更新上调用此方法。伪代码说明了在每次调用run方法时发生的情况。

source: Buttons and triggers are polled to see if the associated commands should be scheduled. If the trigger is true, the command is added to a list of commands that should be scheduled.
es_mx: Los botones y gatillos son sondeados para ver si el comando asociado debería ser programado. Si el gatillo es verdadero, el comando es agregado a una lista de comandos que debería ser programada.
fr_ca: Les boutons et les déclencheurs sont scrutés pour voir si les commandes qui leur sont associées doivent être planifiées. Si le déclencheur est TRUE, la commande est ajoutée à une liste de commandes qui doit être planifiée.
tr_tr: İlişkili komutların programlanması gerekip gerekmediğini görmek için düğmeler ve tetikleyiciler sorgulanır. Tetikleyici doğruysa komut, programlanması gereken komutlar listesine eklenir.
zh_cn: 轮询按钮和触发器以查看是否应安排相关指令。如果触发器为true，则将指令添加到应安排的指令列表中。

source: Loop through the list of all the commands that are currently runnable and call their execute and isFinished methods. Commands where the isFinished method returns true are removed from the list of currently running commands.
es_mx: Vea a través de la lista de todos los comandos que están en funcionamiento y llaman a sus métodos execute e isFinished. Los comandos que su método isFinished regrese un valor verdadero son removidos de la lista de comandos en funcionamiento.
fr_ca: Parcourez la liste de toutes les commandes qui sont actuellement exécutables et appelez leurs méthodes ``execute()`` et ``isFInished()``. Les commandes dans lesquelles la méthode ``isFinished()`` renvoie TRUE sont supprimées de la liste des commandes en cours d’exécution.
tr_tr: Şu anda çalıştırılabilir olan tüm komutların listesi boyunca döngü yapın ve çalıştırma ve isFinished yöntemlerini çağırın. İsFinished yönteminin true döndürdüğü komutlar, o anda çalışan komutlar listesinden kaldırılır.
zh_cn: 循环浏览当前可运行的所有指令的列表，并调用它们的execute和isFinished方法。 isFinished方法返回true的指令将从当前运行的指令列表中删除。

source: Loop through all the commands that have been scheduled to run in the previous steps. Those commands are added to the list of running commands.
es_mx: Vea a través de los comandos que han sido programados para ejecutarse en los pasos previos. Esos comandos son agregados a la lista de comandos en funcionamiento.
fr_ca: Parcourez toutes les commandes qui ont été planifiées pour s’exécuter dans les étapes précédentes. Ces commandes sont ajoutées à la liste des commandes en cours d’exécution.
tr_tr: Önceki adımlarda çalıştırılmak üzere programlanmış tüm komutlar arasında döngü yapın. Bu komutlar çalışan komutlar listesine eklenir.
zh_cn: 循环浏览先前步骤中计划运行的所有指令。这些指令将添加到正在运行的指令列表中。

source: Default commands are added for each subsystem that currently has no commands running that require that subsystem.
es_mx: Comandos predeterminados son agregados a cada subsistema que en ese momento no tenga comandos funcionando que requieran ese subsistema.
fr_ca: Des commandes par défaut sont ajoutées pour chaque sous-système qui n’a actuellement aucune commande en cours d’exécution qui nécessite ce sous-système.
tr_tr: Varsayılan komutlar, şu anda bu alt sistemi gerektiren hiçbir komutu çalıştırmayan her alt sistem için eklenir.
zh_cn: 将为当前没有运行需要该子系统的指令的每个子系统添加默认指令。

source: Optimizing Command Groups
es_mx: Optimizar Grupos de Comandos
fr_ca: Optimisation des groupes de commandes
tr_tr: Komut Gruplarını Optimize Etme
zh_cn: 优化指令组

source: Once you have working commands that operate the mechanisms on your robot you can combine those commands into groups to make more complex actions. Commands can be added to command groups to execute sequentially or in parallel. Sequential commands wait until they are finished (isFinished method returns true) before running the next command in the group. Parallel commands start running, then immediately schedule the next command in the group.
es_mx: Una vez que ya haya estado trabajando con comandos que operen los mecanismos en su robot usted puede combinar esos grupos de comandos para realizar acciones más complejas. Los comandos pueden agregarse a grupos de comandos para ejecutarse secuencialmente o de forma paralela. Comandos secuenciales esperan hasta que terminan (el método isFinished devuelve un valor verdadero) antes de ejecutar el siguiente comando en el grupo. Comandos paralelos empiezan a ejecutarse, luego inmediatamente enlistan al siguiente comando del grupo.
fr_ca: Une fois que vous avez des commandes fonctionnelles qui actionnent les mécanismes sur votre robot, vous pouvez combiner ces commandes en groupes pour réaliser des actions plus complexes. Les commandes peuvent être ajoutées aux groupes de commandes pour être exécutées séquentiellement ou en parallèle. Les commandes séquentielles attendent qu’elles soient terminées (la méthode ``isFinished()`` renvoie TRUE) avant d’exécuter la commande suivante dans le groupe. Les commandes parallèles commencent à s’exécuter, puis planifient immédiatement la commande suivante dans le groupe.
tr_tr: Robotunuzdaki mekanizmaları çalıştıran çalışma komutlarına sahip olduğunuzda, daha karmaşık eylemler yapmak için bu komutları gruplar halinde birleştirebilirsiniz. Sıralı veya paralel olarak yürütmek için komut gruplarına komutlar eklenebilir. Sıralı komutlar, gruptaki bir sonraki komutu çalıştırmadan önce bitene kadar bekler (isFinished yöntemi true değerini döndürür). Paralel komutlar çalışmaya başlar, ardından gruptaki bir sonraki komutu hemen planlar.
zh_cn: 一旦有了可以操作机器人上的机械装置的有效指令，就可以将这些指令组合成组，以执行更复杂的操作。可以将指令添加到指令组以顺序或并行执行。顺序指令要等到它们完成（isFinished方法返回true）后，再运行组中的下一个指令。并行指令开始运行，然后立即调度组中的下一个指令。

source: It is important to notice that the commands are added to the group in the constructor. The command group is simply a list of command instances that run when scheduled and any parameters that are passed to the commands are evaluated during the constructor for the group.
es_mx: Es importante notar que los comandos son agregados a un grupo en el constructor. Un grupo de comandos es tan simple como una lista de instancias de comandos que se ejecutan cuando se enlistan y cualquier parámetro que pasa a los comandos es evaluado durante el constructor por el grupo.
fr_ca: Il est important de noter que les commandes sont ajoutées au groupe dans le constructeur. Le groupe de commandes est simplement une liste d’instances de commandes qui s’exécutent lorsqu’elles sont planifiées et tous les paramètres qui sont passés aux commandes sont évalués au cours de l'évaluation du constructeur pour le groupe.
tr_tr: Construtordaki gruba komutların eklendiğine dikkat etmek önemlidir. Komut grubu, programlandığında çalışan komut örneklerinin bir listesidir ve komutlara iletilen tüm parametreler, grubun yapıcısı sırasında değerlendirilir.
zh_cn: 重要的是要注意，指令已添加到构造函数中的组中。指令组仅是按计划运行的指令实例的列表，并且在组的构造函数期间评估传递给指令的任何参数。

source: Imagine that in a robot design, there is a claw, attached to a wrist joint and all of those on an elevator. When picking up something, the claw needs to close first before either the elevator or wrist can move otherwise the object may slip out of the claw. In the example shown above the ``CloseClaw`` command will be scheduled first. After it is finished (the claw is closed), the wrist will move to it's setpoint and in parallel, the elevator will move. This gets both the elevator and wrist moving simultaneously optimizing the time required to complete the task.
es_mx: Imagine que en un diseño de un robot, hay una garra, adjunta una articulación de mano y todo esto adjunto a un elevador. Al recoger algo, la garra necesita cerrarse primero antes que el elevador o articulación de mano pueden moverse a otra dirección que el objeto puede resbalarse del agarre de la garra. En el ejemplo mostrado en la parte superior, el comando ``CloseClaw``será ejecutado primero. Después de que termine (la garra esta cerrada), la muñeca se moverá a su punto fijo y en paralelo, el elevador se moverá. Esto provoca a ambos , el elevador y la muñeca moverse simultáneamente, optimizando el tiempo requerido para completar la tarea.
fr_ca: Imaginez que dans une conception de robot, il y a une pince, attachée à un joint de poignet et tous sont montés sur un élavateur. Lorsque vous ramassez quelque chose, la pince doit se fermer avant que l’elevateur ou le poignet puisse se déplacer sinon l’objet peut glisser hors de la pince. Dans l’exemple ci-dessus, la commande ``CloseClaw`` sera planifiée en premier. Une fois que son exécution est finie (la pince est fermée), le poignet se déplacera vers son point de consigne et, en parallèle, l’élevateur se déplacera. Ce qui permet à l’élevateur et au poignet de se déplacer simultanément en optimisant ainsi le temps nécessaire pour terminer la tâche.
tr_tr: Bir robot tasarımında, bir bilek eklemine ve bir asansörde bulunanlara tutturulmuş bir pençe olduğunu hayal edin. Bir şeyi kaldırırken, asansör veya bilek hareket etmeden önce pençenin kapanması gerekir, aksi takdirde nesne pençeden kayabilir. Yukarıda gösterilen örnekte, önce ``CloseClaw`` komutu programlanacaktır. İşlem tamamlandıktan sonra (pençe kapanır), bilek ayar noktasına hareket edecek ve paralel olarak yükseltici hareket edecektir. Bu, hem asansörü hem de bileği aynı anda hareket ettirerek görevi tamamlamak için gereken süreyi optimize eder.
zh_cn: 想象一下，在机器人设计中，有一个爪子附着在腕关节上，而所有爪子都附着在电梯上。拿起东西时，需要先关闭爪子，然后电梯或手腕才能移动，否则物体可能会从爪子中滑出。在上面显示的示例中，将首先安排“ CloseClaw”指令。完成后（爪闭合），手腕将移动至其设定点，平行移动，电梯将移动。这使电梯和手腕同时运动，从而优化了完成任务所需的时间。

source: When do command groups finish?
es_mx: ¿Cuándo se terminan los grupos de comandos?
fr_ca: Quand les groupes de commandes se terminent-ils ?
tr_tr: Komut grupları ne zaman biter?
zh_cn: 指令组何时结束？

source: A command group finishes when all the commands started in that group finish. This is true regardless of the type of commands that are added to the group. For example, if a number of commands are added in parallel and sequentially, the group is finished when all the commands added to the group are finished. As each command is added to a command group, it is put on a list. As those child commands finish, they are taken off the list. The command group is finished when the list of child commands is empty.
es_mx: Un grupo de comandos termina cuando todos los comandos iniciados en un grupo terminan. Esto es verdadero a pesar de el tipo de comandos que son agregados al grupo. Por ejemplo. si un número de comandos son agregados en paralelo y secuencialmente , el grupo se termina cuando todos los comandos agregados al grupo terminan. Como cada comando es agregado a un grupo de comandos, se pone en una lista. Así como esos comandos hijos terminan, se quitan de la lista. Los grupos de comandos termina cuando la lista de comandos hijos está vacía.
fr_ca: L'éxécution d'un groupe de commandes se termine lorsque toutes les commandes qui ont démarré dans ce groupe terminent chacune leur exécution. Cette condition est vraie quel que soit le type de commandes qui sont ajoutées au groupe. Par exemple, si un certain nombre de commandes sont ajoutées en parallèle et séquentiellement, l'exécution du groupe est terminée lorsque toutes les commandes ajoutées au groupe ont terminé leurs exécutions individuelles. Lorsque chaque commande est ajoutée à un groupe de commandement, elle est mise sur une liste. Lorsque ces commandes enfants se terminent, elles sont retirées de la liste. Le groupe de commandes est terminé lorsque la liste des commandes enfants est vide.
tr_tr: Bir komut grubu, o grupta başlatılan tüm komutlar bittiğinde biter. Bu, gruba eklenen komutların türüne bakılmaksızın geçerlidir. Örneğin, birkaç komut paralel ve sırayla eklenirse, gruba eklenen tüm komutlar bittiğinde grup bitirilir. Her komut bir komut grubuna eklendikçe, bir listeye konur. Bu alt komutlar bittiğinde listeden çıkarılırlar. Komut grubu, alt komutların listesi boş olduğunda tamamlanır.
zh_cn: 当指令组中所有启动的指令完成时，该指令组也将完成。不管添加到组中的指令的类型都是如此。例如，如果并行并顺序添加了许多指令，则当添加到组中的所有指令完成时，该组也将完成。将每个指令添加到指令组后，它会被置于列表中。这些子指令完成后，它们将从列表中删除。当子指令列表为空时，指令组完成。
