Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/old-commandbased/commands/synchronizing-two-commands.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Synchronizing Two Commands
es_mx: Sincronizar dos comandos
fr_ca: Synchronisation de deux commandes
tr_tr: İki Komutu Senkronize Etme
zh_cn: 同步两个指令

source: This documentation describes the use of the legacy command-based library. While this documentation has been preserved to help teams that have yet to do so, teams are strongly encouraged to migrate to the :ref:`new command-based library <docs/software/commandbased/index:Command-Based Programming>`.
es_mx: Esta documentación describe el uso de la biblioteca dejada basada en comandos. Si bien esta documentación se ha conservado para ayudar a los equipos que aún no lo han hecho, se recomienda encarecidamente a los equipos que migren a la nueva biblioteca <docs/software/commandbased/index:Command-Based Programming>`.
fr_ca: Cette documentation décrit l’utilisation de la bibliothèque de commande héritée. Bien que cette documentation ait été conservée pour aider les équipes qui ne l’ont pas encore fait, les équipes sont fortement encouragées à migrer vers la :ref:`nouvelle bibliothèque orientée commande <docs/software/commandbased/index:Command-Based Programming>`.
tr_tr: Bu belge, eski komut tabanlı kütüphanenin kullanımını açıklar. Bu belgeler henüz bunu yapmamış takımlara yardımcı olmak için korunmuş olsa da, ekiplerin :ref:`yeni komut tabanlı kütüphane <docs/software/commandbased/index:Command-Based Programming>` ye geçmeleri şiddetle tavsiye edilir.
zh_cn: 本文档描述了旧式基于指令的库的用法。尽管保留了该文档以帮助尚未这样做的团队，但强烈建议团队迁移到新的基于指令的库<docs/software/commandbased/index:Command-Based Programming>。

source: Commands can be nested inside of command groups to create more complex commands. The simpler commands can be added to the command groups to either run sequentially (each command finishing before the next starts) or in parallel (the command is scheduled, and the next command is immediately scheduled also). Occasionally there are times where you want to make sure that two parallel command complete before moving onto the next command. This article describes how to do that.
es_mx: Los comandos se pueden anidar dentro de los grupos de comandos para crear comandos más complejos. Los comandos más simples se pueden agregar a los grupos de comandos para que se ejecuten secuencialmente (cada comando termina antes de que comience el siguiente) o en paralelo (el comando está programado y el siguiente comando también está programado de inmediato). Ocasionalmente, hay momentos en los que desea asegurarse que se completen dos comandos paralelos antes de pasar al siguiente comando. Este artículo describe cómo hacer eso.
fr_ca: Les commandes peuvent être imbriquées à l’intérieur des groupes de commandes pour créer des commandes plus complexes. Les commandes plus simples peuvent être ajoutées aux groupes de commandes pour s’exécuter séquentiellement (chaque commande se terminant avant le début de la suivante) ou en parallèle (la commande est planifiée et la commande suivante est immédiatement planifiée également). Parfois, il ya des moments où vous voulez vous assurer que deux commandes parallèles complètent leur exécution avant de passer à la commande suivante. Cet article décrit comment le faire.
tr_tr: Komutlar, daha karmaşık komutlar oluşturmak için komut gruplarının içine yerleştirilebilir. Daha basit komutlar, sıralı olarak (her komut bir sonraki başlamadan önce biter) veya paralel olarak (komut planlanır ve sonraki komut da hemen planlanır) çalıştırılmak üzere komut gruplarına eklenebilir. Bazen, bir sonraki komuta geçmeden önce iki paralel komutun tamamlandığından emin olmak istediğiniz zamanlar olabilir. Bu makale bunun nasıl yapılacağını açıklar.
zh_cn: 可以将指令嵌套在指令组内部以创建更复杂的指令。可以将更简单的指令添加到指令组中，以依次运行（每个指令在下一个启动之前完成）或并行运行（计划该指令，并且也立即计划下一个指令）。有时，您需要确保在执行下一个指令之前完成两个并行指令。本文介绍了如何执行此操作。

source: CommandGroup with Sequential and Parallel Commands
es_mx: CommandGroup con comandos secuenciales y paralelos
fr_ca: CommandGroup avec commandes séquentielles et parallèles
tr_tr: Sıralı ve Paralel Komutlara Sahip CommandGroup
zh_cn: 具有顺序和并行指令的CommandGroup

source: In this example some commands are added in parallel and others are added sequentially to the CommandGroup CoopBridgeAutonomous (1). The first command "SetTipperState" is added and completes before the SetVirtualSetpoint command starts (2). Before SetVirtualSetpoint command completes, the DriveToBridge command is immediately scheduled because of the SetVirtualSetpoint is added in parallel (3). This example might give you an idea of how commands are scheduled.
es_mx: En este ejemplo ciertos comandos son añadidos en paralelos y otros son añadidos secuencialmente al CommandGroup CoopBridgeAutonomous (1). El primer comando "SetTipperState" es añadido y se completa antes de que comience el comando SetVirtualSetpoint (2). Antes de que se complete el comando SetVirtualSetpoint, el comando DriveToBridge se programa inmediatamente debido a que el SetVirtualSetpoint se agrega en paralelo (3). Este ejemplo podría darle una idea de cómo se programan los comandos.
fr_ca: Dans cet exemple, certaines commandes sont ajoutées en parallèle et d’autres sont ajoutées séquentiellement au CommandGroup CoopBridgeAutonomous (1). La première commande "SetTipperState" est ajoutée et se termine avant le démarrage de la commande SetVirtualSetpoint (2). Avant la fin de la commande SetVirtualSetpoint, la commande DriveToBridge est immédiatement planifiée en raison de l’ajout en parallèle (3) de la commande SetVirtualSetpoint. Cet exemple peut vous donner une idée de la façon dont les commandes sont planifiées.
tr_tr: Bu örnekte, bazı komutlar paralel olarak eklenir ve diğerleri sırasıyla CommandGroup CoopBridgeAutonomous'a (1) eklenir. İlk "SetTipperState" komutu eklenir ve SetVirtualSetpoint komutu başlamadan önce tamamlanır (2). SetVirtualSetpoint komutu tamamlanmadan önce, SetVirtualSetpoint paralel olarak eklendiğinden, DriveToBridge komutu hemen planlanır (3). Bu örnek size komutların nasıl planlandığı konusunda bir fikir verebilir.
zh_cn: 在此示例中，一些指令被并行添加，而其他指令则顺序添加到CommandGroup CoopBridgeAutonomous（1）。添加第一个指令“ SetTipperState”，并在SetVirtualSetpoint指令开始之前完成（2）。在SetVirtualSetpoint指令完成之前，会立即计划DriveToBridge指令，因为SetVirtualSetpoint是并行添加的（3）。该示例可能使您了解如何调度指令。

source: Example Flowchart
es_mx: Ejemplo, Diagrama de Flujo
fr_ca: Exemple d'organigramme
tr_tr: Örnek Akış Şeması
zh_cn: 流程图示例

source: There is no dependency coming from the commands scheduled using "Add Parallel" either or both of these commands could still be running when the MoveBallToShooter command is reached.
es_mx: No hay dependencia proveniente de los comandos programados usando "Agregar paralelo", o ambos de estos comandos aún podrían ejecutarse cuando se alcanza el comando MoveBallToShooter.
fr_ca: Il n’y a aucune dépendance provenant des commandes planifiées à l’aide de "Add Parallel", l’une ou l’autre ou les deux commandes peuvent toujours être en cours d’exécution lorsque la commande MoveBallToShooter est atteinte.
tr_tr: "Paralel Ekle" kullanılarak zamanlanan komutlardan herhangi bir bağımlılık gelmiyor veya bu komutlardan herhangi biri, MoveBallToShooter komutuna ulaşıldığında hala çalışıyor olabilir.
zh_cn: 到达MoveBallToShooter指令时，使用“添加并行”调度的指令没有依赖性，或者这两个指令仍可以运行。

source: Here is the code shown above represented as a flowchart. Any command in the main sequence (the sequence on the right here) that requires a subsystem in use by a parallel command will cause the parallel command to be canceled. For example, if the ``FireSequence`` required a subsystem in use by ``SetVirtualSetpoint``, the ``SetVirtualSetpoint`` command will be canceled when ``FireSequence`` is scheduled.
es_mx: Aquí está el código que se muestra arriba representado como un diagrama de flujo. Cualquier comando en la secuencia principal (la secuencia de la derecha aquí) que requiera un subsistema en uso por un comando paralelo hará que se cancele el comando paralelo. Por ejemplo, si ``FireSequence requirió un subsistema en uso por ``SetVirtualSetpoint``, el comando ``SetVirtualSetpoint`` se cancelará cuando se programe ``FireSequence``.
fr_ca: Voici le code ci-dessus représenté sous forme d'organigramme. Toute commande de la séquence principale (la séquence à droite ici) qui requiert un sous-système utilisé par une commande parallèle entraînera l’annulation de cette commande parallèle. Par exemple, si la commande ``FireSequence`` a requis un sous-système utilisé par la commande ``SetVirtualSetpoint``, la commande ``SetVirtualSetpoint`` sera annulée lorsque la commande ``FireSequence`` est planifiée.
tr_tr: İşte akış şeması olarak gösterilen yukarıda gösterilen kod. Paralel komut tarafından kullanılan bir alt sistemin kullanılmasını gerektiren ana sıralamadaki herhangi bir komut (buradaki sıralama) paralel komutun iptal edilmesine neden olacaktır. Örneğin, "FireSequence", "SetVirtualSetpoint" tarafından kullanılan bir alt sistem gerektiriyorsa, "FireSequence" planlandığında "SetVirtualSetpoint" komutu iptal edilecektir.
zh_cn: 这是上面显示为流程图的代码。主序列（此处为右侧序列）中需要并行指令使用子系统的任何指令都将导致并行指令被取消。例如，如果“ FireSequence”需要由“ SetVirtualSetpoint”使用的子系统，则在计划“ FireSequence”时将取消“ SetVirtualSetpoint”指令。

source: Waiting for a Command
es_mx: Esperando por un Comando
fr_ca: En attente d’une commande
tr_tr: Bir Komut Bekleme
zh_cn: 等待指令

source: If there are two commands that need to complete before the following commands are scheduled, they can be put into a command group by themselves, adding both in parallel. Then that command group can be scheduled sequentially from an enclosing command group. When a command group is scheduled sequentially, the commands inside it will all finish before the next outer command is scheduled. In this way you can be sure that an action consisting of multiple parallel commands has completed before going on to the next command.
es_mx: Si hay dos comandos que deben completarse antes de que se programen los siguientes comandos, se pueden colocar en un grupo de comandos por sí mismos, agregando ambos en paralelo. Entonces ese grupo de comandos se puede programar secuencialmente desde un grupo de comandos adjunto. Cuando un grupo de comandos se programa secuencialmente, los comandos dentro de él finalizarán antes de que se programe el siguiente comando externo. De esta manera, puede estar seguro de que una acción que consta de múltiples comandos paralelos se ha completado antes de pasar al siguiente comando.
fr_ca: S’il y a deux commandes à compléter avant que les commandes suivantes ne soient planifiées, elles peuvent être mises elles-mêmes dans un groupe de commandes, en ajoutant les deux en parallèle. Ensuite, ce groupe de commandes peut être planifié séquentiellement à l'intérieur d’un autre groupe de commandes. Lorsqu’un groupe de commandes est planifié séquentiellement, les commandes à l’intérieur de celui-ci se terminent avant que la prochaine commande externe ne soit planifiée. De cette façon, vous pouvez être sûr qu’une action composée de plusieurs commandes parallèles s’est terminée avant de passer à la commande suivante.
tr_tr: Sonraki komutlar planlanmadan önce tamamlanması gereken iki komut varsa, her ikisini de paralel olarak ekleyerek kendi başlarına bir komut grubuna konulabilir. Daha sonra bu komut grubu, kapalı bir komut grubundan sırayla programlanabilir. Bir komut grubu sırayla programlandığında, içindeki komutların tümü bir sonraki dış komut zamanlanmadan önce biter. Bu şekilde, bir sonraki komuta geçmeden önce birden çok paralel komuttan oluşan bir eylemin tamamlandığından emin olabilirsiniz.
zh_cn: 如果在计划以下指令之前需要完成两个指令，则可以将它们自己放入指令组，并并行添加。然后，可以从一个封闭的指令组中依次调度该指令组。依次调度指令组后，内部的指令将在调度下一个外部指令之前全部完成。这样，您可以确保在继续下一个指令之前，由多个并行指令组成的操作已完成。

source: In this example you can see that the addition of a command group "Move to Bridge" containing the **Set Virtual Setpoint** and **Drive to Bridge** commands forces both to complete before the next commands are scheduled.
es_mx: En este ejemplo, puede ver que la adición de un grupo de comandos "Move to Bridge" que contiene los comandos **Set Virtual Setpoint** y **Drive to Bridge** obliga a ambos a completarse antes de que se programen los siguientes comandos.
fr_ca: Dans cet exemple, vous pouvez voir que l’ajout d’un groupe de commandes "Move to Bridge" contenant les commandes **Set Virtual Setpoint** et **Drive to Bridge** force les deux à terminer avant que les commandes suivantes ne soient planifiées.
tr_tr: Bu örnekte, ** "Set Virtual Setpoint-Gerçek varış noktası" ** ve ** Drive to Bridge-Köprüye Sür ** komutlarını içeren "Move to Bridge-Köprüye Taşı" komut grubunun eklenmesinin, her ikisinin de sonraki komutlar zamanlanmadan önce tamamlanmasını zorunlu kıldığını görebilirsiniz.
zh_cn: 在此示例中，您可以看到添加了包含“设置虚拟设定点”和“驱动器到桥”指令的“移动到桥”指令组，这两个指令组都必须在计划下一个指令之前完成。
