Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/hardware-apis/pneumatics/index.po
Languages: tr_tr

source: Pneumatics APIs
tr_tr: Pnömatik API'ları

source: Using the FRC Control System to Control Pneumatics
tr_tr: Pnömatiğin Yönetimi için FRC Kontrol Sisteminin Kullanılması

source: There are two options for operating solenoids to control pneumatic cylinders, the CTRE Pneumatics Control Module and the REV Robotics Pneumatics Hub.
tr_tr: Pnömatik silindirleri yönetmek için solenoidleri kullanmak için iki seçenek vardır, CTRE Pnömatik Control Modülü ve REV Robotics Pnömatik Merkezi

source: The Pneumatics Control Module (PCM)
tr_tr: The Pneumatics Control Module - Pnömatik Kontrol Modülü (PCM)

source: The CTRE Pneumatics Control Module (PCM) is a CAN-based device that provides control over the compressor and up to 8 solenoids per module.
tr_tr: CTRE Pnömatik Kontrol Modülü (PCM), kompresör ve modül başı 8 adede kadar solenoidin yönetilmesini sağlayan CAN temelli bir cihazdır.

source: The Pneumatic Hub (PH)
tr_tr: Pneumatic Hub - Pnömatik Merkezi (PH)

source: The REV Pneumatic Hub (PH) is a CAN-based device that provides control over the compressor and up to 16 solenoids per module.
tr_tr: REV Robotics Pnömatik Merkezi (PH), kompresör ve modül başı 16 adede kadar solenoidin yönetilmesini sağlayan CAN temelli bir cihazdır.

source: These devices are integrated into WPILib through a series of classes that make them simple to use. The closed loop control of the Compressor and Pressure switch is handled by the PCM hardware and the Solenoids are handled by the ``Solenoid`` class that controls the solenoid channels.
tr_tr: Bu cihazlar, kullanımlarını kolaylaştıran bir dizi sınıflar aracılığıyla, WPILib'e entegre edilmiştir. Kompresör ve Basınç şalterlerinin kapalı döngü kontrolü PCM donanımı tarafından idare edilirken Solenoidler, solenoid kanallarını yöneten ``Solenoid`` sınıfı tarafından idare edilmektedir.

source: These modules are responsible for regulating the robot's pressure using a pressure switch and a compressor and switching solenoids on and off. They communicate with the roboRIO over CAN. For more information, see :doc:`/docs/controls-overviews/control-system-hardware`.
tr_tr: Bu modüller; bir basınç şalteri ve kompresör aracılığıyla robot basıncının düzenlenmesinin yanı sıra solenoidlerin açılıp kapatılmasından sorumludur. Modüller CAN üzerinden roboRIO ile iletişi kurmaktadır. Daha fazla bilgi için bkz. :doc:`/docs/controls-overviews/control-system-hardware`.

source: Module Numbers
tr_tr: Modül Numaraları

source: CAN Devices are identified by their CAN ID. The default CAN ID for PCMs is 0. The default CAN ID for PHs is 1. If using a single module on the bus it is recommended to leave it at the default CAN ID. Additional modules can be used where the modules corresponding solenoids are differentiated by the module number in the constructors of the ``Solenoid``, ``DoubleSolenoid`` and ``Compressor`` classes.
tr_tr: CAN Cihazları CAN ID aracılığıyla tanımlanmaktadır. PCM'ler için varsayılan CAN ID 0, PH'lar için varsayılan ise 1'dir. Veri yolunda tek bir modül kullanılıyorsa, modülü varsayılan CAN ID'de bırakmak tavsiye edilmektedir. Ek modüller, solenoidlere denk düşen modüllerin ``Solenoid``, ``DoubleSolenoid`` ve ``Compressor`` sınıflarının constructor'larındaki modül numarasındaki farklarla ayrıştığı durumlarda, kullanılabilmektedir.
