Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/frc-glossary.po
Languages: es_mx, he_il, zh_cn

source: FRC Glossary
es_mx: Glosario de FRC
he_il: מילון מונחי FRC
zh_cn: FRC词汇表

source: accelerometer
es_mx: acelerómetro
he_il: מד תאוצה
zh_cn: 加速度计

source: A common sensor used to measure acceleration in one or more axis.
es_mx: Un sensor común es usado para medir la aceleración en uno o más ejes.
he_il: מכשיר נפוץ משמש למדידה של תאוצה בציר אחד או יותר.
zh_cn: 一种用于测量一个或多个轴上加速度的通用传感器。

source: alliance
es_mx: alianza
zh_cn: 联盟

source: A cooperative of up to four (4) FIRST\ |reg| Robotics Competition teams.
es_mx: Una cooperativa de hasta cuatro (4) equipos de FIRST\ |reg| Robotics Competition.
zh_cn: 最多四（4）个FIRST \ | reg |的合作社机器人竞赛团队。

source: auto
he_il: אוטונומי
zh_cn: 自动阶段

source: The first phase of each :term:`match` is called Autonomous (auto) and consists of the first fifteen (0:15) seconds.
es_mx: La primera fase de cada :term:`match` es llamado Autónomo (auto) y consiste en los primeros quince (0:15) segundos.
zh_cn: 每个match的第一阶段称为自动阶段（auto），由前十五（0:15）秒组成。

source: Commercial off the shelf, a standard (i.e. not custom order) part commonly available from a vendor to all teams for purchase.
es_mx: Comercial lista para usar, una pieza estándar (es decir, no pedido personalizado) comúnmente disponible de un proveedor a todos los equipos para su compra.
zh_cn: 现成的商业产品，是标准（即非定制订单）零件，通常可以从供应商处购买给所有团队。

source: One of the three officially supported programming languages.
es_mx: Uno de los tres lenguajes de programación aprobados oficialmente.
he_il: אחד משלושת שפות התכנות הנתמכות רשמית.
zh_cn: 三种官方支持的编程语言之一。

source: deprecated
he_il: הוצא משימוש
zh_cn: 不推荐使用

source: Software that will be maintained for at least 1 year, but may be removed after that.
es_mx: Software que será mantenido por lo menos 1 año, pero después de eso puede ser removido.
zh_cn: 该软件将至少维护1年，但此后可能会删除。

source: Dynamic Host Configuration Protocol, the protocol that allows a central device to assign unique IP addresses to all other devices.
es_mx: Dynamic Host Configuration Protocol, el protocolo que permite que un dispositivo central asigne direcciones IP únicas a los demás dispositivos.
zh_cn: 动态主机配置协议，该协议允许中央设备向所有其他设备分配唯一的IP地址。

source: FMS
zh_cn: 场地管理系统

source: Field Management System, the electronics core responsible for sensing and controlling the FIRST Robotics Competition field.
es_mx: Field Management System, el centro de la electrónica responsable por detectar y controlar la cancha de FIRST Robotics Competition.
he_il: מערכת ניהול מגרש, המערכת אלקטרוניקה האחראית לבקרה וניהול של מגרש הFIRST Robotics Competition.
zh_cn: 现场管理系统，是负责感应和控制FIRST机器人竞赛领域的电子核心。

source: The mechanism that powers the deployment of robot code to the roboRIO.
es_mx: El mecanismo que impulsa la implementación del código del robot en la roboRIO.
zh_cn: 一种将机器人代码部署到roboRIO的机制。

source: gyroscope
es_mx: giroscopio
he_il: ג'יירו
zh_cn: 陀螺仪

source: A device that measures rate of rotation. It can add up the rotation measurements to determine :term:`heading` of the robot. (“gyro”, for short)
es_mx: Un dispositivo que mide la velocidad de rotación. Puede sumar las medidas de rotación para determinar :term:`rumbo` del robot. (“gyro”, para abreviar)
zh_cn: 一种测量转速的设备。它可以将旋转测量值相加以确定机器人的航向。 （简称“陀螺仪”）

source: heading
es_mx: rumbo
he_il: כיוון
zh_cn: 指向

source: The direction the robot is pointed, usually expressed as an angle in degrees.
es_mx: La dirección en la que el robot apunta, usualmente expresado como un ángulo en grados.
zh_cn: 机器人指向的方向，通常以度数表示。

source: IMU
zh_cn: 国际货币联盟

source: Inertial Measurement Unit, a sensor that combines both an :term:`accelerometer` and a :term:`gyroscope` into a single sensor.
es_mx: Inertial Measurement Unit, un sensor que combina :term:`acelerómetro` y :term:`giroscopio` en un solo sensor.
zh_cn: 惯性测量单元，一种将加速度计和陀螺仪组合成一个传感器的传感器。

source: KOP
zh_cn: OP

source: Kit of Parts, the collection of items listed on the Kickoff Kit checklists, distributed to the team via FIRST Choice, or paid for completely (except shipping) with a Product Donation Voucher (PDV).
es_mx: Kit of Parts, la colección de artículos listados en las listas de verificación del Kit del Kickoff, distribuidos a los equipos vía FIRST Choice, o pagados por completo (excepto envío) con un Product Donation Voucher (PDV).
zh_cn: 零件套件，即启动套件清单上列出的项目的集合，可以通过FIRST Choice分发给团队，或者用产品捐赠券（PDV）完全支付（运费除外）。

source: KOP chassis
es_mx: chasis KOP
he_il: מרכב KOP
zh_cn: KOP机箱

source: The `AM14U4 <https://www.andymark.com/products/am14u4-kit-of-parts-chassis>`__ chassis distributed to every team (that did not opt out) as part of the :term:`KOP`.
es_mx: El chasis `AM14U4 <https://www.andymark.com/products/am14u4-kit-of-parts-chassis>`__ distribuido a todos los equipos (que no se excluyeron) como parte del :term:`KOP`.
zh_cn: “ AM14U4 <https://www.andymark.com/products/am14u4-kit-of-parts-chassis>” __底盘作为：term：`KOP的一部分分发给了每个(未退出的)团队。

source: match
es_mx: partido
zh_cn: 比赛

source: A two (2) minute and thirty (30) second period of time in which an :term:`alliance` plays a FRC game.
es_mx: Un periodo de tiempo de dos (2) minutos y treinta (30) segundos en el cual una :term:`alianza` juega un juego de FRC.
zh_cn: 两（2）分钟和三十（30）秒的时间段，其中：term：`alliance`玩FRC游戏。

source: A way to communicate key / value pairs, of data, between programs.
es_mx: Una forma de comunicar pares clave / valor, de datos, entre programas.
zh_cn: 一种在程序之间传递数据的键/值对的方式。

source: RP
zh_cn: 排位积分

source: Ranking Point, a way of ordering teams rewarding specific objectives in addition to winning the match.
es_mx: Ranking Point, una forma de ordenar a los equipos recompensando objetivos específicos además de ganar el partido.
zh_cn: 排名积分，一种命令球队在赢得比赛的同时奖励特定目标的方法。

source: simulation
es_mx: simulación
he_il: סימולציה
zh_cn: 模拟

source: A way for teams to test their code without having an actual robot available.
es_mx: Una forma para que los equipos prueben su código sin tener un robot real disponible.
he_il: דרך בשביל קבוצות לבדוק את הקוד שלהם בלי רובוט אמיתי זמין.
zh_cn: 团队在没有可用实际机器人的情况下测试其代码的一种方法。

source: teleop
he_il: טלאופ
zh_cn: 手动阶段

source: The second phase of each match is called the Teleoperated Period (teleop) and consists of drivers controlling their robots.
es_mx: La segunda fase de cada partido se llama Periodo Teleoperado (teleop) y consiste en conductores controlando sus robots.
zh_cn: 每次比赛的第二阶段称为“远程操作时段”（“遥控”），由控制机器人的驱动程序组成。

source: trajectory
es_mx: trayectoria
he_il: מסלול
zh_cn: 弹道

source: A trajectory is a smooth curve, with velocities and accelerations at each point along the curve, connecting two endpoints on the field.
es_mx: Una trayectoria es una curva suave, con velocidades y aceleraciones en cada punto a lo largo de la curva, que conecta dos puntos finales en el campo.
zh_cn: 轨迹是一条平滑的曲线，在曲线的每个点上都有速度和加速度，连接了场上的两个端点。

source: The first phase of each match is called Autonomous (auto) and consists of the robot's running pre-programmed instructions.
he_il: השלב הראשון של כל מקצה נקרא אוטונומי והוא מורכב מהנחיות המתוכנתות מראש של הרובוט.

source: COTS
he_il: מוצרי COTS
