Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/what-*-wpilib.po
Languages: es_mx, fr_ca, tr_tr

source: What is WPILib?
es_mx: ¿Qué es WPILib?
fr_ca: Qu'est-ce que WPILib?
tr_tr: WPILib Nedir?

source: The WPI Robotics Library (WPILib) is the standard software library provided for teams to write code for their FRC\ |reg| robots. A `software library <https://en.wikipedia.org/wiki/Library_(computing)>`__ is a collection of code that can be imported into and used by other software. WPILib contains a set of useful classes and subroutines for interfacing with various parts of the FRC control system (such as sensors, motor controllers, and the driver station), as well as an assortment of other utility functions.
fr_ca: La WPI Robotics Library (WPILib) est la bibliothèque logicielle standard qui permet aux équipes d’écrire du code pour leurs robots FRC\ |reg| . Une `bibliothèque logicielle <https://en.wikipedia.org/wiki/Library_(computing)>`__ est une collection de codes qui peut être importée et utilisée par d’autres logiciels. WPILib contient un ensemble de classes et de sous-routines utiles pour l’interfaçage avec diverses parties du système de contrôle FRC (tels que les capteurs, les contrôleurs de moteurs et l'application Driver Station), ainsi qu’un assortiment d’autres fonctions utilitaires.
tr_tr: WPI Robotics Library (WPILib), ekiplerin FRC'leri için kod yazmaları için sağlanan standart yazılım kitaplığıdır \|reg| robotlar. Bir "yazılım kitaplığı <https://en.wikipedia.org/wiki/Library_(computing)>`____, başka bir yazılıma aktarılabilen ve diğer yazılımlar tarafından kullanılabilen bir kod koleksiyonudur. WPILib, FRC kontrol sisteminin çeşitli bölümleriyle (sensörler, motor kontrolörleri ve sürücü istasyonu gibi) arayüz oluşturmak için bir dizi yararlı sınıf ve alt yordamın yanı sıra bir dizi başka yardımcı program işlevi içerir.

source: Supported languages
es_mx: Idiomas admitidos
fr_ca: Languages supportés
tr_tr: Desteklenen Diller

source: There are two versions of WPILib, one for each of the two officially-supported text-based languages: WPILibJ for Java, and WPILibC for C++. A considerable effort is made to maintain feature-parity between these two languages - library features are not added unless they can be reasonably supported for both Java and C++, and when possible the class and method names are kept identical or highly-similar. While unofficial community-built support is available for some other languages, notably `python <https://robotpy.readthedocs.io/en/stable/>`__, this documentation will only cover Java and C++. Java and C++ were chosen for the officially-supported languages due to their appropriate level-of-abstraction and ubiquity in both industry and high-school computer science classes.
fr_ca: Il existe deux versions de WPILib, une pour chacun des deux langages textuels officiellement pris en charge : WPILibJ pour Java et WPILibC pour C++. Un effort considérable est fait pour maintenir la parité des fonctionnalités entre ces deux langages - les fonctionnalités de la librairie ne sont pas ajoutées à moins qu'elles ne puissent être raisonnablement prises en charge pour Java et C++, et lorsque cela est possible, les noms de classe et de méthode restent identiques ou très similaires. Bien qu'un support communautaire non officiel soit disponible pour certains autres langages, notamment `python <https://robotpy.readthedocs.io/en/stable/>`__, cette documentation ne couvrira que Java et C++. Java et C++ ont été choisis pour les langages officiellement pris en charge en raison de leur niveau d'abstraction approprié et de leur omniprésence dans les cours d'informatique de l'industrie et du secondaire.

source: In general, C++ offers better high-end performance, at the cost of increased user effort (memory must be handled manually, and the C++ compiler does not do much to ensure user code will not crash at runtime). Java offers lesser performance, but much greater convenience. New/inexperienced users are strongly encouraged to use Java.
es_mx: En general, C++ ofrece un mejor rendimiento de gama alta, a costa de un mayor esfuerzo del usuario (la memoria debe manejarse manualmente y el compilador de C++ no hace mucho para garantizar que el código del usuario no se bloquee en tiempo de ejecución). Java ofrece un rendimiento menor, pero una comodidad mucho mayor. Se recomienda encarecidamente a los usuarios nuevos o sin experiencia que utilicen Java.
fr_ca: En général, C++ offre de meilleures performances finales, au prix d'un effort utilisateur accru (la mémoire doit être gérée manuellement et le compilateur C++ ne fait pas grand-chose pour garantir que le code utilisateur ne plantera pas lors de l'exécution). Java offre des performances moindres, mais beaucoup plus de commodité. Les utilisateurs nouveaux ou inexpérimentés sont vivement encouragés à utiliser Java.
tr_tr: Genel olarak, C++, artan kullanıcı çabası karşılığında daha iyi bir üst düzey performans sunar (bellek manuel olarak ele alınmalıdır ve C++ derleyicisi, kullanıcı kodunun çalışma zamanında çökmemesini sağlamak için fazla bir şey yapmaz). Java, daha az performans, ancak çok daha fazla kolaylık sunar. Yeni/deneyimsiz kullanıcıların Java'yı kullanmaları şiddetle tavsiye edilir.

source: Source code and documentation
es_mx: Documentación y código fuente
fr_ca: Code source et documentation
tr_tr: Kaynak kodu ve belgeleme

source: WPILib is an open-source library - the entirety of its source code is available online on the WPILib GitHub Page:
fr_ca: WPILib est une librairie source-ouverte - l’intégralité de son code source est disponible en ligne sur la page WPILib GitHub :
tr_tr: WPILib açık kaynaklı bir kütüphanedir - kaynak kodunun tamamı WPILib GitHub Sayfasında çevrimiçi olarak mevcuttur:

source: `Official WPILib GitHub <https://github.com/wpilibsuite/allwpilib>`__
fr_ca: `Compte GitHub WPILib Officiel <https://github.com/wpilibsuite/allwpilib>`__
tr_tr: `Resmi WPILib GitHub <https://github.com/wpilibsuite/allwpilib>`__

source: The Java and C++ source code can be found in the WPILibJ and WPILibC source directories:
es_mx: El código fuente de Java y C ++ se puede encontrar en los directorios fuente de WPILibJ y WPILibC:
fr_ca: Le code source Java et C++ se trouve dans les répertoires source WPILibJ et WPILibC:
tr_tr: Java ve C++ kaynak kodu, WPILibJ ve WPILibC kaynak dizinlerinde bulunabilir:

source: `Java source code <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibj/src/main/java/edu/wpi/first/wpilibj>`__
fr_ca: `Code source en Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibj/src/main/java/edu/wpi/first/wpilibj>`__

source: `C++ source code <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibc/src/main/native/cpp>`__
fr_ca: `Code source en C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibc/src/main/native/cpp>`__

source: While users are strongly encouraged to read the source code to resolve detailed questions about library functionality, more-concise documentation can be found on the official documentation pages for WPILibJ and WPILibC:
es_mx: Si bien se recomienda encarecidamente a los usuarios que lean el código fuente para resolver preguntas detalladas sobre la funcionalidad de la biblioteca, se puede encontrar documentación más concisa en las páginas de documentación oficial de WPILibJ y WPILibC:
fr_ca: Les utilisateurs sont fortement encouragés à lire le code source pour résoudre des questions détaillées sur les fonctionnalités de la bibliothèque. Une documentation plus concise peut être trouvée sur les pages de documentation officielles de WPILibJ et WPILibC:
tr_tr: Kullanıcıların kütüphane işlevselliği ile ilgili ayrıntılı soruları çözmek için kaynak kodunu okumaları şiddetle tavsiye edilirken, WPILibJ ve WPILibC için resmi belge sayfalarında daha kısa ve öz belgeler bulunabilir:

source: `Java documentation <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/>`__
fr_ca: `Documentation Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/>`__

source: `C++ documentation <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/>`__
fr_ca: `Documentation C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/>`__

source: There are two versions of WPILib, one for each of the two officially-supported text-based languages: WPILibJ for java, and WPILibC for C++. A considerable effort is made to maintain feature-parity between these two languages - library features are not added unless they can be reasonably supported for both Java and C++, and when possible the class and method names are kept identical or highly-similar. While unofficial community-built support is available for some other languages, notably `python <https://robotpy.readthedocs.io/en/stable/>`__, this documentation will only cover Java and C++. Java and C++ were chosen for the officially-supported languages due to their appropriate level-of-abstraction and ubiquity in both industry and high-school computer science classes.
es_mx: Hay dos versiones de WPILib, una para cada uno de los dos lenguajes basados en texto oficialmente admitidos: WPILibJ para java y WPILibC para C++. Se hace un esfuerzo considerable para mantener la paridad de características entre estos dos lenguajes: las características de la biblioteca no se agregan a menos que puedan ser razonablemente compatibles con Java y C++, y cuando es posible, los nombres de clases y métodos se mantienen idénticos o muy similares. Si bien el soporte no oficial creado por la comunidad está disponible para algunos otros lenguajes, en particular `python <https://robotpy.readthedocs.io/en/stable/>`__, esta documentación solo cubrirá Java y C ++. Se eligieron Java y C ++ para los lenguajes admitidos oficialmente debido a su nivel apropiado de abstracción y ubicuidad en las clases de informática de la industria y de la escuela secundaria.
tr_tr: Resmi olarak desteklenen iki metin tabanlı dilin her biri için bir tane olmak üzere iki WPILib sürümü vardır: java için WPILibJ ve C ++ için WPILibC. Bu iki dil arasındaki özellik eşitliğini korumak için önemli bir çaba harcanmaktadır - hem Java hem de C++ için makul bir şekilde desteklenmedikçe kitaplık özellikleri eklenmez ve mümkün olduğunda sınıf ve yöntem adları aynı veya oldukça benzer tutulur. Topluluk tarafından oluşturulmuş resmi olmayan destek, diğer bazı diller için mevcut olsa da, özellikle `python <https://robotpy.readthedocs.io/en/stable/>`__, bu belge yalnızca Java ve C ++'ı kapsayacaktır. Hem endüstri hem de lise bilgisayar bilimleri derslerinde uygun soyutlama düzeyine sahip olmaları ve her yerde bulunmaları nedeniyle resmi olarak desteklenen diller için Java ve C++ seçilmiştir.

source: `Java source code <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibj/src/main/java/edu/wpi/first/wpilibj>`__
es_mx: `Directorio fuente de Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibj/src/main/java/edu/wpi/first/wpilibj>`__
tr_tr: `Java kaynak kodu <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibj/src/main/java/edu/wpi/first/wpilibj>`__

source: `C++ source code <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibc/src/main/native/cpp>`__
es_mx: `Directorio fuente de C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibc/src/main/native/cpp>`__
tr_tr: `C++ kaynak kodu <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibc/src/main/native/cpp>`__

source: `Java documentation <https://first.wpi.edu/FRC/roborio/release/docs/java/>`__
es_mx: `Documentos de Java <https://first.wpi.edu/FRC/roborio/release/docs/java/>`__
tr_tr: `Java belgeleri <https://first.wpi.edu/FRC/roborio/release/docs/java/>`__

source: `C++ documentation <https://first.wpi.edu/FRC/roborio/release/docs/cpp/>`__
es_mx: `Documentos de C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/>`__
tr_tr: `C ++ belgeleri <https://first.wpi.edu/FRC/roborio/release/docs/cpp/>`__

source: The WPI Robotics Library (WPILib) is the standard software library provided for teams to write code for their FRC robots. A `software library <https://en.wikipedia.org/wiki/Library_(computing)>`__ is a collection of code that can be imported into and used by other software. WPILib contains a set of useful classes and subroutines for interfacing with various parts of the FRC control system (such as sensors, motor controllers, and the driver station), as well as an assortment of other utility functions.
es_mx: La biblioteca de robótica WPI (WPILib) es la biblioteca de software estándar proporcionada para que los equipos escriban código para sus robots FRC. Una `librería de software <https://en.wikipedia.org/wiki/Library_(computing)>`__ es una colección de código que puede ser importado y utilizado por otro software. WPILib contiene un conjunto de clases y subrutinas útiles para interactuar con varias partes del sistema de control FRC (como sensores, controladores de motor y la driver station), así como una variedad de otras funciones de utilidad.

source: WPILib is an open-source library - the entirety of its source code is available online on the WPILib Github Page:
es_mx: WPILib es una biblioteca de código abierto; la totalidad de su código fuente está disponible en línea en la página de WPILib Github:
