Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/roborio-info/recovering-a-roborio-using-safe-mode.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Recovering a roboRIO using Safe Mode
es_mx: Recuperando un roboRIO usando el MODO SEGURO
fr_ca: Récupération d’un roboRIO en mode sans échec
tr_tr: Güvenli Modu kullanarak bir roboRIO'yu kurtarma
zh_cn: 使用安全模式恢复roboRIO

source: Occasionally a roboRIO may become corrupted to the point that it cannot be recovered using the normal boot and imaging process. Booting the roboRIO into Safe Mode may allow the device to be successfully re-imaged.
es_mx: Ocasionalmente un roboRIO puede llegar a corromperse hasta el punto que no se pude recuperar usando un encendido normal y procesamiento de imagen. Prendiendo el roboRIO en Modo Seguro puede permitir que el dispositivo se inicie correctamente.
fr_ca: De temps en temps, un roboRIO peut être corrompu au point qu’il ne peut pas être récupéré à l’aide du démarrage normal et du processus de création d'image. Le démarrage du roboRIO en mode sans échec peut permettre de le re-imager avec succès.
tr_tr: Bazen bir roboRIO, normal önyükleme ve görüntüleme işlemi kullanılarak kurtarılamayacak kadar bozulabilir. RoboRIO’yu Güvenli Modda başlatmak, aygıtın başarılı bir şekilde yeniden görüntülenmesini sağlayabilir.
zh_cn: 有时roboRIO可能会损坏，以至于无法使用正常的启动和镜像过程将其恢复。将roboRIO引导到安全模式可以使设备成功恢复镜像。

source: Booting into Safe Mode
es_mx: Iniciando en Modo Seguro
fr_ca: Démarrage en mode sans échec
tr_tr: Güvenli Modda Önyükleme
zh_cn: 进入安全模式

source: A roboRIO with the status light and the reset button highlighted.
fr_ca: Un roboRIO avec le voyant d’état et le bouton de réinitialisation mis en surbrillance.

source: To boot the roboRIO into Safe Mode:
es_mx: Para encender el roboRIO en Modo Seguro:
fr_ca: Pour démarrer le roboRIO en mode sans échec :
tr_tr: RoboRIO'yu Güvenli Modda başlatmak için:
zh_cn: 要将roboRIO引导到安全模式：

source: Apply power to the roboRIO
es_mx: Suministrar voltaje al roboRIO.
fr_ca: Mettez le roboRIO sous tension
tr_tr: RoboRIO'ya güç verin
zh_cn: 给roboRIO通电

source: Press and hold the Reset button until the Status LED lights up (~5 seconds) then release the Reset button
es_mx: Dejar apretado el botón de Reset hasta cuando el LED de Status se encienda (~5 segundos) luego soltar el botón de Reset.
fr_ca: Appuyez et maintenez le bouton Reset jusqu’à ce que le voyant DEL d’état s’allume (~5 secondes), puis relâchez le bouton Reset
tr_tr: Durum LED'i yanana kadar (~ 5 saniye) Sıfırla düğmesini basılı tutun ve ardından “sıfırla” düğmesini bırakın
zh_cn: 按住重置按钮，直到状态LED点亮（约5秒钟），然后松开重置按钮

source: The roboRIO will boot in Safe Mode (indicated by the Status LED flashing in groups of 3)
es_mx: Entonces el roboRIO se iniciará en Modo Seguro (indicado por el LED de estatus parpadeando en grupos de 3)
fr_ca: Le roboRIO démarre en mode sans échec (indiqué par le voyant DEL d’état clignotant dans les groupes de 3)
tr_tr: RoboRIO, Güvenli Modda başlatılacaktır (Durum LED'inin 3'lü gruplar halinde yanıp sönmesi ile gösterilir)
zh_cn: roboRIO将以安全模式启动（状态LED以3次为一组的形式闪烁指示）

source: Recovering the roboRIO
es_mx: Recuperando el roboRIO
fr_ca: Récupération du roboRIO
tr_tr: RoboRIO'yu kurtarma
zh_cn: 恢复roboRIO

source: The roboRIO can now be imaged by using the roboRIO Imaging Tool as described in :ref:`Imaging your roboRIO <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>`.
es_mx: Ahora se puede crear la imagen de la roboRIO utilizando la herramienta Imaging Tool como se describe en :ref:`Imaging your roboRIO <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>`.
fr_ca: Le roboRIO peut maintenant être imagé en utilisant l'outil d'imagerie roboRIO comme décrit dans :ref: `Imaging your roboRIO <docs / zero-to-robot / step-3 / imaging-your-roborio: Imaging your roboRIO>`.
tr_tr: RoboRIO artık roboRIO Görüntüleme Aracı kullanılarak şu bölümde açıklandığı gibi görüntülenebilir :ref:`Imaging your roboRIO <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>`.
zh_cn: 现在可以使用roboRIO镜像工具对roboRIO进行镜像烧录，如ref：`成像roboRIO <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>`中所述。

source: About Safe Mode
es_mx: Acerca del Modo Seguro
fr_ca: À propos du mode sans échec
tr_tr: Güvenli Mod Hakkında
zh_cn: 关于安全模式

source: In Safe Mode, the roboRIO boots a separate copy of the operating system into a RAM Disk. This allows you to recover the roboRIO even if the normal copy of the OS is corrupted. While in Safe Mode, any changes made to the OS (such as changes made by accessing the device via SSH or Serial) will not persist to the normal copy of the OS stored on disk.
es_mx: En el Modo Seguro, el roboRIO inicia por separado una copia del sistema operativo en el disco RAM. Esto le permite recuperar el roboRIO incluso si la copia normal del OS esta corrompida. Mientras este en Modo Seguro, cualquier cambio hecho al OS (como cambios realizados accesando al dispositivo mediante SSH o Serial) no persistirá en la copia normal del OS en el disco.
fr_ca: En mode sans échec, le roboRIO démarre une copie séparée du système d’exploitation dans un disque RAM. Cela vous permet de récupérer le roboRIO même si la copie normale de l’OS est corrompue. En mode sans échec, toutes les modifications apportées au système d’exploitation (telles que les modifications apportées par l’accès à l’appareil via SSH ou Serial) ne persisteront pas à la copie normale du système d’exploitation stockée sur le disque.
tr_tr: Güvenli Modda roboRIO, işletim sisteminin ayrı bir kopyasını bir RAM Diskte başlatır. Bu, işletim sisteminin normal kopyası bozuk olsa bile roboRIO'yu kurtarmanıza olanak tanır. Güvenli Moddayken, işletim sisteminde yapılan herhangi bir değişiklik (aygıta SSH veya Seri yoluyla erişilerek yapılan değişiklikler gibi) diskte depolanan işletim sisteminin normal kopyasında kalmayacaktır.
zh_cn: 在安全模式下，roboRIO将操作系统的单独副本引导到RAM中，并以此启动。即使原操作系统已经损坏，您也可以恢复roboRIO。在安全模式下，对操作系统所做的任何更改（例如通过SSH或串行访问设备所做的更改）都不会保留到磁盘上存储的操作系统的普通副本中。
