Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/roborio-info/roborio-ftp.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: The roboRIO has both SFTP and anonymous FTP enabled. This article describes how to use each to access the roboRIO file system.
es_mx: El roboRIO tiene ambas STFP y anónimas FTP habilitadas. Este artículo describe cómo usar cada una para acceder al archivo del sistema del roboRIO.
fr_ca: Le roboRIO a à la fois les protocoles SFTP et FTP anonyme activés. Cet article décrit comment utiliser chacun pour accéder au système de fichiers du roboRIO.
tr_tr: RoboRIO'da hem SFTP hem de anonim FTP etkin. Bu makale, roboRIO dosya sistemine erişmek için her birinin nasıl kullanılacağını açıklamaktadır.
zh_cn: roboRIO启用了SFTP和匿名FTP。本文介绍如何分别使用这两种方式来访问roboRIO的文件系统。

source: SFTP is the recommended way to access the roboRIO file system. Because you will be using the same account that your program will run under, files copied over should always have permissions compatible with your code.
es_mx: SFTP es la manera recomendada para acceder al archivo del sistema del roboRIO. Porque usted usara la misma cuenta que su programa mientras se ejecuta, archivos copiados siempre deberán tener permisos de compatibilidad de su código.
fr_ca: SFTP est le moyen recommandé d’accéder au système de fichiers roboRIO. Étant donné que vous utiliserez le même compte sous lequel votre programme sera exécuté, les fichiers copiés doivent toujours avoir des autorisations compatibles avec votre code.
tr_tr: SFTP, roboRIO dosya sistemine erişmenin önerilen yoludur. Programınızın altında çalışacağı hesabı kullanacağınız için, üzerine kopyalanan dosyalar her zaman kodunuzla uyumlu izinlere sahip olmalıdır.
zh_cn: 推荐使用SFTP访问roboRIO文件系统。因为您将使用的账户与运行您程序的相同，复制的文件应始终具有与代码兼容的权限。

source: Software
fr_ca: Logiciel
tr_tr: Yazılım
zh_cn: 软件

source: There are a number of freely available programs for SFTP. This article will discuss using FileZilla. You can either download and install `FileZilla <https://filezilla-project.org/download.php?type=client>`__ before proceeding or extrapolate the directions below to your SFTP client of choice.
es_mx: Hay varios programas disponibles gratuitamente para SFTP- Este artículo hablara el uso de FileZilla. Usted puede descargar e instalar `FileZilla <https://filezilla-project.org/download.php?type=client>`__ antes de proceder o extrapolar las direcciones a continuación de su cliente de preferencia,
fr_ca: Il existe un certain nombre de programmes disponibles gratuitement pour le service SFTP. Cet article portera sur l’utilisation de FileZilla. Vous pouvez télécharger et installer `FileZilla <https://filezilla-project.org/download.php?type=client>`__ avant de procéder ou d’extrapoler les instructions ci-dessous à votre client de choix SFTP.
tr_tr: SFTP için ücretsiz olarak kullanılabilen bir dizi program vardır. Bu makale FileZilla'nın kullanımını tartışacaktır. Devam etmeden önce `FileZilla <https://filezilla-project.org/download.php?type=client>`__ indirip kurabilir veya aşağıdaki talimatları SFTP istemcinize aktarabilirsiniz.
zh_cn: 有许多免费的SFTP程序。本文将介绍FileZilla的使用。在继续进行操作之前，您可以下载并安装`FileZilla <https://filezilla-project.org/download.php?type=client>`__，也可以将以下说明推广到您选择的SFTP客户端上。

source: Connecting to the roboRIO
es_mx: Conectarse al roboRIO
fr_ca: Connexion au roboRIO
tr_tr: RoboRIO'ya bağlanma
zh_cn: 连接到roboRIO

source: To connect to your roboRIO:
es_mx: Para conectarse al roboRIO:
fr_ca: Pour vous connecter à votre roboRIO:
tr_tr: RoboRIO'nuza bağlanmak için:
zh_cn: 要连接到roboRIO：

source: Enter the mDNS name (roboRIO-TEAM-frc.local) in the "Host" box
es_mx: Escribir el nombre mDNS (roboRIO-TEAM-frc.local) en la casilla “Host”.
fr_ca: Entrez le nom mDNS (roboRIO-TEAM-frc.local) dans la zone de texte "Host"
tr_tr: "Host" kutusuna mDNS adını (roboRIO-TEAM-frc.local) girin
zh_cn: 在“主机”框中输入mDNS名称（roboRIO-TEAM-frc.local）

source: Enter "lvuser" in the Username box (this is the account your program runs under)
es_mx: Escribir “lvuser” en la casilla Username (es la cuenta con la que se ejecuta el programa)
fr_ca: Entrez "lvuser" dans la zone de texte Username (c’est le compte sous lequel votre programme s’exécute)
tr_tr: Kullanıcı Adı kutusuna "lvuser" girin (bu, programınızın altında çalıştığı hesaptır)
zh_cn: 在“用户名”框中输入“ lvuser”（您的程序在此账户下运行）

source: Leave the Password box blank
es_mx: Dejar vacía la casilla de contraseña.
fr_ca: Laissez vide la zone de texte Password
tr_tr: Parola kutusunu boş bırakın
zh_cn: 将密码框留空

source: Enter "22" in the port box (the SFTP default port)
es_mx: Escribir “22” en el casilla port (el puerto predeterminado SFTP).
fr_ca: Saisissez "22" dans la zone de texte port (le port SFTP par défaut)
tr_tr: Bağlantı noktası kutusuna "22" girin (SFTP varsayılan bağlantı noktası)
zh_cn: 在端口框中输入“ 22”（SFTP默认端口）

source: Click Quickconnect
es_mx: Clic en Quickconnect
fr_ca: Cliquez sur Quickconnect
tr_tr: Quickconnect 'e tıklayın
zh_cn: 单击“快速连接”

source: Browsing the roboRIO filesystem
es_mx: Navegando por el sistema de archivos del roboRIO
fr_ca: Navigation sur le système de fichiers du roboRIO
tr_tr: RoboRIO dosya sistemine göz atma
zh_cn: 浏览roboRIO文件系统

source: After connecting to the roboRIO, Filezilla will open to the \\home\\lvuser directory. The right pane is the remote system (the roboRIO), the left pane is the local system (your computer). The top section of each pane shows you the hierarchy to the current directory you are browsing, the bottom pane shows contents of the directory. To transfer files, simply click and drag from one side to the other. To create directories on the roboRIO, right click and select "Create Directory".
es_mx: Después de conectarse al roboRIO, FileZilla abrirá el directorio \\home\\lvusar. El panel derecho es para el sistema remoto (el roboRIO), el panel izquierdo es para el sistema local (su computadora). La parte superior de cada panel muestra la jerarquía del directorio que está navegando, el panel inferior muestra el contenido del directorio. Para transferir archivos, simplemente dele clic y arrastre de un lado a otro. Para crear directorios en el roboRIO, dar clic con botón derecho y seleccionar “Create Directory”.
fr_ca: Après s’être connecté au roboRIO, Filezilla s’ouvre sur le répertoire \\home\\lvuser. Le volet droit est le système distant (le roboRIO), le volet gauche est le système local (votre ordinateur). La section supérieure de chaque volet vous montre la hiérarchie du répertoire actuel que vous parcourez, le volet inférieur affiche le contenu du répertoire. Pour transférer des fichiers, il suffit de cliquer et de faire glisser d’un côté à l’autre. Pour créer des répertoires sur le roboRIO, cliquez avec le bouton droit et sélectionnez "Create Directory".
tr_tr: RoboRIO'ya bağlandıktan sonra Filezilla, \\home\\lvuser dizinini açacaktır. Sağdaki bölme uzaktaki sistemdir (roboRIO), sol bölme yerel sistemdir (bilgisayarınız). Her bölmenin üst bölümü, göz atmakta olduğunuz geçerli dizinin hiyerarşisini gösterir, alt bölme dizinin içeriğini gösterir. Dosyaları aktarmak için, bir taraftan diğerine tıklayıp sürüklemeniz yeterlidir. RoboRIO'da dizinler oluşturmak için sağ tıklayın ve "Create Directory" u seçin.
zh_cn: 连接到roboRIO后，Filezilla将打开\home\lvuser目录。右窗格是远程系统（roboRIO），左窗格是本地系统（您的计算机）。每个窗格的顶部显示您正在浏览的当前目录的层次结构，底部窗格显示目录的内容。要传输文件，只需单击该文件并从一侧拖动到另一侧。要在roboRIO上创建目录，请右键单击并选择“创建目录”。

source: The roboRIO also has anonymous FTP enabled. It is recommended to use SFTP as described above, but depending on what you need FTP may work in a pinch with no additional software required. To FTP to the roboRIO, open a Windows Explorer window (on Windows 7, you can click Start->My Computer). In the address bar, type ftp://roboRIO-TEAM-frc.local and press enter. You can now browse the roboRIO file system just like you would browse files on your computer.
es_mx: El roboRIO también tiene activado el FTP anónimo. Es recomendado usar el SFTP como se describió anteriormente, pero dependiendo en que necesite FTP puede trabajar sin un software adicional. De FTP al roboRIO, abra una pantalla de Windows Explorer (en Windows 7, usted puede dar clic en Inicio->My computer). En la barra de direcciones, escriba ftp://roboRIO-TEAM-frc.local y presiones enter. Usted ahora puede explorar el sistema de archivos del roboRIO como explora sus archivos en su computadora.
fr_ca: Le roboRIO possède également un servie FTP anonyme activé. Il est recommandé d’utiliser SFTP comme décrit ci-dessus, mais en fonction de ce dont vous avez besoin, le service FTP peut fonctionner comme substitut sans avoir recours à un logiciel supplémentaire. Pour utiliser le FTP au roboRIO, ouvrez une fenêtre de l’Explorateur Windows (sous Windows 7, vous pouvez cliquer sur Démarrer->Mon ordinateur). Dans la barre d’adresses, tapez ftp://roboRIO-TEAM-frc.local et appuyez sur Entrée. Vous pouvez maintenant parcourir le système de fichiers du roboRIO comme vous le feriez pour parcourir les fichiers sur votre ordinateur.
tr_tr: RoboRIO'da ayrıca anonim FTP etkindir. SFTP'yi yukarıda açıklandığı gibi kullanmanız önerilir, ancak neye ihtiyacınız olduğuna bağlı olarak FTP, ek bir yazılım gerektirmeden çalışabilir. RoboRIO'ya FTP ile göndermek için bir Windows Explorer penceresi açın (Windows 7'de Start->My Computer tıklayabilirsiniz). Adres çubuğuna ftp://roboRIO-TEAM-frc.local yazın ve enter tuşuna basın. Artık roboRIO dosya sistemine tıpkı bilgisayarınızdaki dosyalara göz attığınız gibi göz atabilirsiniz.
zh_cn: roboRIO还启用了匿名FTP。建议如上所述使用SFTP，但根据您的需要，FTP可能会在不需要其他软件的情况下正常工作。要通过FTP传输到roboRIO，请打开Windows资源管理器窗口（在Windows 7上，您可以单击开始->我的电脑）。在地址栏中，键入ftp://roboRIO-TEAM-frc.local，然后按Enter键。现在，您可以浏览roboRIO文件系统，就像浏览计算机上的文件一样。
