Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/roborio-info/roborio2-imaging.po
Languages: fr_ca

source: roboRIO 2.0 microSD Card Imaging
fr_ca: Installation de l'image pour le roboRIO 2.0 et la carte microSD

source: The imaging instructions for the NI roboRIO 1.0 are :ref:`here <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>`.
fr_ca: Les instructions pour imager le roboRIO 1.0 sont :ref:`here <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>`.

source: The NI roboRIO 2.0 boots from a microSD card configured with an appropriate boot image containing the NI Linux Real-Time OS, drivers, and libraries specific to FRC. There are two ways to create the microSD card -- with the roboRIO :ref:`using the imaging tool <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>`, or with a laptop and an SD burner application per the instructions on this page.
fr_ca: Le NI roboRIO 2.0 démarre à partir d'une carte microSD configurée avec une image de démarrage appropriée contenant le système d'exploitation NI Linux Real-Time, les pilotes et les librairies spécifiques à FRC. Il existe deux façons de créer la carte microSD -- avec le roboRIO :ref:`à l'aide du logiciel d'installation de l'image <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>`, ou avec un ordinateur portable et une application de gravure SD selon les instructions de cette page.

source: microSD Requirements
fr_ca: Exigences microSD

source: The NI roboRIO 2.0 supports all microSD cards. It is recommended to use a card with 2GB or more of capacity.
fr_ca: Le NI roboRIO 2.0 prend en charge toutes les cartes microSD. Il est recommandé d'utiliser une carte d'une capacité de 2 Go ou plus.

source: Operation Tips
fr_ca: Conseils d'utilisation

source: The NI roboRIO 2.0 requires a fully inserted microSD card containing a valid image in order to boot and operate as intended.
fr_ca: Le NI roboRIO 2.0 nécessite une carte microSD entièrement insérée contenant une image valide afin de démarrer et de fonctionner comme prévu.

source: If the microSD card is removed while powered, the roboRIO will hang. Once the microSD card is replaced, the roboRIO will need to be restarted using the reset button, or be power cycled.
fr_ca: Si la carte microSD est retirée alors qu'elle est sous tension, le roboRIO se bloquera. Une fois la carte microSD remplacée, le roboRIO devra être redémarré à l'aide du bouton de réinitialisation ou éteint.

source: No damage will result from microSD card removal or insertion while powered, but best practice is to perform these operations while unpowered.
fr_ca: Aucun dommage ne résultera du retrait ou de l'insertion de la carte microSD lorsqu'elle est alimentée, mais la meilleure pratique consiste à effectuer ces opérations lorsqu'elle n'est pas alimentée.

source: Imaging Directly to the microSD Card
fr_ca: Créer une image directement sur la carte microSD

source: The image will be transferred to the microSD card using a specialized writing utility, sometimes called a burner. Several utilities are listed below, but most tools that can write arbitrary images for booting a Raspberry Pi or similar dev boards will also produce a bootable SD card for roboRIO 2.0.
fr_ca: L'image sera transférée sur la carte microSD à l'aide d'un utilitaire d'écriture spécialisé, parfois appelé graveur. Plusieurs utilitaires sont répertoriés ci-dessous, mais la plupart des outils capables d'écrire des images arbitraires pour démarrer un Raspberry Pi ou des cartes de développement similaires produiront également une carte SD amorçable pour roboRIO 2.0.

source: Supported image files are named ``FRC_roboRIO2_YEAR_VERSION.img.zip``. You can locate them by clicking the SD button in the roboRIO Imaging tool and then navigating to the ``SD Images`` folder. It is generally best to use the latest version of the image.
fr_ca: Les fichiers image pris en charge sont nommés ``FRC_roboRIO2_YEAR_VERSION.img.zip``. Vous pouvez les localiser en cliquant sur le bouton SD dans l'outil d'imagerie roboRIO, puis en naviguant jusqu'au dossier ``Images SD``. Il est généralement préférable d'utiliser la dernière version de l'image.

source: If using a non Windows OS you will need to copy this image file to that computer.
fr_ca: Si vous utilisez un système d'exploitation autre que Windows, vous devrez copier ce fichier image sur cet ordinateur.

source: Click the SD folder icon will bring up the location of the images in windows explorer.
fr_ca: Cliquez sur l'icône du dossier SD pour afficher l'emplacement des images dans l'explorateur Windows.

source: A `microSD to USB dongle <https://www.amazon.com/gp/product/B0779V61XB>`__ works well for writing to microSD cards.
fr_ca: Un `dongle microSD vers USB <https://www.amazon.com/gp/product/B0779V61XB>`__ fonctionne bien pour écrire sur des cartes microSD.

source: Raspberry Pi images will not boot on a roboRIO because the OS and drivers are incompatible. Similarly, a roboRIO image is not compatible with Raspberry Pi controller boards.
fr_ca: Les images Raspberry Pi ne démarreront pas sur un roboRIO car le système d'exploitation et les pilotes sont incompatibles. De même, une image roboRIO n'est pas compatible avec les cartes contrôleurs Raspberry Pi.

source: Writing the image with balenaEtcher
fr_ca: Ecrire l'image avec balenaEtcher

source: Download and install `balenaEtcher <https://www.balena.io/etcher/>`__.
fr_ca: Téléchargez et installez `balenaEtcher <https://www.balena.io/etcher/>`__.

source: Launch
fr_ca: Lancer le programme

source: :guilabel:`Flash from file` -> locate the image file you want to copy to the microSD card
fr_ca: :guilabel:`Flash from file` -> localisez le fichier image que vous souhaitez copier sur la carte microSD

source: :guilabel:`Select target` -> select the destination microSD device
fr_ca: :guilabel:`Select target` -> sélectionnez le périphérique microSD de destination

source: Press :guilabel:`Flash`
fr_ca: Appuyez sur :guilabel:`Flash`

source: Writing the image with Raspberry Pi Imager
fr_ca: Écrire l'image avec Raspberry Pi Imager

source: Download and install from `Raspberry Pi Imager <https://www.raspberrypi.com/software/>`__.
fr_ca: Téléchargez et installez depuis `Raspberry Pi Imager <https://www.raspberrypi.com/software/>`__.

source: :guilabel:`Choose OS` -> :guilabel:`Use Custom` -> select the image file you want to copy to the microSD card
fr_ca: :guilabel:`Choose OS` -> :guilabel:`Use Custom` -> sélectionnez le fichier image que vous souhaitez copier sur la carte microSD

source: :guilabel:`Choose Storage` -> select the destination microSD device
fr_ca: :guilabel:`Choose Storage` -> sélectionnez le périphérique microSD de destination

source: Press :guilabel:`Write`
fr_ca: Appuyez sur :guilabel:`Write`

source: After writing the image, Windows may prompt to format the drive. Do not reformat, or else you will need to write the image again.
fr_ca: Après avoir écrit l'image, Windows peut vous demander de formater le lecteur. Ne reformatez pas, sinon vous devrez réécrire l'image.

source: Setting the roboRIO Team Number
fr_ca: Définition du numéro d'équipe dans le roboRIO

source: The image writing process above does not set a team number. To fix this teams will need to insert the microSD card in the robRIO and connect to the robot. With the roboRIO Imaging Tool go to :guilabel:`Edit Startup Settings`. Next, fill out the :guilabel:`Team Number` box and hit :guilabel:`Apply`.
fr_ca: Le processus d'écriture d'image ci-dessus ne définit pas de numéro d'équipe. Pour résoudre ce problème, les équipes devront insérer la carte microSD dans le robRIO et se connecter au robot. Avec l'outil d'imagerie roboRIO, accédez à :guilabel:`Edit Startup Settings`. Ensuite, remplissez la case :guilabel:`Team Number` et appuyez sur :guilabel:`Apply`.

source: The edit Startup Settings portion of the imaging utility allow a team to renumber their robot.
fr_ca: La partie Modifier les paramètres de démarrage de l'utilitaire d'imagerie permet à une équipe de renuméroter son robot.
