Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/roborio-info/roborio-brownouts.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Start assigning your available current to these functions. You will likely find that you run out pretty quickly. Many teams gear their drivetrain to have enough torque to slip their wheels at 40-50A of current draw per motor. If we have 4 motors on the drivetrain, that eats up most, or even exceeds, our power budget! This means that we may need to put together a few scenarios and understand what functions can (and need to be) be used at the same time. In many cases, this will mean that you really need to limit the current draw of the other functions if/while your robot is maxing out the drivetrain (such as trying to push something). Benchmarking the "driving" current requirements of a drivetrain for some of these alternative scenarios is a little more complex, as it depends on many factors such as number of motors, robot weight, gearing, and efficiency. Current numbers for other functions can be done by calculating the power required to complete the function and estimating efficiency (if the mechanism has not been designed) or by determining the torque load on the motor and using the torque-current curve to determine the current draw of the motors.
es_mx: Empezar a asignar la corriente disponible a dichos mecanismos. Probablemente encontrara que se acaba rápidamente. Muchos equipos adaptan su chasis para tener suficiente torque y poder deslizar sus llantas a un consumo de corriente de 40-50A por motor. Si se tienen 4 motores en el chasis, eso consume casi todo, o incluso lo sobrepasa, el presupuesto de consumo de corriente. Esto significa que se debe de tener en cuenta varios escenarios y comprender que funciones pueden (y necesitan ser) usadas al mismo tiempo. En varios casos, esto significa que usted realmente necesita establecer un límite al consumo de la corriente de otros mecanismos si/mientras su robot está exigiendo al máximo al chasis (mientras trata de empujar algo). Una evaluación comparativa de los requisitos de la corriente de “tracción” de un chasis para algunos de estos escenarios alternos es un poco más compleja, ya que depende de varios factores como el número de motores, peso del robot, transmisiones y su eficiencia. La corriente para otros mecanismos se puede obtener calculando la corriente requerida para completar su función y estimar su eficiencia (si el mecanismo no ha sido diseñado) o determinando el torque en el motor y usando la curva de toque-corriente para determinar el consumo de corriente del motor.
fr_ca: Commencez à assigner votre courant disponible à ces fonctions. Vous trouverez probablement que vous vous déplacez assez rapidement. Beaucoup d’équipes conçoivent leur transmission pour avoir assez de couple pour faire glisser leurs roues en tirant de 40A à 50A par moteur. Si nous avons 4 moteurs sur la transmission, ce qui consomme l'essentiel de, ou même dépasse, notre budget de puissance! Cela signifie que nous pourrions avoir besoin de mettre en place quelques scénarios et comprendre quelles fonctionnalités peuvent (et doivent être) être utilisées en même temps. Dans de nombreux cas, cela signifiera que vous avez vraiment besoin de limiter l'appel de courant des autres fonctions si/alors que votre robot sollicite au maximum la transmission (comme en essayant de pousser quelque chose). L’évaluation des exigences en terme de consommation de courant, pendant le déplacement, de la base pilotable pour certains de ces scénarios alternatifs est un peu plus complexe, car elle dépend de nombreux facteurs comme le nombre de moteurs, le poids du robot, l'engrenage et l’efficacité. L'évaluation quantitative du courant absorbé pour d’autres fonctions peuvent être faite en calculant la puissance nécessaire pour compléter la fonction et en estimant l’efficacité (si le mécanisme n’a pas été dimensionné) ou en déterminant la charge de couple sur le moteur et en utilisant la courbe de couple-courant pour déterminer l'appel de courant des moteurs.
tr_tr: Mevcut akımınızı bu fonksiyonlara atamaya başlayın. Muhtemelen çok çabuk tükendiğini göreceksin. Pek çok takım, tekerleklerini motor başına 40-50A akım çekişinde kaydırmak için yeterli torka sahip olacak şekilde aktarma organlarını donatıyor. Aktarma sisteminde en çok yiyen, hatta güç bütçemizi aşan 4 motorumuz varsa! Bu, birkaç senaryoyu bir araya getirmemiz ve aynı anda hangi işlevlerin kullanılabileceğini (ve kullanılması gerektiğini) anlamamız gerekebileceği anlamına gelir. Çoğu durumda, bu, robotunuz aktarma organlarını maksimize ederken (bir şeyi itmeye çalışmak gibi) diğer işlevlerin mevcut çekimini gerçekten sınırlamanız gerektiği anlamına gelir. Bu alternatif senaryolardan bazıları için bir aktarma organının mevcut "sürüş" gereksinimlerini kıyaslamak biraz daha karmaşıktır çünkü motor sayısı, robot ağırlığı, vites ve verimlilik gibi birçok faktöre bağlıdır. Diğer işlevler için akım sayıları, işlevi tamamlamak için gereken gücü hesaplayarak ve verimliliği tahmin ederek (mekanizma tasarlanmamışsa) veya motor üzerindeki tork yükünü belirleyerek ve akım çekimini belirlemek için tork-akım eğrisini kullanarak yapılabilir.
zh_cn: 开始为这些功能分配可用电流。您可能发现，可用电流马上就用完了。许多车队的动力传动系统具有足够的扭矩，以使每个电动机在消耗电流40-50A时能够使车轮运转。如果我们的传动系统上有4台电动机，消耗的功率将吃满，甚至超过我们的预算！这意味着我们可能需要整合一些场景，并了解可以（并且需要）同时使用哪些功能。本例中，这意味着在大多数时候，如果/当机器人的动力传动系统满功率运转（例如尝试推动某些东西）时，您需要限制其他功能的电流消耗。在其他情况下，如动力传动系统“驾驶”时，对于当前电流要求进行测试会稍微复杂一点，它取决于许多因素：例如电动机数量，机器人重量，传动装置和效率。其他功能的电流数可以通过计算完成功能所需的功率和估算效率（如果机构尚未设计）来确定，电机的电流消耗可以通过查看电动机上的扭矩负载和扭矩-电流曲线来确定电流消耗来得到。

source: If you have determined mutually exclusive functions in your analysis, consider enforcing the exclusion in software. You may also use the current monitoring of the PDP (covered in more detail below) in your robot program to provide output limits or exclusions dynamically (such as don't run a mechanism motor when the drivetrain current is over X or only let the motor run up to half output when the drivetrain current is over Y).
es_mx: Si usted ha determinado funciones mutuamente exclusivas en su análisis, considere la posibilidad de forzar la exclusión en el programa. Usted también puede usar el monitor actual de la corriente del PDP (explicado más detalle a continuación) en su programa del robot para proveer límites de salida o exclusiones dinámicas (por ejemplo, no encender un motor de un mecanismo cuando la corriente del chasis este por encima de X o solamente permita a un motor trabajar a la mitad de su capacidad cuando la corriente el chasis este por encima de Y).
fr_ca: Si vous avez déterminé des fonctions mutuellement exclusives dans votre analyse, envisagez d’appliquer l’exclusion dans le logiciel. Vous pouvez également utiliser la surveillance du courant du PDP (couvert plus en détail ci-dessous) dans votre programme robot pour obtenir des limites de sortie ou des exclusions dynamiquement (comme ne pas actionner un moteur de mécanisme lorsque le courant de transmission est supérieur à X ou seulement laisser le moteur fonctionner jusqu’à la moitié de sortie maximale lorsque le courant de transmission est au-dessus de Y).
tr_tr: Analizinizde karşılıklı olarak birbirini dışlayan işlevler belirlediyseniz, yazılımda dışlamayı zorunlu kılmayı düşünün. Ayrıca, çıktı limitleri veya istisnaları dinamik olarak sağlamak için (örneğin, aktarma organı akımı X'in üzerinde olduğunda bir mekanizma motorunu çalıştırmayın veya yalnızca motora izin vermeyin), robot programınızda PDP'nin akım izlemesini (aşağıda daha ayrıntılı olarak ele alınmıştır) kullanabilirsiniz. aktarma organı akımı Y'nin üzerinde olduğunda çıkışın yarısına kadar çalıştırın.
zh_cn: 如果您在分析中确定了互斥功能，请考虑在在软件中加强体现。您还可以在机器人程序中使用PDP电流监控（下面将详细介绍）来动态设置输出限制或排除（例如，当传动系统电流超过X时不要运行机械马达，或者当传动系统电流超过Y时仅让马达半功率运行）。

source: Settable Brownout
fr_ca: Brownout réglable

source: The NI roboRIO 1.0 does not support custom brownout voltages. It is fixed at 6.3V as mentioned in Stage 2 above.
fr_ca: Le NI roboRIO 1.0 ne prend pas en charge les tensions de brownout personnalisées. Il est fixé à 6.3 V comme mentionné à l’étape 2 ci-dessus.

source: The NI roboRIO 2.0 adds the option for a software settable brownout level. The default brownout level (Stage 2) of the roboRIO 2.0 is 6.75V.
fr_ca: Le NI roboRIO 2.0 ajoute l’option pour un niveau de brownout réglable par logiciel. Le niveau de brownout par défaut (étape 2) du roboRIO 2.0 est de 6.75 V.

source: Measuring Current Draw using the PDP/PDH
fr_ca: Mesure de la consommation de courant à l’aide du PDP/PDH

source: The FRC\ |reg| Driver Station works in conjunction with the roboRIO and PDP/PDH to extract logged data from the PDP/PDH and log it on your DS PC. A viewer for this data is still under development.
fr_ca: L'application Driver Station FRC\ |reg| travaille en conjonction avec le roboRIO et le PDP/PDH pour extraire les données enregistrées du PDP/PDH et les enregistrer sur votre PC DS. Un visionneur pour ces données est encore en développement.

source: In the meantime, teams can use their robot code and manual logging, a LabVIEW front panel or the SmartDashboard to visualize current draw on their robot as mechanisms are developed. In LabVIEW, you can read the current on a PDP/PDH channel using the Get PD Currents VI found on the Power pallet. For C++ and Java teams, use the PowerDistribution class as described in the :doc:`Power Distribution </docs/software/can-devices/power-distribution-module>` article. Plotting this information over time (easiest with a LV Front Panel or with the SmartDashboard by using a Graph indicator can provide information to compare against and update your power budget or can locate mechanisms which do not seem to be performing as expected (due to incorrect load calculation, incorrect efficiency assumptions, or mechanism issues such as binding).
fr_ca: En attendant, les équipes peuvent utiliser leur code robot et l'enrégistrement manuel, un panneau avant LabVIEW ou le SmartDashboard pour visualiser la consommation actuelle de courant de leur robot au fur et à mesure que les mécanismes entrent en action. Sous LabVIEW, vous pouvez lire le courant sur un canal PDP/PDH à l’aide l'instrument virtuel Get PD Currents qui se trouve dans la palette Power. Pour les équipes C++ et Java, utilisez la classe PowerDistribution comme décrit dans l'article :doc:`Power Distribution </docs/software/can-devices/power-distribution-module>`. Tracer ces informations au fil du temps (plus facile avec un panneau avant LV ou avec le SmartDashboard à l’aide d’un indicateur graphique) peut fournir des informations pour comparer et mettre à jour votre budget de puissance ou peut localiser des mécanismes qui ne semblent pas fonctionner comme prévu (en raison d’un calcul de charge incorrect, d’hypothèses d’efficacité incorrectes ou de problèmes de mécanisme tels que la liaison).

source: Identifying Brownouts
es_mx: Identificar caídas de tensión
fr_ca: Identification des baisses de tension
tr_tr: Kesintileri Tanımlama
zh_cn: 识别掉电

source: The easiest way to identify a brownout is by clicking on the CAN\\Power tab of the DS and checking the 12V fault count. Alternately, you can review the Driver Station Log after the fact using the Driver Station Log Viewer. The log will identify brownouts with a bright orange line, such as in the image above (note that these brownouts were induced with a benchtop supply and may not reflect the duration and behavior of brownouts on a typical FRC robot).
es_mx: La manera más sencilla de identificar una caída de tensión es dando clic en la pestaña de CAN\Power de la DS y revisar el contador de la falla de 12V. Al mismo tiempo, puede revisar el registro de la Driver Station después de usar el Driver Station Log Viewer. Este registro identificará caídas de tensión con una línea naranja brillante, tal como de la imagen a continuación (nota, estas caídas de tensión fueron introducidas con un osciloscopio y no reflejan la duración ni el comportamiento típico de caídas de tensión en un robot de FRC).
fr_ca: La façon la plus simple d’identifier une baisse de tension est de cliquer sur l’onglet CANPower de la Driver Station et de vérifier le nombre de défauts 12V. Alternativement, vous pouvez consulter le journal de la Driver Station après coup à l’aide du visionneur de journal. Le journal indiquera les baisses de tension avec une ligne orange vif, comme dans l’image ci-dessus (notez que ces baisses de tension ont été induites avec une alimentation sur un banc d'essai et peuvent ne pas refléter la durée et le comportement des baisses de tension sur un robot FRC typique).
tr_tr: Bir voltaj düşmesini belirlemenin en kolay yolu, DS'nin CAN \\ Güç sekmesine tıklamak ve 12V hata sayısını kontrol etmektir. Alternatif olarak, Driver Station Log Viewer'ı kullandıktan sonra Driver Station Log'u gözden geçirebilirsiniz. Günlük, yukarıdaki görüntüdeki gibi parlak turuncu bir çizgi ile kesintileri belirleyecektir (bu kesintilerin bir tezgah üstü beslemeyle indüklendiğini ve tipik bir FRC robotundaki kesintilerin süresini ve davranışını yansıtmayabileceğini unutmayın).
zh_cn: 识别掉电的最简单方法是单击DS的CAN\Power选项卡，然后检查12V故障计数。或者，您可以在发现掉电后使用Driver Station Log Viewer查看Driver Station Log。该日志将用亮橙色线标识掉电情况，如上图所示（请注意，这些掉电是由台式电源引起的，可能无法反映通常发生的FRC机器人掉电的持续时间和行为）。

source: Measuring Current Draw using the PDP
es_mx: Medición de consumo de corriente usando PDP
tr_tr: PDP kullanarak Akım Çekimini Ölçme

source: The FRC\ |reg| Driver Station works in conjunction with the roboRIO and PDP to extract logged data from the PDP and log it on your DS PC. A viewer for this data is still under development.
es_mx: La Driver Station de FRC\ |reg| trabaja en conjunto con el roboRIO y PDP para extraer los datos ingresados por el PDP y registrados en su DS PC. El monitoreo de esta información está aún bajo desarrollo.

source: Establish the max "sustained" current draw (with sustained being loosely defined here as not momentary). This is probably the most difficult part of creating the power budget. The exact current draw a battery can sustain while maintaining a voltage of 7+ volts is dependent on a variety of factors such as battery health and state of charge. As shown in the `NP18-12 data sheet <https://www.farnell.com/datasheets/575631.pdf>`__, the terminal voltage chart gets very steep as state of charge decreases, especially as current draw increases. This datasheet shows that at 3CA continuous load (54A) a brand new battery can be continuously run for over 6 minutes while maintaining a terminal voltage of over 7V. As shown in the image above (used with permission from `Team 234s Drive System Testing document <https://www.chiefdelphi.com/t/paper-new-control-functions-drive-system-testing/139165>`__), even with a fresh battery, drawing 240A for more than a second or two is likely to cause an issue. This gives us some bounds on setting our sustained current draw. For the purposes of this exercise, we'll set our limit at 180A.
tr_tr: Maksimum "sürekli" akım çekişini oluşturun (burada geçici değil olarak gevşek bir şekilde tanımlanmış sürekli olarak). Bu muhtemelen güç bütçesi oluşturmanın en zor kısmıdır. Bir pilin çekebileceği kesin akım, 7+ voltluk bir voltajı korurken dayanabilir, pil sağlığı ve şarj durumu gibi çeşitli faktörlere bağlıdır. `NP18-12 veri sayfası <https://www.farnell.com/datasheets/575631.pdf>`__ 'de gösterildiği gibi, özellikle akım çekişi arttıkça, şarj durumu azaldıkça terminal voltaj tablosu çok dikleşir. Bu veri sayfası, 3CA sürekli yükte (54A) yepyeni bir pilin, 7V'un üzerinde bir terminal voltajı korurken 6 dakikadan fazla sürekli çalıştırılabileceğini göstermektedir. Yukarıdaki resimde gösterildiği gibi (`Team 234s Drive System Testing document <https://www.chiefdelphi.com/t/paper-new-control-functions-drive-system-testing/139165>` __ izniyle kullanılmıştır), yeni bir pille bile bir veya iki saniyeden fazla 240A çekmek bir soruna neden olabilir. Bu, bize sürekli mevcut çekimimizi belirleme konusunda bazı sınırlar veriyor. Bu alıştırmanın amaçları doğrultusunda, sınırımızı 180A olarak belirleyeceğiz.

source: In the meantime, teams can use their robot code and manual logging, a LabVIEW front panel or the SmartDashboard to visualize current draw on their robot as mechanisms are developed. In LabVIEW, you can read the current on a PDP channel using the PDP Channel Current VI found on the Power pallet. For C++ and Java teams, use the PowerDistributionPanel class as described in the Power Distribution Panel article. Plotting this information over time (easiest with a LV Front Panel or with the SmartDashboard by using a Graph indicator can provide information to compare against and update your power budget or can locate mechanisms which do not seem to be performing as expected (due to incorrect load calculation, incorrect efficiency assumptions, or mechanism issues such as binding).
tr_tr: Bu arada ekipler, mekanizmalar geliştirilirken robotlarındaki mevcut çizimi görselleştirmek için robot kodunu ve manuel günlük kaydını, bir LabVIEW ön panelini veya SmartDashboard'u kullanabilir. LabVIEW'de, Güç paletinde bulunan PDP Kanalı Akım VI'yı kullanarak bir PDP kanalındaki akımı okuyabilirsiniz. C ++ ve Java ekipleri için Power Distribution Panel sınıfını Güç Dağıtım Paneli makalesinde açıklandığı gibi kullanın. Bu bilgilerin zaman içinde grafiğini çizmek en kolayı bir LV Ön Panel ile veya bir Grafik göstergesi kullanarak SmartDashboard ile güç bütçenizi karşılaştırmak ve güncellemek için bilgi sağlayabilir veya beklendiği gibi çalışmayan mekanizmaları bulabilir (yanlış yük nedeniyle, hesaplama, yanlış verimlilik varsayımları veya bağlama gibi mekanizma sorunları).
