Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/roborio-info/roborio-web-dashboard.po
Languages: es_mx, fr_ca, tr_tr

source: roboRIO Web Dashboard
fr_ca: Tableau de bord Web du roboRIO
tr_tr: roboRIO Web Dashboard - Web Kontrol Paneli

source: The roboRIO web dashboard is a webpage built into the roboRIO that can be used for checking status and updating settings of the roboRIO.
es_mx: El roboRIO web DashBoard es una página web compilada en el roboRIO que puede ser usada para comprobar el estado y configuraciones de las actualizaciones del roboRIO.
fr_ca: Le tableau de bord web roboRIO est une page Web intégrée dans le roboRIO qui peut être utilisée pour vérifier l’état et mettre à jour les paramètres du roboRIO.
tr_tr: RoboRIO web kontrol paneli, roboRIO'nun durumunu kontrol etmek ve ayarları güncellemek için kullanılabilen roboRIO'da yerleşik bir web sayfasıdır.

source: Unlike the 2015-2018 roboRIO web dashboard, the 2019 web dashboard does not use SilverLight. Users may encounter issues using IE (compatibility) or Edge (mDNS site access). Alternate browsers such as Google Chrome or Mozilla Firefox are recommended for the best experience.
tr_tr: 2015-2018 roboRIO web panosunun aksine, 2019 web panosu SilverLight kullanmaz. Kullanıcılar, IE (uyumluluk) veya Edge (mDNS site erişimi) kullanırken sorunlarla karşılaşabilir. En iyi deneyim için Google Chrome veya Mozilla Firefox gibi alternatif tarayıcılar önerilir.

source: The roboRIO web dashboard was been re-written for 2019. All CAN configuration functionality has been removed. Configuration of CAN devices should be done with software provided by the device vendor. For CTRE devices previously serviced using the webdashboard, the appropriate software is `CTRE Phoenix Tuner <https://phoenix-documentation.readthedocs.io/en/latest/ch03_PrimerPhoenixSoft.html#what-is-phoenix-tuner>`__.
tr_tr: RoboRIO web kontrol paneli 2019 için yeniden yazılmıştır. Tüm CAN yapılandırma işlevleri kaldırılmıştır. CAN cihazlarının konfigürasyonu, cihaz satıcısı tarafından sağlanan yazılım ile yapılmalıdır. Daha önce web panosu kullanılarak hizmet verilen CTRE cihazları için uygun yazılım ``CTRE Phoenix Tuner <https://phoenix-documentation.readthedocs.io/en/latest/ch03_PrimerPhoenixSoft.html#what-is-phoenix-tuner>`__ dir.

source: Opening the WebDash
es_mx: Abriendo el WebDash
fr_ca: Ouverture de l'interface Web
tr_tr: Webdash'i açma

source: To open the web dashboard, open a web browser and enter the address of the roboRIO into the address bar (172.22.11.2 for USB, or "roboRIO-####-FRC.local where #### is your team number, with no leading zeroes, for either interface). See this document for more details about mDNS and roboRIO networking: :ref:`docs/networking/networking-introduction/ip-configurations:IP Configurations`
es_mx: Para abrir el web DashBoard, abrir un navegador e ingrese la dirección del roboRIO en la barra de direcciones (172.22.11.2 para USB, o “roboRIO-####-FRC.local donde #### es el número de su equipo, sin ceros al inicio, para cualquier interfaz). Ver el documento para más detalles acerca mDNS y red roboRIO: :ref:`docs/networking/networking-introduction/ip-configurations:IP Configurations`
fr_ca: Pour ouvrir le tableau de bord Web, ouvrez un navigateur Web et entrez l’adresse du roboRIO dans la barre d’adresses (172.22.11.2 pour USB, ou "roboRIO-#####-FRC.local où #### est votre numéro d’équipe, sans zéros en tête, pour l’une ou l’autre interface). Pour plus de détails sur les configurations mDNS et roboRIO, consultez le document suivant: :ref:`docs/networking/networking-introduction/ip-configurations:IP Configurations`
tr_tr: Web kontrol panelini açmak için bir web tarayıcısı açın ve adres çubuğuna roboRIO'nun adresini girin (USB için 172.22.11.2 veya "roboRIO-####-FRC.local" burada #### takım numaranızdır, her iki arayüz için de başında sıfır olmadan). mDNS ve roboRIO ağ oluşturma hakkında daha fazla ayrıntı için bu belgeye bakın: :ref:`docs/networking/networking-introduction/ip-configurations:IP Configurations`

source: System Configuration Tab
es_mx: Pestaña de configuración del sistema
fr_ca: Onglet System Configuration
tr_tr: Sistem Yapılandırması Sekmesi

source: The home screen of the web dashboard is the System Configuration tab which has 5 main sections:
es_mx: La pantalla de inicio del web Dashboard es la pestaña de configuración del sistema la cual tiene 5 secciones principales:
fr_ca: La fenêtre d’accueil du tableau de bord Web est l’onglet *System Configuration* qui consiste en 5 sections principales :
tr_tr: Web panosunun ana ekranı, 5 ana bölümden oluşan System Configuration-Sistem Yapılandırması sekmesidir:

source: Navigation Bar - This section allows you to navigate to different sections of the web dashboard. The different pages accessible through this navigation bar are discussed below.
es_mx: Barra de navegación - Esta sección le permite navegar a diferentes secciones del web Dashboard. Las diferentes paginas accesibles mediante esta barra de navegación se comentará abajo.
fr_ca: Barre de navigation - Cette section vous permet de naviguer vers différentes sections du tableau de bord Web. Les différentes pages accessibles par cette barre de navigation sont discutées ci-dessous.
tr_tr: Gezinme Çubuğu - Bu bölüm, web panosunun farklı bölümlerine gitmenize olanak tanır. Bu gezinme çubuğundan erişilebilen farklı sayfalar aşağıda tartışılmıştır.

source: System Settings - This section contains information about the System Settings. The Hostname field should not be modified manually, instead use the roboRIO Imaging tool to set the Hostname based on your team number. This section contains information such as the device IP, firmware version and image version.
es_mx: Configuración del sistema - Esta sección contiene la información acerca de la configuración de sistema. El campo del Hostname no deberá ser modificado manualmente, en su lugar se deberá usar la herramienta Imaging del roboRIO para establecer el Hostname basado en el número de su equipo. Esta sección contiene información tal como la IP del dispositivo, la versión del firmware y la versión de la imagen.
fr_ca: System Settings - Cette section contient des informations sur les paramètres système. Le champ *Hostname* ne doit pas être modifié manuellement, utilisez plutôt l’outil *roboRIO Imaging tool* pour définir le nom d’hôte en fonction de votre numéro d’équipe. Cette section contient des informations telles que l'adresse IP du périphérique, la version du firmware et la version de l'image.
tr_tr: System Settings - Bu bölüm Sistem Ayarları ile ilgili bilgileri içerir. Ana bilgisayar adı alanı manuel olarak değiştirilmemelidir, bunun yerine ana bilgisayar adını takım numaranıza göre ayarlamak için roboRIO Imaging Tool aracını kullanın. Bu bölüm, aygıt IP'si, donanım yazılımı sürümü ve imaj sürümü gibi bilgileri içerir.

source: Startup Settings - This section contains Startup settings for the roboRIO. These are described in the sub-step below
es_mx: Configuración de inicio - Esta sección contiene la configuración de inicio del roboRIO. Estos se describirán los siguientes pasos.
fr_ca: Startup Settings - Cette section contient les paramètres de démarrage du roboRIO. Celles-ci sont décrites dans la sous-étape ci-dessous
tr_tr: Başlangıç Ayarları - Bu bölüm roboRIO için Startup - Başlangıç ayarlarını içerir. Bunlar aşağıdaki alt adımda açıklanmaktadır

source: System Resources (not pictured) - This section provides a snapshot of system resources such as memory and CPU load.
es_mx: Recursos del sistema (sin imagen): Esta sección proporciona una imagen de los recursos del sistema tal como la memoria y la carga de la CPU.
fr_ca: System Resources (pas montré) - Cette section fournit un instantané des ressources système telles que la mémoire et la charge du processeur.
tr_tr: System Resources (resimde gösterilmemiştir) - Bu bölüm, bellek ve CPU yükü gibi sistem kaynaklarının anlık görüntüsünü sağlar.

source: Startup Settings
es_mx: Configuración de Inicio
tr_tr: Startup Settings-Başlangıç Ayarları

source: Force Safe Mode - Forces the controller into Safe Mode. This can be used with troubleshooting imaging issues, but it is recommended to use the Reset button on the roboRIO to put the device into Safe Mode instead (with power already applied, hold the rest button for 5 seconds). **Default is unchecked.**
es_mx: Modo de forzado seguro - Forzar el controlador de manera segura. Esto puede usarse para solucionar problemas de imagen, pero es recomendado usar el botón de Reset en el RoboRIO para poder el dispositivo en Modo seguro (con voltaje, apretar el botón Reset por 5 segundos). **Valor de casilla predeterminado, no marcado.**
fr_ca: Force Safe Mode - Force le contrôleur en mode sans échec. Cela peut être utilisé dans le dépannage des problèmes en lien avec l’image du roboRIO, mais il est plutôt recommandé d’utiliser le bouton Reset sur le roboRIO pour mettre l’appareil en mode sans échec (avec l'alimentation déjà branchée et établie, maintenez le bouton de repos pendant 5 secondes). **La valeur par défaut n’est pas cochée.**
tr_tr: Güvenli Modu Zorla - Denetleyiciyi Safe Mode-Güvenli Mod'a zorlar. Bu, imaj yükleme sorunlarını gidermek için kullanılabilir, ancak bunun yerine cihazı Güvenli Mod'a geçirmek için roboRIO üzerindeki Sıfırla düğmesini kullanmanız önerilir (güç zaten uygulanmış haldeyken rest düğmesini 5 saniye basılı tutun). **Varsayılan olarak işaretli değildir.**

source: Enable Console Out - This enables the on-board RS232 port to be used as a Console output. It is recommended to leave this enabled unless you are using this port to talk to a serial device (note that this port uses RS232 levels and and should not be connected to many microcontrollers which use TTL levels). **Default is checked.**
es_mx: Habilitar salida de consola - Esto habilita en la placa el puerto RS323 para ser usado como salida de consola. Es recomendado dejar esto habilitado a menos que vaya a usar este puerto para comunicación serial con un dispositivo (nota, tenga en cuenta que ese puerto usa niveles RS232 y no debe conectarse a muchos micro controladores que usan niveles TTL). **Valor de casilla predeterminado, marcado.**
fr_ca: Enable Console Out - Ce paramètre permet d’utiliser le port RS232 intégré comme sortie console. Il est recommandé de cocher cette case à moins que vous n’utilisiez ce port pour communiquer avec un dispositif série (notez que ce port utilise des niveaux RS232 et ne devrait pas être connecté à de nombreux microcontrôleurs qui utilisent des niveaux TTL). **La valeur par défaut est cochée.**
tr_tr: Enable Console Out - Bu, yerleşik RS232 bağlantı noktasının Konsol çıkışı olarak kullanılmasını sağlar. Bu bağlantı noktasını bir seri aygıtla konuşmak için kullanmıyorsanız bunu etkin bırakmanız önerilir (bu bağlantı noktasının RS232 düzeylerini kullandığını ve TTL düzeylerini kullanan birçok mikro denetleyiciye bağlanmaması gerektiğini unutmayın). **Varsayılan işaretlidir.**

source: Disable RT Startup App - Checking this box disables code from running at startup. This may be used for troubleshooting if you find the roboRIO is unresponsive to new program download. Default is unchecked
es_mx: Aplicación para deshabilitar RT Startup - Marcar esta casilla inhabilita el código para ejecutarse al inicio. Esto puede ser usado para solucionar problemas cuando el roboRIO no responde a un programa nuevo descargado. Valor de casilla predeterminado, no marcado.
fr_ca: Disable RT Startup App - Cocher cette case désactive l’exécution du code au démarrage. Ce paramètre peut être utilisé pour le dépannage si vous trouvez que le roboRIO ne réagit pas après le déploiement d'un nouveau programme. Par défaut, cette case n’est pas cochée
tr_tr: Disable RT Startup App - Bu kutuyu işaretlemek, kodun başlangıçta çalışmasını devre dışı bırakır. RoboRIO'nun yeni program indirmeye yanıt vermediğini fark ederseniz, bu sorun giderme için kullanılabilir. Varsayılan işaretli değil

source: Disable FPGA Startup App - **This box should not be checked.**
es_mx: Aplicación para deshabilitar FPGA Startup - **Esta casilla no debe ser marcada.**
fr_ca: Disable FPGA Startup App - **Cette case ne doit pas être cochée.**
tr_tr: Disable FPGA Startup App - **Bu kutu işaretlenmemelidir.**

source: Enable Secure Shell Server (sshd) - **It is recommended to leave this box checked.** This setting enables SSH which is a way to remotely access a console on the roboRIO. Unchecking this box will prevent C++ and Java teams from loading code onto the roboRIO.
es_mx: Enable Secure Shell Server (sshd) – **Es recomendado dejar esta casilla marcada.** Esta configuración habilita SSH lo cual es una forma de acceder de forma remota a la consola en el roboRIO. Desmarcar esta casilla evitará que los equipos C++ and Java carguen código en el roboRIO.
fr_ca: Enable Secure Shell Server (sshd) - **Il est recommandé de laisser cette case cochée**. Ce paramètre active le protocole SSH qui est un moyen d’accéder à distance à une console sur le roboRIO. Décocher cette case empêchera les équipes C++ et Java de charger du code sur le roboRIO.
tr_tr: Enable Secure Shell Server (sshd) - **Bu kutuyu işaretli bırakmanız önerilir.** Bu ayar, roboRIO'da bir konsola uzaktan erişmenin bir yolu olan SSH'yi etkinleştirir. Bu kutunun işaretinin kaldırılması, C++ ve Java ekiplerinin roboRIO'ya kod yüklemesini engelleyecektir.

source: LabVIEW Project Access -\*\* It is recommended to leave this box checked.\*\* This setting allows LabVIEW projects to access the roboRIO.
es_mx: LabVIEW Project Access - \*\*Es recomendado dejar esta casilla marcada.\*\* Esta configuración permitirá que proyectos de LabVIEW accedan al roboRIO.
fr_ca: LabVIEW Project Access -\*\* Il est recommandé de laisser cette case cochée.\*\* Ce paramètre permet aux projets LabVIEW d’accéder au roboRIO.
tr_tr: LabVIEW Project Access-\*\* Bu kutunun işaretli bırakılması önerilir. \*\* Bu ayar, LabVIEW projelerinin roboRIO'ya erişmesine izin verir.

source: Network Configuration
es_mx: Configuración de Red
fr_ca: Configuration du réseau
tr_tr: Ağ Yapılandırması

source: This page shows the configuration of the roboRIO's network adapters. **It is not recommended to change any settings on this page.** For more information on roboRIO networking see this article: :ref:`docs/networking/networking-introduction/ip-configurations:IP Configurations`
es_mx: Esta página muestra la configuración del adaptador de red del roboRIO. **No es recomendable hacer algún cambio en esta página.** Para más información de la red del roboRIO ver el siguiente artículo: :ref:`docs/networking/networking-introduction/ip-configurations:IP Configurations`
fr_ca: Cette page montre la configuration des cartes réseau du roboRIO. **Il n’est pas recommandé de modifier les paramètres de cette page.** Pour plus d’informations sur le réseau roboRIO, consulter l'article suivant: :ref:`docs/networking/networking-introduction/ip-configurations:IP Configurations`
tr_tr: Bu sayfa roboRIO'nun ağ bağdaştırıcılarının yapılandırmasını gösterir. **Bu sayfadaki herhangi bir ayarı değiştirmeniz önerilmez.** roboRIO ağ oluşturma hakkında daha fazla bilgi için şu makaleye bakın: :ref:`docs/networking/networking-introduction/ip-configurations:IP Configurations`

source: Users may encounter issues using IE (compatibility) or Edge (mDNS site access). Alternate browsers such as Google Chrome or Mozilla Firefox are recommended for the best experience.
fr_ca: Les utilisateurs peuvent rencontrer des problèmes lors de l’utilisation d’IE (compatibilité) ou d’Edge (accès au site mDNS). D’autres navigateurs tels que Google Chrome ou Mozilla Firefox sont recommandés pour une expérience optimale.
