Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/roborio-info/roborio-brownouts.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: roboRIO Brownout and Understanding Current Draw
es_mx: Caída de voltaje en roboRIO y Comprender el Consumo de Corriente
fr_ca: Baisse de tension du roboRIO et compréhension de la consommation de courant
tr_tr: RoboRIO Kesintisi ve Mevcut Çekişi Anlama
zh_cn: roboRIO掉电处理以及了解电能消耗

source: In order to help maintain battery voltage to preserve itself and other control system components such as the radio during high current draw events, the roboRIO contains a staged brownout protection scheme. This article describes this scheme, provides information about proactively planning for system current draw, and describes how to use the new functionality of the PDP as well as the DS Log File Viewer to understand brownout events if they do happen on your robot.
es_mx: Para ayudar a mantener el voltaje de la batería y preservarse a sí misma y a otros componentes de control como el radio durante eventos de alto consumo de corriente, el roboRIO contiene un esquema de protección de caída de tensión. Este artículo describe dicho esquema, provee información acerca de una planeación proactiva de protecciones para el consumo de corriente actual del sistema, y describe como usar la nueva función de la PDP así como del DS LogFile Viewer para comprender los eventos de caída de tensión si es que ocurren en su robot.
fr_ca: Afin d’aider à maintenir la tension de la batterie pour la préserver ainsi que d’autres composants du système de contrôle comme la radio dans des situations d'appel élevé de courant, le roboRIO est pourvu d'un système organisé de protection contre la baisse de tension. Cet article décrit ce système, fournit des informations sur la planification proactive de l'appel de courant du système et décrit comment utiliser la nouvelle fonctionnalité du PDP ainsi que le Visionneur de fichiers journaux DS pour comprendre les manifestations de baisses de tensions si elles se produisent sur votre robot.
tr_tr: Yüksek akım çekme olayları sırasında kendisini ve radyo gibi diğer kontrol sistemi bileşenlerini korumak için ve akü voltajının korunmasına yardımcı olmak için roboRIO, aşamalı bir kesinti koruma şeması içerir. Bu makale, bu şemayı açıklar, sistem akım çekmesi için proaktif olarak planlama hakkında bilgi sağlar ve robotunuzda meydana gelirse elektrik kesintisi olaylarını anlamak için PDP'nin yeni işlevselliğinin ve DS Günlük Dosyası Görüntüleyicisinin nasıl kullanılacağını açıklar.
zh_cn: 为了在高电流消耗期间帮助维持电池电压以保护其自身和其他控制系统组件（例如在高电流事件中保护无线电设备），roboRIO包含分阶段的掉电保护方案。本文介绍了此方案，提供了有关主动计划的系统电流消耗的信息，并介绍了如何使用PDP和DS Log File Viewer的新功能去了解掉电事件，如果它们真的发生在您的机器人上的话。

source: roboRIO Brownout Protection
es_mx: Protección de Caída de Tensión del roboRIO
fr_ca: Protection contre la baisse de tension du roboRIO
tr_tr: roboRIO Kesinti Koruması
zh_cn: roboRIO掉电保护

source: The roboRIO uses a staged brownout protection scheme to attempt to preserve the input voltage to itself and other control system components in order to prevent device resets in the event of large current draws pulling the battery voltage dangerously low.
es_mx: El roboRIO utiliza un esquema de protección contra de caída de tensión para mantener su voltaje de alimentación y de otros componentes del sistema de control con el fin de evitar reinicios de dispositivos en eventos de alto consumo de tensión que lleven el voltaje de la batería a un nivel peligrosamente bajo.
fr_ca: Le roboRIO utilise un système organisé de protection contre la baisse de tension pour tenter de préserver la tension d’entrée, pour lui-même et d’autres composants du système de contrôle afin d’éviter la réinitialisation des dispositifs en cas d'appels de courant élevés tirant la tension de la batterie dangereusement vers le bas.
tr_tr: RoboRIO, batarya voltajını tehlikeli derecede düşük çeken büyük akım durumunda cihaz sıfırlamalarını önlemek ve giriş voltajını kendisine ve diğer kontrol sistemi bileşenlerine korumaya çalışmak için aşamalı bir kesinti koruma şeması kullanır.
zh_cn: roboRIO使用分阶段的掉电保护方案来尝试稳定自身和其他控制系统组件的输入电压，以防止在大电流消耗的情况下，电池电压拉的过低而导致设备复位。

source: Stage 1 - 6v output drop
es_mx: Etapa 1 – Salida de voltaje 6V
fr_ca: Étape 1 - baisse de sortie de 6v
tr_tr: Aşama 1 - 6V çıkış düşüşü
zh_cn: 阶段1 - 6v输出下降

source: **Voltage Trigger - 6.8V**
es_mx: **Disparo de voltaje – 6.8V**
fr_ca: **Déclencheur à tension - 6.8V**
tr_tr: ** Voltage Trigger - Gerilim Tetikleyici - 6,8 V **
zh_cn: **触发电压 - 6.8V**

source: When the voltage drops below 6.8V, the 6V output on the PWM pins will start to drop.
es_mx: Cuando el voltaje cae por debajo de 6.8V, la salida de 6V en el pin del PWM empezara a caer.
fr_ca: Lorsque la tension descend en dessous de 6,8 V, la sortie 6V sur les broches PWM va commencer à baisser.
tr_tr: Voltaj 6.8V'nin altına düştüğünde, PWM pinlerindeki 6V çıkış düşmeye başlayacaktır.
zh_cn: 当电压降至6.8V以下时，PWM引脚上的6V输出将开始下降。

source: Stage 2 - Output Disable
es_mx: Etapa 2 - Salida Deshabilitada
fr_ca: Étape 2 - Désactiver la sortie
tr_tr: Aşama 2 - Çıkışı Devre Dışı Bırakma
zh_cn: 阶段2 - 输出禁用

source: **Voltage Trigger - 6.3V**
es_mx: **Disparo de voltaje – 6.3V**
fr_ca: **Déclencheur à tension - 6.3V**
tr_tr: ** Voltage Trigger - Gerilim Tetikleyici - 6,3V **
zh_cn: **触发电压 - 6.3V**

source: When the voltage drops below 6.3V, the controller will enter the brownout protection state. The following indicators will show that this condition has occurred:
es_mx: Cuando el voltaje cae por debajo de 6.3 V, el controlador iniciará el estado de protecciones para caídas de tensión. Los siguientes indicadores mostraran que dicha condición ha ocurrido:
fr_ca: Lorsque la tension descend en dessous de 6,3 V, le contrôleur entrera dans l’état de protection contre la baisse de tension. Les indicateurs suivants montrent que cette condition s’est produite :
tr_tr: Voltaj 6,3V'un altına düştüğünde, kontrol cihazı voltaj düşürme koruma durumuna girecektir. Aşağıdaki göstergeler bu durumun ortaya çıktığını gösterecektir:
zh_cn: 当电压降至6.3V以下时，控制器将进入掉电保护状态。当进入该状态时，会有下列指示：

source: Power LED on the roboRIO will turn Amber
es_mx: Led de encendido en el roboRIO encenderá amarillo.
fr_ca: Le voyant Power LED du roboRIO deviendra ambré
tr_tr: RoboRIO üzerindeki güç LED'i kehribar rengine dönecektir
zh_cn: roboRIO上的电源LED指示灯将变为琥珀色

source: Background of the voltage display on the Driver Station will turn red
es_mx: El fondo del monitor de voltaje en la Driver Station se tornará rojo.
fr_ca: L’arrière-plan de l’affichage de tension sur la Driver Station deviendra rouge
tr_tr: Sürücü istasyonundaki voltaj göstergesinin arka planı kırmızıya dönecek
zh_cn: Driver Station上的电压显示背景将变为红色

source: Mode display on the Driver Station will change to Voltage Brownout
es_mx: En la Driver Station el modo de visualización se volverá a caída de tensión.
fr_ca: Le mode d'affichage sur la Driver Station changera à Voltage Brownout
tr_tr: Sürücü İstasyonundaki mod ekranı ''Gerilim Kesintisi'' olarak değişecektir
zh_cn: Driver Station上的显示模式将转变为“电压不足”

source: The CAN/Power tab of the DS will increment the 12V fault counter by 1.
es_mx: La etiqueta de CAN/Power del DS incrementará la falla de 12V en 1.
fr_ca: L’onglet CAN/Power du DS incrémente le compteur 12V fault 1.
tr_tr: DS'nin CAN/Güç sekmesi 12V arıza sayacını 1 artıracaktır.
zh_cn: DS的CAN / Power选项卡会将12V故障计数器加1。

source: The DS will record a brownout event in the DS log.
es_mx: La DS registrará una caída de tensión en el DS Log.
fr_ca: La DS enregistrera un événement de baisse de tension dans le journal DS.
tr_tr: DS, DS günlüğüne bir kesinti olayı kaydeder.
zh_cn: DS将在DS日志中记录一次掉电事件。

source: The controller will take the following steps to attempt to preserve the battery voltage:
es_mx: El controlador hará los siguientes pasos para tratar de preservar el voltaje de la batería:
fr_ca: Le contrôleur prendra les mesures suivantes pour tenter de préserver la tension de la batterie :
tr_tr: Denetleyici, pil voltajını korumaya çalışmak için aşağıdaki adımları atacaktır:
zh_cn: 控制器将采取以下步骤来尝试保持电池电压：

source: PWM outputs will be disabled. For PWM outputs which have set their neutral value (all motor controllers in WPILib) a single neutral pulse will be sent before the output is disabled.
es_mx: Las salidas PWM se desactivarán. Para las salidas PWM que han fijado su valor de neutro (todos los controladores de motor en WPILib) se enviará un único pulso de neutro antes de que se desactive la salida.
fr_ca: Les sorties PWM seront désactivées. Pour les sorties PWM dont la valeur neutre est configurée (tous les contrôleurs de moteurs de WPILib), une impulsion neutre unique sera envoyée avant que la sortie ne soit désactivée.
zh_cn: PWM输出将被禁用。对于已设置中性值的PWM输出（WPILib中的所有电机控制器），在禁用输出之前，将发送一个中性脉冲。

source: 6V, 5V, 3.3V User Rails disabled (This includes the 6V outputs on the PWM pins, the 5V pins in the DIO connector bank, the 5V pins in the Analog bank, the 3.3V pins in the SPI and I2C bank and the 5V and 3.3V pins in the MXP bank)
es_mx: Vías de 6V, 5V, 3.3V deshabilitados (Esto incluye las salidas de 6V en los pines de PWM, los pines de 5V de los conectores del grupo DIO, los pines de 5V de los conectores del grupo Analógicos, los pines de 3.3V en los grupos de SPI e I2C y los 5V y 3V pines en el grupo MXP)
fr_ca: Les rails d’utilisateur 6V, 5V, 3.3V sont désactivés (Cela inclut les sorties 6V sur les broches PWM, les broches 5V dans la reglette de raccordement DIO, les broches 5V dans le module analogique, les broches 3.3V dans le module SPI et I2C et les broches 5V et 3.3V dans le module MXP)
tr_tr: 6V, 5V, 3.3V User Rails devre dışı hale getirilir. (Bu, PWM pinlerindeki 6V çıkışları, DIO konektör bankasındaki 5V pinleri, Analog bankadaki 5V pinleri, SPI ve I2C bankasındaki 3.3V pinleri ve MXP bankasındaki 5V ve 3.3V pinlerini içerir)
zh_cn: 禁用6V，5V，3.3V用户轨（包括PWM引脚上的6V输出，DIO连接器组中的5V引脚，模拟组中的5V引脚，SPI和I2C组中的3.3V引脚以及MXP bank中的5V和3.3V引脚）

source: GPIO configured as outputs go to High-Z
es_mx: GPIO configurado como salidas go to High-Z
fr_ca: Les ports GPIO configurés en sorties passent à un état haute-impédence (High-Z)
tr_tr: Çıkışlar olarak yapılandırılan GPIO, High-Z'ye gider
zh_cn: 配置为输出的GPIO进入High-Z模式

source: Relay Outputs are disabled (driven low)
es_mx: Relevadores de salida son deshabilitados (driven low)
fr_ca: Les sorties de relais sont désactivées (mises au niveau bas)
tr_tr: Röle Çıkışları devre dışı bırakılır (düşük sürülür)
zh_cn: 继电器输出被禁用（设为低电平）

source: CAN-based motor controllers are sent an explicit disable command
es_mx: Los controladores de motor basado en CAN se les envía un comando de deshabilitados.
fr_ca: Les contrôleurs moteurs de type CAN reçoivent une commande explicite de désactivation
tr_tr: CAN tabanlı motor kontrolörlerine açık bir devre dışı bırakma komutu gönderilir
zh_cn: 向基于CAN的电机控制器发送明确的禁用指令

source: Pneumatic Devices such as the CTRE Pneumatics Control Module and REV Pneumatic Hub are disabled
fr_ca: Les dispositifs pneumatiques tels que le module de contrôle pneumatique CTRE et le concentrateur pneumatique REV sont désactivés

source: **The controller will remain in this state until the voltage rises to greater than 7.5V or drops below the trigger for the next stage of the brownout**
es_mx: **El controlador se mantendrá en este estado hasta que el voltaje sea mayor a 7.5 o baje al siguiente disparo de voltaje para la siguiente etapa de las protecciones de caída de voltaje.**
fr_ca: **Le contrôleur restera dans cet état jusqu’à ce que la tension monte à plus de 7,5 V ou tombe en dessous du seuil de déclanchement pour l’étape suivante de la chute de tension**
tr_tr: **Kontrol cihazı, voltaj 7,5V'nin üzerine çıkana veya voltaj kesintisinin bir sonraki aşaması için tetiğin altına düşene kadar bu durumda kalır**
zh_cn: **控制器将保持此状态，直到电压上升至大于7.5V或降至触发下一阶段的掉电的电压**

source: Stage 3 - Device Blackout
es_mx: Etapa 3 – Apagón de dispositivo
fr_ca: Étape 3 - Arrêt de l'appareil
tr_tr: Aşama 3 - Cihaz Karartması
zh_cn: 阶段3-装置停电

source: **Voltage Trigger - 4.5V**
es_mx: **Disparo de voltaje – 4.5V**
fr_ca: **Déclencheur à tension - 4.5V**
tr_tr: **Voltage Trigger - Gerilim Tetikleyici - 4.5V**
zh_cn: **触发电压 - 4.5V **

source: Below 4.5V the device may blackout. The exact voltage may be lower than this and depends on the load on the device.
es_mx: Debajo de 4.5V el dispositivo puede apagarse. El voltaje exacto pude ser menor que esto y depende de la carga en el dispositivo.
fr_ca: En dessous de 4.5V l’appareil peut s'éteindre. La tension exacte peut être inférieure à cette valeur et dépend de la charge sur l’appareil.
tr_tr: 4.5V'nin altında cihaz elektrik kesintisine uğrayabilir. Kesin voltaj bundan daha düşük olabilir ve cihazdaki yüke bağlıdır.
zh_cn: 低于4.5V时，设备可能会停电。确切的停电电压可能低于此电压，这取决于设备的负载。

source: **The controller will remain in this state until the voltage rises above 4.65V when the device will begin the normal boot sequence.**
es_mx: **El controlador se mantendrá en este estado hasta que el voltaje sea mayor a 4.65V, cuando esto suceda el dispositivo comenzará se secuencia normal de arranque.**
fr_ca: **Le contrôleur restera dans cet état jusqu’à ce que la tension s’élève au-dessus de 4,65 V lorsque l’appareil commencera la séquence de démarrage normale.**
tr_tr: **Cihaz normal önyükleme sırasına başlayacağı zaman, kontrol cihazı voltaj 4,65V'nin üzerine çıkana kadar bu durumda kalacaktır.**
zh_cn: **控制器将保持断电状态，直到电压升高到4.65V以上。这时设备将按正常顺序启动。**

source: Avoiding Brownout - Proactive Current Draw Planning
es_mx: Prevención de caída de tensión – Planeación proactiva para el consumo de corriente
fr_ca: Éviter la baisse de tension - Planification proactive de la consommation de courant
tr_tr: Kesintiyi Önleme - Proaktif Akım Çekiş Planlaması
zh_cn: 避免掉电 - 主动规划电流使用

source: The key to avoiding a brownout condition is to proactively plan for the current draw of your robot. The best way to do this is to create some form of power budget. This can be a complex document that attempts to quantify both estimated current draw and time in an effort to most completely understand power usage and therefore battery state at the end of a match, or it can be a simple inventory of current usage. To do this:
es_mx: La clave para prevenir una condición de caída de tensión es una planeación proactiva para el consumo de la corriente actual del robot. La mejor manera para hacer esto es crear un tipo de presupuesto de corriente. Esto puede ser un documento complejo que intente cuantificar ambas, el consumo de corriente estimado y tiempo de esfuerzo, para una mayor comprensión del uso de corriente y con esto el estado de la batería al finalizar el partido, o simplemente puede ser un inventario de la corriente usada. Para hacer esto:
fr_ca: La façon pour éviter une situation de baisse de tension est de planifier de manière proactive l'appel de courant de votre robot. La meilleure façon de le faire est de créer une certaine forme de budget de puissance. Il peut s’agir d’un document complexe qui tente de quantifier à la fois le courant consommé estimé et le temps dans un effort de mieux comprendre l’utilisation de la puissance et donc l’état de la batterie à la fin d’un match, ou il peut être un simple inventaire de l’utilisation du courant. Pour ce faire :
tr_tr: Bir kesinti durumundan kaçınmanın anahtarı, robotunuzun mevcut çekimini proaktif olarak planlamaktır. Bunu yapmanın en iyi yolu, bir çeşit güç bütçesi yaratmaktır. Bu, güç kullanımını ve dolayısıyla bir maçın sonundaki pil durumunu en iyi şekilde anlamak için hem tahmini akım çekimini hem de süreyi ölçmeye çalışan karmaşık bir belge olabilir veya mevcut kullanımın basit bir envanteri olabilir. Bunu yapmak için:
zh_cn: 避免掉电的关键是主动规划机器人的电流消耗。最好的方法是创建某种形式的功率预算。这种预算可能是相当复杂的时间和对应的预计电流消耗的量化，以便在比赛结束时全面了解电流使用情况和电池状态；也可以是简单地关于电流使用的清单。为创建功率预算：

source: Establish the max "sustained" current draw (with sustained being loosely defined here as not momentary). This is probably the most difficult part of creating the power budget. The exact current draw a battery can sustain while maintaining a voltage of 7+ volts is dependent on a variety of factors such as battery health (see :ref:`this <docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>` article for measuring battery health) and state of charge. As shown in the `NP18-12 data sheet <https://www.farnell.com/datasheets/575631.pdf>`__, the terminal voltage chart gets very steep as state of charge decreases, especially as current draw increases. This datasheet shows that at 3CA continuous load (54A) a brand new battery can be continuously run for over 6 minutes while maintaining a terminal voltage of over 7V. As shown in the image above (used with permission from `Team 234s Drive System Testing document <https://www.chiefdelphi.com/t/paper-new-control-functions-drive-system-testing/139165>`__), even with a fresh battery, drawing 240A for more than a second or two is likely to cause an issue. This gives us some bounds on setting our sustained current draw. For the purposes of this exercise, we'll set our limit at 180A.
es_mx: Establezca el consumo máximo de corriente "sostenida" (entendiendo por sostenida lo que no es momentáneo). Esta es probablemente la parte más difícil de crear el presupuesto de energía. El consumo de corriente exacto que una batería puede sostener mientras mantiene un voltaje de 7+ voltios depende de una variedad de factores tales como la salud de la batería (ver :ref:`este artículo <docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>` para medir la salud de la batería) y el estado de carga. Como se muestra en la hoja de datos de la `NP18-12 <https://www.farnell.com/datasheets/575631.pdf>`, el gráfico de voltaje de los terminales se vuelve muy empinado a medida que el estado de carga disminuye, especialmente cuando el consumo de corriente aumenta. Esta hoja de datos muestra que a una carga continua de 3CA (54A) una batería nueva puede funcionar de forma continua durante más de 6 minutos manteniendo una tensión en bornes de más de 7V. Como se muestra en la imagen anterior (utilizada con permiso del documento `Team 234s Drive System Testing <https://www.chiefdelphi.com/t/paper-new-control-functions-drive-system-testing/139165>`__), incluso con una batería nueva, el consumo de 240A durante más de un segundo o dos es probable que cause un problema. Esto nos da algunos límites en el establecimiento de nuestro consumo de corriente sostenida. Para los propósitos de este ejercicio, vamos a establecer nuestro límite en 180A.
fr_ca: Établissez le courant maximum "soutenu" (soutenu étant défini ici comme non momentané). C'est probablement la partie la plus difficile de la création du budget de puissance. La consommation de courant exacte qu'une batterie peut supporter tout en maintenant une tension de plus de 7 volts dépend de divers facteurs tels que la santé de la batterie (voir :ref:`ceci <docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>`, un article de mesure de la santé de la batterie) et de l'état de charge. Comme le montre la `fiche technique NP18-12 <https://www.farnell.com/datasheets/575631.pdf>`__, le graphique de tension aux bornes devient très raide à mesure que l'état de charge diminue, en particulier lorsque la consommation de courant augmente. Cette fiche technique montre qu'à une charge continue de 3CA (54A), une batterie neuve peut fonctionner en continu pendant plus de 6 minutes tout en maintenant une tension aux bornes supérieure à 7V. Comme indiqué dans l'image ci-dessus (utilisé avec l'autorisation du `document Team 234s Drive System Testing <https://www.chiefdelphi.com/t/paper-new-control-functions-drive-system-testing/139165>` __) , même avec une batterie neuve, consommer 240A pendant plus d'une seconde ou deux est susceptible de causer un problème. Cela nous donne quelques limites sur l'établissement de notre consommation de courant soutenu. Pour les besoins de cet exercice, nous fixerons notre limite à 180 A.
zh_cn: 制定最大的“持续”电流消耗（此处将“持续”宽松地定义为非瞬时的）。这可能是创建功耗预算中最困难的部分。维持7+伏特电压时，电池可以维持的确切电流取决于多种因素，例如电池的健康状况（请参阅用于测量电池的健康状况的此<docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>文章）和充电状态。如“ NP18-12数据表<https://www.farnell.com/datasheets/575631.pdf>” __中所示，随着充电状态的降低，尤其是电流消耗的增加，端子电压图变得非常陡峭。该数据表显示，在3CA连续负载（54A）下，全新电池可以连续运行6分钟以上，同时保持端子电压超过7V。如上图所示（在“ Team 234s驱动器系统测试”文件<https://www.chiefdelphi.com/t/paper-new-control-functions-drive-system-testing/139165>`__的允许下使用），即使使用了一块新电池，绘制240A的时间也可能超过一两秒。这为我们设定持续电流消耗提供了一些界限。出于本练习的目的，我们将限制设置为180A。

source: List out the different functions of your robot such as drivetrain, manipulator, main game mechanism, etc.
es_mx: Enlistar las diferentes funciones de su robot tales como el chasis, algún manipulador, mecanismo principal del juego, etc.
fr_ca: Énumérez les différentes fonctions de votre robot telles que la transmission, le manipulateur, le mécanisme de jeu principal, etc.
tr_tr: Robotunuzun aktarma organı, manipülatör, ana oyun mekanizması vb. Gibi farklı işlevlerini listeleyin.
zh_cn: 列出机器人的不同功能，例如动力传动系统，操纵器，主要游戏机制等。
