Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/roborio-info/roborio-ssh.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: roboRIO User Accounts and SSH
es_mx: Cuentas de usuarios de roboRIO y SSH
fr_ca: Les comptes d’utilisateurs roboRIO et SSH
tr_tr: roboRIO Kullanıcı Hesapları ve SSH
zh_cn: roboRIO用户帐户和SSH

source: This document contains advanced topics not required for typical FRC\ |reg| programming
es_mx: Este documento contiene temas avanzados que no son necesarios para la programación común de FRC\ |reg|
fr_ca: Ce document contient des sujets avancés non requis pour une programmation typique en FRC\ |reg|
tr_tr: Bu belge, tipik FRC \ |reg| programlama için gerekli olmayan gelişmiş konuları içerir.
zh_cn: 本文档包含通常的FRC®编程中不需要的高级主题。

source: The roboRIO image contains a number of accounts, this article will highlight the two used for FRC and provide some detail about their purpose. It will also describe how to connect to the roboRIO over SSH.
es_mx: La imagen del roboRIO contiene un número de cuentas, este artículo destacará las dos utilizadas para el FRC y proporcionará algunos detalles sobre su propósito. También describirá cómo conectarse al roboRIO a través de SSH.
fr_ca: L’image du roboRIO contient un certain nombre de comptes, cet article mettra en évidence les deux qui sont utilisés en FRC et fournir quelques détails sur leur but. Il décrira également comment se connecter au roboRIO via SSH.
tr_tr: RoboRIO görüntüsü bir dizi hesap içerir, bu makale FRC için kullanılan ikisini vurgulayacak ve bunların amaçları hakkında bazı ayrıntılar sağlayacaktır. Ayrıca roboRIO'ya SSH üzerinden nasıl bağlanılacağı da açıklanacaktır.
zh_cn: roboRIO映像包含许多帐户。本文将重点介绍用于FRC的两个帐户，并提供有关其用途的一些详细信息。本文还将介绍如何通过SSH连接到roboRIO。

source: roboRIO User Accounts
es_mx: Cuentas de usuarios de roboRIO
fr_ca: Les comptes d’utilisateurs roboRIO
tr_tr: roboRIO Kullanıcı Hesapları
zh_cn: roboRIO用户帐户

source: The roboRIO image contains a number of user accounts, but there are two of primary interest for FRC.
es_mx: La imagen del roboRIO contiene un número de cuentas de usuarios, pero hay dos de mayor interés para FRC.
fr_ca: L’image du roboRIO contient un certain nombre de comptes d’utilisateurs, mais il en y a deux d’intérêt primordial pour la FRC.
tr_tr: RoboRIO görüntüsü bir dizi kullanıcı hesabı içerir, ancak FRC için birincil ilgi alanı iki tanedir.
zh_cn: roboRIO映像包含许多用户帐户，但其中有两个主要用于FRC。

source: Admin
tr_tr: Admin-Yönetici
zh_cn: 管理员

source: The "admin" account has root access to the system and can be used to manipulate OS files or settings. Teams should take caution when using this account as it allows for the modification of settings and files that may corrupt the operating system of the roboRIO. The credentials for this account are:
es_mx: La cuenta de “admin” tiene un root Access al sistema y puede ser usado para manipular archivos OS o configuraciones. Los equipos deberán tener cuidado cuando se usa esta cuenta ya que permite modificar configuraciones y archivos que podrían corromper el sistema operativo del roboRIO. Las credenciales de esta cuenta son:
fr_ca: Le compte "admin" a un accès root au système et peut être utilisé pour manipuler les fichiers ou paramètres du système d’exploitation. Les équipes doivent faire preuve de prudence lors de l’utilisation de ce compte car il permet la modification des paramètres et des fichiers qui peuvent corrompre le système d’exploitation du roboRIO. Les informations d’identification de ce compte sont les suivantes :
tr_tr: "Admin-Yönetici" hesabının sisteme kök erişimi vardır ve işletim sistemi dosyalarını veya ayarlarını değiştirmek için kullanılabilir. RoboRIO'nun işletim sistemini bozabilecek ayarların ve dosyaların değiştirilmesine izin verdiği için ekipler bu hesabı kullanırken dikkatli olmalıdır. Bu hesabın kimlik bilgileri:
zh_cn: “管理员”帐户具有对系统的根权限，可用于操纵系统文件或设置。团队在使用此帐户时应格外小心，因为它可以修改可能损坏roboRIO操作系统的设置和文件。该帐户的凭据为：

source: ``Username: admin``
es_mx: ``Usuario: admin``
tr_tr: ``Kullanıcı adı: admin``
zh_cn: ``用户名：admin''

source: ``Password:``
es_mx: ``Contraseña:``
tr_tr: ``Şifre:``
zh_cn: ``密码：``

source: The password is intentionally blank.
es_mx: La contraseña está intencionalmente vacía
fr_ca: Le mot de passe est sciemment laissé vide.
tr_tr: Parola kasıtlı olarak boştur.
zh_cn: 密码是故意留白的。

source: The "lvuser" account is the account used to run user code for all three languages. The credentials for this account should not be changed. Teams may wish to use this account (via ssh or sftp) when working with the roboRIO to ensure that any files or settings changes are being made on the same account as their code will run under.
es_mx: La cuenta “lvuser” es una cuenta usada para ejecutar el código del usuario para los 3 lenguajes. Las credenciales para esta cuenta no deberán cambiarse. Los equipos podrían querer usar esta cuenta (via ssh o sftp) cuando estén trabajando con el roboRIO para asegurar que los archivo o los cambios de configuración se realicen en la misma cuenta donde se ejecuta el archivo.
fr_ca: Le compte "lvuser" est le compte utilisé pour exécuter le code utilisateur pour les trois langages de programmation. Les informations d’identification de ce compte ne doivent pas être modifiées. Les équipes peuvent vouloir utiliser ce compte (via ssh ou sftp) lorsqu’elles travaillent avec le roboRIO pour s’assurer que tous les fichiers ou modifications de paramètres sont effectuées sur le même compte sous lequel leur code s’exécutera.
tr_tr: "Lvuser" hesabı, her üç dil için de kullanıcı kodunu çalıştırmak için kullanılan hesaptır. Bu hesabın kimlik bilgileri değiştirilmemelidir. Takımlar, roboRIO ile çalışırken, kodlarının altında çalışacağı aynı hesapta herhangi bir dosya veya ayar değişikliğinin yapılmasını sağlamak için bu hesabı (ssh veya sftp aracılığıyla) kullanmak isteyebilir.
zh_cn: “ lvuser”帐户是用于运行所有三种语言写成的用户代码的帐户。此帐户的凭据不应被更改。在开发roboRIO，团队可以使用该帐户（通过ssh或sftp），以确保对文件或设置所做的任何更改和代码运行都在同一账号下完成。

source: Changing the default ssh passwords for either "lvuser" or "admin" will prevent C++ and Java teams from uploading code.
es_mx: Cambiar la contraseña predeterminada de ssh por “lvuser” o “admin” evitará que equipos de C++ y Java carguen el código.
fr_ca: La modification des mots de passe ssh par défaut pour "lvuser" ou "admin" empêchera les équipes C++ et Java de télécharger du code.
tr_tr: "Lvuser" veya "admin" için varsayılan ssh şifrelerini değiştirmek, C ++ ve Java ekiplerinin kod yüklemesini engelleyecektir.
zh_cn: 更改“ lvuser”或“ admin”的默认ssh密码将阻碍C ++和Java团队上传代码。

source: SSH
zh_cn: SSH协议

source: SSH (Secure SHell) is a protocol used for secure data communication. When broadly referred to regarding a Linux system (such as the one running on the roboRIO) it generally refers to accessing the command line console using the SSH protocol. This can be used to execute commands on the remote system. A free client which can be used for SSH is PuTTY: https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html
es_mx: SSH (Secure Shell) es un protocolo usado para la comunicación segura de datos. Cuando se hace referencia a un sistema Linux (como el que se ejecuta en el roboRIO) generalmente se refiere al acceso de la línea de comando de la consola usando el protocolo SSH. Esto puede ser usado para ejecutar comandos en el sistema remoto. Un cliente gratuito que se puede usar para SSH es PuTTY: https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html
fr_ca: SSH (Secure SHell) est un protocole utilisé pour la communication de données sécurisée. Lorsqu’il est largement mentionné en ce qui concerne un système Linux (comme celui qui s’exécute sur le roboRIO), c'est généralement pour se référer à l’accès à la console de ligne de commande à l’aide du protocole SSH. Cela peut être utilisé pour exécuter des commandes sur le système distant. Un client gratuit pouvant être utilisé pour SSH est PuTTY: https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html
tr_tr: SSH (Güvenli Kabuk), güvenli veri iletişimi için kullanılan bir protokoldür. Bir Linux sistemiyle ilgili olarak geniş anlamda bahsedildiğinde (roboRIO üzerinde çalışan sistem gibi), genellikle SSH protokolü kullanılarak komut satırı konsoluna erişim anlamına gelir. Bu, uzak sistemde komutları yürütmek için kullanılabilir. SSH için kullanılabilecek ücretsiz bir istemci PuTTY'dir: https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html
zh_cn: SSH（安全外壳）是用于安全数据通信的协议。当广泛涉及Linux系统（例如在roboRIO上运行的系统）时，它通常指的是使用SSH协议访问命令行控制台。这可用于在远程系统上执行命令。可用于SSH的免费客户端是PuTTY：https：//www.chiark.greenend.org.uk/~sgtatham/putty/latest.html

source: Open Putty
es_mx: Abrir Putty
fr_ca: Ouvrir Putty
tr_tr: Putty'i aç
zh_cn: 打开Putty

source: Open Putty (clicking OK at any security prompt). Then set the following settings:
es_mx: Abrir Putty (Dar clic en OK a cualquier aviso de seguridad). Enseguida establezca la siguiente configuración:
fr_ca: Ouvrez Putty (en cliquant sur OK à n’importe quelle invite de sécurité). Définissez ensuite les paramètres suivants :
tr_tr: Putty'yi açın (herhangi bir güvenlik isteminde Tamam'a tıklayın). Ardından aşağıdaki ayarları yapın:
zh_cn: 打开Putty（在任何安全提示下单击OK）。然后设定以下设置：

source: Host Name: roboRIO-TEAM-frc.local (where TEAM is your team number, example shows team 40)
es_mx: Host name: roboRIO-TEAM-frc-loc (en TEAM escribir el número de su equipo, el ejemplo muestra al equipo 40)
fr_ca: Host Name: roboRIO-TEAM-frc.local (où TEAM est votre numéro d’équipe, l'exemple montre l’équipe 40)
tr_tr: Host Name: roboRIO-TEAM-frc.local (TEAM takım numaranız olduğunda, örnek takım 40'ı gösterir)
zh_cn: 主机名：roboRIO-TEAM-frc.local（其中TEAM是您的团队编号，示例中的团队编号为40）

source: Connection Type: SSH
es_mx: Tipo de conexión: SSH.
tr_tr: Bağlantı Türü: SSH
zh_cn: 连接类型：SSH

source: Other settings can be left at defaults. Click Open to open the connection. If you see a prompt about SSH keys, click OK.
es_mx: Otras configuraciones pueden dejarse predeterminadas. Dar clic en abrir la conexión. Si aparece un aviso acerca índices de SSH, dele clic OK.
fr_ca: Les autres paramètres peuvent être laissés à leurs valeurs par défaut. Cliquez sur Open pour ouvrir la connexion. Si vous voyez une invite sur les touches SSH, cliquez sur OK.
tr_tr: Diğer ayarlar varsayılan olarak bırakılabilir. Bağlantıyı açmak için Aç'a tıklayın. SSH anahtarlarıyla ilgili bir istem görürseniz Tamam'ı tıklayın.
zh_cn: 其他设置可以保留为默认值。单击“打开”以打开连接。如果看到有关SSH密钥的提示，请单击“确定”。

source: If you are connected over USB you can use 172.22.11.2 as the hostname. If your roboRIO is set to a static IP you can use that IP as the hostname if connected over Ethernet/wireless.
es_mx: Si usted está conectado mediante USB puede usar 172.22.11.2 como Hostname. Si su roboRIO está configurado a una IP estática usted puede usar esa IP como Hostname si se conecta a través de Ethernet o inalámbrico.
fr_ca: Si vous êtes connecté via USB, vous pouvez utiliser le 172.22.11.2 comme nom d’hôte. Si votre roboRIO est défini sur une adresse IP statique, vous pouvez utiliser cette adresse IP comme nom d’hôte si elle est connectée via Ethernet/sans fil.
tr_tr: USB üzerinden bağlıysanız, ana bilgisayar adı olarak 172.22.11.2'yi kullanabilirsiniz. RoboRIO'nuz statik bir IP'ye ayarlanmışsa, Ethernet / kablosuz üzerinden bağlıysa bu IP'yi ana bilgisayar adı olarak kullanabilirsiniz.
zh_cn: 如果通过USB连接，您可以使用172.22.11.2作为主机名。如果您的roboRIO被设置为静态IP，您可以通过以太网/无线连接，将该IP用作主机名。

source: Log In
es_mx: Iniciar Sesión
fr_ca: Connectez-vous
tr_tr: Log In-Oturum aç
zh_cn: 登录

source: When you see the prompt, enter the desired username (see above for description) then press enter. At the password prompt press enter (password for both accounts is blank).
es_mx: Cuando vea esta pantalla, ingrese el usuario deseado (vea descripción anterior) y presione enter. Para la pantalla de contraseña presione enter (no tienen contraseña ambas cuentas).
fr_ca: Lorsque vous voyez l’invite, entrez le nom d’utilisateur souhaité (voir ci-dessus pour la description), puis appuyez sur Entrée. À l’invite de mot de passe, appuyez sur entrée (le mot de passe pour les deux comptes est vide).
tr_tr: İstemi gördüğünüzde, istenen kullanıcı adını girin (açıklama için yukarıya bakın) ve ardından enter tuşuna basın. Parola isteminde enter tuşuna basın (her iki hesabın parolası boştur).
zh_cn: 当看到提示时，输入用户名（有关说明，请参见上文），然后按Enter。提示输入密码时，按Enter（两个帐户的密码均为空白）。

source: Putty UI highlighting the Host Name field, the SSH radio button and the Open button.
fr_ca: Interface usager Putty mettant en évidence le champ Host Name, la case d’option SSH et le bouton Open.

source: PuTTY terminal window logged in to the roboRIO.
fr_ca: Fenêtre du terminal PuTTY connecté au roboRIO.
