Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/beta-getting-started/accessing-the-beta-project.po
Languages: fr_ca

source: Accessing the Beta Project
fr_ca: Accès au projet Beta

source: Only accepted Beta Test teams will have access to the Beta project.
fr_ca: Seules les équipes Beta Test retenues auront accès au projet Beta.

source: The members identified by your team to communicate with *FIRST*\ |reg| technical staff will have access to the Beta Test project on the `<https://usfirst.collab.net>`__ site.
fr_ca: Les membres identifiés par votre équipe pour communiquer avec le personnel technique de *FIRST*\ |reg| auront accès au projet Beta Test sur le site `<https://usfirst.collab.net>`__ .

source: Signing In
fr_ca: Connexion

source: Logging in to the collab TeamForge site.
fr_ca: Connexion au site de collaboration TeamForge.

source: Open your web browser and browse to `<https://usfirst.collab.net>`__. Near the top left corner of the page enter your TeamForge username and password then click "Log In".
fr_ca: Ouvrez votre navigateur Web et accédez à `<https://usfirst.collab.net>`__. Près du coin supérieur gauche de la page, entrez votre nom d'utilisateur et votre mot de passe TeamForge, puis cliquez sur « Connexion ».

source: Opening the Beta Project
fr_ca: Ouverture du projet Beta

source: The view from the project tab.
fr_ca: La vue de l'onglet projet.

source: Your user account should already be added to the Beta Project. To view the project:
fr_ca: Votre compte d’utilisateur devrait déjà avoir été ajouté au projet Beta. Pour consulter le projet :

source: Click the Projects tab on the top navigation ribbon.
fr_ca: Cliquez sur l’onglet Projets du ruban de navigation supérieur.

source: Then click on ``FRC20**Beta`` in the projects list (image of 2015 as an example).
fr_ca: Cliquez ensuite sur ``FRC20**Beta`` dans la liste des projets (à titre d'exemple, voici l'image de 2015).

source: The Project Homepage
fr_ca: La page d’accueil du projet

source: The project homepage and graphs.
fr_ca: La page d'accueil et les graphiques du projet.

source: The project homepage contains some statistics and Project News. Throughout the beta, the Project News section may be updated with the latest information from the *FIRST* technical staff. The top ribbon contains tabs allowing you to navigate to the different sections of the project:
fr_ca: La page d’accueil du projet contient quelques statistiques et des nouvelles relatives au projet. Tout au long du développement de la version bêta, la section News du projet peut être mise à jour avec les dernières informations fournies par le personnel technique *FIRST*. Le ruban supérieur contient des onglets vous permettant de naviguer vers les différentes sections du projet :

source: Trackers - The Trackers tab is where the bug tracker for the project is located.
fr_ca: Trackers - L’onglet Trackers est l’endroit où se trouve le suivi des bogues relatifs au projet.

source: File Releases - The File Releases tab will host any files you will need to download as part of the Beta test process such as NI FRC\ |reg| Game Tools files.
fr_ca: Libérations de fichiers - L'onglet File Releases hébergera tous les fichiers que vous devrez télécharger dans le cadre du processus de test bêta tel que NI FRC \ | reg | Fichiers d'outils de jeu.

source: Documents - the Documents tab will contain any documents to be distributed to Beta teams. Much of the documentation for the Beta test will be located on the FRC Docs site but there may still be documents posted here as well.
fr_ca: Documents - l'onglet Documents contiendra tous les documents à distribuer aux équipes bêta. Une grande partie de la documentation pour le test bêta se trouvera sur le site FRC Docs, mais il se peut que des documents soient toujours affichés ici.

source: Discussions - The Discussions tab contains a forum which will allow teams to post questions or discussions about the Beta test, software or documentation. Task reports will also be posted here.
fr_ca: Discussions - L’onglet Discussions contient un forum qui permettra aux équipes d’afficher des questions ou des discussions sur le Beta test, le logiciel ou la documentation. Les rapports relatifs aux tâches seront également affichés ici.
