Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/beta-getting-started/monitoring-via-email-notifications.po
Languages: es_mx, fr_ca

source: Monitoring Via Email Notifications
es_mx: Monitoreando vía notificaciones por email
fr_ca: Surveillance au moyen de notifications par e-mail

source: You may wish to monitor specific items or even whole sections of the Beta project via email. TeamForge has a large degree of flexibility in setting up e-mail monitoring.
es_mx: Puede que usted desee monitorear ítems o inclusive secciones completas del proyecto Beta vía email. TeamForge tiene un gran grado de flexibilidad en configurar el monitoreo por e-mail.
fr_ca: Vous pouvez surveiller des éléments spécifiques ou même des sections entières du projet Beta par e-mail. TeamForge présente une grande flexibilité dans la mise en place de la surveillance par e-mail.

source: Monitoring Individual Items
es_mx: Monitoreando ítems individuales
fr_ca: Surveillance d'éléments individuels

source: Monitor button that sends emails when clicked.
fr_ca: Bouton de surveillance qui envoie des e-mails lorsque vous cliquez dessus.

source: You can choose to monitor a number of different individual items (forum threads, tracker artifacts, file releases, etc.) via e-mail. Items that can be subscribed to will have a Monitor button located at the bottom of the screen. Clicking this button will subscribe you to the item and notify you of changes via e-mail. To unsubscribe, click the Stop Monitoring button (which will replace the Monitor button when you are subscribed).
es_mx: Usted puede escoger si monitorear un numero de diferentes ítems individuales (foros, hilos, artefactos rastreadores, liberación de documentos, etc.) via e-mail. Los ítems que tengan la opción de subscribirse tendrán un botón de monitoreo localizado en el fondo de la pantalla. Darle clic a este botón de subscribirá al ítem y te notificara sus cambios vía e-mail. Para de-subscribirse, de clic a boton de Parar Monitoreo (que se encontrá en el mismo lugar que el botón de monitoreo).
fr_ca: Vous pouvez choisir de surveiller un certain nombre d’éléments individuels différents (threads de forum, suiv des artefacts, diffusion de fichiers, etc.) par e-mail. Les éléments auxquels on peut s’abonner auront un bouton Monitor situé au bas de l’écran. En cliquant sur ce bouton, vous vous abonnerez à l’item et vous informez des modifications par e-mail. Pour vous désabonner, cliquez sur le bouton Stop Monitoring (qui remplace le bouton Monitor lorsque vous êtes abonné).

source: Monitoring Folders
es_mx: Monitoreando carpetas
fr_ca: Dossiers de surveillance

source: You can monitor folders also.
fr_ca: Vous pouvez surveiller des dossiers aussi.

source: "Folders" (discussion sections, trackers, etc.) can also be monitored via e-mail. To monitor a folder click the dropdown arrow next to the Monitor button and select Monitor Current Folder.
es_mx: Las "carpetas" (secciones de discusión, rastreadores, etc.) pueden también ser monitoreadas vía e-mail. Para recibir notificaciones de una carpeta de clic en la flecha desplegable al lado del botón monitorear y seleccione monitorear la carpeta actual.
fr_ca: Les "dossiers" (discussion sections, trackers, etc.) peuvent également être surveillés par e-mail. Pour surveiller un dossier, cliquez sur la flèche déroulante à côté du bouton Monitor et sélectionnez Monitor Current Folder.

source: Monitoring Project Sections
es_mx: Monitoreando secciones de proyecto
fr_ca: Suivi des sections de projet

source: Monitoring entire sections.
fr_ca: Vous pouvez surveiller des sections entières de projet

source: It is also possible to set up for entire sections of the site. To set up this monitoring:
es_mx: También es posible ajustar para secciones completas del sitio. Para ajustar este monitoreo:
fr_ca: Il est également possible de configurer des sections entières du site. Pour configurer cette surveillance:

source: Click My Workspace
es_mx: Clic en My Workspace
fr_ca: Cliquez sur My Workspace

source: Click on the Monitoring Tab
es_mx: Clic en la pestaña de Monitoreo
fr_ca: Cliquez sur l’onglet Monitoring

source: Select the project from the list on the left
es_mx: Seleccione el proyecto desde la lista a la izquierda
fr_ca: Sélectionnez le projet à partir de la liste située à gauche

source: Click on the Monitored Applications tab
es_mx: Haga clic en la pestaña Monitored Applications
fr_ca: Cliquez sur l’onglet Monitored Applications

source: Check the box for any section you wish to subscribe to
es_mx: Marque la casilla de cualquier sección a la que desee suscribirse
fr_ca: Cochez la case pour toute section à laquelle vous souhaitez vous abonner

source: Click Save
es_mx: Haga click en guardar
fr_ca: Cliquez sur Save

source: Monitoring Settings
es_mx: Ajustes de monitoreo
fr_ca: Paramètres de surveillance

source: How the monitoring emails are configured.
fr_ca: Comment les e-mails de surveillance sont configurés.

source: You can set your overall notification settings to e-mail you per change or to send you a daily digest email with all changes. To do this:
es_mx: Puede configurar la configuración de la notificación general para que le envíe un correo electrónico por cada cambio o para que le envíe un correo electrónico de resumen diario con todos los cambios. Para ello haga lo siguiente:
fr_ca: Vous pouvez définir vos paramètres globaux de notification à vous transmettre via e-mail pour chaque modification ou pour vous envoyer un e-mail contenant un sommaire quotidien de toutes les modifications. Pour ce faire :

source: Click My Settings
es_mx: Haga clic en mi configuración
fr_ca: Cliquez sur My Settings

source: Select the desired setting
es_mx: Seleccione el ajuste deseado
fr_ca: Sélectionner le paramètre souhaité

source: Per Section Notification Settings
es_mx: Configuración de la notificación por sección
fr_ca: Paramètres de notification par section

source: Each section has a dropdown on how it should be treated.
fr_ca: Chaque section a une liste déroulante sur la façon dont elle doit être traitée.

source: You can also customize notifications on a per section basis. To do this:
es_mx: También puede personalizar las notificaciones por sección. Para ello:
fr_ca: Vous pouvez également personnaliser les notifications par section. Pour ce faire :

source: Click Monitoring
es_mx: Haga click en monitoreo
fr_ca: Cliquez sur Monitoring

source: Click on the FRC20**Beta project on the left side
es_mx: Haga clic en el proyecto FRC20**Beta en el lado izquierdo
fr_ca: Cliquez sur le projet *FRC20 Beta* situé sur le côté gauche

source: Select the Email Notification Preferences tab
es_mx: Seleccione la pestaña Preferencias de notificación de correo electrónico
fr_ca: Sélectionnez l’onglet Email Notification Preferences

source: Change the settings for any section of the project you wish to have override your base settings.
es_mx: Cambie la configuración de cualquier sección del proyecto que desee anular la configuración básica.
fr_ca: Modifiez les paramètres de n’importe quelle section du projet que vous souhaitez remplacer vos paramètres de base.
