Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/beta-getting-started/reporting-progress.po
Languages: fr_ca

source: Reporting Progress
fr_ca: Rendre compte des progrès

source: In order to help us track team participation, please post your team number at the top of your task report.
fr_ca: Afin de nous aider à suivre la participation de l’équipe, veuillez afficher votre numéro d’équipe en haut de votre rapport de tâche.

source: Accessing the Task Report Section
fr_ca: Accéder à la section Rapport de tâches

source: How to get to the "Task Reports" section via discussions.
fr_ca: Chaque section a une liste déroulante sur la façon dont elle doit être traitée.

source: To access the Task Reports section on Teamforge, click on the Discussions tab, then click on the Task Reports section.
fr_ca: Pour accéder à la section Rapports de tâches sur Teamforge, cliquez sur l'onglet Discussions, puis cliquez sur la section Task Reports.

source: The Task Reports Section
fr_ca: La section des rapports de tâches

source: The task reports section has a topic for each task.
fr_ca: La section des rapports de tâches a un sujet pour chaque tâche.

source: In the Task Reports section, create a single discussion topic titled `Team XXXX Task Reports` for your team and post reports for all tasks into that thread.
fr_ca: Dans la section Rapports de tâches, créez un seul sujet de discussion intitulé « Rapports de tâches de l'équipe XXXX » pour votre équipe et publiez des rapports pour toutes les tâches dans ce fil.

source: Progress Reporting
fr_ca: Rapports de progrès

source: This highlights the reply button used to report progress on a task.
fr_ca: Cela met en évidence le bouton de réponse utilisé pour signaler la progression d'une tâche.

source: Each task will have suggested feedback listed in the :ref:`task documents <docs/beta/tasks/beta-task-overview:Beta Task Overview>`.
fr_ca: Chaque tâche aura des suggestions de commentaires répertoriées dans les :ref:`task documents <docs/beta/tasks/beta-task-overview:Beta Task Overview>`.

source: We strongly prefer reports be done as text posts as opposed to attachments.
fr_ca: Nous préférons fortement que les rapports soient rédigés sous forme de messages texte plutôt que de pièces jointes.
