Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/beta-getting-started/trackers-reporting-bugs.po
Languages: es_mx, fr_ca

source: Trackers - Reporting Bugs
es_mx: Rastreadores: informes de errores
fr_ca: Traqueurs - Signaler les bogues

source: While we will certainly accept and respond to bugs in either location, we would prefer bugs for WPILib C++/Java components (libraries, VS Code, Shuffleboard, etc.) be submitted to the appropriate `GitHub repositories <https://github.com/wpilibsuite>`__.
es_mx: Si bien ciertamente aceptaremos y responderemos a los errores en cualquier ubicación, preferiríamos que los errores para los componentes de WPILib C ++ / Java (bibliotecas, VS Code, Shuffleboard, etc.) se envíen a los `GitHub repositories <https://github.com/wpilibsuite>`__.
fr_ca: Bien que nous acceptions et fassions le suivi des bogues dans l’un ou l’autre emplacement, nous préférerons que les bogues pour les composants WPILib C++/Java (librairies, VS Code, Shuffleboard, etc.) soient soumis aux `dépôts GitHub <https://github.com/wpilibsuite>`__.

source: Teamforge Bug Tracker
es_mx: Rastreador de errores de Teamforge
fr_ca: Traqueur de bogues Teamforge

source: The bug tracker and the fields needed to report a bug.
fr_ca: Le bug tracker et les champs nécessaires pour signaler un bug.

source: The bug tracker is used for reporting bugs you discover in WPILib or other FRC\ |reg| software. If you are not sure if particular behavior is a bug or not, err on the side of reporting the bug (or at least posting in the Discussion section).
es_mx: El bug tracker se utiliza para informar errores que se descubran en WPILib u otro software de FRC\ |reg| . Si no está seguro de si un comportamiento en particular es un error o no, opte por informar del error (o al menos publicarlo en la sección Discusión).
fr_ca: Le traqueur de bogues est utilisé pour signaler les bogues que vous découvrez dans WPILib ou d’autres logiciels FRC |reg|. Si vous n’êtes pas sûr de savoir si un comportement particulier est un bogue ou non, par prudence, signaler le bogue (ou du moins l’afficher dans la section Discussion).

source: On the Trackers tab, click on Bugs to reach the Bug Tracker. To Submit a new bug, click Submit New Artifact. The fields of the artifact are:
es_mx: En la pestaña Rastreadores, haga clic en Errores para llegar al Rastreador de errores. Para enviar un nuevo error, haga clic en Enviar nuevo artefacto. Los campos del artefacto son:
fr_ca: Sous l’onglet Trackers, cliquez sur Bugs pour atteindre le traqueur de bogues. Pour soumettre un nouveau bogue, cliquez sur Submit New Artifact. Les champs de l’artefact sont les suivants :

source: Title - Give your bug a meaningful title which describes the issue
es_mx: Título: asigne a su error un título significativo que describa el problema
fr_ca: Title - Donnez à votre bogue un titre évocateur qui décrit le problème

source: Description - Describe the bug including observed behavior, expected behavior and steps to reproduce
es_mx: Descripción: describa el error, incluido el comportamiento observado, el comportamiento esperado y los pasos para reproducirlo.
fr_ca: Description - Décrivez le bogue, y compris le comportement observé, le comportement attendu et les étapes à reproduire

source: Reported By - Enter your TeamForge user name or click the silhouette to open the selector where you can select your username.
es_mx: Reportado por: ingrese su nombre de usuario de TeamForge o haga clic en la silueta para abrir el selector donde puede seleccionar su nombre de usuario.
fr_ca: Reported By - Entrez votre nom d’utilisateur TeamForge ou cliquez sur la silhouette pour ouvrir le sélecteur où vous pouvez sélectionner votre nom d’utilisateur.

source: Category - Select the appropriate affected software from the dropdown list (LabVIEW WPILib, Java WPILib, Driver Station, etc.)
es_mx: Categoría: seleccione el software afectado apropiado de la lista desplegable (LabVIEW WPILib, Java WPILib, Driver Station, etc.)
fr_ca: Category - Sélectionnez le logiciel affecté approprié dans la liste déroulante (LabVIEW WPILib, Java WPILib, Driver Station, etc.)

source: Reported in Release - Select which version of the file you were using, if available.
es_mx: Reportado en versión: seleccione la versión del archivo que estaba usando, si está disponible.
fr_ca: Reported in Release - Sélectionnez la version du fichier que vous utilisiez, si disponible.

source: Priority - If desired you may estimate a priority based on bug severity. Leaving at the default priority does not mean the bug will not be addressed. -All new bugs are analyzed by the Control System team and assigned an appropriate priority.
es_mx: Prioridad: si lo desea, puede estimar una prioridad según la gravedad del error. Dejar la prioridad predeterminada no significa que el error no se solucionará. -Todos los errores nuevos son analizados por el equipo del Sistema de Control y se les asigna una prioridad adecuada.
fr_ca: Priority - Si vous le souhaitez, vous pouvez définir une priorité en fonction de la gravité des bogues. Laisser un bogue à la priorité par défaut ne signifie pas que ce bogue ne sera pas résolu. -Tous les nouveaux bogues sont analysés par l’équipe du système de contrôle et se voient attribuer une priorité appropriée.

source: Status - When reporting a new bug this should be left as Open.
es_mx: Estado: al informar un nuevo error, debe dejarse como Abierto.
fr_ca: Status - Lorsque vous signalez un nouveau bogue, conservez l'option Open.

source: Assigned To - When reporting a bug this should be left blank. The Control System team uses this field to indicate who is working on a given artifact.
es_mx: Asignado a: al informar de un error, debe dejarse en blanco. El equipo del Sistema de control utiliza este campo para indicar quién está trabajando en un artefacto determinado.
fr_ca: Assigned To - Lors de la déclaration d’un bogue, cette option doit être laissée vide. L’équipe du système de contrôle utilise ce champ pour indiquer qui travaille sur un artefact donné.

source: Attachment - Attach any additional file that may be appropriate, examples of appropriate files would be a patch for the bug, code to reproduce the bug (single file or zip) or an image of the bug (if appropriate/necessary).
es_mx: Adjunto: adjunte cualquier archivo adicional que pueda ser apropiado, ejemplos de archivos apropiados serían un parche para el error, código para reproducir el error (archivo único o zip) o una imagen del error (si es apropiado / necesario).
fr_ca: Attachment - Joindre tout fichier supplémentaire qui peut être approprié, des exemples de fichiers appropriés seraient un patch pour le bogue, le code pour reproduire le bogue (fichier unique ou zip) ou une image du bogue (si approprié/nécessaire).

source: GitHub Issues
es_mx: Problemas de GitHub
fr_ca: Problèmes avec GitHub

source: The Github issues tab for the different projects in wpilibsuite.
fr_ca: L'onglet Problèmes Github pour les différents projets dans wpilibsuite.

source: For bugs in WPILib C++/Java/Java dashboards/etc., please locate the appropriate repository from the `WPILibSuite GitHub <https://github.com/wpilibsuite>`__ organization and report the bug there. To Report a bug, click the **Issues** tab and select **New issue**.
es_mx: Para errores en WPILib C++ / Java / paneles de control de Java / etc., Localice el repositorio apropiado de la organización `WPILibSuite GitHub <https://github.com/wpilibsuite>`__ e informe el error allí. Para informar un error, haga clic en la pestaña **Issues** y seleccione **New issue**.
fr_ca: Pour les bogues dans WPILib C++/Java/Java dashboards/etc., veuillez localiser le dépôt approprié à partir de l’organisation `WPILibSuite GitHub <https://github.com/wpilibsuite>`__ et signaler le bogue. Pour signaler un bogue, cliquez sur l’onglet **Issues** et sélectionnez **New issue**.

source: Fill out a title and description of the bug, then click **Submit new issue**.
es_mx: Complete un título y una descripción del error, luego haga clic en **Submit new issue**.
fr_ca: Remplissez un titre et une description du bogue, puis cliquez sur **Submit new issue**.
