Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/axis-camera/axis-m1013-camera-compatibility.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Axis M1013 Camera Compatibility
es_mx: Compatibilidad de la Cámara Axis M1013
fr_ca: Compatibilité de la caméra Axis M1013
tr_tr: Axis M1013 Kamera Uyumluluğu
zh_cn: Axis M1013相机兼容性

source: The Axis M1011 camera has been discontinued and superseded by the Axis M1013 camera. This document details the differences between the two cameras when used with WPILib and the provided sample vision programs.
es_mx: La cámara Axis M1011 ha sido descontinuada y sucedida por la cámara M1013. Este documento detalla las diferencias entre las dos cámaras cuando están siendo usadas en WPILib y los programas de visión que contiene.
fr_ca: La caméra Axis M1011 a été abandonnée et remplacée par la caméra Axis M1013. Ce document détaille les différences entre les deux caméras lorsqu'elles sont utilisées avec WPILib et les exemples de programmes de vision fournis.
tr_tr: Axis M1011 kamera durduruldu ve Axis M1013 kamera ile değiştirildi. Bu belge, WPILib ile birlikte kullanıldığında iki kamera arasındaki farkları ve sağlanan örnek görüntü programlarını ayrıntılarıyla açıklamaktadır.
zh_cn: Axis M1013摄像头取代了已停产的Axis M1011摄像头。本文档详细介绍了两个摄像头在与WPILib和其提供的视觉程序样例一起使用时之间的区别。

source: Optical Differences
es_mx: Diferencias opticas
fr_ca: Différences optiques
tr_tr: Optik Farklılıklar
zh_cn: 光学差异

source: The Axis M1013 camera has a few major optical differences from the M1011 camera:
es_mx: La Axis M1013 tiene algunas mejoras ópticas comparada con la Axis M1011:
fr_ca: La caméra Axis M1013 présente quelques différences optiques majeures par rapport à la caméra M1011:
tr_tr: Axis M1013 kamera, M1011 kameradan birkaç önemli optik farklılığa sahiptir:
zh_cn: Axis M1013摄像头与M1011摄像头在光学方面存在几个主要的差异：

source: The M1013 is an adjustable focus camera. Make sure to focus your M1013 camera by turning the grey and black lens housing to make sure you have a clear image at your desired viewing distance.
es_mx: La M1013 es una cámara de foco ajustable. Asegúrese de enfocar su cámara M1013 girando la carcasa del objetivo gris y negro para asegurarse de tener una imagen clara a la distancia de visualización deseada.
fr_ca: Le M1013 est une caméra à mise au point réglable. Assurez-vous de focaliser votre appareil photo M1013 en tournant le boîtier de l'objectif gris et noir pour vous assurer d'avoir une image claire à la distance de visualisation souhaitée.
tr_tr: M1013, ayarlanabilir odaklamalı bir kameradır. İstediğiniz izleme mesafesinde net bir görüntü elde ettiğinizden emin olmak için gri ve siyah lens muhafazasını çevirerek M1013 kameranızı odakladığınızdan emin olun.
zh_cn: M1013是可调焦相机。确保通过转动灰色和黑色的镜头罩来对焦M1013相机，以此保证在所需的观看距离可以获得清晰的图像。

source: The M1013 has a wider view angle (67\ |deg|) compared to the M1011 (47\ |deg|). This means that for a feature of a fixed size, the image of that feature will span a smaller number of pixels
es_mx: La M1013 tiene un Angulo de vista mayor (67°) comparada con la M1011 (47°). Esto significa que, para una vista de un tamaño fijo, la imagen de esa vista abarcará un número menor de píxeles
fr_ca: Le M1013 a un angle de vue plus large (67\ |deg|) par rapport au M1011 (47\ |deg|). Cela signifie que pour un objet de taille fixe, l'image de cet objet s'étalera sur un plus petit nombre de pixels
tr_tr: M1013, M1011'e (47 \ | deg |) kıyasla daha geniş bir görüş açısına (67 \ | deg |) sahiptir. Bu, sabit boyutlu bir özellik için, bu özelliğin görüntüsünün daha az sayıda piksele yayılacağı anlamına gelir
zh_cn: 与M1011（47 \ | deg |）相比，M1013具有更宽的视角（67 \ | deg |）。这意味着在拍摄固定尺寸的物体时，在M1013相机中该物体的图像将覆盖较少数量的像素。

source: Using the M1013 with WPILib
es_mx: Usando la M1013 con WPLib
fr_ca: Utilisation du M1013 avec WPILib
tr_tr: M1013'ü WPILib ile kullanma
zh_cn: 通过WPILib使用M1013

source: The M1013 camera has been tested with all of the available WPILib parameters and the following performance exceptions were noted:
es_mx: La cámara M1013 ha sido probada con todos los parámetros disponibles en WPILib y las siguientes excepciones de función fueron encontradas:
fr_ca: La caméra M1013 a été testée avec tous les paramètres WPILib disponibles et les différences suivantes au niveau de la performance ont été notées:
tr_tr: M1013 kamera, mevcut tüm WPILib parametreleriyle test edilmiş ve aşağıdaki performans istisnaları not edilmiştir:
zh_cn: M1013摄像机已经用所有可用的WPILib参数进行了测试，并有以下性能例外被记录下来：

source: The M1013 does not support the 160x120 resolution. Requesting a stream of this resolution will result in no images being returned or displayed.
es_mx: La M1013 no es compatible con la resolución 160x120. Configurar el stream a esta resolución resultara en no tener ninguna imagen en la pantalla.
fr_ca: La caméra M1013 ne prend pas en charge la résolution 160x120. Si vous demandez un flux vidéo pour cette résolution, aucune image ne sera retournée ou affichée.
tr_tr: M1013, 160x120 çözünürlüğü desteklemez. Bu çözünürlüğe sahip bir akış talep etmek, hiçbir görüntü döndürülmez veya görüntülenmez.
zh_cn: M1013不支持160x120分辨率。请求该分辨率的视频流将导致不返回或显示任何图像。

source: The M1013 does not appear to work with the Color Enable parameter exposed by WPILib. Regardless of the setting of this parameter a full color image was returned.
es_mx: La M1013 no funciona con el parámetro de ColorEnable de WPILib. Sin importar la configuración de este parámetro siempre aparece una imagen con color completo.
fr_ca: Le M1013 ne semble pas fonctionner avec le paramètre Color Enable supporté par WPILib. Quel que soit le réglage de ce paramètre, une image en couleur sera retournée.
tr_tr: M1013, WPILib tarafından sunulan Renk Etkinleştirme parametresiyle çalışmıyor gibi görünüyor. Bu parametrenin ayarından bağımsız olarak, tam renkli bir görüntü döndürüldü.
zh_cn: M1013似乎不适用于WPILib公开的“颜色启用”参数。无论此参数的设置如何，都将返回全彩色图像。

source: All other WPILib camera parameters worked as expected. If any issues not noted here are discovered, please file a bug report on GitHub.
es_mx: Todos los demás parámetros de cámara de WPILib trabajan de la manera deseada. Si cualquier problema que no está listado aquí es descubierto, favor de notificar un reporte de bug en GitHub.
fr_ca: Tous les autres paramètres de la caméra WPILib fonctionnent comme prévu. Si vous trouvez d'autres problèmes non mentionnés ici, SVP veuillez déposer un rapport de bogue sur GitHub.
tr_tr: Diğer tüm WPILib kamera parametreleri beklendiği gibi çalıştı. Burada belirtilmeyen herhangi bir sorun tespit edilirse, lütfen GitHub'da bir hata raporu oluşturun.
zh_cn: 所有其他WPILib摄像机参数均按预期工作。如果发现此处未提及的任何问题，请在GitHub上提交错误报告。
