Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/axis-camera/calibration.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: The measurements for each particle will now be displayed in the window at the bottom of the screen. If your image has multiple particles, you can click in each box to have Vision Assistant highlight the particle so you can make sure you have the right one. This article will show the calculation using a single image, but you may wish to perform the calculation on multiple images from multiple distances and use a technique such as averaging or least squares fit to determine the appropriate value for the View angle. You can use the same arrow controls described in the color section above to change the active image.
es_mx: Las medidas para cada partícula puede ahora ser desplegada en la ventana del fondo de la pantalla. Si su imagen tiene múltiples partículas, puede dar click en cada caja para que Visión Assistant resalte la partícula y pueda estar seguro de tener el correcto. Éste artículo mostrará el calculo usando una sola imagen, pero debe desear realizar el calculo en múltiples imágenes con múltiples distancias y usando técnicas como promedio o ajustes de mínimos cuadrados para determinar el valor apropiado para el ángulo de Visión. Puede usar el mismo control de flecha explicado en la sección de color arriba para cambiar la imagen activa.
fr_ca: Les mesures de chaque particule seront désormais affichées dans la fenêtre en bas de l'écran. Si votre image contient plusieurs particules, vous pouvez cliquer dans chaque case pour que Vision Assistant surligne la particule afin de vous assurer que vous avez la bonne. Cet exemple démontre le calcul en utilisant une seule image, mais il serait préférable d'effectuer le calcul sur plusieurs images à partir de plusieurs distances. Utilisez ensuite une technique telle que la moyenne ou l'ajustement des moindres carrés pour déterminer la valeur appropriée pour l'angle de vue. Vous pouvez utiliser les mêmes contrôles décrits dans la section des couleurs ci-dessus pour modifier l'image active.
tr_tr: Her partikül için ölçümler artık ekranın altındaki pencerede görüntülenecektir. Görüntünüzde birden fazla parçacık varsa, doğru parçacığa sahip olduğunuzdan emin olmak için Vision Assistant'ın parçacığı vurgulaması için her kutuya tıklayabilirsiniz. Bu makale hesaplamayı tek bir görüntü kullanarak gösterecektir, ancak hesaplamayı birden çok mesafeden birden fazla görüntü üzerinde yapmak ve Görünüm açısı için uygun değeri belirlemek için ortalama veya en küçük kareler gibi bir teknik kullanmak isteyebilirsiniz. Etkin görüntüyü değiştirmek için yukarıdaki renk bölümünde açıklanan aynı ok kontrollerini kullanabilirsiniz.
zh_cn: 每个颗粒的测量值将显示在屏幕底部的窗口中。 如果图像有多个颗粒，可以通过框中点击，让视觉助手突出显示该颗粒，以便确定所选择操作的颗粒。 本文展示的是对单个图像进行的计算，但您可能希望对来自多个距离的多个图像进行计算，并使用平均或最小二乘法拟合等技术确定视角的适当值。 可以使用与上述颜色部分中描述的相同箭头控件来更改活动图像。

source: Calculation
es_mx: Calcular
fr_ca: Calculs
tr_tr: Hesaplama
zh_cn: 计算

source: As seen in the previous step, the particle representing the 32in tall vertical target in this example measured 85 pixels tall in a 640x480 image. The image shown was taken from (very roughly) 18 ft. away. Plugging these numbers into the equation from above....
es_mx: Como vimos en pasos pasados, las partículas representan un objetivo vertical de 32 pulgadas de alto en éste ejemplo que mide 85 pixeles de alto en una imagen de 640x480. La imagen mostrada fue tomada (manera dificil) desde 18 pies. Ponemos estos números en la ecuación desde arriba...
fr_ca: Comme vu à l'étape précédente, la particule représentant la cible verticale de 32 pouces de hauteur dans cet exemple mesurait 85 pixels de hauteur dans une image 640x480. L'image montrée a été prise à 18 pieds environ. Insérer ces mesures dans l'équation ci-dessus ....
tr_tr: Önceki adımda görüldüğü gibi, bu örnekte 32 inç yüksekliğindeki dikey hedefi temsil eden parçacık, 640x480 görüntüde 85 piksel uzunluğunda ölçülmüştür. Gösterilen görüntü (çok kabaca) 18 ft. Uzaklıktan alınmıştır. Bu sayıları yukarıdan denkleme koyarsak ...
zh_cn: 如前一步所示，本例中代表32英寸高垂直目标的颗粒在640x480图像中测量了85个像素高。 所示图像取自（非常粗略）18英尺之外。把这些数字代入上面的方程式…...

source: Depending on what you use to calculate the arctangent, your answer may be in radians, make sure to convert back to degrees if entering directly into the sample code as the view angle.
es_mx: Dependiendo de lo que use para calcular el arcotangente, la respuesta debe estar en radianes, asegúrese de convertir de vuelta a grados si lo pone directamente en el código de ejemplo como el ángulo de visión.
fr_ca: Selon ce que vous utilisez pour calculer l'arc tangente, votre réponse peut être en radians, assurez-vous de la convertir en degrés avant de l'insérer dans l'exemple de code dans la variable View Angle .
tr_tr: Arktanjantı hesaplamak için ne kullandığınıza bağlı olarak, cevabınız radyan cinsinden olabilir, görüş açısı olarak doğrudan örnek koda giriyorsanız dereceye geri döndüğünüzden emin olun.
zh_cn: 根据你计算的反正切函数，答案可能是弧度，如果直接输入样本代码作为视角，一定要把它转换回角度。

source: The code uses View Angle and we just calculated |theta|. Make sure to multiply |theta| by 2 if replacing the constants in the code. Multiplying our result by 2 yields 45.3\ |deg|. This image is from a M1013 camera, so our value is a bit off from the previously measured 29.1 but given that the 18ft. was a very rough measurement this shows that we are in the ballpark and likely performed the calculation correctly.
es_mx: El código usa Ángulo de Visión y nosotros justo calculamos |theta|. Asegúrese de multiplicar |theta| por 2 si remplaza las constantes en el código. Multiplicando nuestro resultado por 2 resultando 45.3\ |deg|. Ésta imagen es de una cámara M1013, entonces nuestro valor es un poco menor de lo anteriormente medido 29.1 pero dando los 18 pies fue una medida más difícil, esto muestra que estamos en un campo de juego y debemos hacer un cálculo correcto.
fr_ca: Le code utilise "View Angle" et nous venons de calculer |theta|. Assurez-vous de multiplier |theta| par 2 si vous remplacez les constantes dans le code. La multiplication de notre résultat par 2 donne 45.3\ |deg|. Cette image provient d'une caméra M1013, donc notre valeur est un peu différente de la mesure précédente de 29.1. Étant donné que le 18 pieds était une approximation, nous sommes proche de la vraie valeur et avons probablement effectué le calcul correctement.
tr_tr: Kod, Görüş Açısını kullanıyor ve az önce | teta | 'yı hesapladık. | Theta | ile çarptığınızdan emin olun. koddaki sabitler değiştiriliyorsa 2 ile. Sonucumuzu 2 ile çarparsak 45,3 \ | deg | verir. Bu görüntü bir M1013 kameradan alınmıştır, bu nedenle değerimiz daha önce ölçülen 29.1'e göre biraz düşüktür, ancak 18 ft. çok kaba bir ölçümdü, bu da bizim beyzbol sahasında olduğumuzu ve muhtemelen hesaplamayı doğru yaptığımızı gösteriyor.
zh_cn: 采用视角作为代码，我们刚刚计算了θ。 如果替换代码中的常量，请确保θ乘以2。 将我们的结果也乘以2，得到45.3°。 该图像来自M1013相机，因此我们的值与先前测量的29.1略微偏离，但考虑到18英尺。 这是一个非常粗略的测量，这表明我们处于大致范围内，并且可能正确地执行了计算。
