Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/axis-camera/calibration.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Calibration
es_mx: Calibración
fr_ca: Étalonnage
tr_tr: Kalibrasyon
zh_cn: 校准

source: While many of the numbers for the Vision Processing code can be determined theoretically, there are a few parameters that are typically best to measure empirically then enter back into the code (a process typically known as calibration). This article will show how to perform calibration for the Color (masking), and View Angle (distance) using the NI Vision Assistant. If you are using C++ or Java and have not yet installed the NI Vision Assistant, see the article Installing NI Vision Assistant.
es_mx: Mientras muchos de los números del código para procesar visión pueden ser determinados de manera teórica, hay algunos parámetros que son típicamente mejores de medir de manera empírica para después meterlos en el código (este proceso es conocido como calibración). Este articulo le mostrará como realizar la calibración de color (enmascaramiento) y ángulo de visión (distancia) usando el NI Vision Assistant. Si está usando C++ o Java y no ha instalado todavía NI Vision Assistant, vea el artículo Instalando NI Vision Assistant.
fr_ca: Bien que de nombreux paramètres pour le code Vision Processing puissent être déterminés théoriquement, certains paramètres sont généralement mieux mesurés empiriquement, puis réintégrés dans le code (un processus connu sous le nom d'étalonnage). Cet article montrera comment effectuer l'étalonnage de la couleur (masquage) et de l'angle de vue (distance) à l'aide de NI Vision Assistant. Si vous utilisez C++ ou Java et que vous n'avez pas encore installé NI Vision Assistant, consultez l'article Installation de NI Vision Assistant.
tr_tr: Görme İşleme kodu için sayıların çoğu teorik olarak belirlenebilse de, genellikle deneysel olarak ölçmek ve ardından koda geri girmek için en iyi olan birkaç parametre vardır (tipik olarak kalibrasyon olarak bilinen bir işlem). Bu makale, NI Vision Assistant kullanılarak Renk (maskeleme) ve Görüş Açısı (mesafe) için nasıl kalibrasyon yapılacağını gösterecektir. C ++ veya Java kullanıyorsanız ve henüz NI Vision Assistant'ı yüklemediyseniz, NI Vision Assistant'ı Yükleme makalesine bakın.
zh_cn: 虽然视觉处理代码的许多数字可以从理论上确定，但有几个参数通常最好通过经验测量，然后输入代码（通常称为校准的过程）。 本文将展示如何使用NI视觉助手对颜色（掩蔽）和视角（距离）进行校准。 如果您使用的是C++或Java，还未安装NI视觉助手，请参阅如何安装NI视觉助手的说明。

source: Enable Snapshots
es_mx: Activando fotos instantáneas
fr_ca: Activer les clichés (Snapshots)
tr_tr: Enable Snapshots-Anlık Görüntüleri Etkinleştir
zh_cn: 启用快照

source: AXIS Camera's web interface.
fr_ca: Interface web de la caméra AXIS

source: To capture snapshots from the Axis camera, you must first enable the Snapshot button. Open a web-browser and browse to camera's address (10.TE.AM.11), enter the Username/Password combo FRC/FRC if prompted, then click Setup->Live View Config->Layout. Click on the checkbox to Show snapshot button then click Save.
es_mx: Para capturar fotos desde la cámara Axis, usted primero debe activar el botón para tomar fotos instantáneas. Abra un navegador web y busque la dirección de la cámara (10.TE.AM.11), ingrese el Nombre de usuario/Contraseña de FRC si lo sugiere, entonces haga click en Setup->Live View Config->Layout. Seleccione la casilla de “Show snapshot button” y haga click en Save.
fr_ca: Pour capturer des clichés à partir de la caméra Axis, vous devez d'abord activer le bouton Snapshot. Ouvrez un navigateur Web et accédez à l'adresse de la caméra (10.TE.AM.11), entrez le combo Nom d'utilisateur/Mot de passe FRC , puis cliquez sur Configuration-> Live View Config-> Layout. Cochez la case Show snapshot, puis cliquez sur Save.
tr_tr: Axis kamerasından anlık görüntüler yakalamak için, önce Enstantane düğmesini etkinleştirmelisiniz. Bir web tarayıcısı açın ve kamera adresine göz atın (10.TE.AM.11), istenirse Kullanıcı Adı / Şifre kombinasyonunu FRC / FRC'yi girin, ardından Kurulum-> Canlı Görüntü Yapılandırması-> Düzen'i tıklayın. Anlık görüntü düğmesini göstermek için onay kutusunu tıklayın ve ardından Kaydet'i tıklayın.
zh_cn: 要使用Axis相机捕获快照，必须首先启用快照按钮。打开网页浏览器，转至相机网址（10.TE.AM.11），如有提示，输入用户名/密码组合FRC/FRC，然后点击Setup->Live View Config->Layout。点击复选框以显示快照按钮，然后点击保存。

source: Check Camera Settings
es_mx: Comprobando la configuración de la cámara
fr_ca: Vérifier les paramètres de la caméra
tr_tr: Kamera Ayarlarını Kontrol Edin
zh_cn: 检查相机设置

source: Video & Image Setting page.
fr_ca: Page des paramètres Vidéo & Image.

source: Depending on how you are capturing the image stream in your program, it may be possible to stream a different resolution, framerate and/or compression than what is saved in the camera and used in the Live View. Before performing any calibration it is recommended you verify that the settings in the camera match the settings in your code. To check the settings in the camera, click on the Video and Image header on the left side of the screen, then click Video and Image.
es_mx: Dependiendo de como es que usted está capturando la imagen del stream en su programa, es posible tener el stream en una diferente resolución, cuadros por segundo y/o compresión que la ya establecida en la cámara. Antes de hacer cualquier calibración es recomendable verificar cual es la configuración de la cámara y si esta corresponde con el código. Para verificar la configuración de la cámara, haga click en el subtitulo de Video and Image en el lado izquierdo de la pantalla y después haga click en Video and Image.
fr_ca: Selon la façon dont vous capturez le flux d'images dans votre programme, il peut être possible de diffuser à une résolution, une fréquence d'images et/ou une compression différentes de celles enregistrées dans la caméra et utilisées dans la vue en direct (Live). Avant d'effectuer un étalonnage, il est recommandé de vérifier que les paramètres de la caméra correspondent aux paramètres de votre code. Pour vérifier les paramètres de l'appareil photo, cliquez sur l'en-tête "Vidéo and Image" sur le côté gauche de l'écran, puis cliquez sur "Vidéo and Image".
tr_tr: Görüntü akışını programınızda nasıl yakaladığınıza bağlı olarak, kamerada kaydedilenden ve Canlı Görüntüde kullanılandan farklı bir çözünürlük, kare hızı ve / veya sıkıştırma akışı yapmak mümkün olabilir. Herhangi bir kalibrasyon yapmadan önce, kameradaki ayarların kodunuzdaki ayarlarla eşleştiğini doğrulamanız önerilir. Kameradaki ayarları kontrol etmek için ekranın sol tarafındaki Video ve Görüntü başlığına tıklayın, ardından Video ve Görüntü seçeneğine tıklayın.
zh_cn: 程序中捕获图像方式的不同，可能会使相机中保存并在直播视图中出现的图像呈现不同的分辨率、帧率和/或压缩比率。 在进行任何校准之前，建议你先验证相机中的设置是否与代码中的设置相匹配。 要检查相机设置，请单击屏幕左侧的“视频和图像”标题，然后单击“视频和图像”。

source: Capture Images
es_mx: Capturando imagenes
fr_ca: Capturer des images
tr_tr: Görüntüleri Yakala
zh_cn: 采集图像

source: Camera image after clicking the "Live View" button.
fr_ca: Image de la caméra après avoir cliqué sur le bouton "Live View".

source: Click the Live View button to return to the Live View page and you should now see a Snapshot button. Clicking this button opens a pop-up window with a static image capture. Right-click on this image, select Save Image as and select your desired location and file name, then save the image.
es_mx: Haga click en el botón de Live View para regresar a la página de Video en vivo y usted debería ser capaz de ver un botón para fotos instantáneas. Hacer click en este botón abrirá otra Ventana con una imagen estática. Haga click derecho y seleccione “Guardar imagen como” y seleccione la localización donde quiere que el archivo se guarde, paso siguiente guarde la imagen.
fr_ca: Cliquez sur le bouton "Live View" pour revenir à la page "Live View" et vous devriez maintenant voir un bouton "Snapshot". Cliquer sur ce bouton ouvre une fenêtre contextuelle avec une capture d'image statique. Cliquez avec le bouton droit sur cette image, sélectionnez "Save Image", puis sélectionnez l'emplacement et le nom de fichier souhaités, puis enregistrez l'image.
tr_tr: Canlı Görünüm sayfasına dönmek için Canlı Görünüm düğmesine tıklayın ve şimdi bir Anlık Görüntü düğmesi görmelisiniz. Bu düğmeyi tıklamak, statik görüntü yakalamanın olduğu bir açılır pencere açar. Bu resme sağ tıklayın, Resmi Farklı Kaydet'i seçin ve istediğiniz konumu ve dosya adını seçin, ardından resmi kaydedin.
zh_cn: 点击直播视图按钮返回到直播视图页面，你就会看到快照按钮。 点击此按钮将打开带有静态图像捕获的弹出窗口。 右击此图标，选择“另存为”（Save image as），并选择要保存的位置和文件夹，保存图像。

source: Load Image(s) in Vision Assistant
es_mx: Subiendo imágen(es) al Vision Assistant
fr_ca: Charger des images dans Vision Assistant
tr_tr: Görsel(leri) Vision Assistant'a Yükle
zh_cn: 在视觉助手中加载图像

source: Open the image using the folder icon in the top left of the NI Vision Assistant.
fr_ca: Ouvrez l’image à l’aide de l’icône de dossier en haut à gauche de NI Vision Assistant.

source: Open the NI Vision Assistant and select the Browse Images option. Select the Open Images icon in the top left of the Toolbar, then locate your images. Repeat as necessary to load all desired images.
es_mx: Abra el NI Vision Assistant y seleccione la opción de Open Images en la esquina superior de la barra de herramientas, busque sus imágenes y repita el proceso hasta que suba todas las imágenes deseadas.
fr_ca: Ouvrez NI Vision Assistant et sélectionnez l'option "Browse Images". Sélectionnez l'icône "Open Images" dans le coin supérieur gauche de la barre d'outils, puis recherchez vos images. Répétez autant de fois que nécessaire pour charger toutes les images souhaitées.
tr_tr: NI Vision Assistant'ı açın ve Görüntülere Gözat seçeneğini seçin. Araç Çubuğunun sol üst kısmındaki Resimleri Aç simgesini seçin, ardından resimlerinizi bulun. İstenen tüm görüntüleri yüklemek için gerektiği kadar tekrarlayın.
zh_cn: 打开NI视觉助手，选择浏览图像选项。 选择工具栏左上角的“打开图像”图标，然后定位图像。 需要时可重复操作，以加载所有预期图像。

source: Color Threshold
es_mx: Umbral de colores
fr_ca: Seuil de couleur (Threshold)
tr_tr: Color Threshold-Renk Eşiği
zh_cn: 颜色阈值

source: Setting up a color threshold on the image we took.
fr_ca: Réglage d’un seuil de couleur sur l’image que nous avons prise.

source: Click Process Images in the top right, then select the color tab on the bottom right and click the Color Threshold icon.
es_mx: Haga click en Process Images en la orilla de superior derecha y seleccione la pestaña de color en el botón derecho y click en el botón de Color Threshold.
fr_ca: Cliquez sur Traiter les images en haut à droite, puis sélectionnez l'onglet couleur en bas à droite et cliquez sur l'icône "Color Threshold".
tr_tr: Sağ üstteki Görüntüleri İşle'yi tıklayın, ardından sağ alttaki renk sekmesini seçin ve Renk Eşiği simgesini tıklayın.
zh_cn: 点击右上角的过程图像，然后选择右下角的颜色选项卡，并点击颜色阈值图标。

source: HSV Calibration
es_mx: Calibración del HSV
fr_ca: Étalonnage HSV
tr_tr: HSV Kalibrasyonu
zh_cn: 颜色模型的校准

source: HSV calibration to tune to the color of your light.
fr_ca: Étalonnage HSV pour régler la couleur de votre lumière.

source: Change the Color Model dropdown to HSV. Next tune the window on each of the three values to cover as much of the target as possible while filtering everything else. If using a green light, you may want to use the values in the sample code as a starting point. If you have multiple images you can use the controls in the top left to cycle through them. Use the center two arrow controls or the slider to change the preview image in the top left window, then click the right-most arrow to make it the active image. When you are happy with the values you have selected, note down the ranges for the Hue, Saturation and Value. You will need to enter these into the appropriate place in the vision code. Click OK to finish adding the step to the script.
es_mx: Cambie el menú desplegable del Modelo de color a HSV. A continuación, ajuste la ventana en cada uno de los tres valores para cubrir la mayor parte del objetivo posible mientras filtra todo lo demás. Si usa una luz verde, puede usar los valores en el código de muestra como punto de partida. Si tiene varias imágenes, puede usar los controles en la esquina superior izquierda para recorrerlas. Use los controles centrales de dos flechas o el control deslizante para cambiar la imagen de vista previa en la ventana superior izquierda, luego haga clic en la flecha de la derecha para convertirla en la imagen activa. Cuando esté satisfecho con los valores que ha seleccionado, anote los rangos de Tono, Saturación y Valor. Deberá ingresarlos en el lugar apropiado en el código de visión. Haga clic en OK.
fr_ca: Choisissez l'option HSV dans le menu déroulant "Color Model". Ensuite, ajustez les limites min-max sur chacune des trois valeurs HSV pour laisser passer le plus de pixels possibles de la cible tout en filtrant le reste. Si vous utilisez un éclairage de couleur verte, vous pouvez utiliser les valeurs HSV du code exemple comme point de départ. Si vous avez plusieurs images, vous pouvez utiliser les commandes en haut à gauche pour les choisir une à une. Utilisez les deux flèches centrales ou le glisseur pour modifier l'image d'aperçu dans la fenêtre supérieure gauche, puis cliquez sur la flèche la plus à droite pour en faire l'image active. Lorsque vous êtes satisfait des valeurs sélectionnées, notez les plages de teinte (Hue), de saturation et de valeur. Vous devrez les transcrire à l'endroit approprié dans le code de vision. Cliquez sur OK pour terminer et ajouter cet étape au script.
tr_tr: Renk Modeli açılır menüsünü HSV olarak değiştirin. Ardından, diğer her şeyi filtrelerken hedefin mümkün olduğunca çoğunu kapsayacak şekilde üç değerin her birindeki pencereyi ayarlayın. Yeşil ışık kullanıyorsanız, örnek koddaki değerleri başlangıç noktası olarak kullanmak isteyebilirsiniz. Birden fazla görüntünüz varsa, bunlar arasında geçiş yapmak için sol üstteki kontrolleri kullanabilirsiniz. Sol üst penceredeki önizleme görüntüsünü değiştirmek için ortadaki iki ok denetimini veya kaydırıcıyı kullanın, ardından bunu etkin görüntü yapmak için en sağdaki oku tıklayın. Seçtiğiniz değerlerden memnun olduğunuzda Ton, Doygunluk ve Değer aralıklarını not edin. Bunları görüş kodunda uygun yere girmeniz gerekecektir. Adımı komut dosyasına eklemeyi tamamlamak için Tamam'ı tıklayın.
zh_cn: 在颜色模型下拉菜单中选择HSV。接下来，在这三个窗口中进行每一个值的调整，在执行筛选功能时，覆盖尽可能多的目标。如果使用绿灯，意味着希望使用示例代码中的值作为起点。如果有多个图像，可以使用左上角的控件对它们进行循环。使用中间的两个箭头控件或滑块更改左上角窗口中的预览图像，然后单击最右边的箭头使其成为活动图像。当对所选择的值感到满意时，记下色调、饱和度和明度值的范围。需将这些输入到视觉代码中的适当位置。单击OK即完成向脚本中的添加。

source: You may wish to take some new sample images using the time for camera calibration at your event to verify or tweak your ranges slightly based on the venue lighting conditions.
es_mx: Puede que usted desee usar imágenes de ejemplo usando el tiempo para la calibración de la cámara en eventos para verificar sus rangos basados en las condiciones de luz del lugar de evento.
fr_ca: Il est important de prendre plusieurs exemples d'image, surtout sur le vrai terrain de jeu lors de la compétition, pour vérifier ou ajuster vos filtres HSV en fonction de l'éclairage réel. Un reflet inattendu d'un projecteur peut ressembler à une cible.
tr_tr: Mekan aydınlatma koşullarına bağlı olarak aralıklarınızı doğrulamak veya biraz ince ayar yapmak için etkinliğinizde kamera kalibrasyonu süresini kullanarak yeni örnek görüntüler almak isteyebilirsiniz.
zh_cn: 你可能希望在自己活动中使用相机在校准模式下拍摄一些新的样本图像，并根据场地照明条件验证或调整值的范围。

source: View Angle/Distance Calibration
es_mx: Verificando la calibración Angulo/Distancia
fr_ca: Afficher l'étalonnage d'angle/distance
tr_tr: Açı / Mesafe Kalibrasyonunu Görüntüle
zh_cn: 视角/距离校准

source: While a theoretical view angle for each camera model can be found in the datasheet, empirical testing has found that these numbers may be a bit off even for the horizontal view angle. Given that this year's code uses the vertical field-of-view it is best to perform your own calibration for your camera (though empirical values for each camera type are included in the code as a reference). To do this set up an equation where the view angle, |theta|, is the only unknown. To do this, utilize a target of known size at a known distance, leaving the view angle as the only unknown. Let's take our equation from the previous article, :math:`d = T_{\mathrm{ft}} \cdot \frac{\textit{FOV}_{\mathrm{pixel}}}{T_{\mathrm{pixel}}\tan\theta}`, and re-arrange it to solve for |theta|:
es_mx: Mientras que una vista teórica del Angulo de cada cámara puede ser encontrada en su ficha de datos, probar empíricamente ha demostrado que estos números pueden estar algo desfasados para el ángulo horizontal. Dado que el código de este año utiliza una vista vertical lo mejor es realizar su propia calibración de la cámara (a través de valores empíricos para cada cámara). Para hacer esta configuración se debe de hacer una ecuación donde el Angulo |theta|, es la unica incógnita. Para hacer esto utilice el objetivo a una distancia conocida dejando solamente la vista angular como lo único desconocido. Vamos a agarrar nuestra ecuación del articulo anterior, :math:`d = T_{\mathrm{ft}} \cdot \frac{\textit{FOV}_{\mathrm{pixel}}}{T_{\mathrm{pixel}}\tan\theta}`, y la despejamos para |theta|:
fr_ca: L'angle de vue spécifié pour chaque modèle de caméra peut être trouvé dans leur fiche technique. Par contre, des tests empiriques ont démontré que ces chiffres peuvent être un peu décalés. Lorsqu'on utilise le champ de vision vertical, il est préférable d'effectuer notre propre étalonnage de caméra (bien que des valeurs empiriques pour chaque type de caméra soient incluses dans le code comme référence). Pour ce faire, définissez une équation où l'angle de vue, |theta|, est la seule inconnue. Utilisez alors une cible de taille connue à une distance connue, laissant l'angle de vue comme la seule inconnue. Prenons notre équation de l'article précédent, :math:`d = T_{\mathrm{ft}} \cdot \frac{\textit{FOV}_{\mathrm{pixel}}}{T_{\mathrm{pixel}}\tan\theta}`, et résolvez pour |theta|:
tr_tr: Veri sayfasında her kamera modeli için teorik bir görüş açısı bulunabilse de, deneysel testler bu sayıların yatay görüş açısı için bile biraz yanlış olabileceğini bulmuştur. Bu yılki kodun dikey görüş alanını kullandığı göz önüne alındığında, kameranız için kendi kalibrasyonunuzu yapmanız en iyisidir (her kamera türü için deneysel değerler koda referans olarak dahil edilmiştir). Bunu yapmak için, | teta | bakış açısının tek bilinmeyen olduğu bir denklem oluşturun. Bunu yapmak için, bilinen bir mesafede boyutu bilinen bir hedefi kullanın ve görüş açısını tek bilinmeyen olarak bırakın. Denklemimizi önceki makaleden alalım: math: `d = T _ {\ mathrm {ft}} \ cdot \ frac {\ textit {FOV} _ {\ mathrm {pixel}}} {T _ {\ mathrm {pixel} } \ tan \ theta} `ve | theta | için çözmek için yeniden düzenleyin:
zh_cn: 虽然可以在数据表中找到每个相机模型的理论视角，但经验测试发现，即使是水平视角，这些数字也可能有点偏离。鉴于今年的代码使用的是垂直视场，最好还是对自己的相机进行校准(尽管代码中包含了每种相机类型的经验值作为参考)。建立一个方程式，其中视角θ是唯一未知的。 利用已知的目标大小和已知的距离，令视角成为唯一未知数。我们可以使用上一篇文章中得到的等式 :math:`d = T_{\mathrm{ft}} \cdot \frac{\textit{FOV}_{\mathrm{pixel}}}{T_{\mathrm{pixel}}\tan\theta}`, 并进一步求解得到θ:

source: Taking Measurements
es_mx: Tomando medidas
fr_ca: Prise de mesures
tr_tr: Ölçüm Alma
zh_cn: 完成测量

source: Measuring the height of the selected portion.
fr_ca: Mesure de la hauteur de la partie sélectionnée.

source: One way to take the required measurements is to use the same images of the retro-reflective tape that were used for the color calibration above. We can use Vision Assistant to provide the height of the detected blob in pixels. By measuring the real-world distance between the camera and the target, we now have all of the variables to solve our equation for the view angle.
es_mx: Una manera de tomar las medidas necesarias es usar las mismas imágenes de cinta retroreflectiva usadas para la calibración de color anterior. Podemos usar Vision Assistant para proveer la altura detectada en pixeles y medir la distancia en la vida real entre la cámara y el objetivo, ahora tenemos todas las variables para resolver nuestra ecuación para conocer el ángulo.
fr_ca: Une façon de prendre les mesures requises consiste à utiliser les mêmes images du ruban rétroréfléchissant qui ont été utilisées pour l'étalonnage ci-dessus des couleurs. Nous pouvons utiliser Vision Assistant pour fournir la hauteur en pixels de la nuée (Blob) détectée. En mesurant la distance réelle entre la caméra et la cible, nous avons maintenant toutes les variables pour résoudre notre équation pour l'angle de vue.
tr_tr: Gerekli ölçümleri almanın bir yolu, yukarıdaki renk kalibrasyonu için kullanılan geri yansıtıcı bantın aynı görüntülerini kullanmaktır. Algılanan blobun yüksekliğini piksel cinsinden sağlamak için Vision Assistant'ı kullanabiliriz. Kamera ile hedef arasındaki gerçek dünyadaki mesafeyi ölçerek, artık görüş açısı denklemimizi çözmek için tüm değişkenlere sahibiz.
zh_cn: 进行所需测量的一种方法是使用前述用于颜色校准相同的反光图像。我们可以使用视觉助手来提供被检测斑点的像素高度。测量了相机和目标之间的真实距离后，我们就有了所有的变量，可以进一步求解视角方程。

source: To measure the particles in the image, click the Binary tab, then click the Particle Analysis icon.
es_mx: Para medir las partículas de una imagen haga click en la pestaña Binary y haga click en el icono de Particle Analysis.
fr_ca: Pour mesurer les particules dans l'image, cliquez sur l'onglet "Binary", puis sur l'icône "Particle Analysis".
tr_tr: Görüntüdeki parçacıkları ölçmek için İkili sekmesine ve ardından Parçacık Analizi simgesine tıklayın.
zh_cn: 要测量图像中的粒子，先单击二进制选项卡，再单击粒子分析图标。

source: Selecting Measurements
es_mx: Seleccionando medidas
fr_ca: Sélection des mesures
tr_tr: Ölçümleri Seçme
zh_cn: 选择性测量

source: Select "Bounding Rectangle Height".
fr_ca: Sélectionnez "Bounding Rectangle Height".

source: Click on the Select Measurements button. In this case, we are only interested in the bounding box height. Click on the button with the X to deselect all measurements, then locate the Bounding Rect Height measurement and check the box. Click OK to save.
es_mx: Haga click en el botón de Select Measurements. En éste caso solo estamos interesados en un cuadro delimitador de altura. Click en el botón con la X para quitar la selección de todas las medidas/all measurements, después localice la medida Bounding Rect Height y seleccione la casilla. Click en OK para guardar.
fr_ca: Cliquez sur le bouton "Select Measurements". Dans ce cas, nous nous intéressons uniquement à la hauteur du cadre de sélection. Cliquez sur le bouton X pour désélectionner toutes les mesures, puis cochez la case "Bounding Rect Height". Cliquez sur OK pour enregistrer.
tr_tr: Ölçümleri Seç düğmesine tıklayın. Bu durumda, biz sadece sınırlayıcı kutu yüksekliği ile ilgileniyoruz. Tüm ölçümlerin seçimini kaldırmak için X işaretli düğmeye tıklayın, ardından Sınırlayıcı Dik Yükseklik ölçümünü bulun ve kutuyu işaretleyin. Kaydetmek için Tamam'ı tıklayın.
zh_cn: 点击选择测量按钮。在示例中，我们只对边界框的高度感兴趣。单击带有X的按钮取消选择所有测量值，然后定位包围矩形高度测量值并选中复选框。单击OK保存。

source: Measuring the Particle
es_mx: Midiendo la Partícula
fr_ca: Mesurer la particule
tr_tr: Parçacığı Ölçmek
zh_cn: 颗粒测量

source: Boxes at the bottom display the height for each of the detected particles.
fr_ca: Les cases en bas affichent la hauteur de chacune des particules détectées.
