Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/axis-camera/camera-settings.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Exposure
es_mx: Exposición
fr_ca: Exposition
tr_tr: Pozlama
zh_cn: 曝光

source: The Image Appearance section has a bunch of settings that can be tuned as described below.
fr_ca: La section Image Appearance ou Apparence de l’image comporte de nombreux de paramètres qui peuvent être réglés comme décrit ci-dessous.

source: The brightness or exposure of the image also has an impact on the colors being reported. The issue is that as overall brightness increases, color saturation will start to drop. Lets look at an example to see how this occurs. A saturated red object placed in front of the camera will return an RGB measurement high in red and low in the other two e.g. (220, 20, 30). As overall white lighting increases, the RGB value increases to (240, 40, 50), then (255, 80, 90), then (255, 120, 130), and then (255, 160, 170). Once the red component is maximized, additional light can only increase the blue and green, and acts to dilute the measured color and lower the saturation. If the point is to identify the red object, it is useful to adjust the exposure to avoid diluting your principal color. The desired image will look somewhat dark except for the colored shine.
es_mx: El brillo o la exposición de la imagen también influye en los colores que se informan. El problema es que a medida que aumenta el brillo general, la saturación del color comenzará a disminuir. Veamos un ejemplo para ver cómo ocurre esto. Un objeto rojo saturado colocado frente a la cámara devolverá una medición RGB alta en rojo y baja en los otros dos, p. (220, 20, 30). A medida que aumenta la iluminación blanca general, el valor RGB aumenta a (240, 40, 50), luego (255, 80, 90), luego (255, 120, 130) y luego (255, 160, 170). Una vez que se maximiza el componente rojo, la luz adicional solo puede aumentar el azul y el verde, y actúa para diluir el color medido y reducir la saturación. Si el objetivo es identificar el objeto rojo, es útil ajustar la exposición para evitar diluir su color principal. La imagen deseada se verá algo oscura excepto por el brillo de color.
fr_ca: La luminosité ou l'exposition de l'image a également un impact sur les couleurs signalées. Le problème est que lorsque la luminosité globale augmente, la saturation des couleurs commence à baisser. Regardons un exemple pour voir comment cela se produit. Un objet rouge saturé placé devant la caméra renverra une mesure RVB haute en rouge et basse dans les deux autres, par ex. (220, 20, 30). À mesure que l'éclairage blanc augmente, la valeur RVB augmente à (240, 40, 50), puis (255, 80, 90), puis (255, 120, 130), puis (255, 160, 170). Une fois que la composante rouge est maximisée, une lumière supplémentaire ne peut qu'augmenter le bleu et le vert, et agit pour diluer la couleur mesurée et réduire la saturation. Si le but est d'identifier l'objet rouge, il est utile d'ajuster l'exposition pour éviter de diluer votre couleur principale. L'image souhaitée paraîtra un peu sombre à l'exception de l'éclat coloré.
tr_tr: Görüntünün parlaklığı veya pozlaması da rapor edilen renkler üzerinde etkiye sahiptir. Sorun, genel parlaklık arttıkça renk doygunluğunun düşmeye başlayacak olmasıdır. Bunun nasıl gerçekleştiğini görmek için bir örneğe bakalım. Kameranın önüne yerleştirilen doymuş kırmızı bir nesne, diğer ikisinde kırmızı olarak yüksek ve düşük bir RGB ölçümü döndürecektir. (220, 20, 30). Genel beyaz aydınlatma arttıkça, RGB değeri (240, 40, 50), ardından (255, 80, 90), ardından (255, 120, 130) ve ardından (255, 160, 170) olarak artar. Kırmızı bileşen maksimize edildiğinde, ilave ışık yalnızca mavi ve yeşili artırabilir ve ölçülen rengi seyrelterek doygunluğu düşürür. Önemli olan kırmızı nesneyi tanımlamaksa, ana renginizin seyrelmesini önlemek için pozu ayarlamanız yararlıdır. İstenilen görüntü, renkli parlaklık dışında biraz karanlık görünecektir.
zh_cn: 图像的亮度或曝光也会影响图像的颜色。问题在于，随着整体亮度的增加，色彩饱和度将开始下降。让我们看看这是怎么发生的。将一个红色物体放置在相机的前面，那么它将返回，红色高，其他两个颜色低的RGB测量值，比如（220，20，30）。随着整体亮度的增加，RGB值依次增加到（240、40、50），（255、80、90），（255、120、130）和（255、160、170）。一旦红色的数值最大化，额外的光只能增加到蓝色和绿色的数值上，并起到稀释测得的颜色并降低饱和度的作用。如果要识别红色物体，则调整曝光以避免稀释原色非常有用。所需的图像看起来会有些暗，除了有色的反射。

source: There are two approaches to control camera exposure times. One is to allow the camera to compute the exposure settings automatically, based on its sensors, and then adjust the camera’s brightness setting to a small number to lower the exposure time. The brightness setting acts similar to the exposure compensation setting on SLR cameras. The other approach is to calibrate the camera to use a custom exposure setting. To do this on a 206 or M1011, change the exposure setting to auto, expose the camera to bright lights so that it computes a short exposure, and then change the exposure setting to hold. Both approaches will result in an overall dark image with bright saturated target colors that stand out from the background and are easier to mask.
es_mx: Hay dos enfoques para controlar los tiempos de exposición de la cámara. Una es permitir que la cámara calcule la configuración de exposición automáticamente, en función de sus sensores, y luego ajustar la configuración de brillo de la cámara a un número pequeño para reducir el tiempo de exposición. La configuración de brillo actúa de manera similar a la configuración de compensación de exposición en las cámaras SLR. El otro enfoque es calibrar la cámara para usar una configuración de exposición personalizada. Para hacer esto en un 206 o M1011, cambie el ajuste de exposición a automático, exponga la cámara a luces brillantes para que calcule una exposición corta y luego cambie el ajuste de exposición para mantener. Ambos enfoques darán como resultado una imagen oscura general con colores de destino brillantes saturados que se destacan del fondo y son más fáciles de enmascarar.
fr_ca: Il existe deux approches pour contrôler les temps d'exposition de la caméra. L'une consiste à laisser la caméra calculer automatiquement les paramètres d'exposition, en fonction de ses capteurs, puis d'ajuster le paramètre de luminosité de la caméra à un petit nombre pour réduire le temps d'exposition. Le paramètre de luminosité agit de manière similaire à celui de la compensation d'exposition sur les appareils photo reflex. L'autre approche consiste à calibrer la caméra pour utiliser un paramètre d'exposition personnalisé. Pour ce faire, sur une 206 ou une M1011, définissez le paramètre d'exposition sur auto, présenter la caméra à des lumières vives afin qu'il calcule une exposition courte, puis le mettre en mémoire dans la caméra. Les deux approches se traduiront par une image sombre globale avec des couleurs cibles saturées lumineuses qui ressortent de l'arrière-plan et sont plus faciles à masquer.
tr_tr: Kamera pozlama sürelerini kontrol etmek için iki yaklaşım vardır. Birincisi, kameranın, sensörlerine göre poz ayarlarını otomatik olarak hesaplamasına izin vermek ve ardından pozlama süresini azaltmak için kameranın parlaklık ayarını küçük bir sayıya ayarlamaktır. Parlaklık ayarı, SLR fotoğraf makinelerinde poz telafisi ayarına benzer şekilde çalışır. Diğer yaklaşım, özel bir poz ayarı kullanmak için kamerayı kalibre etmektir. Bunu bir 206 veya M1011'de yapmak için, poz ayarını otomatik olarak değiştirin, kamerayı kısa bir poz hesaplaması için parlak ışıklara maruz bırakın ve ardından poz ayarını tutmak için değiştirin. Her iki yaklaşım da arka planda öne çıkan ve maskelemesi daha kolay olan parlak doymuş hedef renklere sahip genel olarak koyu bir görüntü ile sonuçlanacaktır.
zh_cn: 有两种方法可以控制相机的曝光时间。一种是让相机根据其传感器自动计算曝光设置，然后将相机的亮度设置调整为较小的数值以减少曝光时间。亮度设置与SLR相机上的曝光补偿设置相似。另一种方法是校准相机以使用自定义曝光设置。如果要在206或M1011上执行此操作，请将曝光设置更改为自动，让强光照射相机以使其计算出一个短的曝光时间，然后将曝光设置更改为保持。两种方法都将导致整体较暗的图像颜色和明亮的饱和目标颜色，这些目标颜色会在背景中显得十分突出，并且更容易掩盖。

source: The M1013 exposure settings look a little different. The Enable Backlight compensation option is similar to the Auto exposure settings of the M1011 and 206 and you will usually want to un-check this box. Adjust the Brightness and Exposure value sliders until your image looks as desired. The Exposure Priority should generally be set to Motion. This will prioritize framerate over image quality. Note that even with these settings the M1013 camera still performs some auto exposure compensation so it is recommended to check calibration frequently to minimize any impact lighting changes may have on image processing. See :doc:`calibration` for more details.
es_mx: Los ajustes de exposición de M1013 se ven un poco diferentes. La opción Habilitar compensación de luz de fondo es similar a la configuración de exposición automática de los modelos M1011 y 206 y, por lo general, querrá desmarcar esta casilla. Ajuste los controles deslizantes del valor de Brillo y Exposición hasta que su imagen se vea como lo desea. La prioridad de exposición generalmente debe establecerse en Movimiento. Esto dará prioridad a la velocidad de fotogramas sobre la calidad de la imagen. Tenga en cuenta que incluso con estos ajustes, la cámara M1013 aún realiza cierta compensación de exposición automática, por lo que se recomienda verificar la calibración con frecuencia para minimizar cualquier impacto que los cambios de iluminación puedan tener en el procesamiento de la imagen. Consulte :doc:`calibration` para obtener más detalles.
fr_ca: Les paramètres d'exposition du M1013 sont un peu différents. L'option de compensation "Enable Backlight" est similaire aux paramètres d'exposition automatique des M1011 et 206 et vous voudrez généralement décocher cette case. Ajustez les curseurs de luminosité et d'exposition jusqu'à ce que votre image soit comme vous le souhaitez. La priorité d'exposition doit généralement être réglé sur "Motion". Cela donnera la priorité à la fréquence d'images au lieu de la qualité de l'image. Notez que même avec ces paramètres, la caméra M1013 effectue toujours une compensation d'exposition automatique, il est donc recommandé de vérifier fréquemment l'étalonnage pour minimiser tout impact de l'éclairage sur le traitement de l'image. Voir :doc:`calibration` pour plus de détails.
tr_tr: M1013 pozlama ayarları biraz farklı görünüyor. Arka ışık telafisini etkinleştir seçeneği, M1011 ve 206'nın Otomatik poz ayarlarına benzer ve genellikle bu kutunun işaretini kaldırmak isteyeceksiniz. Görüntünüz istediğiniz gibi görünene kadar Parlaklık ve Pozlama değeri kaydırıcılarını ayarlayın. Poz Önceliği genel olarak Hareket olarak ayarlanmalıdır. Bu, kare hızını görüntü kalitesine göre önceliklendirir. Bu ayarlarla bile, M1013 kameranın yine de bazı otomatik pozlama telafisi gerçekleştirdiğini unutmayın; bu nedenle, ışık değişikliklerinin görüntü işleme üzerindeki etkisini en aza indirmek için kalibrasyonu sık sık kontrol etmeniz önerilir. Daha fazla ayrıntı için bakınız :doc:`calibration`.
zh_cn: M1013的曝光设置看起来有些不同。启用背光补偿选项类似于M1011和206的自动曝光设置，您通常需要取消选中此框。调整“亮度”和“曝光”值滑块，直到图像达到你所需要的效果。通常应将“曝光优先级”设置为“运动”。该设置将使帧频优先于图像质量。请注意，即使使用这些设置，M1013相机仍会执行一些自动曝光补偿，因此建议您经常检查校准，以最大程度地减少任何亮度变化对图像处理的影响。有关更多详细信息，请见：Calibration。

source: The Axis M1011 has a fixed-focus lens and no adjustment is needed. The Axis 206 camera has a black bezel around the lens that rotates to move the lens in and out and adjust focus. The Axis M103 has a silver and black bezel assembly around the lens to adjust the focus. Ensure that the images you are processing are relatively sharp and focused for the distances needed on your robot.
es_mx: La Axis M1011 tiene un lente fixed-focus y no necesita ajuste. La cámara Axis 206 tiene un bisel negro alrededor del lente que rota para así mover el lente hacia afuera y adentro y ajusta el enfoque. La Axis M103 tiene un montaje de bisel plateado y negro alrededor del lente para ajustar el enfoque. Asegúrese de que las imágenes que está procesando son relativamente nítidas y enfocadas para las distancias que necesita su robot.
tr_tr: Axis M1011, sabit odaklı bir lense sahiptir ve ayar gerektirmez. Axis 206 kamera, lensi içeri ve dışarı hareket ettirmek ve odağı ayarlamak için dönen lensin etrafında siyah bir çerçeveye sahiptir. Axis M103, odağı ayarlamak için lensin etrafında gümüş ve siyah bir çerçeve düzeneğine sahiptir. İşlediğiniz görüntülerin nispeten keskin olduğundan ve robotunuz için gereken mesafelere odaklandığından emin olun.
zh_cn: Axis M1011具有定焦镜头，无需调整。 Axis 206相机在镜头周围有一个黑色边框，该边框能够通过旋转来将镜头移入和移出并调整焦距。 Axis M103相机在镜头周围有银色和黑色边框组件用于调整焦距。请确保要处理的图像相对清晰并且聚焦在机器人所需的距离上。

source: Compression
es_mx: Compresión
tr_tr: Sıkıştırma
zh_cn: 图像压缩

source: The Axis camera returns images in BMP, JPEG, or MJPEG format. BMP images are quite large and take more time to transmit to the cRIO and laptop. Therefore the WPILib implementations typically use MJPEG (motion JPEG). The compression setting ranges from 0 to 100, with 0 being very high quality images with very little compression, and 100 being very low quality images with very high compression. The camera default is 30, and it is a good compromise, with few artifacts that will degrade image processing.
es_mx: La cámara Axis devuelve imágenes en formato BMP, JPEG o MJPEG. Las imágenes BMP son bastante grandes y requieren más tiempo para transmitirse al cRIO y al portátil. Por lo tanto, las implementaciones de WPILib suelen utilizar MJPEG (Motion JPEG). El ajuste de compresión varía de 0 a 100, siendo 0 imágenes de muy alta calidad con muy poca compresión y 100 imágenes de muy baja calidad con muy alta compresión. El valor predeterminado de la cámara es 30, y es un buen compromiso, con pocos artefactos que degradarán el procesamiento de la imagen.
tr_tr: Axis kamerası görüntüleri BMP, JPEG veya MJPEG formatında döndürür. BMP görüntüleri oldukça büyüktür ve cRIO'ya ve dizüstü bilgisayara aktarılması daha fazla zaman alır. Bu nedenle, WPILib uygulamaları tipik olarak MJPEG (hareketli JPEG) kullanır. Sıkıştırma ayarı, 0 ile 100 arasında değişir; 0, çok az sıkıştırmalı çok yüksek kaliteli görüntüler ve 100, çok yüksek sıkıştırmalı çok düşük kaliteli görüntülerdir. Kamera varsayılanı 30'dur ve görüntü işlemeyi bozacak birkaç yapaylık ile iyi bir uzlaşmadır.
zh_cn: Axis相机会返回BMP，JPEG或MJPEG格式的图像。 BMP图像很大，需要花费更多时间才能传输到cRIO和笔记本电脑。因此，WPILib实现通常使用MJPEG（motion JPEG）。压缩设置的范围是0到100，其中0是压缩率非常低的高质量图像，而100是压缩率非常高的低质量图像。相机默认值为30，这是一个很好的折衷方案，几乎不会产生降低图像处理能力的伪影。
