Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/axis-camera/camera-settings.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Camera Settings
es_mx: Ajustes de la cámara
fr_ca: Paramètres de la caméra
tr_tr: Kamera ayarları
zh_cn: 相机设置

source: It is very difficult to achieve good image processing results without good images. With a light mounted near the camera lens, you should be able to use the provided examples, the LabVIEW Dashboard or Shuffleboard, NI Vision Assistant or a web browser to view camera images and experiment with camera settings.
es_mx: Es muy difícil lograr buenos resultados de procesamiento de imágenes sin buenas imágenes. Con una luz montada cerca de la lente de la cámara, debería poder usar los ejemplos proporcionados, LabVIEW Dashboard o Shuffleboard, NI Vision Assistant o un navegador web para ver imágenes de la cámara y experimentar con la configuración de la cámara.
fr_ca: Il est très difficile d'obtenir de bons résultats de traitement d'image sans de bonnes images. Avec une lumière montée près de l'objectif de la caméra, vous devriez pouvoir utiliser les exemples fournis, le tableau de bord ou Shuffleboard LabVIEW, NI Vision Assistant ou un navigateur Web pour afficher les images de la caméra et jouer avec les paramètres de la caméra.
tr_tr: İyi görüntüler olmadan iyi görüntü işleme sonuçları elde etmek çok zordur. Kamera merceğinin yanına monte edilen bir ışıkla, kamera görüntülerini görüntülemek ve kamera ayarlarını denemek için sağlanan örnekleri, LabVIEW Dashboard veya Shuffleboard, NI Vision Assistant veya bir web tarayıcısını kullanabilmelisiniz.
zh_cn: 很难在没有好的图像的情况下获得好的图像处理结果。在摄像机镜头附近装有照明灯的情况下，您应该能够使用提供的示例，LabVIEW DashBoard或Shuffleboard，NI Vision Assistant或浏览器来查看摄像机图像并尝试使用摄像机设置。

source: Changing Camera Settings
es_mx: Cambiar la configuración de la cámara
fr_ca: Modification des paramètres de la caméra
tr_tr: Kamera Ayarlarını Değiştirme
zh_cn: 更改相机设置

source: Camera Setting page of the AXIS web UI.
fr_ca: Page de configuration de la caméra de l’interface utilisateur Web AXIS.

source: To change the camera settings on any of the supported Axis cameras (206, M1011, M1013), browse to the camera's webpage by entering its address (usually 10.TE.AM.11) in a web browser. Click Setup near the top right corner of the page. On the M1013, the settings listed below are split between the Video Stream page and the Camera Settings page, both listed under the Video section.
es_mx: Para cambiar la configuración de la cámara en cualquiera de las cámaras Axis compatibles (206, M1011, M1013), navegue hasta la página web de la cámara ingresando su dirección (generalmente 10.TE.AM.11) en un navegador web. Haga clic en Setup cerca de la esquina superior derecha de la página. En el M1013, las configuraciones que se enumeran a continuación se dividen entre la página de Video Stream y la página Camera Settings, ambas enumeradas en Video section.
fr_ca: Pour modifier les paramètres sur l'une des caméras Axis supportées (206, M1011, M1013), accédez à la page Web de la caméra en entrant son adresse (généralement 10.TE.AM.11) dans un navigateur Web. Cliquez sur "Setup" dans le coin supérieur droit de la page. Sur le M1013, les paramètres répertoriés ci-dessous sont répartis entre la page "Video Stream" et la page "Camera Steeings" toutes deux répertoriées dans la section Vidéo.
tr_tr: Desteklenen herhangi bir Axis kamerasında (206, M1011, M1013) kamera ayarlarını değiştirmek için, bir web tarayıcısına adresini (genellikle 10.TE.AM.11) girerek kameranın web sayfasına gidin. Sayfanın sağ üst köşesinin yakınındaki Kurulum'u tıklayın. M1013'te, aşağıda listelenen ayarlar, her ikisi de Video bölümünde listelenen Video Akışı sayfası ile Kamera Ayarları sayfası arasında bölünmüştür.
zh_cn: 要在任何受支持的Axis摄像机（206，M1011，M1013）上更改摄像机设置，请在网络浏览器中输入摄像机的网页地址（通常为10.TE.AM.11）来浏览其网页。单击页面右上角附近的设置。在M1013上，下面列出的设置在“视频流”页面和“摄像机设置”页面之间划分，两者均列在“视频”部分下。

source: Focus
es_mx: Enfocar
fr_ca: Mise au foyer (focus)
tr_tr: Odaklanma
zh_cn: 对焦

source: The Axis M1011 has a fixed-focus lens and no adjustment is needed. The Axis 206 camera has a black bezel around the lens that rotates to move the lens in and out and adjust focus. The Axis M1013 has a silver and black bezel assembly around the lens to adjust the focus. Ensure that the images you are processing are relatively sharp and focused for the distances needed on your robot.
fr_ca: L’Axis M1011 dispose d’un objectif à mise au point fixe et aucun réglage n’est nécessaire. La caméra Axis 206 a une lunette noire autour de l’objectif qui tourne pour déplacer l’objectif à l’intérieur et à l’extérieur et ajuster la mise au point. L’Axis M1013 dispose d’un ensemble de lunettes argent et noir autour de l’objectif pour ajuster la mise au point. Assurez-vous que les images que vous traitez sont relativement nettes et focalisées pour les distances nécessaires à votre robot.

source: Three images with different compression settings of 0, 30, and 100.
fr_ca: Trois images avec des paramètres de compression différents de 0, 30 et 100.

source: The Axis camera returns images in BMP, JPEG, or MJPEG format. BMP images are quite large and take more time to transmit to the roboRIO and laptop. Therefore the WPILib implementations typically use MJPEG (motion JPEG). The compression setting ranges from 0 to 100, with 0 being very high quality images with very little compression, and 100 being very low quality images with very high compression. The camera default is 30, and it is a good compromise, with few artifacts that will degrade image processing.
fr_ca: La caméra Axis renvoie des images au format BMP, JPEG ou MJPEG. Les images BMP sont assez grandes et prennent plus de temps à transmettre au roboRIO et à l’ordinateur portable. Par conséquent, les implémentations WPILib utilisent généralement le format MJPEG (motion JPEG). Le réglage de compression varie de 0 à 100, 0 étant des images de très haute qualité avec très peu de compression, et 100 étant des images de très faible qualité avec une compression très élevée. La valeur par défaut de la caméra est de 30, et c’est un bon compromis, avec peu d’artefacts qui dégraderont le traitement de l’image.

source: Teams are advised to consider how the compression setting on the camera affects bandwidth if performing processing on the Driver Station computer, see the FMS Whitepaper for more details.
es_mx: Se recomienda a los equipos que consideren cómo la configurar la compresión de la cámara afecta el ancho de banda si realizan el procesamiento en la computadora de la Driver Station; consulte el documento técnico de FMS para obtener más detalles.
fr_ca: Il est conseillé aux équipes de considérer comment le paramètre de compression de la caméra affecte la bande passante si vous effectuez un traitement sur l'ordinateur Driver Station, consultez le document "FMS Whitepaper" pour plus de détails.
tr_tr: Ekiplerin, Driver Station bilgisayarında işlem gerçekleştirirken, kameradaki sıkıştırma ayarının bant genişliğini nasıl etkileyeceğini düşünmeleri önerilir, daha fazla ayrıntı için FMS Teknik Raporuna bakın.
zh_cn: 建议团队考虑在Driver Station计算机上执行处理时，相机上的压缩设置是如何影响带宽的。有关更多详细信息请参阅FMS白皮书。

source: Resolution
es_mx: Resolución
fr_ca: Résolution
tr_tr: Çözünürlük
zh_cn: 相机分辨率

source: Under image appearance there is a dropdown for setting the resolution.
fr_ca: Sous l'apparence de l’image, il y a une liste déroulante pour définir la résolution.

source: Image sizes shared by the supported cameras are 160x120, 320x240, and 640x480. The M1011 and 1013 have additional sizes, but they aren’t built into WPILib. The largest image size has four times as many pixels that are one-fourth the size of the middle size image. The large image has sixteen times as many pixels as the small image.
es_mx: Los tamaños de imagen que comparten las cámaras compatibles son 160x120, 320x240 y 640x480. El M1011 y el 1013 tienen tamaños adicionales, pero no están integrados en WPILib. El tamaño de imagen más grande tiene cuatro veces más píxeles que son un cuarto del tamaño de la imagen de tamaño medio. La imagen grande tiene dieciséis veces más píxeles que la imagen pequeña.
fr_ca: Les tailles d'image partagées par les caméras prises en charge sont 160x120, 320x240 et 640x480. Les M1011 et 1013 ont des tailles supplémentaires, mais elles ne sont pas intégrées à WPILib. La plus grande taille d'image a quatre fois plus de pixels, mais ceux-ci sont un quart de la taille de ceux de l'image de taille moyenne. La grande image a seize fois plus de pixels que la petite image.
tr_tr: Desteklenen kameralar tarafından paylaşılan görüntü boyutları 160x120, 320x240 ve 640x480'dir. M1011 ve 1013'ün ek boyutları vardır, ancak bunlar WPILib'e dahil edilmemiştir. En büyük görüntü boyutu, orta boyuttaki görüntünün dörtte biri kadar piksele sahiptir. Büyük görüntü, küçük görüntünün on altı katı piksele sahiptir.
zh_cn: 受支持的相机共享的图像大小为160x120、320x240和640x480。 M1011和1013具有其他尺寸，但并未内置于WPILib中。最大图像尺寸的像素有四倍之多，其大小是中尺寸图像的四分之一。大图像的像素数量是小图像的16倍。

source: The tape used on the target is 4 inches (~10 cm) wide, and for good processing, you will want that 4 inch (~10 cm) feature to be at least two pixels wide. Using the distance equations above, we can see that a medium size image should be fine up to the point where the field of view is around 640 inches (~16 m), a little over 53 feet (~16 m), which is nearly double the width of the FRC\ |reg| field. This occurs at around 60 feet (~18 m) away, longer than the length of the field. The small image size should be usable for processing to a distance of about 30 feet (~9 m) or a little over mid-field.
es_mx: La cinta utilizada en el objetivo tiene 4 pulgadas (~10 cm) de ancho y, para un buen procesamiento, querrá que la función de 4 pulgadas (~10 cm) tenga al menos dos píxeles de ancho. Usando las ecuaciones de distancia anteriores, podemos ver que una imagen de tamaño mediano debería estar bien hasta el punto en que el campo de visión sea de alrededor de 640 pulgadas (~16 m), un poco más de 53 pies (~16 m), que es casi el doble del ancho del campo FRC\ |reg| . Esto ocurre a unos 60 pies (~18 m) de distancia, más largo que la longitud del campo. El tamaño pequeño de la imagen debe poder utilizarse para el procesamiento a una distancia de aproximadamente 30 pies (~9 m) o un poco por encima del campo medio.
fr_ca: La bande utilisée sur la cible mesure 4 pouces (~ 10 cm) de large, et pour un bon traitement, vous voudrez que la fonction de 4 pouces (~ 10 cm) ait au moins deux pixels de large. En utilisant les équations de distance ci-dessus, nous pouvons voir qu'une image de taille moyenne devrait être fine jusqu'au point où le champ de vision est d'environ 640 pouces (~ 16 m), un peu plus de 53 pieds (~ 16 m), ce qui est presque le double de la largeur du terrain FRC. Cela se produit à environ 60 pieds (~ 18 m), plus long que la longueur du terrain. La petite taille de l'image doit être utilisable pour le traitement à une distance d'environ 30 pieds (~ 9 m) ou un peu au-dessus du milieu du terrain.
tr_tr: Hedefte kullanılan bant 4 inç (~ 10 cm) genişliğindedir ve iyi bir işleme için bu 4 inç (~ 10 cm) özelliğin en az iki piksel genişliğinde olmasını isteyeceksiniz. Yukarıdaki mesafe denklemlerini kullanarak, orta büyüklükteki bir görüntünün görüş alanının yaklaşık 640 inç (~ 16 m), 53 fitten (~ 16 m) biraz fazla olduğu noktaya kadar iyi olması gerektiğini görebiliriz ki bu neredeyse FRC \ | reg | 'in genişliğini iki katına çıkarın alan. Bu, alanın uzunluğundan daha uzun, yaklaşık 60 fit (~ 18 m) uzakta gerçekleşir. Küçük görüntü boyutu, yaklaşık 30 fit (~ 9 m) veya orta alanın biraz üzerinde bir mesafeye işlemek için kullanılabilir olmalıdır.
zh_cn: 目标上使用的胶带宽度为4英寸（〜10厘米），为了进行良好处理，您希望4英寸（〜10厘米）的宽度至少为两个像素。使用上面的距离方程，我们可以看到中等大小的图像应该可以精细到视场约为640英寸（〜16 m），略大于53英尺（〜16 m），这几乎是将FRC的宽度加倍领域。这发生在大约60英尺（〜18 m）的距离处，比田野的长度还要长。较小的图像尺寸应可用于处理约30英尺（〜9 m）的距离或略高于中场的距离。

source: Image size also impacts the time to decode and to process. Smaller images will be roughly four times faster than the next size up. If the robot or target is moving, it is quite important to minimize image processing time since this will add to the delay between the target location and perceived location. If both robot and target are stationary, processing time is typically less important.
es_mx: El tamaño de la imagen también influye en el tiempo de decodificación y procesamiento. Las imágenes más pequeñas serán aproximadamente cuatro veces más rápidas que las del siguiente tamaño. Si el robot o el objetivo se está moviendo, es muy importante minimizar el tiempo de procesamiento de la imagen, ya que esto aumentará el retraso entre la ubicación del objetivo y la ubicación percibida. Si tanto el robot como el objetivo están estacionarios, el tiempo de procesamiento suele ser menos importante.
fr_ca: La taille de l'image influe également sur le temps de décodage et de traitement. Les images plus petites seront traitées environ quatre fois plus rapidement que la taille suivante. Si le robot ou la cible se déplace, il est très important de minimiser le temps de traitement de l'image car cela augmentera le délai entre l'emplacement cible et l'emplacement perçu. Si le robot et la cible sont immobiles, le temps de traitement est généralement moins important.
tr_tr: Görüntü boyutu, kod çözme ve işleme süresini de etkiler. Daha küçük resimler, bir sonraki boyuttan yaklaşık dört kat daha hızlı olacaktır. Robot veya hedef hareket ediyorsa, görüntü işleme süresini en aza indirmek oldukça önemlidir çünkü bu, hedef konum ile algılanan konum arasındaki gecikmeye katkıda bulunacaktır. Hem robot hem de hedef sabitse, işlem süresi genellikle daha az önemlidir.
zh_cn: 图像大小也会影响解码和处理时间。较小的图像将比大一个尺寸的图像快大约四倍。如果机器人或目标正在移动，则最小化图像处理时间非常重要，因为这会增加目标实际位置和机器人感知位置之间的延迟。如果机器人和目标都静止不动，则处理时间通常不那么重要。

source: When requesting images using LabVIEW (either the Dashboard or Robot Code), the resolution and Frame Rate settings of the camera will be ignored. The LabVIEW code specifies the framerate and resolution as part of the stream request (this does not change the settings stored in the camera, it overrides that setting for the specific stream). The SmartDashboard and robot code in C++ or Java will use the resolution and framerate stored in the camera.
es_mx: Al solicitar imágenes usando LabVIEW (ya sea el Dashboard o el Código de Robot), se ignorarán las configuraciones de resolución y cuadros por segundo de la cámara. El código de LabVIEW especifica la velocidad de fotogramas y la resolución como parte de la solicitud de flujo (esto no cambia la configuración almacenada en la cámara, anula esa configuración para el flujo específico). El SmartDashboard y el código del robot en C++ o Java utilizarán la resolución y la velocidad de fotogramas almacenada en la cámara.
fr_ca: Lorsque vous demandez des images à l'aide de LabVIEW (tableau de bord ou code robot), les paramètres de résolution et de fréquence d'images de la caméra seront ignorés. Le code LabVIEW spécifie le débit d'images et la résolution dans le cadre de sa demande de flux (cela ne modifie pas les paramètres stockés dans la caméra, il remplace ce paramètre pour le flux spécifique). Le SmartDashboard et le code du robot en C++ ou Java utiliseront la résolution et la fréquence d'images stockées dans la caméra.
tr_tr: LabVIEW (Gösterge Tablosu veya Robot Kodu) kullanarak görüntü talep ederken, kameranın çözünürlük ve Kare Hızı ayarları dikkate alınmayacaktır. LabVIEW kodu, kare hızını ve çözünürlüğü akış talebinin bir parçası olarak belirtir (bu, kamerada depolanan ayarları değiştirmez, belirli akış için bu ayarı geçersiz kılar). SmartDashboard ve C ++ veya Java'daki robot kodu, kamerada depolanan çözünürlüğü ve kare hızını kullanacaktır.
zh_cn: 当使用LabVIEW（仪表盘或机器人代码）请求图像时，摄像机的分辨率和帧频设置将被忽略。 LabVIEW代码在流请求中指定帧频和分辨率（这不会更改存储在相机中的设置，而是会覆盖特定流的设置）。 C ++或Java中的SmartDashboard和机器人代码将使用存储在相机中的分辨率和帧频。

source: Frame Rate
es_mx: Cuadros por segundo
fr_ca: Fréquence d'images (Framerate)
tr_tr: Kare hızı
zh_cn: 帧频

source: The Video Stream section allows the user to set a maximum frame rate.
fr_ca: La section Video Stream (Flux vidéo) permet à l’utilisateur de définir une fréquence d’images maximale.

source: The Axis Cameras have a max framerate of 30 frames per second. If desired, a limit can be set lower to reduce bandwidth consumption.
es_mx: Las cámaras Axis tienen una velocidad de fotogramas máxima de 30 fotogramas por segundo. Si lo desea, se puede establecer un límite más bajo para reducir el consumo de ancho de banda.
fr_ca: Les caméras Axis ont une fréquence d'images maximale de 30 images par seconde. Si vous le souhaitez, une limite peut être définie plus basse pour réduire la consommation de bande passante.
tr_tr: Axis Kameraların saniyede maksimum 30 kare hızı vardır. İstenirse, bant genişliği tüketimini azaltmak için daha düşük bir sınır ayarlanabilir.
zh_cn: Axis摄像机的最大帧频为每秒30帧。如果需要，可以设置较低的帧频上限以减少带宽消耗。

source: Color Enable
es_mx: Activar color
fr_ca: Choisir ou non la couleur
tr_tr: Renk Etkinleştir
zh_cn: 颜色启用

source: The Axis cameras typically return color images, but are capable of disabling color and returning a monochrome or grayscale image. The resulting image is a bit smaller in file size, and considerably quicker to decode. If processing is carried out only on the brightness or luminance of the image, and the color of the ring light is not used, this may be a useful technique for increasing the frame rate or lowering the CPU usage.
es_mx: Las cámaras Axis suelen devolver imágenes en color, pero son capaces de desactivar el color y devolver una imagen monocromática o en escala de grises. La imagen resultante es un poco más pequeña en tamaño de archivo y considerablemente más rápida de decodificar. Si el procesamiento se lleva a cabo solo en el brillo o la luminancia de la imagen, y no se usa el color del anillo de luz, esta puede ser una técnica útil para aumentar la velocidad de fotogramas o reducir el uso de la CPU.
fr_ca: Les caméras Axis renvoient généralement des images en couleur, mais sont capables de désactiver la couleur et de renvoyer une image monochrome ou en niveaux de gris. L'image résultante est un peu plus petite en taille de fichier, et considérablement plus rapide à décoder. Si le traitement est effectué uniquement sur la luminosité ou la luminance de l'image et que la couleur de l'anneau d'éclairage n'est pas utilisée, cela peut être une technique utile pour augmenter la fréquence d'images ou réduire l'utilisation du processeur.
tr_tr: Axis kameraları tipik olarak renkli görüntüler döndürür, ancak rengi devre dışı bırakabilir ve tek renkli veya gri tonlamalı bir görüntü döndürebilir. Ortaya çıkan görüntü, dosya boyutunda biraz daha küçüktür ve çözülmesi önemli ölçüde daha hızlıdır. İşleme yalnızca görüntünün parlaklığı veya parlaklığı üzerinde gerçekleştirilirse ve halka ışığının rengi kullanılmazsa, bu, kare hızını artırmak veya CPU kullanımını düşürmek için yararlı bir teknik olabilir.
zh_cn: Axis摄像机通常返回彩色图像，但也能够禁用颜色并返回单色或灰度图像。这样生成的图像的文件大小要小一些，并且解码速度要快得多。如果仅对图像的亮度进行处理，并且不使用环形灯的颜色，则这可能是一个能够用来增加帧频或降低CPU使用率的技术。

source: White Balance
es_mx: Balance de blancos
fr_ca: Équilibrage des blancs (White Balance)
tr_tr: Beyaz dengesi
zh_cn: 白平衡

source: White balance controls how the camera blends the component colors.
fr_ca: L'équilibrage des blancs contrôle la façon dont la caméra fusionne les couleurs des composants.

source: If the color of the light shine is being used to identify the marker, be sure to control the camera settings that affect the image coloring. The most important setting is white balance. It controls how the camera blends the component colors of the sensor in order to produce an image that matches the color processing of the human brain. The camera has five or six named presets, an auto setting that constantly adapts to the environment, and a hold setting -- for custom calibration.
es_mx: Si se usa el color del brillo de la luz para identificar el marcador, asegúrese de controlar la configuración de la cámara que afecta el color de la imagen. El ajuste más importante es el balance de blancos. Controla cómo la cámara combina los colores de los componentes del sensor para producir una imagen que coincida con el procesamiento de color del cerebro humano. La cámara tiene cinco o seis preajustes con nombre, una configuración automática que se adapta constantemente al entorno y una configuración de retención para una calibración personalizada.
fr_ca: Si la couleur de la lumière est utilisée pour identifier le marqueur, assurez-vous de contrôler les paramètres de la caméra qui affectent la coloration de l'image. Le réglage le plus important est l'équilibre du blanc. Il contrôle la façon dont la caméra mélange les couleurs des composants du capteur afin de produire une image qui correspond au traitement des couleurs du cerveau humain. La caméra possède cinq ou six préréglages, également un réglage automatique qui s'adapte constamment à l'environnement et finalement un réglage de maintien - pour un étalonnage personnalisé.
tr_tr: İşaretçiyi tanımlamak için ışık parlamasının rengi kullanılıyorsa, görüntü rengini etkileyen kamera ayarlarını kontrol ettiğinizden emin olun. En önemli ayar beyaz dengesi. İnsan beyninin renk işlemesine uyan bir görüntü oluşturmak için kameranın sensörün bileşen renklerini nasıl karıştırdığını kontrol eder. Kameranın beş veya altı adlandırılmış ön ayarı, ortama sürekli uyum sağlayan bir otomatik ayarı ve özel kalibrasyon için bir tutma ayarı vardır.
zh_cn: 如果使用发光的颜色来识别标记，请确保控制那些会影响图像色彩的相机设置。这其中最重要的设置是白平衡。它控制相机混合传感器的成分颜色，以产生一个与人脑的色彩处理相匹配的图像。该相机具有五个或六个命名预设，一个不断适应环境的自动设置以及一个用于自定义校准的保持设置。

source: The easiest approach is to use a named preset, one that maintains the saturation of the target and doesn’t introduce problems by tinting neutral objects with the color of the light source.
es_mx: El enfoque más sencillo es utilizar un ajuste preestablecido con nombre, uno que mantenga la saturación del objetivo y no presente problemas al teñir objetos neutrales con el color de la fuente de luz.
fr_ca: L'approche la plus simple consiste à utiliser un préréglage défini, qui préserve la saturation de la cible et n'introduit pas de problèmes en teintant les objets neutres avec la couleur de la source lumineuse.
tr_tr: En kolay yaklaşım, hedefin doygunluğunu koruyan ve nötr nesneleri ışık kaynağının rengiyle renklendirerek sorun çıkarmayan adlandırılmış bir ön ayar kullanmaktır.
zh_cn: 最简单的方法是使用一个进行了命名的预设，该预设可以保持目标的饱和度，并且不会通过用光源的颜色给中性对象着色而引起问题。

source: To custom-calibrate the white balance, place a known neutral object in front of the camera. A sheet of white paper is a reasonable object to start with. Set the white balance setting to auto, wait for the camera to update its filters (ten seconds or so), and switch the white balance to hold.
es_mx: Para calibrar de forma personalizada el balance de blancos, coloque un objeto neutro conocido frente a la cámara. Una hoja de papel blanco es un objeto razonable para empezar. Establezca el ajuste del balance de blancos en automático, espere a que la cámara actualice sus filtros (aproximadamente diez segundos) y cambie el balance de blancos a mantener.
fr_ca: Pour calibrer l'équilibre du blanc, placez un objet de couleur neutre devant la caméra. Une feuille de papier blanc est un objet raisonnable pour commencer. Réglez le paramètre d'équilibre du blanc sur auto, attendez que la caméra ajuste ses filtres (une dizaine de secondes) et réglez l'équilibre du blanc sur hold.
tr_tr: Beyaz dengesini özel olarak kalibre etmek için kameranın önüne bilinen nötr bir nesne yerleştirin. Bir beyaz kağıt, başlamak için makul bir nesnedir. Beyaz dengesi ayarını otomatik olarak ayarlayın, kameranın filtrelerini güncellemesini bekleyin (yaklaşık on saniye) ve beyaz dengesini tutmak için değiştirin.
zh_cn: 要自定义校准白平衡，请将一个已知的中性物体放在相机前面。比如我们可以从一张白纸开始。将白平衡设置设为自动，等待相机更新其滤镜（十秒钟左右），然后将白平衡切换为保持。
