Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/axis-camera/configuring-an-axis-camera.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: To configure the network settings of the camera, click the arrow to expand the System Options pane, then click the arrow to expand Network, then expand TCP/IP and select Basic. Set the camera to obtain an IP address via DHCP by selecting the bubble. Alternately, you may choose to set a static IP in the range 10.TE.AM.3 to 10.TE.AM.19. This is outside the range handed out by the radio (home use) or FMS system (event use) so you will avoid any IP conflicts.
es_mx: Para configurar los ajustes de red de la cámara, haga clic en la flecha para expandir el panel Opciones del sistema, luego haga clic en la flecha para expandir Red, luego expanda TCP / IP y seleccione Básico. Configure la cámara para obtener una dirección IP a través de DHCP seleccionando la burbuja. Alternativamente, puede optar por establecer una IP estática en el rango 10.TE.AM.3 a 10.TE.AM.19. Esto está fuera del rango entregado por la radio (uso doméstico) o el sistema FMS (uso de eventos) por lo que evitará conflictos de IP.
fr_ca: Pour configurer les paramètres réseau de la caméra, cliquez sur la flèche pour faire apparaître le volet "System Options", puis cliquez sur la flèche pour faire apparaître "Network", puis "TCP/IP" et sélectionnez "Basic". Réglez la caméra pour obtenir une adresse IP via DHCP en sélectionnant le bouton. Alternativement, vous pouvez choisir de définir une adresse IP statique dans la plage 10.TE.AM.3 à 10.TE.AM.19. Cette plage est en dehors de la plage utilisée pour usage domestique ou par le système FMS (lors des compétitions), ceci afin d'éviter tout conflit IP.
tr_tr: Kameranın ağ ayarlarını yapılandırmak için, Sistem Seçenekleri bölmesini genişletmek için oka tıklayın, ardından Network-Ağ'ı genişletmek için oka tıklayın, ardından TCP/IP'yi genişletin ve Basic-Temel'i seçin. Balonu seçerek kamerayı DHCP aracılığıyla bir IP adresi alacak şekilde ayarlayın. Alternatif olarak, ''10.TE.AM.3'' ile ''10.TE.AM.19'' aralığında bir statik IP ayarlamayı seçebilirsiniz. Bu, radyo (ev kullanımı) veya FMS sistemi (olay kullanımı) tarafından verilen aralığın dışındadır, böylece herhangi bir IP çakışmasını önleyeceksiniz.
zh_cn: 要配置摄像机的网络设置，请单击箭头以展开“系统选项”窗格，然后单击箭头以展开“网络”，然后展开TCP / IP并选择“基本”。选择气泡，将摄像机设置为通过DHCP获取IP地址。或者，您可以选择在10.TE.AM.3到10.TE.AM.19范围内设置静态IP。这超出了无线电设备（家庭使用）或FMS系统（事件使用）分配的范围，因此您可以避免任何IP冲突。

source: Manual - Configure Advanced Network Settings
es_mx: Manual - Configurar los ajustes de red avanzados
fr_ca: Manuel - Configurer les paramètres réseau avancés
tr_tr: Manuel - Gelişmiş Ağ Ayarlarını Yapılandırın
zh_cn: 手册-配置高级网络设置

source: Manual - Setup Page
zh_cn: 手册-设置页面
