Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/axis-camera/configuring-an-axis-camera.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Configuring an Axis Camera
es_mx: Configuración de una cámara Axis
fr_ca: Configuration d'une caméra Axis
tr_tr: Axis Kamerayı Yapılandırma
zh_cn: 配置Axis摄像机

source: Three different Axis camera models are supported by the FRC\ |reg| software, the Axis 206, Axis M1011 and Axis M1013. This document provides instructions on how to configure one of these cameras for FRC use. To follow the instructions in this document, you must have installed the NI FRC Game Tools and Configured your radio
es_mx: Tres diferentes modelos de Axis camera son soportados por el software de FRC\ |reg|, la Axis 206. Axis M1011 y Axis M1013. Este documento provisiona instrucciones del cómo configurar una de estas cámaras para el uso de FRC. Para seguir estas instrucciones, debe tener instalado el NI FRC Game Tools y Configurado su radio.
fr_ca: Trois modèles de caméras Axis différents sont pris en charge par le FRC \ | reg | logiciel, les Axis 206, Axis M1011 et Axis M1013. Ce document fournit des instructions sur la façon de configurer l'une de ces caméras pour une utilisation FRC. Pour suivre les instructions de ce document, vous devez avoir installé les outils de jeu NI FRC et configuré votre radio.
tr_tr: Üç farklı Axis kamera modeli FRC \ |reg| yazılım, Axis 206, Axis M1011 ve Axis M1013. Bu belge, bu kameralardan birinin FRC kullanımı için nasıl yapılandırılacağına ilişkin talimatlar sağlar. Bu belgedeki talimatları takip etmek için, NI FRC Oyun Araçlarını kurmuş ve telsizinizi yapılandırmış olmanız gerekir.
zh_cn: FRC \ | reg |支持三种不同的Axis摄像机型号。Axis206，AxisM1011和AxisM1013。本文档提供有关如何配置这些摄像机之一供FRC使用的说明。要遵循本文档中的说明，您必须已经安装了NI FRC Game Tools并完成无线传输的配置。

source: Connect the camera
es_mx: Conectar la cámara
fr_ca: Connectez la caméra
tr_tr: Kamerayı bağlayın
zh_cn: 连接摄像机

source: Connect the Axis camera to the radio using an Ethernet cable. Connect your computer to the radio using an Ethernet cable or via a wireless connection.
es_mx: Conecte la cámara Axis a la radio mediante un cable Ethernet. Conecte su computadora a la radio con un cable Ethernet o mediante conexión inalámbrica.
fr_ca: Connectez la caméra Axis à la radio à l'aide d'un câble Ethernet. Connectez votre ordinateur à la radio à l'aide d'un câble Ethernet ou via une connexion sans fil.
tr_tr: Axis kamerayı bir Ethernet kablosu kullanarak radyoya bağlayın. Bilgisayarınızı bir Ethernet kablosu veya kablosuz bağlantı kullanarak radyoya bağlayın.
zh_cn: 使用以太网电缆将Axis摄像机连接至无线电设备。使用以太网电缆或通过无线连接将计算机连接到无线电设备。

source: Axis Camera Setup Tool
es_mx: Herramienta de configuración de la cámara Axis
fr_ca: Outil de configuration de caméra Axis
tr_tr: Axis Kamera Kurulum Aracı
zh_cn: Axis摄像机设置工具

source: Highlights the "AxisCameraSetup.exe" in Windows Explorer.
fr_ca: Met en surbrillance l'exécutable "AxisCameraSetup.exe" dans l’Explorateur Windows.

source: Browse to ``C:\Program Files (x86)\National Instruments\LabVIEW 2019\project\Axis Camera Tool`` and double-click on ``AxisCameraSetup.exe`` to start the Axis Camera Setup Tool.
es_mx: Busque ``C:\Program Files (x86)\National Instruments\LabVIEW 2019\project\Axis Camera Tool`` y haga doble clic en ``AxisCameraSetup.exe`` para iniciar la herramienta de configuración de la cámara Axis.
fr_ca: Accédez à ``C:\Program Files (x86)\National Instruments\LabVIEW 2019\project\Axis Camera Tool`` et double-cliquez sur ``AxisCameraSetup.exe`` pour démarrer l'outil de configuration de la caméra Axis.
tr_tr: Axis Kamera Kurulum Aracını başlatmak için ``C: \ Program Files (x86) \ National Instruments \ LabVIEW 2019 \ project \ Axis Camera Tool``a göz atın ve ``AxisCameraSetup.exe`` üzerine çift tıklayın.
zh_cn: 浏览“:\Program Files (x86)\National Instruments\LabVIEW 2019\project\Axis Camera Tool“，然后双击“AxisCameraSetup.exe”以启动Axis摄像机设置工具。

source: Tool Overview
es_mx: Descripción general de la herramienta
fr_ca: Présentation de l'outil
tr_tr: Araca Genel Bakış
zh_cn: 工具概述

source: Searching for the camera to see if it can be automatically detected.
fr_ca: Recherche la caméra pour voir si elle peut être détectée automatiquement.

source: The camera should be automatically detected and the green indicator light should be lit. If it is not, make sure the camera is powered on (the ring on the camera face should be green) and connected to your computer. If the indicator remains off follow the instructions in the tool textbox next to Troubleshooting the camera to reset the camera. You can also use the "Camera not found?" button to check the IP address of your computer, one of the addresses listed should be of the form ``10.TE.AM.XX`` where ``TEAM`` is your 4 digit team number.
es_mx: La cámara debe detectarse automáticamente y la luz indicadora verde debe estar encendida. Si no es así, asegúrese de que la cámara esté encendida (el anillo al frente de la cámara debe ser verde) y conectada a su computadora. Si el indicador permanece apagado, siga las instrucciones en el cuadro de texto de la herramienta junto a Solución de problemas de la cámara para restablecer la cámara. También puede utilizar la opción "¿Cámara no encontrada?" para verificar la dirección IP de su computadora, una de las direcciones enumeradas debe tener el formato `` 10.TE.AM.XX`` donde ``TEAM`` es su número de equipo de 4 dígitos.
fr_ca: La caméra doit être détectée automatiquement et le voyant vert doit être allumé. Si ce n'est pas le cas, assurez-vous que la caméra est sous tension (l'anneau sur la face de la caméra doit être vert) et connecté à votre ordinateur. Si l'indicateur reste éteint, suivez les instructions dans la zone de texte de l'outil à côté de Troubleshooting the camera (dépannage) pour réinitialiser la caméra. Vous pouvez également utiliser le bouton "Camera not found?" pour vérifier l'adresse IP de votre ordinateur, l'une des adresses répertoriées doit être au format ``10.TE.AM.XX`` où ``TEAM`` est votre numéro d'équipe à 4 chiffres.
tr_tr: Kamera otomatik olarak algılanmalı ve yeşil gösterge ışığı yanmalıdır. Değilse, kameranın açık olduğundan (kamera yüzündeki halka yeşil olmalıdır) ve bilgisayarınıza bağlı olduğundan emin olun. Gösterge kapalı kalırsa, kamerayı sıfırlamak için kamerada sorun giderme öğesinin yanındaki araç metin kutusundaki talimatları izleyin. "Kamera bulunamadı mı?" Bilgisayarınızın IP adresini kontrol etmek için, listelenen adreslerden biri `` 10.TE.AM.XX`` şeklinde olmalıdır, burada `` TEAM `` 4 haneli takım numaranızdır.
zh_cn: 摄像机应被自动检测到，并且绿色指示灯应点亮。如果没有，请确保照相机电源已打开（照相机表面的环应为绿色）并已连接至计算机。如果指示灯仍然没有亮，请按照“对相机进行故障排除”旁边的工具文本框中的说明进行操作，以重置相机。您还可以使用“找不到相机？”按钮以检查计算机的IP地址，列出的地址之一应为“10.TE.AM.XX”格式，其“TEAM”是您的4位数字团队编号。

source: Setup the Camera
es_mx: Configurar la cámara
fr_ca: Configurer la caméra
tr_tr: Kamerayı kurmak
zh_cn: 设置摄像机

source: Click the apply button to setup the camera.
fr_ca: Cliquez sur le bouton "Apply" pour configurer l’appareil photo.

source: To configure the camera, press Apply. This will configure many of the necessary/recommended settings for using the camera for FRC. Currently the tool does not properly configure the DNS name of the camera in many cases.
es_mx: Para configurar la cámara, presione Aplicar. Esto configurará muchos de los ajustes necesarios / recomendados para usar la cámara en FRC. Actualmente, la herramienta no configura correctamente el nombre DNS de la cámara en muchos casos.
fr_ca: Pour configurer la caméra, appuyez sur "Apply". Cela configurera de nombreux paramètres nécessaires/recommandés pour l'utilisation de la caméra pour FRC. Actuellement, l'outil ne configure pas correctement le nom DNS de la caméra dans certains cas.
tr_tr: Kamerayı yapılandırmak için ''Uygula''ya basın. Bu, kamerayı FRC için kullanmak için gerekli / önerilen ayarların çoğunu yapılandıracaktır. Şu anda araç, birçok durumda kameranın DNS adını doğru şekilde yapılandırmamaktadır.
zh_cn: 要配置相机，请按“应用”。这将配置许多要将相机用于FRC所必要/推荐的设置。当前，在许多情况下，该工具无法正确配置摄像机的DNS名称。

source: Camera Webpage
es_mx: Página web de la cámara
fr_ca: Page Web de la caméra
tr_tr: Kamera Web Sayfası
zh_cn: 摄像机网页

source: The camera webpage login screen.
fr_ca: L’écran de connexion de la page Web de la camera.

source: To set the network settings, open a web browser and enter the address shown next to Camera found at in the tool (in the example above this is 10.0.40.20) in the address bar and press enter. You should see a Configure Root Password page, set this password to whatever you would like, but admin is recommended.
es_mx: Para establecer la configuración de red, abra un navegador web e ingrese la dirección que se muestra junto a Cámara encontrada en en la herramienta (en el ejemplo anterior es 10.0.40.20) en la barra de direcciones y presione Intro. Debería ver una página Configurar contraseña raíz, establezca esta contraseña como desee, pero se recomienda admin.
fr_ca: Pour définir les paramètres réseau, ouvrez un navigateur Web et entrez l'adresse indiquée à côté de Caméra trouvée dans l'outil (dans l'exemple ci-dessus c'est 10.0.40.20) dans la barre d'adresse et appuyez sur "Enter". Vous devriez voir une page "Configure Root Password", définissez ce mot de passe comme vous le souhaitez, mais le mot "admin" est recommandé.
tr_tr: Ağ ayarlarını yapmak için bir web tarayıcısı açın ve araçta bulunan Kamera'nın yanında gösterilen adresi (yukarıdaki örnekte bu 10.0.40.20'dir) adres çubuğuna girin ve ''enter'' tuşuna basın. ''Kök Parolayı Yapılandır'' sayfasını görmelisiniz, bu parolayı istediğiniz gibi ayarlamalısınız, ancak yönetici önerilir.
zh_cn: 要设置相机的网络设置，请打开浏览器，然后在地址栏中输入摄像机设置工具中的摄像机地址（在上例中为10.0.40.20），然后按Enter。您应该看到“配置根密码”页面，将此密码设置为所需的密码，但建议使用admin作为密码。

source: Setup Page
es_mx: Página de configuración
fr_ca: Page de configuration
tr_tr: Kurulum Sayfası
zh_cn: 设置页面

source: An example image from the camera.
fr_ca: Exemple d’image de la camera.

source: Click Setup to go to the setup page.
es_mx: Haga clic en Configuración para ir a la página de configuración.
fr_ca: Cliquez sur "Setup" pour accéder à la page de configuration.
tr_tr: Kurulum sayfasına gitmek için ''Kurulum''a tıklayın.
zh_cn: 单击“设置”进入设置页面。

source: Configure Basic Network Settings
es_mx: Configurar los ajustes de red básicos
fr_ca: Configurer les paramètres réseau de base
tr_tr: Temel Ağ Ayarlarını Yapılandırın
zh_cn: 配置基本网络设置

source: Set the camera IP address to either static or DHCP.
fr_ca: Définissez l’adresse IP de la caméra sur statique ou DHCP.

source: To configure the network settings of the camera, click the arrow to expand the System Options pane, then click the arrow to expand Network, then expand TCP/IP and select Basic. Set the camera to obtain an IP address via DHCP by selecting the bubble. Alternately, you may choose to set a static IP in the range ``10.TE.AM.3`` to ``10.TE.AM.19``. This is outside the range handed out by the radio (home use) or FMS system (event use) so you will avoid any IP conflicts.
es_mx: Para configurar los ajustes de red de la cámara, haga clic en la flecha para expandir el panel Opciones del sistema, luego haga clic en la flecha para expandir Red, luego expanda TCP / IP y seleccione Básico. Configure la cámara para obtener una dirección IP a través de DHCP seleccionando la burbuja. Alternativamente, puede optar por establecer una IP estática en el rango ``10.TE.AM.3`` a ``10.TE.AM.19``. Esto está fuera del rango entregado por la radio (uso doméstico) o el sistema FMS (uso de eventos) por lo que evitará conflictos de IP.
fr_ca: Pour configurer les paramètres réseau de la caméra, cliquez sur la flèche pour faire apparaître le volet "System Options", puis cliquez sur la flèche pour faire apparaître "Network", puis ensuite "TCP/IP" et sélectionnez "Basic". Réglez la caméra pour obtenir une adresse IP via DHCP en sélectionnant le bouton. Alternativement, vous pouvez choisir de définir une adresse IP statique dans la plage ``10.TE.AM.3`` à ``10.TE.AM.19``. Cette plage est en dehors de la plage utilisée pour usage domestique ou par le système FMS (lors des compétitions), ceci afin d'éviter tout conflit IP.
tr_tr: Kameranın ağ ayarlarını yapılandırmak için, Sistem Seçenekleri bölmesini genişletmek için oka tıklayın, ardından Ağ'ı genişletmek için oka tıklayın, ardından TCP / IP'yi genişletin ve Basic -Temel'i seçin. Balonu seçerek kamerayı DHCP aracılığıyla bir IP adresi alacak şekilde ayarlayın. Alternatif olarak, `` 10.TE.AM.3`` ila `` 10.TE.AM.19`` aralığında statik bir IP ayarlamayı seçebilirsiniz. Bu, radyo (ev kullanımı) veya FMS sistemi (olay kullanımı) tarafından verilen aralığın dışındadır, böylece herhangi bir IP çakışmasını önleyeceksiniz.
zh_cn: 要配置摄像机的网络设置，请单击箭头以展开“系统选项”创口，然后单击箭头以展开“网络”，然后展开TCP / IP并选择“基本”。选择气泡来将摄像机设置为通过DHCP获取IP地址。或者，您可以选择在“10.TE.AM.3”至“10.TE.AM.19”范围内设置静态IP。这超出了无线电设备（家庭使用）或FMS系统（事业使用）分配的范围，因此您可以避免任何IP冲突。

source: Click Save.
es_mx: Clic en Guardar.
fr_ca: Cliquez sur "Save"
tr_tr: Kaydet'i tıklayın.
zh_cn: 单击保存。

source: Configure Advanced Network Settings
es_mx: Configurar los ajustes de red avanzados
fr_ca: Configurer les paramètres réseau avancés
tr_tr: Gelişmiş Ağ Ayarlarını Yapılandırın
zh_cn: 配置高级网络设置

source: Making sure the hostname is configured to "axis-camera".
fr_ca: S’assurer que le nom d’hôte est configuré sur "axis-camera".

source: Next click Advanced under TCP/IP. Set the Host Name Configuration to "Use the host name:" and set the value to ``axis-camera`` as shown. If you plan to use multiple cameras on your robot, select a unique host name for each. You will need to modify the dashboard and/or robot code to work with the additional cameras and unique host names.
es_mx: A continuación, haga clic en Avanzado en TCP / IP. Establezca la Configuración del nombre de host en "Usar el nombre de host:" y establezca el valor en `ʻaxis-camera`` como se muestra. Si planea utilizar varias cámaras en su robot, seleccione un nombre de host único para cada una. Deberá modificar la dashboard y / o el código del robot para que funcione con las cámaras adicionales y los nombres de host únicos.
fr_ca: Cliquez ensuite sur "Advanced" sous "TCP/IP". Réglez la configuration du "Host Name" sur "Use the host name:" et définissez la valeur comme ``axis-camera`` comme indiqué. Si vous prévoyez d'utiliser plusieurs caméras sur votre robot, sélectionnez un nom d'hôte unique pour chacune. Vous devrez modifier le code du tableau de bord et/ou du robot pour qu'il fonctionne avec les caméras supplémentaires et les noms d'hôte uniques.
tr_tr: Ardından, TCP/IP altında Gelişmiş'i tıklayın. Ana Bilgisayar Adı Yapılandırmasını "Use the host name: - Ana bilgisayar adını kullan:" olarak ayarlayın ve değeri gösterildiği gibi "axis-camera, eksen kamera`` olarak ayarlayın. Robotunuzda birden fazla kamera kullanmayı planlıyorsanız, her biri için benzersiz bir ana bilgisayar adı seçin. Ek kameralar ve benzersiz ana bilgisayar adlarıyla çalışmak için kontrol panelini ve / veya robot kodunu değiştirmeniz gerekecektir.
zh_cn: 接下来，单击“ TCP / IP”下的“高级”。将主机名配置设置为“使用主机名：”，然后将值设置为“ axis-camera”，如图所示。如果您打算在机器人上使用多个摄像机，请为每个摄像机选择一个唯一的主机名。您将需要修改仪表板和/或机器人代码，以与其他摄像机和唯一的主机名一起使用。

source: Manual Camera Configuration
es_mx: Configuración manual de la cámara
fr_ca: Configuration manuelle de la caméra
tr_tr: Manuel Kamera Yapılandırması
zh_cn: 手动相机配置

source: It is recommended to use the Setup Axis Camera Tool to configure the Axis Camera. If you need to configure the camera manually, connect the camera directly to the computer, configure your computer to have a static IP of ``192.168.0.5``, then open a web browser and enter ``192.168.0.90`` in the address bar and press enter. You should see a Configure Root Password page, set this password to whatever you would like, but admin is recommended.
es_mx: Se recomienda utilizar la herramienta de configuración de la cámara Axis para configurar la cámara Axis. Si necesita configurar la cámara manualmente, conecte la cámara directamente a la computadora, configure su computadora para que tenga un IP estático de ``192.168.0.5``, luego abra un navegador web e ingrese ``192.168.0.90`` en el barra de direcciones y presione enter. Debería ver una página Configurar contraseña raíz, establezca esta contraseña como desee, pero se recomienda admin.
fr_ca: Il est recommandé d'utiliser l'outil de configuration "Setup Axis Camera Tool" pour configurer la caméra Axis. Si vous devez configurer la caméra manuellement, connectez la caméra directement à l'ordinateur, configurez votre ordinateur pour avoir une IP statique de ``192.168.0.5``, puis ouvrez un navigateur Web et entrez ``192.168.0.90`` dans le barre d'adresse et appuyez sur "Enter". Vous devriez voir une page "Configure Root Password", définissez ce mot de passe comme vous le souhaitez, mais le mot "admin" est recommandé.
tr_tr: Eksen Kamerasını yapılandırmak için '' Setup Axis Camera Tool -Ayar Eksen Kamera Aracı''nın kullanılması önerilir. Kamerayı manuel olarak yapılandırmanız gerekirse, kamerayı doğrudan bilgisayara bağlayın, bilgisayarınızı `` 192.168.0.5`` statik IP'ye sahip olacak şekilde yapılandırın, ardından bir web tarayıcısı açın ve `` 192.168.0.90 '' yazın. adres çubuğuna gidin ve ''enter'' tuşuna basın. '' Configure Root Password-Bir Kök Parolayı Yapılandır'' sayfası görmelisiniz, bu parolayı istediğiniz gibi ayarlamalısınız, ancak yönetici önerilir.
zh_cn: 建议使用设置Axis摄像头工具来配置轴照相机。如果需要手动配置摄像头，请将摄像头直接连接到计算机，将计算机配置为具有192.168.0.5的静态IP，然后打开Web浏览器并在屏幕上输入192.168.0.90地址栏，然后按Enter。您应该看到“配置根密码”页面，将此密码设置为所需的密码，但建议使用admin。

source: If you do not see the camera webpage come up, you may need to reset the camera to factory defaults. To do this, remove power from the camera, hold the reset button while applying power to the camera and continue holding it until the lights on the camera face turn on, then release the reset button and wait for the lights to turn green. The camera is now reset to factory settings and should be accessible via the ``192.168.0.90`` address.
es_mx: Si no aparece la página web de la cámara, es posible que deba reiniciar la cámara a los valores predeterminados de fábrica. Para hacer esto, descargue la cámara, mantenga presionado el botón de reinicio mientras carga la cámara y continúe presionándolo hasta que las luces del frente de la cámara se enciendan, luego suelte el botón de reinicio y espere a que las luces se pongan verdes. La cámara ahora está restablecida a la configuración de fábrica y debería ser accesible a través de la dirección ``192.168.0.90``.
fr_ca: Si vous ne voyez pas la page Web de la caméra s'afficher, vous devrez peut-être réinitialiser la caméra aux paramètres d'usine par défaut. Pour ce faire, coupez l'alimentation de la caméra, maintenez le bouton de réinitialisation enfoncé tout en rétablissant l'alimentation sur la caméra. Continuez de maintenir le bouton jusqu'à ce que les lumières sur la facade de la caméra s'allument, puis relâchez le bouton et attendez que les lumières deviennent vertes. La caméra est maintenant réinitialisée aux paramètres d'usine et devrait être accessible via l'adresse ``192.168.0.90``.
tr_tr: Kamera web sayfasının açıldığını görmezseniz, kamerayı fabrika varsayılanlarına sıfırlamanız gerekebilir. Bunu yapmak için, kameranın gücünü kesin, kameraya güç verirken sıfırlama düğmesini basılı tutun ve kamera yüzündeki ışıklar açılıncaya kadar basılı tutmaya devam edin, ardından sıfırlama düğmesini bırakın ve ışıkların yeşile dönmesini bekleyin. Kamera artık fabrika ayarlarına sıfırlanmıştır ve ``192.168.0.90`` adresi üzerinden erişilebilir olmalıdır.
zh_cn: 如果看不到相机网页，则可能需要将相机重置为出厂默认值。为此，请断开照相机电源，在为照相机通电的同时按住复位按钮，并继续按住直到照相机表面的灯点亮，然后释放复位按钮并等待指示灯变为绿色。摄像机现在已重置为出厂设置，应该可以通过``192.168.0.90''地址进行访问。

source: Manual - Configure Users
es_mx: Manual - Configurar usuarios
fr_ca: Manuel - Configurer les utilisateurs
tr_tr: Manuel - Kullanıcıları Yapılandırın
zh_cn: 手册-配置用户

source: Adding users to camera configuration.
fr_ca: Ajout d’utilisateurs à la configuration de la caméra.

source: On the left side click Users to open the users page. Click Add then enter the Username FRC Password FRC and click the Administrator bubble, then click OK. If using the SmartDashboard, check the Enable anonymous viewer login box. Then click Save.
es_mx: En el lado izquierdo, haga clic en Usuarios para abrir la página de usuarios. Haga clic en Agregar, luego ingrese el Nombre de usuario FRC Contraseña FRC y haga clic en la burbuja Administrador, luego haga clic en Aceptar. Si usa SmartDashboard, marque la casilla Habilitar inicio de sesión de visor anónimo. Luego haga clic en Guardar.
fr_ca: Sur le côté gauche, cliquez sur Utilisateurs pour ouvrir la page des utilisateurs. Cliquez sur "Add", puis entrez le nom d'utilisateur FRC suivi du mot de passe FRC et cliquez sur le bouton "Administrator", puis cliquez sur OK. Si vous utilisez le SmartDashboard, cochez la case " Enable anonymous viewer login". Cliquez ensuite sur "Save".
tr_tr: Sol tarafta, kullanıcılar sayfasını açmak için Kullanıcılar'ı tıklayın. Ekle'ye tıklayın, ardından Kullanıcı Adı FRC Parolası FRC'sini girin ve Administrator-Yönetici balonuna tıklayın, ardından Tamam'a tıklayın. SmartDashboard kullanıyorsanız, Anonim görüntüleyici oturumunu etkinleştir kutusunu işaretleyin. Ardından Kaydet'i tıklayın.
zh_cn: 单击左侧的“用户”以打开用户页面。单击添加，然后输入用户名FRC密码FRC，然后单击管理员对话框，然后单击确定。如果使用SmartDashboard，请选中“启用匿名查看器”登录框。然后点击保存。

source: Manual - Configure Image Settings
es_mx: Manual - Configurar los ajustes de imagen
fr_ca: Manuel - Configurer les paramètres d'image
tr_tr: Manuel - Görüntü Ayarlarını Yapılandırma
zh_cn: 手册-配置图像设置

source: Manually set the desired camera properties.
fr_ca: Définissez manuellement les propriétés souhaitées de la caméra.

source: Click Video & Image on the left side to open the image settings page. Set the Resolution and Compression to the desired values (recommended 320x240, 30). To limit the framerate to under 30 FPS, select the Limited to bubble under Maximum frame rate and enter the desired rate in the box. Color, Brightness and Sharpness may also be set on this screen if desired. Click Save when finished.
es_mx: Haga clic en Video e imagen en el lado izquierdo para abrir la página de configuración de imagen. Establezca la resolución y la compresión en los valores deseados (recomendado 320x240, 30). Para limitar la velocidad de fotogramas a menos de 30 FPS, seleccione Limitado a la burbuja en Velocidad de fotogramas máxima e introduzca la velocidad deseada en el cuadro. El color, el brillo y la nitidez también se pueden configurar en esta pantalla si lo desea. Haga clic en Guardar cuando haya terminado.
fr_ca: Cliquez sur "Vidéo and image" sur le côté gauche pour ouvrir la page des paramètres d'image. Réglez la résolution et la compression sur les valeurs souhaitées (320x240, 30 recommandés). Pour limiter le framerate à moins de 30 FPS, sélectionnez "Limited to bubble" sous "Maximum frame rate" et entrez le taux souhaité dans la case. La couleur (Color), la luminosité (Brightness) et la netteté (Sharpness) peuvent également être définies sur cet écran si vous le souhaitez. Cliquez sur "Save" lorsque vous avez terminé.
tr_tr: Görüntü ayarları sayfasını açmak için sol taraftaki ''Video ve Görüntü'' seçeneğine tıklayın. Çözünürlük ve sıkıştırmayı istenen değerlere ayarlayın (önerilen 320x240, 30). Kare hızını 30 FPS'nin altında sınırlamak için Maximum frame rate-Maksimum kare hızı altındaki Kabarcıkla sınırlı'yı seçin ve kutuya istediğiniz hızı girin. İstenirse bu ekranda Renk, Parlaklık ve Keskinlik de ayarlanabilir. Bitirdiğinizde ''Kaydet''i tıklayın.
zh_cn: 单击左侧的“视频和图像”以打开图像设置页面。将“分辨率和压缩率”设置为所需值（建议320x240，30）。要将帧速率限制为低于30 FPS，请在“最大帧速率”下选择“限制为气泡”，然后在框中输入所需的速率。如果需要，还可以在此屏幕上设置颜色，亮度和清晰度。完成后单击“保存”。

source: Manual - Configure Basic Network Settings
es_mx: Manual - Configurar los ajustes de red básicos
fr_ca: Manuel - Configurer les paramètres réseau de base
tr_tr: Manuel - Temel Ağ Ayarlarını Yapılandırın
zh_cn: 手册-配置基本网络设置
