Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/axis-camera/using-the-axis-camera-at-single-network-events.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Using the Axis Camera at Single Network Events
es_mx: Uso de la cámara Axis en eventos de red única
fr_ca: Utilisation de plusieurs caméra Axis avec un seul réseau (Single Network Events)
tr_tr: Eksen Kamerasını Tek Ağ Etkinliklerinde Kullanma
zh_cn: 在单个网络事件中使用Axis摄像机

source: The convention for using the Axis camera uses mDNS with the camera name set to ``axis-camera.local``. At home, this works fine as there is only one camera on the network. At official events, this works fine as each team is on their own VLAN and therefore doesn't have visibility to another team's camera. However, at an off-season event using a single network, this will cause an issue where all teams will connect to whichever team's camera "wins" the mDNS resolution and becomes ``axis-camera``. The other cameras will see that the name is taken and use an alternative name. This article describes how to modify the Dashboard and/or robot code to use a different mDNS name to separate the camera streams.
es_mx: La convención para usar la cámara Axis usa mDNS con el nombre de la cámara configurada como ``axis-camera.local``. En casa, esto funciona bien ya que solo hay una cámara en la red. En eventos oficiales, esto funciona bien ya que cada equipo está en su propia VLAN y, por lo tanto, no tiene visibilidad para la cámara de otro equipo. Sin embargo, en un evento en off-season utilizando una sola red, esto causará un problema en el que todos los equipos se conectarán a la cámara del equipo que "gane" la resolución mDNS y se convierta en ``axis-camera``. Las otras cámaras verán que se toma el nombre y usarán un nombre alternativo. Este artículo describe cómo modificar el Dashboard y / o el código del robot para usar un nombre de mDNS diferente para separar las transmisiones de la cámara.
fr_ca: La convention d'utilisation de la caméra Axis utilise mDNS avec le nom de caméra défini sur ``axe-camera.local``. À la maison, cela fonctionne bien car il n'y a qu'une seule caméra sur le réseau. Lors des événements officiels, cela fonctionne bien car chaque équipe est sur son propre VLAN et n'a donc pas de visibilité sur la caméra d'une autre équipe. Cependant, lors d'un événement hors saison utilisant un seul réseau, cela entraînera un problème où toutes les équipes se connecteront à la caméra de l'équipe qui "remportera" la résolution mDNS et deviendra ``axis-camera``. Les autres caméras verront que le nom est pris et utiliseront un autre nom. Cet article explique comment modifier le code du tableau de bord et/ou du robot pour utiliser un nom mDNS différent pour séparer les flux de caméra.
tr_tr: Axis kamerayı kullanma kuralı, kamera adı ``axis-camera.local`` olarak ayarlanmış mDNS kullanır. Evde, ağda yalnızca bir kamera olduğu için bu iyi çalışıyor. Resmi etkinliklerde, her takım kendi VLAN'ında olduğundan ve bu nedenle başka bir ekibin kamerasını göremediğinden bu iyi çalışıyor. Bununla birlikte, tek bir ağ kullanan sezon dışı bir etkinlikte, bu, tüm takımların hangi takımın kamerası mDNS çözünürlüğünü "wins-kazanırsa" ve "axis-camera-eksen kamerası" haline gelirse ona bağlanacağı bir soruna neden olacaktır. Diğer kameralar adın alındığını görecek ve alternatif bir ad kullanacaktır. Bu makale, kamera akışlarını ayırmak için farklı bir mDNS adı kullanmak için Dashboard ve / veya robot kodunun nasıl değiştirileceğini açıklar.
zh_cn: 使用Axis摄像机的惯例是使用mDNS，将摄像机名称设置为``axis-camera.local``。在家里，这很好用，因为网络上只有一台摄像机。在官方活动中，这很好用，因为每个团队都在自己的VLAN上，因此无法看到其他团队的摄像机。然而，在使用单一网络的淡季活动中，这将导致一个问题，即所有团队将连接到任何一个团队的摄像机 "赢得 "mDNS解析并成为``axis-camera``。其他摄像机将看到该名称被占用，并使用其他名称。本文介绍了如何修改Dashboard和/或机器人代码，以使用不同的mDNS名称来分离相机流。

source: Changing the Camera mDNS Name
es_mx: Cambiar el Nombre de la Cámara mDNS
fr_ca: Modification du nom mDNS de la caméra
tr_tr: Kamera mDNS Adını Değiştirme
zh_cn: 更改相机的mDNS名称

source: To change the mDNS name in the camera, follow the instructions in :doc:`configuring-an-axis-camera`, but substitute the new name such as ``axis-cameraTEAM`` where ``TEAM`` is your team number.
es_mx: Para cambiar el nombre de mDNS en la cámara, siga las instrucciones en: doc:`configuring-an-axis-camera`, pero sustituya el nuevo nombre como ``axis-cameraTEAM`` donde ``TEAM`` es su número de equipo.
fr_ca: Pour changer le nom mDNS dans la caméra, suivez les instructions dans :doc:`configuring-an-axis-camera`, mais remplacez le nouveau nom tel que ``axis-cameraTEAM`` où ``TEAM`` est votre numéro d'équipe .
tr_tr: Kameradaki mDNS adını değiştirmek için şuradaki talimatları izleyin :doc:`configuring-an-axis-camera`, ancak ``axis-cameraTEAM_eksen-kamera TAKIM '' gibi yeni bir adı kullanın, burada ``TEAM`` izin takım numaranızdır .
zh_cn: 要在摄像机中更改mDNS名称，请按照：doc：configuring-an-axis-camera`中的说明进行操作，但使用新名称例如“ axis-cameraTEAM”代替，其中“ TEAM”是您的团队编号。

source: Viewing the Camera on the DS PC - Browser or SmartDashboard
es_mx: Visualización de la cámara en la DS PC - Navegador o SmartDashboard
fr_ca: Affichage de la caméra sur le PC DS - Navigateur ou SmartDashboard
tr_tr: Kamerayı DS PC'de Görüntüleme - Tarayıcı veya SmartDashboard
zh_cn: 在DS PC上查看相机-浏览器或SmartDashboard

source: If you are using a web-browser or SmartDashboard (which accepts mDNS names for the Simple Camera Viewer widget), updating to use the new mDNS name is simple. Simply change the URL in the browser or the address in the Simple Camera Viewer widget properties to the new mDNS name and you are all set.
es_mx: Si está utilizando un navegador web o SmartDashboard (que acepta nombres mDNS para el widget Simple Camera Viewer), la actualización para usar el nuevo nombre mDNS es simple. Simplemente cambie la URL en el navegador o la dirección en las propiedades del widget Simple Camera Viewer al nuevo nombre de mDNS y ya está.
fr_ca: Si vous utilisez un navigateur Web ou SmartDashboard (qui accepte les noms mDNS pour le widget "Simple Camera Viewer"), la mise à jour pour utiliser le nouveau nom mDNS est simple. Modifiez simplement l'URL dans le navigateur ou l'adresse dans les propriétés du widget "Simple Camera Viewer" par le nouveau nom mDNS et voila!.
tr_tr: Bir web tarayıcısı veya SmartDashboard kullanıyorsanız (Basit Kamera Görüntüleyici widget'ı için mDNS adlarını kabul eder), yeni mDNS adını kullanmak için güncelleme yapmak basittir. Basit Kamera Görüntüleyici gereci özelliklerindeki tarayıcıdaki URL'yi veya adresi yeni mDNS adına değiştirin ve artık hazırsınız.
zh_cn: 如果您使用的是网络浏览器或SmartDashboard（对于Simple Camera Viewer小部件接受mDNS名称），则使用新的mDNS名称进行更新会很简单。只需将浏览器中的URL或“简单相机查看器”窗口小部件属性中的地址更改为新的mDNS名称，便一切就绪。

source: Viewing the Camera on the DS PC - LabVIEW Dashboard
es_mx: Visualización de la cámara en la DS PC - LabVIEW Dashboard
fr_ca: Affichage de la caméra sur le PC DS - Tableau de bord LabVIEW
tr_tr: Kamerayı DS PC'de Görüntüleme - LabVIEW Dashboard
zh_cn: 在DS PC上查看相机-LabVIEW仪表板

source: To view the camera stream in the LabVIEW Dashboard, you will need to build a customized version of the Dashboard. Note that this customized version will only work for the Axis camera and will no longer work for a USB camera. Revert to the default Dashboard to use a USB camera.
es_mx: Para ver la transmisión de la cámara en el LabVIEW Dashboard, necesitará construir una versión personalizada del Dashboard. Tenga en cuenta que esta versión personalizada solo funcionará para la cámara Axis y ya no funcionará para una cámara USB. Vuelva al Dashboard predeterminado para usar una cámara USB.
fr_ca: Pour afficher le flux de caméra dans le tableau de bord LabVIEW, vous devrez créer une version personnalisée du tableau de bord. Notez que cette version personnalisée ne fonctionnera que pour la caméra Axis et ne fonctionnera plus pour une caméra USB. Revenez au tableau de bord par défaut pour utiliser une caméra USB.
tr_tr: Kamera akışını LabVIEW Dashboard'da görüntülemek için, Dashboard'un özelleştirilmiş bir sürümünü oluşturmanız gerekecektir. Bu özelleştirilmiş sürümün yalnızca Axis kamera için çalışacağını ve artık bir USB kamera için çalışmayacağını unutmayın. USB kamera kullanmak için varsayılan Kontrol Paneline dönün.
zh_cn: 要在LabVIEW仪表板中查看相机流，您将需要构建自定义版本的仪表板。请注意，此自定义版本仅适用于Axis相机，而不再适用于USB相机。恢复为默认的仪表板以使用USB摄像头。

source: Creating a Dashboard Project
es_mx: Crear un proyecto de Dashboard
fr_ca: Création d'un projet de tableau de bord
tr_tr: Dashboard Projesi Oluşturma
zh_cn: 创建仪表板项目

source: The LabVIEW Home screen and the option to create a new LabVIEW Dashboard highlighted.
fr_ca: L’écran d’accueil labVIEW et l’option permettant de créer un nouveau Dashboard LabVIEW sont mis en surbrillance.

source: From the LabVIEW Splash screen, select "FRC\ |reg| Dashboard Project". Name the project as desired, then click Finish.
es_mx: En la pantalla de LabVIEW Splash, seleccione "FRC |reg| Dashboard Project". Nombe el proyecto como desee, luego haga clic en Finalizar.
fr_ca: Dans l'écran de démarrage LabVIEW, sélectionnez "FRC \ | reg | Dashboard Project". Nommez le projet comme vous le souhaitez, puis cliquez sur Terminer.
tr_tr: LabVIEW Açılış ekranından "FRC\| reg| Dashboard Project" öğesini seçin. Projeyi istediğiniz gibi adlandırın, ardından Bitir'i tıklayın.
zh_cn: 在LabVIEW Splash屏幕上，选择“ FRC \ | reg |仪表板项目”。根据需要命名项目，然后单击“完成”。

source: Locating Loop 2 - Camera IP
es_mx: Locating Loop 2 - IP de la cámara
fr_ca: Localisation de la boucle 2 - IP de la caméra
tr_tr: Konum Bulma Döngüsü 2 - Kamera IP'si
zh_cn: 定位环2-摄像机IP

source: The camera loop is identified as "Loop 2".
fr_ca: La boucle de la caméra est identifiée comme étant "Loop 2".

source: Double click on ``Dashboard Main.vi`` in the project explorer to open it and press :kbd:`Ctrl+E` to see the block diagram. Scroll down to the loop with the comment that says Loop 2 and locate the "Camera IP" input.
es_mx: Haga doble clic en ``Dashboard Main.vi`` en el explorador del proyecto para abrirlo y presione :kbd:`Ctrl+E` para ver el diagrama de bloques. Desplácese hacia abajo hasta el bucle con el comentario que dice Loop 2 y localice la entrada "Camera IP".
fr_ca: Double-cliquez sur ``Dashboard Main.vi`` dans l'explorateur de projet pour l'ouvrir et appuyez sur :kbd:`Ctrl+E` pour voir le diagramme. Faites défiler jusqu'à la boucle avec le commentaire qui dit Loop 2 et localisez l'entrée "Camera IP".
tr_tr: Proje gezgininde``Dashboard Main.vi``üzerine çift tıklayarak açın ve blok diyagramını görmek için: kbd: `Ctrl+E` tuşlarına basın. Döngü 2 yazan açıklamanın bulunduğu döngüye gidin ve "Kamera IP'si" girişini bulun.
zh_cn: 双击项目浏览器中的``Dashboard Main.vi''将其打开，然后按Ctrl + E组合键以查看框图。向下滚动到带有循环2的注释的循环，然后找到“摄像机IP”输入。

source: Editing the Camera IP
es_mx: Editar la IP de la cámara
fr_ca: Modification de l'IP de la caméra
tr_tr: Kamera IP'sini Düzenleme
zh_cn: 编辑相机IP

source: Replacing the "Camera IP" local variable with a string constant.
fr_ca: Remplacement de la variable locale "Camera IP" par une constante de chaîne de caractères.

source: Delete the Camera IP node, right click on the broken wire and click Create Constant (connect the constant to the wire if necessary). In the box, enter the mDNS name of your camera with a ``.local`` suffix (e.g. ``axis-cameraTEAM.local`` where ``TEAM`` is replaced with your team number). The example above shows a sample name for team 9999. Then click File->Save or :kbd:`Ctrl+S` to save the VI.
es_mx: Borre el nodo de la Cámara IP, haga clic con el botón derecho del ratón en el cable roto y haga clic en Crear Constante (conecte la constante al cable si es necesario). En el cuadro, introduzca el nombre mDNS de su cámara con un sufijo ``.local`` (por ejemplo, ``axis-cámaraTEAM.local`` donde ``TEAM`` se reemplaza con su número de equipo). El ejemplo anterior muestra un nombre de muestra para el equipo 9999. Luego haga clic en File->Save o :kbd:``Ctrl+S`` para guardar el VI.
fr_ca: Supprimez le nœud IP de la caméra, faites un clic droit sur le fil rompu et cliquez sur Créer une constante (connectez la constante au fil si nécessaire). Dans la case, entrez le nom mDNS de votre caméra avec un suffixe ``.local`` (par exemple, ``axis-cameraTEAM.local`` où `` TEAM '' est remplacé par votre numéro d'équipe). L'exemple ci-dessus montre un exemple de nom pour l'équipe 9999. Cliquez ensuite sur File->Save ou :kbd:`Ctrl+S` pour enregistrer le VI.
tr_tr: Kamera IP düğümünü silin, kopuk kabloya sağ tıklayın ve Sabit Oluştur'a tıklayın (gerekirse sabiti kabloya bağlayın). Kutuya, kameranızın mDNS adını bir ``.local`` sonekiyle girin (örneğin,``axis-cameraTEAM.local``, burada``TEAM`` takım numaranızla değiştirilir). Yukarıdaki örnek, 9999 takımı için bir örnek adı göstermektedir. Sonra VI'yı kaydetmek için Dosya-> Kaydet veya: kbd: `Ctrl+S` tıklayın.
zh_cn: 删除“摄像机IP”节点，右键单击断开的导线，然后单击“创建常数”（如有必要，将常数连接到导线）。在框中，输入带有.local后缀的摄像机的mDNS名称（例如，其中axis-cameraTEAM.local，其中TEAM替换为您的团队编号）。上例显示了团队9999的示例名称。然后单击File-> Save或Ctrl + S：kbd：Ctrl + S保存VI。

source: You may also wish to make a minor modification to the Front Panel to verify that you are running the right dashboard later.
es_mx: También es posible que desee realizar una pequeña modificación en el Front Panel para verificar que está ejecutando el dashboard correcto más adelante.
fr_ca: Vous pouvez également souhaiter apporter une modification mineure au panneau "Front Panel" pour vérifier que vous exécutez le bon tableau de bord ultérieurement.
tr_tr: Daha sonra doğru panoyu çalıştırdığınızı doğrulamak için Ön Panelde küçük bir değişiklik yapmak isteyebilirsiniz.
zh_cn: 您可能还需要对前面板进行较小的修改，以验证以后是否在运行正确的仪表板。

source: Building the Dashboard
es_mx: Crear el Dashboard
fr_ca: Création du Dashboard
tr_tr: Kontrol Panelini Oluşturma
zh_cn: 建立仪表板

source: Right click on "FRC_Dashboard" and choose "Build".
fr_ca: Cliquez à l'aide du bouton droit de la souris sur "FRC_Dashboard" et choisissez "Build".

source: To build the new dashboard, expand Build Specifications in the Project Explorer, right click on FRC_Dashboard and select Build.
es_mx: Para crear el nuevo dashboard, despliegue Build Specifications en el Project Explorer, haga clic con el botón derecho en FRC_Dashboard y seleccione Build.
fr_ca: Pour créer le dashboard, choisir "Build Specifications" dans "Project Explorer", cliquez avec le bouton droit sur "FRC_Dashboard" et sélectionnez "Build".
tr_tr: Yeni gösterge panosunu oluşturmak için, Proje Gezgini'nde Özellik Oluşturma'yı genişletin, FRC_Dashboard'a sağ tıklayın ve Oluştur'u seçin.
zh_cn: 要构建新的仪表板，请在项目资源管理器中展开“构建规范”，右键单击FRC_Dashboard并选择“构建”。

source: Setting the Driver Station to Launch the Modified Dashboard
es_mx: Configuración de la Driver Station para Iniciar el Dashboard Modificado
fr_ca: Configuration de l'application Driver Station pour lancer l'application Dashboard modifiée
tr_tr: Driver Station'ı Değiştirilmiş Kontrol Panelini Başlatacak Şekilde Ayarlama
zh_cn: 设置Driver Station以启动修改后的仪表板

source: Changing the "Dashboard Type" to LabVIEW.
fr_ca: Modification de "Dashboard Type" en LabVIEW.

source: On the Setup tab of the Driver Station, change to dropdown box to LabVIEW to launch your new Dashboard.
es_mx: En la pestaña Configuración de la Driver Station, cambie al cuadro desplegable a LabVIEW para iniciar su nuevo Dashboard.
fr_ca: Dans l'onglet Configuration de Driver Station, changer le mode pour LabVIEW afin de lancer votre nouveau Dashboard.
tr_tr: Driver Station'ın Kurulum sekmesinde, yeni Kontrol Panelinizi başlatmak için açılır kutuyu LabVIEW olarak değiştirin.
zh_cn: 在Driver Station的“设置”选项卡上，切换至LabVIEW的下拉框以启动新的仪表板。

source: Accessing the Camera from Robot Code
es_mx: Acceso a la Cámara desde el Código del Robot
fr_ca: Accès à la caméra à partir du code du robot
tr_tr: Kameraya Robot Kodundan Erişim
zh_cn: 从机器人代码访问摄像机

source: If you wish to access the renamed camera from your robot code, you will have to modify it as well. In C++ and Java, just change the String used for the camera host name to match the new name. In LabVIEW follow the step below.
es_mx: Si desea acceder a la cámara renombrada desde su código de robot, también tendrá que modificarlo. En C++ y Java, simplemente cambie la variable utilizada para el nombre de host de la cámara para que coincida con el nuevo nombre. En LabVIEW siga el paso a continuación.
fr_ca: Si vous souhaitez accéder à la caméra renommée à partir de votre code de robot, vous devrez également la modifier. En C++ et Java, modifiez simplement la chaîne utilisée pour le nom d'hôte de la caméra pour qu'elle corresponde au nouveau nom. Dans LabVIEW, suivez l'étape ci-dessous.
tr_tr: Yeniden adlandırılan kameraya robot kodunuzdan erişmek isterseniz, onu da değiştirmeniz gerekecektir. C ++ ve Java'da, kamera ana bilgisayar adı için kullanılan Dizeyi yeni adla eşleşecek şekilde değiştirin. LabVIEW'de aşağıdaki adımı izleyin.
zh_cn: 如果您希望通过机器人代码访问重命名的摄像机，则也必须对其进行修改。在C ++和Java中，只需更改用于摄像机主机名的字符串以匹配新名称即可。在LabVIEW中，请执行以下步骤。

source: Modifying LabVIEW Robot Code
es_mx: Modificar el Código del Robot de LabVIEW
fr_ca: Modification du code du robot LabVIEW
tr_tr: LabVIEW Robot Kodunu Değiştirme
zh_cn: 修改LabVIEW机器人代码

source: In your LabVIEW program the mDNS name will also need to be changed.
fr_ca: Dans votre programme LabVIEW, le nom mDNS devra également être modifié.

source: In the Project Explorer, locate ``Vision Processing.VI`` and double click to open it. Then press :kbd:`Ctrl+E` to open the Block Diagram. Locate the string ``axis-camera.local`` near the left of the image and replace with ``axis-cameraTEAM.local``. Also make sure the constant is set to ``False`` to use the Axis camera instead of USB.
es_mx: En el Explorador de Proyectos, localice ``Vision Processing.VI`` y haga doble clic para abrirlo. Luego presione :kbd:`Ctrl+E` para abrir el Diagrama de Bloques. Localice la cadena ``axis-camera.local`` cerca de la izquierda de la imagen y reemplácela por ``eje-cámaraTEAM.local``. También asegúrese de que la constante esté puesta en ``False`` para usar la cámara Axis en lugar del USB.
fr_ca: Dans l'explorateur de projet, recherchez ``Vision Processing.VI`` et double-cliquez pour l'ouvrir. Appuyez ensuite sur :kbd:`Ctrl+E` pour ouvrir le diagramme. Localisez la chaîne ``axis-camera.local`` à gauche de l'image et remplacez-la par ``axis-cameraTEAM.local``. Assurez-vous également que la constante est définie sur ``False '' pour utiliser la caméra Axis au lieu de l'USB.
tr_tr: Proje Gezgini'nde, ``Vision Processing.VI`` yı bulun ve açmak için çift tıklayın. Ardından Blok Diyagramı açmak için: kbd: `Ctrl + E` tuşlarına basın. Görüntünün sol tarafındaki ``axis-camera.local`` dizesini bulun ve `` axis-cameraTEAM.local`` ile değiştirin. Ayrıca Axis kamerayı USB yerine kullanmak için sabitin `` False`` olarak ayarlandığından emin olun.
zh_cn: 在项目浏览器中，找到``视觉处理.VI''并双击将其打开。然后按Ctrl + E键打开程序框图。在图片左侧找到字符串``axis-camera.local''并替换为``axis-cameraTEAM.local''。还要确保将常数设置为``False''以使用Axis摄像头而不是USB。
