Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/kinematics-and-odometry/differential-drive-odometry.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Differential Drive Odometry
es_mx: Odometría de mando diferencial
fr_ca: Odométrie à entraînement différentiel
tr_tr: Differential Drive Odometrisi
zh_cn: 差速驱动测距法

source: A user can use the differential drive kinematics classes in order to perform :ref:`odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`. WPILib contains a ``DifferentialDriveOdometry`` class that can be used to track the position of a differential drive robot on the field.
es_mx: Un usuario puede utilizar las clases de cinemática de accionamiento diferencial para realizar: ref:`odometría <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`. WPILib contiene una clase ``DifferentialDriveOdometry`` que se puede utilizar para rastrear la posición de un robot de accionamiento diferencial en el campo.
fr_ca: Un utilisateur peut utiliser les classes cinématiques d'entraînement différentiel afin d'effectuer l' :ref:`Odométrie <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`. WPILib contient une classe ``DifferentialDriveOdometry`` qui peut être utilisée pour détecter la position d'un robot avec entraînement différentiel sur le terrain.
tr_tr: Bir kullanıcı, :ref:`odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>` gerçekleştirmek için diferansiyel sürücü kinematik sınıflarını kullanabilir . WPILib, sahada diferansiyel tahrik robotunun konumunu izlemek için kullanılabilecek bir ``DifferentialDriveOdometry`` sınıfı içerir.
zh_cn: 用户可以使用差速驱动运动学类来执行:ref:`odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odmetry?>`。WPILib中包含了一个``差动驱动里程测量``类，可以用来跟踪差动驱动机器人在现场的位置。

source: Because this method only uses encoders and a gyro, the estimate of the robot's position on the field will drift over time, especially as your robot comes into contact with other robots during gameplay. However, odometry is usually very accurate during the autonomous period.
es_mx: Debido a que este método solo usa codificadores y un giróscopo, la estimación de la posición del robot en el campo variará con el tiempo, especialmente cuando tu robot entre en contacto con otros robots durante el juego. Sin embargo, la odometría suele ser muy precisa durante el período autónomo.
fr_ca: Étant donné que cette méthode utilise seulement que des encodeurs et un gyroscope, l'estimation de la position du robot sur le terrain va dévier avec le temps, surtout quand votre robot va entrer en contact avec des objets ou autres robots pendant le jeu. Cependant, l'odométrie est généralement très précise pendant la période autonome.
tr_tr: Bu yöntemde yalnızca kodlayıcılar ve bir jiroskop kullanıldığı için, robotun sahadaki konumunun tahmini, özellikle oyun sırasında diğer robotlarla temas kurduğunda zamanla kayacaktır. Bununla birlikte, odometri genellikle bağımsız dönemde çok doğrudur.
zh_cn: 由于这种方法只使用编码器和陀螺仪，机器人在场上的位置估计会随着时间的推移而漂移，特别是当你的机器人在游戏过程中与其他机器人接触时。不过，在自主期，测距法通常非常准确。

source: Creating the Odometry Object
es_mx: Creación del objeto de odometría
fr_ca: Création de l'objet Odometry
tr_tr: Odometri Nesnesini Oluşturma
zh_cn: 创建Odometry对象

source: The ``DifferentialDriveOdometry`` class requires one mandatory argument and one optional argument. The mandatory argument is the angle reported by your gyroscope (as a Rotation2d). The optional argument is the starting pose of your robot on the field (as a ``Pose2d``). By default, the robot will start at ``x = 0, y = 0, theta = 0``.
es_mx: La clase ``DifferentialDriveOdometry`` requiere un argumento obligatorio y un argumento opcional. El argumento obligatorio es el ángulo informado por su giroscopio (como Rotation2d). El argumento opcional es la pose inicial de su robot en el campo (como una ``Pose2d``). De forma predeterminada, el robot comenzará en ``x = 0, y = 0, theta = 0``.
fr_ca: La classe ``DifferentialDriveOdometry`` nécessite un argument obligatoire et un argument facultatif. L'argument obligatoire est l'angle rapporté par votre gyroscope (comme un Rotation2d). L'argument optionnel est la pose de départ de votre robot sur le terrain (comme un ``Pose2d``). Par défaut, le robot démarre à ``x = 0, y = 0, theta = 0``.
tr_tr: ``DifferentialDriveOdometry`` sınıfı, bir zorunlu bağımsız değişken ve bir isteğe bağlı bağımsız değişken gerektirir. Zorunlu argüman jiroskopunuz tarafından bildirilen açıdır (Rotation2d olarak). İsteğe bağlı argüman, robotunuzun sahadaki başlangıç pozudur (``Pose2d`` olarak). Varsayılan olarak, robot ``x = 0, y = 0, theta = 0`` ile başlayacaktır.
zh_cn: ``DifferentialDriveOdometry``类需要一个强制参数和一个可选参数。强制参数是您的陀螺仪报告的角度（作为一个Rotation2d）。可选参数是机器人在场地上的起始姿势（作为``Pose2d``）。默认情况下，机器人将以``x = 0, y = 0, theta = 0``开始。

source: 0 degrees / radians represents the robot angle when the robot is facing directly toward your opponent's alliance station. As your robot turns to the left, your gyroscope angle should increase. By default, WPILib gyros exhibit the opposite behavior, so you should negate the gyro angle.
es_mx: 0 grados / radianes representa el ángulo del robot cuando el robot está mirando directamente hacia la estación de alianza de tu oponente. A medida que su robot gira hacia la izquierda, el ángulo de su giroscopio debería aumentar. Por defecto, los giroscopios WPILib exhiben el comportamiento opuesto, por lo que debe negar el ángulo del giroscopio.
fr_ca: 0 degrés / radians représente l'angle du robot lorsque le robot fait face directement à la station d'alliance de votre adversaire. Lorsque votre robot se tourne vers la gauche, l'angle de votre gyroscope devrait augmenter. Par défaut, les gyroscopes WPILib présentent le comportement opposé, vous devez donc compenser l'angle du gyroscope en le convertissant en une valeur négative (nouvel angle = 0 - angle gyro).
tr_tr: 0 derece / radyan, robot doğrudan rakibinizin ittifak istasyonuna bakarken robot açısını temsil eder. Robotunuz sola döndükçe jiroskop açınız artmalıdır. Varsayılan olarak, WPILib jiroskopları zıt davranış sergiler, bu nedenle jiroskop açısını geçersiz kılmalısınız.
zh_cn: 0度/弧度代表机器人角度，当机器人正对着你的对手的联盟站。当您的机器人向左转时，您的陀螺仪角度应该增加。默认情况下，WPILib陀螺仪表现出相反的行为，因此您应该对陀螺仪的角度加上负号。

source: The encoder positions must be reset to zero before constructing the ``DifferentialDriveOdometry`` class.
es_mx: Las posiciones del codificador deben restablecerse a cero antes de construir la clase ``DifferentialDriveOdometry``.
fr_ca: Les positions de l'encodeur doivent être remises à zéro avant de construire la classe ``DifferentialDriveOdometry``.
tr_tr: ``DifferentialDriveOdometry`` sınıfını oluşturmadan önce enkoder konumları sıfırlanmalıdır.
zh_cn: 在构建``DifferentialDriveOdomety``类之前，编码器的位置必须重置为零。

source: Updating the Robot Pose
es_mx: Actualización de la postura del robot
fr_ca: Mise à jour de Robot Pose
tr_tr: Robot Duruşunu Güncelleme
zh_cn: 更新机器人姿势

source: The ``update`` method can be used to update the robot's position on the field. This method must be called periodically, preferably in the ``periodic()`` method of a :ref:`Subsystem <docs/software/commandbased/subsystems:Subsystems>`. The ``update`` method returns the new updated pose of the robot. This method takes in the gyro angle of the robot, along with the left encoder distance and right encoder distance.
es_mx: El método de ``actualización`` se puede utilizar para actualizar la posición del robot en el campo. Este método debe ser llamado periódicamente, preferiblemente en el método ``periodic()`` de un :ref:`Subsistema <docs/software/commandbased/subsystems:Subsystems>`. El método de ``actualización`` devuelve la nueva pose actualizada del robot. Este método tiene en cuenta el ángulo de giro del robot, junto con la distancia del codificador izquierdo y la distancia del codificador derecho.
fr_ca: La méthode Update peut être utilisée pour mettre à jour la position du robot sur le terrain. Cette méthode doit être appelée périodiquement, de préférence dans la méthode ``periodic()`` du :ref:`Sous-système <docs/software/commandbased/subsystems:Subsystems>`. La méthode Update renvoie la toute dernière pose du robot. Cette méthode prend en compte l'angle gyroscopique du robot, ainsi que le compte (distance) de l'encodeur gauche et celui de l'encodeur droit.
tr_tr: Robotun sahadaki konumunu güncellemek için ``update`` yöntemi kullanılabilir. Bu yöntem periyodik olarak, tercihen ``periodic()`` yönteminde :ref:`Subsystem <docs/software/commandbased/subsystems:Subsystems>` ile çağrılmalıdır. ``update`` yöntemi, robotun yeni güncellenmiş konumunu döndürür. Bu yöntem, sol kodlayıcı mesafesi ve sağ kodlayıcı mesafesi ile birlikte robotun cayro açısını alır.
zh_cn: ``update``方法可用于更新机器人在场地上的位置。该方法必须定期调用，最好是在:ref:`Subsystem <docs/software/commandbased/subsystems:Subsystems>`的``periodic()``方法中调用。``update``方法返回机器人新的更新姿势。该方法获取机器人的陀螺仪角度，以及左编码器距离和右编码器距离。

source: The encoder distances in Java must be in meters. In C++, the units library can be used to represent the distance using any linear distance unit. If the robot is moving forward in a straight line, **both** distances (left and right) must be positive.
es_mx: Las distancias del codificador en Java deben estar en metros. En C++, la biblioteca de unidades se puede usar para representar la distancia usando cualquier unidad de distancia lineal. Si el robot avanza en línea recta, **ambas** distancias (izquierda y derecha) deben ser positivas.
fr_ca: Les distances de l'encodeur en Java doivent être en mètres. En C++, la librairie d'unités peut être utilisée pour représenter la distance en utilisant n'importe quelle unité de distance linéaire. Si le robot avance en ligne droite, **les deux** distances (gauche et droite) doivent être positives. Faire les opérations mathématiques nécessaires pour y arriver.
tr_tr: Java'daki kodlayıcı mesafeleri metre cinsinden olmalıdır. C++ 'da, units kitaplığı, herhangi bir doğrusal uzaklık birimi kullanılarak mesafeyi temsil etmek için kullanılabilir. Robot düz bir çizgide ilerliyorsa, **her iki** mesafe (sol ve sağ) pozitif olmalıdır.
zh_cn: Java中的编码器距离必须以米为单位。在C++中，单位库可以使用任何线性距离单位来表示距离。如果机器人是直线前进，**两个**的距离（左和右）必须是正数。

source: Resetting the Robot Pose
es_mx: Restablecer la postura del robot
fr_ca: Réinitialisation de la pose de robot
tr_tr: Robot Duruşunu Sıfırlama
zh_cn: 重置机器人姿势

source: The robot pose can be reset via the ``resetPose`` method. This method accepts two arguments -- the new field-relative pose and the current gyro angle.
es_mx: La pose del robot se puede restablecer mediante el método ``resetPose``. Este método acepta dos argumentos: la nueva pose relativa al campo y el ángulo de giro actual.
fr_ca: La pose du robot peut être réinitialisée via la méthode ``resetPose``. Cette méthode accepte deux arguments - la nouvelle pose relative au terrain de jeu et l'angle gyroscopique actuel.
tr_tr: Robot konumu, ``resetPose`` yöntemiyle sıfırlanabilir. Bu yöntem iki bağımsız değişkeni kabul eder - yeni alana bağlı konum ve mevcut jiroskop açısı.
zh_cn: 机器人姿势可以通过``resetPose``方法重新设定。该方法接受两个参数 -- -- 新的相关场位和当前陀螺仪角度。

source: If at any time, you decide to reset your gyroscope, the ``resetPose`` method MUST be called with the new gyro angle. Furthermore, the encoders must also be reset to zero when resetting the pose.
es_mx: Si en algún momento, decide restablecer su giroscopio, se DEBE llamar al método ``resetPose`` con el nuevo ángulo de giro. Además, los codificadores también deben restablecerse a cero al restablecer la pose.
fr_ca: Si à tout moment, vous décidez de réinitialiser votre gyroscope, la méthode ``resetPose`` DOIT être appelée avec le nouvel angle gyroscopique. De plus, les encodeurs doivent également être remis à zéro lors de la réinitialisation de la pose.
tr_tr: Herhangi bir zamanda jiroskopunuzu sıfırlamaya karar verirseniz, yeni jiroskop açısıyla ``resetPose`` yöntemi ÇAĞIRILMALIDIR. Ayrıca konum sıfırlanırken kodlayıcılar da sıfırlanmalıdır.
zh_cn: 在任何时候如果您决定重置陀螺仪，则必须使用新的陀螺仪角度调用``resetPose``方法。此外，在复位姿势时，还必须将编码器复位为零。

source: A full example of a differential drive robot with odometry is available here: `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DifferentialDriveBot>`_ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/differentialdrivebot>`_.
es_mx: Un ejemplo completo de un robot de accionamiento diferencial con odometría está disponible aquí: `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DifferentialDriveBot>`_ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/differentialdrivebot>`_.
fr_ca: Un exemple complet d’un robot d’entraînement différentiel avec odométrie est disponible ici: `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DifferentialDriveBot>`_ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/differentialdrivebot>`_.
tr_tr: Odometriye sahip bir diferansiyel sürüş robotunun tam bir örneğini burada bulabilirsiniz: `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DifferentialDriveBot>` _ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/differentialdrivebot>` _.
zh_cn: 此处提供具有里程表的差动驱动机器人的完整示例：`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DifferentialDriveBot>`_ /`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/differentialdrivebot>`_。

source: In addition, the ``GetPose`` (C++) / ``getPoseMeters`` (Java) methods can be used to retrieve the current robot pose without an update.
es_mx: Además, los métodos ``GetPose`` (C ++) / ``getPoseMeters`` (Java) se pueden utilizar para recuperar la pose actual del robot sin una actualización.
fr_ca: De plus, les méthodes ``GetPose`` (C++) / ``getPoseMeters`` (Java) peuvent être utilisées pour récupérer la pose actuelle du robot sans mise à jour.
tr_tr: Ek olarak, mevcut robot pozunu güncelleme olmadan almak için ``GetPose`` (C ++) / ``getPoseMeters`` (Java) yöntemleri kullanılabilir.
zh_cn: 此外，可以使用GetPose（C ++）/ getPoseMeters（Java）方法来检索当前的机器人姿态，而无需进行更新。
