Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/kinematics-and-odometry/intro-and-chassis-speeds.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Introduction to Kinematics and The Chassis Speeds Class
es_mx: Introducción a la cinemática y la clase de velocidades del chasis
fr_ca: Introduction à la cinématique et à la classe Chassis Speeds
tr_tr: Kinematik ve Şasi Hızları Sınıfına Giriş
zh_cn: 运动学和底盘速度类简介

source: What is kinematics?
es_mx: ¿Qué es la cinemática?
fr_ca: Qu'est-ce que la cinématique?
tr_tr: Kinematik nedir?
zh_cn: 什么是运动学？

source: The brand new kinematics suite contains classes for differential drive, swerve drive, and mecanum drive kinematics and odometry. The kinematics classes help convert between a universal ``ChassisSpeeds`` object, containing linear and angular velocities for a robot to usable speeds for each individual type of drivetrain i.e. left and right wheel speeds for a differential drive, four wheel speeds for a mecanum drive, or individual module states (speed and angle) for a swerve drive.
es_mx: El nuevo conjunto de cinemática contiene clases de cinemática y odometría de accionamiento diferencial, accionamiento de viraje y accionamiento mecanum. Las clases de cinemática ayudan a convertir entre un objeto universal `` ChassisSpeeds '', que contiene velocidades lineales y angulares para un robot a velocidades utilizables para cada tipo individual de transmisión, es decir, velocidades de rueda izquierda y derecha para una transmisión diferencial, velocidades de cuatro ruedas para una transmisión mecanum , o estados de módulos individuales (velocidad y ángulo) para un cambio de dirección.
fr_ca: La toute nouvelle suite logicielle cinématique contient des classes pour la cinématique et l'odométrie pour des mécanismes avec entraînement différentiel, de type "à embardée" (Swerve) et Mécanum. Les classes cinématiques aident à convertir un objet universel ``ChassisSpeeds``, contenant des vitesses linéaires et angulaires en paramètres utilisables pour chaque type de transmission pré-citées. Dans le cas d'un entraînement différentiel, ce sont les vitesses de roue gauche et droite. Pour un entraînement par embardée, ce sont les paramètres d'angle et de vitesse pour chacune des 4 roues, et pour le Mécanum, ce sont les vitesses pour chacune des roues.
tr_tr: Yepyeni kinematik paketi, diferansiyel tahrik, dönüş tahriki ve mekânum tahrik kinematiği ve odometri için sınıfları içerir. Kinematik sınıfları, bir robot için doğrusal ve açısal hızları içeren evrensel bir ``ChassisSpeeds`` nesnesi arasında, her bir aktarma organı türü için kullanılabilir hızlara, yani diferansiyel tahrik için sol ve sağ tekerlek hızlarına, bir mecanum sürücü için dört tekerlek hızına dönüştürülmesine yardımcı olur veya bir swerve sürücü için ayrı modül durumlarıne yardımcı olur (hız ve açı).
zh_cn: 全新的运动学套件包含了差速驱动、转向驱动和麦轮驱动运动学和测距法。运动学类有助于将包含机器人线性和角速度的通用 "ChassisSpeeds "对象转换为每个单独类型的传动系统的可用速度，即差速驱动的左轮和右轮速度，麦轮驱动的四轮速度，或转向驱动的单个模块状态（速度和角度）。

source: What is odometry?
es_mx: ¿Qué es la odometría?
fr_ca: Qu'est-ce que l'odométrie?
tr_tr: Odometri nedir?
zh_cn: 什么是测距法？

source: Odometry involves using sensors on the robot to create an estimate of the position of the robot on the field. In FRC, these sensors are typically several encoders (the exact number depends on the drive type) and a gyroscope to measure robot angle. The odometry classes utilize the kinematics classes along with periodic user inputs about speeds (and angles in the case of swerve) to create an estimate of the robot's location on the field.
es_mx: La odometría implica el uso de sensores en el robot para crear una estimación de la posición del robot en el campo. En FRC, estos sensores suelen ser varios codificadores (el número exacto depende del tipo de unidad) y un giroscopio para medir el ángulo del robot. Las clases de odometría utilizan las clases de cinemática junto con las entradas periódicas del usuario sobre velocidades (y ángulos en el caso de viraje) para crear una estimación de la ubicación del robot en el campo.
fr_ca: L'odométrie consiste à utiliser des capteurs sur le robot pour créer une estimation de la position du robot sur le terrain de jeu. En FRC, ces capteurs sont généralement composés de plusieurs encodeurs (le nombre exact dépend du type d'entraînement) et d'un gyroscope pour mesurer l'angle du robot. Les classes d'odométrie utilisent les classes cinématiques ainsi que les entrées périodiques de l'utilisateur sur les vitesses (et les angles en cas de déviation) pour créer une estimation de l'emplacement du robot sur le terrain.
tr_tr: Odometri, robotun sahadaki konumunun bir tahminini oluşturmak için robot üzerindeki sensörlerin kullanılmasını içerir. FRC'de bu sensörler tipik olarak birkaç kodlayıcıdır (tam sayı sürücü tipine bağlıdır) ve robot açısını ölçmek için bir jiroskoptur. Odometri sınıfları, robotun sahadaki konumunun bir tahminini oluşturmak için hızlarla (ve sapma durumunda açılar) ilgili periyodik kullanıcı girdileriyle birlikte kinematik sınıflarını kullanır.
zh_cn: 测距法涉及使用机器人上的传感器来估计机器人在场上的位置。在FRC中，这些传感器通常是几个编码器（具体数量取决于驱动类型）和一个陀螺仪来测量机器人的角度。运动学类利用运动学类和用户定期输入的速度（和转弯时的角度）来估计机器人在场上的位置。

source: The Chassis Speeds Class
es_mx: La clase de velocidades de chasis
fr_ca: La classe Chassis Speeds
tr_tr: The Chassis Speeds Sınıfları
zh_cn: 底盘速度类

source: The ``ChassisSpeeds`` object is essential to the new WPILib kinematics and odometry suite. The ``ChassisSpeeds`` object represents the speeds of a robot chassis. This struct has three components:
es_mx: El objeto ``ChassisSpeeds`` es esencial para la nueva suite de cinemática y odometría de WPILib. El objeto ``ChassisSpeeds`` representa las velocidades de un chasis de robot. Esta estructura tiene tres componentes:
fr_ca: L'objet ``ChassisSpeeds`` est essentiel à la nouvelle suite cinématique et odométrique WPILib. L'objet ``ChassisSpeeds`` représente les vitesses d'un châssis de robot. Cette structure a trois composants:
tr_tr: ``ChassisSpeeds`` nesnesi, yeni WPILib kinematik ve odometri takımı için çok önemlidir. ``ChassisSpeeds`` nesnesi, bir robot kasasının hızlarını temsil eder. Bu yapının üç bileşeni vardır:
zh_cn: ``ChassisSpeeds``对象对新的WPILib运动学和里程测量套件至关重要。``ChassisSpeeds``对象表示机器人底盘的速度。该结构有三个组成部分：

source: ``vx``: The velocity of the robot in the x (forward) direction.
es_mx: ``vx``: la velocidad del robot en la dirección x (hacia adelante).
fr_ca: ``vx``: La vitesse du robot dans la direction x (avant).
tr_tr: `` vx`` : Robotun x (ileri) yönündeki hızı.
zh_cn: ``vx``：机器人在x(前进)方向的速度。

source: ``vy``: The velocity of the robot in the y (sideways) direction. (Positive values mean the robot is moving to the left).
es_mx: ``vy``: la velocidad del robot en la dirección y (lateral). (Los valores positivos significan que el robot se mueve hacia la izquierda).
fr_ca: ``vy``: La vitesse du robot dans la direction y (latérale). (Les valeurs positives signifient que le robot se déplace vers la gauche).
tr_tr: ``vy`` : Robotun y (yana doğru) yönündeki hızı. (Pozitif değerler, robotun sola hareket ettiği anlamına gelir).
zh_cn: ``vy``：机器人在y（横向）方向的速度。(正值表示机器人向左移动)。

source: ``omega``: The angular velocity of the robot in radians per second.
es_mx: ``omega``: la velocidad angular del robot en radianes por segundo.
fr_ca: ``omega``: La vitesse angulaire du robot en radians par seconde.
tr_tr: ``omega`` : Robotun saniyede radyan cinsinden açısal hızı.
zh_cn: ``omega``：机器人的角速度，单位为每秒弧度。

source: A non-holonomic drivetrain (i.e. a drivetrain that cannot move sideways, ex: a differential drive) will have a ``vy`` component of zero because of its inability to move sideways.
es_mx: Un tren motriz no holonómico (es decir, un tren motriz que no se puede mover hacia los lados, por ejemplo, un accionamiento diferencial) tendrá un componente ``vy`` de cero debido a su incapacidad para moverse hacia los lados.
fr_ca: Une transmission non holonomique (c'est-à-dire une transmission qui ne peut pas se déplacer latéralement, ex: un entraînement différentiel) aura une composante ``vy`` de zéro en raison de son incapacité à se déplacer latéralement.
tr_tr: Holonomik olmayan bir aktarma organı (yani, yana doğru hareket edemeyen bir aktarma organı, örneğin bir diferansiyel tahrik), yanlara doğru hareket edememesi nedeniyle sıfır ``vy`` bileşenine sahip olacaktır.
zh_cn: 非整体性传动系统(即不能横向移动的传动系统，例如：差速驱动)由于不能横向移动，其 "vy "分量为零。

source: Constructing a ChassisSpeeds object
es_mx: Construcción de un objeto ChassisSpeeds
fr_ca: Construction d'un objet ChassisSpeeds
tr_tr: ChassisSpeeds nesnesi oluşturma
zh_cn: 构造一个ChassisSpeeds对象

source: The constructor for the ``ChassisSpeeds`` object is very straightforward, accepting three arguments for ``vx``, ``vy``, and ``omega``. In Java, ``vx`` and ``vy`` must be in meters per second. In C++, the units library may be used to provide a linear velocity using any linear velocity unit.
es_mx: El constructor del objeto ``ChassisSpeeds`` es muy sencillo y acepta tres argumentos para ``vx``, ``vy`` y `` omega``. En Java, ``vx`` y ``vy`` deben expresarse en metros por segundo. En C++, la biblioteca de unidades puede usarse para proporcionar una velocidad lineal usando cualquier unidad de velocidad lineal.
fr_ca: Le constructeur de l'objet ``ChassisSpeeds`` est très simple, acceptant trois arguments pour ``vx``, ``vy``, et ``omega``. En Java, ``vx`` et ``vy`` doivent être en mètres par seconde. En C++, la librairie d'unités peut être utilisée pour fournir une vitesse linéaire en utilisant n'importe quelle unité de vitesse linéaire.
tr_tr: ``ChassisSpeeds`` nesnesinin kurucusu çok basittir ve ``vx``, ``vy`` ve ``omega`` için üç argüman kabul eder. Java'da, ``vx``' ve ``vy`` saniyede metre cinsinden olmalıdır. C++ 'da, birimler kitaplığı herhangi bir doğrusal hız birimi kullanılarak doğrusal bir hız sağlamak için kullanılabilir.
zh_cn: ``ChassisSpeeds``对象的构造函数非常简单，接受三个参数``vx``、``vy``和``omega``。在Java中，``vx``和``vy``必须以米/秒为单位。在C++中，单位库可用于提供使用任何线性速度单位的线性速度。

source: Creating a ChassisSpeeds Object from Field-Relative Speeds
es_mx: Creación de un objeto ChassisSpeeds a partir de velocidades relativas al campo
fr_ca: Création d'un objet ChassisSpeeds à partir de vitesses relatives au terrain de jeu
tr_tr: Saha-bağıl hızlardan ChassisSpeeds Nesnesi Oluşturma
zh_cn: 从相对场地速度创建ChassisSpeeds对象

source: A ``ChassisSpeeds`` object can also be created from a set of field-relative speeds when the robot angle is given. This converts a set of desired velocities relative to the field (for example, toward the opposite alliance station and toward the right field boundary) to a ``ChassisSpeeds`` object which represents speeds that are relative to the robot frame. This is useful for implementing field-oriented controls for a swerve or mecanum drive robot.
es_mx: También se puede crear un objeto ``ChassisSpeeds`` a partir de un conjunto de velocidades relativas al campo cuando se proporciona el ángulo del robot. Esto convierte un conjunto de velocidades deseadas relativas al campo (por ejemplo, hacia la estación de alianza opuesta y hacia el límite del campo derecho) en un objeto ``ChassisSpeeds`` que representa velocidades relativas al marco del robot. Esto es útil para implementar controles orientados al campo para un robot de accionamiento giratorio o mecanum.
fr_ca: Un objet ``ChassisSpeeds`` peut également être créé à partir d'un ensemble de vitesses relatives au terrain lorsque l'angle du robot est connu. L'objet utilise un ensemble de vitesses souhaitées par rapport au terrain (par exemple, vers la station d'alliance opposée, à droite sur le terrain) et calcule et génère un objet ``ChassisSpeeds`` qui représente des vitesses relatives au châssis du robot. Ceci est utile pour mettre en œuvre des contrôles orientés sur le terrain pour un robot avec un mécanisme de type "à embardée" ou Mécanum.
tr_tr: Robot açısı verildiğinde, bir dizi alana bağlı hızdan bir ``ChassisSpeeds`` nesnesi de oluşturulabilir. Bu, alana göre bir dizi istenen hızı (örneğin, karşı ittifak istasyonuna doğru ve sağ alan sınırına doğru) robot çerçevesine göre hızları temsil eden bir ``ChassisSpeeds`` nesnesine dönüştürür. Bu, bir sapma veya mecanum tahrik robotu için saha odaklı kontrolleri uygulamak için kullanışlıdır.
zh_cn: 当机器人角度给定时，还可以用一组场内相对速度创建一个``底盘速度``对象。这将一组相对于场域的期望速度（例如，朝向对面联盟站和朝向右场边界）转换为``ChassisSpeeds``对象，它表示相对于机器人框架的速度。这对于实现面向场地的控制，对转向或麦轮驱动机器人是有用的。

source: The static ``ChassisSpeeds.fromFieldRelativeSpeeds`` (Java) / ``ChassisSpeeds::FromFieldRelativeSpeeds`` (C++) method can be used to generate the ``ChassisSpeeds`` object from field-relative speeds. This method accepts the ``vx`` (relative to the field), ``vy`` (relative to the field), ``omega``, and the robot angle.
es_mx: El método estático ``ChassisSpeeds.fromFieldRelativeSpeeds`` (Java) / ``ChassisSpeeds::FromFieldRelativeSpeeds`` (C ++) se puede utilizar para generar el objeto ``ChassisSpeeds`` a partir de velocidades relativas al campo. Este método acepta ``vx`` (relativo al campo), ``vy`` (relativo al campo), ``omega`` y el ángulo del robot.
fr_ca: La méthode statique ``ChassisSpeeds.fromFieldRelativeSpeeds`` (Java) / ``ChassisSpeeds::FromFieldRelativeSpeeds`` (C++) peut être utilisée pour générer l'objet ``ChassisSpeeds`` à partir de vitesses relatives au terrain. Cette méthode accepte les ``vx`` (par rapport au terrain), ``vy`` (par rapport au terrain), ``omega`` et l'angle du robot.
tr_tr: Statik ``ChassisSpeeds.fromFieldRelativeSpeeds`` (Java) / ``ChassisSpeeds::FromFieldRelativeSpeeds`` (C++) yöntemi, saha-bağıl hızlardan ``ChassisSpeeds`` nesnesini oluşturmak için kullanılabilir. Bu yöntem, ``vx`` (sahaya göre), ``vy`` (sahaya göre), ``omega`` ve robot açısını kabul eder.
zh_cn: 静态的``ChassisSpeeds.fromFieldRelativeSpeeds``(Java)/``ChassisSpeeds::FromFieldRelativeSpeeds``(C++)方法可用于从场相对速度生成``ChassisSpeeds``对象。该方法接受``vx``（相对于场）、``vy``（相对于场）、``omega``和机器人角度。

source: The angular velocity is not explicitly stated to be "relative to the field" because the angular velocity is the same as measured from a field perspective or a robot perspective.
es_mx: No se establece explícitamente que la velocidad angular sea "relativa al campo" porque la velocidad angular es la misma que se mide desde una perspectiva de campo o una perspectiva de robot.
fr_ca: La vitesse angulaire n'est pas explicitement indiquée comme étant "relative au terrain" car la vitesse angulaire est la même que celle mesurée du point de vue du terrain ou du robot.
tr_tr: Açısal hız, açık bir şekilde "sahaya göre" olarak belirtilmemiştir çünkü açısal hız, bir alan perspektifinden veya bir robot perspektifinden ölçülen ile aynıdır.
zh_cn: 角速度没有明确说是 "相对于场"，因为从场角度或机器人角度测量的角速度是一样的。
