Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/kinematics-and-odometry/mecanum-drive-odometry.po
Languages: es_mx, fr_ca, tr_tr

source: Mecanum Drive Odometry
es_mx: Odometría Mecanum Drive
fr_ca: Odométrie avec l'entraînement de type Mécanum
tr_tr: Mecanum Sürüş Odometrisi

source: A user can use the mecanum drive kinematics classes in order to perform :ref:`odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`. WPILib contains a ``MecanumDriveOdometry`` class that can be used to track the position of a mecanum drive robot on the field.
es_mx: Un usuario puede utilizar las clases de cinemática de la unidad mecanum para realizar :ref:`odometría <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`. WPILib contiene una clase ``MecanumDriveOdometry`` que se puede utilizar para rastrear la posición de un robot de accionamiento mecanum en el campo.
fr_ca: Un utilisateur peut utiliser les classes de cinématique d'entraînement de Mecanum afin d'effectuer l' :ref:`Odométrie <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`. WPILib contient une classe ``MecanumDriveOdometry`` qui peut être utilisée pour suivre la position d'un robot avec entraînement Mécanum sur le terrain de jeu.
tr_tr: Bir kullanıcı, aşağıdakileri gerçekleştirmek için mecanum drive kinematics - mecanum sürücü kinematik sınıflarını kullanabilir :ref:`odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`. WPILib, sahada bir mecanum tahrik robotunun konumunu izlemek için kullanılabilecek bir ``MecanumDriveOdometry`` sınıfı içerir.

source: Because this method only uses encoders and a gyro, the estimate of the robot's position on the field will drift over time, especially as your robot comes into contact with other robots during gameplay. However, odometry is usually very accurate during the autonomous period.
es_mx: Debido a que este método solo usa codificadores y un giróscopo, la estimación de la posición del robot en el campo variará con el tiempo, especialmente cuando tu robot entre en contacto con otros robots durante el juego. Sin embargo, la odometría suele ser muy precisa durante el período autónomo.
fr_ca: Étant donné que cette méthode n'utilise que des encodeurs et un gyroscope, l'estimation de la position du robot sur le terrain de jeu dérivera avec le temps, d'autant plus que votre robot va entrer en contact avec des objets ou d'autres robots pendant le jeu. Cependant, l'odométrie est généralement très précise pendant la période autonome.
tr_tr: Bu yöntemde yalnızca kodlayıcılar ve bir jiroskop kullanıldığı için, robotun sahadaki konumunun tahmini, özellikle oyun sırasında diğer robotlarla temas kurduğunda zamanla kayacaktır. Bununla birlikte, odometri genellikle bağımsız dönemde çok doğrudur.

source: Creating the odometry object
es_mx: Creando el objeto de odometría
fr_ca: Création de l'objet odométrie
tr_tr: Odometri nesnesini oluşturma

source: The ``MecanumDriveOdometry`` class requires two mandatory arguments and one optional argument. The mandatory arguments are the kinematics object that represents your mecanum drive (in the form of a ``MecanumDriveKinematics`` class) and the angle reported by your gyroscope (as a Rotation2d). The third optional argument is the starting pose of your robot on the field (as a ``Pose2d``). By default, the robot will start at ``x = 0, y = 0, theta = 0``.
es_mx: La clase ``MecanumDriveOdometry`` requiere dos argumentos obligatorios y un argumento opcional. Los argumentos obligatorios son el objeto cinemático que representa su chasis mecanum (en forma de una clase ``MecanumDriveKinematics``) y el ángulo informado por su giroscopio (como un Rotation2d). El tercer argumento opcional es la pose inicial de su robot en el campo (como una ``Pose2d``). De forma predeterminada, el robot comenzará en ``x = 0, y = 0, theta = 0``.
fr_ca: La classe ``MecanumDriveOdometry`` nécessite deux arguments obligatoires et un argument facultatif. Les arguments obligatoires sont l'objet cinématique qui représente votre entraînement de mécanisme (sous la forme d'une classe ``MecanumDriveKinematics``) et l'angle rapporté par votre gyroscope (en tant que Rotation2d). Le troisième argument optionnel est la pose de départ de votre robot sur le terrain (comme un ``Pose2d``). Par défaut, le robot démarre à ``x = 0, y = 0, theta = 0``.
tr_tr: ``MecanumDriveOdometry`` sınıfı, iki zorunlu bağımsız değişken ve bir isteğe bağlı bağımsız değişken gerektirir. Zorunlu argümanlar, mecanum sürücünüzü (bir ``MecanumDriveKinematics`` sınıfı biçiminde) ve jiroskopunuz tarafından bildirilen açı (Rotation2d olarak) temsil eden kinematik nesnesidir. Üçüncü isteğe bağlı argüman, robotunuzun sahadaki başlangıç pozudur (``Pose2d`` olarak). Varsayılan olarak, robot ` x = 0, y = 0, theta = 0`` ile başlayacaktır.

source: 0 degrees / radians represents the robot angle when the robot is facing directly toward your opponent's alliance station. As your robot turns to the left, your gyroscope angle should increase. By default, WPILib gyros exhibit the opposite behavior, so you should negate the gyro angle.
es_mx: 0 grados / radianes representa el ángulo del robot cuando el robot está mirando directamente hacia la estación de alianza de tu oponente. A medida que su robot gira hacia la izquierda, el ángulo de su giroscopio debería aumentar. Por defecto, los giroscopios WPILib exhiben el comportamiento opuesto, por lo que debe negar el ángulo del giroscopio.
fr_ca: 0 degrés / radians représente l'angle du robot lorsque le robot fait face directement à la station d'alliance de votre adversaire. Lorsque votre robot se tourne vers la gauche, l'angle de votre gyroscope devrait augmenter. Par défaut, les gyroscopes WPILib présentent le comportement opposé, vous devez donc compenser l’angle du gyroscope en le convertissant en une valeur négative (nouvel angle = 0 - angle gyro)..
tr_tr: 0 derece / radyan, robot doğrudan rakibinizin ittifak istasyonuna bakarken robot açısını temsil eder. Robotunuz sola döndükçe jiroskop açınız artmalıdır. Varsayılan olarak, WPILib jiroskopları zıt davranış sergiler, bu nedenle jiroskop açısını geçersiz kılmalısınız.

source: Updating the robot pose
es_mx: Actualizar la pose del robot
fr_ca: Mise à jour de la pose du robot
tr_tr: Robot duruşunu güncelleme

source: The ``update`` method of the odometry class updates the robot position on the field. The update method takes in the gyro angle of the robot, along with a ``MecanumDriveWheelSpeeds`` object representing the speed of each of the 4 wheels on the robot. This ``update`` method must be called periodically, preferably in the ``periodic()`` method of a :ref:`Subsystem <docs/software/commandbased/subsystems:Subsystems>`. The ``update`` method returns the new updated pose of the robot.
es_mx: El método ``update`` de la clase de odometría actualiza la posición del robot en el campo. El método de actualización toma el ángulo de giro del robot, junto con un objeto ``MecanumDriveWheelSpeeds`` que representa la velocidad de cada una de las 4 ruedas del robot. Este método de ``update`` debe ser llamado periódicamente, preferiblemente en el método ``periodic()`` de a :ref:`Subsystem <docs/software/commandbased/subsystems:Subsystems>`. El método de ``update`` devuelve la nueva pose actualizada del robot.
fr_ca: La méthode ``update`` de la classe d'odométrie met à jour la position du robot sur le terrain. La méthode de mise à jour prend en compte l'angle gyroscopique du robot, ainsi qu'un objet ``MecanumDriveWheelSpeeds`` représentant la vitesse de chacune des 4 roues du robot. Cette méthode ``update`` doit être appelée périodiquement, de préférence dans la méthode ``periodic()`` du :ref:`Sous-système <docs/software/commandbased/subsystems:Subsystems>`. La méthode ``update`` renvoie la nouvelle pose mise à jour du robot.
tr_tr: Odometri sınıfının ``güncelleme`` yöntemi, robotun sahadaki konumunu günceller. Güncelleme yöntemi, robot üzerindeki 4 tekerleğin her birinin hızını temsil eden bir ``MecanumDriveWheelSpeeds`` nesnesi ile birlikte robotun cayro açısını alır. Bu ``update`` yöntemi periyodik olarak, tercihen ``periodic()`` yönteminde :ref:`Subsystem <docs/software/commandbased/subsystems:Subsystems>` ile çağrılmalıdır. ``Güncelleme`` yöntemi, robotun yeni güncellenmiş pozunu döndürür.

source: The ``MecanumDriveWheelSpeeds`` class in Java must be constructed with each wheel speed in meters per second. In C++, the units library must be used to represent your wheel speeds.
es_mx: La clase ``MecanumDriveWheelSpeeds`` en Java debe construirse con la velocidad de cada rueda en metros por segundo. En C++, la biblioteca de unidades debe usarse para representar las velocidades de las ruedas.
fr_ca: La classe ``MecanumDriveWheelSpeeds`` en Java doit être construite avec chaque vitesse de roue en mètres par seconde. En C++, la librairie d'unités doit être utilisée pour représenter la vitesse de vos roues.
tr_tr: Java'daki ``MecanumDriveWheelSpeeds`` sınıfı, saniyede metre cinsinden her tekerlek hızından oluşturulmalıdır. C++ 'da, unit-birim kitaplığı tekerlek hızlarınızı temsil etmek için kullanılmalıdır.

source: Resetting the Robot Pose
es_mx: Restablecer la postura del robot
fr_ca: Réinitialisation de la pose de robot
tr_tr: Robot Duruşunu Sıfırlama

source: The robot pose can be reset via the ``resetPose`` method. This method accepts two arguments -- the new field-relative pose and the current gyro angle.
es_mx: La pose del robot se puede restablecer mediante el método ``resetPose``. Este método acepta dos argumentos: la nueva pose relativa al campo y el ángulo de giro actual.
fr_ca: La pose du robot peut être réinitialisée via la méthode ``resetPose``. Cette méthode accepte deux arguments - la nouvelle pose relative au terrain et l'angle gyroscopique actuel.
tr_tr: Robot duruşu, ``resetPose`` yöntemiyle sıfırlanabilir. Bu yöntem iki argümanı kabul eder - yeni sahaya bağlı poz ve mevcut jiroskop açısı.

source: If at any time, you decide to reset your gyroscope, the ``resetPose`` method MUST be called with the new gyro angle.
es_mx: Si en algún momento, decide restablecer su giroscopio, se DEBE llamar al método ``resetPose`` con el nuevo ángulo de giro.
fr_ca: Si à tout moment, vous décidez de réinitialiser votre gyroscope, la méthode ``resetPose`` DOIT être appelée avec le nouvel angle gyroscopique.
tr_tr: Herhangi bir zamanda jiroskopunuzu sıfırlamaya karar verirseniz, yeni jiroskop açısı ile ``resetPose`` yöntemi ÇAĞIRILMALIDIR.

source: A full example of a mecanum drive robot with odometry is available here: `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumBot>`_ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumbot>`_.
es_mx: Un ejemplo completo de un mecanum drive con odometría está disponible aquí: `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumBot>`_ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumbot>`_.
fr_ca: Un exemple complet d'un robot à entraînement mécanique avec odométrie est disponible ici: `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumBot>`_ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumbot>`_.
tr_tr: Odometriye sahip bir mecanum sürücü robotunun tam bir örneğini burada bulabilirsiniz: `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/MecanumBot>` _ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/mecanumbot>` _.

source: In addition, the ``GetPose`` (C++) / ``getPoseMeters`` (Java) methods can be used to retrieve the current robot pose without an update.
es_mx: Además, los métodos ``GetPose`` (C++) / ``getPoseMeters`` (Java) se pueden utilizar para recuperar la pose actual del robot sin una actualización.
fr_ca: De plus, les méthodes ``GetPose`` (C++) / ``getPoseMeters`` (Java) peuvent être utilisées pour récupérer la pose actuelle du robot sans mise à jour.
tr_tr: Ek olarak, mevcut robot pozunu güncelleme olmadan almak için ``GetPose`` (C++) / ``getPoseMeters`` (Java) yöntemleri kullanılabilir.
