Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/kinematics-and-odometry/mecanum-drive-kinematics.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Mecanum Drive Kinematics
es_mx: Cinemática de accionamiento Mecanum
fr_ca: La cinématique de l'entraînement Mécanum
tr_tr: Mecanum Drive Kinematik
zh_cn: 麦克纳姆驱动运动学

source: The ``MecanumDriveKinematics`` class is a useful tool that converts between a ``ChassisSpeeds`` object and a ``MecanumDriveWheelSpeeds`` object, which contains velocities for each of the four wheels on a mecanum drive.
es_mx: La clase ``MecanumDriveKinematics`` es una herramienta útil que convierte entre un objeto ``ChassisSpeeds`` y un objeto ``MecanumDriveWheelSpeeds``, que contiene las velocidades de cada una de las cuatro ruedas de un mecanismo mecanum.
fr_ca: La classe ``MecanumDriveKinematics`` est un outil utile qui convertit entre un objet ``ChassisSpeeds`` et un objet ``MecanumDriveWheelSpeeds`` , qui contient les vitesses pour chacune des quatre roues sur un entraînement mécanique.
tr_tr: ``MecanumDriveKinematics`` sınıfı, bir ``ChassisSpeeds`` nesnesi ile bir mecanum sürücüsündeki dört tekerleğin her biri için hızları içeren bir ``MecanumDriveWheelSpeeds`` nesnesi arasında dönüşüm sağlayan kullanışlı bir araçtır.
zh_cn: ``MecanumDriveKinematics``类是一个有用的工具，它可以在``ChassisSpeeds``对象和``MecanumDriveWheelSpeeds``对象之间进行转换，后者包含了麦克纳姆轮驱动器上四个车轮的速度。

source: Constructing the Kinematics Object
es_mx: Construyendo el objeto cinemático
fr_ca: Construction de l'objet cinématique
tr_tr: Kinematik Nesnesinin Oluşturulması
zh_cn: 构造运动学对象

source: The ``MecanumDriveKinematics`` class accepts four constructor arguments, with each argument being the location of a wheel relative to the robot center (as a ``Translation2d``). The order for the arguments is front left, front right, back left, and back right. The locations for the wheels must be relative to the center of the robot. Positive x values represent moving toward the front of the robot whereas positive y values represent moving toward the left of the robot.
es_mx: La clase ``MecanumDriveKinematics`` acepta cuatro argumentos de constructor, y cada argumento es la ubicación de una rueda en relación con el centro del robot (como un ``Translation2d``). El orden de los argumentos es frontal izquierdo, frontal derecho, posterior izquierdo y posterior derecho. Las ubicaciones de las ruedas deben ser relativas al centro del robot. Los valores x positivos representan un movimiento hacia la parte delantera del robot, mientras que los valores y positivos representan un movimiento hacia la izquierda del robot.
fr_ca: La classe ``MecanumDriveKinematics`` accepte quatre arguments de constructeur, chaque argument étant l'emplacement d'une roue par rapport au centre du robot (en tant que ``Translation2d``). L'ordre des arguments est avant gauche, avant droit, arrière gauche et arrière droit. L'emplacement des roues doit être relatif au centre du robot. Les valeurs x positives représentent le déplacement vers l'avant du robot tandis que les valeurs y positives représentent le déplacement vers la gauche du robot.
tr_tr: ``MecanumDriveKinematics`` sınıfı dört constructor argümanı kabul eder, her argüman robot merkezine göre bir tekerleğin konumu olur (``Translation2d`` olarak). Argümanların sırası sol ön, sağ ön, sol arka ve sağ arka şeklindedir. Tekerleklerin yerleri, robotun merkezine göre olmalıdır. Pozitif x değerleri robotun önüne doğru hareket etmeyi temsil ederken, pozitif y değerleri robotun soluna doğru hareket etmeyi temsil eder.
zh_cn: ``MecanumDriveKinematics``类接受四个构造函数参数，每个参数是相对于机器人中心的轮子的位置（作为``Translation2d``）。参数的顺序是前左，前右，后左，后右。轮子的位置必须相对于机器人的中心。正的x值代表向机器人前面移动，正的y值代表向机器人左边移动。

source: Converting Chassis Speeds to Wheel Speeds
es_mx: Conversión de velocidades del chasis a velocidades de las ruedas
fr_ca: Conversion des vitesses du châssis en vitesses de roue
tr_tr: Şasi Hızlarını Tekerlek Hızlarına Dönüştürme
zh_cn: 将底盘速度转换为车轮速度

source: The ``toWheelSpeeds(ChassisSpeeds speeds)`` (Java) / ``ToWheelSpeeds(ChassisSpeeds speeds)`` (C++) method should be used to convert a ``ChassisSpeeds`` object to a ``MecanumDriveWheelSpeeds`` object. This is useful in situations where you have to convert a forward velocity, sideways velocity, and an angular velocity into individual wheel speeds.
es_mx: El método ``toWheelSpeeds(ChassisSpeeds speeds)`` (Java) / ``ToWheelSpeeds(ChassisSpeeds speeds)`` (C++) debe usarse para convertir un objeto ``ChassisSpeeds`` en un objeto ``MecanumDriveWheelSpeeds``. Esto es útil en situaciones en las que tiene que convertir una velocidad de avance, una velocidad lateral y una velocidad angular en velocidades de rueda individuales.
fr_ca: La méthode ``toWheelSpeeds(ChassisSpeeds speeds)`` (Java) / ``ToWheelSpeeds(ChassisSpeeds speeds)`` (C++) doit être utilisée pour convertir un objet ``ChassisSpeeds`` en un objet ``MecanumDriveWheelSpeeds``. Ceci est utile dans les situations où vous devez convertir une vitesse avant, une vitesse latérale et une vitesse angulaire en vitesses de roue individuelles.
tr_tr: Bir ``ChassisSpeeds`` nesnesini ``MecanumDriveWheelSpeeds`` nesnesine dönüştürmek için ``toWheelSpeeds(ChassisSpeeds speeds)`` (Java) / ``ToWheelSpeeds(ChassisSpeeds speeds)`` (C++) yöntemi kullanılmalıdır. Bu, ileri hız, yan hız ve açısal hızı ayrı tekerlek hızlarına dönüştürmeniz gereken durumlarda kullanışlıdır.
zh_cn: ``toWheelSpeeds(ChassisSpeeds speeds)``(Java)/``ToWheelSpeeds(ChassisSpeeds speeds)``(C++)方法应该用于将``ChassisSpeeds``对象转换为``MecanumDriveWheelSpeeds``对象。当你需要将前进速度、侧向速度和角速度转换为单个车轮速度时，这个方法很有用。

source: Field-oriented drive
es_mx: Accionamiento orientado al campo
fr_ca: Entraînement orienté terrain
tr_tr: Field-oriented / Saha-odaklı sürüş
zh_cn: 定向驱动

source: :ref:`Recall <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:Creating a ChassisSpeeds object from field-relative speeds>` that a ``ChassisSpeeds`` object can be created from a set of desired field-oriented speeds. This feature can be used to get wheel speeds from a set of desired field-oriented speeds.
es_mx: :ref:`Recall <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:Creating a ChassisSpeeds object from field-relative speeds>` que un objeto ``ChassisSpeeds`` se puede crear a partir de un conjunto de velocidades deseadas orientadas al campo. Esta función se puede utilizar para obtener velocidades de rueda a partir de un conjunto de velocidades deseadas orientadas al campo.
fr_ca: :ref:`Recall <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:Creating a ChassisSpeeds object from field-relative speeds>` qu'un objet ``ChassisSpeeds`` peut être créé à partir d'un ensemble de vitesses orientées en fonction du terrain de jeu. Cette fonction peut être utilisée également pour obtenir les vitesses de roue à partir du même ensemble (de vitesses orientées en fonction du terrain de jeu).
tr_tr: :ref:`Recall <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:Creating a ChassisSpeeds object from field-relative speeds>` bir ``ChassisSpeeds`` nesnesinin istenen saha odaklı hızlardan oluşturulabileceğini hatırlayın. Bu özellik, istenen saha odaklı hızlardan tekerlek hızları elde etmek için kullanılabilir.
zh_cn: :ref:`Recall <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:Creating a ChassisSpeeds object from field-relative speeds>```ChassisSpeeds``对象可以从一组所需的场向速度中创建。这个功能可以用来从一组期望的场向速度中获得轮速。

source: Using custom centers of rotation
es_mx: Usar centros de rotación personalizados
fr_ca: Utilisation de centres de rotation personnalisés
tr_tr: Özel döndürme merkezlerini kullanma
zh_cn: 使用自定义旋转中心

source: Sometimes, rotating around one specific corner might be desirable for certain evasive maneuvers. This type of behavior is also supported by the WPILib classes. The same ``ToWheelSpeeds()`` method accepts a second parameter for the center of rotation (as a ``Translation2d``). Just like the wheel locations, the ``Translation2d`` representing the center of rotation should be relative to the robot center.
es_mx: A veces, girar alrededor de una esquina específica puede ser deseable para ciertas maniobras evasivas. Este tipo de comportamiento también es compatible con las clases WPILib. El mismo método ``ToWheelSpeeds()`` acepta un segundo parámetro para el centro de rotación (como un ``Translation2d``). Al igual que las ubicaciones de las ruedas, la ``Translation2d`` que representa el centro de rotación debe ser relativa al centro del robot.
fr_ca: Parfois, la rotation autour d'un point spécifique peut être souhaitable pour que le robot puisse éviter un obstacle. Cette manoeuvre est également prise en charge par les classes WPILib. La même méthode ``ToWheelSpeeds()`` accepte un deuxième paramètre pour le centre de rotation (comme un ``Translation2d``). Tout comme les emplacements des roues, le ``Translation2d`` qui correspond au centre de rotation doit être défini par rapport au centre du robot.
tr_tr: Bazen, belirli bir kaçamak manevraları için belirli bir köşenin etrafında dönmek istenebilir. Bu tür davranış, WPILib sınıfları tarafından da desteklenir. Aynı ``ToWheelSpeeds()'' yöntemi, dönüş merkezi için ikinci bir parametre kabul eder (``Translation2d`` olarak). Tıpkı tekerlek konumları gibi, dönme merkezini temsil eden ``Translation2d`` de robot merkezine göre olmalıdır.
zh_cn: 有时，对于某些规避操作，可能需要绕一个特定的角旋转。 WPILib也支持这种类型的行为。相同的ToWheelSpeeds（）方法接受旋转中心的第二个参数（作为Translation2d）。就像轮子的位置一样，代表旋转中心的``Translation2d''应该相对于机器人中心。

source: Because all robots are a rigid frame, the provided ``vx`` and ``vy`` velocities from the ``ChassisSpeeds`` object will still apply for the entirety of the robot. However, the ``omega`` from the ``ChassisSpeeds`` object will be measured from the center of rotation.
es_mx: Debido a que todos los robots son un marco rígido, las velocidades ``vx`` y ``vy`` proporcionadas del objeto ``ChassisSpeeds`` aún se aplicarán a la totalidad del robot. Sin embargo, el ``omega`` del objeto ``ChassisSpeeds`` se medirá desde el centro de rotación.
fr_ca: Étant donné que tous les robots ont un châssis rigide, les vitesses ``vx`` et ``vy`` fournies par l'objet ``ChassisSpeeds`` s'appliqueront toujours à l'intégralité du robot. Cependant, ``omega``de l'objet ``ChassisSpeeds`` sera mesuré à partir du centre de rotation.
tr_tr: Tüm robotlar sabit bir çerçeve olduğundan, ``ChassisSpeeds`` nesnesinden sağlanan ``vx`` ve ``vy`` hızları, robotun tamamı için geçerli olmaya devam edecektir. Bununla birlikte, ``ChassisSpeeds`` nesnesindeki ``omega``, dönüş merkezinden ölçülecektir.
zh_cn: 由于所有机器人都是一个刚性框架，因此，从 "底盘速度 "对象中提供的 "vx "和 "vy "速度仍然适用于整个机器人。然而，来自``底盘速度``对象的``omega``将从旋转中心测量。

source: For example, one can set the center of rotation on a certain wheel and if the provided ``ChassisSpeeds`` object has a ``vx`` and ``vy`` of zero and a non-zero ``omega``, the robot will appear to rotate around that particular wheel.
es_mx: Por ejemplo, se puede establecer el centro de rotación en una determinada rueda y si el objeto ``ChassisSpeeds`` proporcionado tiene un ``vx`` y un ``vy`` de cero y un ``omega`` distinto de cero, el robot parecerá girar alrededor de esa rueda en particular.
fr_ca: Par exemple, on peut définir le centre de rotation sur une certaine roue et si l'objet ``ChassisSpeeds`` fourni a un ``vx`` et un ``vy`` de zéro et un ``omega`` différent de zéro, le robot tournera autour de cette roue spécifique.
tr_tr: Örneğin, belirli bir tekerlek üzerinde dönme merkezi ayarlanabilir ve sağlanan ``ChassisSpeeds`` nesnesi sıfır olan bir ``vx`` ve ``vy`` ye ve sıfır olmayan bir ``omega`` ya sahipse, robot, o tekerleğin etrafında dönüyormuş gibi görünecektir.
zh_cn: 例如，可以将旋转中心设置在某个轮子上，如果提供的``ChassisSpeeds``对象的``vx``和``vy``为零，而``omega``非零，机器人就会出现围绕该轮子旋转。

source: Converting wheel speeds to chassis speeds
es_mx: Conversión de velocidades de rueda a velocidades de chasis
fr_ca: Conversion des vitesses de roue en vitesses de châssis
tr_tr: Tekerlek hızlarını şasi hızlarına dönüştürme
zh_cn: 将车轮速度转换为底盘速度

source: One can also use the kinematics object to convert a ``MecanumDriveWheelSpeeds`` object to a singular ``ChassisSpeeds`` object. The ``toChassisSpeeds(MecanumDriveWheelSpeeds speeds)`` (Java) / ``ToChassisSpeeds(MecanumDriveWheelSpeeds speeds)`` (C++) method can be used to achieve this.
es_mx: También se puede usar el objeto cinemático para convertir un objeto ``MecanumDriveWheelSpeeds`` en un objeto singular ``ChassisSpeeds``. El método ``toChassisSpeeds(MecanumDriveWheelSpeeds speeds)`` (Java) / ``ToChassisSpeeds(MecanumDriveWheelSpeeds speeds)`` (C++) se puede utilizar para lograr esto.
fr_ca: On peut également utiliser l'objet cinématique pour convertir un objet ``MecanumDriveWheelSpeeds`` en un objet ``ChassisSpeeds`` unique. La méthode ``toChassisSpeeds(MecanumDriveWheelSpeeds speeds)`` (Java) / ``ToChassisSpeeds(MecanumDriveWheelSpeeds speeds)`` (C++) peut être utilisée pour y parvenir.
tr_tr: Bir ``MecanumDriveWheelSpeeds`` nesnesini tekil bir ``ChassisSpeeds`` nesnesine dönüştürmek için kinematik nesnesi de kullanılabilir. Bunu sağlamak için `toChassisSpeeds(MecanumDriveWheelSpeeds speeds)`` (Java) / ``ToChassisSpeeds(MecanumDriveWheelSpeeds speeds)`` (C++) yöntemi kullanılabilir.
zh_cn: 人们还可以使用运动学对象将``MecanumDriveWheelSpeeds``对象转换为单一的``ChassisSpeeds``对象。使用``toChassisSpeeds(MecanumDriveWheelSpeeds speeds)``(Java)/``ToChassisSpeeds(MecanumDriveWheelSpeeds speeds)``(C++)方法可以实现这个目的。
