Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/kinematics-and-odometry/swerve-drive-kinematics.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Swerve Drive Kinematics
fr_ca: La cinématique de l'entraînement de type "à embardée" (Swerve)
tr_tr: Swerve Drive Kinematiği
zh_cn: 转向驱动运动学

source: The ``SwerveDriveKinematics`` class is a useful tool that converts between a ``ChassisSpeeds`` object and several ``SwerveModuleState`` objects, which contains velocities and angles for each swerve module of a swerve drive robot.
es_mx: La clase ``SwerveDriveKinematics`` es una herramienta útil que convierte entre un objeto ``ChassisSpeeds`` a varios objetos ``SwerveModuleState`` , los cuales contienen velocidades y ángulos para cada módulo swerve de un robot.
fr_ca: N.D.T. (le mot "Swerve" sera utilisé tout le long de cette page, afin d'alléger le texte). La classe ``SwerveDriveKinematics`` est un outil utile qui convertit entre un objet ``ChassisSpeeds`` et plusieurs objets ``SwerveModuleState``, qui contient les vitesses et les angles pour chaque module Swerve d'un robot avec entraînement de ce type.
tr_tr: `` SwerveDriveKinematics`` sınıfı, bir `` ChassisSpeeds`` nesnesi ile bir swerve sürücü robotunun her bir dönüş modülü için hızları ve açıları içeren birkaç `` SwerveModuleState`` nesnesi arasında dönüşüm sağlayan kullanışlı bir araçtır.
zh_cn: ``SwerveDriveKinematics''类是一个有用的工具，可在``ChassisSpeeds''对象和几个``SwerveModuleState''对象之间进行转换，该对象包转向驱动机器人的每个速度模块的速度和角度。

source: The swerve module state class
es_mx: Clase swerve module state
fr_ca: La classe d'état du module swerve
tr_tr: Swerve modülü durum sınıfı
zh_cn: 转向模块状态类

source: The ``SwerveModuleState`` class contains information about the velocity and angle of a singular module of a swerve drive. The constructor for a ``SwerveModuleState`` takes in two arguments, the velocity of the wheel on the module, and the angle of the module.
es_mx: La clase ``SwerveModuleState`` contiene información de la velocidad y ángulo de un modo singular de swerve drive. El constructor para una ``SwerveModuleState`` toma dos argumentos, la velocidad de la llanta en el módulo, y el ángulo del módulo.
fr_ca: La classe ``SwerveModuleState`` contient des informations sur la vitesse et l'angle d'un seul module Swerve. Le constructeur d'un ``SwerveModuleState`` prend deux arguments, la vitesse de la roue sur le module et l'angle du module.
tr_tr: ``SwerveModuleState`` sınıfı, bir swerve sürücüsünün tekil modülünün hızı ve açısı hakkında bilgi içerir. Bir ``SwerveModuleState`` in constructor'ı iki argüman alır: modüldeki çarkın hızı ve modülün açısı.
zh_cn: ``SwerveModuleState''类包含有关转向驱动单个模块的速度和角度的信息。 ``SwerveModuleState''的构造函数接受两个参数，即车轮在模块上的速度和模块的角度。

source: In Java, the velocity of the wheel must be in meters per second. In C++, the units library can be used to provide the velocity using any linear velocity unit.
es_mx: En Java, la velocidad de la llanta tiene que estar en metros por segundo. En C++, la librería de las unidades puede ser usada para proporcionar la velocidad usando cualquier unidad de velocidad lineal.
fr_ca: En Java, la vitesse de la roue doit être en mètres par seconde. En C ++, la librairie d'unités peut être utilisée pour fournir la vitesse en utilisant n'importe quelle unité de vitesse linéaire.
tr_tr: Java'da, tekerleğin hızı saniyede metre cinsinden olmalıdır. C++ 'da, units-birimler kitaplığı herhangi bir doğrusal hız birimi kullanılarak hızı sağlamak için kullanılabilir.
zh_cn: 在Java中，轮子的速度必须以米/秒为单位。在C ++中，单位库可用于使用任何线速度单位提供速度。

source: An angle of 0 corresponds to the modules facing forward.
es_mx: Un ángulo de 0 corresponde a los módulos orientados hacía adelante.
fr_ca: Un angle de 0 correspond aux modules tournés vers l'avant.
tr_tr: 0 açı, öne bakan modüllere karşılık gelir.
zh_cn: 角度0对应于面向前方的模块。

source: Constructing the kinematics object
es_mx: Construyendo los objetos cinemáticos.
fr_ca: Construction de l'objet cinématique
tr_tr: Kinematik Nesnesinin Oluşturulması
zh_cn: 构造运动学对象

source: The ``SwerveDriveKinematics`` class accepts a variable number of constructor arguments, with each argument being the location of a swerve module relative to the robot center (as a ``Translation2d``. The number of constructor arguments corresponds to the number of swerve modules.
es_mx: La clase ``SwerveDriveKinematics`` acepta un número variable de argumentos del constructor, con cada argumento siendo la ubicación de un módulo swerve relativo al centro del robot (así como ``Translation2d``. El número de argumentos del constructor corresponde al número de módulos swerve.
fr_ca: La classe ``SwerveDriveKinematics`` accepte un nombre variable d'arguments constructeur, chaque argument étant l'emplacement d'un module swerve par rapport au centre du robot (sous la forme d'un ``Translation2d``. Le nombre d'arguments constructeur correspond au nombre de modules Swerve.
tr_tr: ``SwerveDriveKinematics`` sınıfı, değişken sayıda yapıcı argümanı kabul eder, her argüman robot merkezine göre bir swerve modülünün konumu olur (``Translation2d`` olarak. Constructor argümanlarının sayısı, swerve modüllerinin sayısına karşılık gelir.
zh_cn: ``SwerveDriveKinematics''类接受可变数量的构造函数参数，每个参数都是相对于机器人中心的转向模块的位置（作为``Translation2d''。构造函数参数的数量与转向的数量相对应模块。

source: A swerve drive must have 2 or more modules.
es_mx: Un swerve drive tiene que tener 2 módulos o más.
fr_ca: Un robot doit avoir au moins 2 modules Swerve.
tr_tr: Swerve sürücüsünün 2 veya daha fazla modülü olmalıdır.
zh_cn: 转向驱动必须具有2个或更多模块。

source: In C++, the class is templated on the number of modules. Therefore, when constructing a ``SwerveDriveKinematics`` object as a member variable of a class, the number of modules must be passed in as a template argument. For example, for a typical swerve drive with four modules, the kinematics object must be constructed as follows: ``frc::SwerveDriveKinematics<4> m_kinematics{...}``.
es_mx: En C++, la clase se planifica en función del número de módulos. Por lo tanto, al construir un objeto ``SwerveDriveKinematics`` como un miembro variable de una clase, el número de módulos debe ser pasado como un argumento de plantilla. Por ejemplo, para un swerve drive común con cuatro módulos, el objeto cinemático debe ser construido como: ``frc::SwerveDriveKinematics<4>m_kinematics{...}``.
fr_ca: En C ++, la classe est basée sur le nombre de modules. Par conséquent, lors de la construction d'un objet ``SwerveDriveKinematics`` en tant que variable membre d'une classe, le nombre de modules doit être transmis en tant qu'argument. Par exemple, pour un entraînement Swerve typique avec quatre modules, l'objet cinématique doit être construit comme suit: ``frc::SwerveDriveKinematics<4> m_kinematics{...}``.
tr_tr: C++ 'da, sınıf modül sayısına göre şablonlanır. Bu nedenle, bir sınıfın üye değişkeni olarak bir ``SwerveDriveKinematics`` nesnesi oluştururken, modül sayısı bir şablon argümanı olarak iletilmelidir. Örneğin, dört modüllü tipik bir swerve sürücü için kinematik nesnesi şu şekilde oluşturulmalıdır: ``frc:: SwerveDriveKinematics<4> m_kinematics{...}``.
zh_cn: 在C ++中，该类以模块数量为模板。因此，在将“ SwerveDriveKinematics”对象构造为类的成员变量时，必须将多个模块作为模板参数传入。例如，对于具有四个模块的典型转向驱动，运动学对象必须按以下方式构造：``frc :: SwerveDriveKinematics <4> m_kinematics {...}''。

source: The locations for the modules must be relative to the center of the robot. Positive x values represent moving toward the front of the robot whereas positive y values represent moving toward the left of the robot.
es_mx: Las ubicaciones de los módulos deben ser relativas con el centro del robot. Los valores positivos x representan el movimiento hacía la parte delantera del robot, mientras que los calores positivos representan el movimiento del robot hacía la izquierda.
fr_ca: Les emplacements des modules doivent être relatifs au centre du robot. Les valeurs x positives représentent le déplacement vers l'avant du robot tandis que les valeurs y positives représentent le déplacement vers la gauche du robot.
tr_tr: Modüllerin konumları, robotun merkezine göre olmalıdır. Pozitif x değerleri robotun önüne doğru hareket etmeyi temsil ederken, pozitif y değerleri robotun soluna doğru hareket etmeyi temsil eder.
zh_cn: 模块的位置必须相对于机器人的中心。正的x值表示朝着机器人的前端移动，而正的y值表示朝着机器人的左侧移动。

source: Converting chassis speeds to module states
es_mx: Convertir las velocidades del chasis a estados de los módulos
fr_ca: Conversion des vitesses de châssis en états de module
tr_tr: Şase hızlarını modül durumlarına dönüştürme
zh_cn: 将底盘速度转换为模块状态

source: The ``toSwerveModuleStates(ChassisSpeeds speeds)`` (Java) / ``ToSwerveModuleStates(ChassisSpeeds speeds)`` (C++) method should be used to convert a ``ChassisSpeeds`` object to a an array of ``SwerveModuleState`` objects. This is useful in situations where you have to convert a forward velocity, sideways velocity, and an angular velocity into individual module states.
es_mx: El método ``toSwerveModuleStates(ChassisSpeeds speeds)`` (Java) / ``ToSwerveModuleStates(ChassisSpeeds speeds)`` (C++) debe ser usado para convertir un objeto ``ChassisSpeeds`` a una matriz de objetos ``SwerveModuleState`` . Esto es útil en situaciones donde se tenga que convertir una velocidad hacía adelante, hacía los lados y una velocidad angular en estados de módulo individuales.
fr_ca: La méthode ``toSwerveModuleStates(ChassisSpeeds speeds)`` (Java) / ``ToSwerveModuleStates(ChassisSpeeds speeds)`` (C++) doit être utilisée pour convertir un objet ``ChassisSpeeds`` en un tableau d'objets ``SwerveModuleState`` . Ceci est utile dans les situations où vous devez convertir une vitesse avant, une vitesse latérale et une vitesse angulaire en états de module individuels.
tr_tr: ``toSwerveModuleStates(ChassisSpeeds hızları)`` (Java) / ``toSwerveModuleStates (ChassisSpeeds hızları)`` (C ++) yöntemi, bir ``ChassisSpeeds`` nesnesini ``SwerveModuleState`` nesnelerinden oluşan bir diziye dönüştürmek için kullanılmalıdır. Bu, ileri hız, yan hız ve açısal hızı ayrı modül durumlarına dönüştürmeniz gereken durumlarda kullanışlıdır.
zh_cn: “toSwerveModuleStates（ChassisSpeeds speeds）”（Java）/ "ToSwerveModuleStates（ChassisSpeeds speeds）"（C ++）方法应用于将"ChassisSpeeds"对象转换为"SwerveModuleState"对象数组。在必须将前进速度，横向速度和角速度转换为单独的模块状态的情况下，使用此方法很有效。

source: The elements in the array that is returned by this method are the same order in which the kinematics object was constructed. For example, if the kinematics object was constructed with the front left module location, front right module location, back left module location, and the back right module location in that order, the elements in the array would be the front left module state, front right module state, back left module state, and back right module state in that order.
es_mx: Los elementos en la matriz que se devuelven por este método son el mismo orden en el cual se construyó el objeto cinemático. Por ejemplo, si el objeto cinemático se construyó con la ubicación del módulo frontal izquierdo, la ubicación del módulo frontal derecho, la ubicación del módulo posterior izquierdo y la ubicación del módulo posterior derecho en ese orden, los elementos de la matriz serían el estado del módulo frontal izquierdo, el estado del módulo frontal derecho, el estado del módulo posterior izquierdo y el estado del módulo posterior derecho en ese orden.
fr_ca: Les éléments du tableau renvoyé par cette méthode sont du même ordre dans lequel l'objet cinématique a été construit. Par exemple, si l'objet cinématique a été construit avec l'emplacement du module avant-gauche, l'emplacement du module avant-droit, l'emplacement du module arrière-gauche et l'emplacement du module arrière-droit dans cet ordre, les éléments du tableau seront: état du module avant-gauche, état du module avant-droit, état du module arrière-gauche et état du module arrière-droit (en respectant cet ordre).
tr_tr: Bu yöntemle döndürülen dizideki öğeler, kinematik nesnesinin oluşturulduğu sırayla aynıdır. Örneğin, kinematik nesnesi ön sol modül konumu, ön sağ modül konumu, arka sol modül konumu ve bu sırayla sağ arka modül konumu ile oluşturulmuşsa, dizideki öğeler ön sol modül durumu, ön bu sırayla sağ modül durumu, arka sol modül durumu ve arka sağ modül durumu olacaktır.
zh_cn: 该方法返回的数组中的元素与运动学对象的构造顺序相同。例如，如果运动学对象的构造顺序是前左模块位置、前右模块位置、后左模块位置和后右模块位置，那么数组中的元素将依次是前左模块状态、前右模块状态、后左模块状态和后右模块状态。

source: Module angle optimization
es_mx: Optimización del ángulo del módulo
fr_ca: Module d'optimisation de l’angle
tr_tr: Modül açısı optimizasyonu
zh_cn: 模块角度优化

source: The ``SwerveModuleState`` class contains a static ``optimize()`` (Java) / ``Optimize()`` (C++) method that is used to "optimize" the speed and angle setpoint of a given ``SwerveModuleState`` to minimize the change in heading. For example, if the angular setpoint of a certain module from inverse kinematics is 90 degrees, but your current angle is -89 degrees, this method will automatically negate the speed of the module setpoint and make the angular setpoint -90 degrees to reduce the distance the module has to travel.
es_mx: La clase ``SwerveModuleState`` contiene un método estático ``optimize()`` (Java) / ``Optimize()`` (C++) que se utiliza para "optimizar" la velocidad y el punto de ajuste del ángulo de un determinado ``SwerveModuleState`` para minimizar el cambio de rumbo. Por ejemplo, si el punto de ajuste angular de un cierto módulo de cinemática inversa es de 90 grados, pero su ángulo actual es de -89 grados, este método negará automáticamente la velocidad del punto de ajuste del módulo y hará que el punto de ajuste angular sea de -90 grados para reducir la distancia. el módulo tiene que viajar.
fr_ca: La classe ``SwerveModuleState`` contient une méthode statique ``optimize()`` (Java) / ``Optimize()`` (C++) qui est utilisée pour "optimiser" les points de consigne de vitesse et d’angle pour un ``SwerveModuleState`` donné afin de minimiser le changement d'orientation angulaire. Par exemple, si le point de consigne angulaire d’un certain module de cinématique inverse est de 90 degrés, mais que votre angle actuel est de -89 degrés, cette méthode annulera automatiquement la vitesse du point de consigne du module et fournira le point de consigne angulaire -90 degrés pour réduire la distance parcourue par le module.
tr_tr: Başlıktaki değişikliği en aza indirmek için. ``SwerveModuleState`` sınıfı, belirli bir ``SwerveModuleState`` in hız ve açı ayar noktasını "optimize etmek" için kullanılan statik bir``optimize()`` (Java) / ``Optimize()`` (C++) yöntemini içerir. Örneğin, belirli bir modülün ters kinematikten açısal set noktası 90 derece ise, ancak mevcut açınız -89 derecedir, bu yöntem modülün ayar noktasının hızını otomatik olarak geçersiz kılar ve modülün gitmesi gereken mesafeyi azaltmak için açısal ayar noktasını -90 derece yapar.
zh_cn: ``SwerveModuleState''类包含一个静态``optimize（）``（Java）/``Optimize（）``（C ++）方法，用于``优化''给定``SwerveModuleState''的速度和角度设定值``以最大程度减少航向的变化。例如，如果逆运动学中某个模块的角度设定点为90度，但是您当前的角度为-89度，则此方法将自动抵消模块设定点的速度并使角度设定点为-90度以减小距离模块必须行进。

source: This method takes two parameters: the desired state (usually from the ``toSwerveModuleStates`` method) and the current angle. It will return the new optimized state which you can use as the setpoint in your feedback control loop.
es_mx: Este método toma dos parámetros: el estado deseado (generalmente del método ``toSwerveModuleStates``) y el ángulo actual. Devolverá el nuevo estado optimizado que puede usar como punto de ajuste en su circuito de control de retroalimentación.
fr_ca: Cette méthode prend deux paramètres : l’état désiré (généralement par l'intermédiaire de la méthode ``toSwerveModuleStates``) et l’angle actuel. Il retournera le nouvel état optimisé que vous pouvez utiliser comme point de consigne dans votre boucle de contrôle de rétroaction.
tr_tr: Bu yöntem iki parametre alır: istenen durum (genellikle ``toSwerveModuleStates`` metodundan) ve geçerli açı. Geri bildirim kontrol döngünüzde ayar noktası olarak kullanabileceğiniz yeni optimize edilmiş durumu döndürecektir.
zh_cn: 该方法有两个参数：所需状态（通常从toSwerveModuleStates方法）和当前角度。它将返回新的优化状态，您可以将其用作反馈控制回路中的设定值。

source: Field-oriented drive
fr_ca: Entraînement orienté terrain
tr_tr: Field-oriented / Saha-odaklı sürüş
zh_cn: 定向驱动

source: :ref:`Recall <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:Creating a ChassisSpeeds object from field-relative speeds>` that a ``ChassisSpeeds`` object can be created from a set of desired field-oriented speeds. This feature can be used to get module states from a set of desired field-oriented speeds.
es_mx: :ref:`Recuerde <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:Creating a ChassisSpeeds object from field-relative speeds>` que un objeto ``ChassisSpeeds`` puede crearse a partir de un conjunto de velocidades deseadas orientadas al campo. Esta característica puede ser utilizada para obtener estados de módulo a partir de un conjunto de velocidades deseadas orientadas al campo.
fr_ca: :ref:`Recall <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:Creating a ChassisSpeeds object from field-relative speeds>` peut être créé à partir d'un ensemble de vitesses orientées en fonction du terrain de jeu. Cette fonction peut être utilisée également pour obtenir les vitesses de roue à partir du même ensemble (de vitesses orientées en fonction du terrain de jeu).
tr_tr: :ref:`Recall <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:Creating a ChassisSpeeds object from field-relative speeds>` bir ``ChassisSpeeds`` nesnesinin istenen saha odaklı hızlardan oluşturulabileceğini hatırlayın. Bu özellik, istenen saha odaklı hızlardan modül durumlarını elde etmek için kullanılabilir.
zh_cn: :ref:`Recall<docs/software/kinematics-and-odometry/intro-and-chassis-speeds:从现场相关速度中创建ChassisSpeeds对象>`可以从一组所需的现场导向速度中创建``ChassisSpeeds``对象。这个功能可以用来从一组所需的定向驱动速度获得模块状态。

source: Using custom centers of rotation
es_mx: Usando centros de rotación personalizados
fr_ca: Utilisation de centres de rotation personnalisés
tr_tr: Özel döndürme merkezlerini kullanma
zh_cn: 使用自定义旋转中心

source: Sometimes, rotating around one specific corner might be desirable for certain evasive maneuvers. This type of behavior is also supported by the WPILib classes. The same ``ToSwerveModuleStates()`` method accepts a second parameter for the center of rotation (as a ``Translation2d``). Just like the wheel locations, the ``Translation2d`` representing the center of rotation should be relative to the robot center.
es_mx: En ocasiones, girar alrededor de una esquina específica puede ser deseable para ciertas maniobras evasivas. Este tipo de comportamiento también es apoyado por las clases de WPILib. El mismo método ``ToSwerveModuleStates()`` acepta un segundo parámetro para el centro de rotación (así como``Translation2d``). Justo como la ubicación de las llantas, la ``Translation2d`` representa que el centro de rotación debe ser relativo al centro del robot.
fr_ca: Parfois, la rotation autour d'un point spécifique peut être souhaitable pour certaines manœuvres d'évitement. Ce type de comportement est également pris en charge par les classes WPILib. La même méthode ``ToSwerveModuleStates()`` accepte un deuxième paramètre pour le centre de rotation (comme un ``Translation2d``). Tout comme les emplacements des roues, le ``Translation2d`` représentant le centre de rotation doit être relatif au centre du robot.
tr_tr: Bazen, belirli kaçamak manevralar için belirli bir köşenin etrafında dönmek istenebilir. Bu tür davranış WPILib sınıfları tarafından da desteklenir. Aynı `` ToSwerveModuleStates ()`` yöntemi, dönüş merkezi için ikinci bir parametre kabul eder (`` Translation2d`` olarak). Tıpkı tekerlek konumlarında olduğu gibi, dönme merkezini temsil eden `` Translation2d`` de robot merkezine göre olmalıdır.
zh_cn: 有时，对于某些规避操作，可能需要绕一个特定的角旋转。 WPILib也支持这种类型的行为。相同的ToSwerveSpeeds（）方法接受旋转中心的第二个参数（作为Translation2d）。就像轮子的位置一样，代表旋转中心的``Translation2d''应该相对于机器人中心。

source: Because all robots are a rigid frame, the provided ``vx`` and ``vy`` velocities from the ``ChassisSpeeds`` object will still apply for the entirety of the robot. However, the ``omega`` from the ``ChassisSpeeds`` object will be measured from the center of rotation.
es_mx: Debido a que todos los robots son un marco rígido, las velocidades ``vx`` y ``vy`` del objeto ``ChassisSpeeds`` aplican a la totalidad del robot. Sin embargo, el ``omega`` del objeto ``ChassisSpeeds`` se medirá desde el centro de rotación.
fr_ca: Étant donné que tous les robots ont un châssis rigide, les vitesses ``vx`` et ``vy`` fournies par l'objet ``ChassisSpeeds`` s'appliqueront toujours à l'intégralité du robot. Cependant, ``omega`` de l'objet ``ChassisSpeeds`` sera mesuré à partir du centre de rotation.
tr_tr: Tüm robotlar sabit bir çerçeve olduğundan, ``ChassisSpeeds`` nesnesinden sağlanan ``vx`` ve ``vy`` hızları, robotun tamamı için geçerli olmaya devam edecektir. Bununla birlikte, ``ChassisSpeeds`` nesnesindeki ``omega``, dönüş merkezinden ölçülecektir.
zh_cn: 由于所有机器人都是一个刚性框架，因此，从 "底盘速度 "对象中提供的 "vx "和 "vy "速度仍然适用于整个机器人。然而，来自``底盘速度``对象的``omega``将从旋转中心测量。

source: For example, one can set the center of rotation on a certain module and if the provided ``ChassisSpeeds`` object has a ``vx`` and ``vy`` of zero and a non-zero ``omega``, the robot will appear to rotate around that particular swerve module.
es_mx: Por ejemplo, uno puede establecer el centro de rotación en un cierto módulo y si el objeto ``ChassisSpeeds`` tiene ``vx`` y ``vy`` de cero y un ``omega`` que no sea cero, el robot parecerá rotar alrededor de ese particular módulo swerve.
fr_ca: Par exemple, on peut définir le centre de rotation sur un certain module et si l'objet ```ChassisSpeeds`` fourni a un ``vx`` et un ``vy`` de zéro et un ``omega`` différent de zéro, le robot tournerar autour de ce module Swerve spécifique.
tr_tr: Örneğin, belirli bir modülde dönme merkezi ayarlanabilir ve sağlanan ``ChassisSpeeds`` nesnesinin bir ``vx`` ve ``vy`` si sıfır ve sıfır olmayan bir ``omega`` ise robot, söz konusu dönüş modülü etrafında dönüyormuş gibi görünecektir.
zh_cn: 例如，可以将旋转中心设置在某个轮子上，如果提供的``ChassisSpeeds``对象的``vx``和``vy``为零，而``omega``非零，机器人就会出现围绕该特定的转向模块旋转。

source: Converting module states to chassis speeds
es_mx: Convirtiendo estados de módulo a velocidades del chasis
fr_ca: Conversion des états des modules en vitesses de châssis
tr_tr: Modül durumlarını şase hızlarına dönüştürme
zh_cn: 将模块状态转换为底盘速度

source: One can also use the kinematics object to convert an array of ``SwerveModuleState`` objects to a singular ``ChassisSpeeds`` object. The ``toChassisSpeeds(SwerveModuleState... states)`` (Java) / ``ToChassisSpeeds(SwerveModuleState... states)`` (C++) method can be used to achieve this.
es_mx: También se puede usar el objeto cinemático para convertir un conjunto de objetos ``SwerveModuleState`` a un objeto ``ChassisSpeeds`` . El método ``toChassisSpeeds(SwerveModuleState... states)`` (Java) / ``ToChassisSpeeds(SwerveModuleState... states)`` (C++) puede usarse para lograr esto.
fr_ca: On peut également utiliser l'objet cinématique pour convertir un tableau d'objets ``SwerveModuleState`` en un objet ``ChassisSpeeds`` unique. La méthode ``toChassisSpeeds(SwerveModuleState... states)`` (Java) / ``ToChassisSpeeds(SwerveModuleState... states)`` (C++) peut être utilisée pour y parvenir.
tr_tr: Bir ``SwerveModuleState`` nesnesi dizisini tekil bir ``ChassisSpeeds`` nesnesine dönüştürmek için kinematik nesnesi de kullanılabilir. Bunu başarmak için ``toChassisSpeeds(SwerveModuleState ... states)`` (Java) / ``ToChassisSpeeds(SwerveModuleState ... states)`` (C ++) yöntemi kullanılabilir.
zh_cn: 人们还可以使用运动学对象将一个数组的``SwerveModuleState``对象转换为一个单一的``ChassisSpeeds``对象。使用``toChassisSpeeds(SwerveModuleState... states)``(Java)/``ToChassisSpeeds(SwerveModuleState... states)``(C++)方法可以实现这个目的。
