Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/kinematics-and-odometry/swerve-drive-odometry.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Swerve Drive Odometry
es_mx: Odometría para un Swerve Drive
fr_ca: Odométrie pour l'entaînement de type "à embardée" (Swerve)
tr_tr: Swerve Sürüş Odometrisi
zh_cn: 转向驱动测距法

source: A user can use the swerve drive kinematics classes in order to perform :ref:`odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`. WPILib contains a ``SwerveDriveOdometry`` class that can be used to track the position of a swerve drive robot on the field.
es_mx: Un usuario puede usar las clases cinemáticas del swerve drive para ejecutar :ref:`odometría <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`. WPILib contiene una clase ``SwerveDriveOdometry`` que puede ser utilizada para rastrear la posicion de un robot con swerve drive en el campo.
fr_ca: Un utilisateur peut utiliser les classes cinématiques "swerve drive" pour effectuer l':ref:`odométrie <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`. WPILib contient une classe ``SwerveDriveOdometry`` qui peut être utilisée pour localiser la position d'un robot avec entraînement par embardée sur le terrain.
tr_tr: Bir kullanıcı gerçekleştirmek için swerve sürücü kinematik sınıflarını kullanabilir :ref:`odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`. WPILib, sahada bir Swerve sürüş robotunun konumunu izlemek için kullanılabilecek bir ``SwerveDriveOdometry`` sınıfı içerir.
zh_cn: 用户可以使用转向驱动器运动学类来执行:ref: odometry <docs/software/kinematics-and-odometry/intro-and-chassis-speeds:What is odometry?>`。 WPILib包含一个``SwerveDriveOdometry''类，该类可用于追踪场上的转向驱动机器人的位置。

source: Because this method only uses encoders and a gyro, the estimate of the robot's position on the field will drift over time, especially as your robot comes into contact with other robots during gameplay. However, odometry is usually very accurate during the autonomous period.
es_mx: Dado a que este método utiliza solamente encoders y un giroscopio, el estimado de la posición del robot en el campo variará con el tiempo, especialmente cuando el robot tenga contacto con otros robots durante el juego. Sin embargo, la odometría es usualmente muy acertada para el periodo autónomo.
fr_ca: Étant donné que cette méthode n'utilise que des encodeurs et un gyroscope, l'estimation de la position du robot sur le terrain dérivera avec le temps, d'autant plus que votre robot entre en contact avec d'autres robots pendant le jeu. Cependant, l'odométrie est généralement très précise pendant la période autonome.
tr_tr: Bu yöntem yalnızca kodlayıcılar ve bir jiroskop kullandığından, robotun sahadaki konumunun tahmini, özellikle oyun sırasında diğer robotlarla temas kurduğunda zamanla kayacaktır. Bununla birlikte, odometri genellikle özerk dönemde çok doğrudur.
zh_cn: 由于这种方法只使用编码器和陀螺仪，机器人在场上的位置估计会随着时间的推移而漂移，特别是当你的机器人在游戏过程中与其他机器人接触时。不过，在自主期，测距法通常非常准确。

source: Creating the odometry object
es_mx: Creando el objeto odométrico
fr_ca: Création de l'objet odométrie
tr_tr: Odometri nesnesini oluşturma
zh_cn: 创建测距法对象

source: The ``SwerveDriveOdometry<int NumModules>`` class requires one template argument (only C++), two mandatory arguments, and one optional argument. The template argument (only C++) is an integer representing the number of swerve modules. The mandatory arguments are the kinematics object that represents your swerve drive (in the form of a ``SwerveDriveKinematics`` class) and the angle reported by your gyroscope (as a Rotation2d). The third optional argument is the starting pose of your robot on the field (as a ``Pose2d``). By default, the robot will start at ``x = 0, y = 0, theta = 0``.
es_mx: La clase ``SwerveDriveOdometry<int NumModules>`` requiere un argumento de plantilla (solo en C++), dos argumentos obligatorios y un argumento opcional. El argumento de plantilla (solo en C++) es un entero que representa el número de módulos swerve. Los argumentos obligatorios son el objeto cinématico que representa tu swerve drive (en la forma de una clase ``SwerveDriveKinematics`` ) y el ángulo reportado por tu giroscopio (como Rotation2d). El tercer argumento opcional es la posición inicial de tu robot en el campo (como ``Pose2d``). De forma predeterminada, el robot empezará en ``x = 0, y = 0, theta = 0``.
fr_ca: La classe ``SwerveDriveOdometry1<int NumModules>`` requiert un argument de modèle (uniquement C ++), deux arguments obligatoires et un argument facultatif. L'argument de modèle (uniquement C ++) est un entier représentant le nombre de modules swerve. Les arguments obligatoires sont l'objet cinématique qui représente votre entraînement par embardée (sous la forme d'une classe ``SwerveDriveKinematics``) et l'angle rapporté par votre gyroscope (comme un Rotation2d). Le troisième argument optionnel est la pose de départ de votre robot sur le terrain (comme un ``Pose2d``). Par défaut, le robot démarre à ``x = 0, y = 0, theta = 0``.
tr_tr: ``SwerveDriveOdometry<int NumModules>`` sınıfı, bir şablon değişkeni (yalnızca C ++), iki zorunlu değişken ve bir isteğe bağlı değişken gerektirir. Şablon argümanı (yalnızca C ++), swerve modüllerinin sayısını temsil eden bir tamsayıdır. Zorunlu argümanlar, dönüş sürücünüzü (bir ``SwerveDriveKinematics`` sınıfı biçiminde) ve jiroskopunuz tarafından bildirilen açı (Rotation2d olarak) temsil eden kinematik nesnesidir. Üçüncü isteğe bağlı argüman, robotunuzun sahadaki başlangıç pozudur (``Pose2d`` olarak). Varsayılan olarak, robot ``x = 0, y = 0, theta = 0`` ile başlayacaktır.
zh_cn: ``SwerveDriveOdometry <int NumModules>''类需要一个模板参数（仅C ++），两个必需参数和一个可选参数。模板参数（仅C ++）是一个整数，表示转向模块的数量。必需参数是运动对象，它代表您的弧形驱动器（以“ SwerveDriveKinematics”类的形式）和陀螺仪报告的角度（作为Rotation2d）。第三个可选参数是机器人在场地上的起始姿势（称为“ Pose2d”）。默认情况下，机器人将从``x = 0，y = 0，theta = 0''开始。

source: 0 degrees / radians represents the robot angle when the robot is facing directly toward your opponent's alliance station. As your robot turns to the left, your gyroscope angle should increase. By default, WPILib gyros exhibit the opposite behavior, so you should negate the gyro angle.
es_mx: 0 grados / radianes representa el ángulo del robot cuando este se encuentra de frente hacia la estación del oponente. Si el robot empieza a girar a la izquierda, el ángulo del giroscopio debe aumentar. De forma predeterminada, los giroscopios de WPILib muestras un comportamiento opuesto, así que debes anular el ángulo del giroscopio.
fr_ca: 0 degrés / radians représente l'angle du robot lorsque le robot fait face directement à la station d'alliance de votre adversaire. Lorsque votre robot se tourne vers la gauche, l'angle de votre gyroscope devrait augmenter. Par défaut, les gyroscopes WPILib présentent le comportement opposé, vous devez donc compenser l'angle du gyroscope en inversant son signe (nouvel angle = 0 - angle gyro).
tr_tr: 0 derece / radyan, robot doğrudan rakibinizin ittifak istasyonuna bakarken robot açısını temsil eder. Robotunuz sola döndükçe jiroskop açınız artmalıdır. Varsayılan olarak, WPILib jiroskopları zıt davranış sergiler, bu nedenle jiroskop açısını terlemeniz gerekir.
zh_cn: 0度/弧度代表机器人角度，当机器人正对着你的对手的联盟站。当您的机器人向左转时，您的陀螺仪角度应该增加。默认情况下，WPILib陀螺仪表现出相反的行为，因此您应该对陀螺仪的角度加上负号。

source: Updating the robot pose
es_mx: Actualizando la posición del robot
fr_ca: Mise à jour de la pose du robot
tr_tr: Robot duruşunu güncelleme
zh_cn: 更新机器人姿势

source: The ``update`` method of the odometry class updates the robot position on the field. The update method takes in the gyro angle of the robot, along with a series of module states (speeds and angles) in the form of a ``SwerveModuleState`` each. It is important that the order in which you pass the ``SwerveModuleState`` objects is the same as the order in which you created the kinematics object.
es_mx: El método ``update`` de la clase de odometría actualiza la posición del robot en el campo. Este método recibe el ángulo del robot del giroscopio, así como una serie de estados modulares (velocidades y ángulos) en forma de ``SwerveModuleState``. Es importante que el orden en el que pasas los objetos ``SwerveModuleState`` es el mismo orden en el que creaste el objeto cinemático.
fr_ca: La méthode ``update`` de la classe d'odométrie met à jour la position du robot sur le terrainde jeu. La méthode "update" prend en compte l'angle gyroscopique du robot, ainsi qu'une série de valeurs (vitesses et angles) prenant la forme d'un ``SwerveModuleState`` . Il est important que l'ordre dans lequel vous passez les objets ``SwerveModuleState`` soit le même que l'ordre dans lequel vous avez créé l'objet cinématique.
tr_tr: Odometri sınıfının ``update`` metodu , robotun sahadaki konumunu günceller. Güncelleme yöntemi, her biri bir ``SwerveModuleState`` şeklinde bir dizi modül durumu (hız ve açı) ile birlikte robotun cayro açısını alır. ``SwerveModuleState`` nesnelerini geçirdiğiniz sıranın, kinematik nesnesini yarattığınız sırayla aynı olması önemlidir.
zh_cn: 测距法类的``update''方法更新机器人在现场的位置。更新方法采用了机器人的陀螺仪角度以及一系列模块状态（速度和角度），每个状态均为``SwerveModuleState''形式。重要的是，传递“ SwerveModuleState”对象的顺序与创建运动学对象的顺序相同。

source: This ``update`` method must be called periodically, preferably in the ``periodic()`` method of a :ref:`Subsystem <docs/software/commandbased/subsystems:Subsystems>`. The ``update`` method returns the new updated pose of the robot.
es_mx: Este método ``update`` debe ser llamado periódicamente, de preferencia en el método ``periodic()`` de un :ref:`Subsistema <docs/software/commandbased/subsystems:Subsystems>`. El método ``update`` regresa la nueva posición actualizada del robot.
fr_ca: Cette méthode ``Update`` doit être appelée périodiquement, de préférence dans la méthode ``periodic()`` du :ref:`Sous-Système <docs/software/commandbased/subsystems:Subsystems>`. La méthode ``update`` envoie la nouvelle pose du robot.
tr_tr: Bu ``update`` metodu periyodik olarak, tercihen ``periodic()`` metodunda bir :ref:`Subsystem <docs/software/commandbased/subsystems:Subsystems>` ile çağrılmalıdır. ``update`` metodu, robotun yeni güncellenmiş pozunu döndürür.
zh_cn: 调用此"update"方法必需为周期性，最好是在Subsystem<docs/software/commandbased/subsystems:Subsystems>的"periodic()"方法中调用。 "update"方法将返回机器人的新的姿势。

source: Resetting the Robot Pose
es_mx: Restableciendo la posición del robot
fr_ca: Réinitialisation de la pose de robot
tr_tr: Robot Duruşunu Sıfırlama
zh_cn: 重置机器人姿势

source: The robot pose can be reset via the ``resetPose`` method. This method accepts two arguments -- the new field-relative pose and the current gyro angle.
es_mx: La posición del robot puede restablecerse por medio del método ``resetPose``. Este método acepta dos argumentos -- la nueva posición relativa al campo y el ángulo del giroscopio actual.
fr_ca: La pose du robot peut être réinitialisée via la méthode ``resetPose``. Cette méthode accepte deux arguments - la nouvelle pose relative au terrain et l'angle gyroscopique actuel.
tr_tr: Robot duruşu, ``resetPose`` metoduyla sıfırlanabilir. Bu yöntem iki bağımsız değişkeni kabul eder - yeni sahaya bağlı poz ve mevcut jiroskop açısı.
zh_cn: 机器人姿势可以通过``resetPose``方法重新设定。该方法接受两个参数 -- -- 新的相关场位和当前陀螺仪角度。

source: If at any time, you decide to reset your gyroscope, the ``resetPose`` method MUST be called with the new gyro angle.
es_mx: Si en algún momento, decides reiniciar tu giroscopio, el método ``resetPose`` DEBE ser llamado con el nuevo ángulo del giroscopio.
fr_ca: Si à tout moment, vous décidez de réinitialiser votre gyroscope, la méthode ``resetPose`` DOIT être appelée avec le nouvel angle gyroscopique.
tr_tr: Herhangi bir zamanda jiroskopunuzu sıfırlamaya karar verirseniz, yeni jiroskop açısıyla ``resetPose`` metodu ÇAĞIRILMALIDIR.
zh_cn: 在任何时候如果您决定重置陀螺仪，必须使用新的陀螺仪角度调用``resetPose``方法。

source: The implementation of ``getState() / GetState()`` above is left to the user. The idea is to get the module state (speed and angle) from each module. For a full example, see here: `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SwerveBot>`_ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervebot>`_.
es_mx: La implementación de ``getState() / GetState()`` anterior se deja al usuario. La idea es obtener el estado del módulo (velocidad y ángulo) de cada módulo. Para un ejemplo completo, vea aquí: <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SwerveBot>`_ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervebot>`_.
fr_ca: L'implémentation de ``getState () / GetState ()`` ci-dessus est laissée à l'utilisateur. L'idée est d'obtenir l'état de chaque module (vitesse et angle) . Pour un exemple complet, voir ici: `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SwerveBot>`_ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervebot>`_.
tr_tr: Yukarıdaki ``getState() / GetState()`` uygulaması kullanıcıya bırakılmıştır. Fikir, her modülden modül durumunu (hız ve açı) elde etmektir. Tam bir örnek için buraya bakın: `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SwerveBot>` _ / `Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervebot>` _.
zh_cn: 上面的``getState（）/ GetState（）``的实现留给用户使用。这个想法是从每个模块获取模块状态（速度和角度）。有关完整示例，请参见此处：`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SwerveBot>`_ /`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/swervebot>`_。

source: In addition, the ``GetPose`` (C++) / ``getPoseMeters`` (Java) methods can be used to retrieve the current robot pose without an update.
es_mx: Además, los métodos ``GetPose`` (C++) / ``getPoseMeters`` (Java) pueden ser utilizado para recuperar la posición actual del robot sin la necesidad de actualizar.
fr_ca: De plus, les méthodes ``GetPose`` (C++) / ``getPoseMeters`` (Java) peuvent être utilisées pour récupérer la pose actuelle du robot sans mise à jour.
tr_tr: Ek olarak, mevcut robot pozunu güncelleme olmadan almak için``GetPose`` (C++) / ``getPoseMeters`` (Java) metodları kullanılabilir.
zh_cn: 此外，可以使用GetPose（C ++）/ getPoseMeters（Java）方法来检索当前的机器人姿态，而无需进行更新。
