Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/getting-started/shuffleboard-graphs.po
Languages: fr_ca, zh_cn

source: Working with Graphs
fr_ca: Utilisation de graphiques
zh_cn: 使用图像

source: To create a graph, choose a numeric value and right-click in the heading and select "Show as..." and then choose graph
fr_ca: Pour créer un graphique, choisissez une valeur numérique, cliquez avec le bouton droit sur le titre et sélectionnez "Show as...", puis choisissez Graph.
zh_cn: 要创建图形，选择一个数值，右键单击标题，选择“显示为…”，然后选择“图形”

source: Right click any numeric and you can choose "Show as..." then "Graph"
fr_ca: Faites un clic droit sur n’importe quel variable numérique et vous pouvez choisir "Show as..." puis "Graph"
zh_cn: 右键单击任何数字，您可以选择“显示为...”，然后选择“图形”

source: The graph widget shows line plots of the value that you selected. It will automatically set the scale and the default time interval that the graph will show will be 30 seconds. You can change that in the setting for the graph (see below).
fr_ca: Le widget Graph affiche un graphique par segments de la valeur du paramètre que vous avez sélectionné. Il définira automatiquement l’échelle. L’intervalle de temps par défaut sera de 30 secondes. Vous pouvez modifier cela dans les paramètres du graphique (voir ci-dessous).
zh_cn: 图像小部件显示您选择的值的线图。它将自动设置比例，图形将显示的默认时间间隔将为30秒。您可以在图的设置中更改这一点(见下面)。

source: The standard time interval is 30 seconds.
fr_ca: L’intervalle de temps standard est de 30 secondes.
zh_cn: 标准时间间隔为 30 秒。

source: Adding Additional Data Values
fr_ca: Ajout de valeurs de données supplémentaires
zh_cn: 添加额外数值

source: For related values it is often desirable to show multiple values on the same graph. To do that, simply drag additional values from the NetworkTables source view (left side of the Shuffleboard window) and drop it onto the graph and that value will be added as shown below. You can continue to drag additional values onto the graph.
fr_ca: Pour les valeurs liées, il est souvent souhaitable d'afficher plusieurs valeurs sur le même graphique. Pour ce faire, faites simplement glisser des valeurs supplémentaires depuis la vue source NetworkTables (côté gauche de la fenêtre Shuffleboard) et déposez-les sur le graphique et cette valeur sera ajoutée comme indiqué ci-dessous. Vous pouvez continuer à faire glisser des valeurs supplémentaires sur le graphique.
zh_cn: 对于相关值，通常需要在同一图表上显示多个值。为此，只需从 NetworkTables 源视图（Shuffleboard 窗口的左侧）拖动其他值并将其放到图表上，该值将如下所示添加。您可以继续将其他值拖到图形上。

source: Graph shows two different data sources on the same graph.
fr_ca: Le graphique montre deux sources de données différentes sur le même graphique.
zh_cn: 图在同一图上显示两个不同的数据源。

source: You can resize the graph vertically to view the legend if it is not displayed as shown in the image below. The legend shows all the sources that are used in the plot.
fr_ca: Vous pouvez redimensionner le graphique verticalement pour afficher la légende si elle ne s'affiche pas, comme indiqué dans l’image ci-dessous. La légende montre toutes les sources qui sont utilisées dans le graphique.
zh_cn: 如果图例没有如下图所示显示，您可以垂直调整图形的大小以查看图例。图例显示了情节中使用的所有来源。

source: When the graph is resized vertically it will show a legend indicating what color goes with what plot.
fr_ca: Lorsque le graphique est redimensionné verticalement, il affiche une légende indiquant quelle couleur accompagne quel tracé.
zh_cn: 当图形垂直调整大小时，它将显示一个图例，指示什么颜色与什么图相配。

source: Setting Graph Properties
fr_ca: Propriétés du graphique
zh_cn: 设置图像性质

source: You can set the number of seconds that are shown in the graph by changing the "Visible time" in the graph widget properties. To access the properties, right-click on the graph and select "Edit properties".
fr_ca: Vous pouvez définir le nombre de secondes qui s’affichent dans le graphique en modifiant la valeur "Visible time" dans les propriétés du widget graphique. Pour accéder aux propriétés, cliquez avec le bouton droit sur le graphique et sélectionnez "Edit properties".
zh_cn: 您可以通过更改图像小部件属性中的“可见时间”来设置在图像中显示的秒数。要访问属性，右键单击图形并选择“Edit properties”。

source: In addition to setting the visible time the graph can selectively turn sources on and off by turning the switch on and off for each of the sources shown in the properties window (see below).
fr_ca: En plus de définir le nombre de secondes qui s’affichent dans le graphique, le graphique peut activer ou désactiver des sources en activant ou en désactivant l’interrupteur pour chacune des sources indiquées dans la fenêtre des propriétés (voir ci-dessous).
zh_cn: 除了设置可见时间之外，图还可以通过打开和关闭属性窗口中显示的每个源的开关，有选择地打开和关闭源(见下文)。

source: Right click to view the properties of each graph.
fr_ca: Cliquez avec le bouton droit pour afficher les propriétés de chaque graphique.
zh_cn: 右键单击以查看每个图形的属性。
