Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/getting-started/shuffleboard-lists.po
Languages: fr_ca, tr_tr, zh_cn

source: Working with Lists
fr_ca: Utilisation des listes
tr_tr: Listelerle Çalışmak
zh_cn: 使用清单

source: Lists in Shuffleboard are sets of tiles grouped together in a vertical layout, making it visually obvious that those tiles are related. In addition, tiles in lists take up less screen space than individual tiles:
tr_tr: Shuffleboard için listeler, döşemelerin birbirleriyle görsel olarak ilişkili olduğunu daha belirgin bir hale getiren yatay bir düzende gruplanmış döşeme setleridir. Bu temel işleve ek olarak listelenmiş döşemeler daha az ekran alanı kaplamaktadır:

source: Tiles in lists don't have individual header labels; they instead have smaller labels within their list entries.
tr_tr: Liste içerisindeki döşemelerin her birine özel bir başlık etiketi bulunmamaktadır; bunun yerine her bir döşeme, liste girişi içerisinde küçük etiketlere sahiptir.

source: Individual tiles placed together create gaps between one another; lists have smaller gaps between tiles.
tr_tr: Yan yana konumlandırılan tekil döşemeler birbirleri arasında boşluklar oluşmasına sebep olmaktadır, liste içerisindeki döşemeler arasında daha küçük boşluklar bulunmaktadır.

source: Creating a list
fr_ca: Création d’une liste
tr_tr: Liste oluşturmak
zh_cn: 建立清单

source: A list can be created as follows:
tr_tr: Bir liste, aşağıdaki adımlarla oluşturulabilmektedir:

source: Right-click on the tile that should be first in the list.
tr_tr: Listede ilk sırada bulunması gereken döşemeye sağ tıklayınız.

source: Select "Add to new layout...", then "List Layout" from the popup menu.
tr_tr: Açılır menüde önce "Add to new layout..." - Yeni bir düzene ekle, ardından "List Layout" - Liste Düzeni seçeneklerini seçiniz

source: A new list will be created labeled "List", and the tile will be at the top of it.
tr_tr: "Liste" olarak etiketlenmiş yeni bir liste oluşturulacak ve listenin başlığı listenin en üstünde olacaktır.

source: Note that tiles in lists do not have header labels; their label is at the bottom of their list entry.
tr_tr: Liste içindeki döşemelerin etiketleri olmadığını unutmayınız; döşemelerin etiketleri, liste girişlerinin en altındadır.

source: Adding tiles to/removing tiles from a list
tr_tr: Bir listeye döşeme eklemek/listeden döşeme çıkarmak

source: A tile can be **added** to an existing list as follows:
tr_tr: Bir döşeme var olan bir listeye aşağıdaki adımlarla **eklenebilmektedir**:

source: Identify the list and the tile to be added.
tr_tr: Liste ve listeye eklenecek başlığı belirleyiniz.

source: Drag the new tile onto the list.
tr_tr: Yeni başlığı listenin üzerine doğru sürükleyiniz.

source: The tile will be added to the list. If the current list size is too small to show it, the tile will be added to the list off-screen and a vertical scrollbar will be added if not already present.
tr_tr: Başlık listeye eklenecektir. Anlık liste boyutu başlığı gösterecek kadar büyük değilse başlık ekran dışında listeye eklenecek ve daha önce listede yoksa, listeye dikey bir kaydırıcı da eklenecektir.

source: A tile can be **removed** from a list by following the process in reverse:
tr_tr: Bir başlık yukardaki adımları tersten takip ederek bir listeden **kaldırılabilmektedir**:

source: Identify the list and the tile within it to be removed.
tr_tr: Liste ve listeden kaldırılacak başlığı belirleyiniz.

source: Drag the tile out of the list and place it anywhere with free space.
tr_tr: Başlığı listenin dışına doğru sürükleyiniz ve boş alan bulunan herhangi bir yere bırakınız.

source: The tile will be removed from the list and placed at that location.
tr_tr: Başlık listeden kaldırılıp bıraktığınız konuma yerleştirilecektir.

source: Rearranging tiles in a list
fr_ca: Réorganisation des vignettes dans une liste
tr_tr: Bir listedeki döşemeleri yeniden düzenlemek
zh_cn: 重新排列列表中的图块

source: Tiles in a list can be rearranged by right-clicking on the tile and selecting:
tr_tr: Bir liste içerisindeki döşemeler, döşemeye sağ tıklayıp aşağıdaki seçeneklerden birini seçerek yeniden düzenlenebilmektedir:

source: :guilabel:`Move up` moves the tile **towards** the *top* of the list.
tr_tr: :guilabel:`Move up` - Yukarı taşı, döşemeyi listenin *yukarısına* **doğru** taşımaktadır.

source: :guilabel:`Move down` moves the tile **towards** the *bottom* of the list.
tr_tr: :guilabel:`Move down` - Aşağı taşı, döşemeyi listenin *aşağısına* **doğru** taşımaktadır.

source: :guilabel:`Send to top` moves the tile **to** the *top* of a list.
tr_tr: :guilabel:`Send to top` - Tepeye gönder, döşemeyi listenin *tepesine* **doğru** taşımaktadır.

source: :guilabel:`Send to bottom` moves the tile **to** the *bottom* of a list.
tr_tr: :guilabel:`Send to bottom` - En alta gönder, döşemeyi listenin *en altına* **doğru** taşımaktadır.

source: There are two buttons labeled :guilabel:`Remove`, and each button does:
tr_tr: :guilabel:`Remove` - Kaldır olarak etiketlenmiş iki tane tuş vardır:

source: The **top** :guilabel:`Remove` button (above the pinline; section of dropdown with grayed-out *tile* label) **deletes** the *tile* from the Shuffleboard layout.
tr_tr: **üstteki** (açılır listenin gri renkli *tile* etiketli bölümündeki, iğneli hatın üstündeki) :guilabel:`Remove` tuşu, *döşemeyi* Shuffleboard düzenlemesinden **silmektedir**.

source: The **bottom** :guilabel:`Remove` button (below the pinline; section of dropdown with grayed-out *list* label) **deletes** the *list and all tiles inside it* from the Shuffleboard layout.
tr_tr: **alttaki** (açılır listenin gri renkli *tile* etiketli bölümündeki, iğneli hatın altındaki) :guilabel:`Remove` tuşu, *listeyi ve içindeki tüm döşemeleri* Shuffleboard düzenlemesinden **silmektedir**.

source: If you want to take an entry out of a list without deleting it, see `Adding tiles to/removing tiles from a list`_.
tr_tr: Bir girişi, listeyi silmeden listeden çıkarmak istiyorsanız bkz. ` Bir listeye döşeme eklemek/listeden döşeme çıkarmak`_.

source: Renaming a list
fr_ca: Renommer une liste
tr_tr: Listeyi yeniden adlandırmak
zh_cn: 重命名清单

source: You can rename a list by double-clicking on the list label and changing the name. Click outside the label to save changes.
tr_tr: Liste etiketine çift tıklayıp listenin adını değiştirerek bir listeyi yeniden adlandırabilirsiniz. Değişiklikleri kaydetmek için. etiketin dışına tıklayınız.

source: Lists are sets of tiles that are be logically grouped together in a vertical layout. When tiles are added to a list,it becomes visually obvious that the tiles are related in function. In addition tiles in lists take up less screen space than the same tiles directly on the desktop because tiles in a list don't display the dark window title, but instead display a smaller textual label documenting the contents of the list.
zh_cn: 列表是在垂直布局中按逻辑分组在一起的一组图块。将图块添加到列表中后，从视觉上看，图块在功能上是相关的。此外，列表中的图块比直接在桌面上的相同图块占用更少的屏幕空间，因为列表中的图块不会显示深色窗口标题，而是显示较小的文本标签来记录列表的内容。

source: A list can be created by: 1. Right-clicking on the first tile that should go into the list. 2. Select the "Add to new layout..." option from the popup menu. 3. A new list will be created called "List" and the tile will be at the top of it. Notice that tiles in lists do not have the window title at the top, but instead have the text that was in the window title.
fr_ca: Une liste peut être créée ainsi : 1. Cliquez avec le bouton droit sur la première vignette qui doit entrer dans la liste. 2. Sélectionnez l’option "Add to new layout..." dans le menu contextuel. 3. Une nouvelle liste sera créée appelée "List" et la vignette sera en haut de celle-ci. Notez que les vignettes dans les listes n’ont pas le titre de fenêtre en haut, mais portent plutôt le texte qui était dans le titre de la fenêtre.
zh_cn: 可以通过以下方式创建列表：1.右键单击应进入列表的第一个图块。 2.从弹出菜单中选择“添加到新布局...”选项。 3.将创建一个新列表，称为“列表”，并且图块将位于其顶部。请注意，列表中的图块顶部没有窗口标题，而是具有窗口标题中的文本。

source: Adding tiles to a list
fr_ca: Ajout de vignettes à une liste
zh_cn: 将瓷砖添加到列表

source: Add tiles to a list layout by: 1. identify the list and the tile to be added. 2. Drag the new tile onto the list. 3. The tile will be added to the list. If there is no room as the list is currently sized, the tile will be added off the end of the list and a vertical scrollbar will be added if it's not already there.
fr_ca: Pour ajouter des vignettes à une liste: 1. Identifiez la liste et la vignette à ajouter. 2. Faites glisser la nouvelle vignette sur la liste. 3. La vignette sera ajoutée à la liste. S’il n’y a pas de place car la liste est actuellement dimensionnée, la vignette sera ajoutée à la fin de la liste et une barre de défilement verticale sera ajoutée si elle n’est pas déjà présente.
zh_cn: 通过以下步骤将图块添加到列表布局：1.标识列表和要添加的图块。 2.将新图块拖到列表上。 3.磁贴将添加到列表中。如果由于列表当前的大小而没有空间，则将在列表的末尾添加磁贴，如果尚不存在，则会添加垂直滚动条。

source: Tiles in a list can be rearranged by right-clicking on the tile to be moved and selecting:
fr_ca: Les vignettes d’une liste peuvent être réorganisées en cliquant avec le bouton droit sur la vignette à déplacer et en sélectionnant :
zh_cn: 右键单击要移动的图块并选择以下选项，可以重新排列列表中的图块：

source: "Move up" to move the tile before the previous tile
fr_ca: "Move up" pour positionner la vignette au-dessus de la vignette précédente
zh_cn: “上移”将图块移动到上一个图块之前

source: "Move down" to move the tile after the next tile
fr_ca: "Move down" pour positionner la vignette sous la vignette suivante
zh_cn: “下移”在下一个图块之后移动图块

source: "Send to top" to move the tile to the top of the list
fr_ca: "Send to top" pour déplacer la vignette en haut de la liste
zh_cn: “发送到顶部”将图块移至列表顶部

source: "Send to bottom" to move the tile to the bottom of the list
fr_ca: "Send to bottom" pour déplacer la vignette en bas de la liste
zh_cn: “发送到底部”将图块移到列表的底部

source: "Remove from list" to delete the tile from the list.
fr_ca: "Remove from list" pour supprimer la vignette de la liste.
zh_cn: “从列表中删除”可从列表中删除磁贴。

source: You can rename a list by double-clicking on the list title and changing the name. Click outside fo the title to save the changes
fr_ca: Vous pouvez renommer une liste en cliquant deux fois sur le titre de la liste et en modifiant le nom. Cliquez à l’extérieur du titre pour enregistrer les modifications
zh_cn: 您可以通过双击列表标题并更改名称来重命名列表。在标题外单击以保存更改
