Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/getting-started/shuffleboard-faq.po
Languages: fr_ca, zh_cn

source: Shuffleboard FAQ, issues, and bugs
fr_ca: FAQ, problèmes et bogues concernant Shuffleboard
zh_cn: Shuffleboard 常见问题，问题和错误

source: Shuffleboard as well as most of the other control system components were developed with Java 11 and will not work with Java 8. Be sure before reporting problems that your computer has Java 11 installed and is set as the default Java Environment.
fr_ca: La plupart des composants du système de contrôle tel que Shuffleboard ont été développés avec Java 11. Ils ne sont donc pas compatibles avec Java 8. Avant de signaler un problème assurez-vous d'avoir Java 11 installé en tant qu'environnement Java par défaut.
zh_cn: Shuffleboard以及大多数其他控制系统组件是用Java 11开发的，不会在Java 8中工作。在报告问题之前，请确保您的计算机安装了Java 11，并将其设置为默认Java环境。

source: Frequently Asked Questions
fr_ca: Foire aux questions
zh_cn: 常见问题

source: How do I report issues, bugs or feature requests with Shuffleboard?
fr_ca: Comment puis-je signaler des problèmes, des bogues et faire des demandes de fonctionnalités concernant Shuffleboard?
zh_cn: 我如何用 Shuffleboard 报告问题，错误或功能请求？

source: Bugs, issues, and feature requests can be added on the Shuffleboard GitHub page by creating an issue. We will try to address them as they are entered into the system. Please try to look at existing issues before creating new ones to make sure you aren't duplicating something that has already been reported or work that is planned. You can find the issues on the `Shuffleboard GitHub page <https://github.com/wpilibsuite/shuffleboard>`__.
fr_ca: Les bogues, problèmes et demandes de fonctionnalités peuvent être ajoutés sur la page Shuffleboard GitHub en créant une requête (sous forme de problème). Nous essaierons de les aborder au fur et à mesure de leur entrée dans le système. Veuillez essayer d'examiner les problèmes existants avant d'en créer de nouveaux pour vous assurer que vous ne dupliquez pas quelque chose qui a déjà été signalé ou un travail prévu. Vous pouvez trouver les problèmes sur la page `Shuffleboard GitHub page <https://github.com/wpilibsuite/shuffleboard>`__.
zh_cn: 错误，问题，和功能请求可以添加到Shuffleboard GitHub页面通过创建一个问题。当它们进入系统时，我们将尝试解决它们。在创建新问题之前，请尝试查看现有问题，以确保您没有复制已经报告的问题或计划中的工作。您可以在' Shuffleboard GitHub页面 ' __上找到问题。<https://github.com/wpilibsuite/shuffleboard>`__

source: How can I add my own widgets or other extensions to Shuffleboard?
fr_ca: Comment ajouter mes propres widgets et extensions à Shuffleboard?
zh_cn: 我如何添加自己的小部件或其他扩展到Shuffleboard？

source: The `Shuffleboard wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__ has a large amount of documentation on extending the program with custom plugins. In the future we will be posting a sample plugin project that can be used for additional custom widgets, but for now the wiki documentation is complete.
fr_ca: La page `Shuffleboard wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__ contient beaucoup d'informations sur comment développer l'application avec des modules d'extension personnalisés. Nous publierons un exemple de projet d'extension pour personnaliser des widgets. Pour l'instant, la documentation wiki est considérée complète.
zh_cn: 在`Shuffleboard wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__有大量的文档扩展程序与自定义插件。在未来，我们将发布一个示例插件项目，可以用于额外的自定义小部件，但目前wiki文档已经完成。

source: How can I build Shuffleboard from the source code?
fr_ca: Comment compiler et construire Shuffleboard à partir du code source?
zh_cn: 我如何从源代码构造Shuffleboard？

source: You can get the source code by downloading, cloning, or forking the repository on the GitHub site. To build and run Shuffleboard from the source, make sure that the current directory is the top level source code and use one of these commands:
fr_ca: Vous pouvez obtenir le code source en téléchargeant, clonant ou fourchant la bibliothèque sur Github. Afin de construire et rouler Shuffleboard à partir du code source, placez le répertoire courant à la racine du code source, puis utilisez l'une des commandes suivantes :
zh_cn: 你可以在GitHub网站上下载、克隆或分叉存储库来获得源代码。要从源代码构建和运行Shuffleboard，请确保当前目录是顶级源代码，并使用以下命令之一:

source: Application
zh_cn: 应用

source: Command (for Windows systems run the gradlew.bat file)
fr_ca: Commande (sur Windows lancer le fichier gradlew.bat)
zh_cn: 指令(对于Windows系统运行gradlew.bat文件)

source: Running Shuffleboard
fr_ca: Lancer Shuffleboard
zh_cn: 运行Shuffleboard

source: Building the APIs and utility classes for plugin creation
fr_ca: Construire les APIs et les classes utilitaires pour la création de modules d'extension
zh_cn: 为插件创建构建api和实用程序类

source: Building the complete application jar file
fr_ca: Construire le fichier .jar de l'application
zh_cn: 构建完整的应用程序jar文件
