Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/getting-started/shuffleboard-tabs.po
Languages: es_mx, fr_ca, zh_cn

source: Creating and manipulating tabs
es_mx: Crear y manipular pestañas
fr_ca: Création et manipulation des onglets
zh_cn: 创建和操作标签

source: The tabbed layout the Shuffleboard uses help separate different "views" of your robot data and make the displays more useful. You might have a tab the has the display for helping debug the robot program and a different tab for use in competitions. There are a number of options that make tabs very powerful. You can control which data from NetworkTables or other sources appears in each of your tabs using the auto-populate options described later in this article.
es_mx: El diseño de pestañas que la Shuffleboard usa ayuda a separar diferentes "vistas" de los datos de su robot y hacer las visualizaciones más útiles. Puede que usted tenga una pestaña que ayude a depurar el programa del robot y una pestaña diferente para usar en competencias. Existen numerosas opciones que hacen a las pestañas muy útiles. Usted puede controlar que datos de la NetworkTable u otras fuentes aparecen en cada una de tus pestañas usando la opción de auto-populate descrita más adelante en este artículo.
fr_ca: La présentation par onglets qu'utilise Shuffleboard aide à séparer différentes "vues" de données de votre robot et à rendre l'affichage plus pratique. Par exemple, vous pourriez avoir un onglet qui affiche des données pour le débogage de votre robot et un autre onglet pour l'utilisation en tournoi. Il existe plusieurs options qui rendent les onglets très puissants. Vous pouvez contrôler quelles données de NetworkTables ou d'autres sources s'affichent dans chacun de vos onglets en utilisant les options d'ajout automatique qui sont décrites plus loin dans cet article.
zh_cn: Shuffleboard使用的选项卡式布局可帮助分隔机器人数据的不同“视图”并使显示更加有用。您可能有一个选项卡，其中有用于帮助调试机器人程序的显示，还有一个用于比赛的其他选项卡。有许多选项使选项卡非常强大。您可以使用本文后面描述的自动填充选项来控制每个选项卡中出现的来自NetworkTables或其他来源的数据。

source: Default tabs
es_mx: Pestañas default
fr_ca: Onglets par défaut
zh_cn: 默认标签

source: When you open Shuffleboard for the first time there are two tabs, labeled SmartDashboard and LiveWindow. These correspond to the two views that SmartDashboard had depending on whether your robot is running in Autonomous/Teleop or Test mode. In shuffleboard both of these views are available any time.
es_mx: Cuando usted abre la Shuffleboard por primera vez hay dos pestañas, etiquetadas como SmartDashboard y LiveWindow. Estas corresponden a las dos vistas que tiene la SmartDashboard dependiendo en si tu robot está en modo Autónomo/Teleop o Test mode. En la Shuffleboard ambas vistas son disponibles cuando sea.
fr_ca: Lorsque vous ouvrez Shuffleboard pour la première fois, deux onglets intitulés SmartDashboard et LiveWindow sont présents. Ils représentent les deux vues SmartDashboard dépendamment si votre robot est en mode autonome/téléopéré ou en mode test. Dans Shuffleboard, les deux vues sont disponibles en tout temps.
zh_cn: 首次打开Shuffleboard时，有两个选项卡，分别标记为SmartDashboard和LiveWindow。 这些对应于SmartDashboard的两个视图，具体取决于您的机器人是在自主/远程运行还是在测试模式下运行。 在沙狐球中，这两个视图随时都可用。

source: On the SmartDashboard tab all the values that are written using the SmartDashboard.putType() set of methods. On the LiveWindow tab all the autogenerated debugging values are shown.
es_mx: En la pestaña SmartDashboard todos los valores que son escritos usan el conjunto de métodos SmartDashboard.putType(). En la pestaña LiveWindow todos los valores autogenerados de la depuración son mostrados.
fr_ca: Les valeurs écrites en invoquant les différentes variantes de la méthode SmartDashboard.putType() sont affichées dans l'onglet SmartDashboard. Les valeurs de débogage générées automatiquement sont affichées dans l'onglet LiveWindow.
zh_cn: 在SmartDashboard选项卡上，使用SmartDashboard.putType（）方法集写入的所有值。 在“ LiveWindow”选项卡上，将显示所有自动生成的调试值。

source: Switching between tabs
es_mx: Cambiar entre pestañas
fr_ca: Navigation entre les onglets
zh_cn: 在标签之间切换

source: You can switch between tabs clicking on the tab label at the top of the window. In the case above, simply click on SmartDashboard or LiveWindow to see the values that are associated with each tab.
es_mx: Usted puede cambiar entre pestañas al dar click en la pestaña en la parte superior de la ventana. En el caso de arriba, simplemente dé click en SmartDashboard o LiveWindow para ver los valores asociados con cada pestaña.
fr_ca: Vous pouvez naviguer entre les onglets en cliquant sur leur étiquette en haut de la fenêtre. Dans le cas ci-dessus, cliquez simplement sur SmartDashboard ou LiveWindow pour voir les valeurs associées à chaque onglet.
zh_cn: 单击窗口顶部的标签标签，可以在标签之间切换。 在上述情况下，只需单击SmartDashboard或LiveWindow即可查看与每个选项卡关联的值。

source: Adding and Hiding Tabs
fr_ca: Ajouter ou masquer des onglets
zh_cn: 添加和隐藏选项卡

source: You can add additional tabs by clicking on the plus(+) symbol just to the right of the last tab. Once you create a new tab you can set the label by double-clicking on the label in the tab and editing it. You can also right-click on the tab or use the Tab menu to bring up the tab preferences and from that window you can change the name by editing the Title field.
es_mx: Usted puede agregar pestañas adicionales al dar click en símbolo de más (+) justo al lado de la última pestaña. Una vez que usted ha creado una nueva pestaña puede establecer la etiqueta al dar doble click en la etiqueta de la pestaña y editarla. También puede dar click derecho en la pestaña o usar el Tab menú/menú de pestaña para sacar las preferencias de la pestaña y desde esa ventana usted puede cambiar el nombre al editar el campo de Title/título.
fr_ca: Vous pouvez ajouter des onglets supplémentaires en cliquant sur le symbole plus(+) juste à droite du dernier onglet. Une fois que vous avez créé un nouvel onglet, vous pouvez définir son étiquette en double-cliquant sur celle-ci et en modifiant le texte. Vous pouvez également cliquer avec le bouton droit sur l'onglet ou utiliser le menu Tab pour ouvrir les préférences d'onglets. À partir de cette fenêtre, vous pouvez changer le nom en modifiant le champ Title.
zh_cn: 您可以通过单击最后一个选项卡右侧的加号（+）来添加其他选项卡。 创建新选项卡后，可以通过双击选项卡中的标签并进行编辑来设置标签。 您也可以右键单击选项卡，或使用 选项卡 菜单调出选项卡首选项，然后在该窗口中通过编辑 标题 字段来更改名称。

source: Modifying tab properties in Shuffleboard
fr_ca: Modification des propriétés de l’onglet dans Shuffleboard
zh_cn: 在 Shuffleboard 中修改选项卡属性

source: You can hide tabs by clicking the minus(-) symbol to the left of the selected tab name. Since tabs are generated based on the relevant :term:`NetworkTable <NetworkTables>`, it is not possible to permanently delete them without deleting the table.
fr_ca: Vous pouvez masquer les onglets en cliquant sur le symbole moins (-) à gauche du nom de l'onglet sélectionné. Étant donné que les onglets sont générés en fonction du :term:`NetworkTable <NetworkTables>` pertinent, il n'est pas possible de les supprimer définitivement sans supprimer la table.
zh_cn: 您可以通过单击所选选项卡名称左侧的减号 (-) 来隐藏选项卡。由于选项卡是基于相关的:term:`NetworkTable` 生成的，所以不可能在不删除表的情况下永久删除它们。

source: Deleting a Shuffleboard Tab
fr_ca: Suppression d'un onglet du Shuffleboard
zh_cn: 删除沙狐球选项卡

source: Setting the tab to auto-populate
es_mx: Configurar la pestaña para llenar automáticamente
fr_ca: Configuration des onglets pour remplissage automatique
zh_cn: 将标签设置为自动填充

source: One of the most powerful features with tabs is to have them automatically populate new values based on a source prefix that is supplied in the tab Preferences pane. In the above example the Preferences pane has a Source prefix of "SmartDashboard/Shooter" and Auto populate is turned on. Any values that are written using the SmartDashboard class that specifies a sub-key of Shooter will automatically appear on that tab. Note: keys that match more than one Source prefix will appear in both tabs. Because those keys also start with SmartDashboard/ and that's the Source prefix for the default SmartDashboard tab, those widgets will appear in both panes. To only have values appear in one pane, you can use NetworkTables to write labels and values and use a different path that is not under SmartDashboard. Alternatively you could let everything appear in the SmartDashboard tab making it very cluttered, but have specific tabs for your needs that will be better filtered.
es_mx: Una de las funciones más útiles en las pestañas es hacer que llenen automáticamente nuevos valores basados en un prefijo de fuente que es proporcionado en el Preferences pane de la pestaña. En el ejemplo de abajo el Preferences pane tiene un prefijo de fuente de “SmartDashboard/Shooter” y Autopopulate está habilitado. Cualquier valor que es escrito usando la clase SmartDashboard que especifica una subllave de Shooter automáticamente aparecerá en la pestaña. Nota: Las llaves que queden con más de un prefijo de Fuente aparecerán en ambas pestañas. Porque esas llaves también inician con SmartDashboard/ y esa es el prefijo de fuente para la pestaña SmartDashboard predeterminada, esos widgets aparecerán en ambas ventanas. Para solo tener valores que aparezcan en una ventana usted puede utilizar NetworkTables para escribir etiquetas y valores y usar un diferente camino que no esté bajo la SmartDashboard. De otra manera usted puede dejar que todo aparezca en la misma SmartDashboard haciéndolo muy desordenado, pero teniendo pestañas específicas para sus necesidades que serán filtradas.
fr_ca: L'une des fonctionnalités les plus puissantes des onglets est de les configurer pour se remplir automatiquement de nouvelles valeurs en fonction d'un préfixe source fourni dans la fenêtre de préférences de l'onglet. Dans l'exemple ci-dessus, la fenêtre de préférences a un préfixe source de "SmartDashboard/Shooter" et l'option de remplissage automatique des valeurs, Auto populate, est activée. Toutes les valeurs écrites à l'aide de la classe SmartDashboard qui spécifie une sous-clé Shooter apparaîtront automatiquement sur cet onglet. Remarque: les clés qui correspondent à plusieurs préfixes Sources apparaîtront dans chacun de ces onglets. Étant donné que ces clés commencent également par SmartDashboard/ et qu'il s'agit du préfixe Source de l'onglet SmartDashboard par défaut, ces widgets apparaîtront dans les deux onglets. Pour que les valeurs n'apparaissent que dans un seul onglet, vous pouvez utiliser NetworkTables pour écrire des étiquettes et des valeurs et utiliser un chemin différent qui ne commence pas par SmartDashboard/. Alternativement, vous pouvez décider de tout laisser apparaître dans l'onglet SmartDashboard tout en ayant d'autres onglets spécifiques à vos besoins qui seront filtrés. L'onglet SmartDashboard sera très encombré, mais les autres onglets seront comme vous le voulez.
zh_cn: 选项卡最强大的功能之一是让它们根据选项卡“首选项”窗格中提供的源前缀自动填充新值。 在上面的示例中，“首选项”窗格的“源”前缀为“ SmartDashboard / Shooter”，并且“自动填充”处于打开状态。 使用SmartDashboard类编写的任何指定Shooter子项的值都将自动显示在该选项卡上。 注意：与多个Source前缀匹配的键将显示在两个选项卡中。 由于这些键也以SmartDashboard /开头，并且是默认SmartDashboard选项卡的Source前缀，因此这些小部件将同时出现在两个窗格中。 若要仅在一个窗格中显示值，则可以使用NetworkTables编写标签和值，并使用不在SmartDashboard下的其他路径。 另外，您可以让所有内容都显示在SmartDashboard选项卡中，使其变得很混乱，但是可以根据需要设置特定的选项卡，以便更好地进行过滤。

source: Using the tab grid and spacing
es_mx: Utilizar la cuadrícula de pestañas y el espaciado
fr_ca: Utilisation de la grille et de l'espacement de l'onglet
zh_cn: 使用标签格和间距

source: Each tab can have it's own Tile size (number of pixels per large square). So some tabs might have coarser resolution for easier layout and others might have a fine grid. The Tile size in the Tab preferences overrides any global settings in the Shuffleboard preferences. In addition, you can specify the padding between the drawing in the widget and the edge of the of the widget. If you program user interfaces these parameters are usually referred to as horizontal and vertical gap (hgap, vgap).
es_mx: Cada pestaña tiene su propio tamaño rectangular (número de pixeles por largo al cuadrado). Entonces algunas pestañas puede que tengan una resolución más pesada para una vista más fácil y otras pueden tener una cuadrícula fina. El tamaño de los rectángulos en Tab preferences anulan cualquier configuración global en las preferencias de la Shuffleboard. Además, usted puede especificar el vacío entre el dibujo en el widget y el borde del widget. Si su programa usa interfaces estos parámetros son referidos usualmente como espacio horizontal y vertical (hgap, vgap).
fr_ca: Chaque onglet peut avoir sa propre taille de vignette (nombre de pixels par grand carré). Ainsi, certains onglets peuvent avoir une résolution plus grossière pour une mise en page plus facile et d'autres peuvent avoir une grille fine. Le paramètre de la taille de vignette, Tile size, dans la fenêtre de préférences de l'onglet remplace les paramètres globaux dans les préférences globales Shuffleboard. De plus, vous pouvez spécifier l'espacement entre le contenu d'un widget et le bord du widget. Si vous programmez des interfaces utilisateur, ces paramètres sont généralement appelés écart horizontal et écart vertical (hgap, vgap).
zh_cn: 每个选项卡都可以有自己的Tile大小(每个大方块的像素个数)。因此，一些选项卡可能有更粗的分辨率，以便更容易的布局，另一些选项卡可能有一个精细的网格。Tab偏好中的Tile大小复盖了Shuffleboard偏好中的任何全局设置。此外，还可以指定小部件中绘图与小部件边缘之间的填充。如果编写用户界面，这些参数通常被称为水平和垂直间隙( hgap，vgap )。

source: Moving widgets between tabs
es_mx: Mover widgets entre pestañas
fr_ca: Déplacement des widgets entre les onglets
zh_cn: 在选项卡之间移动小部件

source: Currently there is no way to easily move widgets between tabs without deleting it from one tab and dragging the field from the sources hierarchy on the left into the new pane. We hope to have that capability in a subsequent update soon.
es_mx: Actualmente no existe una manera sencilla para mover widgets entre pestañas sin tener que borrarlo de una pestaña y arrástralo al área de la jerarquía de las fuentes en la izquierda dentro de una nueva ventana. Esperamos tener esta capacidad en una actualización futura.
fr_ca: Actuellement, il n'existe aucun moyen de déplacer facilement les widgets entre onglets sans les supprimer d'un onglet et en faisant glisser le champ de la hiérarchie Sources sur la gauche vers le nouvel onglet. Nous espérons bientôt avoir cette fonctionnalité dans une prochaine mise à jour.
zh_cn: 当前，没有一种方法可以轻松地在各个选项卡之间移动小部件，而无需将其从一个选项卡中删除并将该字段从左侧的源层次结构拖动到新窗格中。 我们希望在以后的更新中具有该功能。
