Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/getting-started/shuffleboard-tour.po
Languages: fr_ca, zh_cn

source: Tour of Shuffleboard
fr_ca: Aperçu de Shuffleboard
zh_cn: 浏览Shuffleboard

source: Shuffleboard is a dashboard for FRC\ |reg| based on newer technologies such as JavaFX that are available to Java programs. It is designed to be used for creating dashboards for C++ and Java programs. If you've used SmartDashboard in the past then you are already familiar with many of the features of Shuffleboard since they fundamentally work the same way. But Shuffleboard has many features that aren't in SmartDashboard. Here are some of the highlights:
fr_ca: Shuffleboard est un tableau de bord pour FRC\ |reg| basé sur de nouvelles technologies telles que JavaFX qui sont disponibles pour les programmes écrits en Java. Il est conçu pour être utilisé pour la création des tableaux de bord pour les programmes écrits en C++ et Java. Si vous avez utilisé SmartDashboard dans le passé, alors vous êtes déjà familier avec la plupart des fonctionnalités de Shuffleboard car ils fonctionnent fondamentalement de la même manière. Mais Shuffleboard a de nombreuses fonctionnalités qui ne sont pas dans SmartDashboard. Voici quelques-uns des faits saillants:
zh_cn: Shuffleboard是FRC \ | reg |基于Java程序可用的新技术 例如JavaFX 的仪表板。它旨在用于为C ++和Java程序创建仪表板。如果您过去曾经使用过SmartDashboard，那么您已经熟悉Shuffleboard的许多功能，因为它们的工作原理基本相同。但是Shuffleboard具有SmartDashboard所没有的许多功能。以下是一些精彩片段：

source: Graphics is based on **JavaFX**, the Java graphics standard. Each of the components has an associated style sheet so it becomes possible to have different "skins" or "themes" for Shuffleboard. We supply default light and dark themes.
fr_ca: Les graphiques sont basés sur **JavaFX**, la norme des graphiques en Java. Chacune des composantes a une feuille de style associée de telle sorte qu’on peut avoir une variété de "skins" ou "thèmes" pour Shuffleboard. Les thèmes fournis par défaut sont le clair et le foncé.
zh_cn: 图形基于Java图形标准** JavaFX **。每个组件都有一个关联的样式表，因此有可能为Shuffleboard使用不同的“皮肤”或“主题”。我们提供默认的浅色和深色主题。

source: Shuffleboard supports **multiple sheets for the display of your data**. In fact you can create a new sheet (shown as a tab in the Shuffleboard window) and indicate if and which data should be autopopulated on it. By default there is a Test tab and a SmartDashboard tab that are autopopulated as data arrives. Other tabs might be for robot debugging vs. driving.
fr_ca: Shuffleboard prend en charge **plusieurs feuilles pour la visualisation de vos données**. En fait, vous pouvez créer une nouvelle feuille (se présentant sous la forme d’un onglet dans la fenêtre de Shuffleboard) et préciser si et quelles données doivent s'y insérer automatiquement. Par défaut, il y a un onglet Test et un onglet SmartDashboard qui se remplissent automatiquement à mesure que les données sont disponibles. D’autres onglets peuvent être ajoutés pour le débogage du robot et son pilotage.
zh_cn: Shuffleboard支持**多页显示数据**。实际上，您可以创建一个新工作表（在Shuffleboard窗口中显示为选项卡），并指示是否以及应该在哪些上自动填充哪些数据。默认情况下，有一个“测试”选项卡和一个“智能仪表板”选项卡，它们会在数据到达时自动填充。其他选项卡可能用于机器人调试与驾驶。

source: Graphical **display elements (widgets) are laid out on a grid** to keep the interface clean and easy to read. You can change the grid size to have more or less resolution in your layouts and visual cues are provided to help you change your layout using drag and drop. Or you can choose to turn off the grid lines although the grid layout is preserved.
fr_ca: Les **éléments graphiques d’affichage (widgets) sont disposés sur une grille** pour maintenir l’interface soignée et facile à lire. Vous pouvez modifier la taille de la grille pour obtenir plus ou moins de précision dans vos dispositions et des repères visuels sont fournis pour vous aider à modifier votre disposition à l’aide de glisser-déposer. Vous pouvez également choisir de retirer les lignes de grille et, ce faisant, la disposition de la grille est quand même préservée.
zh_cn: 图形化的 **display elements (widgets) are laid out on a grid**，以保持界面清洁并易于阅读。 您可以更改网格大小以在布局中获得或多或少的分辨率，并且提供了视觉提示来帮助您使用拖放来更改布局。 或者，即使保留了网格布局，也可以选择关闭网格线。

source: Layouts are saved and the previous layout is instantiated by default when you run shuffleboard again.
fr_ca: Les dispositions sont enregistrées et la version la plus récente est celle qui est activée par défaut lorsque vous ouvrez à nouveau Shuffleboard.
zh_cn: 当您再次运行 shuffleboard 时，默认情况下会保存布局并实例化先前的布局。

source: There is a **record and playback** feature that lets you review the data sent by your robot program after it finishes. That way you can carefully review the actions of the robot if something goes wrong.
fr_ca: Il existe une fonction **record and playback** qui vous permet d’examiner à postériori les données envoyées par le programme de votre robot. De cette façon, si quelque chose ne n'a pas fonctionné normalement, vous pouvez examiner minutieusement les actions du robot.
zh_cn: 有一项 **record and playback** 功能，可让您在机器人程序完成后查看其发送的数据。 这样，如果出现问题，您可以仔细检查机器人的动作。

source: **Graph widgets are available for numeric data** and you can drag data onto a graph to see multiple points at the same time and on the same scale.
fr_ca: **Des widgets graphiques sont disponibles pour les données numériques** et vous pouvez faire glisser ces données sur un graphique pour afficher simultanément plusieurs points et à la même échelle.
zh_cn: **Graph widgets are available for numeric data**，您可以将数据拖动到图形上，以同时查看相同大小的多个点。

source: You can extend Shuffleboard by writing your own widgets that are specific to your team's requirements. Documentation on extending it are on the `Shuffleboard GitHub Wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__.
fr_ca: Vous pouvez augmenter les capacités de Shuffleboard en écrivant vos propres widgets spécifiques aux besoins de votre équipe. La documentation relative à son extension se trouve sur le `Shuffleboard GitHub Wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__.
zh_cn: 您可以通过编写自己的特定于团队需求的小部件来扩展Shuffleboard。 关于扩展它的文档位于`Shuffleboard GitHub Wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__上。

source: **Sources area:** Here are data sources from which you can choose values from NetworkTables or other sources to display by dragging a value into one of the tabs
fr_ca: **Zone sources:** Dans cette zone se trouvent des sources à l'origine des données dont vous pouvez choisir les valeurs à partir de NetworkTables ou d’autres sources à afficher en faisant glisser une valeur dans l’un des onglets
zh_cn: **Sources area:**这是数据源，您可以从NetworkTables或其他源中选择值，方法是将值拖到选项卡之一中以显示

source: **Tab panes:** This is where you data is displayed from the robot or other sources. In this example it is Test-mode subsystems that are shown here in the LiveWindow tab. This area can show any number of tabbed windows, and each window has it's own set of properties like grid size and auto-populate.
fr_ca: **Volets d'onglets:** C’est ici que sont affichées les données en provenance du robot ou d’autres sources. Dans cet exemple, ce sont les sous-systèmes en mode Test qui s'affichent sous l’onglet LiveWindow. Dans cette zone, on peut afficher autant d'onglets qu'on le souhaite, et chaque fenêtre possède son propre ensemble de propriétés comme la taille de la grille et la capacité de s'auto-remplir.
zh_cn: **Tab panes:**.这是您从机器人或其他来源显示数据的地方。 在本示例中，此处显示在LiveWindow选项卡中的是测试模式子系统。 该区域可以显示任意数量的选项卡式窗口，并且每个窗口都有其自己的属性集，例如网格大小和自动填充。

source: **Record/playback controls:** set of media-like controls where you can playback the current session to see historical data
fr_ca: **Contrôles d’enregistrement/lecture :** Ensemble de contrôles de type média qui vous permet de rejouer la session sélectionnée pour voir les données enregistrées
zh_cn: **Record/playback controls:**一组类似媒体的控件，您可以在其中播放当前会话以查看历史数据

source: Starting Shuffleboard
fr_ca: Démarrage de Shuffleboard
zh_cn: 启动沙狐球

source: You can start Shuffleboard in one of four ways:
fr_ca: Vous pouvez démarrer Shuffleboard de quatre façons :
zh_cn: 您可以通过以下四种方式之一启动Shuffleboard：

source: You can automatically start it when the Driver Station starts by setting the "Dashboard Type" to Shuffleboard in the settings tab as shown in the picture above.
fr_ca: Vous pouvez le lancer automatiquement lorsque Driver Station démarre en sélectionnant "Shuffleboard" dans "Dashboard Type" de l’onglet Configuration comme indiqué dans l’image ci-dessus.
zh_cn: 您可以通过在设置标签中将"Dashboard Type"设置为Shuffleboard来在Driver Station启动时自动启动它，如上图所示。

source: You can run it by double-clicking the Shuffleboard icon on the Windows Desktop.
fr_ca: Vous pouvez le démarrer en double-cliquant sur l’icône Shuffleboard localisée sur le Bureau Windows.
zh_cn: 您可以通过双击Windows桌面上的Shuffleboard图标来运行它。

source: You can run it by double-clicking on the shuffleboard.XXX file (where XXX is ``.vbs`` on Windows and ``.py`` on Linux or macOS) in ``~/WPILib/YYYY/tools/`` (where YYYY is the year and ~ is ``C:\Users\Public`` on Windows). This is useful on a development system that does not have the Driver Station installed such as a macOS or Linux system.
fr_ca: Vous pouvez l’exécuter en double-cliquant sur le fichier shuffleboard.XXX (où XXX est ``.vbs`` sous Windows et ``.py`` sous Linux ou macOS) dans ``~/WPILib/YYYY/tools/`` (où YYYY est l’année et ~ est ``C:\Users\Public`` sous Windows). Ceci est utile sous un système de développement où l'application Driver Station n'est pas installée tel que le système macOS ou Linux.
zh_cn: 您可以通过双击〜/ WPILib / YYYY / tools /中的shuffleboard.XXX文件（Windows上的XXX是.vbs，Linux或macOS上的.py）来运行它。 `（其中YYYY是年份，在Windows上〜是``C：\ Users \ Public''）。 这对于未安装Driver Station的开发系统例如macOS或Linux系统很有用。

source: You can start it from the command line by typing the command: ``shuffleboard`` on Windows or ``python shuffleboard.py`` on macOS or Linux from ``~/WPILib/YYYY/tools`` directory (where YYYY is the year and ~ is ``C:\Users\Public`` on Windows). This is often easiest on a a development system that doesn't have the Driver Station installed.
fr_ca: Vous pouvez le lancer à partir de la ligne de commande en tapant la commande : ``shuffleboard`` sur Windows, ou ``python shuffleboard.py`` sur macOS ou Linux, à partir du répertoire ``~/WPILib/YYYY/tools`` (où YYYY est l’année et ~ est ``C:\Users\Public`` sur Windows). Ceci est souvent plus facile dans un environnement de développement où Driver Station n'est pas installé.
zh_cn: 您可以在命令行中输入以下命令从命令行启动它：Windows上的``shuffleboard`` 或``python shuffleboard.py`` 在macOS或Linux上的``~/WPILib/YYYY/tools`` 目录（其中YYYY为 年和 ~ is ``C:\Users\Public`` on Windows）。 在没有安装Driver Station的开发系统上，这通常是最容易的。

source: The ``.vbs`` (Windows) and ``.py`` (macOS/Linux) scripts help launch the tools using the correct JDK.
fr_ca: Les scripts ``.vbs`` (Windows) et ``.py`` (macOS/Linux) aident à lancer les outilitaires à l’aide de la version JDK appropriée.
zh_cn: .vbs（Windows）和.py（macOS / Linux）脚本有助于使用正确的JDK启动工具。

source: Getting robot data onto the dashboard
fr_ca: Obtenir des données du robot sur le tableau de bord
zh_cn: 将机器人数据放到仪表板上

source: The easiest way to get data displayed on the dashboard is simply to use methods in the SmartDashboard class. For example to write a number to Shuffleboard write:
fr_ca: La façon la plus simple d’afficher des données sur le tableau de bord consiste tout simplement à vous servir des méthodes définies dans la classe SmartDashboard. Par exemple, pour afficher un numéro dans Shuffleboard, écrire l'instruction :
zh_cn: 使数据显示在仪表板上的最简单方法就是使用SmartDashboard类中的方法。例如，将数字写到Shuffleboard中：

source: to see a field displayed with the label "Joystick X value" and a value of the X value of the joystick. Each time this line of code is executed, a new joystick value will be sent to Shuffleboard. Remember: you must write the joystick value whenever you want to see an updated value. Executing this line once at the start of the program will only display the value once at the time the line of code was executed.
fr_ca: pour afficher un champ dont l’étiquette est "Joystick X value" et la valeur actuelle de l'axe X de la manette. À chaque exécution de cette instruction, une nouvelle valeur de l'axe X de la manette est envoyée à Shuffleboard. N’oubliez pas : vous devez écrire la valeur en provenance de la manette à chaque fois que vous souhaitez voir une valeur mise à jour. L’exécution de l'instruction au début du programme n’affiche la valeur qu’une seule fois soit au moment de l’exécution de la ligne de code.
zh_cn: 看到带有标签“操纵杆X值”和操纵杆X值的显示的字段。每次执行此行代码时，都会将一个新的操纵杆值发送到Shuffleboard。请记住：每当要查看更新的值时，都必须写入操纵杆值。在程序开始时执行该行一次将仅在执行代码行时显示一次该值。
