Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/drivesim-tutorial/diffdrive-sim-overview.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Drivetrain Simulation Overview
es_mx: Descripción general de la simulación de transmisión
fr_ca: Aperçu de la simulation du système de transmission
tr_tr: Aktarma Organları Simülasyonuna Genel Bakış
zh_cn: 动力传动系统仿真概述

source: WPILib only supports simulating differential drivetrains for the 2021 season. Support for similar simulation capabilities for teams using swerve and mecanum drivetrains is in development.
es_mx: WPILib solo admite la simulación de transmisiones diferenciales para la temporada 2021. Se está desarrollando soporte para capacidades de simulación similares para equipos que utilizan transmisiones de desvío y mecanum.
fr_ca: WPILib ne prend en charge que la simulation des sytèmes de transmission différentielle pour la saison 2021. La prise en charge de capacités similaires de simulation pour les équipes utilisant des transmissions de types swerve et mécanum est en cours de développement.
tr_tr: WPILib, yalnızca 2021 sezonu için diferansiyel aktarma organlarının simülasyonunu destekler. Swerve ve mekanik aktarma organlarını kullanan ekipler için benzer simülasyon yetenekleri için destek geliştirme aşamasındadır.
zh_cn: Note: WPILib仅在2021赛季支持动力传动系统差别模拟。对于相似的模拟能力，比如说转向和麦克纳姆轮的传动系统在开发

source: The code in this tutorial does not use any specific framework (i.e. command-based vs. simple data flow); however, guidance will be provided in certain areas for how to best implement certain pieces of code in specific framework types.
es_mx: El código de este tutorial no utiliza ningún marco específico (es decir, basado en comandos frente a flujo de datos simple); sin embargo, se proporcionará orientación en ciertas áreas sobre cómo implementar mejor ciertas piezas de código en tipos de marcos específicos.
fr_ca: Le code de ce tutoriel n’utilise pas une infrastructure de développement spécifique (c.-à-d. orientée commande vs un simple flux de données dans un simple fichier); toutefois, des directives seront fournies dans certains domaines sur la meilleure façon d’implémenter certains éléments de code dans des types spécifiques d'infrastructure de dévoleppement.
tr_tr: Bu öğreticideki kod, herhangi bir özel çerçeve kullanmaz (yani, komut temelli ve basit veri akışı); ancak, belirli çerçeve türlerinde belirli kod parçalarının en iyi şekilde nasıl uygulanacağına dair belirli alanlarda rehberlik sağlanacaktır.
zh_cn: Note: 在这个教程中的代码未使用任何特殊的框架（比如基于指令或者简单数据流的）；但是，会有关于如何正确在特殊的框架中使用的引导。

source: The goal of this tutorial is to provide guidance on implementing simulation capabilities for a differential-drivetrain robot. By the end of this tutorial, you should be able to:
es_mx: El objetivo de este tutorial es proporcionar orientación sobre la implementación de capacidades de simulación para un robot de tren de transmisión diferencial. Al final de este tutorial, debería poder:
fr_ca: L’objectif de ce tutoriel est de fournir des conseils sur l'implémentation des capacités de simulation pour un robot pourvu d'une transmission différentielle. À la fin de ce tutoriel, vous devriez être en mesure de:
tr_tr: Bu eğitimin amacı, bir diferansiyel aktarma organı robotu için simülasyon yeteneklerini uygulama konusunda rehberlik sağlamaktır. Bu eğitimin sonunda şunları yapabilmelisiniz:
zh_cn: 这个教程的目的是为有差别传动系统的机器提供模拟能力。在这个教程结束后，你应该能够：

source: Understand the basic underlying concepts behind the WPILib simulation framework.
es_mx: Comprender los conceptos básicos subyacentes detrás del marco de simulación de WPILib.
fr_ca: Comprendre les concepts fondamentaux qui sous-tendent le cadre de simulation WPILib.
tr_tr: WPILib simülasyon çerçevesinin altında yatan temel kavramları anlayın.
zh_cn: 了解WPILib的模拟框架口最基础的基本概念

source: Create a drivetrain simulation model using your robot's physical parameters.
es_mx: Crear un modelo de simulación de transmisión utilizando los parámetros físicos de su robot.
fr_ca: Créer un modèle de simulation du système de transmission à l’aide des paramètres physiques de votre robot.
tr_tr: Robotunuzun fiziksel parametrelerini kullanarak bir aktarma organı simülasyon modeli oluşturun.
zh_cn: 通过你的机器人的实体参数创建动力传动系统的模拟模型

source: Use the simulation model to predict how your real robot will move given specific voltage inputs.
es_mx: Utilizar el modelo de simulación para predecir cómo se moverá su robot real dadas las entradas de voltaje específicas.
fr_ca: Utiliser le modèle de simulation pour prédire comment votre vrai robot se déplacera compte tenu des tensions d'entrée spécifiques.
tr_tr: Belirli voltaj girdileri verildiğinde gerçek robotunuzun nasıl hareket edeceğini tahmin etmek için simülasyon modelini kullanın.
zh_cn: 使用模拟系统预测你真实的机器会如何在特定的电压输入下的运动状况

source: Tune feedback constants and squash common bugs (e.g. motor inversion) before having access to physical hardware.
es_mx: Ajustar las constantes de retroalimentación y elimine los errores comunes (por ejemplo, inversión del motor) antes de tener acceso al hardware físico.
fr_ca: Réglez les constantes de rétroaction et corrigez les bogues courants (par exemple, l'inversion du moteur) avant d'avoir accès au matériel physique (Hardware).
tr_tr: Fiziksel donanıma erişmeden önce geri bildirim sabitlerini ayarlayın ve yaygın hataları (ör. Motor ters çevirme) ezin.
zh_cn: 在访问物理硬件之前，调整反馈常量并消除常见bug(如电机反转)。

source: Use the Simulation GUI to visualize robot movement on a virtual field.
es_mx: Utilizar la GUI de simulación para visualizar el movimiento del robot en un campo virtual.
fr_ca: Utilisez l'interface graphique de simulation pour visualiser le mouvement du robot sur un champ virtuel.
tr_tr: Sanal bir alanda robot hareketini görselleştirmek için Simülasyon GUI'sini kullanın.
zh_cn: 使用模拟GUI来可视化显示机器在虚拟场地上的运行情况

source: Why Simulate a Drivetrain?
es_mx: ¿Por qué simular una transmisión?
fr_ca: Pourquoi simuler la transmission d'une base pilotable?
tr_tr: Neden Aktarma Organını Simüle Etmelisiniz?
zh_cn: 为什么模拟动力传动系统？

source: The drivetrain of a robot is one of the most important mechanisms on the robot -- therefore, it is important to ensure that the software powering your drivetrain is as robust as possible. By being able to simulate how a physical drivetrain responds, you can get a head start on writing quality software before you have access to the physical hardware. With the simulation framework, you can verify not only basic functionality, like making sure that the inversions on motors and encoders are correct, but also advanced capabilities such as verifying accuracy of path following.
es_mx: La transmisión de un robot es uno de los mecanismos más importantes del robot; por lo tanto, es importante asegurarse de que el software que alimenta la transmisión sea lo más robusto posible. Al poder simular cómo responde una transmisión física, puede comenzar a escribir software de calidad antes de tener acceso al hardware físico. Con el marco de simulación, puede verificar no solo la funcionalidad básica, como asegurarse de que las inversiones en motores y codificadores sean correctas, sino también capacidades avanzadas como verificar la precisión del seguimiento de la ruta.
fr_ca: La transmission de la base pilotable d'un robot est l'un des mécanismes les plus importants - par conséquent, il est important de s'assurer que le programme logiciel qui contrôle votre transmission est aussi robuste que possible. En étant capable de simuler la réaction d'une vraie transmission physique, vous pouvez prendre une longueur d'avance sur l'écriture de programmes de qualité avant d'avoir accès au matériel physique. Avec le cadre de simulation, vous pouvez vérifier non seulement les fonctionnalités de base, comme vous assurer que les inversions sur les moteurs et les encodeurs sont correctes, mais également des capacités avancées telles que la vérification de la précision du suivi de trajectoire.
tr_tr: Bir robotun aktarma organı, robot üzerindeki en önemli mekanizmalardan biridir - bu nedenle, aktarma sisteminize güç veren yazılımın mümkün olduğunca sağlam olmasını sağlamak önemlidir. Fiziksel bir aktarma organının nasıl tepki verdiğini simüle ederek, fiziksel donanıma erişmeden önce kaliteli yazılım yazmaya bir adım önde başlayabilirsiniz. Simülasyon çerçevesiyle, motorlar ve kodlayıcılar üzerindeki ters çevirmelerin doğru olduğundan emin olmak gibi yalnızca temel işlevleri değil, aynı zamanda yol izlemenin doğruluğunu doğrulama gibi gelişmiş yetenekleri de doğrulayabilirsiniz.
zh_cn: 动力传统系统是机器里极其重要的一个运行机制 - 因此，确保你的机器的软件是尽可能完好的。通过模拟机器传动系统的反应，你就可以在上硬件之前给软件的编写一个好的开头。通过模拟框架，你不仅可以确保最基础的功能，比方说确定马达和编码器的方向是正确的，也可以实现更加高级的功能比方说确认路径跟踪的准确性。
