Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/drivesim-tutorial/drivetrain-model.po
Languages: tr_tr, zh_cn

source: Step 2: Creating a Drivetrain Model
tr_tr: Adım 2: Aktarma Organları Modeli Oluşturma
zh_cn: Step2: 创建一个动力传统系统模型

source: In order to accurately determine how your physical drivetrain will respond to given motor voltage inputs, an accurate model of your drivetrain must be created. This model is usually created by measuring various physical parameters of your real robot. In WPILib, this drivetrain simulation model is represented by the ``DifferentialDrivetrainSim`` class.
tr_tr: Fiziksel güç aktarma sisteminizin belirli motor voltaj girişlerine nasıl tepki vereceğini doğru bir şekilde belirlemek için, aktarma sisteminizin doğru bir modeli oluşturulmalıdır. Bu model genellikle gerçek robotunuzun çeşitli fiziksel parametreleri ölçülerek oluşturulur. WPILib'de, bu aktarma organı simülasyon modeli ``DifferentialDrivetrainSim`` sınıfı ile temsil edilmektedir.
zh_cn: 为了精确的确定你的真实的物理传动装置在马达收到不同的电压的反应情况，一个精确的动力传动装置的模型必须被创建。这个模型常常用来衡量你的机器的各种物理数据。在WPILib里，这个传动系统的仿真模型是用‘DifferentialDrivetrainSim’类来表示的。

source: Creating a ``DifferentialDrivetrainSim`` from Physical Measurements
tr_tr: Fiziksel Ölçümlerden ``DifferentialDrivetrainSim`` Oluşturma
zh_cn: 通过物理测量来创建一个DifferentialDrivetrainSim

source: One way to creating a ``DifferentialDrivetrainSim`` instance is by using physical measurements of the drivetrain and robot -- either obtained through CAD software or real-world measurements (the latter will usually yield better results as it will more closely match reality). This constructor takes the following parameters:
tr_tr: Bir ``DifferentialDrivetrainSim`` örneği oluşturmanın bir yolu, güç aktarma organlarının ve robotun fiziksel ölçümlerini kullanmaktır - ya CAD yazılımı ya da gerçek dünya ölçümleriyle elde edilir (ikincisi, gerçeklikle daha yakından eşleşeceği için genellikle daha iyi sonuçlar verir). Bu yapıcı aşağıdaki parametreleri alır:
zh_cn: 一个创建DifferentialDrivetrainSim的方法实例就是传动系统和机器的物理参数 - 既不是来自于CAD软件或者真实世界的测量（后者通常会好一些因为它更接近现实）。这个构造器通常会需要传入以下几个参数：

source: The type and number of motors on one side of the drivetrain.
tr_tr: Aktarma organının bir tarafındaki motorların türü ve sayısı.
zh_cn: 动力传动装置一侧的马达的种类和数量

source: The gear ratio between the motors and the wheels as output torque over input torque (this number is usually greater than 1 for drivetrains).
zh_cn: 电动机和车轮之间的齿轮比，即输出转矩超过输入转矩（对于传动系统，该数字通常大于1）。

source: The moment of inertia of the drivetrain (this can be obtained from a CAD model of your drivetrain. Usually, this is between 3 and 8 :math:`kg m^2`).
tr_tr: Aktarma organının atalet momenti (bu, aktarma sisteminizin bir CAD modelinden elde edilebilir. Bu genellikle 3 ile 8 arasındadır :math:`kg m^2`).
zh_cn: 传统装置瞬时的惯性（这个数字可以通过你的动力传动装置的CAD模型获得。通常来说，这个数字在3到8kgm^2之间）

source: The mass of the drivetrain (it is recommended to use the mass of the entire robot itself, as it will more accurately model the acceleration characteristics of your robot for trajectory tracking).
tr_tr: Aktarma organının kütlesi (yörünge izleme için robotunuzun hızlanma özelliklerini daha doğru bir şekilde modelleyeceği için tüm robotun kütlesinin kullanılması önerilir).
zh_cn: 动力传动装置的重量（这可以用你的动力传动装置的CAD模型来获得，因为他可以更加精确的你机器的轨迹追踪到加速度特征）

source: The radius of the drive wheels.
tr_tr: Tahrik tekerleklerinin yarıçapı.
zh_cn: 轮子的半径

source: The track width (distance between left and right wheels).
tr_tr: İz genişliği (sol ve sağ tekerlekler arasındaki mesafe).
zh_cn: 轮子间距（左轮和右轮之间的距离）

source: Standard deviations of measurement noise: this represents how much measurement noise you expect from your real sensors. The measurement noise is an array with 7 elements, with each element representing the standard deviation of measurement noise in x, y, heading, left velocity, right velocity, left position, and right position respectively. This option can be omitted in C++ or set to ``null`` in Java if measurement noise is not desirable.
tr_tr: Ölçüm gürültüsünün standart sapmaları: Bu, gerçek sensörlerinizden ne kadar ölçüm gürültüsü beklediğinizi gösterir. Ölçüm gürültüsü, sırasıyla x, y, yön, sol hız, sağ hız, sol konum ve sağ konumdaki ölçüm gürültüsünün standart sapmasını temsil eden 7 öğeli bir dizidir. Bu seçenek, C++'da çıkarılabilir veya ölçüm gürültüsü istenmiyorsa Java'da ``null`` larak ayarlanabilir.
zh_cn: 干扰的标准差：这是在真实的情况下你会预期的干扰。这个干扰是一个带有7个元素的列表，每个元素分别代表着x, y, 朝向，左速度，右速度，左位置和右位置的干扰。他的选项可以在c++中省略，或者在Java中设置为' ' null ' '，如果测量干扰是不可取的。

source: You can calculate the measurement noise of your sensors by taking multiple data points of the state you are trying to measure and calculating the standard deviation using a tool like Python. For example, to calculate the standard deviation in your encoders' velocity estimate, you can move your robot at a constant velocity, take multiple measurements, and calculate their standard deviation from the known mean. If this process is too tedious, the values used in the example below should be a good representation of average noise from encoders.
tr_tr: Ölçmeye çalıştığınız durumun birden fazla veri noktasını alarak ve Python gibi bir araç kullanarak standart sapmayı hesaplayarak sensörünüzün ölçüm gürültüsünü hesaplayabilirsiniz. Örneğin, kodlayıcılarınızın hız tahminindeki standart sapmayı hesaplamak için, robotunuzu sabit bir hızda hareket ettirebilir, birden fazla ölçüm alabilir ve bilinen ortalamadan standart sapmasını hesaplayabilirsiniz. Bu işlem çok sıkıcıysa, aşağıdaki örnekte kullanılan değerler kodlayıcılardan gelen ortalama gürültünün iyi bir temsili olmalıdır.
zh_cn: 你可以通过用python这样的工具并使用不同状态的数据点来计算或者衡量标准差。比方说，为了计算你的编码器的估计速度的标准差，你可以让你的机器以平均速度运动，采用不同的测量标准，并且通过已知的平均数计算标准差。如果这个过程过于枯燥的话，下边这个例子里的数据应该是一个很好的平均编码器干扰的例子。

source: The standard deviation of the noise for a measurement has the same units as that measurement. For example, the standard deviation of the velocity noise has units of m/s.
tr_tr: Bir ölçüm için gürültünün standart sapması, bu ölçümle aynı birimlere sahiptir. Örneğin, hız gürültüsünün standart sapması m / s birimlerine sahiptir.
zh_cn: Note：衡量标准差的单位采用国际制单位，比方说对于速度干扰的标准差应取m/s作为单位。

source: It is very important to use SI units (i.e. meters and radians) when passing parameters in Java. In C++, the :ref:`units library <docs/software/basic-programming/cpp-units:The C++ Units Library>` can be used to specify any unit type.
tr_tr: Java'da parametreleri iletirken SI birimlerini (yani metre ve radyan) kullanmak çok önemlidir. C ++ 'da, :ref:`units library <docs/software/basic-programming/cpp-units:The C++ Units Library>` birim kitaplığı herhangi bir birim türünü belirtmek için kullanılabilir.
zh_cn: Note：在Java中，当传参的时候，应采用SI单位（比方说米和半径）。在C++，unit库可以接受所有单位。

source: Creating a ``DifferentialDrivetrainSim`` from Characterization Gains
tr_tr: Karakterizasyon Kazançlarından ``DifferentialDrivetrainSim`` Oluşturma
zh_cn: 从characterization 中 创建 一个 differentialdrivetrainsim

source: You can also use the gains produced by :ref:`robot characterization <docs/software/wpilib-tools/robot-characterization/introduction:Introduction to Robot Characterization>`, which you may have performed as part of setting up the trajectory tracking workflow outlined :ref:`here <docs/software/examples-tutorials/trajectory-tutorial/index:Trajectory Tutorial>` to create a simulation model of your drivetrain and often yield results closer to real-world behavior than the method above.
tr_tr: Ayrıca, özetlenen yörünge izleme iş akışını kurmanın bir parçası olarak gerçekleştirmiş olabileceğiniz :ref:`robot karakterizasyonu <docs/software/wpilib-tools/robot-characterization/introduction:Introduction to Robot Characterization>` tarafından üretilen kazanımları da kullanabilirsiniz :ref:`burada <docs/software/examples-tutorials/trajectory-tutorial/index:Trajectory Tutorial>` aktarma sisteminizin bir simülasyon modelini oluşturmak ve genellikle verim sağlamak için gerçek dünya davranışına yukarıdaki yöntemden daha yakın sonuçlar verir.
zh_cn: 您还可以使用 robot characterization的增益，这些增益可以使您在设置轨迹追踪工作时创建drivetrain的自动模型，这会通常更加接近真实世界的行为。

source: You must need two sets of ``Kv`` and ``Ka`` gains from the characterization tool -- one from straight-line motion and the other from rotating in place. We will refer to these two sets of gains as linear and angular gains respectively.
tr_tr: Karakterizasyon aracından iki set ``Kv`` ve ``Ka`` kazanımına ihtiyacınız vardır - biri düz çizgi hareketinden, diğeri ise yerinde dönmekten. Bu iki kazanç setine sırasıyla doğrusal ve açısal kazançlar olarak değineceğiz.
zh_cn: 重要： 您必须需要从characterization tool 中 获取的 KV 和 KA。 其中一个是直线动力的参数， 另外一个则是旋转的参数。 我们将会参考 linear 和 angular 两个参数。

source: This constructor takes the following parameters:
tr_tr: Bu yapıcı aşağıdaki parametreleri alır:
zh_cn: 该建设遵循以下的参数：

source: A linear system representing the drivetrain -- this can be created using the characterization gains.
tr_tr: Aktarma organlarını temsil eden doğrusal bir sistem - bu, karakterizasyon kazanımları kullanılarak oluşturulabilir.
zh_cn: 一个代表drivetrain的linear system，这可以在 characterization gains中创建。

source: The track width (distance between the left and right wheels).
tr_tr: İz genişliği (sol ve sağ tekerlekler arasındaki mesafe).
zh_cn: 履带宽度（左右轮之间)

source: Creating a ``DifferentialDrivetrainSim`` of the KoP Chassis
tr_tr: KoP şasisi için ``DifferentialDrivetrainSim`` oluşturma.
zh_cn: 创建KoP底盘的“差分驱动trainsim”

source: The ``DifferentialDrivetrainSim`` class also has a static ``createKitbotSim()`` (Java) / ``CreateKitbotSim()`` (C++) method that can create an instance of the ``DifferentialDrivetrainSim`` using the standard Kit of Parts Chassis parameters. This method takes 5 arguments, two of which are optional:
tr_tr: ``DifferentialDrivetrainSim`` sınıfı, standart Kit'i kullanarak ``DifferentialDrivetrainSim`` örneğini oluşturabilen statik bir ``createKitbotSim()`` (Java) / ``CreateKitbotSim()`` (C ++) yöntemine de sahiptir. Parçalar Şasi parametreleri. Bu yöntem, ikisi isteğe bağlı olan 5 bağımsız değişken alır:
zh_cn: differaldrivetrainsim ' '类也有一个静态的' createKitbotSim() ' ' (Java) / ' createKitbotSim() ' ' (c++)方法，可以创建一个实例的' ' differaldrivetrainsim ' '使用标准套件的部件底盘参数。这个方法有5个参数，其中两个是可选的:

source: The diameter of the wheels installed on the drivetrain.
tr_tr: Aktarma organına takılı tekerleklerin çapı.
zh_cn: 安装在动力传动系统上的车轮的直径

source: The moment of inertia of the drive base (optional).
tr_tr: Tahrik tabanının atalet momenti (isteğe bağlı).
zh_cn: 驱动座的转动惯量(可选)

source: You can use the ``KitbotMotor``, ``KitbotGearing``, and ``KitbotWheelSize`` enum (Java) / struct (C++) to get commonly used configurations of the Kit of Parts Chassis.
tr_tr: Kit of Parts Şasisinin yaygın olarak kullanılan yapılandırmalarını almak için ``KitbotMotor``, ``KitbotGearing`` ve ``KitbotWheelSize`` enum (Java) / struct (C ++) kullanabilirsiniz.
zh_cn: 你可以使用' ' KitbotMotor ' '， ' ' KitbotGearing ' '，和' ' KitbotWheelSize ' ' enum (Java) / struct (c++)来获得零件底盘套件的常用配置。

source: Constructing your ``DifferentialDrivetrainSim`` instance in this way is just an approximation and is intended to get teams quickly up and running with simulation. Using empirical values measured from your physical robot will always yield more accurate results.
tr_tr: ``DifferentialDrivetrainSim`` örneğinizi bu şekilde oluşturmak sadece bir yaklaşımdır ve ekiplerin simülasyonla hızlı bir şekilde çalışmaya başlamasını sağlamayı amaçlamaktadır. Fiziksel robotunuzdan ölçülen deneysel değerleri kullanmak her zaman daha doğru sonuçlar verecektir.
zh_cn: 以这种方式构建你的‘differaldrivetrainsim’实例只是一种近似，目的是让团队快速启动并运行模拟。使用从物理机器人测量的经验值总是会产生更精确的结果
