Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/drivesim-tutorial/odometry-simgui.po
Languages: fr_ca, zh_cn

source: Step 4: Updating Odometry and Visualizing Robot Position
fr_ca: Étape 4: Mise à jour de l'odométrie et visualisation de la position du robot
zh_cn: 第4步:更新里程测量和机器人位置可视化

source: Now that the simulated encoder positions, velocities, and gyro angles are being updated with accurate information periodically, this data can be used to update the pose of the robot in a periodic loop (such as the ``periodic()`` method in a ``Subsystem``). In simulation, the periodic loop will use simulated encoder and gyro readings to update odometry whereas on the real robot, the same code will use real readings from physical hardware.
fr_ca: Maintenant que les positions, les vitesses et les angles du gyroscope simulés sont régulièrement mis à jour avec des informations précises, ces données peuvent être utilisées pour mettre à jour la pose du robot dans une boucle périodique (telle que la méthode ``periodic()`` dans un ``Subsystem``). En simulation, la boucle périodique utilisera des lectures simulées d'encodeur et de gyroscope pour mettre à jour l'odométrie alors que sur le robot réel, le même code utilisera des lectures réelles provenant du matériel physique.
zh_cn: 现在，模拟编码器的位置，速度和陀螺角度被精确的信息定期更新，这个数据可以用来在一个周期循环中更新机器人的姿态(如' '子系统' '中的' ' periodic() ' '方法)。在模拟中，周期循环将使用模拟编码器和陀螺读数来更新里程计，而在真实的机器人上，相同的代码将使用来自物理硬件的真实读数。

source: For more information on using odometry, see :ref:`this document <docs/software/kinematics-and-odometry/differential-drive-odometry:Differential Drive Odometry>`.
fr_ca: Pour plus d'informations sur l'utilisation de l'odométrie, voir :ref:`ce document <docs/software/kinematics-and-odometry/differential-drive-odometry:Differential Drive Odometry>`.
zh_cn: Note：如果要了解更多关于里程计的信息，请参见this document

source: Robot Pose Visualization
fr_ca: Visualisation de la pose du robot
zh_cn: 机器人姿势视觉化

source: The robot pose can be visualized on the Simulator GUI (during simulation) or on a dashboard such as Glass (on a real robot) by sending the odometry pose over a ``Field2d`` object. A ``Field2d`` can be trivially constructed without any constructor arguments:
fr_ca: La pose du robot peut être visualisée sur l'interface graphique du simulateur (pendant la simulation) ou sur un tableau de bord tel que Glass (sur un vrai robot) en envoyant la pose d'odométrie sur un objet ``Field2d`` . Un ``Field2d`` peut être construit de manière triviale sans aucun argument de constructeur:
zh_cn: 机器人姿态可以在模拟器GUI(在模拟过程中)或仪表板(如玻璃)上可视化(在一个真实的机器人上)，通过发送一个' ' Field2d ' ' '对象的里程计姿态。一个' ' Field2d ' '可以在没有任何构造函数参数的情况下简单地构造:

source: This ``Field2d`` instance must then be sent over NetworkTables. The best place to do this is in the constructor of your subsystem.
fr_ca: Cette instance ``Field2d`` doit ensuite être envoyée via les NetworkTables. Le meilleur endroit pour faire cela est dans le constructeur de votre sous-système.
zh_cn: 这个' ' Field2d ' '实例必须通过NetworkTables发送。最好的位置是在子系统的构造函数中。

source: The ``Field2d`` instance can also be sent using a lower-level NetworkTables API or using the :ref:`Shuffleboard API <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>`.
fr_ca: L'instance ``Field2d`` peut également être envoyée en utilisant une API NetworkTables de niveau inférieur ou en utilisant :ref:`API Shuffleboard <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-displaying-data:Displaying data from your robot>`.
zh_cn: ' ' Field2d ' '实例也可以使用低级的NetworkTables API发送，或者使用:ref: ' Shuffleboard API &lt;docs/software/wpilib-tools/ Shuffleboard /get -started/ Shuffleboard - Displaying -data:Displaying data from your robot&gt; '。

source: Finally, the pose from your odometry must be updated periodically into the ``Field2d`` object. Remember that this should be in a general ``periodic()`` method i.e. one that runs both during simulation and during real robot operation.
fr_ca: Enfin, la pose de votre odométrie doit être mise à jour périodiquement dans l'objet ``Field2d``. Rappelez-vous que cela devrait être une méthode générale ``periodic()``, c'est-à-dire une méthode qui s'exécute à la fois pendant la simulation et pendant le fonctionnement réel du robot.
zh_cn: 最后，你的里程计的姿势必须定期更新到' ' Field2d ' '对象。记住，这应该是一个通用的' ' periodic() ' '方法，即在模拟和实际机器人操作期间运行。

source: It is important that this code is placed in a regular ``periodic()`` method -- one that is called periodically regardless of mode of operation. If you are using the command-based library, this method already exists. If not, you are responsible for calling this method periodically from the main ``Robot`` class.
fr_ca: Il est important que ce code soit placé dans une méthode régulière ``periodic()`` - une méthode qui est appelée périodiquement quel que soit le mode de fonctionnement. Si vous utilisez la librairie basée sur les commandes, cette méthode existe déjà. Sinon, vous êtes responsable d'appeler cette méthode périodiquement à partir de la classe principale ``Robot``.
zh_cn: 重要的是，这段代码被放置在一个常规的' ' periodic() ' '方法中——无论操作模式如何，都会定期调用该方法。如果您正在使用基于命令的库，则此方法已经存在。如果没有，你有责任定期从“机器人”类调用这个方法。

source: At this point we have covered all of the code changes required to run your code. You should head to the :ref:`Simulation User Interface page <docs/software/wpilib-tools/robot-simulation/simulation-gui:Simulation Specific User Interface Elements>` for more info on how to run the simulation and add the field that your simulated robot will run on to the GUI.
fr_ca: À ce stade, nous avons couvert toutes les modifications de code requises pour exécuter votre code. Vous devez vous rendre à la page :ref:`Interface Utilisateur de Simulation <docs/software/wpilib-tools/robot-simulation/simulation-gui:Simulation User Interface>` pour plus d’informations sur la façon d’exécuter la simulation et d’ajouter sur l’interface graphique le terrain sur lequel votre robot simulé se déplacera dans l'interface graphique.
zh_cn: 至此，我们已经介绍了运行代码所需的所有代码更改。你应该去:ref: '模拟用户界面页面&lt;docs/software/wpilib-tools/robot- Simulation / Simulation - GUI:Simulation Specific User Interface Elements&gt; '获取更多关于如何运行模拟的信息，并添加你的模拟机器人将在GUI上运行的字段。
