Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/examples-tutorials/drivesim-tutorial/updating-drivetrain-model.po
Languages: es_mx, tr_tr, zh_cn

source: Step 3: Updating the Drivetrain Model
es_mx: Paso 3: Actualización del modelo de transmisión
tr_tr: Adım 3: Drivetrain Modelini Güncelleme
zh_cn: 第3步：升级 drivetrainmodel

source: Now that the drivetrain model has been made, it needs to be updated periodically with the latest motor voltage commands. It is recommended to do this step in a separate ``simulationPeriodic()`` / ``SimulationPeriodic()`` method inside your subsystem and only call this method in simulation.
es_mx: Ahora que se ha hecho el modelo de transmisión, necesita ser actualizado periódicamente con los últimos comandos de voltaje del motor. Se recomienda hacer este paso en un método separado ``simulationPeriodic()`` / ``SimulationPeriodic()`` dentro de su subsistema y sólo llamar a este método en la simulación.
tr_tr: Aktarma organı modeli yapıldığına göre, en son motor voltaj komutlarıyla periyodik olarak güncellenmesi gerekiyor. Bu adımı alt sisteminizin içinde ayrı bir ``simulationPeriodic()`` / ``SimulationPeriodic()`` yönteminde yapmanız ve bu yöntemi yalnızca simülasyonda çağırmanız önerilir.
zh_cn: 既然已经建立了传动系统模型，则需要使用最新的电动机电压命令定期进行更新。建议在子系统内部单独的``simulationPeriodic（）/''SimulationPeriodic（）``方法中执行此步骤，并且仅在仿真中调用此方法。

source: If you are using the command-based framework, every subsystem that extends ``SubsystemBase`` has a ``simulationPeriodic()`` / ``SimulationPeriodic()`` which can be overridden. This method is automatically run only during simulation. If you are not using the command-based library, make sure you call your simulation method inside the overridden ``simulationPeriodic()`` / ``SimulationPeriodic()`` of the main ``Robot`` class. These periodic methods are also automatically called only during simulation.
es_mx: Si está utilizando el marco basado en comandos, cada subsistema que extiende ``SubsystemBase`` tiene un ``simulationPeriodic()`` / ``SimulationPeriodic()`` que puede ser anulado. Este método se ejecuta automáticamente sólo durante la simulación. Si no está utilizando la biblioteca basada en comandos, asegúrese de llamar a su método de simulación dentro de la clase ``simulationPeriodic()`` / ``SimulationPeriodic()`` de la clase principal ``Robot``. Estos métodos periódicos también son llamados automáticamente sólo durante la simulación.
tr_tr: Komut tabanlı çerçeveyi kullanıyorsanız, ``SubsystemBase`` i genişleten her alt sistemin geçersiz kılınabilen bir ``simulationPeriodic()`` / ``SimulationPeriodic()`` vardır. Bu yöntem otomatik olarak yalnızca simülasyon sırasında çalıştırılır. Komut tabanlı kitaplığı kullanmıyorsanız, simülasyon yönteminizi ana `` Robot '' sınıfının geçersiz kılınan ``simulationPeriodic()`` / ``SimulationPeriodic()`` içinde çağırdığınızdan emin olun. Bu periyodik yöntemler ayrıca otomatik olarak yalnızca simülasyon sırasında çağrılır.
zh_cn: 如果您使用的是基于命令的框架，则扩展SubsystemBase的每个子系统都有一个SimulationPeriodic（）/ SimulationPeriodic（）可以被覆盖。此方法仅在仿真过程中自动运行。如果您不使用基于命令的库，请确保在主要的“机器人”类的已覆盖的“ simulationPeriodic（）” /“ SimulationPeriodic（）”内部调用仿真方法。这些周期性方法也仅在仿真期间自动调用。

source: There are three main steps to updating the model:
es_mx: Hay tres pasos principales para actualizar el modelo:
tr_tr: Modeli güncellemenin üç ana adımı vardır:
zh_cn: 更新模型有三个主要步骤:

source: Set the :term:`input` of the drivetrain model. These are the motor voltages from the two sides of the drivetrain.
es_mx: Establezca el :term:`entrada` del modelo de transmisión. Estos son los voltajes del motor de los dos lados del tren de transmisión.
tr_tr: Drivetrain sistemi modelinin :term:`input` değerini ayarlayın. Bunlar, drivetrainin iki tarafından gelen motor voltajlarıdır.
zh_cn: 设置:term: ' input '的动力传动系统模型。这些是来自动力传动系统两侧的电机电压。

source: Advance the model forward in time by the nominal periodic timestep (Usually 20 ms). This updates all of the drivetrain's states (i.e. pose, encoder positions and velocities) as if 20 ms had passed.
es_mx: Haga avanzar el modelo en el tiempo por el paso de tiempo periódico nominal (generalmente 20 ms). Esto actualiza todos los estados de la transmisión (es decir, pose, posiciones del codificador y velocidades) como si hubieran pasado los 20 ms.
tr_tr: Modeli, nominal periyodik zaman adımı (Genellikle 20 ms) ile zamanda ileri doğru ilerletin. Bu, tüm drivestation durumlarını (yani poz, kodlayıcı konumları ve hızları) 20 ms geçmiş gibi günceller.
zh_cn: 按标称的周期性时间步长（通常为20 ms）将模型向前推进。 这将更新所有动力传动系统的状态（即姿态，编码器位置和速度），就好像经过了20毫秒一样。

source: Update simulated sensors with new positions, velocities, and angles to use in other places.
es_mx: Actualice los sensores simulados con nuevas posiciones, velocidades y ángulos para usar en otros lugares.
tr_tr: Simüle edilmiş sensörleri başka yerlerde kullanmak için yeni konumlar, hızlar ve açılarla güncelleyin.
zh_cn: 更新 simulatedsensors 的 位置，速度，角度。

source: If the right side of your drivetrain is inverted, you MUST negate the right voltage in the ``SetInputs()`` call to ensure that positive voltages correspond to forward movement.
es_mx: Si el lado derecho de su transmisión está invertido, DEBE negar el voltaje correcto en la llamada ``SetInputs()`` para asegurarse de que los voltajes positivos corresponden al movimiento hacia adelante.
tr_tr: Drivetrainınızın sağ tarafı ters çevrilmişse, pozitif voltajların ileri harekete karşılık geldiğinden emin olmak için ``SetInputs()`` çağrısında doğru voltajı sıfırlamanız GEREKİR.
zh_cn: 如果你的动力传动系统的右侧是倒转的，你必须在' ' settinputs() ' '呼叫中否定正确的电压，以确保正电压对应向前移动。

source: Because the drivetrain simulator model returns positions and velocities in meters and m/s respectively, these must be converted to encoder ticks and ticks/s when calling ``SetDistance()`` and ``SetRate()``. Alternatively, you can configure ``SetDistancePerPulse`` on the encoders to have the ``Encoder`` object take care of this automatically -- this is the approach that is taken in the example above.
es_mx: Debido a que el modelo del simulador de tren de conducción devuelve las posiciones y las velocidades en metros y m/s respectivamente, éstas deben ser convertidas en ticks de codificación y ticks/s cuando se llama a ``SetDistance()`` y ``SetRate()``. Alternativamente, puedes configurar ``SetDistancePerPulse`` en los codificadores para que el objeto ``Encoder`` se encargue de esto automáticamente - este es el enfoque que se toma en el ejemplo anterior.
tr_tr: Drivetrain simülatörü modeli sırasıyla metre ve m / s cinsinden konumları ve hızları döndürdüğü için, bunlar ``SetDistance()`` ve ``SetRate()`` çağrılırken kodlayıcı işaretlerine ve işaretlere dönüştürülmelidir. Alternatif olarak, ``Encoder`` nesnesinin bunu otomatik olarak halletmesi için kodlayıcılarda ``SetDistancePerPulse`` yapılandırabilirsiniz - yukarıdaki örnekte uygulanan yaklaşım budur.
zh_cn: 因为传动系统模拟器模型返回的位置和速度分别以米和米/秒，这些必须转换为编码器节拍和节拍/秒时调用' ' SetDistance() ' '和' ' SetRate() ' '。或者，你可以在编码器上配置' ' SetDistancePerPulse ' '，让' ' Encoder ' '对象自动处理这个问题——这是上面例子中采用的方法。

source: Now that the simulated encoder positions, velocities, and gyroscope angles have been set, you can call ``m_leftEncoder.GetDistance()``, etc. in your robot code as normal and it will behave exactly like it would on a real robot. This involves performing odometry calculations, running velocity PID feedback loops for trajectory tracking, etc.
es_mx: Ahora que las posiciones simuladas del codificador, las velocidades y los ángulos del giroscopio se han establecido, puedes llamar a ``m_leftEncoder.GetDistance()``, etc. en tu código de robot como normalmente y se comportará exactamente como lo haría en un robot real. Esto implica realizar cálculos de odometría, ejecutar bucles de retroalimentación PID de velocidad para el seguimiento de la trayectoria, etc.
tr_tr: Simüle edilmiş kodlayıcı konumları, hızları ve jiroskop açıları ayarlandığına göre artık robot kodunuzda ``m_leftEncoder.GetDistance()``, vb. Çağırabilirsiniz ve tam olarak gerçek bir robotta olduğu gibi davranacaktır. Bu, odometri hesaplamaları yapmayı, yörünge izleme için hız PID geri bildirim döngülerini çalıştırmayı, vb. İçerir.
zh_cn: 现在，模拟的编码器位置、速度和陀螺仪角度都已经设置好了，你可以在你的机器人代码中调用' ' m_leftEncoder.GetDistance() ' '等，它会像在真实的机器人上一样运行。这包括执行里程计算，运行速度PID反馈回路的轨迹跟踪等。
