Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/apriltag/apriltag-intro.po
Languages: fr_ca

source: Detailed information about the tunable parameters `can be found here <https://github.com/AprilRobotics/apriltag/wiki/AprilTag-User-Guide#tuning-the-detector-parameters>`__.
fr_ca: De l'information détaillée à propos des paramètres modifiables `se retrouve ici <https://github.com/AprilRobotics/apriltag/wiki/AprilTag-User-Guide#tuning-the-detector-parameters>`__.

source: Further Learning
fr_ca: Pour en savoir plus

source: The three major versions of AprilTags are described in three academic papers. It's recommended to read them in order, as each builds upon the previous:
fr_ca: Les trois versions majeures d'AprilTags sont décrites dans trois papiers académiques. Il est recommandé de les lire en ordre, puisque chacun ajoute au précédent:
