Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/apriltag/apriltag-intro.po
Languages: fr_ca

source: What Are AprilTags?
fr_ca: Que sont les AprilTags?

source: A demonstration of AprilTag fiducial targets attached to generic robots.
fr_ca: Une démonstration des cibles fiduciaires AprilTags attachées à des robots génériques.

source: AprilTags are a system of visual tags developed by researchers at the University of Michigan to provide low overhead, high accuracy localization for many different applications.
fr_ca: Les AprilTags sont un système d'étiquettes visuelles développé par des chercheurs de l'Université du Michigan visant à fournir une localisation d'emplacement à basse consommation de ressources et haute précision adaptée à plusieurs applications.

source: Application to FRC
fr_ca: Application en FRC

source: In the context of FRC, AprilTags are useful for helping your robot know where it is at on the field, so it can align itself to some goal position.
fr_ca: Dans le contexte de la FRC, les AprilTags sont utiles pour aider votre robot à savoir où il se trouve sur le terrain, afin qu'Il puisse s'aligner avec les positions de buts.

source: AprilTags have been in development since 2011, and have been refined over the years to increase the robustness and speed of detection.
fr_ca: Les AprilTags sont développées depuis 2011 et se sont raffinées avec les années, afin d'augmenter leur robustesse et la vitesse de détection.

source: `Starting in 2023, FIRST is providing a number of tags, <https://www.firstinspires.org/robotics/frc/blog/2022-2023-approved-devices-rules-preview-and-vision-target-update>`__ scattered throughout the field, each at a known :term:`pose`.
fr_ca: Débutant en 2023, FIRST fournit plusieurs étiquettes <https://www.firstinspires.org/robotics/frc/blog/2022-2023-approved-devices-rules-preview-and-vision-target-update>`__ dispersées sur le terrain, connues sous le nom de :term:`pose`.

source: All of the tags are from the 16h5 family.
fr_ca: Toutes les étiquettes sont de la famille 16h5.

source: Many of the pictures in this documentation are from the 36h11 family, which are similar (but not identical) to the 16h5 actually in use for FRC. All the underlying concepts are the same.
fr_ca: Plusieurs images dans cette documentation sont de la famille 36h11, qui sont similaires (mais pas identiques) aux 16h5 utilisées pour la FRC. Tous les concepts fondamentaux sont les mêmes.

source: The AprilTag library implementation defines standards on how sets of tags should be designed. Some of the possible tag families `are described here <https://www.ssontech.com/docs/SynthEyesUM_files/Choosing_an_AprilTag.html>`__.
fr_ca: L'implémentation de la bibliothèque AprilTag définit les standards sur la manières que les ensembles d'étiquettes devraient être conçues. Certaines des familles possibles `sont décrites ici <https://www.ssontech.com/docs/SynthEyesUM_files/Choosing_an_AprilTag.html>`__.

source: FIRST has chosen the 16h5 family for 2023. This family of tags is made of a 4x4 grid of pixels, each representing one bit of information. An additional black and white border must be present around the outside of the bits.
fr_ca: FIRST a choisit la famille 16h5 pour 2023. Cette famille d'étiquettes est faite d'une grille de 4x4 pixels, chacun représentant un bit d'information. Une bordure additionnelle noire et blanche doit être présente sur le périmètre des bits.

source: While there are :math:`2^{16} = 65536` theoretical possible tags, only 30 are actually used. These are chosen to:
fr_ca: Bien qu'il y ait :math:`2^{16} = 65536` étiquettes possibles, seulement 30 sont utilisées. Elles ont été choisies pour:

source: Be robust against some bit flips (IE, issues where a bit has its color incorrectly identified).
fr_ca: Être robustes contre le basculement de bit (ex: problèmes où le bit a sa couleur identifiée incorrectement).

source: Not involve "simple" geometric patterns likely to be found on things which are not tags. (IE, squares, stripes, etc.)
fr_ca: Ne pas contenir de motifs géométriques "simples" qui pourraient se trouver sur des choses qui ne sont pas des cibles (ex: carrés, lignes, etc...).

source: Ensure the geometric pattern is asymmetric enough that you can always figure out which way is up.
fr_ca: S'assurer que le motif géométrique est assez asymétrique que vous pouvez toujours savoir quel côté pointe vers le haut.

source: All tags will be printed such that the tag's main "body" is 6 inches in length.
fr_ca: Toutes les étiquettes seront imprimées afin que leur bordure extérieure mesure 6 pouces de longueur.

source: Diagram showing the dimensions of an FRC AprilTag fiducial target.
fr_ca: Diagramme montrant les dimensions d'un cible fiduciaire AprilTag FRC.

source: For home usage, tag files may be printed off and placed around your practice area. Mount them to a rigid backing material to ensure the tag stays flat, as the processing algorithm assumes the tags are flat.
fr_ca: Pour utilisation à la maison, les fichiers d'étiquette peuvent êtres imprimés et placés autour de votre aire de pratique. Fixez les sur un support rigide afin que les étiquettes restent plate, puisque l'algorithme de vision assume que l'étiquette est plate.

source: Software Support
fr_ca: Support Logiciel

source: The main repository for the source code that detects and decodes AprilTags `is located here <https://github.com/AprilRobotics/apriltag>`__.
fr_ca: La bibliothèque principale pour le code source qui détecte et décode les AprilTags `est située ici <https://github.com/AprilRobotics/apriltag>`__.

source: WPILib has forked the repository to add new features for FRC. These include:
fr_ca: WPIlib a ramifié la bibliothèque afin d'ajouter des nouvelles fonctionnalités pour la FRC. Entre autres:

source: Building the source code for common FRC targets, including the roboRIO and Raspberry Pi.
fr_ca: Compiler le code source pour des cibles FRC courantes, incluant le roboRIO et Raspberry Pi.

source: Adding Java Native Interface (JNI) support to allow invoking its functionality from Java
fr_ca: Ajouter un support Java Native Interface (JNI) pour permettre l'invocation de ses fonctionnalités depuis Java

source: Gradle & Maven publishing support
fr_ca: Support de publication Gradle et Maven

source: Todo
fr_ca: À faire

source: Work in this library is still ongoing, this list may change in the future.
fr_ca: Le travail dans cette bibliothèque est toujours en cours, cette liste pourrait changer dans le futur.

source: Processing Technique
fr_ca: Technique de calcul

source: While most FRC teams should not have to implement their own code to identify AprilTags in a camera image, it is useful to know the basics of how the underlying libraries function.
fr_ca: Bien que la plupart des équipes FRC ne devraient pas avoir à implémenter leur propre code pour identifier les AprilTags dans une image de caméra, il est utile de connaître les bases du fonctionnement des bibliothèques sous-jacentes.

source: Original Image
fr_ca: Image d'origine

source: Original, unprocessed image
fr_ca: Original, image non calculée

source: An image from a camera is simply an array of values, corresponding to the color and brightness of each pixel.
fr_ca: Une image d'une caméra est simplement une liste de valeurs correspondant à la couleur et la luminosité de chaque pixel.

source: Remove Colors
fr_ca: Retirer les couleurs

source: Image converted to be grey-scale
fr_ca: Images converties en échelles de gris.

source: The first step is to convert the image to a grey-scale (brightness-only) image. Color information is not needed to detect the black-and-white tags.
fr_ca: La première étape est de convertir l'image en tons de gris (luminosité seulement). L'information des couleurs n'est pas nécessaire pour détecter les étiquettes en noir et blanc.

source: Decimate
fr_ca: Décimer

source: Image converted to a lower resolution
fr_ca: Image convertie vers une résolution plus basse

source: The next step is to convert the image to a lower resolution. Working with fewer pixels helps the algorithm work faster. The full-resolution image will be used later to refine early estimates.
fr_ca: La prochaine étape est de convertir l'image vers une résolution plus basse. Travailler avec moins de pixels aide l'algorithme à travailler plus vite. L'image en pleine résolution sera utilisée plus tard pour raffiner les estimations préliminaires.

source: Adaptive Threshold
fr_ca: Seuil adaptatif

source: Image with adaptive threshold algorithm applied
fr_ca: Image avec l'algorithme de seuil adaptatif appliqué

source: An adaptive threshold algorithm is run to classify each pixel as "definitely light", "definitely dark", or "not sure".
fr_ca: Un algorithme de seuil adaptatif est exécuté afin de classifier chacun des pixels en "définitivement clair", "définitivement foncé" ou "incertain".

source: The threshold is calculated by looking at the pixel's brightness, compared to a small neighborhood of pixels around it.
fr_ca: Le seuil est calculé en regardant la luminosité du pixel comparé à celle du voisinage des pixels.

source: Adaptive thresholded image, but with clusters of similar pixels grouped together
fr_ca: Image avec seuil adaptatif, mais avec des pixels similaires regroupés ensemble

source: Next, the known pixels are clumped together. Any clumps which are too small to reasonably be a meaningful part of a tag are discarded.
fr_ca: Ensuite, les pixels connus sont regroupés ensemble. Tout les groupes trop petits pour être une partie significative d'une étiquette sont supprimés.

source: Quad Detection
fr_ca: Détection des quadrilatères

source: Image with quadrilateral areas identified and marked
fr_ca: Image avec les aires quadrilatérales identifiées et marquées

source: An algorithm for fitting a quadrilateral to each clump is now run:
fr_ca: Un algorithme pour associer un quadrilatère à chaque groupe est maintenant exécuté:

source: Identify likely "corner" candidates by pixels which are outliers in both dimensions.
fr_ca: Identifier les "coins" probables par les pixels qui sont des valeurs aberrantes dans les deux dimensions.

source: Iterate through all possible combinations of corners, evaluating the fit each time
fr_ca: Itérer au travers de toutes les combinaison possibles de coins, tout en évaluant l'appartenance à chaque fois.

source: Pick the best-fit quadrilateral
fr_ca: Choisir le quadrilatère avec le meilleur ajustement

source: Given the set of all quadralaterals, Identify a subset of quadrilaterals which is likely a tag.
fr_ca: Compte tenu de l'ensemble de tout les quadrilatères, on identifie un sous-ensemble de quadrilatères qui est probablement une étiquette.

source: A single large exterior quadrilateral with many interior quadrilateral is likely a good candidate.
fr_ca: Un seul grand quadrilatère extérieur avec plusieurs quadrilatères intérieurs est sûrement un bon candidat.

source: If all has gone well so far, we are left with a four-sided region of pixels that is likely a valid tag.
fr_ca: Si tout s'est bien passé jusqu'ici, il nous reste une région de pixels à quatre côtés qui est sûrement une étiquette valide.

source: Decode ID
fr_ca: Décoder l'identifiant

source: Image with AprilTag data decoded into a target identification number.
fr_ca: L'image avec des données AprilTag est décodée en un nombre d'identification cible.

source: Now that we have one or more regions of pixels which we believe to be a valid AprilTag, we need to identify which tag we are looking at. This is done by "decoding" the pattern of light and dark squares on the inside.
fr_ca: Maintenant que nous avons ai moins une région de pixels que nous croyons être un AprilTag valide, nous devons identifier l'étiquette que nous regardons. Cela est fait en "décodant" le motif de carrés clairs et foncés à l'intérieur.

source: Calculate the expected interior pixel coordinates where the center of each bit should be
fr_ca: Calculer les coordonnées attendues des pixels intérieurs où le centre de chaque bit devrait être

source: Mark each location as "1" or "0" by comparing the pixel intensity to a threshold
fr_ca: Marquer chaque emplacement en tant que "1" ou "0" en comparant l'intensité des pixels à un seuil

source: Find the tag ID which most closely matches what was seen in the image, allowing for one or two bit errors.
fr_ca: Trouver l'identifiant d'étiquette qui correspond de près avec ce qui a été vu dans l'image, en permettant une erreur d'un ou deux bits.

source: It is possible there is no valid tag ID which matches the suspect tag. In this case, the decoding process stops.
fr_ca: Il est possible qu'il n'y ait aucun identifiant d'étiquette valide qui correspond à l'étiquette suspectée. Dans ce cas, le processus de décodage s'arrête.

source: Fit External Quad
fr_ca: Adapter le quadrilatère externe

source: External quadrilateral fitting process applied to each target
fr_ca: Processus d'adaptation du quadrilatère externe appliqué à chaque cible

source: Now that we have a tag ID for the region of pixels, we need to do something useful with it.
fr_ca: Maintenant que nous avons un identifiant d'étiquette pour la région de pixels, nous devons faire quelque chose d'utile avec.

source: For most FRC applications, we care about knowing the precise location of the corners of the tag, or its center. In both cases, we expect the resolution-lowering operation we did at the beginning to have distorted the image, and we want to undo those effects.
fr_ca: Pour la plupart des applications en FRC, nous nous soucions de savoir la localisation précise des coins de l'étiquette, ou son centre. Dans les deux cas, nous nous attendons à ce que l'opération de diminution de la résolution que nous avons effectué au débit ait déformé l'image et nous voulons renverser ces effets.

source: The algorithm to do this is:
fr_ca: L'algorithme pour faire cela est:

source: Use the detected tag location to define a region of interest in the original-resolution image
fr_ca: Utiliser la position de l'étiquette détectée pour définir une région d'intérêt dans l'image de résolution originale

source: Calculate the :term:`gradient` at pre-defined points in the region of interest to detect where the image most sharply transitions between black to white
fr_ca: Calculer la :term:`pente` à des points prédéfinis dans la région d'intérêt pour détecter où l'image transitionne nettement entre le blanc et le noir

source: Use these gradient measurements to rapidly re-fit an exterior quadrilateral at full resolution
fr_ca: Utiliser ces mesures de pente pour rapidement réajuster un quadrilatère extérieur à la pleine résolution

source: Use geometry to calculate the exact center of the re-fit quadrilateral
fr_ca: Utiliser la géométrie pour calculer le centre exact du quadrilatère réajusté

source: Note that this step is optional, and can be skipped for faster image processing. However, skipping it can induce significant errors into your robot's behavior, depending on how you are using the tag outputs.
fr_ca: Notez que cette étape est optionnelle et peut être ignorée pour un calcul plus rapide de l'image. Cependant, l'ignorer peut introduire des erreurs significative dans le comportement de votre robot, dépendamment de la manière que vous utilisez les sorties des étiquettes.

source: Usage
fr_ca: Utilisation

source: 2D Alignment
fr_ca: Alignement 2D

source: A simple strategy for using targets is to move the robot until the target is centered in the image. Assuming the field and robot are constructed such that the gamepiece, scoring location, vision target, and camera are all aligned, this method should proved a straightforward method to automatically align the robot to the scoring position.
fr_ca: Une stratégie simple pour utiliser les cibles est de bouger le robot jusqu'à ce que la cible soit centrée dans l'image. Supposant que le terrain et le robot sont construits d'une manière que les pièces de jeu, la position du but, la cible de vision et la caméra sont alignés, cette méthode devrait être une méthode simple pour aligner le robot à la position de pointage.

source: Using a camera, identify the *centroid* of the AprilTags in view. If the tag's ID is correct, apply drivetrain commands to rotate the robot left or right until the tag is centered in the camera image.
fr_ca: En utilisant une caméra, identifiez le "centroïde" des AprilTags en vue. Si l'identifiant d'étiquette est correct, appliquez des commandes de conduite pour tourner le robot vers la gauche ou la droite jusqu'à ce que l'étiquette soit centrée dans l'image.

source: This method does not require calibrating the camera or performing the homography step.
fr_ca: Cette méthode ne requiert pas de calibration ou de performer l'étape d'homographie.

source: 3D Alignment
fr_ca: Alignement 3D

source: Code examples coming soon!
fr_ca: Les exemples de code arriveront bientôt!

source: A more advanced usage of AprilTags is to use their corner locations to help perform on-field localization.
fr_ca: Une utilisation plus avancée des AprilTags est d'utiliser leur position de coins pour aider au positionement sur le terrain.

source: Each image is searched for AprilTags using the algorithm described on this page. Using assumptions about how the camera's lense distorts the 3d world onto the 2d array of pixels in the camera, an estimate of the camera's position relative to the tag is calculated. A good camera calibration is required for the assumptions about its lens behavior to be accurate.
fr_ca: Des AprilTags sont recherchés dans chaque image en utilisant l'algorithme décrit sur cette page. En utilisant des inférences sur la manière que la lentille de la caméra déforme le monde 3d en un tableau de pixels 2d dans la caméra, une estimation de la position de la caméra en relation avec l'étiquette est calculée. Une bonne calibration de la caméra est requise pour que les estimations sur le comportement de sa lentille soient précises.

source: The tag's ID is also decoded. from the image. Given each tag's ID, the position of the tag on the field can be looked up.
fr_ca: L'identifiant de l'étiquette est aussi décodé depuis l'image. Compte tenu de chaque identifiant d'étiquette, la position de l'étiquette sur le terrain peut être recherchée.

source: Knowing the position of the tag on the field, and the position of the camera relative to the tag, the 3D geometry classes can be used to estimate the position of the camera on the field.
fr_ca: Sachant la position de l'étiquette sur le terrain ainsi que la position de la caméra en relation avec l'étiquette, les classes de géométrie 3D peuvent être utilisées pour estimer la position de la caméra sur le terrain.

source: If the camera's position on the robot is known, the robot's position on the field can also be estimated.
fr_ca: Si la positon de la caméra sur le robot est connue, la position du robot sur le terrain peut aussi être estimée.

source: These estimates can be incorporated into the WPILib pose estimation classes.
fr_ca: Ces estimations peuvent être incorporées dans les classes d'estimation de pose de la WPILib.

source: 2D to 3D Ambiguity
fr_ca: Ambiguïté 2D vers 3D

source: The process of translating the four known corners of the target in the image (two-dimensional) into a real-world position relative to the camera (three-dimensional) is inherently ambiguous. That is to say, there are multiple real-world positions that result in the target corners ending up in the same spot in the camera image.
fr_ca: Le processus de traduire les quatre coins connus de la cible dans l'image (en deux dimension) en une position réelle relative à la caméra (en trois dimensions) est intrinsèquement ambiguë. Cela est pour dire qu'il y a plusieurs positions réelles qui résultent en les coins cibles étant aux mêmes endroits dans l'image de la caméra.

source: Humans can often use lighting or background clues to understand how objects are oriented in space. However, computers do not have this benefit. They can be tricked by similar-looking targets:
fr_ca: Les humains peuvent souvent utiliser l'éclairage ou les indices en arrière-plan pour comprendre comment les objets sont orientés dans l'espace. Cependant, les ordinateurs n'ont pas ce bienfait. Ils peuvent être confus par des cibles similaires:

source: First optical illusion example of planar ambiguity
fr_ca: Premier exemple d'illusion d'optique d'ambiguïté planaire

source: Second optical illusion example of planar ambiguity
fr_ca: Deuxième exemple d'illusion d'optique d'ambiguïté planaire

source: Third optical illusion example of planar ambiguity
fr_ca: Troisième exemple d'illusion d'optique d'ambiguïté planaire

source: Resolving which position is "correct" can be done in a few different ways:
fr_ca: Résoudre quelle position est "correcte" peut être fait de quelques manières différentes:

source: Use your odometry history from all sensors to pick the pose closest to where you expect the robot to be.
fr_ca: Utiliser votre historique d'odométrie de tous les capteurs pour choisir la pose la plus proche d'où vous vous attendez que le robot soit.

source: Reject poses which are very unlikely (ex: outside the field perimeter, or up in the air)
fr_ca: Rejeter les poses très improbables (ex : hors du périmètre du terrain, ou en l'air)

source: Ignore pose estimates which are very close together (and hard to differentiate)
fr_ca: Ignorer les estimations de poses qui sont très proche l'une de l'autre (et difficile à différencier)

source: Use multiple cameras to look at the same target, such that at least one camera can generate a good pose estimate
fr_ca: Utiliser plusieurs caméras pour regarder la même cible afin qu'au moins une caméra puisse générer une assez bonne estimation

source: Look at many targets at once, using each to generate multiple pose estimates. Discard the outlying estimates, use the ones which are tightly clustered together.
fr_ca: Regarder plusieurs cibles à la fois, en utilisant chacune pour générer plusieurs estimations de pose. Rejeter les estimations externes, en utilisant celles qui sont regroupées fermement ensemble.

source: Adjustable Parameters
fr_ca: Paramètres ajustables

source: ``Decimation factor`` impacts how much the image is down-sampled before processing. Increasing it will increase detection speed, at the cost of not being able to see tags which are far away.
fr_ca: ``Decimation Factor`` modifie à quel point l'image est dé-échantillonnée avant le traitement. L'augmenter accroîtra la vitesse de détection, au coût de ne pas voir les étiquettes qui sont éloignées.

source: ``Blur`` applies smoothing to the input image to decrease noise, which increases speed when fitting quads to pixels, at the cost of precision. For most good cameras, this may be left at zero.
fr_ca: ``Blur`` applique un lissage à l'image en entrée afin de réduire le bruit, ce qui accroît la vitesse de correspondance entre les pixels et les quadrilatères, au coût de la précision. Pour la plupart des caméras, ceci peut être laissé à zéro.

source: ``Threads`` changes the number of parallel threads which the algorithm uses to process the image. Certain steps may be sped up by allowing multithreading. In general, you want this to be approximately equal to the number of physical cores in your CPU, minus the number of cores which will be used for other processing tasks.
fr_ca: ``Threads`` changent le nombre de processus parallèles que l'algorithme utilise afin de traiter l'image. Certaines étapes peuvent êtres accélérées en permettant le multitraitement. En général, vous voudrez ce paramètre à peu près égal au nombre de cœurs physiques dans votre processeur, moins le nombre de cœurs qui seront utilisés dans d'autres tâches de traitement.
