Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/shuffleboard/advanced-usage/shuffleboard-commands-subsystems.po
Languages: es_mx, zh_cn

source: Commands and Subsystems
es_mx: Comandos y Subsistemas
zh_cn: 指令和子系统

source: When using the command-based framework Shuffleboard makes it easier to understand what the robot is doing by displaying the state of various commands and subsystems in real-time.
es_mx: Al utilizar un framework basado en comandos, Shuffleboard hace más sencillo entender qué es lo que el robot hace pues muestra el estado de varios comandos y subsistemas en tiempo real.
zh_cn: 使用 command-based 架构时，"Shuffleboard" 可以通过实时显示各种命令和子系统的状态来帮助人们更轻松地了解机器人在做什么。

source: Displaying Subsystems
es_mx: Visualización de subsistemas
zh_cn: 显示子系统

source: To see the status of a subsystem while the robot is operating in either autonomous or teleoperated modes, that is what its default command is and what command is currently using that subsystem, send a subsystem instance to Shuffleboard:
es_mx: Para ver el estado de un subsistema mientras el robot está operando, ya sea en modo autónomo o teleoperado, eso es lo que sus comandos predeterminados son y qué comando está utilizando el subsistema en ese momento, envía un ``instance`` del subsistema a la Shuffleboard:
zh_cn: 如果要在机器人以自动或遥控模式运行时查看其子系统的状态（即其默认命令是什么，以及当前正在使用该子系统的命令），请将子系统实例发送到Shuffleboard：

source: Shuffleboard will display the subsystem name, the default command associated with this subsystem, and the currently running command. In this example the default command for the Elevator subsystem is called ``AutonomousCommand`` and it is also the current command that is using the Elevator subsystem.
es_mx: Suffleboard mostrará el nombre del subsistema, el comando predeterminado asociado al subsistema y el comando utilizado en ese momento. En este ejemplo el comando predeterminado del subsistema elevador se llama ``AutonomousCommand`` y también es el comando que se está utilizando en el subsistema Elevador en ese momento.
zh_cn: Shuffleboard将显示子系统名称，与此子系统关联的默认命令以及当前正在运行的命令。 在此示例中，Elevator子系统的默认命令称为``AutonomousCommand''，它也是使用Elevator子系统的当前命令。

source: Subsystems in Test Mode
es_mx: Subsistemas en Modo de prueba
zh_cn: 测试模式下的子系统

source: In Test mode (Test/Enabled in the driver station) subsystems may be displayed in the LiveWindow tab with the sensors and actuators of the subsystem. This is ideal for verifying of sensors are working by seeing the values that they are returning. In addition, actuators can be operated. For example, motors can be operated using sliders to set their commanded speed and direction. For PIDSubsystems the P, I, D, and F constants are displayed along with the setpoint and an enable control. This is useful for tuning PIDSubsystems by adjusting the constants, putting in a setpoint, and enabling the embedded PIDController. Then the mechanism's response can be observed. This cycle (change parameters, enable, and observe) can be repeated until a reasonable set of parameters is found.
es_mx: En el Modo de prueba (Prueba/Habilitado en la driver station) los subsistemas pueden mostrarse en la pestaña de LiveWindow con los sensores y actuadores del subsistema. Esto es ideal para verificar que los sensores están funcionando correctamente al confirmar que se están devolviendo los valores. Además, los actuadores pueden ser operados. Por ejemplo, los motores pueden operarse utilizando intensificadores para configurar su velocidad y dirección. Para subsistemas PID, los valores P, I, D y F son constantes que se muestran junto a los puntos de control y un control habilitado. Esto puede ser de utilidad para sintonizar los subsistemas PID al ajustar dichas constantes, configurar un punto de control, y habilitar el controlador PID embebido. Así, puede observarse la respuesta del mecanismo. Este ciclo (modificar parámetros, habilitar y observar) puede repetirse hasta que se encuentre un conjunto razonable de parámetros.
zh_cn: 在“测试”模式（driver station中的“Test/Enabled”）中，子系统可以与子系统的传感器和执行器一起显示在LiveWindow选项卡中。这有助于通过查看传感器返回的值来判断传感器是否正常工作。另外，可以使用actuators。例如，可以使用滑块操作马达以设置其移动速度和方向。对于PID子系统，将显示P，I，D和F常数以及他们的设定值和启用控制器。这对于通过调整常量，输入设定值并启用嵌入式PIDController来调整PIDSubsystems来说很有用。这样就可以观察到该机制的响应。可以重复此循环（更改参数，启用和观察），直到找到合理的参数集为止。

source: Todo
es_mx: Qué hacer
zh_cn: 待办事项

source: Add RobotBuilder links
es_mx: Agregar enlaces de RobotBuilder
zh_cn: 添加RobotBuilder链接

source: More information on tuning PIDSubsystems can be found :doc:`here <shuffleboard-tuning-pid>`. Using RobotBuilder will automatically generate the code to get the subsystem displayed in Test mode. The code that is necessary to have subsystems displayed is shown below where subsystem-name is a string containing the name of the subsystem:
es_mx: Para mayor información sobre cómo sintonizar subsistemas PID :doc:`aquí <shuffleboard-tuning-pid>`. Utilizar RobotBuilder automáticamente generará el código necesario para obtener el subsistema mostrado en el Modo de prueba. El código necesario para mostrar los subsistemas se encuentra aquí abajo, donde el nombre del subsistema es una cadena de caracteres.
zh_cn: 有关PIDSubsystems的更多信息可以在这里找到：<shuffleboard-tuning-pid>使用RobotBuilder将自动生成代码，以便在Test模式下显示子系统。需要显示子系统的代码如下所示，其中子系统名称是包含子系统名称的字符串：

source: Displaying Commands
es_mx: Visualizar comandos
zh_cn: 显示命令

source: Using commands and subsystems makes very modular robot programs that can easily be tested and modified. Part of this is because commands can be written completely independently of other commands and can therefor be easily run from Shuffleboard. To write a command to Shuffleboard use the ``SmartDashboard.putData`` method as shown here:
zh_cn: 使用命令和子系统可以创建非常模块化的机器人程序，可以轻松对这些程序进行测试和修改。部分原因是因为命令可以完全独立于其他命令编写，因此可以使用Shuffleboard轻松运行。要将命令写入Shuffleboard，请使用SmartDashboard.putData方法，如下所示：

source: Shuffleboard will display the command name and a button to execute the command. In this way individual commands and command groups can easily be tested without needing special test code in a robot program. In the image below there are a number of commands contained in a Shuffleboard list. Pressing the button once runs the command and pressing it again stops the command. To use this feature the robot must be enabled in teleop mode.
es_mx: Shuffleboard mostrará el nombre del comando y un botón para ejecutarlo. De esta forma, comandos individuales y en grupo pueden probarse fácilmente sin necesidad de un código de prueba especial en el programa del robot. En la siguiente imagen se encuentran algunos comandos contenidos en una lista de Shuffleboard. Al presionar el botón una vez se corre el comando y al presionarlo de nuevo, se detiene. Para utilizar esta característica el robot debe tener habilitado el modo teleoperado.
zh_cn: Shuffleboard 将显示命令名称和一个用于执行命令的按钮。这样，可以轻松地测试单个命令和命令组，而无需在机器人程序中使用特殊的测试代码。在下图中，Shuffleboard 列表中包含许多命令。一次按下按钮将运行命令，再次按下将停止命令。要使用此功能，机器人必须开启遥控模式。
