Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/geometry/coordinate-systems.po
Languages: fr_ca

source: Coordinate Systems
fr_ca: Systèmes de Coordonnées

source: In FRC\ |reg|, there are two main coordinate systems that we use for representing objects' positions.
fr_ca: En FRC\ |reg|, il existe deux principaux systèmes de coordonnées que nous utilisons pour représenter les positions des objets.

source: Field Coordinate System
fr_ca: Système de Coordonnées du Terrain

source: The field coordinate system (or global coordinate system) is an absolute coordinate system where a point on the field is designated as the origin. Positive :math:`\theta` (theta) is in the counter-clockwise direction, and the positive x-axis points away from your alliance's driver station wall, and the positive y-axis is perpendicular and to the left of the positive x-axis.
fr_ca: Le système de coordonnées du terrain (ou système de coordonnées global) est un système de coordonnées absolu où un point sur le terrain est désigné comme l'origine. Un angle :math:`\theta` (theta) positif correspond à une rotation anti-horaire, et l'axe x positif pointe vers le coté opposé du terrain, soit vers le poste poste de conduite de l'alliance adversaire. L'axe y positif est perpendiculaire à l'axe x et pointe vers la gauche.

source: In this system the coordinates are fixed based upon the field.
fr_ca: Dans ce système, les coordonnées sont fixes en fonction du terrain.

source: The axes are shown at the middle of the field for visibility. The origins of the coordinate system for each alliance are shown below.
fr_ca: Les axes sont montrés au centre du terrain pour la visibilité. Les origines du système de coordonnées pour chaque alliance sont montrés ci-dessous.

source: Below is an example of a field coordinate system overlayed on the 2020 FRC field. The red axes shown are for the red alliance, and the blue axes shown are for the blue alliance.
fr_ca: Ci-dessous, on retrouve un exemple de ce système de coordonnées superposé sur le terrain de jeu FRC 2020. Les axes rouges indiqués sont pour l'alliance rouge, et les axes blues sont pour l'alliance bleue.

source: Image of the Infinite Recharge field.
fr_ca: Image du terrain de la compétition Infinite Recharge.

source: Robot Coordinate System
fr_ca: Système de Coordonnées du Robot

source: The robot coordinate system (or local coordinate system) is a relative coordinate system where the robot is the origin. The direction the robot is facing is the positive x axis, and the positive y axis is perpendicular, to the left of the robot. Positive :math:`\theta` is counter-clockwise.
fr_ca: Le système de coordonnées du robot (ou système de coordonnées local) est un système de coordonnées relatif où le robot est l'origine. Le direction a laquelle le robot fait face est l'axe x positif, et l'axe y positif est perpendiculaire à l'axe x, pointant vers la gauche du robot. L'angle :math:`\theta` positif correspond à une rotation anti-horaire.

source: WPILib's ``Gyro`` class is clockwise-positive, so you have to invert the reading in order to get the rotation with either coordinate system.
fr_ca: La classe WPILib ``Gyro`` donne des résultats positifs dans le sens horaire , donc vous avez besoin d'inverser sa valeur (nouvel angle = 0 - angle gyro) pour obtenir le bon sens de rotation pour l'un ou l'autre système de coordonnées.

source: The robot coordinate system is based on the robot's position.
fr_ca: Le système de coordonnées du robot est basé sur la position du robot.
