Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/geometry/transformations.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Transformations
es_mx: Transformaciones
tr_tr: Dönüşümler
zh_cn: 转变

source: Operations on a ``Translation2d`` perform operations to the vector represented by the ``Translation2d``.
es_mx: Las operaciones en un ``Translation2d`` llevan a cabo operaciones en el vector representado por ``Translation2d``.
fr_ca: Les opérations sur un ``Translation2d`` exécutent des opérations sur le vecteur representé par le ``Translation2d``.
tr_tr: Bir ``Translation2d`` üzerindeki işlemler, ``Translation2d`` ile temsil edilen vektör üzerinde işlemler gerçekleştirir.
zh_cn: 在Translation2d上的操作对由Translation2d表示的向量执行操作。

source: Addition: Addition between two ``Translation2d`` a and b can be performed using ``plus`` in Java, or the ``+`` operator in C++. Addition adds the two vectors.
es_mx: Adición: La adición ente 2 ``Translation2d`` a y b se puede lograr usando ``plus`` en Java, o el operador ``+`` en C++. Adición suma los 2 vectores.
fr_ca: Addition: L'addition entre deux ``Translation2d`` a et b peut être exécuté en utilisant ``plus`` en Java, ou l'opérateur ``+`` en C++. L'addition ajoute les deux vecteurs.
tr_tr: Ekleme: İki ``Translation2d`` a ve b arasındaki ekleme, Java'da ``plus`` veya C ++ 'da ``+`` 'operatörü kullanılarak gerçekleştirilebilir. Ekleme, iki vektörü ekler.
zh_cn: 加法：可以使用Java中的plus或C ++中的+运算符在两个Translation2d a和b之间进行加法。加法将两个向量相加。

source: Subtraction: Subtraction between two ``Translation2d`` can be performed using ``minus`` in Java, or the binary ``-`` operator in C++. Subtraction subtracts the two vectors.
es_mx: Substracción: Substracción entre dos ``Translation2d`` puede lograrse usando ``minus`` en Java, o el operador binario ``-`` en C++. Substracción resta los dos vectores.
fr_ca: Soustraction: Soustraction entre deux ``Translation2d`` peut être exécuté en utilisant ``minus`` en Java ou l'opérateur binaire ``-`` en C++. Soustraction soustrait les deux vecteurs.
tr_tr: Çıkarma: İki `` Translation2d '' arasındaki çıkarma, Java'da ``minus``veya C ++ 'da ikili ``-`` operatörü kullanılarak gerçekleştirilebilir. Çıkarma, iki vektörü çıkarır.
zh_cn: 减法：两个“ Translation2d”之间的减法可以在Java中使用减号或在C ++中使用二进制“-”运算符来执行。减法减去两个向量。

source: Multiplication: Multiplication of a ``Translation2d`` and a scalar can be performed using ``times`` in Java, or the ``*`` operator in C++. This multiplies the vector by the scalar.
es_mx: Multiplicación: La multiplicación de un ``Translation2d`` y un escalar puede lograrse usando ``times`` en Java el operador ``*`` en C++. Esto multiplica el vector por el escalar.
fr_ca: Multiplication: Multiplication d'un ``Translation2d`` et un scalaire peut être exécuté en utilisant ``times`` en Java ou l'opérateur ``*`` en C++. Cela multiplie le vecteur par le scalaire.
tr_tr: Çarpma: Bir ``Translation2d`` ve bir sayısal çarpımı, Java'da ``times`` veya C ++ 'da ``*`` operatörü kullanılarak gerçekleştirilebilir. Bu, vektörü sayısal olarak çarpar.
zh_cn: 乘法：可以使用Java中的“时间”或C ++中的“ *”运算符来执行“ Translation2d”和标量的乘法。 该乘法是将向量乘以标量。

source: Division: Division of a ``Translation2d`` and a scalar can be performed using ``div`` in Java, or the ``/`` operator in C++. This divides the vector by the scalar.
es_mx: División: La división de un ``Translation2d`` y un escalar puede lograrse usando ``div`` en Java, o el operador ``/`` en C++. Esto divide el vector entre el escalar.
fr_ca: Division: Division d'un ``Translation2d`` et un scalaire peut être exécuté en utilisant ``div`` en Java, ou l'opérateur ``/`` en C++. Cela divise le vecteur par le scalaire.
tr_tr: Bölüm: Bir ``Translation2d`` ve bir sayısal bölümü, Java'da ``div`` veya C ++ 'da ``/`` operatörü kullanılarak gerçekleştirilebilir. Bu, vektörü sayısal olarak böler.
zh_cn: 除法：可以使用Java中的div或C ++中的/运算符来执行Translation2d和标量的除法。该除法是用矢量除以标量。

source: Rotation: Rotation of a ``Translation2d`` by a counter-clockwise rotation :math:`\theta` about the origin can be performed by using ``rotateBy``. This is equivalent to multiplying the vector by the matrix :math:`\begin{bmatrix} cos\theta & -sin\theta \\ sin\theta & cos\theta \end{bmatrix}`
es_mx: Rotación: La rotación de un ``Translation2d`` por una rotación contraria a las manecillas del reloj :math:`\theta` sobre el origen puede ser logrado al usar ``rotateBy``. Esto es equivalente a multiplicar el vector por la matriz :math:`\begin{bmatrix} cos\theta & -sin\theta \\ sin\theta & cos\theta \end{bmatrix}`
fr_ca: Rotation: Rotation d'un ``Translation2d`` de façon anti-horaire en utilisant un angle de rotation :math:`\theta` autour de l'origine. Cela peut être exécuté en utilisant ``rotateBy``, et équivaut à multiplier le vecteur par la matrice :math:`\begin{bmatrix} cos\theta & -sin\theta \\ sin\theta & cos\theta \end{bmatrix}`
tr_tr: Döndürme: Bir ``Translation2d`` nin saat yönünün tersine dönüşle döndürülmesi :math:`\theta`, ``rotateBy`` kullanılarak orijin etrafında yapılabilir. Bu, vektörün matrisle çarpılmasına eşdeğerdir :math:`\begin{bmatrix} cos\theta & -sin\theta \\ sin\theta & cos\theta \end{bmatrix}`
zh_cn: 旋转：通过使用“ rotateBy”，可以绕着原点逆时针旋转``Translation2d”。这相当于将向量乘以矩阵：math:`\begin{bmatrix} cos\theta & -sin\theta \\ sin\theta & cos\theta \end{bmatrix}`

source: Additionally, you can rotate a ``Translation2d`` by 180 degrees by using ``unaryMinus`` in Java, or the unary ``-`` operator in C++.
es_mx: Adicionalmente, usted puede rotar un ``Translation2d`` 180 grados al usar ``unaryMinus`` en Java, o el operador unario ``-`` en C++.
fr_ca: Aditionellement, vous pouvez tourner un ``Translation2d`` de 180 degrés en utilisant ``unaryMinus`` en Java, ou l'opératueur ``-`` en C++.
tr_tr: Ek olarak, Java'da ``unaryMinus`` veya C ++ 'da tekli ``-`` operatörünü kullanarak bir ``Translation2d`` 'yi 180 derece döndürebilirsiniz.
zh_cn: 另外，您可以通过在Java中使用“ unaryMinus”或在C ++中使用一元“-”运算符将“ Translation2d”旋转180度。

source: Transformations for ``Rotation2d`` are just arithmetic operations on the angle measure represented by the ``Rotation2d``.
es_mx: Las transformaciones para ``Rotation2d`` son solo operaciones aritméticas en la medida del ángulo representadas por ``Rotation2d``.
fr_ca: Transformations sur un ``Translation2d`` sont juste des opérations arithmétiques sur la mesure d'angle representé par le ``Rotation2d``.
tr_tr: ``Rotation2d`` için dönüşümler, ``Rotation2d`` ile temsil edilen açı ölçüsündeki aritmetik işlemlerdir.
zh_cn: ``Rotation2d''的转换只是对由``Rotation2d``表示的角度度量的算术运算。

source: ``plus`` (Java) or ``+`` (C++): Adds the rotation component of ``other`` to this ``Rotation2d``'s rotation component
es_mx: ``plus`` (Java) o ``+`` (C++): suma el componente de rotación de ``other`` al componente de rotación de éste``Rotation2d``.
fr_ca: ``plus`` (Java) ou ``+`` (C++): Ajoute le composant rotation de ``other`` à celui de cette ``Rotation2d``.
tr_tr: ``plus`` (Java) veya ``+`` (C ++): Bu ``Rotation2d`` nin rotasyon bileşenine ``other`` rotasyon bileşenini ekler
zh_cn: ``plus``（Java）或``+``（C ++）：将``other``的旋转分量添加到此``Rotation2d''的旋转分量

source: ``minus`` (Java) or binary ``-`` (C++): Subtracts the rotation component of ``other`` to this ``Rotation2d``'s rotation component
es_mx: ``minus`` (Java) o el binario ``-`` (C++): Sustrae el componente de rotación de ``other`` al componente de rotación de éste ``Rotation2d``.
fr_ca: ``minus`` (Java) ou ``-`` binaire (C++): Soustrait le composant de rotation de ``other`` de celui de cette ``Rotation2d``
tr_tr: ``minus`` (Java) veya ikili ``-`` (C ++): ``other`` ın rotasyon bileşenini bu ``Rotation2d`` nin rotasyon bileşeninden çıkarır
zh_cn: ``减号（Java）或二进制``-''（C ++）：将``other''的旋转分量减去到此``Rotation2d''的旋转分量

source: ``unaryMinus`` (Java) or unary ``-`` (C++): Multiplies the rotation component by a scalar of -1.
es_mx: ``unaryMinus`` (Java) o el unario ``-`` (C++): Multiplica el componente de rotación por un escalar de -1.
fr_ca: ``unaryMinus`` (Java) ou ``-`` unaire (C++): Multiplie le composant de rotation par un scalaire de -1.
tr_tr: ``unaryMinus`` (Java) veya tekil ``-`` (C ++): Döndürme bileşenini -1 sayısalıyla çarpar.
zh_cn: ``unaryMinus''（Java）或一元``-''（C ++）：将旋转分量乘以标量-1。

source: ``times`` (Java) or ``*`` (C++) : Multiplies the rotation component by a scalar.
es_mx: ``times`` (Java) o ``*`` (C++) : Multiplica el componente de rotación por un escalar.
fr_ca: ``times`` (Java) ou ``*`` (C++): Multiplie le composant de rotation par un scalaire.
tr_tr: ``times`` (Java) veya ``*`` (C ++): Döndürme bileşenini bir sayısal ile çarpar.
zh_cn: ``times``（Java）或``*``（C ++）：将旋转分量乘以标量。

source: Transform2d and Twist2d
es_mx: Transform2d y Twist2d
fr_ca: Transform2d et Twist2d
tr_tr: Transform2d ve Twist2d

source: ``Transform2d`` represents a **relative** transformation. It has an translation and a rotation component. Transforming a ``Pose2d`` by a ``Transform2d`` rotates the translation component of the transform by the rotation of the pose, and then adds the rotated translation component and the rotation component to the pose. In other words, ``Pose2d.plus(Transform2d)`` returns :math:`\begin{bmatrix} x_p \\ y_p \\ \theta_p \end{bmatrix}+\begin{bmatrix} cos\theta_p & -sin\theta_p & 0 \\ sin\theta_p & cos\theta_p & 0 \\ 0 & 0 & 1 \end{bmatrix}\begin{bmatrix}x_t \\ y_t \\ \theta_t \end{bmatrix}`
es_mx: ``Transform2d`` representa una transformación **relativa**. Tiene un componente de rotación y traslación. Transformar un ``Pose2d`` por un ``Transform2d`` rota el componente de traslación de la transformación por la rotación de la pose, y entonces suma el componente de traslación y el componente de rotación de la pose. En otras palabras, ``Pose2d.plus(Transform2d)`` regresa :math:`\begin{bmatrix} x_p \\ y_p \\ \theta_p \end{bmatrix}+\begin{bmatrix} cos\theta_p & -sin\theta_p & 0 \\ sin\theta_p & cos\theta_p & 0 \\ 0 & 0 & 1 \end{bmatrix}\begin{bmatrix}x_t \\ y_t \\ \theta_t \end{bmatrix}`
fr_ca: ``Transform2d`` représente une transformation **relative**. Elle a deux composantes: une de transfert et l'autre de rotation. La transformation d'un ``Pose2d`` par un ``Transform2d`` s'effectue en faisant pivoter le composant "translation" du transfert selon le paramètre de rotation de la pose, et ensuite on ajoute le composant transfert tourné et le composant de rotation de pose. En d'autre termes, ``Pose2d.plus(Transform2d)`` revient :math:`\begin{bmatrix} x_p \\ y_p \\ \theta_p \end{bmatrix}+\begin{bmatrix} cos\theta_p & -sin\theta_p & 0 \\ sin\theta_p & cos\theta_p & 0 \\ 0 & 0 & 1 \end{bmatrix}\begin{bmatrix}x_t \\ y_t \\ \theta_t \end{bmatrix}`
tr_tr: ``Transform2d``, **göreceli-relative** bir dönüşümü temsil eder. Bir öteleme ve döndürme bileşenine sahiptir. Bir ``Pose2d`` nin bir ``Transform2d`` ile dönüştürülmesi, dönüşümün çeviri bileşenini pozun dönüşüyle döndürür ve ardından döndürülen çeviri bileşenini ve döndürme bileşenini poza ekler. Başka bir deyişle, ``Pose2d.plus(Transform2d)`` şunu döndürür :math:`\begin{bmatrix} x_p \\ y_p \\ \theta_p \end{bmatrix}+\begin{bmatrix} cos\theta_p & -sin\theta_p & 0 \\ sin\theta_p & cos\theta_p & 0 \\ 0 & 0 & 1 \end{bmatrix}\begin{bmatrix}x_t \\ y_t \\ \theta_t \end{bmatrix}`
zh_cn: ``Transform2d''代表一个``相对''转换。它具有平移和旋转组件。通过“ Transform2d”变换“ Pose2d”，将通过姿势的旋转来旋转变换的平移分量，然后将旋转的平移分量和旋转分量添加到该位姿。换句话说，``Pose2d.plus(Transform2d)`` 返回 :math:`\begin{bmatrix} x_p \\ y_p \\ \theta_p \end{bmatrix}+\begin{bmatrix} cos\theta_p & -sin\theta_p & 0 \\ sin\theta_p & cos\theta_p & 0 \\ 0 & 0 & 1 \end{bmatrix}\begin{bmatrix}x_t \\ y_t \\ \theta_t \end{bmatrix}`

source: ``Twist2d`` represents a change in distance along an arc. Usually, this class is used to represent the movement of a drivetrain, where the x component is the forward distance driven, the y component is the distance driven to the side (left positive), and the :math:`\theta` component is the change in heading. The underlying math behind finding the pose exponential (new pose after moving the pose forward along the curvature of the twist) can be found `here <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ in chapter 10.
es_mx: ``Twist2d`` representa un cambio en distancia a través de un arco, Usualmente, esta clase es usada para representar el movimiento de un tren motriz, donde el componente x es la distancia frontal manejada, el componente y es la distancia manejada hacia un lado (Izquierda positiva), y el componente :math:`\theta` es el cambio de rumbo, La matemática subyacente detrás de encontrar la pose exponencial (Posición nueva tras moverse de frente a traves de la curvatura del giro) puede ser encontrada `aquí <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ en el capítulo 10.
fr_ca: ``Twist2d`` représente un changement en distance le long d'un arc. Généralement, cette classe est utilisé pour représenter le mouvement de du chassis du robot, où le composant x est la distance parcourue vers l'avant, le composant y est la distance parcourue vers le côté, (le côté gauche donne des valeurs positives), et le composant :math:`\theta` est le changement de cap (pivot sur l'axe central en Z du robot). Les mathématiques sous-jacentes qui expliquent les calculs de l'exponentielle de pose (nouvelle position qui suit la courbure de la fonction "Twist2d" ) peuvent être trouvé `ici <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ , au chapitre 10.
tr_tr: ``Twist2d``, bir yay boyunca mesafedeki bir değişikliği temsil eder. Genellikle, bu sınıf, bir aktarma sisteminin hareketini temsil etmek için kullanılır; burada x bileşeni, sürülen ileri mesafedir, y bileşeni, yana sürülen mesafedir (sol pozitif) ve :math:`\theta` bileşeni, başlıktaki değişiklik. Poz üstelini bulmanın ardında yatan matematik (pozu bükülmenin eğriliği boyunca ileriye doğru hareket ettirdikten sonra yeni poz) 10. bölümde `burada <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ _ bulunabilir.
zh_cn: “Twist2d”表示沿弧线的距离变化。通常，这个类用于表示传动系统的运动，其中x组件是向前行驶的距离，y组件是向侧面行驶的距离(左正)，而:math: ' \theta '组件是航向的变化。我们可以在第10章，`此处 <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`找到寻找指数型位姿(沿扭转的曲率向前移动后的新位姿)背后的基本数学原理。

source: For nonholonomic drivetrains, the y component of a ``Twist2d`` should always be 0.
es_mx: Para trenes motrices no holonómicos, el componente y de ``Twist2d`` debe siempre ser 0.
fr_ca: Pour les entraînements non holonomiques (comme le mode Tank), le composant y d'un ``Twist2d`` devrait toujours être 0.
tr_tr: Holonomik olmayan aktarma organları için, bir ``Twist2d`` nin y bileşeni her zaman 0 olmalıdır.
zh_cn: 对于非完整的传动系统，``Twist2d''的y分量应始终为0。

source: Both classes can be used to estimate robot location. Twist2d is used in WPILib's odometry classes to update the robot's pose based on movement, while Transform2d can be used to estimate the robot's global position from vision data.
es_mx: Ambas clases pueden ser usadas para estimar la posición del robot. Twist2d es usado en las clases odométicas de WPILib para actualizar la pose del robot basado en movimiento, mientras que Transform2d puede ser usado para estimar la posición global del robot por los datos de visión.
fr_ca: Les deux classes peuvet être utilisées pour estimer l'emplacement de robot. Twist2d est utilisé pour les classes odométriques de WPILib afin de mettre à jour la pose du robot basée sur le mouvement, tandis que Transform2d peut être utilisée pour estimer l'emplacement global du robot à partir des données de vision.
tr_tr: Her iki sınıf da robot konumunu tahmin etmek için kullanılabilir. Twist2d, WPILib'in odometri sınıflarında, robotun hareketine dayalı duruşunu güncellemek için kullanılırken, Transform2d, robotun küresel konumunu görme verilerinden tahmin etmek için kullanılabilir.
zh_cn: 这两个类别均可用于估计机器人位置。 WPILib的里程表类中使用Twist2d根据运动来更新机器人的姿势，而Transform2d可用于根据视觉数据估计机器人的全局位置。

source: WPILib provides 2 classes, ``Transform2d`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/development/java/edu/wpi/first/math/geometry/Transform2d.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/development/cpp/classfrc_1_1_transform2d.html>`__), which represents a transformation to a pose, and ``Twist2d`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/development/java/edu/wpi/first/math/geometry/Twist2d.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/development/cpp/structfrc_1_1_twist2d.html>`__) which represents a movement along an arc. ``Transform2d`` and ``Twist2d`` all have x, y and :math:`\theta` components.
fr_ca: WPILIb fournit 2 classes, ``Transform2d`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/development/java/edu/wpi/first/math/geometry/Transform2d.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/development/cpp/classfrc_1_1_transform2d.html>`__), qui représente une transformation de la pose, et ``Twist2d`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/development/java/edu/wpi/first/math/geometry/Twist2d.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/development/cpp/structfrc_1_1_twist2d.html>`__) qui représente un mouvement le long d’un arc. ``Transform2d`` et ``Twist2d`` possèdent des composantes x, y et :math:`\theta`.
