Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/labview-dashboard/driver-station-labview-dashboard.po
Languages: fr_ca

source: FRC LabVIEW Dashboard
fr_ca: Dashboard FRC LabVIEW

source: The Dashboard application installed and launched by the FRC\ |reg| Driver Station is a LabVIEW program designed to provide teams with basic feedback from their robot, with the ability to expand and customize the information to suit their needs. This Dashboard application uses :term:`NetworkTables` and contains a variety of tools that teams may find useful.
fr_ca: L'application Dashboard installée et lancée par le FRC \ | reg | Driver Station est un programme LabVIEW conçu pour fournir aux équipes des informations de base sur leur robot, avec la possibilité d'étendre et de personnaliser les informations en fonction de leurs besoins. Cette application de tableau de bord utilise les :term:`NetworkTables` et contient une variété d'outils que les équipes peuvent trouver utiles.

source: LabVIEW Dashboard
fr_ca: Dashboard LabVIEW

source: Default screen of the LabVIEW Dashboard.
fr_ca: Écran par défaut du Dashboard LabVIEW.

source: The Dashboard is broken into two main sections. The left pane is for displaying a camera image. The right pane contains:
fr_ca: Le tableau de bord est divisé en deux sections principales. Le volet gauche est pour afficher une image de la caméra. Le volet droit contient :

source: Drive tab that contains indicators for joystick and drive motor values (hooked up by default when used with LabVIEW robot code), a gyro indicator, an Autonomous selection text box, a connection indicator and some controls and indicators for the camera
fr_ca: L'onglet Drive qui contient des indicateurs pour les valeurs du joystick et du moteur de déplacement (branché par défaut lorsqu’il est utilisé avec le code robot LabVIEW), un indicateur pour les données du gyroscope, une boîte de texte pour la sélection autonome, un indicateur de connexion et quelques contrôles et indicateurs pour la caméra

source: Basic tab that contains some default controls and indicators
fr_ca: L'onglet de Basic qui contient des contrôles et des indicateurs par défaut

source: Camera tab that contains a secondary camera viewer, similar to the viewer in the left pane
fr_ca: L'onglet camera qui contient une visionneuse de caméra secondaire, similaire à la visionneuse dans le volet gauche

source: Custom tab for customizing the dashboard using LabVIEW
fr_ca: L'onglet Custom pour personnaliser le tableau de bord à l’aide de LabVIEW

source: Test tab for use with Test Mode in the LabVIEW framework
fr_ca: L'onglet Test pour une utilisation avec le mode Test dans l'infrastructure logicielle LabVIEW

source: Commands tab for use with the new LabVIEW C&C Framework
fr_ca: L'onglet Commands pour une utilisation avec la nouvelle infrastructure logicielle LabVIEW C&C

source: Checklist tab that can be used to create task lists to complete before and/or between matches
fr_ca: L'onglet Checklist qui peut être utilisé pour créer des listes de tâches à remplir avant et/ou entre les matchs

source: Variables tab that displays the raw NetworkTables variables in a tree view format
fr_ca: L'onglet Variables qui affiche les variables brutes NetworkTables dans un format de vue arborescente

source: The LabVIEW Dashboard also includes Record/Playback functionality, located in the bottom right. More detail about this feature is included below under `Record/Playback`_.
fr_ca: L'application Dashboard LabVIEW inclut également des fonctionnalités d’enregistrement/lecture, situées en bas à droite. Pour plus de détails sur cette fonctionnalité, rendez-vous ci-dessous sous `Record/Playback`_.

source: Camera Image and Controls
fr_ca: Image de la caméra et contrôles

source: Shows the main camera image on the left pane of the dashboard.
fr_ca: Affiche l’image de la caméra principale dans le volet gauche du dashboard.

source: The left pane is used to display a video feed from acamera located on the robot. There are also some controls and indicators related to the camera below the tab area:
fr_ca: Le volet de gauche est utilisé pour afficher un flux vidéo de la caméra située sur le robot. Il existe également des commandes et des indicateurs liés à la caméra sous la zone des onglets :

source: Camera Image Display
fr_ca: Affichage de l’image de la caméra

source: Mode Selector - This drop-down allows you to select the type of camera display to use. The choices are Camera Off, USB Camera SW (software compression), USB Camera HW (hardware compression) and IP Camera (Axis camera). Note that the IP Camera setting will not work when your PC is connected to the roboRIO over USB.
fr_ca: Sélecteur de mode - Ce menu déroulant vous permet de sélectionner le type d’affichage de la caméra à utiliser. Les choix sont Camera Off, USB Camera SW (compression logicielle), USB Camera HW (compression matérielle) et IP Camera (caméra Axis). Notez que le paramètre caméra IP ne fonctionnera pas lorsque votre PC est connecté au roboRIO via USB

source: Camera Settings - This control allows you to change the resolution, framerate and compression of the image stream to the dashboard, click the control to pop-up the configuration.
fr_ca: Paramètres de la caméra - Ce contrôle vous permet de modifier la résolution, la fréquence des images et la compression du flux d’images sur le tableau de bord, cliquez sur le contrôle sélectionner les paramètres de configuration.

source: Bandwidth Indicator - Indicates approximate bandwidth usage of the image stream. The indicator will display green for "safe" bandwidth usage, yellow when teams should use caution and red if the stream bandwidth is beyond levels that will work on the competition field.
fr_ca: Indicateur de bande passante - Indique l’utilisation approximative de la bande passante du flux d’images. L’indicateur affichera le vert pour une utilisation de bande passante "sûre", le jaune lorsque les équipes doivent faire preuve de prudence et le rouge si la bande passante du flux est au-delà des niveaux qui fonctionneront sur le terrain de compétition.

source: Framerate - Indicates the approximate received framerate of the image stream.
fr_ca: Fréquence d'images - Indique la fréquence d'images approximative reçue du flux d’images.

source: The bandwidth indicator indicates the combined bandwidth for all camera streams open.
fr_ca: L’indicateur de bande passante indique la bande passante combinée pour tous les flux de caméras ouverts.

source: The "Drive" tab is the first on the right side.
fr_ca: L’onglet "Drive" est le premier sur le côté droit.

source: The center pane contains a section that provides feedback on the joysticks and drive commands when used with the LabVIEW framework and a section that displays the NetworkTables status and autonomous selector:
fr_ca: Le volet central contient une section qui fournit des informations sur les manettes et les commandes d’entraînement lorsqu’il est utilisé avec l'infrastructure logicielle LabVIEW et une section qui affiche l’état des NetworkTables et le sélecteur des modes autonomes :

source: Displays X,Y and Throttle information and button values for up to 2 joysticks when using the LabVIEW framework
fr_ca: Affiche des informations sur les axes X, Y et le Throttle et des valeurs de bouton pour jusqu’à 2 joysticks lors de l’utilisation de l'infrastructure logicielle LabVIEW

source: Displays values being sent to motor controllers when using LabVIEW framework
fr_ca: Affiche les valeurs envoyées aux contrôleurs de moteurs lors de l’utilisation de l'infrastructure logicielle LabVIEW

source: Displays a connection indicator for the NetworkTables data from the robot
fr_ca: Affiche un indicateur de connexion pour les données NetworkTables du robot

source: Displays a Gyro value
fr_ca: Affiche une valeur du Gyro

source: Displays a text box that can be used to select Autonomous modes. Each language's code templates have examples of using this box to select from multiple autonomous programs.
fr_ca: Affiche une boîte de texte qui peut être utilisée pour sélectionner les modes autonomes. Les modèles de code de chaque langage ont des exemples d’utilisation de cette boîte pour faire une sélection parmi plusieurs programmes autonomes.

source: These indicators (other than the Gyro) are hooked up to appropriate values by default when using the LabVIEW framework. For information on using them with C++/Java code see :doc:`using-the-labview-dashboard-with-c++-java-code`.
fr_ca: Ces indicateurs (autres que le Gyro) sont raccordés aux valeurs appropriées par défaut lors de l’utilisation de l'infrastructure logicielle LabVIEW. Pour plus d’informations sur leur utilisation avec le code C++/Java, consulter :doc:`using-the-labview-dashboard-with-c++-java-code`.

source: The left pane can only display a single camera output, so use the camera tab on the right pane to display a second camera output if needed.
fr_ca: Le volet gauche ne peut afficher qu’une seule sortie de caméra, donc pour afficher une deuxième sortie de caméra si nécessaire, utilisez l’onglet caméra sur le volet droit.

source: The "Camera" tab is the second on the right side.
fr_ca: L’onglet "Camera" est le second sur le côté droit.

source: The camera tab is used to display a video feed from a camera located on the robot. There are also some controls and indicators related to the camera below the tab area:
fr_ca: L'onglet caméra est utilisé pour afficher un flux vidéo d'une caméra située sur le robot. Il existe également des commandes et des indicateurs liés à la caméra sous la zone des onglets :

source: The "Basic" tab is the third on the right side.
fr_ca: L’onglet "Basic" est le troisième sur le côté droit.

source: The Basic tab contains a variety of pre-populated bi-directional controls/indicators which can be used to control the robot or display information from the robot. The SmartDashboard key names associated with each item are labeled next to the indicator with the exception of the Strings which follow the same naming pattern and increment from DB/String 0 to DB/String 4 on the left and DB/String 5 to DB/String 9 on the right. The LabVIEW framework contains an example of reading from the Buttons and Sliders in Teleop. It also contains an example of customizing the labels in Begin. For more detail on using this tab with C++\Java code, see :doc:`using-the-labview-dashboard-with-c++-java-code`.
fr_ca: L’onglet Basic contient une variété de commandes/indicateurs bi-directionnels déjà remplis qui peuvent être utilisés pour contrôler le robot ou afficher les informations en provenance robot. Les noms des clés SmartDashboard associés à chaque élément sont étiquetés à côté de l’indicateur à l’exception des chaînes de caractères qui suivent le même modèle de nommage et l’incrément de DB/String 0 à DB/String 4 à gauche et DB/String 5 à DB/String 9 à droite. L'infrastructure logicielle LabVIEW contient un exemple de lecture des boutons et curseurs en mode Teleop. Il contient également un exemple de personnalisation des étiquettes dans Begin. Pour plus de détails sur l’utilisation de cet onglet avec le code C++Java, voir :doc:`using-the-labview-dashboard-with-c++-java-code`.

source: The "Custom" tab is the fourth on the right side.
fr_ca: L’onglet "Custom" est le quatrième sur le côté droit.

source: The Custom tab allows you to add additional controls/indicators to the dashboard using LabVIEW without removing any existing functionality. To customize this tab you will need to create a Dashboard project in LabVIEW.
fr_ca: L’onglet Custom vous permet d’ajouter des contrôles/indicateurs supplémentaires au dashboard à l’aide de LabVIEW sans supprimer les fonctionnalités existantes. Pour personnaliser cet onglet, vous devrez créer un projet Dashboard dans LabVIEW.

source: The "Test" tab is the fifth on the right side.
fr_ca: L’onglet "Test" est le cinquième sur le côté droit.

source: The Test tab is for use with Test mode for teams using LabVIEW (Java and C++ teams should use SmartDashboard or Shuffleboard when using Test Mode). For many items in the libraries, Input/Output info will be populated here automatically. All items which have ** next to them are outputs that can be controlled by the dashboard. To control an output, click on it to select it, drag the slider to set the value then press and hold the green button to enable the output. As soon as the green button is released, the output will be disabled. This tab can also be used to run and monitor tests on the robot. An example test is provided in the LabVIEW framework. Selecting this test from the dropdown box will show the status of the test in place of the slider and enable controls.
fr_ca: L’onglet Test est utilisé en mode Test pour les équipes utilisant LabVIEW (les équipes Java et C++ doivent utiliser SmartDashboard ou Shuffleboard lors de l’utilisation du mode Test). Pour de nombreux éléments dans les bibliothèques logicielles, les informations d’entrée/sortie seront remplies ici automatiquement. Tous les éléments qui ont ** à côté d’eux sont des sorties qui peuvent être contrôlées par le dashboard. Pour contrôler une sortie, cliquez dessus pour la sélectionner, faites glisser le curseur pour définir la valeur puis appuyez et maintenez le bouton vert pour activer la sortie. Dès que le bouton vert est libéré, la sortie sera désactivée. Cet onglet peut également être utilisé pour exécuter et surveiller les tests sur le robot. Un test d’exemple est fourni dans l"infrastructure logicielle LabVIEW. La sélection de ce test à partir de la liste déroulante affichera l’état du test à la place du curseur et activera les contrôles.

source: The "Commands" tab is the sixth on the right side.
fr_ca: L’onglet "Commands" est le sixième sur le côté droit.

source: The Commands tab can be used with the Robot in Test mode to see which commands are running and to manually run commands for test purposes.
fr_ca: L’onglet Commands peut être utilisé avec le robot en mode Test pour voir quelles commandes sont en cours d’exécution et pour exécuter manuellement les commandes à des fins de test.

source: The "Checklist" tab is the seventh on the right side.
fr_ca: L’onglet "Checklist" est le septième sur le côté droit.

source: The Checklist tab can be used by teams to create a list of tasks to perform before or between matches. Instructions for using the Checklist tab are pre-populated in the default checklist file.
fr_ca: L’onglet Checklist peut être utilisé par les équipes pour créer une liste de tâches à effectuer avant ou entre les matchs. Les instructions pour l’utilisation de l’onglet Checklist sont préalablement remplies dans le fichier de liste de contrôle par défaut.

source: The "Variables" tab is the eighth on the right side.
fr_ca: L’onglet "Variables" est le huitième sur le côté droit.

source: The Variables tab of the left pane shows all NetworkTables variables in a tree display. The Variable Name (Key), Value and data type are shown for each variable. Information about the NetworkTables bandwidth usage is also displayed in this tab. Entries will be shown with black diamonds if they are not currently synced with the robot.
fr_ca: L'onglet Variables du volet gauche affiche toutes les variables NetworkTables dans une arborescence. Le nom de la variable (clé), la valeur et le type de données sont affichés pour chaque variable. Des informations sur l'utilisation de la bande passante NetworkTables sont également affichées dans cet onglet. Les entrées seront affichées avec des losanges noirs si elles ne sont pas actuellement synchronisées avec le robot.

source: Record/Playback
fr_ca: Enregistrement/Lecture

source: Highlights the green triangle, red circle, and red square that control dashboard playback.
fr_ca: Met en surbrillance le triangle vert, le cercle rouge et le carré rouge qui contrôlent la lecture du dashboard.

source: The LabVIEW Dashboard includes a Record/Playback feature that allows you to record video and NetworkTables data (such as the state of your Dashboard indicators) and play it back later.
fr_ca: Le tableau de bord LabVIEW comprend une fonction d'enregistrement / lecture qui vous permet d'enregistrer des données vidéo et NetworkTables (telles que l'état des indicateurs de votre tableau de bord) et de les lire plus tard.

source: Recording
fr_ca: Enregistrement

source: After hitting the red circle record button the bottom bar becomes red to indicate it is recording.
fr_ca: Après avoir appuyé sur le bouton d’enregistrement se présentant sous la forme d'un cercle rouge, la barre inférieure devient rouge pour indiquer qu’il enregistre.

source: To begin recording, click the red circular Record button. The background of the right pane will turn red to indicate you are recording. To stop recording, press the red square Stop button.
fr_ca: Pour commencer l’enregistrement, cliquez sur le bouton Record de forme circulaire et de couleur rouge. L’arrière-plan du panneau droit deviendra rouge pour indiquer que vous enregistrez. Pour arrêter l’enregistrement, appuyez sur le bouton Stop de forme carrée et de couleur rouge.

source: Playback
fr_ca: Lecture

source: The green triangle will start playback which turns the bottom bar green.
fr_ca: Le triangle vert va commencer la lecture ce qui rend la barre inférieure verte.

source: To play a recording back, click the green triangle Play button. The background of the right pane will begin pulsing green and playback controls will appear at the bottom of the camera pane.
fr_ca: Pour lire un enregistrement, cliquez sur le bouton de lecture qui se présente sous la forme d'un triangle vert. L’arrière-plan du panneau droit commencera à clignoter en vert et les contrôles de lecture apparaîtront au bas du panneau de la caméra.

source: File Selector - The dropdown allows you to select a log file to play back. The log files are named using the date and time and the dropdown will also indicate the length of the file. Selecting a logfile will immediately begin playing that file.
fr_ca: Sélecteur de fichiers - Le menu déroulant vous permet de sélectionner un fichier journal à lire. Les fichiers journaux sont nommés en utilisant la date et l’heure et le menu déroulant indiquera également la longueur du fichier. À la sélection d’un fichier journal, celui-ci commencera immédiatement à jouer.

source: Play/Pause button - This button allows you to pause and resume playback of the log file.
fr_ca: Bouton Lecture/Pause - Ce bouton vous permet de mettre en pause et de reprendre la lecture du fichier journal.

source: Playback Speed - This dropdown allows you to adjust playback speed from 1/10 speed to 10x speed, the default is real-time (1x)
fr_ca: Vitesse de lecture - Ce menu déroulant vous permet d’ajuster la vitesse de lecture de 1/10 de la vitesse à 10x la vitesse, la valeur par défaut correspond à la lecture en temps réel (1x)

source: Time Control Slider - This slider allows you to fast-forward or rewind through the logfile by clicking on the desired location or dragging the slider.
fr_ca: Curseur de contrôle du temps - Ce curseur vous permet d’avancer rapidement ou de reculer à travers le fichier journal en cliquant sur un emplacement désiré ou en faisant glisser le curseur.

source: Settings - With a log file selected, this dropdown allows you to rename or delete a file or open the folder containing the logs in Windows Explorer (Typically ``C:\Users\Public\Documents\FRC\Log Files\Dashboard``)
fr_ca: Paramètres - Avec un fichier journal sélectionné, ce menu déroulant vous permet de renommer ou de supprimer un fichier ou d’ouvrir le dossier contenant les journaux dans Windows Explorer (Typiquement ``C:\Users\Public\Documents\FRC\Log Files\Dashboard``)
