Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/labview-dashboard/troubleshooting-dashboard-connectivity.po
Languages: es_mx, fr_ca, tr_tr

source: Troubleshooting Dashboard Connectivity
es_mx: Solución de problemas de conexión de la Dashboard
fr_ca: Dépannage de la connectivité du Dashboard
tr_tr: Kontrol Paneli Bağlanabilirliğinde Sorun Giderme

source: We have received a number of reports of Dashboard connectivity issues from events. This document will help explain how to recognize if the Dashboard is not connected to your robot, steps to troubleshoot this condition and a code modification you can make.
es_mx: Hemos recibido una serie de informes de problemas de conexión de la Dashboard. Este documento ayudará a explicar cómo reconocer si la Dashboard no está conectada a su robot, pasos para solucionar esta condición y una modificación de código que puede realizar.
fr_ca: Nous avons reçu un certain nombre de rapports sur les problèmes de connectivité du Dashboard pendant les événements. Ce document vous aidera à expliquer comment reconnaître si le Dashboard n’est pas connecté à votre robot, les étapes pour dépanner cette condition et une modification de code que vous pouvez faire.
tr_tr: Etkinliklerden Gösterge Tablosu bağlantı sorunlarıyla ilgili bir dizi rapor aldık. Bu belge, Gösterge Panosunun robotunuza bağlı olup olmadığını nasıl anlayacağınızı, bu durumu gidermek için adımları ve yapabileceğiniz bir kod değişikliğini açıklamaya yardımcı olacaktır.

source: LabVIEW Dashboard
es_mx: Dashboard de LabVIEW
fr_ca: Dashboard LabVIEW
tr_tr: LabVIEW Kontrol Paneli

source: This section discusses connectivity between the robot and LabVIEW dashboard
es_mx: Esta sección discute sobre la conexión entre el robot y la Dashboard de LabVIEW.
fr_ca: Cette section traite de la connectivité entre le robot et le Dashboard LabVIEW
tr_tr: Bu bölümde robot ve LabVIEW panosu arasındaki bağlantı anlatılmaktadır.

source: Recognizing LabVIEW Dashboard Connectivity
es_mx: Reconociendo la conexión de la Dashboard de LabVIEW
fr_ca: Détection de la connectivité du Dashboard LabVIEW
tr_tr: LabVIEW Dashboard Bağlantısını Tanıma

source: If you have an indicator on your dashboard that you expect to be changing it may be fairly trivial to recognize if the Dashboard is connected. If not, there is a way to check without making any changes to your robot code. On the Variables tab of the Dashboard, the variables are shown with a black diamond when they are not synced with the robot. Once the Dashboard connects to the robot and these variables are synced, the diamond will disappear.
es_mx: Si tiene un indicador en su dashboard que espera cambiar, puede ser bastante trivial para reconocer si la dashboard está conectado. Si no, hay una manera de comprobar sin realizar cualquier cambio en el código del robot. En la pestaña Variables de la dashboard, las variables se muestran con un diamante negro cuando no están sincronizados con el robot. Una vez que la dashboard se conecta al robot y estas variables se sincronizan, el diamante desaparecerá.
fr_ca: Si vous avez un indicateur sur votre Dashboard que vous prévoyez de modifier, il peut être assez trivial de vérifier si le Dashboard est connecté. Si ce n’est pas le cas, il existe un moyen de vérifier sans apporter de modifications à votre code robot. Sur l’onglet Variables du Dashboard, les variables sont affichées avec un diamant noir lorsqu’elles ne sont pas synchronisées avec le robot. Une fois que Dashboard se connecte au robot et que ces variables sont synchronisées, le diamant disparaîtra.
tr_tr: Kontrol panelinizde değişmeyi beklediğiniz bir gösterge varsa, Kontrol Panelinin bağlı olup olmadığını anlamak oldukça önemsiz olabilir. Değilse, robot kodunuzda herhangi bir değişiklik yapmadan kontrol etmenin bir yolu vardır. Gösterge Panosunun Değişkenler sekmesinde, değişkenler robotla senkronize olmadıklarında siyah baklava ile gösterilir. Gösterge Tablosu robota bağlandığında ve bu değişkenler senkronize edildiğinde elmas kaybolur.

source: Troubleshooting LabVIEW Dashboard Connectivity
es_mx: Solucionar problemas de conexión de la Dashboard de LabVIEW
fr_ca: Dépannage de la connectivité du Dashboard LabVIEW
tr_tr: LabVIEW Dashboard Bağlantısıyla İlgili Sorunları Giderme

source: If the Dashboard does not connect to the Robot (after the Driver Station has connected to the robot) the recommended troubleshooting steps are:
es_mx: Si la Dashboard no se conecta al robot (después de que la Driver Station se haya conectado al robot) los pasos recomendados para resolver este problema son:
fr_ca: Si le Dashboard ne se connecte pas au robot (après que la Driver Station se soit connectée au robot), les étapes de dépannage recommandées sont les suivantes :
tr_tr: Dashboard Robota bağlanmazsa (Driver Station robota bağlandıktan sonra) önerilen sorun giderme adımları şunlardır:

source: Close the Driver Station and Dashboard, then re-open the Driver Station (which should launch the Dashboard).
es_mx: Cierre la Driver Station y la Dashboard, luego vuelva a abrir la Driver Station (que debe iniciar la Dashboard).
fr_ca: Fermez l'application Driver Station et le Dashboard, puis redémarrez l'application Driver Station (qui devrait lancer le Dashboard).
tr_tr: Driver Station ve Dashboard'u kapatın, ardından Driver Station'ı yeniden açın (Dashboard'u başlatması gerekir).

source: If that doesn't work, restart the Robot Code using the Restart Robot Code button on the Diagnostics tab of the Driver Station
es_mx: Si eso no funciona, reinicie el código del robot con el botón Restart Robot Code en la pestaña de Diagnosticos de la Driver Station.
fr_ca: Si cela ne fonctionne pas, redémarrez le code robot à l’aide du bouton Restart Robot Code sur l’onglet Diagnostics de l'application Driver Station
tr_tr: Bu işe yaramazsa, Driver Station'ın Diagnostics sekmesindeki Robot Kodunu Yeniden Başlat düğmesini kullanarak Robot Kodunu yeniden başlatın.

source: Recognizing Connectivity
es_mx: Reconociendo la conectividad
fr_ca: Détecter la connectivité
tr_tr: Bağlantıyı Tanıma

source: This section discusses connectivity between the robot and SmartDashboard
es_mx: Esta sección trata de la conectividad entre el robot y el SmartDashboard
fr_ca: Cette section traite de la connectivité entre le robot et le SmartDashboard
tr_tr: Bu bölümde robot ve SmartDashboard arasındaki bağlantı anlatılmaktadır.

source: Recognizing SmartDashboard Connectivity
es_mx: Identificar la conexión de la SmartDashboard
fr_ca: Détecter la connectivité du SmartDashboard
tr_tr: SmartDashboard Bağlantısını Tanıma

source: The typical way to recognize connectivity with the SmartDashboard is to add a Connection Indicator widget and to make sure your code is writing at least one key during initialization or disabled to trigger the connection indicator. The connection indicator can be moved or re-sized if the Editable checkbox is checked.
es_mx: La forma típica de reconocer la conectividad con el SmartDashboard es añadir un widget de indicador de conexión y asegurarse de que su código está escribiendo al menos una tecla durante la inicialización o desactivación para activar el indicador de conexión. El indicador de conexión puede ser movido o redimensionado si la casilla Editable está marcada.
fr_ca: La façon typique de reconnaître la connectivité avec le SmartDashboard Java est d’ajouter un widget indicateur de connexion et de s’assurer que votre code écrit au moins une clé lors de l’initialisation ou désactiver pour déclencher l’indicateur de connexion. L’indicateur de connexion peut être déplacé ou re-dimensionné si la case à cocher modifiable est cochée.
tr_tr: SmartDashboard ile bağlantıyı tanımanın tipik yolu, bir Bağlantı Göstergesi widget'ı eklemek ve kodunuzun başlatma sırasında en az bir anahtar yazdığından veya bağlantı göstergesini tetiklemek için devre dışı bırakıldığından emin olmaktır. Düzenlenebilir onay kutusu işaretliyse bağlantı göstergesi taşınabilir veya yeniden boyutlandırılabilir.

source: Recognizing Shuffleboard Connectivity
es_mx: Identificar la conectividad de Shuffleboard
fr_ca: Détecter la connectivité de Shuffleboard
tr_tr: Shuffleboard Bağlantısını Tanıma

source: Shuffleboard indicates if it is connected or not in the bottom right corner of the application as shown in the image above.
es_mx: El shuffleboard indica si está conectado o no en la esquina inferior derecha de la aplicación, como se muestra en la imagen anterior.
fr_ca: Shuffleboard indique s’il est connecté ou non dans le coin inférieur droit de l’application comme illustré dans l’image ci-dessus.
tr_tr: Shuffleboard, yukarıdaki resimde gösterildiği gibi uygulamanın sağ alt köşesine bağlı olup olmadığını gösterir.

source: Recognizing Glass Connectivity
es_mx: Identificar la conectividad de Glass
fr_ca: Détecter la connectivité de Glass
tr_tr: Glass Bağlantısını Tanıma

source: Glass displays if it is connected or not in the bar across the top. See this :ref:`page <docs/software/dashboards/glass/networktables-connection:Establishing NetworkTables Connections>` for more on configuring the connection.
fr_ca: Glass affiche s'il est connecté ou non dans la barre en haut. Voir cette :ref:`page <docs/software/dashboards/glass/networktables-connection:Establishing NetworkTables Connections>` pour en savoir plus sur la configuration de la connexion.

source: Troubleshooting Connectivity
es_mx: Solución de problemas de conectividad
fr_ca: Résolution des problèmes liés à la connectivité
tr_tr: Bağlantı Sorunlarını Giderme

source: Restart the Dashboard (there is no need to restart the Driver Station software)
es_mx: Reinicie el dashboard (no es necesario reiniciar el software de la driver station)
fr_ca: Redémarrez le SmartDashboard (il n’est pas nécessaire de redémarrer l’application Driver Station)
tr_tr: Kontrol Panelini yeniden başlatın (Driver Station yazılımını yeniden başlatmaya gerek yoktur)

source: If it still doesn't connect, verify that the Team Number / Server is set properly in the Dashboard and that your Robot Code writes a value during initialization or disabled
es_mx: Si sigue sin conectarse, compruebe que el número de equipo/servidor está configurado correctamente en el dashboard y que su Código Robot escriba un valor durante la inicialización o deshabilite.
fr_ca: S’il ne se connecte toujours pas, vérifiez que le numéro d’équipe / Serveur est défini correctement dans Dashboard et que votre code robot écrit une valeur au Dashboard pendant l’initialisation ou est désactivé
tr_tr: Hala bağlanmazsa, Takım Numarasının / Sunucunun Gösterge Panosunda doğru şekilde ayarlandığını ve Robot Kodunuzun başlatma sırasında veya devre dışı bırakıldığında bir değer yazdığını doğrulayın.
