Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/labview-dashboard/using-the-labview-dashboard-with-c++-java-code.po
Languages: tr_tr

source: Using the LabVIEW Dashboard with C++, Java, or Python Code
tr_tr: LabVIEW Gösterge Panelinin C++, Java veya Python Kodları ile Kullanımı

source: The default LabVIEW Dashboard utilizes :term:`NetworkTables` to pass values and is therefore compatible with C++, Java, and Python robot programs. This article covers the keys and value ranges to use to work with the Dashboard.
tr_tr: LabVIEW Gösterge Paneli, varsayılan olarak, değer iletimi için :term:`NetworkTables` kullanmaktadır ve bu sebeple C++, Java ve Python robot programları ile uyumludur. Bu yazı, Gösterge Panelinin kullanımındaki anahtarlar ve değer aralıklarını kapsayacaktır.

source: Drive Tab
tr_tr: Drive Sekmesi

source: The :guilabel:`Select Autonomous...` dropdown can be used so show the available autonomous routines and choose one to run for the match.
tr_tr: :guilabel:`Select Autonomous...` açılır listesi kullanılabilmektedir, bu yüzden mevcut otonom rutinleri görüntüleyiniz ve maçta çalıştırmak için birini seçiniz.

source: Sending to the "Gyro" NetworkTables entry will populate the gyro here.
tr_tr: "Gyro" NetworkTables girişine iletim burayı dolduracaktır.

source: There are four outputs that show the motor power to the drivetrain. This is configured for 2 motors per side and a tank style drivetrain. This is done by setting "RobotDrive Motors" like the example below.
tr_tr: Motor gücünü aktarma sistemine gösteren dört çıkış vardır. Bu, her tarafta 2 motor ve bir tank tarzı aktarma sistemi için yapılandırılmıştır. Bu yapılandırma aşağıdaki örnekte olduğu gibi "RobotDrive Motorları" ayarlanarak yapılmaktadır.

source: Basic Tab
tr_tr: Temel Sekme

source: The Basic tab uses a number of keys in the a "DB" sub-table to send/receive Dashboard data. The LED's are output only, the other fields are all bi-directional (send or receive).
tr_tr: Temel sekme, Gösterge Paneli verilerini göndermek/almak için "DB" alt tablosunda bulunan bir dizi anahtarı kullanmaktadır. LED'ler yalnızca çıktı içindir, diğer alanların tümüyse çift yönlüdür (gönderme veya alma).

source: Strings
tr_tr: Stringler

source: The strings are labeled top-to-bottom, left-to-right from "DB/String 0" to "DB/String 9". Each String field can display at least 21 characters (exact number depends on what characters). To write to these strings:
tr_tr: Dizeler, "DB/String 0"dan "DB/String 9"a, soldan sağa, yukarıdan aşağıya etiketlenmektedir. Her String alanı en az 21 karakter görüntüleyebilmektedir (kesin bir sayı kullanılan karakterlere bağlıdır). Bu stringleri yazmak için:

source: To read string data entered on the Dashboard:
tr_tr: Gösterge Paneline girilen string verilerini okumak için:

source: Buttons and LEDs
tr_tr: Düğmeler ve LED'ler

source: The Buttons and LEDs are boolean values and are labeled top-to-bottom from "DB/Button 0" to "DB/Button 3" and "DB/LED 0" to "DB/LED 3". The Buttons are bi-directional, the LEDs are only able to be written from the Robot and read on the Dashboard. To write to the Buttons or LEDs:
tr_tr: Düğmeler ve LED'ler Boole değerlerdir ve yukarıdan aşağıya "DB/Düğme 0" ila "DB/Düğme 3" ve "DB/LED 0" ila "DB/LED 3" olacak şekilde etiketlenmişlerdir. Düğmeler çift yönlüdür, LED'ler yalnızca Robottan yazılabilmekte ve Gösterge Panelinden okunabilmektedir. Düğmelere veya LED'lere yazmak için:

source: To read from the Buttons: (default value is false)
tr_tr: Düğmelerden okumak için: (varsayılan değer yanlıştır)

source: Sliders
tr_tr: Sliders - Kaydırıcılar

source: The Sliders are bi-directional analog (double) controls/indicators with a range from 0 to 5. To write to these indicators:
tr_tr: Kaydırıcılar, 0 ila 5 aralığında iki yönlü analog (ikili) ayar/göstergedir. Bu göstergelere yazmak için:

source: To read values from the Dashboard into the robot program: (default value of 0.0)
tr_tr: Gösterge Panelindeki değerleri robot programına okumak için: (varsayılan değer 0,0)
