Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/yearly-overview/2020-Game-Data.po
Languages: es_mx, tr_tr, zh_cn

source: 2020 Game Data Details
es_mx: Detalles de Datos del Juego 2020
tr_tr: 2020 Oyun Veri Detayları
zh_cn: 2020 赛季 Game Data (赛场信息包) 相关细节

source: In the 2020 *FIRST*\ |reg| Robotics Competition game, the Position Control objective requires alliances to select a specific color transmitted to them when specific pre-requisites have been met. The field will transmit the selected color to teams using Game Data. This page details the timing and structure of the sent data and provides examples of how to access it in the three supported programming languages.
es_mx: En el juego de 2020 *FIRST*\ |reg| Robotics Competition, el objetivo de Control de Posición requiere alianzas para seleccionar un color específico transmitido a ellos cuando se han conocido los pre-requisitos específicos. El campo transmitirá el color seleccionado a los equipos que utilicen Datos del Juego. Esta página detalla el tiempo y la estructura de los datos enviados y proporciona ejemplos de cómo acceder a ellos en los tres lenguajes de programación admitidos.
tr_tr: 2020 *FIRST*\ |reg| Robotik Yarışması oyunu, Konum Kontrolü hedefi ittifakların belirli ön koşullar karşılandığında kendilerine iletilen belirli bir rengi seçmelerini gerektirir. Alan, seçilen rengi Oyun Verilerini kullanarak takımlara iletecektir. Bu sayfa, gönderilen verilerin zamanlaması ve yapısını ayrıntılarıyla anlatır ve desteklenen üç programlama dilinde bunlara nasıl erişileceğine dair örnekler sunar.
zh_cn: 2020年*FIRST*\ |reg| 机器人竞赛，位置控制目标要求团队在满足特定先决条件时选择一种特定的颜色传输给他们。场地将使用游戏数据将选定的颜色传输给团队。本页详细说明了发送数据的时间和结构，并提供了用三种受支持的编程语言访问这些数据的方法示例。

source: The Data
es_mx: Los Datos
tr_tr: Veri
zh_cn: 2020赛季赛场信息包

source: Timing
es_mx: Sincronización
tr_tr: Zamanlama
zh_cn: 发送时间

source: Color assignment data is sent to both alliances simultaneously once the first alliance in a match has reached Capacity on Stage 3 of the Shield Generator (see the Game Manual for more complete details). Between the beginning of the match and this point, the Game Data will be an empty string.
es_mx: Los datos de asignación de color se envían a ambas alianzas simultáneamente una vez que la primera alianza en una partida ha alcanzado la Capacidad en la Etapa 3 del Generador de Escudos (consulte el Manual del Juego para obtener más detalles). Entre el comienzo del partido y este punto, los Datos del Juego serán una cadena vacía.
tr_tr: Bir maçtaki ilk ittifak, Kalkan Generator'ın 3. Aşamasında Kapasiteye ulaştığında, renk ataması verileri her iki ittifaka aynı anda gönderilir (daha ayrıntılı bilgi için Oyun Kılavuzuna bakın). Maçın başlangıcı ile bu nokta arasında Oyun Verileri boş bir dizi olacaktır.
zh_cn: 当一场比赛中的第一个团队在Shield Generator的第3阶段达到容量时，颜色分配数据会同时发送给两个团队（更多完整的细节请参阅比赛手册）。在比赛开始到这一刻，比赛数据将是一个空字符串。

source: Data format
es_mx: Formato de Datos
tr_tr: Veri formatı
zh_cn: 信息格式

source: The selected color for an alliance will be provided as a single character representing the color (i.e. 'R' = red, 'G' = green, 'B' = blue, 'Y' = yellow). This color indicates the color that must be placed underneath the Control Panel's color sensor in order to complete the Position Control objective (see the Game Manual for information about the location of the Control Panel sensor).
es_mx: El color seleccionado para una alianza se proporcionará como un solo carácter que representa el color (ej. 'R' = rojo, 'G' = verde, 'B' = azul, 'Y' = amarillo). Este color indica el color que debe colocarse debajo del sensor de color del Panel de Control para completar el objetivo de Control de Posición (consulte el Manual del Juego para obtener información sobre la ubicación del sensor del Panel de Control).
tr_tr: Bir ittifak için seçilen renk, rengi temsil eden tek bir karakter olarak sağlanacaktır (yani 'R' = kırmızı, 'G' = yeşil, 'B' = mavi, 'Y' = sarı). Bu renk, Konum Kontrolü hedefini tamamlamak için Kontrol Panelinin renk sensörünün altına yerleştirilmesi gereken rengi belirtir (Kontrol Paneli sensörünün konumu hakkında bilgi için Oyun Kılavuzuna bakın).
zh_cn: 为团队选择的颜色将以代表颜色的单个字符提供（即“R”=红色，“G”=绿色，“B”=蓝色，“Y”=黄色）。此颜色表示必须置于控制面板颜色传感器下方的颜色，只有这样才能完成位置控制目标（有关控制面板传感器位置的信息，请参阅游戏手册）。

source: Accessing the Data
es_mx: Acceso a los Datos
tr_tr: Verilere Erişim
zh_cn: 访问数据

source: The data is accessed using the Game Data methods or VIs in each language. Below are descriptions and examples of how to access the data from each of the three languages. As the data is provided to the Robot during the Teleop period, teams will likely want to query the data in Teleop periodic code, or trigger reading it off a button press or other action after they have reached Stage 3 capacity.
es_mx: Se accede a los datos utilizando los métodos de Datos del Juego o VIs en cada idioma. A continuación, se muestran descripciones y ejemplos de cómo acceder a los datos de cada uno de los tres idiomas. Dado que los datos se proporcionan al Robot durante el período de Teleoperado, los equipos probablemente deseen consultar los datos en el código periódico de Teleoperado, o activar la lectura al presionar un botón u otra acción después de haber alcanzado la capacidad de la Etapa 3.
tr_tr: Verilere, Oyun Verileri yöntemleri veya her dilde VI'lar kullanılarak erişilir. Aşağıda, üç dilin her birindeki verilere nasıl erişileceğine ilişkin açıklamalar ve örnekler bulunmaktadır. Veriler, Teleop döneminde Robota sağlandıkça, ekipler büyük olasılıkla verileri Teleop periyodik kodunda sorgulamak veya Aşama 3 kapasitesine ulaştıktan sonra bir düğmeye basma veya başka bir işlemle okumayı tetiklemek isteyeceklerdir.
zh_cn: 数据可以被访问通过the Game Data方法或VIs在各种语言中。下面是如何从这三种语言中访问数据的描述和示例。由于数据是在遥控操作期间提供给机器人的，团队可能希望以遥控操作周期代码的形式查询数据，或者在达到第3阶段容量后触发按钮或其他操作读取。

source: In C++ and Java the Game Data is accessed by using the GetGameSpecificMessage method of the DriverStation class. Teams likely want to query the data in a Teleop method such as Teleop Periodic in order to receive the data after it is sent during the match. Make sure to handle the case where the data is an empty string as this is what the data will be until the criteria are reached to enable Position Control for either alliance.
es_mx: En C++ y Java, se accede a los Datos del Juego mediante el método GetGameSpecificMessage de la clase DriverStation. Es probable que los equipos quieran consultar los datos en un método Teleop como Teleop Periodic para recibir los datos después de que se envíen durante el partido. Asegúrese de manejar el caso en el que los datos sean una cadena vacía, ya que estos serán los datos hasta que se alcancen los criterios para habilitar el Control de Posición para cualquiera de las alianzas.
tr_tr: C ++ ve Java'da Oyun Verilerine, DriverStation sınıfının GetGameSpecificMessage yöntemi kullanılarak erişilir. Takımlar, maç sırasında gönderildikten sonra verileri almak için muhtemelen Teleop Periyodik gibi bir Teleop yönteminde verileri sorgulamak isteyecektir. Her iki ittifak için de Pozisyon Kontrolünü etkinleştirmek için kriterlere ulaşılana kadar verilerin boş bir dizge olduğu durumu hallettiğinizden emin olun.
zh_cn: 在C++和Java中，比赛数据是通过DriverStation类的GetGameSpecificMessage方法访问的。团队可能希望用Teleop方法，如Teleop Periodic，查询数据，以便在比赛期间发送数据后能接收数据。确保处理为空字符串的数据，因为在达到为任一团队启用位置控制的条件之前，这些数据都是空字符串。

source: The Game Data in LabVIEW is accessed from the Game Specific Data VI. This VI can be found in the WPI Robotics Library -> Driver Station palette.
es_mx: Los Datos del Juego en LabVIEW se acceden desde los Datos de Juego Específicos VI. Este VI puede ser encontrado en la Librería de WPI Robotics -> paleta de la Driver Station.
tr_tr: LabVIEW'deki Oyun Verilerine Oyuna Özgü Veriler VI'dan erişilir. Bu VI, WPI Robotics Library -> Driver Station paletinde bulunabilir.
zh_cn: LabVIEW中的比赛数据是从比赛专用数据VI访问的。这个VI可以在WPI Robotics Library -> Driver Station palette中找到。

source: LabVIEW teams will likely want to query the data in the Teleop or PeriodicTasks VIs and may choose to gate the query behind a button press or other action. The code below reads the data and then uses a case structure to react differently to each of the 5 possible cases (empty, or any of the 4 letters).
es_mx: Los equipos con LabVIEW probablemente querrán consultar los datos en los VIs de Teleop o PeriodicTasks y pueden optar por cerrar la consulta detrás de presionar un botón u otra acción. El siguiente código lee los datos y luego usa una estructura de caso para reaccionar de manera diferente a cada uno de los 5 casos posibles (vacío o cualquiera de las 4 letras).
tr_tr: LabVIEW ekipleri büyük olasılıkla Teleop veya PeriodicTasks VI'lardaki verileri sorgulamak isteyecek ve sorguyu bir düğmeye basma veya başka bir eylemin arkasına yerleştirmeyi seçebilir. Aşağıdaki kod, verileri okur ve ardından olası 5 vakanın her birine (boş veya 4 harften herhangi birine) farklı tepki vermek için bir vaka yapısı kullanır.
zh_cn: LabVIEW团队可能希望在Teleop或PeriodicTasks VIs中查询数据，并可能选择在按下按钮或其他操作之后进行查询。下面的代码读取数据然后使用case结构对5个可能的情况（空的，或4个字母中的任何一个）做出不同的反应。

source: Making a decision what to do about the game data received using a case structure.
zh_cn: 使用案例结构决定如何处理收到的游戏数据。

source: Testing Game Specific Data
es_mx: Probando los Datos de Juego Específicos
tr_tr: Oyuna Özgü Verilerin Test Edilmesi
zh_cn: 测试赛场信息

source: You can test your Game Specific Data code without FMS by using the Driver Station. Click on the Setup tab of the Driver Station, then enter the desired test string into the Game Data text field. The data will be transmitted to the robot in one of two conditions: Enable the robot in Teleop mode, or when the DS reaches the End Game time in a Practice Match (times are configurable on the Setup tab). It is recommended to run at least one match using the Practice functionality to verify that your code works correctly in a full match flow.
es_mx: Puede probar el código de Datos del Juego Específicos sin FMS mediante la Driver Station. Haga clic en la pestaña Configuración de la Driver Station, luego ingrese la cadena de prueba deseada en el campo de texto de los Datos del Juego. Los datos se transmitirán al robot en una de estas dos condiciones: Habilite el robot en el modo Teleop, o cuando el DS llegue al tiempo de Fin del Juego en un Partido de Práctica (los tiempos se pueden configurar en la pestaña Configuración). Se recomienda ejecutar al menos un partido utilizando la funcionalidad de Práctica para verificar que su código funcione correctamente en un flujo de partido completo.
tr_tr: Driver Station'ı kullanarak Oyuna Özel Veri kodunuzu FMS olmadan test edebilirsiniz. Driver Station'ın Kurulum sekmesine tıklayın, ardından istediğiniz test dizisini Oyun Verileri metin alanına girin. Veriler robota şu iki koşuldan birinde aktarılacaktır: Robotu Teleop modunda etkinleştirin veya DS bir Alıştırma Maçında Oyun Sonu zamanına ulaştığında (zamanlar Kurulum sekmesinden yapılandırılabilir). Kodunuzun tam bir maç akışında doğru şekilde çalıştığını doğrulamak için Pratik işlevini kullanarak en az bir maç çalıştırmanız önerilir.
zh_cn: 你可以在没有FMS的情况下，使用Driver Station测试比赛特定的数据代码。单击Driver Station的设置选项卡，然后在比赛数据文本字段中输入所需的测试字符串。数据将在以下两种情况之一传输给机器人：在遥控操作模式下启用机器人，或当DS在练习赛中到达比赛结束时间时（时间可在“设置”选项卡上配置）。建议使用“实践”功能运行至少一次，以验证代码在完整比赛流程中是否能正常运行。

source: Game Data text box on the Driver Station.
zh_cn: 机器操控台上的游戏数据文本框。
