Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/yearly-overview/known-issues.po
Languages: fr_ca, he_il, tr_tr

source: Known Issues
fr_ca: Problèmes connus
he_il: בעיות ידעות
tr_tr: Bilinen Sorunlar

source: This article details known issues (and workarounds) for FRC\ |reg| Control System Software.
fr_ca: Cet article détaille les problèmes connus (et les solutions de contournement) relatifs à la partie logicielle du système de contrôle FRC\ |reg|.
tr_tr: Bu makale, FRC\ |reg| Kontrol Sistemi Yazılımı için bilinen sorunları (ve geçici çözümleri) ayrıntılarıyla anlatmaktadır.

source: Open Issues
fr_ca: Questions ouvertes
he_il: בעיות פתוחות
tr_tr: Açık sorunlar

source: Onboard I2C Causing System Lockups
fr_ca: Port I2C intégré provoquant des blocages du système

source: **Issue:** Use of the onboard I2C port, in any language, can result in system lockups. The frequency of these lockups appears to be dependent on the specific hardware (i.e. different roboRIOs will behave differently) as well as how the bus is being used.
fr_ca: **Problème :** L’utilisation du port I2C intégré, dans n’importe quelle langage de programmation, peut entraîner des blocages du système. La fréquence de ces blocages semble dépendre du matériel spécifique (c’est-à-dire que différents roboRIO se comporteront différemment) ainsi que de la façon dont le bus est utilisé.

source: **Workaround:** The only surefire mitigation is to use the MXP I2C port instead. Acessing the device less frequently and/or using a different roboRIO may significantly reduce the likelihood/frequency of lockups, it will be up to each team to assess their tolerance of the risk of lockup. This lockup can not be definitively identified on the field and a field fault will not be called for a match where this behavior is believed to occur. This lockup is a CPU/kernel hang, the roboRIO will completely stop responding and will not be accessible via the DS, webpage or SSH. If you can access your roboRIO via any of these methods, you are experiencing a different issue.
fr_ca: **Solution de contournement :** Le seul allègement sûr consiste à utiliser le port MXP I2C à la place. L’accès moins fréquent à l’appareil et/ou l’utilisation d’un roboRIO différent peut réduire considérablement la probabilité/fréquence des blocages, il appartiendra à chaque équipe d’évaluer sa tolérance au risque de blocage. Ce verrouillage ne peut pas être identifié définitivement sur le terrain et une erreur de terrain ne sera pas pénalisée pour un match où ce comportement est censé se produire. Ce verrouillage est un blocage CPU /noyau, le roboRIO cessera complètement de répondre et ne sera pas accessible via le DS, la page Web ou le SSH. Si vous arrivez à accéder à votre roboRIO via l’une de ces méthodes, vous rencontrez probablement un problème différent.

source: ADIS16448 not reading values in Java
fr_ca: ADIS16448 ne lit pas les valeurs en Java

source: **Issue:** In WPILib 2022.3.1, using the no-args constructor for the ADIS16448 IMU in Java results in an divide by zero exception in a separate thread and no IMU data updates.
fr_ca: **Problème :** Dans WPILib 2022.3.1, l'utilisation du constructeur sans argument pour l'IMU ADIS16448 dans Java entraîne une exception de division par zéro dans un thread séparé et aucune mise à jour des données de l'IMU.

source: **Workaround:** Instead of the no-args constructor, use ``new ADIS16448_IMU(ADIS16448_IMU.IMUAxis.kZ, SPI.Port.kMXP, ADIS16448_IMU.CalibrationTime._1s);``.
fr_ca: **Solution :** au lieu du constructeur sans argument, utilisez ``new ADIS16448_IMU(ADIS16448_IMU.IMUAxis.kZ, SPI.Port.kMXP, ADIS16448_IMU.CalibrationTime._1s);``.

source: CAN bus utilization is noisy
fr_ca: L'utilisation du bus CAN est bruyante

source: **Issue:** CAN bus utilization as reported live by the DS or as shown in the DS log has significant variation or "spikes" in the data. This is due to the RoboRIO occasionally counting CAN packets in the incorrect time period, so one period will have a much lower utilization than reality and the next a much higher utilization than reality.
fr_ca: **Problème :** L'utilisation du bus CAN, telle que rapportée en direct par le DS ou indiquée dans le journal DS, présente des variations importantes ou des "pics" dans les données. Cela est dû au fait que le RoboRIO compte parfois les paquets CAN dans la période incorrecte, de sorte qu'une période aura une utilisation beaucoup plus faible que la réalité et la suivante une utilisation beaucoup plus élevée que la réalité.

source: **Workaround:** Zoom in on the DS log plot and look for time periods when the utilization is stable (the spikes will be both above and below this average). The average utilization is the true utilization.
fr_ca: **Solution :** effectuez un zoom avant sur le tracé du journal DS et recherchez les périodes pendant lesquelles l'utilisation est stable (les pics seront à la fois supérieurs et inférieurs à cette moyenne). L'utilisation moyenne est l'utilisation réelle.

source: Updating Properties on roboRIO 2.0 may be slow or hang
fr_ca: La mise à jour des propriétés du roboRIO 2.0 peut être lente ou bloquée

source: **Issue:** Updating the properties on a roboRIO 2.0 without reformatting using the Imaging Tool (such as setting the team number) may be slow or hang.
fr_ca: **Problème:** La mise à jour des propriétés d’un roboRIO 2.0 sans avoir à le reformatter à l’aide de l’outilitaire Imaging Tool (par exemple, la configuration du numéro d’équipe) peut être lente ou bloquée.

source: **Workaround:** After a few minutes of the tool waiting the roboRIO should be able to be rebooted and the new properties should be set.
fr_ca: **Solution:** Après quelques minutes d’attente pendant l'exécution de l’outilitaire Imaging Tool, le roboRIO devrait pouvoir être redémarré et les nouvelles propriétés devraient être configurées.

source: Invalid build due to missing GradleRIO
fr_ca: Compilation invalide en raison de l'absence de GradleRIO

source: **Issue:** Rarely, a user's Gradle cache will get broken and they will get shown errors similar to the following:
fr_ca: **Problème:** Très rare, le cache Gradle d’un utilisateur sera brisé et ils recevront des erreurs similaires à ce qui suit:

source: **Workaround:**
fr_ca: **Solution de contournement:**
tr_tr: **Workaround-Çözüm:**

source: Delete your Gradle cache located under ``~$USER_HOME/.gradle``. Windows machines may need to enable the ability to `view hidden files <https://support.microsoft.com/en-us/windows/view-hidden-files-and-folders-in-windows-10-97fbc472-c603-9d90-91d0-1166d1d9f4b5>`__. This issue has only shown up on Windows so far. Please `report <https://github.com/wpilibsuite/frc-docs/issues/new>`__ this issue if you get it on an alternative OS.
fr_ca: Supprimez votre cache Gradle situé sous ``~$USER_HOME/.gradle``. Les machines Windows peuvent avoir besoin d'activer la possibilité de `voir les fichiers cachés <https://support.microsoft.com/en-us/windows/view-hidden-files-and-folders-in-windows-10-97fbc472-c603-9d90-91d0-1166d1d9f4b5>`__. Jusqu'à présent, ce problème n’est observé que sous Windows. S’il vous plaît `signaler <https://github.com/wpilibsuite/frc-docs/issues/new>`__ ce problème si vous l’observer sous un système d’exploitation alternatif.

source: Unable to Build Robot Projects outside of VS Code on M1-based macOS
fr_ca: Impossible de compiler des projets de robot en dehors de l'environnement VS Code sous macOS basé sur M1

source: **Issue:** Error when building a robot project in non-WPILib installations.
fr_ca: **Problème:** Erreur lors de la création d’un projet de robot pour des installations autres que WPILib.

source: **Workaround:** M1-based macOS is not supported. The above error will show up when using an ARM-based JDK. User must use a x64-compatible JDK 11 or preferably use the WPILib installer.
fr_ca: **Solution:** Le système MacOS basé sur M1 n’est pas pris en charge. L’erreur décrite plus haut apparaîtra lors de l’utilisation d’un JDK basé sur ARM. L’utilisateur doit utiliser un JDK 11 compatible x64 ou de préférence utiliser le logiciel d’installation WPILib.

source: Chinese characters in Driver Station Log
fr_ca: Caractères chinois dans le journal du poste de conduite
he_il: תווים סיניים ב-Driver Station Log
tr_tr: Sürücü İstasyonu Günlüğünde Çince karakterler

source: **Issue:** Rarely, the driver station log will show Chinese characters instead of the English text. This appears to only happen when Windows is set to a language other then English.
fr_ca: **Problème:** Rarement, le journal du poste de conduite affichera des caractères chinois au lieu du texte anglais. Cela semble se produire uniquement lorsque Windows est défini sur une langue autre que l'anglais.
he_il: **בעיה:** לעיתים נדירות, ה-Log של ה-Driver Station מציג תווים סיניים במקום הטקסט באנגלית. נראה שזה קורה רק כאשר Windows מוגדר לשפה שאינה אנגלית.
tr_tr: **Issue-Sorun: * Nadiren, sürücü istasyonu günlüğünde İngilizce metin yerine Çince karakterler görünecektir. Bu, yalnızca Windows, İngilizce dışında bir dile ayarlandığında meydana gelir.

source: Chinese character appearing in the Driver Station log window.
fr_ca: Caractère chinois apparaissant dans la fenêtre du journal de l'application Driver Station.

source: **Workaround:** There are two known workarounds:
fr_ca: **Solution de contournement:** Il existe deux solutions de contournement connues:
he_il: **עקיפת הבעיה:** ישנם 2 דרכים ידועות לעקיפת הבעיה:
tr_tr: **Çözüm:** Bilinen iki geçici çözüm vardır:

source: Copy and paste the Chinese characters into notepad, and the English text will be shown.
fr_ca: Copiez et collez les caractères chinois dans le bloc-notes, et le texte anglais sera affiché.
he_il: העתיקו והדביקו את התווים הסיניים אל Notepad, והטקסט באנגלית יוצג.
tr_tr: Çince karakterleri kopyalayıp not defterine yapıştırın, İngilizce metin görünecektir.

source: Temporarily change the Windows language to English.
fr_ca: Changez temporairement la langue de Windows en anglais.
he_il: שנו באופן זמני את את שפת ה-Windows לאנגלית.
tr_tr: Windows dilini geçici olarak İngilizce olarak değiştirin.

source: C++ Intellisense - Files Open on Launch Don't Work Properly
fr_ca: C++ Intellisense - Les fichiers ouverts au lancement ne fonctionnent pas correctement
tr_tr: C++ Intellisense - Açılışta Açılan Dosyalar Düzgün Çalışmıyor

source: **Issue:** In C++, files open when VS Code launches will have issues with Intellisense showing suggestions from all options from a compilation unit and not just the appropriate ones or not finding header files. This is a bug in VS Code.
fr_ca: **Problème:** En C++, les fichiers ouverts au lancement de VS Code auront des problèmes avec Intellisense affichant les suggestions de toutes les options d'une unité de compilation et pas seulement celles appropriées ou ne trouvant pas de fichiers d'en-tête. Il s'agit d'un bogue dans VS Code.
tr_tr: **Issue-Sorun:** C ++ 'da, VS Code başlatıldığında açılan dosyalarda Intellisense, yalnızca uygun olanları değil veya üstbilgi dosyalarını bulamama yerine bir derleme biriminden tüm seçeneklerden gelen önerileri gösteren sorunlar yaşayacaktır. Bu VS Code'daki bir hatadır.

source: Close all files in VS Code, but leave VS Code open
fr_ca: Fermez tous les fichiers dans VS Code, mais laissez VS Code ouvert
tr_tr: VS Code'daki tüm dosyaları kapatın, ancak VS Code'u açık bırakın

source: Delete c_cpp_properties.json file in the .vscode folder, if it exists
fr_ca: Supprimer le fichier c_cpp_properties.json dans le dossier .vscode, s'il existe
tr_tr: Varsa .vscode klasöründeki c_cpp_properties.json dosyasını silin

source: Run the "Refresh C++ Intellisense" command in vscode.
fr_ca: Exécutez la commande "Refresh C++ Intellisense" dans vscode.
tr_tr: Vscode'da "C ++ Intellisense Yenile" komutunu çalıştırın.

source: In the bottom right you should see something that looks like a platform (linuxathena or windowsx86-64 etc). If it’s not linuxathena click it and set it to linuxathena (release)
fr_ca: En bas à droite, vous devriez voir quelque chose qui ressemble à une plate-forme (linuxathena ou windowsx86-64, etc.). S'il ne s'agit pas de linuxathena, cliquez dessus et définissez-le sur linuxathena (version)
tr_tr: Sağ altta platforma benzeyen bir şey görmelisiniz (linuxathena veya windowsx86-64 vb.). Eğer linuxathena değilse tıklayın ve linuxathena (yayın) olarak ayarlayın

source: Wait ~1 min
fr_ca: Attendez ~ 1 min
tr_tr: ~ 1 dakika bekleyin

source: Open the main cpp file (not a header file). Intellisense should now be working
fr_ca: Ouvrez le fichier cpp principal (pas un fichier d'en-tête avec extension .h). Intellisense devrait maintenant fonctionner
tr_tr: Ana cpp dosyasını açın (bir başlık dosyası değil). Intellisense şimdi çalışıyor olmalı

source: Issues with WPILib Dashboards and Simulation on Windows N Editions
fr_ca: Problèmes avec les Dashboards WPILib et de simulation sur les éditions Windows N

source: **Issue:** WPILib code using CSCore (dashboards and simulated robot code) will have issues on Education N editions of Windows.
fr_ca: **Problème :** Le code WPILib utilisant CSCore (dashboards et code robot simulé) aura des problèmes sur les versions Education N de Windows.

source: Shuffleboard will run, but not load cameras
fr_ca: Le shuffleboard fonctionnera, mais ne chargera pas les caméras

source: Smartdashbard will crash on start-up
fr_ca: Smartdashbard va planter au démarrage

source: Robot Simulation will crash on start-up
fr_ca: La simulation de robot va planter au démarrage

source: **Solution:** Install the `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__
fr_ca: **Solution:** Installez le `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__
tr_tr: **Solution-Çözüm:** `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__ i kurun.

source: NetworkTables Interoperability
fr_ca: Interopérabilité NetworkTables
tr_tr: NetworkTables Birlikte Çalışabilirliği

source: There is currently an issue with inter-operating C++/Java :term:`NetworkTables` clients (dashboards or co-processors) with LabVIEW servers (LV robot code). In some scenarios users will see updates from one client fail to be replicated across to other clients (e.g. data from a co-processor will not be properly replicated out to a dashboard). Data still continues to return correctly when accessed by code on the server.
fr_ca: Il existe actuellement un problème d'interopérabilité C ++ / Java avec :term:`NetworkTables` (tableaux de bord ou co-processeurs) avec des serveurs LabVIEW (code robot LV). Dans certains scénarios, les utilisateurs verront les mises à jour d'un client ne pas être répliquées sur d'autres clients (par exemple, les données d'un coprocesseur ne seront pas correctement répliquées vers un tableau de bord). Les données continuent de retourner correctement lorsqu'elles sont accédées par code sur le serveur.

source: **Workaround**: Write code on the server to mirror any keys you wish to see on other clients (e.g. dashboards) to a separate key. For example, if you have a key named ``targetX`` being published by a co-processor that you want to show up on a dashboard, you could write code on the robot to read the key and re-write it to a key like ``targetXDash``.
fr_ca: **Solution de contournement**: écrivez du code sur le serveur pour refléter toutes les clés que vous souhaitez voir sur d'autres clients (par exemple, des tableaux de bord) sur une clé distincte. Par exemple, si vous avez une clé nommée ``targetX`` en cours de publication par un coprocesseur que vous souhaitez afficher sur un tableau de bord, vous pouvez écrire du code sur le robot pour lire la clé et la réécrire sur une clé comme ``targetXDash``.
tr_tr: **Workaround-Geçici Çözüm**: Diğer istemcilerde (ör. Gösterge tabloları) görmek istediğiniz anahtarları ayrı bir anahtara yansıtmak için sunucuya kod yazın. Örneğin, bir gösterge panosunda gösterilmesini istediğiniz bir yardımcı işlemci tarafından yayınlanan ``targetX`` adlı bir anahtarınız varsa, anahtarı okumak ve bir anahtara yeniden yazmak için robota kod yazabilirsiniz. ``targetXDash`` gibi.

source: LabVIEW Autorun graphics say 2020
fr_ca: Les graphiques LabVIEW Autorun disent 2020

source: LabVIEW autorun screen showing mismatched versions
fr_ca: Écran d'exécution automatique de LabVIEW affichant des versions incompatibles

source: **Issue:** If you launch the LabVIEW installer by using the Autorun file, the menu item correctly says 2022, but the graphic says 2020.
fr_ca: **Problème :** Si vous lancez le programme d'installation de LabVIEW à l'aide du fichier d'exécution automatique, l'élément de menu indique correctement 2022, mais le graphique indique 2020.

source: **Workaround:** This can be safely ignored, if the menu item says 2022, you are installing the correct software.
fr_ca: **Solution:** Ce problème peut être ignoré sans incidence particulière; si l’élément de menu indique 2022, c'est que vous installez le bon logiciel.

source: Fixed in Image 2022_v4.0 (Game Tools 2022 f1 and WPILib 2022.3.1)
fr_ca: Corrigé dans Image 2022_v4.0 (Game Tools 2022 f1 et WPILib 2022.3.1)

source: Analog Devices Gyros don't work properly
fr_ca: Les gyroscopes Analog Devices ne fonctionnent pas correctement

source: **Issue:** Due to an issue with the "autoSPI" feature in the roboRIO image 2022_v3.0, Analog Devices gyros do not work properly.
fr_ca: **Problème :** En raison d’un problème avec la fonction "autoSPI" dans l’image roboRIO 2022_v3.0, les gyroscopes Analog Devices ne fonctionnent pas correctement.

source: **Workaround:** There is no known workaround. An updated image will be released when the issue has been resolved.
fr_ca: **Solution:** Il n’existe aucune solution connue pour l'instant. Une image mise à jour sera publiée lorsque le problème aura été résolu.

source: Fixed in WPILib 2022.2.1
fr_ca: Résolu dans WPILib 2022.2.1

source: Joysticks may stop updating in Java
fr_ca: La mise à jour des données issues des joysticks peut s'interrompre en Java

source: **Issue:** A deadlock in the Java WPILib DriverStation thread may occur. This is primarily noticeable by Joystick values "freezing" and not updating. Disable and E-Stop are not affected by this issue.
fr_ca: **Problème:** Un blocage dans le thread DriverStation Java WPILib peut se produire. Cette situation est principalement perceptible par les valeurs issues du joystick qui se retrouvent "gelées" et non mises à jour. Disable et E-Stop ne sont pas affectés par ce problème.

source: **Recommendations:** Ensure that anyone operating a robot is prepared to disable or E-Stop if this issue occurs. Limit calls to the following DriverStation methods: ``isEnabled``, ``isEStopped``, ``isAutonomous``, ``isDisabled``, ``isAutonomousEnabled``, ``isTeleopEnabled``, ``isTest``, ``isDSAttached``, ``isFMSAttached``, and ``updateControlWord``, especially from multiple threads, to limit the chance of the deadlock occurring. Follow `this WPILib issue <https://github.com/wpilibsuite/allwpilib/issues/3896>`__ for more updates and possible workarounds.
fr_ca: **Recommendations:** Assurez-vous que toute personne opérant un robot est prête à désactiver ou à arrêter E-Stop si ce problème se produit. Limiter les appels aux méthodes DriverStation suivantes: ``isEnabled``, ``isEStopped``, ``isAutonomous``, ``isDisabled``, ``isAutonomousEnabled``, ``isTeleopEnabled``, ``isTest``, ``isDSAttached``, ``isFMSAttached``, et ``updateControlWord``, en particulier à partir de plusieurs threads, pour limiter le risque de bloquage. Essayez de garder un oeil sur `ce problème de la WPILib <https://github.com/wpilibsuite/allwpilib/issues/3896>`__ pour d'autres mises à jour et possibles solutions.

source: VS Code Vendor Check for Updates Broken
fr_ca: La commande VS Code Vendor Check for Updates ne fonctionne pas.

source: **Issue:** Checking for vendor library updates online results in the following error message: `Command 'WPILib: Manage Vendor Libraries' resulted in an error (Only absolute URLs are supported)`. This is caused by a bug in the VS Code extension related to the way the WPILib Command library vendordeps were created. This issue will be fixed in the next WPILib release.
fr_ca: **Problème:** La vérification en ligne des mises à jour des librairies des fournisseurs bibliothèque s'accompagne du message d’erreur suivant: `Command 'WPILib: Manage Vendor Libraries' resulted in an error (Only absolute URLs are supported)`. Cette erreur est due à un bogue dans l’extension VS Code relativement à la façon dont la commande WPILib pour les librairies des fournisseurs a été créée. Ce problème sera résolu dans la prochaine version de WPILib.

source: **Workaround:** If you aren't using either the new or old Command vendordep, remove them from your project. Alternately, the new or old Command vendordep can be temporarily removed before checking for updates, and then re-added.
fr_ca: **Solution:** Si vous n’utilisez pas la nouvelle ou l’ancienne Command vendordep, supprimez-les de votre projet. Alternativement, la nouvelle ou l’ancienne Command vendordep peut être temporairement supprimées avant de rechercher des mises à jour, puis rajoutées.

source: Shuffleboard aborts while launching
fr_ca: Le Shuffleboard plante lors du lancement

source: **Issue:** Shuffleboard may start to open, and then abort. This is caused by issues with the scripts for launching the WPILib tools.
fr_ca: **Problème:** Le Shuffleboard peut commencer à s’ouvrir, puis planter. Cette anomalie est causée par des problèmes avec les scripts de lancement des outils WPILib.

source: **Workaround:** Manually launch Shuffleboard from the commandline without using the shortcut or script. On Windows run ``c:\Users\Public\wpilib\2022\jdk\bin\java -jar c:\Users\Public\wpilib\2022\tools\shuffleboard.jar``. On Linux or macOS, run ``~/wpilib/2022/jdk/bin/java -jar ~/wpilib/2022/tools/shuffleboard.jar``
fr_ca: **Solution:** Lancer manuellement Shuffleboard à partir de la ligne de commande sans utiliser le raccourci du bureau ou le script. Sous Windows, lancer la commande ``c:\Users\Public\wpilib\2022\jdk\bin\java -jar c:\Users\Public\wpilib\2022\tools\shuffleboard.jar``. Sous Linux ou macOS, lancer la commande ``~/wpilib/2022/jdk/bin/java -jar ~/wpilib/2022/tools/shuffleboard.jar``

source: This issue may affect any WPILib java tool, as they use the same scripts to open. If you have issues with PathWeaver, RobotBuilder, or SmartDashboard replace ``shuffleboard.jar`` above with ``PathWeaver.jar``, ``RobotBuilder.jar`` or ``SmartDashboard.jar``
fr_ca: Ce problème peut affecter n’importe quel outil Java WPILib, car ils utilisent les mêmes scripts d'ouverture. Si vous rencontrez des problèmes avec PathWeaver, RobotBuilder ou SmartDashboard, remplacez ``shuffleboard.jar`` ci-dessus par ``PathWeaver.jar``, ``RobotBuilder.jar`` ou ``SmartDashboard.jar``

source: SmartDashboard and Simulation fail to launch on Windows N Editions
tr_tr: SmartDashboard ve Simulation, Windows N Editions'da başlatılamıyor

source: **Issue:** WPILib code using CSCore (dashboards and simulated robot code) will fail to launch on Education N editions of Windows.
tr_tr: **Issue-Sorun:** CSCore (kontrol panelleri ve simüle edilmiş robot kodu) kullanan WPILib kodu, Windows'un Education N sürümlerinde başlatılamayacak.
