Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/yearly-overview/known-issues.po
Languages: fr_ca, he_il, tr_tr

source: There is currently an issue with inter-operating C++/Java Network Tables clients (dashboards or co-processors) with LabVIEW servers (LV robot code). In some scenarios users will see updates from one client fail to be replicated across to other clients (e.g. data from a co-processor will not be properly replicated out to a dashboard). Data still continues to return correctly when accessed by code on the server.
tr_tr: Şu anda LabVIEW sunucuları (LV robot kodu) ile birlikte çalışan C ++ / Java Ağ Tabloları istemcilerinde (kontrol panelleri veya yardımcı işlemciler) bir sorun vardır. Bazı senaryolarda kullanıcılar, bir istemciden gelen güncellemelerin diğer istemcilere kopyalanmadığını göreceklerdir (örneğin, bir yardımcı işlemciden gelen veriler bir panoya düzgün şekilde kopyalanmayacaktır). Veriler, sunucudaki kodla erişildiğinde doğru şekilde geri dönmeye devam eder.

source: **Issue:** The simulation GUI fails to launch on macOS Mojave (10.14.x) due to a dynamic linker error (example below):
tr_tr: ** Sorun: ** Simülasyon GUI, dinamik bir bağlayıcı hatası nedeniyle macOS Mojave'de (10.14.x) başlatılamıyor (aşağıdaki örnek):

source: Fixed in Game Tools 2021 f1
tr_tr: Game Tools 2021 f1'de düzeltildi

source: 2021_v3.0 Imaging Issue
tr_tr: 2021_v3.0 Görüntüleme Sorunu

source: **Issue:** An issue was discovered with the roboRIO image version 2021_v3.1 included in the initial release of the 2021 NI Game Tools that prevents successful imaging of roboRIOs.
tr_tr: **Issue-Sorun: ** RoboRIO'ların başarılı şekilde görüntülenmesini engelleyen 2021 NI Oyun Araçlarının ilk sürümünde yer alan roboRIO görüntü sürümü 2021_v3.1 ile ilgili bir sorun keşfedildi.

source: **Solution:** Teams that downloaded the 2021 Game Tools installer prior to the morning of January 11, 2021 should :doc:`re-download and re-install</docs/zero-to-robot/step-2/frc-game-tools>` the latest installer (no need to uninstall first). The new version is 2021 f1. Users with the correct version installed will not see 2021_v3.1 as an option in the roboRIO imaging tool. Once the new version is installed, the roboRIO can be imaged with 2021_v3.0.
tr_tr: **Solution-Çözüm:** 2021 Game Tools yükleyicisini 11 Ocak 2021 sabahından önce indiren ekipler şunları yapmalıdır :doc:`re-download and re-install </docs/zero-to-robot/step-2/frc-game-tools>` (indirip yeniden yüklemelisiniz, önce kaldırmaya gerek yok). Yeni sürüm 2021 f1. Doğru sürümün yüklü olduğu kullanıcılar, roboRIO görüntüleme aracında 2021_v3.1'i bir seçenek olarak görmeyecekler. Yeni sürüm kurulduktan sonra roboRIO, 2021_v3.0 ile görüntülenebilir.

source: Code crash when initializing a PH/PCM related device
he_il: קריסה של הקוד כשמאתחלים רכיב קשור לPH/PCM

source: **Issue:** The following crash may happen when a ``Solenoid``, ``DoubleSolenoid``, ``Compressor``, ``PneumaticHub`` or ``PneumaticsControlModule`` is initialized when the CAN bus is disconnected.
he_il: **בעיה:** הקריסה הבאה יכולה להתרחש כאשר מתאחלים אובייקט ``Solenoid``, ``DoubleSolenoid``, ``Compressor``, ``PneumaticsHub``, או ``PneumaticsControlModule`` כשהCAN Bus מנותק.

source: **Workaround:** It is recommended to wrap the constructor in a try/catch and catch any corresponding usages. Additionally, you will want to double check that all CAN connections are secure from possible disconnects.
he_il: **פיתרון זמני:** מומלץ לעטוף את הפעולה הבונה בtry/catch ולתפוס שימושים. בנוסף, כדאי לוודא שכל החיבורי CAN בטוחים מהתנתקויות אפשריות.
