Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/yearly-overview/yearly-changelog.po
Languages: es_mx, fr_ca, he_il, tr_tr

source: PathWeaver is deprecated and will be removed for 2027. Users may find :doc:`Choreo </docs/software/pathplanning/choreo/index>` or `PathPlanner <https://github.com/mjansen4857/pathplanner>`__ more useful. They both have an intuitive user interface and swerve support.
es_mx: PathWeaver es deprecado y sera removido para 2027. Usuarios quiza encuentren :doc:`Choreo</docs/software/pathplanning/choreo/index>` o `PathPlanner <https://github.com/mjansen4857/pathplanner>`__ más útil. Los dos tienen una buena interfaz de usuario y soporte para swerve.

source: Fix finding deploy directory when outputdir blank
es_mx: Se arreglo la búsqueda del directorio de implementación cuando el directorio de salida estaba en blanco

source: Elastic is bundled in the installer! Elastic is a simple and modern dashboard. :doc:`Read more here </docs/software/dashboards/elastic>`.
es_mx: ¡Elastic esta incluido en el instalador! Elastic es una dashboard simple y moderna :doc:`Lea más aquí </docs/software/dashboards/elastic>`.

source: WPIcal is new WPILib tool for calibrating FRC Apriltags to correct for field setup error. :doc:`Read more here </docs/software/wpilib-tools/wpical/index>`.
es_mx: WPIcal es una nueva herramienta de WPILib para calibrar Apiltags para corregir el errror de la posición de la cancha :doc:`Lea más aquí </docs/software/wpilib-tools/wpical/index>`.

source: 2025.2.1: Add JSON combiner which allows users to combine multiple AprilTag layouts
es_mx: 2025.2.1: Agregado combinador de JSON que permite a los usuarios combinar mutiles layouts de AprilTag

source: New for 2022
fr_ca: Nouveau pour 2022

source: Due to the large number of breaking and substantial changes between 2021 and 2022, it is advised that existing teams thoroughly read this document!
fr_ca: En raison du grand nombre de ruptures et de changements substantiels entre 2021 et 2022, il est conseillé aux équipes existantes de lire attentivement ce document !

source: A number of improvements have been made to FRC\ |reg| Control System software for 2022. This article will describe and provide a brief overview of the new changes and features as well as a more complete changelog for Java/C++ WPILib changes. This document only includes the most relevant changes for end users, the full list of changes can be viewed on the various `WPILib <https://github.com/wpilibsuite/>`__ GitHub repositories. WPILib recognizes that some of these changes may cause teams issues in the short term upgrading. We expect it to pay off over the long term as we better improve the internals of WPILib.
fr_ca: Un certain nombre d'améliorations ont été apportées à FRC\ |reg| Logiciel Control System pour 2022. Cet article décrira et fournira un bref aperçu des nouvelles modifications et fonctionnalités ainsi qu'un journal des modifications plus complet pour les modifications Java/C++ WPILib. Ce document ne comprend que les modifications les plus pertinentes pour les utilisateurs finaux, la liste complète des modifications peut être consultée sur les différents référentiels `WPILib <https://github.com/wpilibsuite/>`__ GitHub. WPILib reconnaît que certains de ces changements peuvent causer des problèmes aux équipes à court terme. Nous nous attendons à ce que cela porte ses fruits à long terme car nous améliorons mieux la fonctionnalité de WPILib.

source: Due to internal GradleRIO changes, it is necessary to update previous years projects. After :doc:`Installing WPILib for 2022 </docs/zero-to-robot/step-2/wpilib-setup>`, any 2020 or 2021 projects must be :doc:`imported </docs/software/vscode-overview/importing-gradle-project>` to be compatible.
fr_ca: En raison des changements internes de GradleRIO, il est nécessaire de mettre à jour les projets des années précédentes. Après :doc:`Installation de WPILib pour 2022 </docs>`, tout projet 2020 ou 2021 doit être :doc:`importé </docs>` pour être compatible.

source: Drive class functions such as ``DifferentialDrive`` and ``MecanumDrive`` **no longer invert** the right side by default. Please use ``setInverted`` on your motor controllers to invert the right side to maintain the same behavior
fr_ca: Les fonctions de classe Drive telles que ``DifferentialDrive`` et ``MecanumDrive`` **n'inversent plus** le côté droit par défaut. Veuillez utiliser ``setInverted`` sur vos contrôleurs de moteur pour inverser le côté droit afin de conserver le même comportement

source: Old Command-Based has been removed from the list of new templates in VS Code. Please migrate to the new Command-Based library. The Old Command Based remains available to support existing code.
fr_ca: L'ancien basé sur les commandes a été supprimé de la liste des nouveaux modèles dans VS Code. Veuillez migrer vers la nouvelle bibliothèque basée sur les commandes. L'ancienne base de commandes reste disponible pour prendre en charge le code existant.

source: IterativeRobot has been removed. Please use the TimedRobot template instead
fr_ca: IterativeRobot a été supprimé. Veuillez utiliser le modèle TimedRobot à la place

source: Rewrite :doc:`Mechanism2d </docs/software/dashboards/glass/mech2d-widget>` to utilize NetworkTables
fr_ca: Réécriture de :doc:`Mechanism2d ` pour utiliser NetworkTables

source: Improved the error message when a program crashes
fr_ca: Amélioration du message d'erreur lorsqu'un programme plante

source: Added support for DMA to Java
fr_ca: Ajout de la prise en charge du DMA vers Java

source: Added ``TimesliceRobot`` project template. This allows users to timeslice schedule periodic functions
fr_ca: Ajout du modèle de projet ``TimesliceRobot``. Cela permet aux utilisateurs de planifier des fonctions périodiques dans le temps

source: Added C++ TankDrive example
fr_ca: Ajout de l'exemple TankDrive C++

source: Added ``PS4Controller`` controller class
fr_ca: Ajout de la classe de contrôleur ``PS4Controller``

source: Added better message for when an I2C port is out of range
fr_ca: Ajout d'un meilleur message lorsqu'un port I2C est hors de portée

source: Added ``Debouncer`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/filter/Debouncer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_debouncer.html>`__) class. This helps with filtering rising and falling edges when dealing with boolean values
fr_ca: Ajout de la classe ``Debouncer`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/filter/Debouncer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_debouncer.html>`__) class. Celle-ci aide à filtrer les fronts montantes et descendantes lorsqu’on traite des valeurs booléennes.

source: Added ``PneumaticHub`` class for use with the REV Pneumatic Hub
fr_ca: Ajout de la classe ``PneumaticHub`` à utiliser avec le module pneumatique REV

source: GenericHID has been updated to static functions to use for non-defined controller types.
fr_ca: GenericHID a été mis à jour avec des fonctions statiques à utiliser pour les types de contrôleurs non définis.

source: ``XboxController`` has migrated away from taking arguments in functions and instead has functions with no arguments. An example conversion is below:
fr_ca: ``XboxController`` n'a plus d'arguments dans des fonctions et donc présente désormais des fonctions sans arguments. Voici un exemple de cette conversion :

source: ``getInstance()`` functions in ``CameraServer``, ``DriverStation``, ``LiveWindow``, ``Preferences``, ``SendableRegistry``, have been deprecated and replaced with static functions
fr_ca: Les fonctions ``getInstance()`` dans ``CameraServer``, ``DriverStation``, ``LiveWindow``, ``Preferences``, ``SendableRegistry``, ont été dépréciées et remplacées par des fonctions statiques

source: Several new classes have been added to enable simpler access to ``Counter``: ``ExternalDirectionCounter`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/counter/ExternalDirectionCounter.html>`__/ `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_external_direction_counter.html>`__), ``Tachometer`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/counter/Tachometer.html>`__/ `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_tachometer.html>`__), and ``UpDownCounter`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/counter/UpDownCounter.html>`__/ `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_up_down_counter.html>`__)
fr_ca: Plusieurs nouvelles classes ont été ajoutées pour permettre un accès plus simple à ``Counter``: ``ExternalDirectionCounter`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/counter/ExternalDirectionCounter.html>`__/ `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_external_direction_counter.html>`__), ``Tachometer`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/counter/Tachometer.html>`__/ `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_tachometer.html>`__), et ``UpDownCounter`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/counter/UpDownCounter.html>`__/ `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_up_down_counter.html>`__)

source: ``DutyCycleEncoder``: add support for setting duty cycle range
fr_ca: ``DutyCycleEncoder``: ajouter la prise en charge de la définition de la plage du rapport cyclique

source: Added ``ADIS16448_IMU`` and ``ADIS16470_IMU`` classes.
fr_ca: Ajout des classes ``ADIS16448_IMU`` et ``ADIS16470_IMU``.

source: Added ``BangBangController`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/controller/BangBangController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_bang_bang_controller.html>`__) for maximally-aggressive velocity control of high-inertia mechanisms, which is useful for flywheel shooters.
fr_ca: Ajout de la classe ``BangBangController`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/controller/BangBangController.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_bang_bang_controller.html>`__) pour avoir un contrôle de vitesse optimal et agressif des mécanismes à haute inertie, ce qui est utile pour les tireurs à volant d’inertie.

source: Breaking Changes
fr_ca: Changements majeurs
tr_tr: Son Dakika Değişiklikler

source: ``PDP`` is now ``PowerDistribution``
fr_ca: ``PDP`` est maintenant ``PowerDistribution``

source: Various ``PCM`` related classes (Solenoid, Compressor) now require a ``PneumaticsModuleType`` to support either the CTRE Pneumatics Control Module or REV Pneumatic Hub. Vendor specific methods have been moved to the ``PneumaticsControlModule`` or ``PneumaticHub`` classes
fr_ca: Diverses classes liées au ``PCM`` (solénoïde, compresseur) nécessitent désormais un ``PneumaticsModuleType`` pour prendre en charge le module de commande pneumatique CTRE ou le moyeu pneumatique REV. Les méthodes spécifiques aux fournisseurs ont été déplacées vers les classes ``PneumaticsControlModule`` ou ``PneumaticHub``

source: Sendable has been broken up into NetworkTables components (called NTSendable\*, ``nt`` namespace) and non-NetworkTables components (moved to wpiutil, ``wpi`` namespace). This will make it easier for vendors and external libraries to integrate Sendable
fr_ca: Sendable a été divisé en composants NetworkTables (appelés NTSendable\*, espace de noms ``nt``) et en composants non-NetworkTables (déplacés vers wpiutil, espace de noms ``wpi``). Cela permettra aux fournisseurs et aux librairies externes d'intégrer plus facilement Sendable

source: ``InterruptableSendableBase`` has been broken up into ``AsynchronousInterrupt`` & ``SynchronousInterrupt``. Rather then a class, like ``DigitalInput`` extending ``InterruptableSendableBase`` and all interrupt methods being accessed through the ``DigitalInput``, teams should instead construct ``AsynchronousInterrupt`` or ``SynchronousInterrupt``, and pass it the ``DigitalSource`` (e.g. ``DigitalInput``).
fr_ca: ``InterruptableSendableBase`` a été divisé en ``AsynchronousInterrupt`` & ``SynchronousInterrupt``. Plutôt qu'une classe, comme ``DigitalInput`` étendant ``InterruptableSendableBase`` et toutes les méthodes d'interruption accessibles via ``DigitalInput``, les équipes devraient plutôt construire ``AsynchronousInterrupt`` ou ``SynchronousInterrupt``, et le transmettre la ``DigitalSource`` (par exemple ``DigitalInput``).

source: C++: ``DriverStation.ReportWarning`` and ``DriverStation.ReportError`` have been removed. Use ``FRC_ReportError`` in ``frc\Errors.h`` header. Status of ``frc::err::Error`` can be used for Errors and ``frc::warn::Warning`` can be used for warnings.
fr_ca: C++ : ``DriverStation.ReportWarning`` et ``DriverStation.ReportError`` ont été supprimés. Utilisez ``FRC_ReportError`` dans l'en-tête ``frc\Errors.h``. L'état de ``frc::err::Error`` peut être utilisé pour les erreurs et ``frc::warn::Warning`` peut être utilisé pour les avertissements.

source: ``SpeedController`` has been renamed to ``MotorController``
fr_ca: ``SpeedController`` a été renommé ``MotorController``

source: Various portions of the API still refers to ``SpeedController`` for backwards compatibility. Users should pass ``MotorController`` instead
fr_ca: Diverses parties de l'API font encore référence à ``SpeedController`` pour une compatibilité avec la version précédente. À la place, les utilisateurs doivent désormais invoquer ``MotorController``.

source: Several duplicate ``SpeedController`` methods have been removed. Use ``set`` instead of ``setSpeed``. Use ``disable`` instead of ``setDisable``. Several low level methods have been removed: position, bounds, periodMultiplier, zeroLatch, and raw methods. Use the ``PWM`` class directly if this level of control is needed.
fr_ca: Plusieurs méthodes ``SpeedController`` en double ont été supprimées. Utilisez ``set`` au lieu de ``setSpeed``. Utilisez ``disable`` au lieu de ``setDisable``. Plusieurs méthodes de bas niveau ont été supprimées : position, bornes, periodMultiplier, zeroLatch et méthodes brutes. Utilisez directement la classe ``PWM`` si ce niveau de contrôle est nécessaire.

source: Various DriverStation In[Mode] functions has been renamed (IE: ``InDisabled`` -> ``inDisabled``)
fr_ca: Diverses fonctions de DriverStation In[Mode] ont été renommées (IE : ``InDisabled`` -> ``inDisabled``)

source: ``Normalize`` has been renamed to ``Desaturate`` in ``DifferentialDrive``, ``MecanumDrive``, ``KilloughDrive``, ``MecanumDriveWheelSpeeds``, ``DifferentialDriveWheelSpeeds``. ``NormalizeWheelSpeeds`` has been renamed to ``DesaturateWheelSpeeds`` in ``SwerveDriveKinematics``.
fr_ca: ``Normalize`` a été rebaptisé ``Desaturate`` dans ``DifferentialDrive``, ``MecanumDrive``, ``KilloughDrive``, ``MecanumDriveWheelSpeeds``, ``DifferentialDriveWheelSpeeds``. ``NormalizeWheelSpeeds`` a été rebaptisé ``DesaturateWheelSpeeds`` dans ``SwerveDriveKinematics``.

source: Deprecated ``wpilibj.cameraserver`` has been removed. Use ``cameraserver`` instead
fr_ca: ``wpilibj.cameraserver`` obsolète a été supprimé. Utilisez plutôt ``cameraserver``

source: Deprecated ``RobotDrive`` has been removed. Use ``DifferentialDrive`` instead
fr_ca: ``RobotDrive`` obsolète a été supprimé. Utilisez ``DifferentialDrive`` à la place

source: Deprecated ``GearTooth`` has been removed. Use the ``Counter`` class instead
fr_ca: ``GearTooth`` obsolète a été supprimé. Utilisez plutôt la classe ``Counter``

source: C++: Deprecated ``WPILib.h`` has been removed. Please only include what you need
fr_ca: C++ : ``WPILib.h`` obsolète a été supprimé. Veuillez n'inclure que ce dont vous avez besoin

source: C++: ``wpi::StringRef`` is replaced with ``std::string_view``. This is a drop in replacement in most cases
fr_ca: C++ : ``wpi::StringRef`` est remplacé par ``std::string_view``. Il s'agit d'une remplacement direct dans la plupart des cas

source: C++: ``wpi::ArrayRef`` is replaced with ``wpi::span``. This is a modified backport of the C++20 ``std::span``
fr_ca: C++ : ``wpi::ArrayRef`` est remplacé par ``wpi::span``. Ceci est un rétroportage modifié du C++20 ``std::span``

source: C++: ``wpi::Twine`` is replaced with `fmtlib <https://fmt.dev/latest/index.html>`__. It has more features and is standard in C++20
fr_ca: C++ : ``wpi::Twine`` est remplacé par `fmtlib <https://fmt.dev/latest/index.html>`__. Il a plus de fonctionnalités et est standard en C++20

source: C++: ``wpi::sys::path`` is replaced with ``fs::path`` from ``#include <wpi/fs.h>`` which is based on ``std::filesystem``
fr_ca: C++ : ``wpi::sys::path`` est remplacé par ``fs::path`` de ``#include <wpi/fs.h>`` qui est basé sur ``std::filesystem``

source: C++: ``frc::filesystem`` methods have been simplified to return ``std::string``, rather then using a pointer parameter
fr_ca: C++ : les méthodes ``frc::filesystem`` ont été simplifiées pour renvoyer ``std::string``, plutôt que d'utiliser un paramètre de pointeur

source: C++: ``wpi::math`` is replaced with ``wpi::numbers`` which is based on C++20 ``std::numbers``.
fr_ca: C++ : ``wpi::math`` est remplacé par ``wpi::numbers`` qui est basé sur C++20 ``std::numbers``.

source: C++: Support for ``std::cout`` was removed from units because ``<iostream>`` has significant compile-time overhead. Use `fmtlib <https://fmt.dev/latest/index.html>`__ instead, an analog for C++20's ``std::format()`` (e.g., ``fmt::print("{}", 2_m)``). The units headers automatically include fmtlib. If you still want to use ``std::cout``, call ``value()`` on the variable being printed (e.g., ``std::cout << velocity.value()``).
fr_ca: C++ : la prise en charge de ``std::cout`` a été supprimée des unités car ```` a une surcharge de temps de compilation importante. Utilisez `fmtlib <https://fmt.dev/latest/index.html>`__ à la place, un analogue pour le ``std::format()`` de C++20 (par exemple, ``fmt::print(" {}", 2_m)``). Les en-têtes d'unités incluent automatiquement fmtlib. Si vous souhaitez toujours utiliser ``std::cout``, appelez ``value()`` sur la variable en cours d'impression (par exemple, ``std::cout << speed.value()``).

source: C++: Various classes have migrated to use :doc:`units </docs/software/basic-programming/cpp-units>`: ``Ultrasonic``, ``CommandScheduler``, ``CommandState``, ``WaitUntilCommand``, ``MecanumControllerCommand``, ``RamseteCommand``, ``SwerveControllerCommand``, ``TrapezoidProfileCommand``, ``WaitCommand``, ``Counter``, ``CounterBase``, ``DriverStation``, ``Encoder``, ``InterruptableSensorBase``, ``MotorSafety``, ``Notifier``, ``SPI``, ``SerialPort``, ``SlewRateLimiter``, ``Solenoid``, ``Timer``, ``Watchdog``, and Old Commands: ``Command``, ``CommandGroup``, ``CommandGroupEntry``, ``TimedCommand``, ``WaitCommand``, ``WaitForChildren``, ``WaitUntilCommand``
fr_ca: C++: Diverses classes ont migré pour utiliser des :doc:`unités </docs/software/basic-programming/cpp-units>`: ``Ultrasonic``, ``CommandScheduler``, ``CommandState``, ``WaitUntilCommand``, ``MecanumControllerCommand``, ``RamseteCommand``, ``SwerveControllerCommand``, ``TrapezoidProfileCommand``, ``WaitCommand``, ``Counter``, ``CounterBase``, ``DriverStation``, ``Encoder``, ``InterruptableSensorBase``, ``MotorSafety``, ``Notifier``, ``SPI``, ``SerialPort``, ``SlewRateLimiter``, ``Solenoid``, ``Timer``, ``Watchdog``, and Old Commands: ``Command``, ``CommandGroup``, ``CommandGroupEntry``, ``TimedCommand``, ``WaitCommand``, ``WaitForChildren``, ``WaitUntilCommand``

source: The old ``PIDController``, ``PIDSource`` and ``PIDOutput`` classes have been moved from the main library to the Old Commands Vendordep. Wrapper classes in the pidwrappers package have been added for PIDSource and PIDoutput support for WPILib classes, also in the Old Commands Vendordep. These classes have been deprecated since 2020. The new PID Controller in ``edu.wpi.first.math.controller`` for Java and ``frc2`` for C++ is the recommended replacement.
fr_ca: Les anciennes classes ``PIDController``, ``PIDSource`` et ``PIDOutput`` ont été déplacées de la librairie principale vers l’ancienne commande Vendordep. Les classes Wrapper dans le package pidwrappers ont été ajoutées également dans les anciennes commandes Vendordep pour la prise en charge de PIDSource et PIDoutput pour les classes WPILib. Ces classes sont déconseillées depuis 2020. En remplacement de ces classes, le nouveau contrôleur PID Controller situé dans le package ``edu.wpi.first.math.controller`` pour Java et ``frc2`` pour C++ est celui qui est recommandé pour la programmation de vos robots.

source: ``Preferences`` putX methods (e.g. putDouble) have been deprecated and replaced with setX methods for consistency with the rest of WPILib API.
fr_ca: Les méthodes putX ``Preferences`` (par exemple putDouble) sont désormais déconseillées et remplacées par des méthodes setX pour être s'assurer d'être consistant avec le reste de l’API WPILib.

source: Package Renames
fr_ca: Renommer le package

source: We have committed to several organizational renames that will allow us greater flexible with new classes in the future. The VS Code project importer will update existing projects to use the new packages/headers.
fr_ca: Nous nous sommes engagés dans plusieurs renommages organisationnels qui nous permettront une plus grande flexibilité avec de nouvelles classes à l'avenir. L'importateur de projet VS Code mettra à jour les projets existants pour utiliser les nouveaux packages/en-têtes.

source: Several packages moved from ``wpilibj`` to ``math``: ``controller``, ``estimator``, ``geometry``, ``kinematics``, ``math``, ``spline``, ``system``, ``trajectory``
fr_ca: Plusieurs packages déplacés de ``wpilibj`` vers ``math`` : ``controller``, ``estimateur``, ``geometry``, ``kinematics``, ``math``, ``spline` `, ``système``, ``trajectoire``

source: ``wpiutil.math`` was moved to ``math``
fr_ca: ``wpiutil.math`` a été déplacé vers ``math``

source: ``wpiutil`` is now ``util``
fr_ca: ``wpiutil`` est maintenant ``util``

source: ``SlewRateLimiter``, ``LinearFilter``, and ``MedianFilter`` now live in ``math.filters``, along with the newly-added ``Debouncer``.
fr_ca: ``SlewRateLimiter``, ``LinearFilter``, et ``MedianFilter`` sont maintenant localisés dans ``math.filters``, ainsi que le nouveau ``Debouncer``.

source: ``Timer`` has moved from ``frc2`` to ``frc``
fr_ca: ``Timer`` est passé de ``frc2`` à ``frc``

source: Motor controllers (``VictorSPX``, ``PWMSparkMax``, etc) have been moved to a ``motorcontrol`` package.
fr_ca: Les contrôleurs de moteur (``VictorSPX``, ``PWMSparkMax``, etc) ont été déplacés vers un package ``motorcontrol``.

source: ``edu.wpi.cscore`` has moved to ``edu.wpi.first.cscore``
fr_ca: ``edu.wpi.cscore`` a été déplacé vers ``edu.wpi.first.cscore``

source: Uses multi-file ``json`` save formats instead of ``ini`` and supports loading/saving the workspace; when started from the VS Code tool menu, these default to using the project directory for saving rather than the system-global location
fr_ca: Utilise les formats de sauvegarde multi-fichiers ``json`` au lieu de ``ini`` et prend en charge le chargement/l'enregistrement de l'espace de travail ; lorsqu'ils sont démarrés à partir du menu de l'outil VS Code, ceux-ci utilisent par défaut le répertoire du projet pour l'enregistrement plutôt que l'emplacement global du système

source: Add widget for ``Field2d``
fr_ca: Ajouter un widget pour ``Field2d``

source: Add icons to widget layouts
fr_ca: Ajouter des icônes aux mises en page des widgets
