Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/yearly-overview/yearly-changelog.po
Languages: es_mx, fr_ca, he_il, tr_tr

source: Added a constructor to ``Translation2d`` that takes in a distance and angle. This is effectively converting from polar coordinates to Cartesian coordinates.
tr_tr: Mesafe ve açı alan ``Translation2d`` ye bir kurucu eklendi. Bu, kutupsal koordinatlardan Kartezyen koordinatlara etkili bir şekilde dönüştürülür.

source: Added ``EllipticalRegionConstraint``, ``RectangularRegionConstraint``, and ``MaxVelocityConstraint`` to allow constraining trajectory velocity in a certain region of the field.
he_il: נוספו ``EllipticalRegionConstraint``, ``RectangularRegionConstraint``, ו-``MaxVelocityConstraint`` כדי לאפשר הגבלת מהירות מסלול באזור מסוים של הזירה.
tr_tr: Alanın belirli bir bölgesinde yörünge hızının sınırlandırılmasına izin vermek için ``EllipticalRegionConstraint`` , ``RectangularRegionConstraint`` ve ``MaxVelocityConstraint``eklendi.

source: Added equals() operator to the ``Trajectory`` class to compare two or more trajectories.
he_il: נוסף האופרטור ``equals()`` למחלקה ``Trajectory`` כדי להשוות בין שני מסלולים או יותר.
tr_tr: İki veya daha fazla yörüngeyi karşılaştırmak için ``Trajectory`` sınıfına eşittir () operatörü eklendi.

source: Added zero-arg constructor to the ``Trajectory`` class in Java that creates an empty trajectory.
tr_tr: Java'daki ``Trajectory`` sınıfına boş bir yörünge oluşturan sıfır argümanlı yapıcı eklendi.

source: Added a special exception to catch trajectory constraint misbehavior. This notifies users when user-defined constraints are misbehaving (i.e. min acceleration is greater than max acceleration).
he_il: נוסף exception מיוחד כדי לתפוס התנהגות לא נכונה של מסלול. זה מודיע למשתמשים כאשר אילוצים המוגדרים על ידי המשתמש מתנהגים בצורה לא נכונה (לדוגמא, תאוצה מינימלית גדולה יותר מהאצה מקסימלית).
tr_tr: Yörünge kısıtlaması yanlış davranışını yakalamak için özel bir istisna eklendi. Bu, kullanıcı tanımlı kısıtlamalar yanlış davrandığında (yani minimum hızlanma maksimum hızlanmadan daha büyük olduğunda) kullanıcıları bilgilendirir.

source: Added a ``getRotation2d()`` method to the ``Gyro`` interface. This method automatically takes care of converting from gyro conventions to geometry conventions.
he_il: נוספה הפעולה ``getRotation2d()`` לממשק ה-``Gyro``. פעולה זו מטפלת באופן אוטומטי בהמרה ממוסכמות גירו למוסכמות גיאומטריה.
tr_tr: ``Gyro`` arayüzüne bir ``getRotation2d()`` yöntemi eklendi. Bu yöntem otomatik olarak cayro kurallarından geometri kurallarına dönüştürme ile ilgilenir.

source: Added angular acceleration units for C++ teams. These are available in the ``<units/angular_acceleration.h>`` header.
tr_tr: C++ ekipleri için açısal hızlandırma birimleri eklendi. Bunlar, ``<units/angular_acceleration.h>`` başlığında bulunur.

source: Added X and Y component getters in ``Pose2d`` - ``getX()`` and ``getY()`` in Java, ``X()`` and ``Y()`` in C++.
tr_tr: Java'da ``Pose2d`` - ``getX()`` ve ``getY()`` , C++ 'da ``X()`` 've ``Y()`` 'içine X ve Y bileşen alıcıları eklendi.

source: Added implicit conversion from ``degree_t`` to ``Rotation2d`` in C++. This allows teams to use a degree value (i.e. ``47_deg``) wherever a ``Rotation2d`` is required.
tr_tr: C++ 'da ``degree_t`` 'den ``Rotation2d`` 'ye örtük dönüşüm eklendi. Bu, takımların ``Rotation2d`` nin gerekli olduğu her yerde bir derece değeri (i.e. ``47_deg``) kullanmasına izin verir.

source: Fixed bug in path following examples where odometry was not being reset to the starting pose of the trajectory.
tr_tr: Odometrinin yörüngenin başlangıç pozisyonuna sıfırlanmadığı örneklerden sonraki örneklerdeki hata düzeltildi.

source: Fixed some spline generation bugs for advanced users who were using control vectors directly.
tr_tr: Doğrudan kontrol vektörlerini kullanan ileri düzey kullanıcılar için bazı spline oluşturma hataları düzeltildi.

source: Fixed theta controller continuous input in swerve examples. This fixes the behavior where the shortest path is not used during drivetrain rotation.
tr_tr: Swerve örneklerinde sabit teta denetleyicisi sürekli girişi. Bu, aktarma organlarının dönüşü sırasında en kısa yolun kullanılmadığı davranışı düzeltir.

source: Deprecated ``units.h``, use individual :ref:`units headers <docs/software/basic-programming/cpp-units:Using the Units Library>` instead which speeds compile times.
tr_tr: Kullanımdan kaldırılan ``units.h`` bunun yerine derleme sürelerini hızlandıran bireysel :ref:`unit başlıkları <docs/software/basic-programming/cpp-units:Using the Units Library>` kullanın.

source: Added keyboard virtual joystick simulation support.
he_il: נוספה תמיכה בסימולציית מקלדת של ג'ויסטיק וירטואלי.
tr_tr: Klavye sanal oyun çubuğu simülasyon desteği eklendi.

source: Added Mechanism2D for visualizing mechanisms in simulation.
he_il: נוסף Mechanism2D להדמיית מנגנונים בסימולציה.
tr_tr: Simülasyondaki mekanizmaları görselleştirmek için Mekanizma2D eklendi.

source: Added simulation physics classes for common robot mechanisms (DrivetrainSim, ElevatorSim, SingleJointedArmSim, and FlywheelSim)
he_il: נוספו מחלקות פיזיקה של סימולציה למנגנוני רובוט נפוצים (DrivetrainSim, ElevatorSim, SingleJointedArmSim, and FlywheelSim)
tr_tr: Yaygın robot mekanizmaları için simülasyon fizik sınıfları eklendi (DrivetrainSim, ElevatorSim, SingleJointedArmSim ve FlywheelSim)

source: Number Slider now displays the text value
he_il: Number Slider מציג כעת את ערך הטקסט
tr_tr: Number Slider-Sayı Kaydırıcısı artık metin değerini gösterir

source: Graphing Widget now uses ChartFX, a high performance graphing library
he_il: ה-Graphing Widget משתמש כעת ב-ChartFX, ספריית גרפים עם ביצועים גבוהים.
tr_tr: Graphing Widget artık yüksek performanslı bir grafik kitaplığı olan ChartFX'i kullanıyor

source: Fixed decimal digit formatting with large numbers
he_il: תוקנה תצוגת הספרות עם מספרים גדולים
tr_tr: Büyük sayılarla sabit ondalık basamak biçimlendirmesi

source: Size and position can now be set separately in the Shuffleboard API
he_il: ניתן להגדיר כעת גודל ומיקום בנפרד ב-Shuffleboard API.
tr_tr: Boyut ve konum artık Shuffleboard API'sinde ayrı ayrı ayarlanabilir

source: Analog Input can now be viewed with a Text Widget
he_il: ניתן להציג כעת קלט אנלוגי עם Text Widget
tr_tr: Analog Giriş artık bir Metin Widget'ı ile görüntülenebilir

source: Host IP can be specified in configuration.
he_il: ניתן לציין את כתובת ה-IP של המארח בקונפיגורציה.
tr_tr: Ana bilgisayar IP'si yapılandırmada belirtilebilir.

source: Added support for reversed splines
tr_tr: Ters spline'lar için destek eklendi

source: The coordinate system in the exported JSON has changed to be compatible with the simulator GUI. See :ref:`Importing a PathWeaver JSON <docs/software/wpilib-tools/pathweaver/integrating-robot-program:Importing a PathWeaver JSON>` for more information.
he_il: מערכת הקואורדינטות ב-JSON המיוצא השתנתה ותואמת ל-GUI של הסימולטור. ראו :ref:`ייבוא PathWeaver JSON <docs/software/wpilib-tools/pathweaver/integrating-robot-program:Importing a PathWeaver JSON>` למידע נוסף.
tr_tr: Dışa aktarılan JSON'daki koordinat sistemi simülatör GUI'si ile uyumlu olacak şekilde değiştirildi. Daha fazla bilgi için :ref:`Importing a PathWeaver JSON <docs/software/wpilib-tools/pathweaver/integrating-robot-program:Importing a PathWeaver JSON>` bölümüne bakın.

source: Added a ``vendordep`` task for downloading vendor JSONs or fetching them from the user `wpilib` folder
he_il: נוספה משימת ``vendordep`` להורדת JSON של ספקים או אחזורם מתיקיית `wpilib` של המשתמש
tr_tr: Satıcı JSON'larını indirmek veya bunları kullanıcı ``wpilib`` klasöründen getirmek için bir ``vendordep`` görevi eklendi

source: Added a ``gradlerio.vendordep.folder.path`` property to set a non-default location for the vendor JSON folder
tr_tr: Satıcı JSON klasörü için varsayılan olmayan bir konum ayarlamak için bir ``gradlerio.vendordep.folder.path`` özelliği eklendi

source: Renamed the ``wpi`` task (that prints current versions of WPILib and tools) to `wpiVersions`
tr_tr: ``wpi`` görevini (WPILib ve araçların mevcut sürümlerini yazdıran) `wpiVersions` olarak yeniden adlandırdı

source: Added the ability to set environment variables during simulation
he_il: נוספה היכולת להגדיר משתני סביבה במהלך סימולציה
tr_tr: Simülasyon sırasında ortam değişkenlerini ayarlama kabiliyeti eklendi

source: To set the environment variable ``HALSIMWS_HOST`` use:
he_il: להגדרת משתנה הסביבה ``HALSIMWS_HOST`` השתמש ב:
tr_tr: ``HALSIMWS_HOST`` ortam değişkenini ayarlamak için şunu kullanın:

source: Now only lists streamable devices on Linux platforms.
tr_tr: Artık yalnızca Linux platformlarındaki akışa uygun cihazları listeler.

source: Visual Studio Code has been updated to 1.52.1
he_il: Visual Studio Code עודכן לגרסת 1.52.1
tr_tr: Visual Studio Code, 1.52.1'e güncellendi

source: Driverstation sim extension is now enabled by default
he_il: הרחבת הסימולציה של ה-Driverstation מופעלת כעת כברירת מחדל
tr_tr: Driverstation sim uzantısı artık varsayılan olarak etkindir

source: Project importer now retains the commands version used in the original project
he_il: מייבא הפרויקט שומר כעת על גרסת הפקודות המשמשת בפרויקט המקורי
tr_tr: Proje içeri alıcısı artık orijinal projede kullanılan komut sürümünü koruyor

source: Clarified the text on the new project and project importer screens
he_il: הטקסטים במסכי פרויקט חדש וייבוא פרוייקט הובהרו
tr_tr: Yeni proje ve proje ithalatçı ekranlarındaki metin netleştirildi

source: Fixed import corrupting binary files
he_il: תיקון הייבוא של קבצים בינאריים
tr_tr: Bozuk ikili dosyaları içe aktarma düzeltildi

source: Fixed link order in C++ ``build.gradle`` projects
he_il: תוקן סדר הקישורים ב-``build.gradle`` בפרויקט C++.
tr_tr: C ++ ``build.gradle`` projelerinde bağlantı sırası düzeltildi

source: Updated "Change Select Default Simulate Extension Setting" command to work with multiple sim extensions
he_il: הפקודה ``בחרו הרחבת ברירת מחדל לסימולציה`` עודכנה לעבוד עם מספר הרחבות סימולציה
tr_tr: Birden çok sim uzantısıyla çalışmak için ``Change Select Default Simulate Extension Setting`` komutu güncellendi

source: Updated to be compatible with the new command based framework and PID Controller.
tr_tr: Yeni komut tabanlı çerçeve ve PID Denetleyicisi ile uyumlu olacak şekilde güncellendi.

source: Due to the major changes in templates, RobotBuilder will not accept a save file from a previous year. You must regenerate the yaml save file and export to a new directory.
he_il: בשל השינויים הגדולים בתבניות, ה-RobotBuilder לא יקבל קובץ שמירה מהשנה קודמת. עליכם ליצור מחדש את קובץ השמירה yaml ולייצא לתקיה חדשה.
tr_tr: Şablonlardaki büyük değişiklikler nedeniyle, RobotBuilder önceki yıla ait bir kayıt dosyasını kabul etmeyecektir. Yaml kaydetme dosyasını yeniden oluşturmalı ve yeni bir dizine aktarmalısınız.

source: A version of RobotBuilder that still exports to the old command based framework has included with the installer and is called RobotBuilder-Old
tr_tr: Halen eski komut tabanlı çerçeveye dışa aktaran RobotBuilder'ın bir sürümü, yükleyiciye dahil edilmiştir ve RobotBuilder-Old olarak adlandırılmıştır.

source: C++: use uniform initialization of objects in header
tr_tr: C++: başlıktaki nesnelerin tek tip başlatılmasını kullanın

source: C++: fixed case of includes so that code compiles on case-sensitive filesystems
tr_tr: C++: kodun büyük / küçük harfe duyarlı dosya sistemlerinde derlenmesi için düzeltildi

source: Use project name as default for save file
he_il: שימוש בשם הפרויקט כברירת מחדל לשמירת הקובץ
tr_tr: Dosyayı kaydetmek için proje adını varsayılan olarak kullan

source: Fixed export of wiring file
he_il: תיקון הייצוא של קובץ החיווט
tr_tr: Kablolama dosyasının dışa aktarımı düzeltildi

source: Fixed line-endings for scripts so they work on MacOS/Linux
he_il: תוקנה סיומת השורה עבור סקריפטים כך שהם יעבדו ב-macOS/Linux
tr_tr: Betikler için sabit satır sonları, böylece MacOS / Linux üzerinde çalışması düzeltildi

source: Added XboxController
he_il: נוסף XboxController
tr_tr: XboxController eklendi

source: Robot Characterization
tr_tr: Robot Karakterizasyonu

source: Added LQR latency compensation
tr_tr: LQR gecikme telafisi eklendi

source: The tool backend was improved to be more approachable for developers. Configuration and JSON files from the old tool will no longer work with the new version.
tr_tr: Backend, bir yazılımda kullanıcıların görmediği kısımların tümü ve ana sistemdir. Backend, yazılımcılar için daha ulaşılabilir olacak şekilde geliştirildi. Eski JSON dosyaları artık yeni sürümle çalışmayacaktır.

source: Deploy code in a new thread to avoid causing the GUI to hang.
tr_tr: GUI'nin askıda kalmasına neden olmaktan kaçınmak için kodu yeni bir iş parçacığına dağıtın.

source: A hardware-level `WebSocket interface <https://github.com/wpilibsuite/allwpilib/blob/v2021.1.1/simulation/halsim_ws_core/doc/hardware_ws_api.md>`__ has been added to allow remote access to robot code being simulated in a desktop environment.
he_il: נוסף ממשק `ממשק WebSocket <https://github.com/wpilibsuite/allwpilib/blob/v2021.1.1/simulation/halsim_ws_core/doc/hardware_ws_api.md>`__ ברמת החומרה כדי לאפשר גישה מרחוק לקוד הרובוט המדומה בסביבת שולחן עבודה.
