Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/yearly-overview/yearly-changelog.po
Languages: es_mx, fr_ca, he_il, tr_tr

source: Add titles for widgets
fr_ca: Ajouter des titres pour les widgets

source: Show exit save prompt only if not saved
fr_ca: Afficher l'invite de sortie d'enregistrement uniquement s'il n'est pas enregistré

source: Use system menubar
fr_ca: Utiliser la barre de menus du système

source: Add tab clear confirmation
fr_ca: Ajouter un onglet effacer la confirmation

source: Save widget titles display mode preference
fr_ca: Enregistrer la préférence de mode d'affichage des titres des widgets

source: Fix: CameraServer streams
fr_ca: Correctif : flux CameraServer

source: Fix: Shuffleboard not starting on Windows N. `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__ is still needed for camera support.
fr_ca: Correctif : Shuffleboard ne démarre pas sous Windows N. `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__ est toujours nécessaire pour la prise en charge de la caméra.

source: No new changes
fr_ca: Aucun changement

source: We have made a new tool for machine learning in the FIRST Robotics Competition. Axon allows users to view and create datasets, train machine learning models, test your models within the browser-based GUI, and export them for use on a Raspberry Pi. Detecting complex objects (such as hatch panels and other robots) has never been easier and an end-to-end user guide is available in the :doc:`WPILib docs </docs/software/wpilib-tools/axon/index>`. Axon provides the functionality to train machine learning models to recognize any object you want (defined in a homemade dataset), or generic objects such as cats, airplanes, and hot dogs.
fr_ca: Nous avons créé un nouvel outil pour l'apprentissage automatique dans le cadre du FIRST Robotics Competition. Axon permet aux utilisateurs d'afficher et de créer des ensembles de données, d'entraîner des modèles d'apprentissage automatique, de tester vos modèles dans l'interface graphique basée sur un navigateur et de les exporter pour les utiliser sur un Raspberry Pi. La détection d'objets complexes (comme les panneaux de hachures et autres robots) n'a jamais été aussi simple et un guide d'utilisation de bout en bout est disponible dans la :doc:`WPILib docs`. Axon fournit la fonctionnalité permettant d'entraîner des modèles d'apprentissage automatique afin de reconnaître tout objet de votre choix (défini dans un ensemble de données maison) ou des objets génériques tels que des chats, des avions et des hot-dogs.

source: Axon is a replacement for the previous AWS-based Jupyter Notebook solution released in the 2019 season. Axon has a smooth installation and user experience overall, and a much more friendly GUI for beginners and experts alike.
fr_ca: Axon remplace la précédente solution Jupyter Notebook basée sur AWS et publiée au cours de la saison 2019. Axon a une installation et une expérience utilisateur fluides dans l'ensemble, et une interface graphique beaucoup plus conviviale pour les débutants et les experts.

source: Running machine learning models on the WPILib Raspberry Pi image has never been easier either; the new Python script for the Pi features time-synchronous NetworkTables data streaming, as well as a better quality live inference MJPEG stream.
fr_ca: L'exécution de modèles d'apprentissage automatique sur l'image WPILib Raspberry Pi n'a jamais été aussi simple ; le nouveau script Python pour le Pi propose un flux de données NetworkTables synchrone dans le temps, ainsi qu'un flux MJPEG d'inférence en direct de meilleure qualité.

source: Gradle has been updated to version 7.3.2
fr_ca: Gradle a été mis à jour à la version 7.3.2

source: Internals of GradleRIO have been updated to be easier to read, more maintainable and easier for advanced teams to modify.
fr_ca: Les composants internes de GradleRIO ont été mis à jour pour être plus faciles à lire, plus faciles à entretenir et plus faciles à modifier pour les équipes avancées.

source: Deployment is more customizable
fr_ca: Le déploiement est plus personnalisable

source: The supported OpenCV version has been bumped to OpenCV4
fr_ca: La version OpenCV prise en charge a été remplacée par OpenCV4

source: OutlineViewer has been updated to be C++ based using the ImGui library. This makes OutlineViewer more maintainable and performant.
fr_ca: OutlineViewer a été mis à jour pour être basé sur C++ en utilisant la librairie ImGui. Cela rend OutlineViewer plus facile à maintenir et plus performant.

source: The Java version of OutlineViewer is discontinued and is no longer supported!
fr_ca: La version Java d'OutlineViewer n'est plus disponible et n'est plus prise en charge !

source: Simplified installation choices
fr_ca: Choix d’installation simplifiés

source: Visual Studio Code has been updated to 1.63.2
fr_ca: Visual Studio Code a été mis à jour à la version 1.63.2

source: Updated Java and C++ language extensions
fr_ca: Extensions de langage Java et C++ mises à jour
he_il: הרחבות השפה של Java ו-C++ עודכנו
tr_tr: Güncellenmiş Java ve C++ dil uzantıları

source: Fix Linux desktop icon permissions
fr_ca: Correction des autorisations d'icônes de bureau Linux

source: Add year to tools shortcuts name
fr_ca: Ajouter l'année au nom des raccourcis des outils

source: Handle issues with JDK running and UAC canceled
fr_ca: Gérer les problèmes liés à l’exécution du JDK et à l’annulation du contrôle de compte d’utilisateur

source: Visual Studio Code Extension
fr_ca: Extension de code Visual Studio
he_il: הרחבת Visual Studio Code
tr_tr: Visual Studio Kod Uzantısı

source: The project importer will only import 2020/2021 projects!
fr_ca: L'importateur de projets n'importera que les projets 2020/2021 !

source: Project Importer has been updated for the 2022 season. The project importer will attempt update the imported code, but manual changes may still be necessary due to the complexity of the breaking changes this year.
fr_ca: Project Importer a été mis à jour pour la saison 2022. L'importateur du projet tentera de mettre à jour le code importé, mais des modifications manuelles peuvent encore être nécessaires en raison de la complexité des changements de rupture cette année.

source: Remove Eclipse Project Importer
fr_ca: Supprimer l'importateur de projet Eclipse

source: Fix chcp not found warning during simulation on Windows
fr_ca: Correction de l'avertissement chcp not found lors de la simulation sous Windows

source: Add additional information to the project information command display
fr_ca: Ajouter des informations supplémentaires à l'affichage des commandes d'informations sur le projet

source: Due to project file changes, Robotbuilder will not import yaml save files from 2021 or earlier.
fr_ca: En raison des modifications apportées au fichier de projet, Robotbuilder n'importera pas les fichiers de sauvegarde yaml à partir de 2021 ou d'une version antérieure.

source: Update to compile with WPILib 2022 (remove RobotDrive and GearTooth), update PID Controllers, and pneumatics
fr_ca: Mettre à jour pour compiler avec WPILib 2022 (supprimer RobotDrive et GearTooth), mettre à jour les contrôleurs PID et la pneumatique

source: Improve type detection to detect changes in certain C++ types that were not previously detected as changes
fr_ca: Améliorer la détection de type pour détecter les changements dans certains types C++ qui n'étaient pas précédemment détectés comme des changements

source: Add project setting to enable or disable desktop support
fr_ca: Ajouter un paramètre de projet pour activer ou désactiver la prise en charge du bureau

source: Fix Java export of DoubleSolenoid, RobotDrive4, MecanumDrive, and Killough drive to avoid extra local copy
fr_ca: Correction de l'exportation Java du lecteur DoubleSolenoid, RobotDrive4, MecanumDrive et Killough pour éviter une copie locale supplémentaire

source: Fix C++ export of ConditionalCommand
fr_ca: Correction de l'exportation C++ de ConditionalCommand

source: Don’t validate timeout parameters that are less than 0
fr_ca: Ne pas valider les paramètres de délai d'attente inférieurs à 0

source: :doc:`SysId </docs/software/pathplanning/system-identification/index>` is a fully featured system identification utility that supersedes frc-characterization. It features an easy-to-use interface, advanced graphing analytics, Romi integration and other cool features!.
fr_ca: :doc:`SysId </docs>` est un utilitaire d'identification de système complet qui remplace la caractérisation frc. Il dispose d'une interface facile à utiliser, d'analyses graphiques avancées, de l'intégration Romi et d'autres fonctionnalités intéressantes !.

source: frc-characterization is discontinued and is no longer supported!
fr_ca: frc-characterization est interrompu et n'est plus pris en charge !

source: A Romi Library has been created to contain several helper classes that are a part of the ``RomiReference`` example. `Romi Vendordep <https://raw.githubusercontent.com/wpilibsuite/romi-vendordep/main/RomiVendordep.json>`__.
fr_ca: Une librairie Romi a été créée pour contenir plusieurs classes d’assistance qui font partie de l’exemple `RomiReference``. `Romi Vendordep <https://raw.githubusercontent.com/wpilibsuite/romi-vendordep/main/RomiVendordep.json>`__.

source: New for 2021
he_il: חדש לעונת 2021
tr_tr: 2021 için yeni

source: A number of improvements have been made to FRC\ |reg| Control System software for 2021. This article will describe and provide a brief overview of the new changes and features as well as a more complete changelog for C++/Java WPILib changes. This document only includes the most relevant changes for end users, the full list of changes can be viewed on the various `WPILib <https://github.com/wpilibsuite/>`__ GitHub repositories.
he_il: מספר שיפורים בוצעו בתוכנת מערכת הבקרה של FRC\ |reg| לעונת 2021. מאמר זה יתאר ויספק סקירה קצרה של השינויים והתכונות החדשות וכן יומן שינויים מפורט יותר לשינויי WPILib ב-C++/Java. מסמך זה כולל רק את השינויים הרלוונטיים ביותר עבור משתמשי הקצה, ניתן לראות את רשימת השינויים המלאה ב-Repositories השונים של WPILib ב-`GitHub <https://github.com/wpilibsuite/>`__.
tr_tr: FRC\ |reg| için bir dizi iyileştirme yapılmıştır. 2021 için Kontrol Sistemi yazılımı. Bu makale, yeni değişiklikler ve özelliklerin kısa bir özetini ve ayrıca C++/Java WPILib değişiklikleri için daha eksiksiz bir değişiklik günlüğünü açıklayacak ve sağlayacaktır. Bu belge yalnızca son kullanıcılar için en alakalı değişiklikleri içerir, değişikliklerin tam listesi çeşitli `WPILib <https://github.com/wpilibsuite/>`__ GitHub depolarında görüntülenebilir.

source: Due to internal GradleRIO changes, it is necessary to update previous years projects. After :doc:`Installing WPILib for 2021 </docs/zero-to-robot/step-2/wpilib-setup>`, any 2020 projects must be :doc:`imported </docs/software/vscode-overview/importing-gradle-project>` to be compatible.
he_il: בשל שינויים פנימיים ב-GradleRIO, יש צורך לעדכן פרוייקטים של שנים קודמות. אחרי :doc:`התקנת WPILib עבור עונת 2021 </docs/zero-to-robot/step-2/wpilib-setup>`, כל פרויקט 2020 חייב להיות :doc:`מיובא </docs/software/vscode-overview/importing-gradle-project>` כדי להיות תואם.
tr_tr: Dahili GradleRIO değişiklikleri nedeniyle, önceki yıl projelerinin güncellenmesi gerekmektedir. Sonra: :doc:`Installing WPILib for 2021</docs/zero-to-robot/step-2/wpilib-setup>` uyumlu olması için tüm 2020 projeleri:doc:`imported</docs/software/vscode-overview/importing-gradle-project>` olmalıdır.

source: Major Features
he_il: פיצ׳רים עיקריים
tr_tr: Başlıca Özellikler

source: Support for the :doc:`Romi </docs/romi-robot/index>` robot platform. Romi robot code runs in the desktop simulator environment and talks to the Romi via the new WebSocket interface.
he_il: תמיכה בפלטפורמת הרובוט :doc:`Romi </docs/romi-robot/index>`. קוד הרובוט של Romi פועל בסביבת סימולטור בשולחן העבודה ומדבר עם ה-Romi דרך ממשק ה-WebSocket החדש.
tr_tr: Destek :doc:`Romi </docs/romi-robot/index>` robot platformu. Romi robot kodu, masaüstü simülatör ortamında çalışır ve yeni WebSocket arayüzü üzerinden Romi ile konuşur.

source: A new robot data visualizer -- :ref:`Glass <docs/software/wpilib-tools/glass/index:Glass>` -- has been added. Glass has a similar UI to the simulator GUI and supports much of the same features; however, Glass can be used as a standalone dashboard and is not tied in to the robot program.
he_il: תצוגת נתוני רובוט חדשה - :ref:`Glass <docs/software/wpilib-tools/glass/index:Glass>`, נוספה. ל-Glass יש ממשק משתמש דומה ל-GUI של הסימולטור ותומך בחלק ניכר מאותן התכונות; עם זאת, Glass אינו יכול לשמש כ-Dashboard עצמאי ואינו קשורה לתוכנית הרובוט.
tr_tr: Yeni bir robot veri görselleştiricisi -- :ref:`Glass <docs/software/wpilib-tools/glass/index:Glass>` -- eklendi. Glass, simülatör GUI'sine benzer bir UI'ye sahiptir ve aynı özelliklerin çoğunu destekler; ancak Glass, bağımsız bir kontrol paneli olarak kullanılabilir ve robot programına bağlı değildir.

source: The WPILib installer has been rewritten to support macOS and Linux and to improve ease of use.
he_il: תוכנית ההתקנה של WPILib נכתבה מחדש כדי לתמוך ב-macOS ובלינוקס וכדי לשפר את קלות השימוש.
tr_tr: WPILib yükleyici, macOS ve Linux'u desteklemek ve kullanım kolaylığını artırmak için yeniden yazılmıştır.

source: The macOS installer is notarized, eliminating the need for Gatekeeper bypass.
he_il: תוכנית ההתקנה עבור macOS מאושרת, ומבטלת את הצורך במעקף ה-Gatekeeper.
tr_tr: MacOS yükleyici, Gatekeeper baypas gereksinimini ortadan kaldırarak noter tarafından onaylanmıştır.

source: Please see the :ref:`installation instructions <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>` as it differs from previous years.
he_il: אנא עיינו ב:ref:`הוראות ההתקנה <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>` כיוון שהן שונות משנים קודמות.
tr_tr: Önceki yıllardan farklı olduğu için lütfen bakınız: ref: `kurulum talimatları <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`.

source: Added support for model-based control with Kalman filters, extended Kalman filters, unscented Kalman filters, and linear-quadratic regulators. See :ref:`Introduction to State-Space Control <docs/software/advanced-controls/state-space/state-space-intro:Introduction to State-Space Control>` for more information.
tr_tr: Kalman filtreleri, genişletilmiş Kalman filtreleri, kokusuz Kalman filtreleri ve doğrusal karesel düzenleyiciler ile model tabanlı kontrol için destek eklendi. Bakınız :ref:`Introduction to State-Space Control <docs/software/advanced-controls/state-space/state-space-intro:Introduction to State-Space Control>` daha fazla bilgi için.

source: ``curvature_t`` moved from ``frc`` to ``units`` namespace (C++)
he_il: ``curvature_t`` עבר מה-namespace של ``frc`` אל ``units`` (ב-C++)
tr_tr: ``curvature_t``, ``frc``den ``units`` ad alanına (C ++) taşındı

source: Trajectory constraint methods are now ``const`` in C++. Teams defining their own custom constraints should mark the ``MaxVelocity()`` and ``MinMaxAcceleration()`` methods as ``const``.
tr_tr: Yörünge kısıtlama yöntemleri artık C ++ 'da ``const`` . Kendi özel kısıtlamalarını tanımlayan ekipler, ``MaxVelocity()`` ve ``MinMaxAcceleration()`` yöntemlerini ``const`` olarak işaretlemelidir.

source: The ``Field2d`` class (added midway through the 2020 season) was moved from the simulation package (``edu.wpi.first.wpilibj.simulation`` / ``frc/simulation/``) to the SmartDashboard package (``edu.wpi.first.wpilibj.smartdashboard`` / ``frc/SmartDashboard/``). This allows teams to send their robot position over NetworkTables to be viewed in Glass. The Field2d instance can be sent using ``SmartDashboard.putData("Field", m_field2d)`` / ``frc::SmartDashboard::PutData("Field", &m_field2d)`` or by using one of the :ref:`Shuffleboard methods <docs/software/wpilib-tools/shuffleboard/layouts-with-code/sending-data:Sending sensors, motors, etc>`. This must be done in order to see the Field2d in the Simulator GUI.
tr_tr: ``Field2d`` sınıfı (2020 sezonunun ortasında eklendi) simülasyon paketinden (``edu.wpi.first.wpilibj.simulation`` / ``frc/simülasyon/``) SmartDashboard paketine ( ``edu.wpi.first.wpilibj.smartdashboard`` / ``frc/SmartDashboard/``). Bu, ekiplerin robot konumlarını Glass'ta görüntülenmek üzere NetworkTables üzerinden göndermelerine olanak tanır. Field2d örneği, ``SmartDashboard.putData("Field", m_field2d)`` / ``frc::SmartDashboard::PutData("Field", &m_field2d)`` kullanılarak veya :ref:`Shuffleboard methods <docs/software/wpilib-tools/shuffleboard/layouts-with-code/sending-data:Sending sensors, motors, etc>` . Simülatör GUI'de Field2d'yi görmek için bu yapılmalıdır.

source: New Command-Based Library
tr_tr: Yeni Komut Tabanlı Kütüphane

source: Watchdog and epoch reporting has been added to the command scheduler. This will let teams know exactly which command or subsystem is responsible for a loop overrun if one occurs.
tr_tr: Komut zamanlayıcıya gözcü ve dönem raporlaması eklendi. Bu, ekiplerin bir döngü taşması meydana gelirse tam olarak hangi komutun veya alt sistemin sorumlu olduğunu bilmesini sağlayacaktır.

source: Added a ``withName()`` command decorator for Java teams. This lets teams set the name of a particular command using the :ref:`decorator pattern <docs/software/commandbased/convenience-features:withName (Java only)>`.
tr_tr: Java ekipleri için ``withName()`` komut dekoratörü eklendi. Bu, ekiplerin :ref:`dekoratör kalıbı <docs/software/commandbased/convenience-features:withName (Java only)>` kullanarak belirli bir komutun adını ayarlamasını sağlar.

source: Added a ``NetworkButton`` class, allowing users to use a boolean ``NetworkTableEntry`` as a button to trigger commands.
he_il: נוספה המחלקה ``NetworkButton``, המאפשרת למשתמשים להשתמש ב-``NetworkTableEntry`` בוליאני ככפתור טריגר להפעלת פקודות.
tr_tr: Kullanıcıların komutları tetiklemek için bir düğme olarak bir boolean ``NetworkTableEntry`` kullanmasına izin veren bir ``NetworkButton`` sınıfı eklendi.

source: Added a ``simulationPeriodic()`` method to Subsystem. This method runs periodically during simulation, in addition to the regular ``periodic()`` method.
tr_tr: Subsystem'e bir ``simulationPeriodic()`` yöntemi eklendi. Bu yöntem, normal ``periodic()`` yöntemine ek olarak simülasyon sırasında periyodik olarak çalışır.

source: Holonomic Drive Controller - A controller that teams with holonomic drivetrains (i.e. swerve and mecanum) can use to follow trajectories. This also supports custom ``Rotation2d`` heading inputs that are separate from the trajectory because heading dynamics are decoupled from translational movement in holonomic drivetrains.
tr_tr: Holonomic Drive Controller - Holonomik aktarma organları (yani, sapma ve mekanizma) ile ekiplerin yörüngeleri takip etmek için kullanabileceği bir kontrolör. Bu aynı zamanda yörüngeden ayrı olan özel ``Rotation2d`` yön girdilerini de destekler çünkü yön dinamikleri, holonomik aktarma organlarındaki öteleme hareketinden ayrıştırılır.

source: Added support for scheduling functions more often than the robot loop via ``addPeriodic()`` in TimedRobot. Previously, teams had to make a Notifier to run feedback controllers more often than the TimedRobot loop period of 20ms (running TimedRobot more often than this is not advised). Now, users can run feedback controllers more often than the main robot loop, but synchronously with the TimedRobot periodic functions so there aren't any thread safety issues. See an example :ref:`here <docs/software/convenience-features/scheduling-functions:Scheduling Functions at Custom Frequencies>`.
tr_tr: TimedRobot'ta ``addPeriodic()``aracılığıyla robot döngüsünden daha sık programlama işlevleri için destek eklendi. Daha önce, ekipler geri bildirim denetleyicilerini 20 ms'lik TimedRobot döngü süresinden daha sık çalıştırmak için bir Bildirici yapmak zorundaydı (TimedRobot'u bundan daha sık çalıştırmak önerilmez). Artık kullanıcılar geri besleme denetleyicilerini ana robot döngüsünden daha sık çalıştırabilir, ancak TimedRobot periyodik işlevleriyle eşzamanlı olarak iş parçacığı güvenliği sorunu yaşamaz. Bir örneğe bakın :ref:`here <docs/software/convenience-features/scheduling-functions:Scheduling Functions at Custom Frequencies>`.

source: Added a ``toggle()`` function to Solenoid and DoubleSolenoid.
he_il: נוספה הפונקציה ``toggle()`` עבור Solenoid ו-DoubleSolenoid.
tr_tr: Solenoid ve Çift Solenoid'e ``toggle()``işlevi eklendi.

source: Added a ``SpeedControllerGroup`` constructor that takes a ``std::vector<>`` (C++) / ``SpeedController[]`` (Java), allowing the list to be constructed dynamically. (Teams shouldn't use this directly. This is only intended for bindings in languages like Python.)
tr_tr: Listenin dinamik olarak oluşturulmasına izin veren bir ``std::vector<>`` (C++) / ``SpeedController[]`` (Java)alan bir ``SpeedControllerGroup`` kurucusu eklendi. (Ekipler bunu doğrudan kullanmamalıdır. Bu yalnızca Python gibi dillerdeki bağlamalar için tasarlanmıştır.)

source: Added methods (``isOperatorControlEnabled()`` and ``isAutonomousEnabled()``) to check game and enabled state together.
he_il: נוספו פעולות (``isOperatorControlEnabled()`` ו-``isAutonomousEnabled()``) כדי לבדוק את מצב ההפעלה והמשחק יחד.
tr_tr: Oyunu ve etkin durumu birlikte kontrol etmek için yöntemler (``isOperatorControlEnabled()`` ve ``isAutonomousEnabled()``) eklendi.

source: Added a ``ScopedTracer`` class for C++ teams to be able to time pieces of code. Simply instantiate the ``ScopedTracer`` at the top of a block of code and the time will be printed to the console when the instance goes out of scope.
tr_tr: C ++ ekiplerinin kod parçalarını zamanlayabilmeleri için bir ``ScopedTracer``sınıfı eklendi. Basitçe bir kod bloğunun üstündeki ``ScopedTracer`` ı somutlaştırın ve örnek kapsam dışına çıktığında zaman konsola yazdırılacaktır.

source: Added a static method ``fromHSV(int h, int s, int v)`` to create a ``Color`` instance from HSV values.
he_il: נוספה הפעולה הסטטית ``fromHSV(int h, int s, int v)`` ליצירת מופע ``Color`` מערכי HSV.
tr_tr: HSV değerlerinden bir ``Color`` örneği oluşturmak için ``fromHSV(int h, int s, int v)`` statik bir yöntem eklendi.

source: Added RT priority constructor to ``Notifier`` in C++. This makes the thread backing the Notifier run at real-time priority, reducing timing jitter.
tr_tr: C++ 'da ``Notifier`` 'a RT öncelik oluşturucusu eklendi. Bu, Notifier’ı destekleyen iş parçacığının gerçek zamanlı öncelikte çalışmasını sağlayarak zamanlama seğirmesini azaltır.

source: Added a ``DriverStation.getInstance().isJoystickConnected(int)`` method to check if a joystick is connected to the Driver Station.
he_il: נוספה הפעולה ``DriverStation.getInstance().isJoystickConnected(int)`` כדי לבדוק אם ג׳ויסטיק מחובר ל-Driver Station.
tr_tr: Driver Station'a bir joystick'in bağlı olup olmadığını kontrol etmek için bir ``DriverStation.getInstance().isJoystickConnected(int)`` yöntemi eklendi.

source: Added a ``DriverStation.getInstance().silenceJoystickConnectionWarning(boolean)`` method to silence the warning when a joystick is not connected. This setting has no effect (i.e. warnings will continue to be printed) when the robot is connected to a real FMS.
he_il: נוספה הפעולה ``DriverStation.getInstance().silenceJoystickConnectionWarning(boolean)`` כדי להשתיק את האזהרה כאשר ג׳ויסטיק אינו מחובר. להגדרה זו אין כל השפעה (לדוגמא, אזהרות ימשיכו להיות מודפסות) כאשר הרובוט מחובר ל-FMS אמיתי.
tr_tr: Bir joystick bağlı olmadığında uyarıyı susturmak için ``DriverStation.getInstance().silenceJoystickConnectionWarning(boolean)``yöntemi eklendi. Robot gerçek bir FMS'ye bağlandığında bu ayarın hiçbir etkisi yoktur (yani uyarılar yazdırılmaya devam edecektir).
