Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/yearly-overview/yearly-changelog.po
Languages: es_mx, fr_ca, he_il, tr_tr

source: New for 2025
es_mx: Nuevo para 2025

source: A number of improvements have been made to FRC\ |reg| Control System software for 2025. This article will describe and provide a brief overview of the new changes and features as well as a more complete changelog for Java/C++ WPILib changes. This document only includes the most relevant changes for end users, the full list of changes can be viewed on the various `WPILib <https://github.com/wpilibsuite/>`__ GitHub repositories.
es_mx: Un gran numero de mejoras se han hecho para el \ |reg| Software del sistema del control de 2025 para FRC. Este articulo describirá y proveerá un breve resumen de los nuevos cambios y funcionalidades, también un changelog más completo para los cambios de Java/C++ WPILib changes. Este documento solo incluye los cambios más relevantes para los usuarios, la lista completa de cambios puede ser vista en los repositorios de GitHub `WPILib <https://github.com/wpilibsuite/>`__

source: It's recommended to also review the list of :doc:`known issues <known-issues>`.
es_mx: Se recomienda revisar también la lista de :doc:`known issues <known-issues>`.
fr_ca: Il est recommandé de consulter également la liste des :doc:`problèmes connues <known-issues>`.

source: Importing Projects from Previous Years
es_mx: Importar proyectos de años anteriores

source: Major Changes (Java/C++)
es_mx: Cambios importantes (Java/C++)
fr_ca: Changements majeurs (Java/C++)

source: These changes contain *some* of the major changes to the library that it's important for the user to recognize. This does not include all of the breaking changes, see the other sections of this document for more changes.
es_mx: Estos cambios contienen *algunos* de los principales cambios en la biblioteca que es importante que el usuario reconozca. Esto no incluye todos los cambios de ruptura, ver las otras secciones de este documento para más cambios.
fr_ca: Ces changements contiennent *certains* des changements majeurs apportés à la bibliothèque qu'il est important que l'utilisateur reconnaisse. Cela n'inclut pas toutes les modifications de rupture, consultez les autres sections de ce document pour plus de modifications.

source: The Dependency Manager in VS Code will help teams :doc:`discover and install vendordeps </docs/software/vscode-overview/3rd-party-libraries>`.
es_mx: El Manager de Dependencias de VS Code ayudara a equipos :doc:`descubrir e instalar vendordeps </docs/software/vscode-overview/3rd-party-libraries>`.

source: Added :doc:`Elastic Dashboard </docs/software/dashboards/elastic>` a driver focused dashboard.
es_mx: Añadido :doc:`Elastic Dashboard </docs/software/dashboards/elastic>` una dashboard enfocada para los drivers.

source: Added :doc:`annotation based logging (Epilogue) </docs/software/telemetry/robot-telemetry-with-annotations>` for Java
es_mx: Agregado :doc:`Loggeo basado en anotación (Epilogue) </docs/software/telemetry/robot-telemetry-with-annotations>` para Java

source: Added :doc:`WPIcal </docs/software/wpilib-tools/wpical/index>` tool for calibrating FRC Apriltags to correct for field setup error
es_mx: Agregado :doc:`WPIcal</docs/software/wpilib-tools/wpical/index>` herramienta para calibrar Apriltags de FRC para corregir la configuración de la cancha

source: The :doc:`Java units library </docs/software/basic-programming/java-units>` has been refactored to have unit-specific measurement classes instead of a single generic ``Measure`` class. The new measurement classes have clearer names (``Distance`` instead of ``Measure<Distance>``, or ``LinearAcceleration`` instead of ``Measure<Velocity<Velocity<Distance>>>``), and implement math operations to return the most specific result types possible instead of a wildcard ``Measure<?>``.
es_mx: La :doc:`Librería de unidades de Java </docs/software/basic-programming/java-units>` ha sido refactorizado para tener clases de medidas especificas de unidades, en vez una clase genérica ``Measure``. La nueva clase de medida tiene nombres más claros(``Distance`` en vez de ``Measure<Distance>``, o ``LinearAcceleration`` en lugar de ``Measure<Velocity<Velocity<Distance>>>``), e implementadas operaciones matemáticas para que regresen los resultamos más especificos posibles en vez de uno aleatorio ``Measure<?>``.

source: Add :doc:`persistent alerts API </docs/software/telemetry/persistent-alerts>`. Alerts are displayed on supported dashboards such as Shuffleboard and Elastic.
es_mx: Agregado :doc:`API de alertas persistentes</docs/software/telemetry/persistent-alerts>`. Las alertas son mostradas y tienen soporte de dashboards, tales como Shuffleboard y Elastic

source: Add :ref:`LED pattern API <docs/software/hardware-apis/misc/addressable-leds:LED Patterns>` for easily animating addressable LEDs
es_mx: Agregado :ref:`API patrón de LED <docs/software/hardware-apis/misc/addressable-leds:LED Patterns>` para animar fácilmente a las LEDs

source: Java 17 must be used as Java Source and Target compatibility have been bumped to Java 17. Java 17 has been used since 2023.
es_mx: Se debe utilizar Java 17 ya que la compatibilidad de origen y destino de Java se ha ampliado a Java 17. Java 17 se utiliza desde 2023.

source: Supported Operating Systems and Architectures:
es_mx: Sistemas operativos y arquitecturas compatibles:

source: Windows 10 & 11, 64 bit only. 32 bit and Arm are not supported
es_mx: Windows 10 y 11, solo de 64 bits. No son compatibles 32 bits y Arm.

source: Ubuntu 22.04 & 24.04, 64 bit. Other Linux distributions with glibc >= 2.34 may work, but are unsupported
es_mx: Ubuntu 22.04 & 24.04, 64 bit. Otras distribuciones de Linux con glibc >= 2.34 pueden funcionar, pero no tienen soporte

source: macOS 13.3 or higher, both Intel and Arm.
es_mx: macOS 13.3 o superior, tanto Intel como Arm.

source: The following OSes are no longer supported: macOS 12 or earlier, Ubuntu 18.04 & 20.04, Windows 7, Windows 8.1, and any 32-bit Windows.
es_mx: Los siguientes sistemas operativos ya no tendrán soporte: macOS 12 o anteriores, Ubuntu 18.04 & 20.04, Windows 7, Windows 8.1, y cualquier 32-bit Windows.

source: `Windows 10 support from Microsoft will end in October 2025 <https://www.microsoft.com/en-us/windows/end-of-support>`__. We intend to continue supporting Windows 10 through the 2026 season, but may have to drop support in 2027. Teams should start planning their upgrade path to Windows 11.
es_mx: `Soporte de Windows 10 de Microsoft terminara en Octubre del 2025 <https://www.microsoft.com/en-us/windows/end-of-support>`__. Tenemos la intención de continuar el soporte de Windows 10 por la temporada de 2026, pero es posible que tengamos que dejar de brindar soporte en 2027. Los equipos deberían empezar a actualizar a Windows 11.

source: General Library
es_mx: Librería General
fr_ca: Librairies générales
he_il: הספרייה הכללית
tr_tr: Genel Kütüphane

source: Add persistent alerts API. Alerts are displayed on supported dashboards such as Shuffleboard and Elastic.
es_mx: Agregado API de alertas persistentes. Las alertas se muestran en dashboards como Shuffleboard o Elastic.

source: Add LED pattern API for easily animating addressable LEDs
es_mx: Agregado API de patrón de LED para animar fácilmente las LEDs

source: Breaking: Remove deprecated ``Gyro`` and ``Accelerometer`` interface
es_mx: Importante: Eliminada la interfaz deprecada de ``Gyro`` y``Accelerometer``

source: Breaking: Remove deprecated ``Notifier.SetHandler`` function
es_mx: Importante: Eliminada la función deprecada ``Notifier.SetHandler``

source: Remove ``RobotInit`` usage in examples. Use constructor instead. RobotInit may be deprecated in the future.
es_mx: Removido el uso de ``RobotInit`` en ejemplos. Use el constructor en vez. RobotInit puede que sea deprecada en el futuro.

source: Deprecate ``AxisCamera``
es_mx: Deprecada ``AxisCamera``

source: C++: Add ``FRC_ReportWarning``
es_mx: C++: Agregado ``FRC_ReportWarning``

source: Implement ``Sendable`` for HID classes
es_mx: Implementado ``Sendable`` para clases HID

source: ``GenericHID.setRumble``: Fix Java integer overflow
es_mx: ``GenericHID.setRumble``: Arreglado Java integer overflow

source: Rename SysId example to SysIdRoutine
es_mx: Renombrado ejemplo SysId a SysIdRoutine

source: Add ``Timer.isRunning`` method
es_mx: Agregado método ``Timer.isRunning``

source: Add Java unit support for RobotController
es_mx: Agregado soporte para Java unit para RobotController

source: Add a functional interface for MecanumDriveMotorVoltages and deprecate old interface
es_mx: Agregada una interfaz funcional para MecanumDriveMotorVoltages y la interfaz vieja fue deprecada

source: Add ``Koors40`` Motor Controller
es_mx: Agregado controlador de motor ``Koors40``

source: 2025.2.1: Add 2025 field image and april tag map
es_mx: 2025.2.1: Agregada imagen de la cancha 2025 y mapa de las April Tags

source: Commands
es_mx: Comandos

source: Breaking: Remove deprecated ``CommandBase``
es_mx: Importante: Eliminada la función deprecada ``CommandBase``

source: Remove deprecated ``TrapzoidProfileCommand`` API
es_mx: Eliminada la API deprecada ``TrapzoidProfileCommand``

source: Breaking: Remove deprecated C++ method ``TransferOwnership``
es_mx: Importante: Eliminado el método C++ deprecado ``TransferOwnership``

source: Deprecate ``PIDCommand``, ``PIDSubsystem``, ``ProfiledPIDCommand``, ``ProfiledPIDSubsystem``, ``TrapezoidProfileSubsystem``
es_mx: Deprecado ``PIDCommand``, ``PIDSubsystem``, ``ProfiledPIDCommand``, ``ProfiledPIDSubsystem``, ``TrapezoidProfileSubsystem``

source: Deprecate ``TrapezoidProfileCommand``. Use :doc:`TrapezoidProfile Directly </docs/software/commandbased/profile-subsystems-commands>`
es_mx: Deprecado ``TrapezoidProfileCommand``. Utilize :doc:`TrapezoidProfile directamente</docs/software/commandbased/profile-subsystems-commands>`

source: Cache controller ``BooleanEvents`` / ``Triggers`` and directly construct ``Triggers``, fixing issues if ``BooleanEvents`` / ``Triggers`` are created in loops
es_mx: Controlador de cache ``BooleanEvents`` / ``Triggers`` y constructor ``Triggers``, arreglando problemas si ``BooleanEvents`` / ``Triggers`` son creadas en loops

source: Add deadband trigger methods to ``CommandGenericHID``
es_mx: Agregado método trigger deadband a ``CommandGenericHID``

source: Make requirements private
es_mx: Hecho requisitos privados

source: Add ``setRumble`` and ``isConnected`` to ``CommandGenericHID``
es_mx: Agregado ``setRumble`` y ``isConnected`` a ``CommandGenericHID``

source: Add ``StartRun`` command factory
es_mx: Agregado ``StartRun`` a la fabrica de comandos

source: Rename ``deadlineWith`` to ``deadlineFor``
es_mx: Renombrado ``deadlineWith`` a ``deadlineFor``

source: Fix double composition error message truncation
es_mx: Arreglado el truncamiento de mensajes de error de doble composición

source: Add ``withDeadline`` modifier
es_mx: Agregado modificador ``withDeadline``

source: Client: only connect to IPv4 addresses
es_mx: Cliente: Solo se conecta a direcciones IPv4

source: Deprecate setNetworkTablesFlushEnabled
es_mx: Deprecado setNetworkTablesFlushEnabled

source: Set NetworkTables 3 client network identity
es_mx: Seteado identidad del cliente de NetworkTables 3

source: Data Logging
es_mx: Registro de datos

source: Logging the console can be enabled with ``DatalogManager.logConsoleOutput``
es_mx: Registro de consola puede ser habilitado con ``DatalogManager.logConsoleOutput``

source: DataLog: Add last value and change detection
es_mx: DataLog: Agregado ultimo valor y detección de cambio

source: DataLogManager: Fix behavior when low on space
es_mx: DataLogManager: Arreglada conducta cuando se tiene espacio bajo

source: Epilogue: Autogenerate nicer data names by default, not just raw element names
es_mx: Epilogue: Autogenera mejores nombres de datos por default, no solo nombres crudos de elementos

source: Hardware interfaces
es_mx: Interfaces de hardware

source: Breaking: Rewrite ``DutyCycleEncoder`` and ``AnalogEncoder`` to simplify and remove rollover detection that was broken
es_mx: Importante: Reescrito ``DutyCycleEncoder`` y ``AnalogEncoder`` para simplificar y quitar detección de vuelco que estaba rota

source: Add ``getVoltage`` to ``PWMMotorController``
es_mx: Agregado ``getVoltage`` a ``PWMMotorController``

source: Add support for Sharp IR sensors
es_mx: Agregado soporte para sensores Sharp IR

source: Fix edge cases of CAN ID validation and reporting for CTRE and REV devices
es_mx: Arreglado casos de validación de CAN ID y reportaje para dispositivos CTRE y REV

source: Report Radio LED state
es_mx: Reporte de estado de las LEDS de la Radio

source: Correct maximum length of DS console send
es_mx: Corregida la longitud máxima de la consola de la DS

source: C++: Refactor AnalogTrigger to use shared_ptr
es_mx: C++: Refactorizado AnalogTrigger para usar shared_ptr

source: Add ``RobotController.GetCommsDisableCount()``
es_mx: Agregado ``RobotController.GetCommsDisableCount()``

source: Fix REV PH disabled solenoid list
es_mx: Arreglado REV PH lista de solenoides desabilidata

source: remove CANDeviceInterface
es_mx: Eliminado CANDeviceInterface

source: Refactor and clean up ADIS IMU classes
es_mx: Refactorizada y limpieza de clases ADIS IMU

source: Propagate ``PWMMotorController`` ``stopMotor()`` and ``disable()`` to followers
es_mx: Propagado ``PWMMotorController`` ``stopMotor()`` y ``disable()`` a seguidores

source: ``Compressor``: Add more Sendable data
es_mx: ``Compressor``: Agregada más datos enviables

source: Fix ``PowerDistribution.GetAllCurrents()``
es_mx: Arreglado ``PowerDistribution.GetAllCurrents()``

source: Fix ``AsynchronousInterrupt``
es_mx: Arreglado ``AsynchronousInterrupt``

source: Breaking: Remove deprecated TrapezoidProfile constructors
es_mx: Importante: Eliminado constructor TrapezoidProfile deprecado

source: Breaking: Remove deprecated MatBuilder factory
es_mx: Importante: Eliminado MatBuilder factory deprecado

source: Deprecate ``RamseteController``. Use ``LTVUnicycleController`` instead
es_mx: Deprecado ``RamseteController``. Use ``LTVUnicycleController`` en vez

source: Breaking: Remove deprecated ``MatBuilder`` constructor. Use ``MatBuilder.fill`` instead
es_mx: Eliminado: Elimado constructor deprecado ``MatBuilder``. Use ``MatBuilder.fill`` en vez

source: Discretize ``SimpleMotorFeedForward``, ``ArmFeedForward`` and ``ElevatorFeedForward``
es_mx: Discretizado ``SimpleMotorFeedForward``, ``ArmFeedForward`` y ``ElevatorFeedForward``

source: ``SwerveDrivePoseEstimator``: Fix stationary module emitting error when calculating angle
es_mx: ``SwerveDrivePoseEstimator``: Arreglado modulo estacionario emitiendo error calculando ángulo

source: Add ``DCMotor.getCurrent()`` overload accepting torque
es_mx: Agregada sobrecarga ``DCMotor.getCurrent()`` aceptando torque

source: Add ``cosineScale`` method to ``SwerveModuleState`` and instance optimize
es_mx: Agregado método ``cosineScale`` a ``SwerveModuleState`` para optimizar instancias

source: Make trajectory constraints use ``Rectangle2d`` and ``Ellipse2d``
es_mx: Hecho que limitantes de trayectorias usen ``Rectangle2d`` y ``Ellipse2d``

source: Add Protobuf and Struct support to many more classes
es_mx: Agregado soporte para Protobuf y Struct para muchas más clases

source: Add ``getAccumulatedError()`` to ``PIDController``
es_mx: Agregado ``getAccumulatedError()`` a ``PIDController``

source: Remove ``WheelPositions`` interface/concept
es_mx: Eliminado ``WheelPositions`` interfaz/concepto

source: Add ``kinematics.copyInto()``
es_mx: Agregado ``kinematics.copyInto()``

source: Add geometry classes for ``Rectangle2d`` and ``Ellipse2d``
es_mx: Agregada clases geométrica para ``Rectangle2d`` y ``Ellipse2d``

source: Add reset methods to ``Odometry`` and ``PoseEstimator``
es_mx: Agregado métodos de reinicio a ``Odometry`` y ``PoseEstimator``

source: Add ArmFeedforward calculate() overload that takes current and next velocity instead of acceleration
es_mx: Agregado ArmFeedforward calculate() sobrecarga que toma la corriente y la siguiente velocidad en vez de la aceleración

source: Fix C++ pose estimator poseEstimate initialization
es_mx: Arreglada la inicialización de poseEstimate del estimador de pose de C++

source: Add time-varying RKDP
es_mx: Agregado variador de tiempo RKDP

source: Add 2D to 3D geometry constructors
es_mx: Agregados constructores de geometría 2D a 3D

source: 2025.2.1: Implement Translation3d.RotateAround
es_mx: 2025.2.1: Implementada Translation3d.RotateAround

source: Simulation
es_mx: Simulación
he_il: סימולציה
tr_tr: Simülasyon

source: Breaking: Remove gearing input from ``FlywheelSim`` and ``DCMotorSim`` and calculate from the LinearSystem and DCMotor inputs
es_mx: Importante: Eliminado input de gearing de ``FlywheelSim`` y ``DCMotorSim`` y calculate de las entradas LinearSystem y DCMotor

source: Add ``SendableChooserSim``
es_mx: Agregado ``SendableChooserSim``

source: Fix Java sim timing on Windows
es_mx: Arreglado timing de simulación de Java en Windows

source: Fix interrupt edges being flipped in sim
es_mx: Arreglado que los bordes de interrupción sean volteados en sim

source: Don't send joystick data during auto
es_mx: No envía datos del joystick en autónomo

source: Initialize DIO to true in sim
es_mx: Inicializar DIO a verdadero en simulación

source: Fix: Update FMS widget when real DS is connected
es_mx: Arreglado: Actualizado widget FMS cuando la DS real este conectada

source: XRP: Add ``GetRotation2d`` to ``Gyro``
es_mx: XRP: Agregado ``GetRotation2d`` a ``Gyro``

source: XRP: Add Support for Encoder Period
es_mx: XRP: Agregado soporte para Encoder periódico

source: XRP: Add ``GetLED`` to ``OnBoardIO``
es_mx: XRP: Agregada ``GetLED`` a ``OnBoardIO``

source: XRP & Romi: Changed applicable C++ methods to use units library
es_mx: XRP y Romi: Cambiado métodos aplicables de C++ para utilizar unidades de la librería

source: Java units
es_mx: Unidades de Java

source: Add resistance units
es_mx: Añadidas unidades de resistencia

source: Use div instead of divide
es_mx: Utilice div en lugar de divide

source: Update to OpenCV 4.10.0
es_mx: Actualice a OpenCV 4.10.0

source: HttpCamera: Auto-detect mode from stream if not set
es_mx: HttpCamera: Modo de auto detección del stream si no esta puesto

source: Breaking: Remove ``RuntimeLoader``
es_mx: Importante: Eliminado ``RuntimeLoader``

source: Deprecate ``RuntimeDetector``
es_mx: Deprecado ``RuntimeDetector``

source: WPILib has a new logo.
es_mx: WPILib tiene un nuevo logo

source: WPILib Logo
es_mx: Logo de WPILib

source: Expose orientation property for NumberSlider
es_mx: Expuesta propiedad de orientación para NumberSlider

source: Add :doc:`persistent alerts widget </docs/software/telemetry/persistent-alerts>`
es_mx: Agregado :doc:`widget the alertas persistentes</docs/software/telemetry/persistent-alerts>`

source: Correct FieldData de/serialization
es_mx: Corregida FieldData de/serialization

source: 2025.2.1: Add 2025 field image
es_mx: 2025.2.1: Agregada imagen de la cancha de 2025

source: SmartDashboard is not supported on Apple Silicon (Arm64) Macs.
es_mx: SmartDashboard no es compatible con Macs Apple Silicon (Arm64).

source: SmartDashboard is deprecated and will be removed for 2027 due to its usage of Network Tables v3. Users can find :doc:`additional modern dashboard options here </docs/software/dashboards/dashboard-intro>`
es_mx: SmartDashboard esta deprecada y será eliminada para 2027 debido a su uso de Network Tables v3. Usuarios pueden encontrar :doc:`opciones modernas de dashboard aqui</docs/software/dashboards/dashboard-intro>`

source: No changes other than build updates were made to SmartDashboard
es_mx: No han habido cambios mas que actualizaciones de compilador fueron creados para la SmartDashboard

source: Align Field2d border and image padding for custom images
es_mx: Alineado borde de Field2d e relleno de imagen para imágenes personalizadas

source: Add Alerts widget
es_mx: Agregado widget de alertas

source: Fix minimum widget width
es_mx: Arreglado ancho mínimo del widget

source: 2025.2.1: Make picking a Field2d field JSON more obvious
es_mx: 2025.2.1: Hecho seleccionar una cancha de Field2d JSON mas obvio

source: Use Gradle 8.11
es_mx: Utilice Gradle 8.11

source: Use shell scripts for launching tools on Linux / macOS, since macOS doesn't ship Python any more
es_mx: Utilize scripts de shell para lanzar herramientas en Linux / macOS, desde que macOS ya no incluye python

source: Gradle now consolidates Java compile errors at the bottom of the terminal to aid discoverability https://docs.gradle.org/8.11/release-notes.html#error-warning
es_mx: Gradle ahora consolida errores del compilador de Java en la parte inferior de la terminal para ayudar a su descubrimiento https://docs.gradle.org/8.11/release-notes.html#error-warning

source: WPILib All in One Installer
es_mx: Instalador de WPILib todo en uno
fr_ca: WPILib au complet dans un seul installateur

source: Update to VS Code 1.96.2
es_mx: Actualización a VS Code 1.96.2

source: VS Code extension updates: cpptools 1.23.2, javaext 1.38
es_mx: Actualizaciones de las extensiones de VS Code: cpptools 1.23.2, javaext 1.38

source: Only install scripts if they are used by a specific platform
es_mx: Solo instale scripts si estos son utilizados por una plataforma especifica

source: Make shortcuts use the app icon
es_mx: Haga atajos usando el icono de la app

source: Add AppArmor file for electron apps for Ubuntu 24.04, which must be :ref:`manually installed <docs/zero-to-robot/step-2/wpilib-setup:Post-Installation>`
es_mx: Agregado archivo AppArmor para apps de electron para Ubuntu 24.04, las cuales deben ser :ref:`instaladas manualmente <docs/zero-to-robot/step-2/wpilib-setup:Post-Installation>`

source: Add :doc:`Dependency Manager extension </docs/software/vscode-overview/3rd-party-libraries>` for easier finding and updating of 3rd party libraries
es_mx: Agregada :doc:`Extensión de control de dependencias</docs/software/vscode-overview/3rd-party-libraries>` para encontrar fácilmente y actualizar librerías de terceros

source: Add gradle clean command
es_mx: Agregado comando de limpieza de gradle

source: Add option to importer to import XRP project
es_mx: Agregada opción para importar proyectos XRP

source: Importer: Update for Java Units changes
es_mx: Importador: Actualizado para cambios de Units Java

source: Extract WPILib Utility on mac
es_mx: Extraída Utilidad WPIlib en mac

source: Define java.configuration.runtimes in settings.json to ensure WPILib JDK is used
es_mx: Definida java.configuration.runtimes en settings.json para asegurarse que JDK de WPILib sea usada

source: Improve intellisense by hiding items not likely to be used in Robot Programs
es_mx: Mejorada IntelliSense al esconder útiles que son improbables de ser utilizados en programas de robot

source: Remove robotInit in favor of Robot constructor
es_mx: Removido robotInit en favor de constructor de Robot

source: Fix crash when all data is filtered out during analysis
es_mx: Arreglado el crasheo cuando todos los datos se filtran durante el análisis.

source: Remove obsolete WPILib & CTRE presets, rename CTRE presets
es_mx: Removido ajustes preestablecidos obsoletos de WPILib y CTRE, renombrado a preestablecidos CTRE

source: Clamp feedback measurement delay to zero or higher
es_mx: Retardo de medición de retroalimentación de fijación a cero o superior
