Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-operator-interface-to-command.po
Languages: es_mx, fr_ca, zh_cn

source: Connecting the Operator Interface to a Command
es_mx: Conectando la Interfaz del Operador a un Comando
fr_ca: Connexion de l'interface opérateur à une commande
zh_cn: 将操作界面连接到指令

source: Commands handle the behaviors for your robot. The command starts a subsystem to some operating mode like raising and elevator and continues running until it reaches some setpoint or timeout. The command then handles waiting for the subsystem to finish. That way commands can run in sequence to develop more complex behaviors.
es_mx: Los comandos manejan los comportamientos de su robot. El comando inicia un subsistema para algunos modos de operación como subir un elevador y que continúe ejecutándose hasta que alcanza algún punto de ajuste o tiempo de espera. El comando entonces se encarga de esperar a que el subsistema termine. De esta manera los comandos pueden ejecutarse en secuencia para desarrollar comportamientos más complejos.
fr_ca: Les commandes gèrent les comportements de votre robot. La commande démarre un sous-système dans un mode de fonctionnement comme l'élévation et continue de fonctionner jusqu'à ce qu'il atteigne un certain point de consigne ou un certain délai. La commande gère ensuite l'attente de la fin du sous-système. De cette façon, les commandes peuvent s'exécuter en séquence pour développer des comportements plus complexes.
zh_cn: 指令控制机器人的行为。该指令将子系统启动到某种操作模式，例如提升和升降舵，并继续运行，直到达到某个设定点或超时。然后，该命令将处理等待子系统完成的过程。这样，指令可以依次运行以开发更复杂的行为。

source: RobotBuilder will also generate code to schedule a command to run whenever a button on your operator interface is pressed. You can also write code to run a command when a particular trigger condition has happened.
es_mx: RobotBuilder también generará un código para programar un comando que se ejecute siempre que un botón en la interfaz del operador es presionado. También puede escribir un código para ejecutar un comando cuando una determinada condición del gatillo haya sucedido.
fr_ca: RobotBuilder générera également du code pour planifier l'exécution d'une commande chaque fois qu'un bouton de votre interface opérateur est enfoncé. Vous pouvez également écrire du code pour exécuter une commande lorsqu'une condition de déclenchement particulière s'est produite.
zh_cn: 每当按下操作界面上的按钮时，RobotBuilder还将生成代码以调度指令运行。您还可以编写代码以在发生特定触发条件时运行指令。

source: Run a Command with a Button Press
es_mx: Ejecutar un Comando con la Pulsación de un Botón.
fr_ca: Exécuter une commande en appuyant sur un bouton
zh_cn: 按下按钮运行指令

source: In this example we want to schedule the "Close Claw" command to run whenever the dpad right direction button is pressed on a logitech gamepad (button 6) is pressed.
es_mx: En este ejemplo queremos programa el comando "Close Claw" para ejecutar cada vez que se presiona el botón de dirección derecha en un gamepad logitech (botón 6).
fr_ca: Dans cet exemple, nous voulons planifier l'exécution de la commande "Close Claw" chaque fois que le bouton de direction droit de la croix directionnelle ou dpad est appuyé, sur une manette de jeu logitech (bouton 6) est pressé.
zh_cn: 在此示例中，我们希望安排“Close Claw”指令在按下 Logitech 游戏手柄（按钮 6）上的 dpad 右方向按钮时运行。

source: The command to run is called "Close Claw" and its function is to close the claw of the robot
es_mx: El comando para ejecutar se llama "Close Claw" y su función es cerrar la garra del robot
fr_ca: La commande à exécuter est appelée "Close Claw" et sa fonction est de fermer la pince du robot
zh_cn: 运行的指令叫做“Close Claw”，它的作用是关闭机器人的爪子

source: Notice that the command requires the Claw subsystem. This will ensure that this command starts running even if there was another operation happening at the same time that used the claw. In this case the previous command would be interrupted.
es_mx: Tenga en cuenta que el comando requiere el subsistema Claw. Esto asegurará que este comando comience a ejecutarse incluso si hubo otra operación al mismo tiempo que usó la garra. En este caso se interrumpiría el comando anterior.
fr_ca: Notez que la commande nécessite le sous-système Claw. Cela garantira que cette commande commencera à s'exécuter même si une autre opération utilisait au même moment les ressources de la pince. Dans ce cas, la commande précédente serait interrompue.
zh_cn: 请注意，该指令需要 Claw 子系统。这将确保即使在使用爪的同时发生另一个操作时，该指令也开始运行。在这种情况下，先前的指令将被中断。

source: Parameters make it possible for one command to do multiple things; presets let you define values you pass to the command and reuse them
es_mx: Los parámetros hacen posible que un comando haga múltiples cosas; los preajustes permiten definir los valores que se pasan al comando y reutilizarlos.
fr_ca: Les paramètres permettent à une commande de faire plusieurs choses; les préréglages vous permettent de définir les valeurs que vous passez à la commande et de les réutiliser
zh_cn: 参数使一个指令可以执行多项操作。预设让您定义传递给指令的值并重复使用它们

source: Adding the Joystick to the Robot Program
es_mx: Añadiendo el Joystick al Programa del Robot.
fr_ca: Ajout du joystick au programme Robot
zh_cn: 将操纵杆添加到机器人程序

source: Add the joystick to the robot program
es_mx: Añadir el joystick al programa del robot
fr_ca: Ajoutez le joystick au programme du robot
zh_cn: 将操纵杆添加到机器人程序

source: Drag the joystick to the Operator Interface folder in the robot program
es_mx: Arrastre el joystick a la carpeta de la Interfaz del Operador en el programa del robot.
fr_ca: Faites glisser le joystick vers le dossier Interface opérateur dans le programme du robot
zh_cn: 将操纵杆拖到机器人程序中的“操作员界面”文件夹中

source: Name the joystick so that it reflects the use of the joystick and set the USB port number
es_mx: Nombre el joystick para que refleje el uso del mismo y establezca el número del puerto USB.
fr_ca: Nommez le joystick en utilisant un nom significatif et définissez le numéro de port USB
zh_cn: 命名操纵杆，以使其能反映操纵杆的用途，并设置USB端口号

source: Linking a Button to the "Move Elevator" Command
es_mx: Vincular un Botón al Comando "Move Elevator"
fr_ca: Faire un lien entre un bouton et la commande "Move Elevator"
zh_cn: 将按钮链接到“移动电梯”指令

source: Add the button that should be pressed to the program
es_mx: Añada el botón que debe ser presionado al programa
fr_ca: Ajoutez le bouton dans le programme
zh_cn: 将应当被按下的按钮添加到程序中

source: Drag the joystick button to the Joystick (Logitech Controller) so that it's under the joystick
es_mx: Arrastre el botón del joystick al Joystick (controlador Logitech) para que quede debajo del joystick
fr_ca: Faites glisser le bouton joystick sur le Joystick (Logitech Controller) de sorte qu’il soit sous le joystick
zh_cn: 将操纵杆按钮拖到操纵杆（罗技控制器）上，使其位于操纵杆下方

source: Set the properties for the button: the button number, the command to run when the button is pressed, parameters the command takes, and the "When to run" property to "whenPressed" to indicate that the command should run whenever the joystick button is pressed.
es_mx: Establezca las propiedades del botón: el número del botón, el comando para ejecutar cuando el botón es presionado, los parámetros que toma el comando, y la propiedad "When to run" para ejecutar "whenPressed" para indicar que el comando debe ejecutarse siempre que el botón del joystick es presionado.
fr_ca: Définissez les propriétés du bouton: le numéro du bouton, la commande à exécuter lorsque le bouton est enfoncé, les paramètres que la commande prend et la propriété "When to run" à "whenPressed" pour indiquer que la commande doit s'exécuter chaque fois que le bouton du joystick est pressé.
zh_cn: 设置按钮的属性：按钮编号，按下按钮时要运行的指令，该指令所采用的参数以及将 "When to run" 属性设置为 "whenPressed"，以指示每当操纵杆按钮按下时该指令应运行按下。

source: Joystick buttons must be dragged to (under) a Joystick. You must have a joystick in the Operator Interface folder before adding buttons.
es_mx: Los botones del joystick deben ser arrastrados a (debajo de) un joystick en la carpeta de la Interfaz del Operador antes de añadir botones.
fr_ca: Les boutons du joystick doivent être glissés vers (sous) un joystick. Vous devez avoir un joystick dans le dossier Operator Interface avant d'ajouter des boutons.
zh_cn: 必须将操纵杆按钮拖到操纵杆上（下方）。添加按钮之前，操作员界面文件夹中必须存在有操纵杆。
