Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-overview.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: For more information see :doc:`Creating a Command <robotbuilder-creating-command>` and :ref:`Writing Command Code <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-command-code:Writing the Code for a Command>`.
es_mx: Para obtener más información, consulte :doc:`Creación de un comando <robotbuilder-creating-command>` y :ref:`Escritura del código de comando <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-command-code:Writing the Code for a Command>`.
fr_ca: Pour plus d’informations, voir :doc:`Creating a Command 1` et :ref:`Writing Command Code <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-command-code:Writing the Code for a Command>`.
tr_tr: Daha fazla bilgi için bakınız : doc: ` Bir Komut Oluşturma <robotbuilder-creating-command>` ve : ref: ` Komut Kodunu Yazma <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-command-code:Writing the Code for a Command>` .
zh_cn: 有关更多信息，请参见创建指令<robotbuilder-creating-command>和编写指令代码<docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-command-code:Writing the Code for a Command>。

source: Testing each Command
es_mx: Probar cada comando
fr_ca: Tester chaque commande
tr_tr: Her Komutu Test Etme
zh_cn: 测试每个命令

source: Each command can be run from Shuffleboard or SmartDashboard. This is useful for testing commands before you add them to the operator interface or to a command group. As long as you leave the "Button on SmartDashboard" property checked, a button will be created on the SmartDashboard. When you press the button, the command will run and you can check that it performs the desired action.
es_mx: Cada comando se puede ejecutar desde SmartDashboard. Esto es útil para probar comandos antes de agregarlos a la interfaz del operador o a un grupo de comandos. Siempre que deje marcada la propiedad "Botón en SmartDashboard", se creará un botón en SmartDashboard. Cuando presiona el botón de inicio, el comando se ejecutará y podrá verificar que realiza la acción deseada.
fr_ca: Chaque commande peut être exécutée à partir du Shuffleboard ou du SmartDashboard. Ceci est utile pour tester les commandes avant de les ajouter à l’interface de l’opérateur ou à un groupe de commandes. Tant que vous laissez la propriété "Button on SmartDashboard" cochée, un bouton sera créé sur le SmartDashboard. Lorsque vous appuyez sur le bouton de démarrage de la commande, la commande s’exécute et vous pouvez vérifier qu’elle effectue l’action souhaitée.
tr_tr: Her komut Shuffleboard veya SmartDashboard'dan çalıştırılabilir. Bu, komutları operatör arayüzüne veya bir komut grubuna eklemeden önce test etmek için kullanışlıdır. "Button on SmartDashboard" özelliğini işaretli bıraktığınız sürece, SmartDashboard'da bir düğme oluşturulur. Düğmeye bastığınızda, komut çalışacak ve istediğiniz eylemi gerçekleştirip gerçekleştirmediğini kontrol edebilirsiniz.
zh_cn: 每个指令都可以从 Shuffleboard 或 SmartDashboard 运行。这对于在将指令添加到操作员界面或指令组之前测试命令非常有用。只要您选中“SmartDashboard 上的按钮”属性，就会在 SmartDashboard 上创建一个按钮。当您按下按钮时，该指令将运行，您可以检查它是否执行了所需的操作。

source: By creating buttons, each command can be tested individually. If all the commands work individually, you can be pretty sure that the robot will work as a whole.
es_mx: Al crear botones, cada comando se puede probar individualmente. Si todos los comandos funcionan individualmente, puede estar bastante seguro de que el robot funcionará como un todo.
fr_ca: En créant des boutons, chaque commande peut être testée individuellement. Si toutes les commandes fonctionnent individuellement, vous pouvez être assez sûr que le robot fonctionnera dans son ensemble.
tr_tr: Düğmeler oluşturarak her komut ayrı ayrı test edilebilir. Tüm komutlar ayrı ayrı çalışıyorsa, robotun bir bütün olarak çalışacağından oldukça emin olabilirsiniz.
zh_cn: 通过创建按钮，可以分别测试每个指令。如果所有指令可以单独运行，则可以确定机器人将可以整体运行。

source: For more information see :doc:`Testing with Smartdashboard <robotbuilder-testing-with-shuffleboard>`.
es_mx: Para obtener más información, consulte :doc:`Testing with Smartdashboard <robotbuilder-testing-with-shuffleboard>`.
fr_ca: Pour plus d’informations, :doc:`Test avec Smartdashboard <robotbuilder-testing-with-shuffleboard>`.
tr_tr: Daha fazla bilgi için bkz :doc:`Testing with Smartdashboard <robotbuilder-testing-with-shuffleboard>`.
zh_cn: 有关更多信息，请参阅:doc:`使用 Smartdashboard 进行测试`。

source: Adding Operator Interface Components
es_mx: Adición de componentes de la interfaz del operador
fr_ca: Ajout de composants de l’Interface Opérateur
tr_tr: Operatör Arayüzü Bileşenlerinin Eklenmesi
zh_cn: 添加操作界面组件

source: The operator interface consists of joysticks, gamepads and other HID input devices. You can add operator interface components (joysticks, joystick buttons) to your program in RobotBuilder. It will automatically generate code that will initialize all of the components and allow them to be connected to commands.
es_mx: La interfaz del operador consta de joysticks, gamepads y otros dispositivos de entrada HID. Puede agregar componentes de interfaz de operador (joysticks, botones de joystick) a su programa en RobotBuilder. Generará automáticamente un código que inicializará todos los componentes y permitirá que se conecten a los comandos.
fr_ca: L’interface Opérateur se compose de joysticks, de gamepads et d’autres dispositifs d’entrée HID. Vous pouvez ajouter des composants d’interface opérateur (joysticks, boutons joystick) à votre programme dans RobotBuilder. Celui-ci générera automatiquement du code qui initialisera tous les composants et leur permettra d’être connectés aux commandes.
tr_tr: Operatör arayüzü, kumanda kollarından, oyun kumandalarından ve diğer HID giriş cihazlarından oluşur. RobotBuilder'daki programınıza operatör arayüzü bileşenleri (kumanda kolları, kumanda kolu düğmeleri) ekleyebilirsiniz. Tüm bileşenleri başlatacak ve komutlara bağlanmalarına izin verecek kodu otomatik olarak üretecektir.
zh_cn: 操作界面由操纵杆，手柄和其他HID输入设备组成。您可以在RobotBuilder中的程序中添加操作界面组件（操纵杆，操纵杆按钮）。它将自动生成将初始化所有组件并将其连接到特定的指令。

source: The operator interface components are dragged from the palette to the "Operator Interface" folder in the RobotBuilder program. First (1) add Joysticks to the program then put buttons under the associated joysticks (2) and give them meaningful names, like ShootButton.
es_mx: Los componentes de la interfaz del operador se arrastran desde la paleta a la carpeta "Interfaz del operador" en el programa RobotBuilder. Primero (1) agregue Joysticks al programa, luego coloque botones debajo de los joysticks asociados (2) y asígneles nombres significativos, como ShootButton.
fr_ca: Les composants de l’interface Opérateur sont déplacés de la palette vers le dossier"Operator Interface" dans le programme RobotBuilder. D’abord (1) ajouter des joysticks au programme, puis mettre des boutons sous les joysticks associés (2) et leur donner des noms significatifs, comme ShootButton.
tr_tr: Operatör arayüz bileşenleri paletten RobotBuilder programındaki "Operator Interface" klasörüne sürüklenir. Önce (1) programa Joystick'i ekleyin, ardından ilgili joysticklerin (2) altına düğmeler koyun ve bunlara ShootButton gibi anlamlı adlar verin.
zh_cn: 将操作界面组件从面板拖到RobotBuilder程序中的“ Operator Interface”文件夹中。首先（1）将操纵杆添加到程序中，然后将按钮放在关联的操纵杆下方（2），并给它们起有意义的名称，例如ShootButton。

source: Connecting the Commands to the Operator Interface
es_mx: Conexión de los comandos a la interfaz del operador
fr_ca: Connection des commandes à l’Interface de Opérateur
tr_tr: Komutların Operatör Arayüzüne Bağlanması
zh_cn: 将指令连接到操作界面

source: Commands can be associated with buttons so that when a button is pressed the command is scheduled. This should, for the most part, handle most of the tele-operated part of your robot program.
es_mx: Los comandos se pueden asociar con botones para que cuando se presione un botón, el comando esté programado. Esto debería, en su mayor parte, manejar la mayor parte de la parte teleoperada de su programa de robot.
fr_ca: Les commandes peuvent être associées à des boutons de sorte que lorsqu’un bouton est appuyé sur la commande est cédulée pour exécution. Cela devrait, pour la plupart du temps, gérer une bonne portion de la partie téléopérée de votre programme de robot.
tr_tr: Komutlar düğmelerle ilişkilendirilebilir, böylece bir düğmeye basıldığında komut zamanlanır. Bu, çoğunlukla, robot programınızın uzaktan çalıştırılan bölümünün çoğunu işlemelidir.
zh_cn: 可以将指令与按钮关联，以便在按下按钮时执行指令。在大多数情况下，此方法可以处理机器人程序的大部分远程操作部分。

source: This is simply done by (1) adding the command to the JoystickButton object in the RobotBuilder program, then (2) setting the condition in which the command is scheduled.
es_mx: Esto se hace simplemente (1) agregando el comando al objeto JoystickButton en el programa RobotBuilder, luego (2) estableciendo la condición en la que está programado el comando.
fr_ca: Cela se fait simplement en ajoutant (1) la commande à l’objet JoystickButton dans le programme RobotBuilder, puis (2) en définissant la condition dans laquelle la commande est planifiée.
tr_tr: Bu, RobotBuilder programındaki JoystickButton nesnesine (1) komutu ekleyerek, ardından (2) komutun programlandığı koşulu ayarlayarak yapılır.
zh_cn: 只需通过（1）将指令添加到RobotBuilder程序中的JoystickButton对象，然后（2）设置运行指令的条件，即可完成此操作。

source: For more information see :doc:`Connecting the Operator Interface to a Command <robotbuilder-operator-interface-to-command>`.
es_mx: Para obtener más información, consulte :doc:`Conexión de la interfaz del operador a un comando <robotbuilder-operator-interface-to-command>`.
fr_ca: Pour plus d’informations, voir :doc:`Connecting the Operator Interface to a Command<robotbuilder-operator-interface-to-command>`.
tr_tr: Daha fazla bilgi için bkz : doc:`Operatör Arayüzünü Komuta Bağlama <robotbuilder-operator-interface-to-command>`.
zh_cn: 有关更多信息，请参见将操作界面连接到指令<robotbuilder-operator-interface-to-command>`。

source: Developing Autonomous Commands
es_mx: Desarrollo de comandos autónomos
fr_ca: Développer des commandes autonomes
tr_tr: Otonom Komutlar Geliştirme
zh_cn: 开发自动命令

source: Commands make it simple to develop autonomous programs. You simply specify which command should run when the robot enters the autonomous period and it will automatically be scheduled. If you have tested commands as discussed above, this should simply be a matter of choosing which command should run.
es_mx: Los comandos simplifican el desarrollo de programas autónomos. Simplemente especifique qué comando debe ejecutarse cuando el robot ingrese al período autónomo y se programará automáticamente. Si ha probado comandos como se mencionó anteriormente, esto debería ser simplemente una cuestión de elegir qué comando debe ejecutarse.
fr_ca: Les commandes facilitent le développement de programmes autonomes. Il vous suffit de spécifier quelle commande doit s’exécuter lorsque le robot entre dans la période autonome et elle sera automatiquement planifiée. Si vous avez testé les commandes tel que discuté ci-dessus, il s’agit simplement de choisir la commande qui doit s’exécuter.
tr_tr: Komutlar, otonom programlar geliştirmeyi kolaylaştırır. Robot otonom döneme girdiğinde hangi komutun çalıştırılması gerektiğini belirtirsiniz ve otomatik olarak programlanacaktır. Komutları yukarıda tartışıldığı gibi test ettiyseniz, bu sadece hangi komutun çalıştırılması gerektiğini seçme meselesi olmalıdır.
zh_cn: 不同的指令使开发自动程序变得简单。您只需指定当机器人进入自动阶段应运行的指令，它将自动进行调度。如果您如上所述测试了指令，则只需选择要运行的指令即可。

source: Select the robot at the root of the RobotBuilder project (1), then edit the Autonomous Command property (2) to choose the command to run. It's that simple!
es_mx: Seleccione el robot en la raíz del proyecto RobotBuilder (1), luego edite la propiedad Autonomous Command (2) para elegir el comando a ejecutar. ¡Es así de simple!
fr_ca: Sélectionnez le robot à la racine du projet RobotBuilder (1), puis modifiez la propriété (2) Autonomous Command pour choisir la commande à exécuter. C’est aussi simple que ça !
tr_tr: RobotBuilder projesinin (1) kökündeki robotu seçin, ardından çalıştırılacak komutu seçmek için Otonom Komut özelliğini (2) düzenleyin. Bu kadar basit!
zh_cn: 选择 RobotBuilder 项目 (1) 根目录下的机器人，然后编辑自动阶段指令 属性 (2) 以选择要运行的指令。就是这么简单！

source: For more information see :doc:`Setting the Autonomous Commands <robotbuilder-autonomous-command>`.
es_mx: Para obtener más información, consulte :doc:`Setting the Autonomous Commands <robotbuilder-autonomous-command>`.
fr_ca: Pour plus d’informations, voir :doc:`Setting the Default Autonomous Command <robotbuilder-autonomous-command>`.
tr_tr: Daha fazla bilgi için bkz :doc:`Setting the Autonomous Commands <robotbuilder-autonomous-command>`.
zh_cn: 有关更多信息，请参阅:doc:`设置自动阶段指令`。

source: Generating Code
es_mx: Generar código
fr_ca: Générer le code
tr_tr: Kod Oluşturuluyor
zh_cn: 生成代码

source: At any point in the process outlined above you can have RobotBuilder generate a C++ or Java program that will represent the project you have created. This is done by specifying the location of the project in the project properties (1), then clicking the appropriate toolbar button to generate the code (2).
es_mx: En cualquier punto del proceso descrito anteriormente, puede hacer que RobotBuilder genere un programa C++ o Java que representará el proyecto que ha creado. Esto se hace especificando la ubicación del proyecto en las propiedades del proyecto (1), luego haciendo clic en el botón apropiado de la barra de herramientas para generar el código (2).
fr_ca: À tout moment du processus décrit ci-dessus, RobotBuilder peut vous générer un programme C++ ou Java qui représentera le projet que vous avez créé. Ceci se fait en spécifiant l’emplacement du projet dans les propriétés du projet (1), puis en cliquant sur le bouton de la barre d’outils appropriée pour générer le code (2).
tr_tr: Yukarıda belirtilen sürecin herhangi bir noktasında, RobotBuilder'ın oluşturduğunuz projeyi temsil edecek bir C++ veya Java programı oluşturmasını sağlayabilirsiniz. Bu, proje özelliklerinde (1) projenin konumu belirtilerek ve ardından kodu oluşturmak için uygun araç çubuğu düğmesine tıklanarak yapılır (2).
zh_cn: 在上述过程中的任何时候，您都可以让 RobotBuilder 生成一个 C++ 或 Java 程序来代表您创建的项目。这是通过在项目属性 (1) 中指定项目的位置，然后单击相应的工具栏按钮生成代码 (2) 来完成的。

source: For more information see :ref:`Generating RobotBuilder Code <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-generating-code:Generating Code for a Project>`.
es_mx: Para obtener más información, consulte :ref:`Generación del código de RobotBuilder <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-generating-code:Generating Code for a Project>`.
fr_ca: Pour plus d’informations, voir :ref:`Generating RobotBuilder Code <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-generating-code:Generating Code for a Project>`.
tr_tr: Daha fazla bilgi için bkz :ref:`Generating RobotBuilder Code <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-generating-code:Generating Code for a Project>`.
zh_cn: 有关更多信息，请参阅: Generating RobotBuilder Code "<docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-generating-code:Generating Code for a Project>"
