Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-creating-subsystem.po
Languages: fr_ca, zh_cn

source: Creating a Subsystem
fr_ca: Création d’un sous-système
zh_cn: 创建子系统

source: Subsystems are classes that encapsulate (or contain) all the data and code that make a subsystem on your robot operate. The first step in creating a robot program with the RobotBuilder is to identify and create all the subsystems on the robot. Examples of subsystems are grippers, ball collectors, the drive base, elevators, arms, etc. Each subsystem contains all the sensors and actuators that are used to make it work. For example, an elevator might have a Victor SPX motor controller and a potentiometer to provide feedback of the robot position.
fr_ca: Les sous-systèmes sont des classes qui encapsulent (ou contiennent) toutes les données et le code qui font fonctionner un sous-système sur votre robot. La première étape de la création d’un programme de robot avec robotBuilder consiste à identifier et à créer tous les sous-systèmes du robot. Des exemples de sous-systèmes sont les ramasseurs, les collecteurs de billes, la base pilotable, les élevateurs, les bras, etc. Chaque sous-système contient tous les capteurs et actionneurs utilisés pour le faire fonctionner. Par exemple, un élevateur peut avoir un contrôleur de moteur Victor SPX et un potentiomètre pour fournir un signal de rétroaction sur la position du robot.

source: Creating a Subsystem using the Palette
fr_ca: Création d’un sous-système à l’aide de la palette
zh_cn: 使用面板创建子系统

source: Drag the subsystem icon from the palette to the Subsystems folder in the robot description to create a subsystem class.
fr_ca: Faites glisser l’icône du sous-système de la palette vers le dossier Sous-systèmes dans la description du robot pour créer une classe de sous-système.
zh_cn: 将子系统图标从面板拖到 "robot description" 中的 "Subsystems" 文件夹中，以创建子系统类。

source: Creating a Subsystem using the Context Menu
fr_ca: Création d’un sous-système à l’aide du menu contextuel
zh_cn: 使用上下文菜单创建子系统

source: Right-click on the Subsystem folder in the robot description to add a subsystem to that folder.
fr_ca: Cliquez avec le bouton droit sur le dossier Sous-système dans la description du robot pour ajouter un sous-système à ce dossier.
zh_cn: 右键单击 "robot description" 中的 "subsystem" 文件夹然后将子系统添加到该文件夹。

source: Name the Subsystem
fr_ca: Nommer le sous-système
zh_cn: 命名子系统

source: After creating the subsystem by either dragging or using the context menu as described above, simply type the name you would like to give the subsystem. The name can be multiple words separated by spaces, RobotBuilder will concatenate the words to make a proper Java or C++ class name for you.
fr_ca: Après avoir créé le sous-système en faisant glisser ou en utilisant le menu contextuel décrit ci-dessus, tapez simplement le nom que vous souhaitez donner au sous-système. Le nom peut être composé de plusieurs mots séparés par des espaces, RobotBuilder concatenate les mots pour créer un nom qui est acceptable comme nom de classe Java ou C ++ .
zh_cn: 如上所述通过拖动或使用上下文菜单创建子系统后，只需键入您要为子系统指定的名称。名称可以是多个由空格分隔的单词，RobotBuilder 会连接这些单词为您生成合适的 Java 或 C++ 类名称。

source: Adding Constants
fr_ca: Ajout de constantes
zh_cn: 添加常量

source: Constants are very useful to reduce the amount of magic numbers in your code. In subsystems, they can be used to keep track of certain values, such as sensor values for specific heights of an elevator, or the speed at which to drive the robot.
fr_ca: Les constantes sont très utiles pour réduire la quantité de nombres "magiques" incrusté dans votre code. Dans les sous-systèmes, ils peuvent être utilisés pour surveiller certaines valeurs, comme les valeurs venant d'un capteur telles que la hauteur spécifique d’un mécanisme élevateur, ou la vitesse de déplacement du robot.
zh_cn: 常量对于减少代码中的幻数数量非常有用。在子系统中，它们可用于跟踪某些值，例如升降机特定高度的传感器值，或驱动机器人的速度。

source: By default, there will be no constants in a subsystem. Press the button next to "Constants" to open a dialog to create some.
fr_ca: Par défaut, il n’y aura pas de constantes dans un sous-système. Pour créer une constante, appuyez sur le bouton à côté de "Constants" et ouvrir la boîte de dialogue requise.
zh_cn: 默认情况下，子系统中没有常量。按“常量”旁边的按钮打开一个对话框来创建一些。

source: Creating Constants
fr_ca: Création de constantes
zh_cn: 创建常量

source: The constants table will be empty at first. Press "Add constant" to add one.
fr_ca: La table constantes sera vide dans un premier temps. Appuyez sur "Add constant" pour en ajouter une.
zh_cn: 常量表一开始是空的。按“添加常量”添加一个。

source: Add Constants
fr_ca: Ajout de constantes
zh_cn: 添加常量

source: The name of the constant. Change this to something descriptive. In this example of a drivetrain some good constants might be "PlaceDistance" and "BackAwayDistance".
fr_ca: Le nom de la constante. Changez le pour quelque chose qui est plus descriptif. Dans cet exemple de base pilotable, certains bons noms de constantes peuvent être "PlaceDistance" et "BackAwayDistance".
zh_cn: 常量的名称。将其更改为描述性内容。在传动系统的这个例子中，一些好的常数可能是“PlaceDistance”和“BackAwayDistance”。

source: The type of the constant. This will most likely be a double, but you can choose from one of: String, double, int, long, boolean, or byte.
fr_ca: Le type de la constante. Ce sera très probablement un double, mais vous pouvez choisir parmi les possibilités suivantes: String, double, int, long int, boolean, ou byte.
zh_cn: 常量的类型。这很可能是一个双精度值，但您可以选择以下之一：字符串、双精度、整数、长整数、布尔值或字节。

source: The value of the constant.
fr_ca: La valeur de la constante.
zh_cn: 常量的值。

source: Saving Constants
fr_ca: Sauvagarde de Constants
zh_cn: 保存常量

source: After adding constants and setting their values, just press "Save and close" to save the constants and close the dialog. If you don't want to save, press the exit button on the top of the window.
fr_ca: Après avoir ajouté des constantes et défini leurs valeurs, appuyez simplement sur "Enregistrer et fermer" pour enregistrer les constantes et fermer la boîte de dialogue. Si vous ne souhaitez pas enregistrer, appuyez sur le bouton de sortie en haut de la fenêtre.
zh_cn: 添加常量并设置其值后，只需按“保存并关闭”即可保存常量并关闭对话框。如果您不想保存，请按窗口顶部的退出按钮。

source: After Saving
fr_ca: Après la sauvegarde
zh_cn: 在保存之后

source: After saving constants, the names will appear in the "Constants" button in the subsystem properties.
fr_ca: Après avoir enregistré les constantes, les noms apparaîtront dans le bouton "Constantes" dans les propriétés du sous-système.
zh_cn: 保存常量后，名称将出现在子系统属性的“常量”按钮中。

source: Dragging Actuators/Sensors into the Subsystem
fr_ca: Ajout des dispositifs actionneurs / capteurs dans le sous-système
zh_cn: 将执行器/传感器拖入子系统

source: There are three steps to adding components to a subsystem:
fr_ca: Il existe trois étapes pour ajouter des composants à un sous-système
zh_cn: 将组件添加到子系统需要三个步骤：

source: Drag actuators or sensors from the palette into the subsystem as required.
fr_ca: Faites glisser les dispositifs actionneurs ou les capteurs en provenance de la palette vers le sous-système, selon vos besoins.
zh_cn: 根据需要将执行器或传感器从调色板拖到子系统中。

source: Give the actuator or sensor a meaningful name
fr_ca: Nommer le dispositif actionneur ou le capteur
zh_cn: 给执行器或传感器起一个有意义的名字

source: Edit the properties such as module numbers and channel numbers for each item in the subsystem.
fr_ca: Modifier les propriétés telles que les numéros de module et les numéros de canal pour chaque élément du sous-système.
zh_cn: 编辑子系统中每个项目的属性，例如模块编号和通道编号。

source: RobotBuilder will automatically use incrementing channel numbers for each module on the robot. If you haven't yet wired the robot you can just let RobotBuilder assign unique channel numbers for each sensor or actuator and wire the robot according to the generating wiring table.
fr_ca: RobotBuilder incrémentera automatiquement les numéros de canaux utilisés pour chaque module du robot. Si vous n'avez pas encore câblé le robot, vous pouvez simplement laisser RobotBuilder faire le travail et attribuer automatiquement des numéros de canaux uniques pour chaque capteur ou dispositifs actionneur et plus tard, câbler le robot conformément au tableau ainsi généré.
zh_cn: RobotBuilder 将自动为机器人上的每个模块使用递增的通道编号。如果您尚未为机器人接线，您可以让 RobotBuilder 为每个传感器或执行器分配唯一的通道编号，并根据生成的接线表为机器人接线。

source: This just creates the subsystem in RobotBuilder, and will subsequently generate skeleton code for the subsystem. To make it actually operate your robot please refer to :ref:`Writing Code for a Subsystem <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code:Writing the Code for a Subsystem>`.
fr_ca: Cela crée simplement un sous-système dans RobotBuilder et générera par la suite un code squelette pour le sous-système. Pour qu'il soit fonctionnel dans votre robot, veuillez vous référer à :ref:`Writing Code for a Subsystem <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code:Writing the Code for a Subsystem>`.
zh_cn: 这只是在 RobotBuilder 中创建子系统，随后将为子系统生成骨架代码。要使其实际操作您的机器人，请参阅：ref:`为子系统编写代码 <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code:Writing the Code for a Subsystem>` .

source: Subsystems are classes that encapsulate (or contain) all the data and code that make a subsystem on your robot operate. The first step in creating a robot program with the RobotBuilder is to identify and create all the subsystems on the robot. Examples of subsystems are grippers, ball collectors, the drive base, elevators, arms, etc. Each subsystem contains all the sensors and actuators that are used to make it work. For example, an elevator might have a Victor SPX speed controller and a potentiometer to provide feedback of the robot position.
zh_cn: 子系统是封装（或包含）使机器人子系统运行的所有数据和代码的类。使用 RobotBuilder 创建机器人程序的第一步是识别并创建机器人上的所有子系统。子系统的示例包括抓手、集球器、驱动器底座、升降机、手臂等。每个子系统都包含用于使其工作的所有传感器和执行器。例如，电梯可能有一个 Victor SPX 速度控制器和一个电位计来提供机器人位置的反馈。
