Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-testing-with-smartdashboard.po
Languages: fr_ca, tr_tr

source: Using SmartDashboard to Test a Command
fr_ca: Utilisation de SmartDashboard pour tester une commande
tr_tr: Bir Komutu Test Etmek İçin SmartDashboard'u Kullanma

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
fr_ca: RobotBuilder a été mis à jour pour prendre en charge le nouveau cadre de développement orienté commande! Malheureusement, cette documentation est obsolète et n'est valable que pour l’ancien cadre de développement orienté commande. Les personnes intéressées à mettre à jour la nouvelle documentation peuvent ouvrir un pull request sur le dépôt `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ .
tr_tr: RobotBuilder, yeni komut tabanlı çerçeveyi desteklemek için güncellendi! Ne yazık ki, bu dokümantasyon güncelliğini yitirmiştir ve yalnızca eski komut temelli çerçeve içindir. Bu dokümantasyonu güncellemekle ilgilenen kişiler, "frc-docs <https://github.com/wpilibsuite/frc-docs>" __ deposuna destekte bulunabilirler.

source: Commands are easily tested by adding a button to the SmartDashboard to trigger the command. In this way, no integration with the rest of the robot program is necessary and commands can easily be independently tested. This is the easiest way to verify commands since with a single line of code in your program, a button can be created on the SmartDashboard that will run the command. These buttons can then be left in place to verify subsystems and command operations in the future.
fr_ca: Les commandes sont facilement testées en ajoutant un bouton au SmartDashboard pour déclencher la commande. De cette façon, aucune intégration avec le reste du programme du robot n'est nécessaire et les commandes peuvent facilement être testées indépendamment. C'est le moyen le plus simple de vérifier les commandes car avec seulement une ligne de code dans votre programme, un bouton peut être créé sur le SmartDashboard qui exécutera la commande. Ces boutons peuvent ensuite être laissés en place pour vérifier les sous-systèmes et les opérations de commande dans le futur.
tr_tr: Komutlar, SmartDashboard'a komutu tetiklemek için bir düğme eklenerek kolayca test edilir. Bu şekilde, robot programının geri kalanıyla hiçbir entegrasyon gerekli değildir ve komutlar bağımsız olarak kolayca test edilebilir. Bu, komutları doğrulamanın en kolay yoludur, çünkü programınızdaki tek bir kod satırı ile, SmartDashboard'da komutu çalıştıracak bir düğme oluşturulabilir. Bu düğmeler, gelecekte alt sistemleri ve komut işlemlerini doğrulamak için yerinde bırakılabilir.

source: This has the added benefit of accommodating multiple programmers, each writing commands. As the code is checked into the main robot project, the commands can be individually tested.
fr_ca: Cela a l'avantage supplémentaire de permettre à plusieurs programmeurs de travailler ensemble, chacun écrivant ses commandes. Lorsque le code est archivé dans le projet de robot principal, les commandes peuvent être testées individuellement.
tr_tr: Bu, her biri komut yazan birden çok programcıyı barındırma avantajına sahiptir. Kod ana robot projesinde kontrol edildiğinde, komutlar ayrı ayrı test edilebilir.

source: Creating the Button on SmartDashboard
fr_ca: Création du bouton sur SmartDashboard
tr_tr: SmartDashboard'da Düğme Oluşturma

source: The button is created on the SmartDashboard by putting an instance of the command from the robot program to the dashboard. This is such a common operation that it has been added to RobotBuilder as a checkbox. When writing your commands, be sure that the box is checked, and buttons will be automatically generated for you.
fr_ca: Le bouton est créé sur le SmartDashboard en plaçant une instance de la commande du programme robot dans le tableau de bord. Il s'agit d'une opération tellement courante qu'elle a été ajoutée à RobotBuilder en tant que case à cocher. Lorsque vous écrivez vos commandes, assurez-vous que la case est cochée et les boutons seront automatiquement générés pour vous.
tr_tr: Düğme, komutun bir örneğini robot programından kontrol paneline koyarak SmartDashboard'da oluşturulur. Bu o kadar yaygın bir işlemdir ki, RobotBuilder'a bir onay kutusu olarak eklenmiştir. Komutlarınızı yazarken, kutunun işaretli olduğundan ve düğmelerin sizin için otomatik olarak oluşturulduğundan emin olun.

source: Operating the Buttons
fr_ca: Utilisation des boutons
tr_tr: Düğmelerin Çalıştırılması

source: The buttons will be generated automatically and will appear on the dashboard screen. You can put the SmartDashboard into edit mode, and the buttons can then be rearranged along with other values that are being generated. In this example there are a number of commands, each with an associated button for testing. The button is labeled "Start" and pressing it will run the command. As soon as it is pressed, the label changes to "Cancel" and pressing it will interrupt the command causing the ``Interrupted()`` method to be called.
fr_ca: Les boutons seront générés automatiquement et apparaîtront sur l'écran du tableau de bord. Vous pouvez mettre le SmartDashboard en mode édition, et les boutons peuvent ensuite être réorganisés avec d'autres valeurs qui ont été générées auparavant. Dans cet exemple, il existe un certain nombre de commandes, chacune avec un bouton associé pour le test. Le bouton est étiqueté "Start" et en appuyant dessus, la commande sera exécutée. Dès qu'elle est enfoncée, l'étiquette passe à "Cancel" et si on appuie a nouveau dessus, la commande sera interrompue et la méthode ``Interrupted()`` sera appelée.
tr_tr: Düğmeler otomatik olarak oluşturulacak ve kontrol paneli ekranında görünecektir. SmartDashboard'u düzenleme moduna getirebilirsiniz ve ardından düğmeler, oluşturulan diğer değerlerle birlikte yeniden düzenlenebilir. Bu örnekte, her biri test için ilişkili bir düğme içeren birkaç komut vardır. Düğme "Start-Başlat" olarak etiketlenir ve düğmeye basmak komutu çalıştırır. Basıldığı anda etiket "Cancel-İptal" olarak değişir ve buna basılması komutu kesintiye uğratarak ```Interrupted()`` yönteminin çağrılmasına neden olur.

source: Adding Commands Manually
fr_ca: Ajout manuel de commandes
tr_tr: Manuel Olarak Komut Ekleme

source: Commands can be added to the SmartDashboard manually by writing the code yourself. This is done by passing instances of the command to the PutData method along with the name that should be associated with the button on the SmartDashboard. These instances are scheduled whenever the button is pressed. The result is exactly the same as RobotBuilder generated code, although clicking the checkbox in RobotBuilder is much easier than writing all the code by hand.
fr_ca: Les commandes peuvent être ajoutées manuellement au SmartDashboard en écrivant vous-même le code. Cela se fait en passant des instances de la commande à la méthode PutData avec le nom qui doit être associé au bouton sur le SmartDashboard. Ces instances sont alors planifiées pour être exécutés chaque fois que le bouton est enfoncé. Le résultat est exactement le même que le code généré par RobotBuilder, bien que cliquer sur la case à cocher dans RobotBuilder soit beaucoup plus facile que d'écrire tout le code à la main.
tr_tr: Kodu kendiniz yazarak SmartDashboard'a komutlar manuel olarak eklenebilir. Bu, SmartDashboard'daki düğmeyle ilişkilendirilmesi gereken adla birlikte komutun örneklerini PutData yöntemine ileterek yapılır. Bu örnekler, düğmeye her basıldığında planlanır. Sonuç, RobotBuilder'ın oluşturduğu kodla tamamen aynıdır, ancak RobotBuilder'daki onay kutusuna tıklamak tüm kodu elle yazmaktan çok daha kolaydır.
