Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-creating-command.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Creating a Command
es_mx: Creando un comando
fr_ca: Création d'une commande
tr_tr: Bir Command-Komut Oluşturmak
zh_cn: 创建一个指令

source: Commands are classes you create that provide behaviors or actions for your subsystems. The subsystem class should set the operation of the subsystem, like MoveElevator to start the elevator moving, or ElevatorToSetPoint to set the elevator's PID setpoint. The commands initiate the subsystem operation and keep track of when it is finished.
es_mx: Los comandos son clases que creas que proporcionan comportamientos o acciones para los subsistemas. La clase de subsistema debe establecer el funcionamiento del subsistema, como MoveElevator para iniciar el movimiento del ascensor, o ElevatorToSetPoint para establecer el punto de ajuste PID del ascensor. Los comandos inician la operación del subsistema y llevan un registro de cuándo ha terminado.
fr_ca: Les commandes sont des classes que vous créez qui fournissent des comportements ou des actions pour vos sous-systèmes. La classe de sous-système doit définir le fonctionnement du sous-système, comme MoveElevator pour démarrer le déplacement de d'un élévateur, ou ElevatorToSetPoint pour définir le point de consigne PID de l'élévateur. Les commandes lancent l'opération du sous-système et repèrent leur fins ( lorsqu'elles se terminent).
tr_tr: Komutlar, alt sistemleriniz için davranışlar veya eylemler sağlayan, oluşturduğunuz sınıflardır. Alt sistem sınıfı, asansörü hareket ettirmek için MoveElevator gibi alt sistemin çalışmasını veya asansörün PID ayar noktasını ayarlamak için ElevatorToSetPoint'i ayarlamalıdır. Komutlar alt sistem işlemini başlatır ve ne zaman bittiğini takip eder.
zh_cn: 指令是您创建的类，用于为子系统提供行为或动作。子系统类应设置子系统的操作，例如MoveElevator启动升降舵移动，或ElevatorToSetPoint设置升降舵的PID设定点。这些命令将启动子系统执行并跟踪其完成时间。

source: Drag the Command to the Commands Folder
es_mx: Arrastre el comando a la carpeta de comandos
fr_ca: Faire glisser la commande vers le dossier Commandes
tr_tr: Komutu Commands Klasörüne sürükleyin
zh_cn: 将指令拖到指令文件夹

source: Simple commands can be dragged from the palette to the robot description. The command will be created under the Commands folder.
es_mx: Se pueden arrastrar comandos simples de la paleta a la descripción del robot. El comando se creará en la carpeta Comandos.
fr_ca: Des commandes simples peuvent être glissées de la palette vers la description du robot. La commande sera créée sous le dossier Commandes.
tr_tr: Basit komutlar paletten robot açıklamasına sürüklenebilir. Komut, Commands klasörü altında oluşturulacaktır.
zh_cn: 可以将简单指令从面板拖到机器人描述中。该命令将在“指令”文件夹下创建。

source: Creating Commands using the Context Menu
es_mx: Creación de comandos usando el menú contextual
fr_ca: Création de commandes à l'aide du menu contextuel
tr_tr: Context menüsünü Kullanarak Komut Oluşturma
zh_cn: 使用目录菜单创建指令

source: You can also create commands using the right-click context menu on the Command folder in the robot description.
es_mx: También puede crear comandos utilizando el menú contextual del botón derecho del ratón en la carpeta Comando de la descripción del robot.
fr_ca: Vous pouvez également créer des commandes en utilisant le menu contextuel du clic droit sur le dossier Command dans la description du robot.
tr_tr: Robot açıklamasındaki Command klasöründe sağ tıklanan context menüsünü kullanarak da komutlar oluşturabilirsiniz.
zh_cn: 您还可以使用机器说明中“指令”文件夹中的右键单击上下文菜单来创建指令。

source: Configuring the Command
es_mx: Configurando el comando
fr_ca: Configuration de la commande
tr_tr: Komutu Yapılandırma
zh_cn: 配置指令

source: Name the command with something meaningful that describes what the command will do. Commands should be named as if they were in code, although there can be spaces between words.
es_mx: Nombra el comando con algo significativo que describa lo que el comando hará. Los comandos deben ser nombrados como si estuvieran en código, aunque puede haber espacios entre las palabras.
fr_ca: Nommez la commande avec un nom significatif qui décrit ce que la commande fera. Les commandes doivent être nommées comme si elles faisaient partie du code, bien qu'il puisse y avoir des espaces entre les mots.
tr_tr: Komuta, komutun ne yapacağını açıklayan anlamlı bir ad verin. Sözcükler arasında boşluklar olabilmesine rağmen komutlar kod içindeymiş gibi adlandırılmalıdır.
zh_cn: 用有意义的名称命名指令，以描述该指令将执行的操作。指令应该像在代码中统一命名，尽管单词之间可以有空格。

source: Set the subsystem that is required by this command. When this command is scheduled, it will automatically stop any command currently running that also requires this command. If a command to open the claw is currently running (requiring the claw subsystem) and the close claw command is scheduled, it will immediately stop opening and start closing.
es_mx: Configure el subsistema requerido por este comando. Cuando este comando está programado, detendrá automáticamente cualquier comando que se esté ejecutando y que también requiera este comando. Si se está ejecutando un comando para abrir la garra (que requiere el subsistema de garra) y el comando de cierre de la garra está programado, dejará de abrirse inmediatamente y comenzará a cerrarse.
fr_ca: Définir le sous-système utilisé par cette commande. Lorsque cette commande est planifiée, elle arrêtera automatiquement toute commande en cours d'exécution qui nécessite également cette commande. Si une commande d'ouverture de la pince est en cours d'exécution (nécessitant le sous-système de la pince) et que la commande de fermeture de la pince est planifiée, elle arrêtera immédiatement l'ouverture et la fermeture s'amorcera.
tr_tr: Bu komutun gerektirdiği alt sistemi ayarlayın. Bu komut zamanlandığında, o anda çalışan ve bu komutu da gerektiren herhangi bir komutu otomatik olarak durduracaktır. Pençeyi açma komutu o anda çalışıyorsa (pençe alt sistemini gerektiriyorsa) ve pençe kapama komutu zamanlanmışsa, açmayı hemen durdurur ve kapatmaya başlar.
zh_cn: 设置此指令使用的子系统。此指令被加入列表后，它将自动停止当前正在运行的也需要此指令的任何指令。如果当前正在运行打开夹持器的指令（需要夹持器子系统），并且已将关闭夹持器指令加入列表，它将立即停止打开并开始关闭。

source: Tell RobotBuilder if it should create buttons on the SmartDashboard for the command. A button will be created for each parameter preset.
es_mx: Dile a RobotBuilder si debe crear botones en el SmartDashboard para el comando. Se creará un botón para cada parámetro preestablecido.
fr_ca: Dire à RobotBuilder s'il doit créer des boutons sur le SmartDashboard pour la commande. Un bouton sera créé pour chaque paramètre prédéfini.
tr_tr: RobotBuilder'a komut için SmartDashboard'da düğmeler oluşturması gerekip gerekmediğini söyleyin. Her parametre ön ayarı için bir düğme oluşturulacaktır.
zh_cn: 告诉RobotBuilder是否应在SmartDashboard上为该指令创建按钮。将为每个参数预设一个按钮。

source: Set the parameters this command takes. A single command with parameters can do the same thing as two or more commands that do not take parameters. For example, "Drive Forward", "Drive Backward", and "Drive Distance" commands can be consolidated into a single command that takes values for direction and distance.
es_mx: Establezca los parámetros que toma este comando. Un solo comando con parámetros puede hacer lo mismo que dos o más comandos que no toman parámetros. Por ejemplo, los comandos "Avance", "Retroceso" y "Distancia" pueden consolidarse en un solo comando que toma valores de dirección y distancia.
fr_ca: Définir les paramètres de cette commande. Une seule commande avec des paramètres peut faire la même chose que deux ou plusieurs commandes sans paramètres. Par exemple, les commandes "Drive Forward", "Drive Backward" et "Drive Distance" peuvent être consolidées en une seule commande qui prend des valeurs de direction et de distance.
tr_tr: Bu komutun alacağı parametreleri ayarlayın. Parametreli tek bir komut, parametre almayan iki veya daha fazla komutla aynı şeyi yapabilir. Örneğin, "Drive Forward", "Drive Backward" ve "Drive Distance" komutları, yön ve mesafe için değerler alan tek bir komutta birleştirilebilir.
zh_cn: 设置此指令需要的参数。具有参数的单个命令可以与不带参数的两个或多个指令具有相同的作用。例如，“前进驱动”，“后退驱动”和“行驶距离”指令可以合并为一个单独的指令，该指令采用方向和距离值。

source: Set presets for parameters. These can be used elsewhere in RobotBuilder when using the command, such as binding it to a joystick button or setting the default command for a subsystem.
es_mx: Establecer preselecciones para los parámetros. Estos pueden ser utilizados en cualquier parte de RobotBuilder cuando se utiliza el comando, como por ejemplo, enlazarlo a un botón del joystick o establecer el comando por defecto para un subsistema.
fr_ca: Définissez des préréglages pour les paramètres. Ceux-ci peuvent être utilisés ailleurs dans RobotBuilder lors de l'utilisation de la commande, Quelques exemples : lier la commande à un bouton du joystick ou définir la commande par défaut pour un sous-système.
tr_tr: Parametreler için ön ayarları ayarlayın. Bunlar, bir kumanda kolu düğmesine bağlamak veya bir alt sistem için varsayılan komutu ayarlamak gibi komutu kullanırken RobotBuilder'ın başka bir yerinde kullanılabilir.
zh_cn: 设置参数预设。使用指令时，可以在RobotBuilder中的其他位置同时使用这些指令，例如将其绑定到操纵杆按钮或为子系统设置默认指令。

source: *Run When Disabled*. Allows the command to run when the robot is disabled. However, any actuators commanded while disabled will not actuate.
es_mx: *Run When Disabled*. Permite que el comando se ejecute cuando el robot está desactivado. Sin embargo, los actuadores comandados mientras están desactivados no se activarán.
fr_ca: *Run When Disabled*. Permet à la commande de s’exécuter lorsque le robot est désactivé. Toutefois, tous les actionneurs commandés lorsqu’ils sont désactivés ne fonctionnent pas.
tr_tr: *Run When Disabled-Devre Dışı Bırakıldığında Çalıştır*. Robot devre dışı bırakıldığında komutun çalışmasına izin verir. Ancak, devre dışıyken komut verilen hiçbir aktüatör harekete geçmeyecektir.
zh_cn: *禁用时运行*。禁用机器人时允许指令运行。但是，禁用时指令的任何执行器都不会启动。

source: *Autonomous Selection*. Whether the command should be added to the Sendable Chooser so that it can be selected for autonomous.
es_mx: *Autonomous Selection*. Si el comando debe agregarse al Selector de envío para que pueda seleccionarse para el autónomo.
fr_ca: *Autonomous Selection*. Si la commande doit être ajoutée à l'objet Sendable Chooser afin qu’elle puisse être sélectionnée pour l'exécution du mode autonome.
tr_tr: *Autonomous Selection-Otonom Seçim*. Komutun, otonom için seçilebilmesi için Gönderilebilir Seçici'ye eklenip eklenmeyeceği.
zh_cn: *自动阶段选择*。是否应将指令添加到“可发送选择器”，以便可以将其选择为自动阶段指令。

source: Setpoint commands come with a single parameter ('setpoint', of type double); parameters cannot be added, edited, or deleted for setpoint commands.
es_mx: Los comandos de punto de ajuste vienen con un solo parámetro ('punto de ajuste', de tipo doble); los parámetros no pueden ser añadidos, editados o borrados para los comandos de punto de ajuste.
fr_ca: Les commandes de Point de consigne sont définies avec un seul paramètre ('setpoint', de type double); les paramètres ne peuvent pas être ajoutés, modifiés ou supprimés pour les commandes de Points de consigne.
tr_tr: Setpoint komutları tek bir parametre ile gelir (double türünde 'setpoint'); ayar noktası komutları için parametreler eklenemez, düzenlenemez veya silinemez.
zh_cn: 设定值指令带有单个参数（“ setpoint”，类型为double）；不能为设置点指令添加，编辑或删除参数。

source: Adding and Editing Parameters
es_mx: Añadiendo y editando parámetros
fr_ca: Ajout et modification de paramètres
tr_tr: Parametreleri Ekleme ve Düzenleme
zh_cn: 添加和编辑参数

source: To add or edit parameters:
es_mx: Para añadir o editar parámetros:
fr_ca: Pour ajouter ou modifier des paramètres:
tr_tr: Parametre eklemek veya düzenlemek için:
zh_cn: 要添加或编辑参数：

source: Click the button in the :guilabel:`Value` column of the property table
es_mx: Dé clic al botón en la columna :guilabel:`Value` de la tabla de propiedades.
fr_ca: Cliquez sur le bouton dans la colonne :guilabel:`Value` du tableau des propriétés
tr_tr: Özellik tablosunun :guilabel:`Value` sütunundaki butona tıklayın
zh_cn: 单击属性表的“值”列中的按钮

source: Press the :guilabel:`Add Parameter` button to add a parameter
es_mx: Presione el botón:guilabel:`Add Parameter` para agregar un parámetro.
fr_ca: Appuyez sur le bouton :guilabel:`Add Parameter` pour ajouter un paramètre
tr_tr: Bir parametre eklemek için :guilabel:`Add Parameter` düğmesine basın
zh_cn: 按下“添加参数”按钮添加参数

source: A parameter that has just been added. The name defaults to `[change me]` and the type defaults to String. The default name is invalid, so you will have to change it before exporting. Double click the :guilabel:`Name` cell to start changing the name. Double click the :guilabel:`Type` cell to select the type.
es_mx: Un parámetro que se acaba de agregar. El nombre predeterminado será `[change me]` y el tipo predeterminado es String. El nombre predeterminado no es válido, por lo que deberá cambiarlo antes de exportar. Haga doble clic en la celda:guilabel:`Name` para comenzar a cambiar el nombre. Haga doble clic en la celda :guilabel:`Type` para seleccionar el tipo.
fr_ca: Un paramètre qui vient d'être ajouté. Le nom par défaut est `[change me]` et le type par défaut est String (chaîne de caractères). Le nom par défaut n'est pas valide, vous devrez donc le modifier avant d'exporter. Double-cliquez sur la cellule :guilabel:`Name` pour commencer à changer le nom. Double-cliquez sur la cellule :guilabel:`Type` pour sélectionner le type.
tr_tr: Yeni eklenen bir parametre. Ad varsayılan olarak `[change me]` ve tür varsayılan olarak Dize şeklindedir. Varsayılan ad geçersizdir, bu nedenle dışa aktarmadan önce değiştirmeniz gerekecektir. Adı değiştirmeye başlamak için:guilabel:`Name` hücresine çift tıklayın. Türü seçmek için :guilabel:`Type` hücresine çift tıklayın.
zh_cn: 刚刚添加的参数。名称默认为“ [change me]”，类型默认为String。默认名称无效，因此您必须在导出之前进行更改。双击“名称”单元格，开始更改名称；双击“类型”单元格以选择类型。

source: Save and close button will save all changes and close the window.
es_mx: El botón de guardar y cerrar guardará todos los cambios y cerrará la ventana.
fr_ca: Le bouton "Save and close" enregistre toutes les modifications et ferme la fenêtre.
tr_tr: Save and close düğmesi tüm değişiklikleri kaydedecek ve pencereyi kapatacaktır.
zh_cn: 保存并关闭按钮将保存所有更改并关闭窗口。

source: Rows can be reordered simply by dragging, and can be deleted by selecting them and pressing delete or backspace.
es_mx: Las filas se pueden reordenar simplemente arrastrando, y se pueden eliminar seleccionándolas y pulsando eliminar o retroceder.
fr_ca: Les lignes peuvent être réorganisées simplement en les faisant glisser et peuvent être supprimées en les sélectionnant et en appuyant sur la touche "Delete" ou "Backspace".
tr_tr: Satırlar basitçe sürüklenerek yeniden sıralanabilir ve seçilip sil veya geri tuşuna basılarak silinebilir.
zh_cn: 只需拖动即可重新排列行，可以通过选择行并按Delete或Backspace将其删除。

source: Adding and Editing Parameter Presets
es_mx: Añadiendo y editando preajustes de parámetros
fr_ca: Ajout et modification des préréglages de paramètres (Parameter Presets)
tr_tr: Parametre Ön Ayarları Ekleme ve Düzenleme
zh_cn: 添加和编辑参数预设

source: Click :guilabel:`Add parameter set` to add a new preset.
es_mx: Haga clic en :guilabel:`Add parameter set` para agregar un nuevo preset.
fr_ca: Cliquez sur :guilabel:`Add parameter set` pour ajouter un nouveau préréglage.
tr_tr: Yeni bir ön ayar eklemek için :guilabel:`Add parameter set` ye tıklayın.
zh_cn: 单击“添加参数集”以添加新的预设。

source: Change the name of the preset to something descriptive. The presets in this example are for opening and closing the gripper subsystem.
es_mx: Cambie el nombre de la preselección por algo descriptivo. Los preajustes en este ejemplo son para abrir y cerrar el subsistema de la pinza.
fr_ca: Remplacez le nom du préréglage par quelque chose de descriptif. Les préréglages de cet exemple permettent d'ouvrir et de fermer le sous-système de pince.
tr_tr: Ön ayarın adını açıklayıcı bir adla değiştirin. Bu örnekteki ön ayarlar, gripper alt sistemini açmak ve kapatmak içindir.
zh_cn: 将预设名称更改为描述性名称。本示例中的预设用于打开和关闭夹持器子系统。

source: Change the value of the parameter(s) for the preset. You can either type a value in (e.g. "3.14") or select from constants defined in the subsystem that the command requires. Note that the type of the constant has to be the same type as the parameter -- you can't have an int-type constant be passed to a double-type parameter, for example
es_mx: Cambie el valor de los parámetro(s) para el preajuste. Puede escribir un valor (por ejemplo, "3.14") o seleccionar entre las constantes definidas en el subsistema que el comando requiere. Tenga en cuenta que el tipo de la constante tiene que ser del mismo tipo que el parámetro -- no se puede pasar una constante de tipo int a un parámetro de tipo doble, por ejemplo
fr_ca: Modifiez la valeur du ou des paramètres du préréglage. Vous pouvez soit saisir une valeur (par exemple "3.14"), soit sélectionner parmi les constantes définies dans le sous-système requis par la commande. Notez que le type de la constante doit être du même type que le paramètre - vous ne pouvez pas faire passer une constante de type "int" à un paramètre de type "double", par exemple
tr_tr: Ön ayar için parametre (ler) in değerini değiştirin. Ya bir değer yazabilir (ör. "3.14") veya komutun gerektirdiği alt sistemde tanımlanan sabitler arasından seçim yapabilirsiniz. Sabitin türünün parametre ile aynı türde olması gerektiğine dikkat edin - örneğin, double tür bir parametreye bir int-türü sabit atayamazsınız.
zh_cn: 更改一个（或多个）预设的参数值。您可以输入一个值（例如“ 3.14”），也可以从指令所需的子系统中定义的常量中进行选择。请注意，常量的类型必须与参数的类型相同-例如，您不能将int型常量传递给double型参数。

source: Click :guilabel:`Save and close` to save changes and exit the dialog; to exit without saving, press the exit button in the top bar of the window.
es_mx: Haga clic en :guilabel:`Save and close` para guardar los cambios y salir del diálogo; para salir sin guardar, presione el botón de salida en la barra superior de la ventana.
fr_ca: Cliquez sur :guilabel:`Save and close` pour enregistrer les modifications et quitter la boîte de dialogue; pour quitter sans enregistrer, appuyez sur le bouton Exit dans la barre supérieure de la fenêtre.
tr_tr: Değişiklikleri kaydetmek ve iletişim kutusundan çıkmak için :guilabel:`Save and close` a tıklayın; kaydetmeden çıkmak için, pencerenin üst çubuğundaki çıkış düğmesine basın.
zh_cn: 单击“保存并关闭”以保存更改并退出对话框；要退出而不保存，请按窗口顶部栏中的退出按钮。
