Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-testing-with-shuffleboard.po
Languages: fr_ca, zh_cn

source: Using Shuffleboard to Test a Command
fr_ca: Utilisation de Shuffleboard pour tester une commande
zh_cn: 使用 Shuffleboard 测试指令

source: Commands are easily tested by adding a button to Shuffleboard/SmartDashboard to trigger the command. In this way, no integration with the rest of the robot program is necessary and commands can easily be independently tested. This is the easiest way to verify commands since with a single line of code in your program, a button can be created on Shuffleboard that will run the command. These buttons can then be left in place to verify subsystems and command operations in the future.
fr_ca: Les commandes sont facilement testées en ajoutant un bouton au Shuffleboard/SmartDashboard pour déclencher la commande. De cette façon, aucune intégration avec le reste du programme du robot n’est nécessaire et les commandes peuvent facilement être testées indépendamment. C’est le moyen le plus simple de vérifier les commandes car avec seulement une ligne de code dans votre programme, un bouton peut être créé sur le Shuffleboard qui exécutera la commande. Ces boutons peuvent ensuite être laissés en place pour vérifier les sous-systèmes et les opérations de commande dans le futur.
zh_cn: 通过向 Shuffleboard/SmartDashboard 添加按钮来触发指令，可以轻松测试指令。通过这种方式，不需要与机器人程序的其余部分集成，并且可以轻松地独立测试指令。这是验证指令的最简单方法，因为在程序中使用一行代码，就可以在 Shuffleboard 上创建一个按钮来运行指令。然后可以将这些按钮留在原位以在将来验证子系统和命令操作。

source: This has the added benefit of accommodating multiple programmers, each writing commands. As the code is checked into the main robot project, the commands can be individually tested.
fr_ca: Cela a l’avantage supplémentaire de permettre à plusieurs programmeurs de travailler ensemble, chacun écrivant ses commandes. Lorsque le code est archivé dans le projet de robot principal, les commandes peuvent être testées individuellement.
zh_cn: 这个带来的额外好处是它能够更好地协调数个同时在给出指令的程序部分。当代码被写入机器的主程序项目后，每个指令都可以被拉出来单独调试。

source: Creating the Button on Shuffleboard
fr_ca: Création de bouton sur le Shuffleboard
zh_cn: 在 Shuffleboard 上创建按钮

source: To create a button in Shuffleboard ensure the "Button on SmartDashboard" checkbox is checked.
fr_ca: Pour créer un bouton dans Shuffleboard, assurez-vous que la case "Button on SmartDashboard" est cochée.
zh_cn: 要在 Shuffleboard 中创建按钮，请确保选中“SmartDashboard 上的按钮”复选框。

source: The button is created on the SmartDashboard by putting an instance of the command from the robot program to the dashboard. This is such a common operation that it has been added to RobotBuilder as a checkbox. When writing your commands, be sure that the box is checked, and buttons will be automatically generated for you.
fr_ca: Le bouton est créé sur le Shuffleboard en plaçant une instance de la commande du programme robot dans le tableau de bord. Il s’agit d’une opération tellement courante qu’elle a été ajoutée à RobotBuilder en tant que case à cocher. Lorsque vous écrivez vos commandes, assurez-vous que la case est cochée et les boutons seront automatiquement générés pour vous.
zh_cn: 通过将机器人命令的实例放置到仪表板上，可以在SmartDashboard上创建按钮。这是一种非常常见的操作，因此已将其作为复选框添加到RobotBuilder。编写命令时，请确保已选中该复选框，然后按钮将自动生成。

source: Operating the Buttons
fr_ca: utilisation des boutons
zh_cn: 操作按钮

source: Each of the created buttons has its own widget in Shuffleboard.
fr_ca: Chacun des boutons créés a son propre widget dans Shuffleboard.
zh_cn: 每个创建的按钮在 Shuffleboard 中都有自己的小部件。

source: The buttons will be generated automatically and will appear on the dashboard screen. You can rearrange the buttons on Shuffleboard. In this example there are a number of commands, each with an associated button for testing. Pressing the commands button will run the command. Once it is pressed, pressing again it will interrupt the command causing the ``Interrupted()`` method to be called.
fr_ca: Les boutons seront générés automatiquement et apparaîtront sur l’écran du Shuffleboard. Vous pouvez réarranger les boutons sur le Shufflebaord. Dans cet exemple, il existe un certain nombre de commandes, chacune avec un bouton associé pour le test. Une pression sur le bouton d'une commande lancera l'excécution de celles-ci. Si un bouton associé à une commande est déjà enfoncé, l'appuyer à nouveau aura pour effet d'interrompre la commande car cette action a pour effet d'invoquer la méthode ``Interrupted()``.
zh_cn: 按钮将自动生成并显示在仪表板屏幕上。您可以重新排列 Shuffleboard 上的按钮。在这个例子中，有许多命令，每个命令都有一个相关的测试按钮。按命令按钮将运行指令。一旦按下，再次按下它将中断指令，导致调用 ``Interrupted()`` 方法。

source: Adding Commands Manually
fr_ca: Ajout manuel de commandes
zh_cn: 手动添加命令

source: Commands can be added to the Shuffleboard manually by writing the code yourself. This is done by passing instances of the command to the PutData method along with the name that should be associated with the button on the Shuffleboard. These instances are scheduled whenever the button is pressed. The result is exactly the same as RobotBuilder generated code, although clicking the checkbox in RobotBuilder is much easier than writing all the code by hand.
fr_ca: Les commandes peuvent être ajoutées manuellement au Shuffleboard en écrivant vous-même le code. Cela se fait en passant des instances de la commande à la méthode PutData avec le nom qui doit être associé au bouton sur le Shuffleboard. Ces instances sont alors planifiées pour être exécutées chaque fois que le bouton est enfoncé. Le résultat est exactement le même que le code généré par RobotBuilder, bien que cliquer sur la case à cocher dans RobotBuilder soit beaucoup plus facile que d’écrire tout le code à la main.
zh_cn: 可以通过自己编写代码将命令手动添加到 Shuffleboard。这是通过将指令的实例以及应该与 Shuffleboard 上的按钮相关联的名称传递给 PutData 方法来完成的。只要按下按钮，就会安排这些实例。结果与 RobotBuilder 生成的代码完全相同，尽管单击 RobotBuilder 中的复选框比手动编写所有代码要容易得多。
