Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-interface.po
Languages: fr_ca, tr_tr, zh_cn

source: RobotBuilder User Interface
fr_ca: L'interface utilisateur de RobotBuilder
tr_tr: RobotBuilder Kullanıcı Arayüzü
zh_cn: RobotBuilder 用户界面

source: RobotBuilder has a user interface designed for rapid development of robot programs. Almost all operations are performed by drag-and-drop or selecting options from drop-down lists.
fr_ca: RobotBuilder possède une interface utilisateur conçue pour le développement rapide de programmes de robot. Presque toutes les opérations sont effectuées avec la souris, par des gestes de "glisser-déposer" ou en sélectionnant des options dans les listes déroulantes.
tr_tr: RobotBuilder, robot programlarının hızlı gelişimi için tasarlanmış bir kullanıcı arayüzüne sahiptir. Hemen hemen tüm işlemler sürükle bırak veya açılır listelerden seçenekler belirleyerek gerçekleştirilir.
zh_cn: RobotBuilder 有一个专为机器人程序的快速开发设计的用户界面。几乎所有操作都是通过拖放或从下拉列表中选择选项来执行的。

source: Dragging Items from the Palette to the Robot Description
fr_ca: Glissement des éléments de la palette vers la description du robot
tr_tr: Öğeleri Paletten Robot Açıklamasına Sürükleme
zh_cn: 将项目从调色板拖到机器人描述中

source: You can drag items from the palette to the robot description by starting the drag on the palette item and ending on the container where you would like the item to be located. In this example, dropping a potentiometer to the Elevator subsystem.
fr_ca: Vous pouvez faire glisser des éléments de la palette vers la description du robot en commençant le glisser sur l'élément de la palette et en terminant sur le conteneur où vous souhaitez que l'élément se trouve. Dans cet exemple, déposer un Potentiometer dans le sous-système Elevator.
tr_tr: Palet öğesi üzerinde sürüklemeyi başlatarak ve öğenin yerleştirilmesini istediğiniz kapta sonlandırarak öğeleri paletten robot açıklamasına sürükleyebilirsiniz. Bu örnekte, Asansör alt sistemine bir potansiyometre düşürülüyor.
zh_cn: 您可以通过在配置板项上开始拖动并在您希望项目所在的容器上结束拖动，将项目从配置板拖动到robot描述。在这个例子中，向电梯子系统投放一个电位计。

source: Adding Components using the Right-Click Context Menu
fr_ca: Ajout de composants à l'aide du menu contextuel du clic droit
tr_tr: Sağ Tıklama Bağlam Menüsünü Kullanarak Bileşen Ekleme
zh_cn: 用右键菜单增加零件

source: A shortcut method of adding items to the robot description is to right-click on the container object (Elevator) and select the item that should be added (Potentiometer). This is identical to using drag and drop but might be easier for some people.
fr_ca: Une méthode de raccourci pour ajouter des éléments à la description du robot consiste à cliquer avec le bouton droit sur l'objet conteneur (ascenseur) et à sélectionner l'élément à ajouter (potentiomètre). Ceci est identique à l'utilisation du glisser-déposer, mais pourrait être plus facile pour certaines personnes.
tr_tr: Robot açıklamasına öğe eklemenin bir kısayol yöntemi, konteyner nesnesine (Kaldırıcı) sağ tıklamak ve eklenmesi gereken öğeyi (Potansiyometre) seçmektir. Bu, sürükle ve bırak işlemiyle aynıdır ancak bazı insanlar için daha kolay olabilir.
zh_cn: 向机器人描述中添加物品的一个快捷方法是右键单击容器对象 (电梯) 并选择要添加的物品 (电位器) 。这与使用拖放是相同的，但是对某些人来说可能更简单。

source: Editing Properties of Robot Description Items
fr_ca: Modification des propriétés des éléments de description du robot
tr_tr: Robot Tanımı Öğelerinin Özelliklerini Düzenleme
zh_cn: 编辑机器人描述项目的属性

source: The properties for a selected item will appear in the properties viewer. The properties can be edited by selecting the value in the right hand column.
fr_ca: Les propriétés d'un élément sélectionné apparaissent dans le visualiseur de propriétés. Les propriétés peuvent être modifiées en sélectionnant la valeur dans la colonne de droite.
tr_tr: Seçilen bir öğenin özellikleri, özellikler görüntüleyicide görünecektir. Özellikler, sağ taraftaki sütundaki değer seçilerek düzenlenebilir.
zh_cn: 选定项的属性将显示在属性查看器中。可以通过选择右边列中的值来编辑属性。

source: Using the Menu System
fr_ca: Utilisation du système de menus
tr_tr: Menü Sisteminin Kullanılması
zh_cn: 使用菜单系统

source: Operations for RobotBuilder can either be selected through the menu system or the equivalent item (if it is available) from the toolbar.
fr_ca: Les opérations pour RobotBuilder peuvent être sélectionnées via le système de menus ou son élément équivalent (s'il est disponible) dans la barre d'outils.
tr_tr: RobotBuilder için işlemler, menü sistemi veya araç çubuğundaki eşdeğer öğe (varsa) aracılığıyla seçilebilir.
zh_cn: RobotBuilder 的操作既可以通过菜单系统选择，也可以从工具栏中选择等效项 (如果可用的话) 。
