Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-setup.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Setting up the Robot Project
es_mx: Configurando el proyecto de robot
fr_ca: Configuration du projet Robot
tr_tr: Robot Projesini Ayarlamak
zh_cn: 设置机器人项目

source: The RobotBuilder program has some default properties that need to be set up so the generated program and other generated files work properly. This setup information is stored in the properties for robot description (the first line).
es_mx: El programa RobotBuilder tiene algunas propiedades predeterminadas que deben configurarse para que el programa y otros archivos generados funcionen correctamente. Esta información se almacena en las propiedades para la descripción del robot (la primera línea).
fr_ca: Le programme RobotBuilder possède certaines propriétés par défaut qui doivent être configurées pour que le programme et les autres fichiers générés fonctionnent correctement. Ces informations de configuration sont stockées dans les propriétés de description du robot (la première ligne).
tr_tr: RobotBuilder programı, oluşturulan programın ve diğer oluşturulan dosyaların düzgün çalışması için ayarlanması gereken bazı varsayılan özelliklere sahiptir. Bu kurulum bilgileri, robot açıklaması özelliklerinde (ilk satır) saklanır.
zh_cn: RobotBuilder 程序有一些默认属性需要设置，以便生成的程序和其他生成的文件能够正常工作。这个设置信息存储在机器人描述的属性中 (第一行) 。

source: Robot Project Properties
es_mx: Propiedades del proyecto de robot
fr_ca: Propriétés du projet de robot
zh_cn: 机器人项目属性

source: The properties that describe the robot are:
es_mx: Las propiedades que describen al robot son:
fr_ca: Les propriétés qui décrivent le robot sont:
tr_tr: Robotu tanımlayan özellikler şunlardır:
zh_cn: 描述机器人的属性是：

source: **Name** - The name of the robot project that is created
es_mx: **Name** - El nombre del proyecto de robot que fue creado
fr_ca: **Name** - Le nom du projet de robot qui est créé
tr_tr: **Name** - Oluşturulan robot projesinin adı
zh_cn: **Name** - 被创建的机器人项目的名字

source: **Autonomous Command** - the command that will run by default when the program is placed in autonomous mode
es_mx: **Comando Autónomo** - el comando que se ejecutará por defecto cuando el programa se ponga en modo autónomo
fr_ca: **Autnomous Command** - la commande qui s'exécutera par défaut lorsque le programme sera placé en mode autonome
tr_tr: **Autonomous Command** - program otonom moda getirildiğinde varsayılan olarak çalışacak komut
zh_cn: **自动阶段指令** - 当程序处于自动阶段模式时默认运行的指令

source: **Autonomous Command Parameters** - Parameters for the Autonomous Command
es_mx: **Parámetros del Comando Autónomo** - Parámetros del comando autónomo
fr_ca: **Autonomous Command Parameters** - Paramètres de la commande autonome
tr_tr: **Autonomous Command Parameters** - Otonom Komut için Parametreler
zh_cn: **自动阶段指令参数** - 自动阶段指令的参数

source: **Team Number** - The team number for the project, which will be used to locate the robot when deploying code.
es_mx: **Número del Equipo** - El número de equipo del proyecto, que se utilizará para localizar el robot al desplegar el código.
fr_ca: **Team Number**: Ce paramètre définit le numéro d’équipe du projet, qui sera utilisé pour localiser le robot pendant le déploiement du code.
tr_tr: **Team Number** - Kodu dağıtırken robotu bulmak için kullanılacak proje takım numarası.
zh_cn: **团队编号** - 项目的团队编号，用于在部署代码时定位机器人。

source: **Use Default Java Package** - If checked RobotBuilder will use the default package (frc.robot). Otherwise you can specify a custom package name to be used.
es_mx: **Utiliza el Paquete de Java Predeterminado** - Si se marca, RobotBuilder utilizará el paquete predeterminado (frc.robot). De lo contrario, puede especificar un nombre de paquete personalizado para ser utilizado.
fr_ca: **Use Default Java Package** - Si cette case est cochée, RobotBuilder utilisera le package par défaut (frc.robot). Sinon, vous pouvez spécifier un nom de package personnalisé à utiliser.
tr_tr: **Use Default Java Package** - İşaretlenirse, RobotBuilder varsayılan paketi (frc.robot) kullanacaktır. Aksi takdirde, kullanılacak özel bir paket adı belirtebilirsiniz.
zh_cn: **使用默认 Java 包** - 如果选中 RobotBuilder 将使用默认包 (frc.robot)。否则，您可以指定要使用的自定义包名称。

source: **Java Package** - The name of the generated Java package used when generating the project code
es_mx: **Java Package** - El nombre del paquete Java generado que se utilizó al generar el código del proyecto.
fr_ca: **Java Package** - Le nom du package Java généré utilisé lors de la génération du code de projet
tr_tr: **Java Package** - Proje kodunu oluştururken kullanılan, oluşturulan Java paketinin adı
zh_cn: **Java Package** - 生成项目代码时使用的生成 Java 包的名称

source: **Export Directory** - The folder that the project is generated into when Export to Java or C++ is selected
es_mx: **Directorio de Exportación** - La carpeta en la que se genera el proyecto cuando se selecciona Exportar a Java o C++
fr_ca: ** Export Directory ** - Le dossier dans lequel le projet est généré lorsque l'option Export to Java ou C++ est sélectionnée
tr_tr: **Export Directory** - Java veya C ++ 'ya Aktar seçildiğinde projenin oluşturulduğu klasör
zh_cn: **导出目录** - 选择导出到 Java 或 C++ 时项目生成的文件夹

source: **Export Subsystems** - Checked if RobotBuilder should export the Subsystem classes from your project
es_mx: **Export Subsystems** -Marcado si RobotBuilder deberá exportar las clases de subsistema de su proyecto
fr_ca: **Export Subsystems** - Vérifié si RobotBuilder doit exporter les classes Subsystem de votre projet
tr_tr: **Export Subsystems** - RobotBuilder'ın Alt Sistem sınıflarını projenizden dışa aktarması gerekecekse seçilecektir
zh_cn: **Export Subsystems** - 检查 RobotBuilder 是否应该从项目中导出子系统类

source: **Export Commands** - Checked if RobotBuilder should export the Command classes from your project
es_mx: **Export Commands** - Marcado si RobotBuilder deberá exportar las clases de comandos de su proyecto
fr_ca: **Export Commands** - Vérifié si RobotBuilder doit exporter les classes de commandes de votre projet
tr_tr: **Export Commands** - Eğer seçiliyse RobotBuilder'ın projenizden Komut sınıflarını dışa aktarması gerekip gerekmediği kontrol eder
zh_cn: **Export Commands** - 检查 RobotBuilder 是否应该从项目中导出命令类

source: **Wiring File location** - the location of the html file to generate that contains the wiring diagram for your robot
fr_ca: **Wiring File location** - l’emplacement du fichier html à générer qui contient le schéma de câblage de votre robot

source: **Desktop Support** - Enables unit test and simulation. While WPILib supports this, third party software libraries may not. If libraries do not support desktop, then your code may not compile or may crash. It should be left unchecked unless unit testing or simulation is needed and all libraries support it.
fr_ca: **Desktop Support** - Permet de faire les tests unitaires et la simulation. Bien que WPILib soit pourvue cette fonctionnalité, les librairies logicielles tierces, elles, peuvent ne pas l'avoir. Si les libairies ne prennent pas en charge les applications de bureau, votre code peut ne pas se compiler ou planter. Cette option ne doit pas être cochée, sauf si des tests unitaires ou une simulation sont nécessaires et que toutes les librairies la prennent en charge.

source: Using Source Control with the RobotBuilder Project
es_mx: Uso de la fuente del control con el proyecto RobotBuilder
fr_ca: Utilisation d'un contrôle de code source avec le projet RobotBuilder
tr_tr: RobotBuilder Projesi ile Kaynak Kontrolünü Kullanma
zh_cn: 在RobotBuilder项目中使用源代码控制

source: When using source control the project will typically be used on a number of computers and the path to the project directory might be different from one users computer to another. If the RobotBuilder project file is stored using an absolute path, it will typically contain the user name and won't be usable across multiple computers. To make this work, select "relative path" and specify the path as an directory offset from the project files. In the above example, the project file is stored in the folder just above the project files in the file hierarchy. In this case, the user name is not part of the path and it will be portable across all of your computers.
es_mx: Cuando se utiliza el control de código fuente, el proyecto se utilizará normalmente en varias computadoras y la ruta al directorio del proyecto puede ser diferente de una computadora a otra. Si el archivo de proyecto de RobotBuilder se almacena utilizando una ruta absoluta, normalmente contendrá el nombre de usuario y no se podrá utilizar en varias computadoras. Para que esto funcione, seleccione "ruta relativa" y especifique la ruta como un desplazamiento de directorio de los archivos del proyecto. En el ejemplo anterior, el archivo del proyecto se almacena en la carpeta justo encima de los archivos del proyecto en la jerarquía de archivos. En este caso, el nombre de usuario no forma parte de la ruta y será portable en todas sus computadoras.
fr_ca: Lorsque vous utilisez un contrôle de code source, le projet sera généralement utilisé sur un certain nombre d'ordinateurs et le chemin d'accès (Path) au répertoire du projet peut être différent d'un ordinateur utilisateur à un autre. Si le fichier de projet RobotBuilder est stocké à l'aide d'un Path absolu, il contiendra généralement le nom d'utilisateur et ne sera pas utilisable sur plusieurs ordinateurs. Pour que cela fonctionne, sélectionnez "relative path" et spécifiez le Path comme un répertoire décalé par rapport aux fichiers du projet. Dans l'exemple ci-dessus, le fichier de projet est stocké dans le dossier juste au-dessus des fichiers de projet dans la hiérarchie de fichiers. Dans ce cas, le nom d'utilisateur ne fait pas partie du chemin d'accès et il sera portable sur tous vos ordinateurs.
tr_tr: Kaynak kontrolü kullanılırken proje tipik olarak birkaç bilgisayarda kullanılacaktır ve proje dizinine giden yol bir kullanıcının bilgisayarından diğerine farklı olabilir. RobotBuilder proje dosyası mutlak bir yol kullanılarak depolanırsa, genellikle kullanıcı adını içerir ve birden çok bilgisayarda kullanılamaz. Bunun çalışması için, "relative path" u seçin ve yolu proje dosyalarından bir dizin uzaklığı olarak belirtin. Yukarıdaki örnekte, proje dosyası, dosya hiyerarşisindeki proje dosyalarının hemen üzerindeki klasörde saklanır. Bu durumda, kullanıcı adı yolun bir parçası değildir ve tüm bilgisayarlarınızda taşınabilir olacaktır.
zh_cn: 在使用源代码控制时，项目通常会在许多计算机上使用，并且到项目目录的路径可能因用户计算机的不同而不同。如果RobotBuilder项目文件是使用绝对路径存储的，那么它通常会包含用户名，并且不能跨多台计算机使用。要做到这一点，选择“相对路径”并将路径指定为项目文件的目录偏移量。在上面的示例中，项目文件存储在文件层次结构中项目文件上方的文件夹中。在这种情况下，用户名不是路径的一部分，它可以在您的所有计算机上移植。
