Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-overview.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: RobotBuilder Overview
es_mx: Descripción general de RobotBuilder
fr_ca: Aperçu de RobotBuilder
tr_tr: RobotBuilder'a Genel Bakış
zh_cn: RobotBuilder 概述

source: RobotBuilder is an application designed to aid the robot development process. RobotBuilder can help you:
es_mx: RobotBuilder es una aplicación diseñada para ayudar al proceso de desarrollo de robots. RobotBuilder puede ayudarlo a:
fr_ca: RobotBuilder est une application conçue pour faciliter le processus de développement du robot. RobotBuilder peut vous aider :
tr_tr: RobotBuilder, robot geliştirme sürecine yardımcı olmak için tasarlanmış bir uygulamadır. RobotBuilder size şu konularda yardımcı olabilir:
zh_cn: RobotBuilder 是旨在帮助机器人开发过程的应用程序。 RobotBuilder 可以帮助您：

source: Generating boilerplate code.
es_mx: Generación de código boilerplate.
fr_ca: Générer du code standard.
tr_tr: Standart kod üretiliyor.
zh_cn: 生成样板代码。

source: Organize your robot and figure out what its key subsystems are.
es_mx: Organice su robot y averigüe cuáles son sus principales subsistemas.
fr_ca: Organisez votre robot et déterminez quels sont ses sous-systèmes clés.
tr_tr: Robotunuzu düzenleyin ve temel alt sistemlerinin neler olduğunu bulun.
zh_cn: 组织你的机器人并找出它的关键子系统是什么。

source: Check that you have enough channels for all of your sensors and actuators.
es_mx: Compruebe que tiene suficientes canales para todos sus sensores y actuadores.
fr_ca: Vérifiez que vous avez suffisamment de canaux pour tous vos capteurs et actuateurs.
tr_tr: Tüm sensörleriniz ve aktüatörleriniz için yeterli kanalınız olup olmadığını kontrol edin.
zh_cn: 检查您的所有传感器和执行器是否有足够的通道。

source: Generate wiring diagrams.
es_mx: Generar diagramas de cableado.
fr_ca: Générer des diagrammes de câblage.
tr_tr: Kablolama şemaları oluşturun.
zh_cn: 生成接线图。

source: Easily modify your operator interface.
es_mx: Modifique fácilmente su interfaz de operador.
fr_ca: Modifiez facilement votre interface opérateur.
tr_tr: Operatör arayüzünüzü kolayca değiştirin.
zh_cn: 轻松修改您的操作员界面。

source: More...
es_mx: Más...
fr_ca: Plus...
tr_tr: Daha...
zh_cn: 更多

source: Creating a program with RobotBuilder is a very straight forward procedure by following a few steps that are the same for any robot. This lesson describes the steps that you can follow. You can find more details about each of these steps in subsequent sections of the document.
es_mx: La creación de un programa con RobotBuilder es un procedimiento muy sencillo al seguir pocos pasos que son los mismos para cualquier robot. Esta lección describe los pasos que puede seguir. Puede encontrar más detalles sobre cada uno de estos pasos en las secciones siguientes del documento.
fr_ca: La création d’un programme avec RobotBuilder est une procédure très simple en suivant quelques étapes qui sont les mêmes pour n’importe quel robot. Cette leçon décrit les étapes que vous pouvez suivre. Vous trouverez plus de détails sur chacune de ces étapes dans les sections suivantes du document.
tr_tr: RobotBuilder ile bir program oluşturmak, herhangi bir robot için aynı olan birkaç adımı izleyerek çok basit bir işlemdir. Bu ders takip edebileceğiniz adımları açıklamaktadır. Belgenin sonraki bölümlerinde bu adımların her biri hakkında daha fazla ayrıntı bulabilirsiniz.
zh_cn: 通过遵循对于任何机器人都相同的几个步骤，使用RobotBuilder创建程序是非常简单的过程。本课描述了您可以执行的步骤。您可以在本文档的后续部分中找到有关每个步骤的更多详细信息。

source: RobotBuilder generates code using the new Command Framework. For more details on the new framework see :ref:`Command Based Programming <docs/software/commandbased/index:Command-Based Programming>`.
es_mx: RobotBuilder genera código utilizando el nuevo marco de trabajo de comandos. Para más detalles sobre el nuevo marco de trabajo, consulte :ref:`Command Based Programming <docs/software/commandbased/index:Command-Based Programming>`.
fr_ca: RobotBuilder génère du code à l’aide de la nouvelle infrastructure logicielle orientée commande . Pour plus de détails sur la nouvelle infrastructure logicielle, voir :ref:`Programmation orientée commande <docs/software/commandbased/index:Command-Based Programming>`.
tr_tr: RobotBuilder, yeni Command Framework kullanarak kod üretir. Yeni çerçeve hakkında daha fazla ayrıntı için bkz :ref:`Command Based Programming <docs/software/commandbased/index:Command-Based Programming>`.
zh_cn: RobotBuilder 使用新的指令框架生成代码。有关新框架的更多详细信息，请参阅:ref:`基于指令的编程 <docs/software/commandbased/index:Command-Based Programming>`。

source: Divide the Robot into Subsystems
es_mx: Dividir el robot en subsistemas
fr_ca: Diviser le robot en sous-systèmes
tr_tr: Robotu Subsystems-Alt Sistemlere Ayırın
zh_cn: 将机器人划分为不同的子系统

source: Your robot is naturally made up of a number of smaller systems like the drive trains, arms, shooters, collectors, manipulators, wrist joints, etc. You should look at the design of your robot and break it up into smaller, separately operated subsystems. In this particular example there is an elevator, a minibot alignment device, a gripper, and a camera system. In addition one might include the drive base. Each of these parts of the robot are separately controlled and make good candidates for subsystems.
es_mx: Su robot se compone naturalmente de varios sistemas más pequeños como drive trains, brazos, disparadores, recolectores, manipuladores, articulaciones de muñeca, etc. Debe observar el diseño de su robot y dividirlo en subsistemas más pequeños operados por separado. En este ejemplo particular, hay un ascensor, un dispositivo de alineación de minibot, una pinza y un sistema de cámara. Además, se podría incluir la base de la unidad. Cada una de estas partes del robot se controla por separado y son buenas candidatas para subsistemas.
fr_ca: Votre robot est naturellement composé d’un certain nombre de systèmes plus petits tels que les bases pilotables, les bras, les tireurs, les collectionneurs, les manipulateurs, les poignets articulés, etc. Dans la conception de votre robot, pensez à diviser celui-ci en sous-systèmes plus petits et opérés séparément. Dans cet exemple particulier, il y a un élevateur, un dispositif d’alignement de minibot, une pince, et un système de caméra. Sans oublier la base pilotable. Chacune de ces parties du robot est contrôlée séparément et serait donc de bons candidats pour former les sous-systèmes de ce robot.
tr_tr: Robotunuz doğal olarak tahrik trenleri, kollar, atıcılar, toplayıcılar, manipülatörler, bilek eklemleri vb. Gibi bir dizi küçük sistemden oluşur. Robotunuzun tasarımına bakmalı ve onu daha küçük, ayrı çalıştırılan alt sistemlere bölmelisiniz. Bu özel örnekte bir asansör, bir minibot hizalama cihazı, bir kavrayıcı ve bir kamera sistemi bulunmaktadır. Ek olarak sürücü tabanı da içerebilir. Robotun bu parçalarının her biri ayrı ayrı kontrol edilir ve alt sistemler için iyi adaylar oluşturur.
zh_cn: 您的机器人是由许多较小的系统组成的，例如动力传动系统，手臂，射手，收集器，机械手，腕关节等。您应该研究一下机器人的设计并将其分解成较小的，可单独操作的子系统。在这个特定的例子中，有一个升降舵，一个小型机器人对准装置，一个抓具和一个摄像系统。另外，可能包括驱动器基座。机器人的这些部分中的每一个都受到单独控制。

source: For more information see :doc:`Creating a Subsystem <robotbuilder-creating-subsystem>`.
es_mx: Para obtener más información, consulte :doc:`Creating a Subsystem<robotbuilder-creating-subsystem> `.
fr_ca: Pour plus d’informations, voir :doc:`Creating a Subsystem <robotbuilder-creating-subsystem>`.
tr_tr: Daha fazla bilgi için bkz : doc: "Bir Alt Sistem Oluşturma <robotbuilder-creating-subsystem>`.
zh_cn: 有关更多信息，请参阅创建子系统<robotbuilder-creating-subsystem>。

source: Adding each Subsystem to the Project
es_mx: Agregar cada subsistema al proyecto
fr_ca: Ajout de chaque sous-système au projet
tr_tr: Her Alt Sistemi Projeye Ekleme
zh_cn: 将每个子系统添加到项目

source: Each subsystem will be added to the "Subsystems" folder in the RobotBuilder and given a meaningful name. For each of the subsystems there are several attributes that get filled in to specify more information about the subsystems. In addition there are two types of subsystems that you might want to create:
es_mx: Cada subsistema se agregará a la carpeta "Subsystems" en RobotBuilder y se le dará un nombre significativo. Para cada uno de los subsistemas hay varios atributos que se completan para especificar más información sobre los subsistemas. Además, hay dos tipos de subsistemas que quizás desee crear:
fr_ca: Chaque sous-système sera ajouté au dossier "Subsystems" dans le RobotBuilder et donné un nom significatif. Pour chacun des sous-systèmes, plusieurs attributs sont remplis pour des informations plus précises sur les sous-systèmes. En outre, il existe deux types de sous-systèmes d'intérêt :
tr_tr: Her alt sistem, RobotBuilder'daki "Subsystems-Alt Sistemler" klasörüne eklenecek ve anlamlı bir ad verilecektir. Alt sistemlerin her biri için, alt sistemler hakkında daha fazla bilgi belirtmek için doldurulan birkaç öznitelik vardır. Ek olarak, oluşturmak isteyebileceğiniz iki tür alt sistem vardır:
zh_cn: 每个子系统将被添加到RobotBuilder的“ Subsystems”文件夹中，并赋予一个有意义的名称。对于每个子系统，都有几个属性被填充以指定有关子系统的更多信息。另外，您可能要创建两种类型的子系统：

source: PIDSubsystems - often it is desirable to control a subsystems operation with a PID controller. This is code in your program that makes the subsystem element, for example arm angle, more quickly to a desired position then stop when reaching it. PIDSubsystems have the PID Controller code built-in and are often more convenient then adding it yourself. PIDSubsystems have a sensor that determines when the device has reached the target position and an actuator (motor controller) that is driven to the setpoint.
es_mx: SubsistemasPID - a menudo es deseable controlar la operación de un subsistema con un controlador PID. Este es un código en su programa que hace que el elemento del subsistema, por ejemplo el ángulo del brazo, sea más rápido hasta una posición deseada y luego se detenga al alcanzarla. Los SubsistemasPID tienen el código del controlador PID incorporado y a menudo son más convenientes que agregarlo usted mismo. Los SubsistemasPID tienen un sensor que determina cuando el dispositivo ha alcanzado la posición deseada y un actuador (controlador de motor) que es conducido al punto de ajuste.
fr_ca: PIDSubsystems - souvent il est souhaitable de contrôler l'opération d'un sous-systèmes à l'aide un contrôleur PID. Il s’agit de code dans votre programme qui permet d'amener un paramètre du sous-système, par exemple l’angle du sous-système bras, plus rapidement à une position désirée, puis d'arrêter la rotation lorsque cette position est atteinte. Les sous-systèmes PIDSubsystems ont un code de contrôleur PID intégré et sont souvent plus pratiques à utliser directement plutôt que d’écrire et d'ajouter vous-mêmes du code pour votre contrôleur PID. Les sous-systèmes PIDSubsystems ont un capteur qui détermine quand le dispositif a atteint la position cible et un actionneur (contrôleur de moteur) qui est conduit au point de consigne.
tr_tr: PIDS alt sistemleri - genellikle bir alt sistemin çalışmasını bir PID denetleyicisi ile kontrol etmek istenir. Bu, programınızdaki alt sistem elemanını, örneğin kol açısı gibi, istenen bir konuma daha hızlı ve sonra ulaşırken durmasını sağlayan koddur. PIDSubsystems yerleşik PID Denetleyici koduna sahiptir ve genellikle kendiniz eklemekten daha kullanışlıdır. PIDS alt sistemleri, cihazın hedef konuma ne zaman ulaştığını belirleyen bir sensöre ve ayar noktasına sürülen bir aktüatöre (motor kontrolörü) sahiptir.
zh_cn: PIDSubsystems-通常希望使用PID控制器控制子系统的运行。这是程序中的代码，可使子系统，例如手臂角度，更快地到达所需位置，然后在到达所需位置时停止。 PIDSubsystems内置了PID控制器代码，通常比自己添加起来更方便。 PIDSubsystems具有确定设备何时到达目标位置的传感器和驱动至设定点的执行器（电动机控制器）。

source: Regular subsystem - these subsystems don't have an integrated PID controller and are used for subsystems without PID control for feedback or for subsystems requiring more complex control than can be handled with the default embedded PID controller.
es_mx: Subsistema regular - estos subsistemas no tienen un controlador PID integrado y se utilizan para subsistemas sin control PID para retroalimentación o para subsistemas que requieren un control más complejo que el que se puede manejar con el controlador PID integrado predeterminado.
fr_ca: Sous-système régulier - ces sous-systèmes ne disposent pas d’un contrôleur PID intégré et sont utilisés pour les sous-systèmes sans contrôle PID pour la rétroaction ou pour les sous-systèmes nécessitant un contrôle plus complexe que ce qui peut être manipulé avec le contrôleur pid incorporé par défaut.
tr_tr: Normal alt sistem - bu alt sistemlerin entegre bir PID denetleyicisi yoktur ve geri bildirim için PID kontrolü olmayan alt sistemler için veya varsayılan yerleşik PID denetleyiciyle ele alınabilecek olandan daha karmaşık denetim gerektiren alt sistemler için kullanılır.
zh_cn: 常规子系统-这些子系统没有集成的PID控制器，用于没有PID控制的子系统来进行反馈，或者用于需要比默认嵌入式PID控制器更复杂的控制的子系统。

source: As you look through more of this documentation the differences between the subsystem types will become more apparent.
es_mx: A medida que lea más de esta documentación, las diferencias entre los tipos de subsistemas se harán más evidentes.
fr_ca: À mesure que vous avancerez dans la lecture de cette documentation, les différences entre les types de sous-systèmes vous apparaîtront plus évidentes.
tr_tr: Bu belgelerin çoğuna baktıkça, alt sistem türleri arasındaki farklar daha belirgin hale gelecektir.
zh_cn: 当您仔细阅读本文档的更多内容时，不同类型的子系统之间的差异将变得更加明显。

source: For more information see :doc:`Creating a Subsystem <robotbuilder-creating-subsystem>` and :ref:`Writing Code for a Subsystem <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code:Writing the Code for a Subsystem>`.
es_mx: Para obtener más información, consulte :doc:`Creación de un subsistema <robotbuilder-creating-subsystem>` y :ref:`Escritura de código para un subsistema <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code:Writing the Code for a Subsystem>`.
fr_ca: Pour plus d’informations, voir :doc:`Creating a Subsystem <robotbuilder-creating-subsystem>` and :ref:`Writing Code for a Subsystem <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code:Writing the Code for a Subsystem>`.
tr_tr: Daha fazla bilgi için bkz : doc: "Creating a Subsystem <robotbuilder-creating-subsystem>" ve : ref: `Write Code for a Subsystem <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code:Writing the Code for a Subsystem>`.
zh_cn: 有关更多信息，请参见创建子系统<robotbuilder-creating-subsystem>和创建子系统<docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code:Writing the Code for a Subsystem>的代码。

source: Adding Components to each of the Subsystems
es_mx: Agregar componentes a cada uno de los subsistemas
fr_ca: Ajout de composants à chacun des sous-systèmes
tr_tr: Alt Sistemlerin her birine Bileşen Ekleme
zh_cn: 向每个子系统添加组件

source: Each subsystem consists of a number of actuators, sensors and controllers that it uses to perform its operations. These sensors and actuators are added to the subsystem with which they are associated. Each of the sensors and actuators comes from the RobotBuilder palette and is dragged to the appropriate subsystem. For each, there are usually other properties that must be set such as port numbers and other parameters specific to the component.
es_mx: Cada subsistema consta de una serie de actuadores, sensores y controladores que utiliza para realizar sus operaciones. Estos sensores y actuadores se agregan al subsistema con el que están asociados. Cada uno de los sensores y actuadores proviene de la paleta RobotBuilder y se arrastra al subsistema apropiado. Para cada uno, generalmente hay otras propiedades que se deben configurar, como números de puerto y otros parámetros específicos del componente.
fr_ca: Chaque sous-système se compose d’un certain nombre d’actionneurs, de capteurs et de contrôleurs qu’il utilise pour effectuer ses opérations. Ces capteurs et actionneurs sont ajoutés au sous-système auquel ils sont associés. Chacun des capteurs et actionneurs provient de la palette RobotBuilder et est traîné vers le sous-système approprié. Pour chacune d’elles, il y a généralement d’autres propriétés qui doivent être définies, telles que les numéros de port et d’autres paramètres spécifiques au composant.
tr_tr: Her bir alt sistem, işlemlerini gerçekleştirmek için kullandığı bir dizi aktüatör, sensör ve denetleyiciden oluşur. Bu sensörler ve aktüatörler, ilişkili oldukları alt sisteme eklenir. Sensörlerin ve aktüatörlerin her biri, RobotBuilder paletinden gelir ve uygun alt sisteme sürüklenir. Her biri için, genellikle bağlantı noktası numaraları ve bileşene özgü diğer parametreler gibi ayarlanması gereken başka özellikler vardır.
zh_cn: 每个子系统都包含许多执行器，传感器和控制器，用于执行其操作。这些传感器和执行器将添加到与其关联的子系统。每个传感器和执行器均来自RobotBuilder面板，并拖到相应的子系统中。对于每一个传感器和执行器，通常都必须设置一些特定的属性，例如端口号和特定于组件的其他参数。

source: In this example there is an Elevator subsystem that uses a motor and a potentiometer (motor and pot) that have been dragged to the Elevator subsystem.
es_mx: En este ejemplo, hay un subsistema Elevator que utiliza un motor y un potenciómetro (motor y potenciómetro) que se han arrastrado al subsistema Elevator.
fr_ca: Dans cet exemple, il y a un sous-système Elevateur qui utilise un moteur et un potentiomètre (moteur et pot) qui ont été déplacés vers le sous-système Elevateur.
tr_tr: Bu örnekte, Elevator alt sistemine sürüklenen bir motor ve bir potansiyometre (motor ve pot) kullanan bir Elevator alt sistemi vardır.
zh_cn: 在此示例中，有一个升降舵系统，该子系统使用已拖动到电梯子系统的电动机和电位计（电动机和电位计）。

source: Adding Commands That Describe Subsystem Goals
es_mx: Agregar comandos que describen los objetivos del subsistema
fr_ca: Ajout de commandes qui décrivent les objectifs du sous-système
tr_tr: Alt Sistem Hedeflerini Açıklayan Komutlar Ekleme
zh_cn: 添加描述子系统目标的命令

source: Commands are distinct goals that the robot will perform. These commands are added by dragging the command under the "Commands" folder. When creating a command, there are 7 choices (shown on the palette on the left of the picture):
es_mx: Los comandos son distintos objetivos que el robot realizará. Estos comandos se añaden arrastrando el comando bajo la carpeta "Comandos". Al crear un comando, hay 7 opciones (mostradas en la paleta de la izquierda de la imagen):
fr_ca: Les commandes constituent les différents objectifs que le robot réalisera. Ces commandes sont ajoutées en faisant glisser la commande sous le dossier "Commands". Lors de la création d’une commande, il y a 7 choix (indiqués sur la palette à gauche de l’image) :
tr_tr: Komutlar, robotun gerçekleştireceği farklı hedeflerdir. Bu komutlar, komut "Commands" klasörünün altına sürüklenerek eklenir. Bir komut oluştururken 7 seçenek vardır (resmin solundaki palette gösterilir):
zh_cn: 指令是机器人将执行的不同目标。这些指令是通过拖动“命令”文件夹下的指令来添加的。创建指令时，有7种选择（如图左侧的调色板所示）：

source: Normal commands - these are the most flexible command, you have to write all of the code to perform the desired actions necessary to accomplish the goal.
es_mx: Comandos normales - estos son los comandos más flexibles, debe escribir todo el código para realizar las acciones deseadas necesarias para lograr el objetivo.
fr_ca: Normal commands - ce sont les commandes les plus flexibles, vous devez écrire tout le code pour effectuer les actions souhaitées et nécessaires pour atteindre l’objectif.
tr_tr: Normal komutlar - bunlar en esnek komutlardır, hedefe ulaşmak için gerekli eylemleri gerçekleştirmek için tüm kodu yazmanız gerekir.
zh_cn: 普通指令-这是最灵活的指令，您必须编写所有代码才能执行实现目标所需的所需动作。

source: Timed commands - these commands are a simplified version of a command that ends after a timeout
es_mx: Comandos temporizados - estos comandos son una versión simplificada de un comando que termina después de un tiempo de espera
fr_ca: Timed commands - ces commandes sont une version simplifiée d’une commande qui se termine après un délai d’attente ou timeout
tr_tr: Zamanlanmış komutlar - bu komutlar, bir zaman aşımından sonra sona eren bir komutun basitleştirilmiş bir sürümüdür.
zh_cn: 定时指令 - 这些指令是在超时后结束的指令的简化版本

source: Instant commands - these commands are a simplified versio of a command that runs for one iteration and then ends
es_mx: Comandos instantáneos - estos comandos son una versión simplificada de un comando que se ejecuta durante una iteración y luego termina
fr_ca: Instant commands - ces commandes sont un version simplifiée d’une commande qui s’exécute pour une itération, puis se termine
tr_tr: Anında komutlar - bu komutlar, bir yineleme için çalışan ve ardından sona eren bir komutun basitleştirilmiş bir versiyonudur.
zh_cn: 即时指令 - 这些命令是运行一次迭代然后结束的指令的简化版本

source: Command groups - these commands are a combination of other commands running both in a sequential order and in parallel. Use these to build up more complicated actions after you have a number of basic commands implemented.
es_mx: Grupos de comandos - estos comandos son una combinación de otros comandos que se ejecutan tanto en orden secuencial como en paralelo. Úselos para crear acciones más complicadas después de haber implementado una serie de comandos básicos.
fr_ca: Command groups - ces commandes sont une combinaison d’autres commandes pouvant s'exécuter aussi bien dans un ordre séquentiel et que parallèle. Vous pouvez les utiliser pour créer des actions plus compliquées à partir d’un certain nombre de commandes de base.
tr_tr: Komut grupları - bu komutlar, hem sıralı hem de paralel olarak çalışan diğer komutların birleşimidir. Bir dizi temel komut uygulandıktan sonra daha karmaşık eylemler oluşturmak için bunları kullanın.
zh_cn: 指令组-这些指令是按顺序和并行运行的其他命令的组合。在您实现了许多基本指令之后，可以使用这些指令建立更复杂的操作。

source: Setpoint commands - setpoint commands move a PID Subsystem to a fixed setpoint, or the desired location.
es_mx: Comandos de punto de ajuste - los comandos de punto de ajuste mueven un subsistema PID a un punto de ajuste fijo o la ubicación deseada.
fr_ca: Setpoint commands - Les commandes valeur de consigne déplacent un sous-système PID vers une consigne fixe ou l’emplacement souhaité.
tr_tr: Ayar noktası komutları - ayar noktası komutları bir PID Alt Sistemini sabit bir ayar noktasına veya istenen konuma taşır.
zh_cn: 设定设定值值指令-指令将PID子系统移动到固定的设定值或所需的位置。

source: PID commands - these commands have a built-in PID controller to be used with a regular subsystem.
es_mx: Comandos PID - estos comandos tienen un controlador PID incorporado para ser utilizado con un subsistema regular.
fr_ca: PID commands - ces commandes ont un contrôleur PID intégré à utiliser avec un sous-système régulier.
tr_tr: PID komutları - bu komutlar, normal bir alt sistemle kullanılmak üzere yerleşik bir PID denetleyicisine sahiptir.
zh_cn: PID 指令- 这些指令有一个内置的 PID 控制器，可与常规子系统一起使用。

source: Conditional commands - these commands select one of two commands to run at the time of initialization.
es_mx: Comandos temporizados - estos comandos son una versión simplificada de un comando que termina después de un tiempo de espera
fr_ca: Conditional commands - ces commandes sélectionnent l’une des deux commandes à exécuter au moment de l’initialisation.
tr_tr: Koşullu komutlar - bu komutlar, başlatma anında çalıştırılacak iki komuttan birini seçer.
zh_cn: 条件指令 - 这些指令选择在初始化时运行的两个指令之一。
