Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/starting-robotbuilder.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Starting RobotBuilder
es_mx: Iniciando RobotBuilder
fr_ca: Le démarrage de RobotBuilder
tr_tr: RobotBuilder'ı Başlatma
zh_cn: 启动 RobotBuilder

source: RobotBuilder is a Java program and as such should be able to run on any platform that is supported by Java. We have been running RobotBuilder on macOS, Windows, and various versions of Linux successfully.
es_mx: RobotBuilder es un programa de Java y como tal debe ser capaz de funcionar en cualquier plataforma que sea compatible con Java. Hemos estado ejecutando RobotBuilder en MacOS, Windows y varias versiones de Linux con éxito.
fr_ca: RobotBuilder est un programme Java et devrait pouvoir fonctionner sur n'importe quelle plate-forme qui supporte Java. Nous avons exécuté RobotBuilder sur macOS, Windows et diverses versions de Linux avec succès.
tr_tr: RobotBuilder bir Java programıdır ve bu nedenle Java tarafından desteklenen herhangi bir platformda çalışabilmelidir. RobotBuilder'ı macOS, Windows ve Linux'un çeşitli sürümlerinde başarıyla çalıştırıyoruz.
zh_cn: RobotBuilder 是一个 Java 程序所以应该可以在任何支持 Java 的平台上运行。我们已经在 macOS , Windows 和各种版本的 Linux 上成功运行了 RobotBuilder 。

source: Getting RobotBuilder
es_mx: Consiguiendo RobotBuilder
fr_ca: Obtenir une copie de RobotBuilder
tr_tr: RobotBuilder'ı Edinme
zh_cn: 获取 RobotBuilder

source: RobotBuilder is downloaded as part of the WPILib Offline Installer. For more information, see the :ref:`Windows/macOS/Linux installation guides <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`
es_mx: RobotBuilder se descarga como parte del instalador offline de WPILib. Para más información, vea la :ref:`Guía de instalación en Windows/macOS/Linux <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`
fr_ca: RobotBuilder est téléchargé et installé par l’utilitaire WPILib Offline Installer. Pour plus d’informations, consultez le document :ref:`Windows/macOS/Linux installation guides <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`
tr_tr: RobotBuilder, WPILib Çevrimdışı Yükleyicinin bir parçası olarak indirilir. Daha fazla bilgi için bkz :ref:`Windows/macOS/Linux installation guides <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`
zh_cn: RobotBuilder 作为 WPILib 离线安装包的一部分被下载。若想得到更多信息，请看:ref:`Windows/macOS/Linux installation guides <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`

source: Option 1 - Starting from Visual Studio Code
es_mx: Opción 1 - Empezando por el código de Visual Studio
fr_ca: Option 1 - Démarrer à partir du code Visual Studio
tr_tr: Seçenek 1 - Visual Studio Kodundan Başlama
zh_cn: 选项1— 从 Visual Studio Code 开始

source: Press :kbd:`Ctrl+Shift+P` and type "WPILib" or click the WPILib logo in the top right to launch the WPILib Command Palette. Select :guilabel:`Start Tool`, then select :guilabel:`Robot Builder`.
es_mx: Presione :kbd:`Ctrl+Shift+P` y escriba "WPILib" o haga clic en el logo de WPILib en la parte superior derecha para lanzar la paleta de comandos de WPILib. Seleccione:guilabel:`Start Tool`, luego seleccione :guilabel:`Robot Builder`.
fr_ca: Appuyez sur :kbd:`Ctrl+Shift+P` et tapez "WPILib" ou cliquez sur le logo WPILib en haut à droite pour lancer la palette de commande WPILib. Sélectionnez :guilabel:`Start Tool`, puis sélectionnez :guilabel:`Robot Builder`.
tr_tr: WPILib Komut Paletini başlatmak için : kbd: `Ctrl + Shift + P`ye basın ve "WPILib" yazın veya sağ üstteki WPILib logosunu tıklayın. Seçin : guilabel: `Start Tool`, ardından : guilabel:` Robot Builder` seçin.
zh_cn: 按下 "Ctrl+Shift+P" 然后输入 "WPILib" 或者单击右上角的WPILib的标志以气动WPILib的指令面板。选择 "Start Tool"，然后选择 "Robot Builder"。

source: Option 2 - Shortcuts
es_mx: Opción 2 - Atajos
fr_ca: Option 2 - Raccourcis
zh_cn: 选项2-捷径

source: Shortcuts are installed to the Windows Start Menu and the ``2021 WPILib Tools`` folder on the desktop.
fr_ca: Les raccourcis sont installés sous Windows dans le menu Démarrer et dans le dossier ``2021 WPILib Tools`` sur le bureau.

source: Option 3 - Running from the Script
es_mx: Opción 3 - Ejecución desde el Script
fr_ca: Option 3 - Exécution à partir du Script
zh_cn: 选项3-从脚本运行

source: The install process installs the tools to ``~/wpilib/YYYY/tools`` (where YYYY is the year and ~ is ``C:\Users\Public`` on Windows).
es_mx: El proceso de instalación instala las herramientas a ``~/wpilib/YYYY/tools`` (donde YYYY es el año y ~`C:\Users\Public`` en Windows).
fr_ca: Le processus d'installation installe les outils dans ``~/wpilib/YYYY/tools`` (où YYYY est l'année et ~ est ``C:\Users\Public`` sous Windows).
tr_tr: Yükleme işlemi, araçları `` ~/wpilib/ YYYY/tools '' konumuna yükler (burada YYYY yılı ve ~, Windows'ta ``C:\Users \Public`` şeklindedir).
zh_cn: 安装过程将工具安装在 ``~/wpilib/YYYY/tools`` 中（YYYY是年份，~在 Windows 系统中是``C:\Users\Public``）。

source: Inside this folder you will find ``.vbs`` (Windows) and ``.py`` (macOS/Linux) files that you can use to launch each tool. These scripts help launch the tools using the correct JDK and are what you should use to launch the tools.
es_mx: Dentro de esta carpeta encontrará archivos ``.vbs`` (Windows) y ``.py`` (macOS / Linux) que puede usar para iniciar cada herramienta. Estos scripts ayudan a iniciar las herramientas utilizando el JDK correcto y son los que debe utilizar para iniciar las herramientas.
fr_ca: À l’intérieur de ce dossier, vous trouverez des fichiers d'extension ``.vbs`` (Windows) et d'extension ``.py`` (macOS/Linux) que vous pouvez utiliser pour lancer chaque outilitaire. Ces scripts permettent de lancer les outilitaires à l’aide de la version JDK adéquate et sont ceux que vous devez utiliser pour lancer les outilitaires.
tr_tr: Bu klasörün içinde, her aracı başlatmak için kullanabileceğiniz ``.vbs`` (Windows) ve ``.py`` (macOS / Linux) dosyalarını bulacaksınız. Bu komut dosyaları, araçları doğru JDK kullanarak başlatmaya yardımcı olur ve araçları başlatmak için kullanmanız gerekenlerdir.
zh_cn: 在文件夹中你可以找到``.vbs`` （Windows）和``.py`` （macOS/Linux）文件，可以用来发动各个工具。这些脚本使用正确的 JDK 来发动各个工具，并且是你需要用来发动工具的脚本。

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
tr_tr: RobotBuilder, yeni komut tabanlı çerçeveyi desteklemek için güncellendi! Ne yazık ki, bu dokümantasyon güncelliğini yitirmiştir ve yalnızca eski komut temelli çerçeve içindir. Bu dokümantasyonu güncellemekle ilgilenen kişiler, "frc-docs <https://github.com/wpilibsuite/frc-docs>" __ deposuna destekte bulunabilirler.

source: Option 2 - Running from the Script
tr_tr: Seçenek 2 - Komut Dosyasından Çalıştırmak
