Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/pathweaver/adding-field-images.po
Languages: fr_ca, zh_cn

source: Adding field images to PathWeaver
fr_ca: Ajout d’images de Terrain à PathWeaver
zh_cn: 将场地图像加入到路径编织器。

source: Here are instructions for adding your own field image using the 2019 game as an example.
fr_ca: Vous trouverez ici des instructions pour ajouter votre propre image de terrain de compétition en utilisant celle du jeu 2019 à titre d’exemple.
zh_cn: 此处是对如何将您个人的场地图像加入路径编织器的指示，此处将使用2019年的比赛作为示例。

source: Games are loaded from the ``~/PathWeaver/Games`` on Linux and macOS or ``%USERPROFILE%/PathWeaver/Games`` directory on Windows. The files can be in either a game-specific subdirectory, or in a zip file in the Games directory. The ZIP file must follow the same layout as a game directory; the JSON file must be in the root of the ZIP file (cannot be in a subdirectory).
fr_ca: Les images des jeux sont chargées à partir du répertoire ``~/PathWeaver/Games`` sous Linux et macOS ou ``%USERPROFILE%/PathWeaver/Games`` sous Windows. Les fichiers peuvent être dans un sous-répertoire spécifique au jeu ou dans un fichier zip à l'intérieur du répertoire Games. Le fichier ZIP doit suivre la même disposition qu’un répertoire de jeux ; Le fichier JSON doit être dans la racine du fichier ZIP (ne peut pas être dans un sous-répertoire).
zh_cn: 比赛内容是从Linux和macOS上的``~/PathWeaver/Games``或Windows上的``%USERPROFILE%/PathWeaver/Games``目录中加载的。这些文件可以位于关于比赛的特定的子目录中，也可以位于Games目录中的zip文件中。 ZIP文件必须遵循与比赛内容目录相同的布局; JSON文件必须位于ZIP文件的根目录中 (不能位于子目录中)。

source: Download the example *FIRST* Destination Deep Space field definition :download:`here <files/DeepSpace.zip>`. Other field definitions are available in the `PathWeaver GitHub repository <https://github.com/wpilibsuite/PathWeaver/tree/main/src/main/resources/edu/wpi/first/pathweaver>`__.
fr_ca: Vous pouvez télécharger l’exemple de définition de terrain de *FIRST* Destination Deep Space :download:`ici <files/DeepSpace.zip>`. D’autres définitions de terrain sont disponibles dans le `Dépôt GitHub PathWeaver <https://github.com/wpilibsuite/PathWeaver/tree/main/src/main/resources/edu/wpi/first/pathweaver>`__.
zh_cn: 在此处<files/DeepSpace.zip>`下载* FIRST * Destination Deep Space 的示例。其他场地定义可在`PathWeaver GitHub存储库<https://github.com/wpilibsuite/PathWeaver/tree/master/src/main/resources/edu/wpi/first/pathweaver>`__中获得。

source: File Layout
fr_ca: Format de fichier
zh_cn: 文件格式

source: JSON Format
fr_ca: Format JSON
zh_cn: JSON格式

source: The path to the field image is relative to the JSON file. For simplicity, the image file should be in the same directory as the JSON file.
fr_ca: Le chemin d’accès à l’image du terrain est relatif au fichier JSON. Pour faire simple, le fichier image doit être placé dans le même répertoire que le fichier JSON.
zh_cn: 场地图像的路径是相对于JSON文件的。为简单起见，图像文件应与JSON文件位于同一目录中。

source: The field corners are the X and Y coordinates of the top-left and bottom-right pixels defining the rectangular boundary of the playable area in the field image. Non-rectangular playing areas are not supported.
fr_ca: En exprimant les coordonnées X et Y en pixels, les coins du terrain correspondant au point situé en haut à gauche et à celui situé en bas à droite définissent les limites de l'aire rectangulaire de la zone jouable dans l’image du terrain. Les aires de jeu non rectangulaires ne sont pas prises en charge.
zh_cn: 场角是 X 坐标与 Y 坐标在场地左上角与右下角的交点，用于定义场地图像中可操作的矩形区域。非矩形的操作区域将不被支持。

source: The field size is the width and length of the playable area of the field in the provided units.
fr_ca: La taille du terrain est la largeur et la longueur de l'aire de jeu du terrain dans les unités fournies.
zh_cn: 场地的尺寸是可操作区域的长和宽，场地的尺寸将以既定的单位给出。

source: The field units are case-insensitive and can be in meters, cm, mm, inches, feet, yards, or miles. Singular, plural, and abbreviations are supported (e.g. "meter","meters", and"m"are all valid for specifying meters)
fr_ca: Les unités du terrain sont insensibles à la casse et peuvent être en mètres, cm, mm, pouces, pieds, yards, ou miles. Le singulier, le pluriel et les abréviations sont pris en charge (p. ex. "mètre", "mètres", et "m" sont toutes valables pour définir les mètres)
zh_cn: 场地单位不区分大小写，可以以米，厘米，毫米，英寸，英尺，码或英里为单位。支持单数，复数和缩写 (例如，“meter”，“meters”和“ m”对于指定米均有效)。

source: When making a new field image, a border (minimum of 20 pixels is recommended) should be left around the outside so that waypoints on the field edge are accessible.
fr_ca: Lors de la création d'une nouvelle image de champ, une bordure (un minimum de 20 pixels est recommandé) doit être laissée à l'extérieur afin que les points de cheminement sur le bord du champ soient accessibles.
zh_cn: 当创建一个新的域图像时，应该在外部留下一个边界(建议至少20像素)，这样域边缘上的路径点就可以访问了。
