Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/pathweaver/creating-pathweaver-project.po
Languages: es_mx, tr_tr

source: Creating a Pathweaver Project
es_mx: Crear un Proyecto de PathWeaver
tr_tr: Pathweaver Projesi Oluşturmak

source: PathWeaver is the tool used to draw the paths for a robot to follow. The paths for a single program are stored in a PathWeaver project.
es_mx: PathWeaver es la herramienta usada para dibujar rutas que debe seguir el robot. Las trayectorias para un solo programa se almacenan en un proyecto de PathWeaver.
tr_tr: PathWeaver, bir robotun izleyeceği yolları çizmek için kullanılan araçtır. Tek bir programın izleyeceği yollar PathWeaver projesinde saklanmaktadır.

source: Starting PathWeaver
es_mx: Iniciando PathWeaver
tr_tr: PathWeaver'ın Başlatılması

source: PathWeaver is started by clicking on the ellipsis icon in the top right of the corner of the Visual Studio Code interface. You must select a source file from the WPILib project to see the icon. Then click on "Start tool" and then click on "PathWeaver" as shown below.
es_mx: PathWeaver se inicia haciendo clic en el ícono de los tres puntos en la parte superior de la esquina de la interfaz de Visual Studio Code. Luego, haga clic en el “Start tool” o herramienta de inicio y luego haga clic en "PathWeaver" como se muestra a continuación.
tr_tr: PathWeaver, Visual Studio Code arayüzünün sağ üst köşesindeki üç nokta simgesine tıklanarak başlatılmaktadır. Simgeyi görmek için WPILib projesinden bir kaynak dosyası seçmeniz gerekmektedir. Ardından "Start tool - Aracı başlat" seçeneğine ve aşağıda gösterildiği gibi "PathWeaver" seçeneğine tıklayınız.

source: Creating the Project
es_mx: Creando el proyecto
tr_tr: Projenin Oluşturulması

source: To create a PathWeaver project, click on "Create project" and then fill out the project creation form. Notice that hovering over any of the fields in the form will display more information about what is required.
es_mx: Para crear un proyecto PathWeaver, haga clic en "Create project" y luego llene la creación del proyecto. Note que al pasar el cursor sobre cualquiera de los campos del formulario se mostrará más información acerca de lo que se requiere.
tr_tr: Bir PathWeaver projesi oluşturmak için "Create project - Proje oluştur" üzerine tıklayın ve ardından proje oluşturma formunu doldurun. İmlecinizi formdaki alanlardan herhangi birinin üzerinde gezdirmek, alanda neyin gerekli olduğu hakkında daha fazla bilgi görüntüleyecektir.

source: **Project Directory:** This is normally the top level project directory that contains the build.gradle and src files for your robot program. Choosing this directory is the expected way to use PathWeaver and will cause it to locate all the output files in the correct directories for automatic path deployment to your robot.
es_mx: **Project Directory:** Este es normalmente el directorio de proyecto de nivel superior que contiene el build.gradle y archivos src para el programa de su robot. Elegir este directorio es la forma esperada de usar PathWeaver y hará que localice todos los archivos de salida en los directorios correctos para el despliegue automático de la ruta a su robot.

source: **Output directory:** The directory where the paths are stored for deployment to your robot. If you specified the top level project folder of our robot project in the previous step (as recommended) filling in the output directory is optional.
es_mx: **Output directory:** El directorio donde se almacenan las rutas para su implementación en su robot. Si especificó la carpeta del proyecto de nivel superior de nuestro proyecto de robot en el paso anterior (como se recomienda), completar el directorio de salida es opcional.

source: **Game:** The game (which FRC\ |reg| game is being used) will cause the correct field image overlay to be used. You can also create your own field images and the procedure will be described later in this series.
es_mx: **Juego:** El juego ( el juego FRC \ |reg| que se está usando) hará que se use la superposición de imagen de campo correcta. También puede crear sus propias imágenes de campo y el procedimiento se describirá más adelante en esta serie.

source: **Length Unit:** The units to be used in describing your robot and for the field measurements when visualizing trajectories using PathWeaver.
es_mx: **Length Unit:** Las unidades que se utilizarán para describir su robot y para las mediciones de campo al visualizar trayectorias con PathWeaver.

source: **Export Unit:** The units to be used when exporting the paths and waypoints. If you are planning to use WPILib Trajectories, then you should choose :guilabel:`Always Meters`. Choosing :guilabel:`Same as Project` will export in the same units as :guilabel:`Length Unit` above.
es_mx: **Export Unit:** Las unidades que se utilizarán al exportar las rutas y los puntos de referencia. Si está planeando utilizar WPILib Trajectories, entonces debe elegir :guilabel:`Always Meters`. Si elige :guilabel:`Same as Project` se exportará en las mismas unidades que :guilabel:`Length Unit`.

source: **Max Velocity:** The max speed of the robot for trajectory tracking. This does not need to be the maximum attainable speed of the robot, but just the max speed that you want to run trajectories at.
es_mx: **Max Velocity:** Este campo es sobre la velocidad máxima del robot para el seguimiento de la trayectoria. No necesita ser la velocidad máxima que pueda alcanzar el robot, pero sólo la máxima velocidad a la que usted quiera correr las trayectorias.

source: **Max Acceleration:** The max acceleration of the robot for trajectory tracking. This does not need to be the maximum attainable acceleration of the robot, but just the max acceleration that you want to run trajectories at.
es_mx: **Max Acceleration:** Este campo se refiere a la máxima aceleración del robot para el seguimiento de la trayectoria. No tiene que ser la máxima aceleración que el robot puede alcanzar, pero sólo la máxima aceleración en la que usted quiera correr las trayectorias

source: **Wheel Base:** The distance between the left and right wheels of your robot. This is used to ensure that no wheel on a differential drive will go over the specified max velocity around turns.
es_mx: **Wheel Base:** Se refiere a la distancia entre los ejes del chasis del robot. Esto se usa para asegurar que ninguna rueda de un accionamiento diferencial pasará por encima de la velocidad máxima especificada en las vueltas.

source: PathWeaver User Interface
es_mx: Interfaz de usuario de PathWeaver

source: The PathWeaver user interface consists of the following:
es_mx: La interfaz de usuario de PathWeaver consiste en lo siguiente:

source: The field area in the top left corner, which takes up most of the PathWeaver window. Trajectories are drawn on this part of the program.
es_mx: El área del campo de juego en la esquina superior izquierda. Las trayectorias son dibujadas en esta parte del programa.

source: The properties of the currently selected waypoint are displayed in the bottom pane. These properties include the X and Y, along with the tangents at each point.
es_mx: Las propiedades de la actual ruta seleccionada se muestran en el panel inferior. Estas propiedades incluyen la X & Y, junto con las tangentes en cada punto.

source: A group of paths (or an "autonomous" mode) is displayed on the upper right side of the window. This is a convenient way of seeing all of the trajectories in a single auto mode.
es_mx: Un grupo de rutas (o un modo "autónomo") es mostrado en la ventana superior derecha. Esta es una conveniente forma para ver todas las trayectorias en un solo modo autónomo.

source: The individual paths that a robot might follow are displayed in the lower right side of the window.
es_mx: Las trayectorias individuales que un robot podría seguir se muestran en la parte inferior derecha de la ventana.

source: The "Build Paths" button will export the trajectories in a JSON format. These JSON files can be used from the robot code to follow the trajectory.
es_mx: El botón “Build Paths” o construir trayectorias, exportará las trayectorias en un formato JSON. Estos archivos JSON pueden ser usados del código del robot para seguir la trayectoria.

source: The "Edit Project" button allows you to edit the project properties.
es_mx: El botón “Edit Project” o editar proyecto le permite editar las propiedades del proyecto.

source: In VSCode select "..." in the upper right corner and then "Start Tool".
tr_tr: VSCode'da önce sağ üst köşedeki "..." seçeneğini, ardından "Start Tool" seçeneğini seçiniz.

source: Choose PathWeaver from the tool dropdown list.
tr_tr: Araçlar açılır listesinden PathWeaver seçeneğini seçiniz.

source: The PathWeaver project creation screen.
tr_tr: PathWeaver proje oluşturma ekranı

source: **Max Velocity:** The max speed of the robot for trajectory tracking. The kitbot runs at ~10 :math:`ft/sec` which is ~3 :math:`m/sec`.
tr_tr: **Max Velocity - Maksimu Hız:** Yörünge takibi sırasında robotun ulaştığı en yüksek hız. Kiitbot ~10 :math:`ft/sec`, yani ~3 :math:`m/sec` hızında çalışmaktadır.

source: **Max Acceleration:** The max acceleration of the robot for trajectory tracking. Using a conservative 1 :math:`m/sec^2` is a good place to start if you don't know your drivetain's characteristics.
tr_tr: **Max Acceleration - Maksimum İvme:** Yörünge takibi sırasında robotun ulaştığı en yüksek ivme. Aktarma sisteminizin özelliklerine hakim değilseniz, temkinli bir 1 :math:`m/sec^2` değeri iyi bir başlangıç noktası olacaktır.

source: An overview of the PathWeaver user interface.
tr_tr: PathWeaver kullanıcı arayüzüne genel bir bakış
