Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/pathweaver/drawing-pathweaver-path.po
Languages: es_mx, fr_ca

source: Visualizing PathWeaver Trajectories
es_mx: Visualizar las Trayectorias de PathWeaver
fr_ca: Visualisation des trajectoires PathWeaver

source: PathWeaver's primary feature is to visualize trajectories. The following images depict a smooth trajectory that represents a trajectory that a robot might take during the autonomous period. Paths can have any number of waypoints that can allow more complex driving to be described. In this case there are 3 waypoints (including the start and stop) depicted with the triangle icons. Each waypoint consists of a X, Y position on the field as well as a robot heading described as the X and Y tangent lines.
es_mx: La principal característica de PathWeaver es visualizar trayectorias. Las siguientes imágenes muestran una trayectoria suave que representa una trayectoria que un robot podría tomar durante el período autónomo. Las rutas pueden tener cualquier número de puntos que permiten una conducción más compleja para ser descritas. En este caso hay 3 puntos de ruta (incluyendo el inicio y la parada) representados con los íconos de triángulos. Cada punto de ruta consiste de una posición X, Y en el campo de juego, así como una dirección del robot descritas como las líneas tangentes X & Y.
fr_ca: La principale caractéristique de PathWeaver est de visualiser les trajectoires. Les images suivantes représentent une trajectoire lisse qui correspond à une trajectoire qu’un robot pourrait prendre pendant la période Autonome. Les trajectoires peuvent avoir n’importe quel nombre de points de passage ou waypoints qui permettent de définir des trajectoies beaucoup plus complexes. Dans ce cas, il ya 3 points de passage (incluant le début et l’arrêt) représentés avec les icônes triangulaires. Chaque point de passage se compose d’une position X, Y sur le terrain ainsi que de l'orientation du robot décrite comme des lignes tangentielles en X et Y.

source: A complete PathWeaver path to the back side of the rocket in Deep Space.
fr_ca: Une trajectoire complète PathWeaver vers l’arrière de la fusée de la compétition Deep Space..

source: Creating the Initial Trajectory
es_mx: Crear la Trayectoria Inicial
fr_ca: Création de la trajectoire initiale

source: To start creating a trajectory, click the + (plus) button in the path window. A default trajectory will be created that probably does not have the proper start and end points that you desire. The path also shows the tangent vectors (teal lines) for the start and end points. Changing the angle of the tangent vectors changes the shape of the trajectory.
es_mx: Para empezar a crear una trayectoria, haga clic en el botón + (más) en la ventana Path. Una trayectoria por defecto se creará que probablemente no tenga los puntos de inicio y final adecuados que se desea. El camino también muestra los vectores tangentes (líneas azul verdoso) para los puntos de inicio y final. Cambiando el ángulo de los vectores tangentes cambia la forma de la trayectoria.
fr_ca: Pour débuter la création d'une trajectoire, cliquez sur le bouton + (plus) dans la fenêtre **Paths** en bas à droite. Une trajectoire par défaut sera créée qui n’a probablement pas les points de début et de fin que vous désirez. Cette trajectoire affiche également les vecteurs tangents (lignes de couleur sarcelle) aux points de début et de fin de trajectoire. En changeant l’angle de ces vecteurs tangents, on modifie la forme de la trajectoire.

source: The waypoint positions when a path is first created. The first is in the far upper left corner. The second is turned 90 degrees facing downward.
fr_ca: Position des points de repère lors de la création d’une trajectoire. Le premier se trouve dans le coin supérieur gauche. Le second est tourné à 90 degrés face vers le bas.

source: Drag the start and end points of the trajectory to the desired locations. Notice that in this case, the default trajectory does not start in a legal spot for the 2019 game. We can drag the initial waypoint to make the robot start on the HAB.
es_mx: Arrastre los puntos de inicio y final de la trayectoria a los lugares deseados por usted. Note que, en este caso, la trayectoria por defecto no comienza en un punto legal para el juego de 2019 Deep Space. Podemos arrastrar el punto inicial para hacer que el robot se ponga en marcha en el HAB o hábitat: punto de partida del robot durante la temporada Deep Space en 2019.
fr_ca: Faites glisser les points de début et de fin de la trajectoire vers les emplacements souhaités. Notez que dans ce cas, la trajectoire par défaut ne commence pas dans un point légal pour le jeu 2019. Nous pouvons faire glisser le point de passage initial pour faire démarrer le robot sur la Plateforme d'Habitat.

source: Changing a Waypoint Heading
es_mx: Cambiar el Rumbo del Punto de Ruta
fr_ca: Modification de l'orientation d'un point de passage

source: The robot heading can be changed by dragging the tangent vector (teal) line. Here, the final waypoint was dragged to the desired final pose and was rotated to face the rocket.
es_mx: La dirección del robot puede ser cambiada arrastrando la línea del vector tangente (línea azul verdosa). En la siguiente imagen, el punto final fue arrastrado a la posición final deseada y fue rotado para estar frente al cohete.
fr_ca: L'orientation du robot peut être modifiée en faisant glisser le support du vecteur tangent (sarcelle). Ici, le point de passage final a été déplacée à la pose finale désirée et a été tourné pour faire face à la fusée.

source: Adjusting the blue line out the front of each waypoint controls the direction it is facing.
fr_ca: Le réglage de la ligne bleue située en avant de chaque point de repère contrôle la direction à laquelle elle fait face.

source: Adding Additional Waypoints to Control the Robot Path
es_mx: Añadir puntos de ruta adicionales para controlar la ruta que seguirá el robot.
fr_ca: Ajout de points de passage supplémentaires pour contrôler la trajectoire du robot

source: Adding additional waypoints and changing their tangent vectors can affect the path that is followed. Additional waypoints can be added by dragging in the middle of the path. In this case, we added another waypoint in the middle of the path.
es_mx: Añadir puntos de ruta adicionales y cambiar los vectores tangentes puede afectar el camino que es seguido. Los puntos de ruta adicionales pueden ser añadidos arrastrando la ruta de en medio. En este caso, añadimos otro punto de ruta en medio del camino.
fr_ca: L’ajout de points de passage supplémentaires et la modification de leurs vecteurs tangents peuvent affecter la trajectoire suivie. Des points de passage supplémentaires peuvent être ajoutés en faisant glisser la souris à l'endroit voulu de la trajectoire. Dans ce cas, nous avons ajouté un autre point de passage au milieu du trajet.

source: Adding an additional waypoint by clicking and dragging on the middle of the path.
fr_ca: Ajout d’un point de repère supplémentaire en cliquant et en faisant glisser au milieu de la trajectoire.

source: Locking the Tangent Lines
es_mx: Bloqueando las líneas tangentes.
fr_ca: Verrouillage des lignes tangentielles

source: Locking tangent lines prevents them from changing when the trajectory is being manipulated. The tangent lines will also be locked when the point is moved.
es_mx: Bloquear las líneas tangentes impide que cambien cuando se manipula la trayectoria. Las líneas tangentes también se bloquearán cuando el punto es movido.
fr_ca: Le verrouillage des lignes tangentielles les empêche de changer lorsque la trajectoire est manipulée. Les lignes tangentielles seront également verrouillées lorsque le point est déplacé.

source: More Precise control of Waypoints
es_mx: Control más preciso de los puntos de ruta
fr_ca: Contrôle plus précis des points de passage

source: While PathWeaver makes it simple to draw trajectories that the robot should follow, it is sometimes hard to precisely set where the waypoints should be placed. In this case, setting the waypoint locations can be done by entering the X and Y value which might come from an accurate CAD model of the field. The points can be entered in the X and Y fields when a waypoint is selected.
es_mx: Mientras que PathWeaver hace simple el trazado de las trayectorias que el robot debería seguir, a veces es difícil establecer con precisión dónde deberían ser colocados los puntos de ruta. En este caso, establecer las ubicaciones de los puntos de ruta se puede hacer introduciendo los valores X & Y que pueden provenir de un modelo CAD o Diseño Asistido por Computadora preciso del campo de juego. Los puntos pueden ser introducidos en los campos de pregunta X & Y cuando un punto de ruta es seleccionado.
fr_ca: Bien que PathWeaver facilite le dessin des trajectoires que le robot doit suivre, il est parfois difficile de définir avec précision l'emplacement des points de passage. Dans ce cas, la définition des emplacements de point de passage peut être effectuée en entrant la valeur X et Y qui pourrait provenir d’un modèle CAD précis du terrain. Les points peuvent être entrés dans les champs X et Y lorsqu’un point de passage est sélectionné.
