Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/smartdashboard/changing-display-properties.po
Languages: es_mx, fr_ca

source: Changing the display properties of a value
es_mx: Cambiar las propiedades de visualización de un valor
fr_ca: Modification des propriétés d’affichage d’une valeur

source: Each value displayed with SmartDashboard has a a set of properties that effect the way it's displayed.
fr_ca: Chaque valeur affichée sur SmartDashboard a un ensemble de propriétés qui affectent la façon dont elle est affichée.

source: Setting the SmartDashboard display into editing mode
es_mx: Configurar el modo de edición en el visualizador de la SmartDashboard
fr_ca: Configuration de l’affichage de SmartDashboard en mode édition

source: Select Editable from the View menu.
fr_ca: Sélectionnez Editable dans le menu View.

source: The SmartDashboard has two modes it can operate in, display mode and edit mode. In edit mode you can move around widgets on the screen and edit their properties. To put the SmartDashboard into edit mode, click the "View" menu, then select "Editable" to turn on edit mode.
es_mx: La SmartDashboard tiene dos modos de operación: el modo de visualización y el modo de edición. En el segundo, usted puede cambiar la posición de los widgets en la pantalla y editar sus propiedades. Para cambiar al modo de edición en la SmartDashboard, debe presionar el menú “View”, luego seleccione “Editable” para acceder al modo de edición.
fr_ca: SmartDashboard dispose de deux modes de fonctionnement: affichage et édition. En mode édition, vous pouvez déplacer les widgets à l’écran et modifier leurs propriétés. Pour placer SmartDashboard en mode édition, cliquez sur le menu "View", puis sélectionnez "Editable" pour effectivement activer le mode édition.

source: Getting the properties editor of a widget
es_mx: Acceder al editor de propiedades de un widget
fr_ca: Propriétés d'édition d’un widget

source: Right click on any widget and choose properties.
fr_ca: Cliquer avec le bouto droit de la souris sur n’importe quel widget et choisissez properties.

source: Once in edit mode, you can display and edit the properties for a widget. Right-click on the widget and select "Properties...".
es_mx: Una vez que ha cambiado al modo de edición, podrá visualizar las propiedades de los widgets al presionar el botón derecho del ratón sobre el widget y seleccionar “Properties…”.
fr_ca: Une fois en mode édition, vous pouvez afficher et modifier les propriétés d’un widget. Cliquez avec le bouton droit sur le widget et sélectionnez "Properties...".

source: Editing the properties on a field
es_mx: Configurar las propiedades en un campo
fr_ca: Modification des propriétés d’un champ

source: Edit properties from the dialog window that pops up.
fr_ca: Modifiez les propriétés de la fenêtre de dialogue qui s’affiche.

source: A dialog box will be shown in response to the "Properties..." menu item on the widgets right-click context menu.
es_mx: Se mostrará una ventana de diálogo en respuesta del menú de "Properties..." en el menú del click derecho.
fr_ca: Une boîte de dialogue s’affiche en réponse à l’item menu "Properties..." du menu contextuel des widgets.

source: Editing the widgets background color
es_mx: Editar el color de fondo de los widgets
fr_ca: Modification de la couleur d’arrière-plan des widgets

source: Change the background color of the widget using a color palette.
fr_ca: Modifiez la couleur d’arrière-plan du widget à l’aide d’une palette de couleurs.

source: To edit a property value, say, Background color, click the background color shown (in this case grey), and choose a color from the color editor that pops up. This will be used as the widgets background color.
es_mx: Para cambiar el valor de una propiedad, por ejemplo, el color de fondo, haga click en el color de fondo mostrado (gris, en este caso) y escoja un color en el editor que aparecerá en pantalla. Este será el nuevo color de fondo de los widgets.
fr_ca: Pour modifier la valeur d'une propriété, par exemple, la couleur de l’arrière-plan, cliquez sur la couleur de l’arrière-plan affichée (gris dans ce cas-ci), puis choisissez une couleur dans la palette de couleurs qui apparaît. Ceci sera utilisé comme couleur de l’arrière-plan des widgets.

source: Edit properties of other widgets
es_mx: Editar las propiedades de otros widgets
fr_ca: Modification des propriétés d'autres widgets

source: Each widget has unique properties.
fr_ca: Chaque widget possède des propriétés uniques.

source: Different widget types have different sets of editable properties to change the appearance. In this example, the upper and lower limits of the dial and the tick interval are changeable parameters.
es_mx: Cada tipo de widget tiene diferentes conjuntos de propiedades editables para cambiar su apariencia. En este ejemplo, los límites superior e inferior, y el intervalo entre tics son parámetros configurables.
fr_ca: Différents types de widget ont différents ensembles de propriétés modifiables pour en changer l’apparence. Dans cet exemple, les paramètres Upper Limit, Lower Limit et Tick interval sont tous modifiables.
