Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/smartdashboard/choosing-an-autonomous-program-from-smartdashboard.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Choosing an Autonomous Program
es_mx: Elección de un programa autónomo
fr_ca: Choisir un programme autonome
tr_tr: Otonom Program Seçimi
zh_cn: 选择自动阶段动程序

source: Often teams have more than one autonomous program, either for competitive reasons or for testing new software. Programs often vary by adding things like time delays, different strategies, etc. The methods to choose the strategy to run usually involves switches, joystick buttons, knobs, or other hardware based inputs.
tr_tr: Çoğu zaman takımlar ya müsabakayla ilgili sebepler yüzünden ya da yeni yazılım denemek için birden fazla otonom programa sahiptir. Programlar zaman geciktirme, farklı stratejiler vb. özelliklerin eklenmesiyle birbirleri arasında farklılaşmaktadır. Programın çalıştırılması için seçilen yöntemler genellikle anahtarlar, kumanda tuşları, kadranlar veya diğer donanım temelli girdileri içermektedir.

source: With the SmartDashboard you can simply display a widget on the screen to choose the autonomous program that you would like to run. And with command based programs, that program is encapsulated in one of several commands. This article shows how to select an autonomous program with only a few lines of code and a nice looking user interface, with examples for both TimedRobot and Command-Based Robots.
tr_tr: SmartDashboard ile çalıştırmak istediğiniz otonom programı seçmek için sadece ekranda bir araç görüntüleyebilirsiniz. Komut temelli programlardaysa program birkaç komuttan biriyle sarmalanmaktadır. Bu yazı, TimedRobot ve Komut Temelli Robotlara dair örneklerle, nasıl sadece birkaç satır kodla ve hoş bir kullanıcı arayüzüyle otonom bir program seçeceğinizi gösterecektir.

source: The code snippets shown below are part of the TimedRobot template (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/timed>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/templates/timed>`__):
tr_tr: Aşağıda kod parçacıkları TimedRobot şablonunun (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/timed>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/templates/timed>`__) bir parçasıdır:

source: Creating SendableChooser Object
tr_tr: SendableChooser Nesnesi Oluşturmak

source: In ``Robot.java`` / ``Robot.h``, create a variable to hold a reference to a ``SendableChooser`` object. Two or more auto modes can be added by creating strings to send to the chooser. Using the ``SendableChooser``, one can choose between them. In this example, ``Default`` and ``My Auto`` are shown as options. You will also need a variable to store which auto has been chosen, ``m_autoSelected``.
tr_tr: ``Robot.java`` / ``Robot.h``'de ``SendableChooser`` nesnesine referans verebilecek bir değişken oluşturunuz. İki veya daha fazla otonom mod chooser - seçiciye gönderilecek string'lerin oluşturulmasıyla eklenebilmektedir. ``SendableChooser`` ile bu modlardan herhangi biri seçilebilmektedir. Bu örnekte seçenek olarak ``Default`` ve ``My Auto`` gösterilmektedir. Bunların yanı sıra hangi modun seçildiğini depolayacak bir değişkene, ``m_autoSelected``, de ihtiyacınız olacaktır

source: Setting Up Options
tr_tr: Seçeneklerin Kurulumu

source: The chooser allows you to pick from a list of defined elements, in this case the strings we defined above. In the ``Robot`` constructor, add your options created as strings above using ``setDefaultOption`` or ``addOption``. ``setDefaultOption`` will be the one selected by default when the dashboard starts. The ``putData`` function will push it to the dashboard on your driver station computer.
tr_tr: Chooser; tanımlı bir öğeler listesinden seçim yapmanıza olanak tanımaktadır, bu durumda öğeler yukarıda tanımladığımız string'lerdir. ``Robot`` constructor'ında ``setDefaultOption`` veya ``addOption`` kullanarak yukarıda string olarak oluşturulmuş seçeneklerinizi ekleyiniz. Gösterge paneli başlatıldığında ``setDefaultOption`` varsayılan olarak seçilecektir. ``putData`` fonksiyonu seçeneğinizi driver station - sürücü istasyonu bilgisayaranızdaki gösterge paneline yollayacaktır.

source: Running Autonomous Code
tr_tr: Otonom Kodun Çalıştırılması

source: Now, in ``autonomousInit`` and ``autonomousPeriodic``, you can use the ``m_autoSelected`` variable to read which option was chosen, and change what happens during the autonomous period.
tr_tr: Şimdi, ``autonomousInit`` ve ``autonomousPeriodic``'de hangi seçeneğin seçildiğini görmek ve otonom zaman aralığı içerisinde neler olacağını belirlemek için ``m_autoSelected`` değişkenini kullanabilirsiniz.

source: Command-Based
tr_tr: Komut Temelli

source: The code snippets shown below are part of the HatchbotTraditional example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__, `Python <https://github.com/robotpy/examples/tree/main/HatchbotTraditional>`__):
tr_tr: Aşağıda kod parçacıkları HatchbotTraditional örnek projesinin(`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__, `Python <https://github.com/robotpy/examples/tree/main/HatchbotTraditional>`__) bir parçasıdır:

source: Creating the SendableChooser Object
es_mx: Creación del objeto SendableChooser
fr_ca: Création de l'objet SendableChooser
tr_tr: SendableChooser Nesnesinin Oluşturulması
zh_cn: 创建SendableChooser对象

source: In ``RobotContainer``, create a variable to hold a reference to a ``SendableChooser`` object. Two or more commands can be created and stored in new variables. Using the ``SendableChooser``, one can choose between them. In this example, ``SimpleAuto`` and ``ComplexAuto`` are shown as options.
es_mx: En ``RobotContainer``, crea una variable para mantener una referencia a un objeto ``SendableChooser``. Se pueden crear dos o más comandos y almacenarlos en nuevas variables. Usando el ``SendableChooser``, se puede elegir entre ellos. En este ejemplo, se muestran como opciones ``SimpleAuto`` y ``ComplexAuto``.
fr_ca: Dans ``RobotContainer``, créez une variable pour contenir une référence à un objet ``SendableChooser``. Deux commandes ou plus peuvent être créées et stockées dans de nouvelles variables. En utilisant le ``SendableChooser``, on peut choisir l'une ou l'autres des deux variables. Dans cet exemple, ``SimpleAuto`` et ``ComplexAuto`` sont affichés comme des options.
tr_tr: ``RobotContainer``'da ``SendableChooser`` nesnesine referans verebilecek bir değişken oluşturunuz. . İki veya daha fazla komut yeni değişkenlerde oluşturulup depolanabilmektedir. ``SendableChooser`` ile bu modlardan herhangi biri seçilebilmektedir. Bu örnekte seçenek olarak ``SimpleAuto`` ve ``SimpleAuto`` gösterilmektedir.
zh_cn: 在“ RobotContainer”中，创建一个变量以保存对“ SendableChooser”对象的引用。可以创建两个或更多命令并将其存储在新变量中。使用“ SendableChooser”，可以在它们之间进行选择。在此示例中，“ SimpleAuto”和“ ComplexAuto”显示为选项。

source: C++ (using raw pointers)
tr_tr: (Ham işaretçiler kullanılan) C++

source: C++ (using ``CommandPtr``)
tr_tr: (``CommandPtr`` kullanılan) C++

source: Setting up SendableChooser
es_mx: Configuración de SendableChooser
fr_ca: Configurer SendableChooser
tr_tr: SendableChooser'ın Kurulumu
zh_cn: 设置SendableChooser

source: Imagine that you have two autonomous programs to choose between and they are encapsulated in commands ``SimpleAuto`` and ``ComplexAuto``. To choose between them:
es_mx: Imagine que tiene dos programas autónomos para elegir y que están encapsulados en los comandos ``SimpleAuto`` y ``ComplexAuto``. Para elegir entre ellos:
fr_ca: Imaginez que vous ayez le choix entre deux programmes autonomes et qu'ils soient encapsulés dans les commandes ``SimpleAuto`` et ``ComplexAuto``. Pour choisir entre eux:
tr_tr: Aralarından seçim yapabileceğiniz iki otonom programınız olduğunu ve ``SimpleAuto`` ile ``ComplexAuto`` komutlarının bu programları kapsandığını varsayın. Programlardan birini seçmek için:
zh_cn: 假设你有两个自动阶段的程序可供选择，它们被封装在指令“ SimpleAuto”和“ ComplexAuto”中。在它们当中进行选择：

source: In ``RobotContainer``, create a ``SendableChooser`` object and add instances of the two commands to it. There can be any number of commands, and the one added as a default (``setDefaultOption``), becomes the one that is initially selected. Notice that each command is included in an ``setDefaultOption()`` or ``addOption()`` method call on the ``SendableChooser`` instance.
es_mx: En ``RobotContainer``, cree un objeto ``SendableChooser`` y agregue instancias de los dos comandos. Puede haber cualquier número de comandos, y el agregado como predeterminado (``setDefaultOption``), se convierte en el que se selecciona inicialmente. Tenga en cuenta que cada comando se incluye en una llamada al método ``setDefaultOption()`` o ``addOption()`` en la instancia de ``SendableChooser``.
fr_ca: Dans ``RobotContainer``, créez un objet ``SendableChooser`` et ajoutez-y des instances des deux commandes. Il peut y avoir n'importe quel nombre de commandes, et celle ajoutée par défaut (``setDefaultOption``), devient celle qui est initialement sélectionnée. Notez que chaque commande est incluse dans un appel de méthode ``setDefaultOption()`` ou ``addOption()`` sur l'instance ``SendableChooser``.
tr_tr: ``RobotContainer``'da bir ``SendableChooser`` nesnesi oluşturup iki komutun örneklerini bu nesneye ekleyiniz. Komutlar herhangi bir miktarda olabilir ve varsayılan olarak eklenen komut (``setDefaultOption``), başlangıçta seçilen komut haline gelmektedir. Gördüğünüz üzere her komut ``SendableChooser`` örneğinde bir ``setDefaultOption()`` veya ``addOption()`` metod çağrısına dahil edilmektedir.
zh_cn: 在“ RobotContainer”中创建一个“ SendableChooser”对象，并向其添加两个指令的实例。指令的数量没有限制，并且默认添加的指令（``setDefaultOption``）将成为最初选择的命令。注意，每个指令都包含在“ SendableChooser”实例上的“ setDefaultOption（）”或“ addOption（）”方法调用中。

source: Then, publish the chooser to the dashboard:
tr_tr: Ardından chooser'ı gösterge paneline yayınlayınız:

source: Starting an Autonomous Command
es_mx: Iniciar un comando autónomo
fr_ca: Démarrer une commande autonome
tr_tr: Otonom Komutun Başlatılması
zh_cn: 启动自动阶段指令

source: In ``Robot.java``, when the autonomous period starts, the ``SendableChooser`` object is polled to get the selected command and that command must be scheduled.
es_mx: En ``Robot.java``, cuando comienza el período autónomo, el objeto ``SendableChooser`` es sondeado para obtener el comando seleccionado y ese comando debe ser programado.
fr_ca: Dans ``Robot.java``, lorsque la période autonome démarre, l'objet ``SendableChooser`` est interrogé pour obtenir la commande sélectionnée et cette commande doit être planifiée.
tr_tr: ``Robot.java``'da otonom dönem başladığında, ``SendableChooser`` nesnesi seçili komutu almak için sorgulanır ve bu komutun zamanlanması gerekmektedir.
zh_cn: 在“ Robot.java”中，当自动阶段开始时，将选取“ SendableChooser”对象以获取所选指令，并且必须调度该指令。

source: C++ (Source)
es_mx: C++ (Fuente)
tr_tr: C ++ (Kaynak)

source: Running the Scheduler during Autonomous
es_mx: Ejecución del planificador durante el modo autónomo
fr_ca: Exécution du planificateur en mode autonome
tr_tr: Otonom sırasında Zamanlayıcının Çalıştırılması
zh_cn: 在自动阶段运行调度程序

source: In ``Robot.java``, this will run the scheduler every driver station update period (about every 20ms) and cause the selected autonomous command to run. In Python the scheduler runs automatically when ``TimedCommandRobot`` is used.
tr_tr: ``Robot.java`` için bu komut her driver station güncelleme aralığında (yaklaşık her 20ms'de bir) zamanlayıcıyı çalıştıracak ve seçilen otonom komutun başlatılmasını sağlayacaktır. Python'da zamanlayıcı ``TimedCommandRobot`` her kullanıldığında kendiliğinden çalışmaktadır.

source: Running the scheduler can occur in the ``autonomousPeriodic()`` function or ``robotPeriodic()``, both will function similarly in autonomous mode.
es_mx: La ejecución del planificador puede ocurrir en la función ``autonomPeriodic()`` o ``robotPeriodic()``, ambas funcionarán de manera similar en modo autónomo.
fr_ca: L'exécution du planificateur peut se produire dans la fonction ``autonomousPeriodic()`` ou ``robotPeriodic()``, les deux fonctionneront de la même manière en mode autonome.
tr_tr: Zamanlayıcının çalıştırılması ``autonomousPeriodic()`` veya ``robotPeriodic()`` fonksiyonunda gerçekleşebilmektedir, her ikisi de otonom modda benzer işlevler görecektir.
zh_cn: 运行调度程序可以在autonomousPeriodic（）函数或robotPeriodic（）中进行，两者在自动阶段下的功能相似。

source: Canceling the Autonomous Command
es_mx: Cancelación del mando autónomo
fr_ca: Annulation de la commande autonome
tr_tr: Otonom Komutun İptal Edilmesi
zh_cn: 取消自动阶段指令

source: In ``Robot.java``, when the teleop period begins, the autonomous command will be canceled.
es_mx: En ``Robot.java``, cuando comience el período de teleoperado, se cancelará el comando autónomo.
fr_ca: Dans ``Robot.java``, lorsque la période téléop commence, la commande autonome sera annulée.
tr_tr: ``Robot.java``'da teleop dönemi başladığında otonom komut iptal edilecektir.
zh_cn: 在 "Robot.java" 当中，当遥控阶段开始时，自动阶段指令将被终止。

source: SmartDashboard Display
es_mx: Pantalla SmartDashboard
fr_ca: Affichage du tableau de bord intelligent
tr_tr: SmartDashboard Ekranı
zh_cn: SmartDashboard显示

source: SendableChooser shows two selectable autos: Simple Auto and Complex Auto.
fr_ca: SendableChooser affiche deux commandes autonomes sélectionnables : Simple Auto et Complex Auto.
tr_tr: SendableChooser seçilebilecek iki otonom mod göstermektedir: Simple Auto - Basit Otonom ve Complex Auto - Karmaşık Otonom
zh_cn: SendableChooser显示了两个可选择的自动模式:简单自动和复杂自动。

source: Often teams have more than one autonomous program, either for competitive reasons or for testing new software. Programs often vary by adding things like time delays, different strategies, etc. The methods to choose the strategy to run usually involves switches, joystick buttons, knobs or other hardware based inputs.
es_mx: A menudo, los equipos tienen más de un programa autónomo, ya sea por razones competitivas o para probar software nuevo. Los programas a menudo varían agregando cosas como retrasos de tiempo, diferentes estrategias, etc. Los métodos para elegir la estrategia a ejecutar generalmente involucran interruptores, botones de joystick, perillas u otras entradas basadas en hardware.
fr_ca: Souvent, les équipes ont plus d'un programme autonome, soit pour des raisons de concurrence, soit pour tester de nouveaux logiciels. Les programmes varient souvent en ajoutant des éléments tels que des délais, des stratégies différentes, etc. Les méthodes pour choisir la stratégie à exécuter impliquent généralement des commutateurs, des boutons de joystick, des boutons ou d'autres entrées matérielles.
zh_cn: 出于竞争原因或测试新软件的原因，团队通常拥有多个自动阶段。程序通常会通过添加时间延迟，加入不同的策略等来变化。选择要运行的策略的方法通常包括开关，操纵杆按钮，旋钮或其他基于硬件的输入。

source: With the SmartDashboard you can simply display a widget on the screen to choose the autonomous program that you would like to run. And with command based programs, that program is encapsulated in one of several commands. This article shows how to select an autonomous program with only a few lines of code and a nice looking user interface.
zh_cn: 使用SmartDashboard，您可以简单地在屏幕上显示小部件以选择要运行的自动阶段。对于基于指令的程序，该程序被封装在多个命令中的一个内部。本文将说明如何选择仅包含几行代码和漂亮的用户界面的自动阶段。

source: The code snippets shown below are part of the HatchbotTraditional example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):
es_mx: Los fragmentos de código que se muestran a continuación son parte del proyecto de ejemplo HatchbotTraditional (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):
fr_ca: Les extraits de code indiqués ci-dessous font partie du projet HatchbotTraditional (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):
zh_cn: 下面显示的代码段是HatchbotTraditional示例项目的一部分（Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):

source: In ``Robot.java``, this will run the scheduler every driver station update period (about every 20ms) and cause the selected autonomous command to run.
es_mx: En ``Robot.java``, esto ejecutará el programador cada período de actualización de la driver station (aproximadamente cada 20 ms) y hará que se ejecute el comando autónomo seleccionado.
fr_ca: Dans ``Robot.java``, cela exécutera le planificateur à chaque période de mise à jour (environ toutes les 20 ms) et provoquera l'exécution de la commande autonome sélectionnée.
zh_cn: 在 "Robot.java" 中，每当机器操控台刷新时（约20ms一次），调度程序将被执行并使得被选择的自动阶段指令持续运行。

source: When the SmartDashboard is run, the choices from the ``SendableChooser`` are automatically displayed. You can simply pick an option before the autonomous period begins and the corresponding command will run.
es_mx: Cuando se ejecuta SmartDashboard, las opciones del ``SendableChooser`` se muestran automáticamente. Simplemente puede elegir una opción antes de que comience el período autónomo y se ejecutará el comando correspondiente.
fr_ca: Lorsque le SmartDashboard est exécuté, les choix du ``SendableChooser`` sont automatiquement affichés. Vous pouvez simplement choisir une option avant le début de la période autonome et la commande correspondante s'exécutera.
zh_cn: 运行SmartDashboard时，将自动显示“ SendableChooser”中的选项。您可以在自动阶段开始之前选择一个选项，然后相应的指令将运行。
