Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/smartdashboard/displaying-status-of-commands-and-subsystems.po
Languages: es_mx, fr_ca

source: Displaying the Status of Commands and Subsystems
es_mx: Visualizar el estado de comandos y subsistemas
fr_ca: Affichage de l'état des commandes et des sous-systèmes

source: If you are using the command-based programming features of WPILib, you will find that they are very well integrated with SmartDashboard. It can help diagnose what the robot is doing at any time and it gives you control and a view of what's currently running.
es_mx: Si está utilizando las funciones de programación basadas en comandos de WPILib, encontrará que están muy bien integradas con SmartDashboard. Puede ayudar a diagnosticar lo que está haciendo el robot en cualquier momento y le brinda control y una vista de lo que se está ejecutando actualmente.
fr_ca: Si vous utilisez les fonctionnalités de programmation basées sur les commandes de WPILib, vous constaterez qu'elles sont très bien intégrées à SmartDashboard. Celles-ci peuvent aider à diagnostiquer ce que fait le robot à tout moment et vous donner le contrôle et une vue de ce qui est en cours d'exécution.

source: Overview of Command and Subsystem Displays
es_mx: Descripción general de las pantallas de comando y subsistema
fr_ca: Présentation des affichages de commande et de sous-système

source: With SmartDashboard you can display the status of the commands and subsystems in your robot program in various ways. The outputs should significantly reduce the debugging time for your programs. In this picture you can see a number of displays that are possible. Displayed here are:
es_mx: Con la SmartDashboard puede visualizar el estado de los comandos y subsistemas en su programa de robot de varias formas. Los resultados deberían reducir significativamente el tiempo de depuración de sus programas. En esta imagen puede ver una serie de pantallas posibles. Aquí se muestran:
fr_ca: Avec SmartDashboard, vous pouvez afficher l'état des commandes et des sous-systèmes dans votre programme de robot de différentes manières. Ces informations devraient réduire considérablement le temps de débogage de vos programmes. Sur cette image, vous pouvez voir un certain nombre d'affichages possibles. Voici les éléments suivants:

source: The Scheduler currently with ``No commands running``. In the next example you can see what it looks like with a few commands running showing the status of the robot.
es_mx: El Programador actualmente con ``No hay comandos en ejecución``. En el siguiente ejemplo, puede ver cómo se ve con algunos comandos en ejecución que muestran el estado del robot.
fr_ca: Le planificateur dans l'état ou aucune commande en cours d'exécution, en anglais : ``No commands running``. Dans l'exemple suivant, vous pouvez voir à quoi cela ressemble avec quelques commandes en cours d'exécution indiquant l'état du robot.

source: A subsystem, ``ExampleSubsystem`` that indicates that there are currently no commands running that are "requiring" it. When commands are running, it will indicate the name of the commands that are using the subsystem.
es_mx: Un subsistema, ``ExampleSubsystem`` que indica que actualmente no hay comandos en ejecución que lo "requieran". Cuando los comandos se estén ejecutando, indicará el nombre de los comandos que están usando el subsistema.
fr_ca: Un sous-système ``ExampleSubsystem`` qui indique qu'il n'y a actuellement aucune commande en cours d'exécution qui "nécessite" ce sous-système. Lorsque les commandes sont en cours d'exécution, l'écran indiquera le nom des commandes qui utilisent le sous-système.

source: A command written to SmartDashboard that shows a ``start`` button that can be pressed to run the command. This is an excellent way of testing your commands one at a time.
es_mx: Un comando escrito en SmartDashboard que muestra un botón de `` inicio '' que se puede presionar para ejecutar el comando. Esta es una excelente manera de probar sus comandos uno a la vez.
fr_ca: Une commande écrite sur SmartDashboard qui montre un bouton ``start`` sur lequel vous pouvez appuyer pour exécuter la commande. C'est un excellent moyen de tester vos commandes une par une.

source: And a few data values written to the dashboard to help debug the code that's running.
es_mx: Y algunos valores de datos escritos en la dashboard para ayudar a depurar el código que se está ejecutando.
fr_ca: Et quelques valeurs de données écrites dans le tableau de bord pour aider à déboguer le code en cours d'exécution.

source: In the following examples, you'll see what the screen would look like when there are commands running, and the code that produces this display.
es_mx: En los siguientes ejemplos, verá cómo se vería la pantalla cuando se ejecutan comandos y el código que produce esta pantalla.
fr_ca: Dans les exemples suivants, vous verrez à quoi ressemblerait l'écran lorsque des commandes sont en cours d'exécution et le code qui produit cet affichage.

source: Displaying the Scheduler Status
es_mx: Visualización del estado del programador de comandos
fr_ca: Affichage de l'état du planificateur

source: You can display the status of the Scheduler (the code that schedules your commands to run). This is easily done by adding a single line to the ``RobotInit`` method in your RobotProgram as shown here. In this example the Scheduler instance is written using the ``putData`` method to SmartDashboard. This line of code produces the display in the previous image.
es_mx: Puede mostrar el estado del Programador (el código que programa la ejecución de sus comandos). Esto se hace fácilmente agregando una sola línea al método ``RobotInit`` en su RobotProgram como se muestra aquí. En este ejemplo, la instancia del Programador se escribe utilizando el método ``putData`` en SmartDashboard. Esta línea de código produce la visualización de la imagen anterior.
fr_ca: Vous pouvez afficher l'état du planificateur (le code qui planifie l'exécution de vos commandes). Cela se fait facilement en ajoutant une seule ligne à la méthode ``RobotInit`` dans votre programme comme indiqué ici. Dans cet exemple, l'instance Scheduler est écrite à l'aide de la méthode ``putData`` dans SmartDashboard. Cette ligne de code produit l'affichage dans l'image précédente.

source: This is the scheduler status when there are two commands running, ``ExampleCommand`` and ``newCommand``. This replaces the ``No commands running.`` message from the previous screen image. You can see commands displayed on the dashboard as the program runs and various commands are triggered.
es_mx: Este es el estado del programador cuando hay dos comandos en ejecución, ``ExampleCommand`` y ``newCommand``. Esto reemplaza el mensaje ``No hay comandos en ejecución`` de la imagen de pantalla anterior. Puede ver los comandos que se muestran en la dashboard a medida que se ejecuta el programa y se activan varios comandos.
fr_ca: Il s'agit de l'état du planificateur lorsque deux commandes sont en cours d'exécution, ``ExampleCommand`` et ``newCommand``. Cela remplace le message ``No commands running.`` de l'image d'écran précédente. Vous pouvez voir les commandes affichées sur le tableau de bord lorsque le programme s'exécute et que diverses commandes sont déclenchées.

source: Displaying Subsystem Status
es_mx: Visualizar el estado del subsistema
fr_ca: Affichage de l'état du sous-système

source: In this example we are writing the command instance, ``exampleSubsystem`` and instance of the ``ExampleSubsystem`` class to the SmartDashboard. This causes the display shown in the previous image. The text field will either contain a few dashes, ``---`` indicating that no command is current using this subsystem, or the name of the command currently using this subsystem.
es_mx: En este ejemplo, estamos escribiendo la instancia de comando, ``exampleSubsystem`` y la instancia de la clase ``ExampleSubsystem`` en el SmartDashboard. Esto provoca la visualización mostrada en la imagen anterior. El campo de texto contendrá algunos guiones, ``---`` indicando que ningún comando está usando este subsistema, o el nombre del comando que usa actualmente este subsistema.
fr_ca: Dans cet exemple, nous écrivons l'instance de commande, ``exampleSubsystem`` et l'instance de la classe ``ExampleSubsystem`` dans le SmartDashboard. Cela provoque l'affichage montré dans l'image précédente. Le champ de texte contiendra soit quelques tirets, ``---`` indiquant qu'aucune commande en cours utilise ce sous-système, ou encore le nom de la commande qui utilise actuellement ce sous-système.

source: Running commands will "require" subsystems. That is the command is reserving the subsystem for its exclusive use. If you display a subsystem on SmartDashboard, it will display which command is currently using it. In this example, ``ExampleSubsystem`` is in use by ``ExampleCommand``.
es_mx: Los comandos en ejecución "requerirán" subsistemas. Ese es el comando que reserva el subsistema para su uso exclusivo. Si muestra un subsistema en la SmartDashboard, mostrará qué comando lo está usando actualmente. En este ejemplo, ``ExampleSubsystem`` está siendo utilizado por ``ExampleCommand``.
fr_ca: Les commandes en cours "nécessitent" des sous-systèmes. C'est la commande qui réserve le sous-système à son usage exclusif. Si vous affichez un sous-système sur SmartDashboard, il affichera la commande qui l'utilise actuellement. Dans cet exemple, `` ExampleSubsystem '' est utilisé par `` ExampleCommand``.

source: Activating Commands with a Button
es_mx: Activar comandos con un botón
fr_ca: Activation des commandes avec un bouton

source: This is the code required to create a button for the command on SmartDashboard. RobotBuilder will automatically generate this code for you, but it can easily be done by hand as shown here. Pressing the button will schedule the command. While the command is running, the button label changes from ``start`` to ``cancel`` and pressing the button will cancel the command.
fr_ca: C'est le code requis pour créer un bouton pour la commande sur SmartDashboard. RobotBuilder générera automatiquement ce code pour vous, mais cela peut facilement être fait à la main, comme indiqué ici. Il faut alors appuyer sur le bouton pour céduler la commande. Pendant l'exécution de la commande, le libellé du bouton passe de ``start`` à ``cancel`` et le fait d'appuyer à nouveau sur le bouton annulera la commande.

source: In this example you can see a button labeled ``Autonomous Command``. Pressing this button will run the associated command and is an excellent way of testing commands one at a time without having to add throw-away test code to your robot program. Adding buttons for each command makes it simple to test the program, one command at a time.
es_mx: En este ejemplo, puede ver un botón etiquetado como ``Autonomous Command``. Al presionar este botón se ejecutará el comando asociado y es una excelente manera de probar los comandos uno a la vez sin tener que agregar código de prueba desechable a su programa de robot. Agregar botones para cada comando simplifica la prueba del programa, un comando a la vez.
fr_ca: Dans cet exemple, vous pouvez voir un bouton intitulé ``Autonomous Command``. Appuyez sur ce bouton pour exécuter la commande associée. Ceci est un excellent moyen de tester les commandes une par une sans avoir à ajouter du code de test supplémentaire à votre programme de robot. L'ajout de boutons pour chaque commande facilite le test du programme, une commande à la fois.
