Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/smartdashboard/smartdashboard-namespace.po
Languages: es_mx, fr_ca, zh_cn

source: SmartDashboard Namespace
es_mx: Espacio de nombres para SmartDashboard
fr_ca: Espace pour noms dans SmartDashboard

source: SmartDashboard uses NetworkTables to send data between the robot and the Dashboard (Driver Station) computer. NetworkTables sends data as name, value pairs, like a distributed hashtable between the robot and the computer. When a value is changed in one place, its value is automatically updated in the other place. This mechanism and a standard set of name (keys) is how data is displayed on the SmartDashboard.
es_mx: SmartDashboard usa NetworkTables para enviar datos entre el robot y la computadora Dashboard (Driver Station). NetworkTables envía datos como nombre, pares de valores, como una matriz asociativa/tabla hash distribuida entre el robot y la computadora. Cuando se cambia un valor en un lugar, su valor se actualiza automáticamente en el otro lugar. Este mecanismo y un conjunto estándar de nombres (claves) es cómo se muestran los datos en el SmartDashboard.
fr_ca: SmartDashboard utilise NetworkTables pour envoyer des données entre le robot et l'ordinateur du tableau de bord (Driver Station). NetworkTables envoie des données sous forme de nom, de paires de valeurs, comme une table de hachage distribuée entre le robot et l'ordinateur. Lorsqu'une valeur est modifiée à un endroit, sa valeur est automatiquement mise à jour à l'autre endroit. Ce mécanisme et un ensemble standard de noms (clés) permettent d'afficher les données sur le SmartDashboard.
zh_cn: SmartDashboard 使用 NetworkTables 在机器人和仪表板（驱动站）计算机之间发送数据。NetworkTables 以名称、值对的形式发送数据，就像机器人和计算机之间的分布式哈希表。当一个值在一个位置更改时，它的值在另一个位置自动更新。这种机制和一组标准的名称（键）是如何在 SmartDashboard 上显示数据的。

source: There is a hierarchical structure in the name space creating a set of tables and subtables. SmartDashboard data is in the SmartDashboard subtable and LiveWindow data is in the LiveWindow subtable as shown below.
es_mx: Existe una estructura jerárquica en el espacio de nombres que crea un conjunto de tablas y subtablas. Los datos de SmartDashboard están en la subtabla SmartDashboard y los datos de LiveWindow están en la subtabla de LiveWindow como se muestra a continuación.
fr_ca: Il existe une structure hiérarchique dans l'espace pour noms créant un ensemble de tables et de sous-tables. Les données SmartDashboard se trouvent dans la sous-table SmartDashboard et les données LiveWindow sont dans la sous-table LiveWindow comme indiqué ci-dessous.
zh_cn: 名称空间中有一个层次结构，用于创建一组表和子表。SmartDashboard 数据位于 SmartDashboard 子表中，LiveWindow 数据位于 LiveWindow 子表中，如下所示。

source: For informational purposes, the names and values can be displayed using the OutlineViewer application that is installed in the same location as the SmartDashboard. It will display all the NetworkTables keys and values as they are updated.
es_mx: A efectos informativos, los nombres y valores pueden mostrarse utilizando la aplicación OutlineViewer que se instala en la misma ubicación que el SmartDashboard. Esta aplicación mostrará todas las claves y valores de NetworkTables a medida que se vayan actualizando.
fr_ca: À des fins d'information, les noms et les valeurs peuvent être affichés à l'aide de l'application OutlineViewer installée au même emplacement que le SmartDashboard. Il affichera toutes les clés et valeurs NetworkTables au fur et à mesure de leur mise à jour.
zh_cn: 为了提供信息，可以使用安装在与SmartDashboard相同位置的OutlineViewer应用程序显示名称和值。它将显示更新后的所有NetworkTables键和值。

source: SmartDashboard Data Values
es_mx: Valores de datos de SmartDashboard
fr_ca: Valeurs des données SmartDashboard
zh_cn: 智能仪表盘数据集

source: The SmartDashboard keys in NetworkTables always begin with "/SmartDashboard/*"
fr_ca: Les touches SmartDashboard dans NetworkTables commencent toujours par "/SmartDashboard/*"
zh_cn: NetworkTables中的SmartDashboard键总是以"/SmartDashboard/*"开始

source: SmartDashboard values are created with key names that begin with ``SmartDashboard/``. The above values viewed with OutlineViewer correspond to data put to the SmartDashboard with the following statements:
es_mx: Los valores de SmartDashboard se crean con nombres clave que comienzan con ``SmartDashboard/``. Los valores anteriores vistos con OutlineViewer corresponden a los datos colocados en el SmartDashboard con las siguientes declaraciones:
fr_ca: Les valeurs de SmartDashboard sont créées avec des noms de clé commençant par ``SmartDashboard/``. Les valeurs ci-dessus affichées avec OutlineViewer correspondent aux données placées dans le SmartDashboard avec les instructions suivantes:
zh_cn: SmartDashboard 值是用以 ``SmartDashboard/` `开头的键名创建的。使用OutlineViewer 查看的上述值与放入 SmartDashboard 的数据相对应，其中包含以下语句：

source: The ``Arm position`` is created with the ``putNumber()`` call. The ``AutonomousCommand`` is written with a ``putData("Autonomous Command", command)`` that is not shown in the above code fragment. The chooser is created as a ``SendableChooser`` object and the string value, ``Program Version`` is created with the ``putString()`` call.
es_mx: La ``Posición del brazo`` se crea con la llamada ``putNumber()``. El ``AutonomousCommand`` está escrito con un ``putData("Autonomous Command", command)`` que no se muestra en el fragmento de código anterior. El selector se crea como un objeto ``SendableChooser`` y el valor de cadena, ``Versión del programa`` se crea con la llamada ``putString()``.
fr_ca: La ``Arm position`` est créee avec l'appel ``putNumber()``. Le ``AutonomousCommand`` est écrit avec un ```putData("Autonomous Command",command)`` qui n'est pas montré dans le fragment de code ci-dessus. Le sélecteur est créé en tant qu'objet ``SendableChooser`` et la valeur de chaîne de caractères, ``Program Version`` est créée avec l'appel ``putString()``.
zh_cn: ``Arm position`` 是使用 ``putNumber()`` 调用创建的。``AutonomousCommand`` 是使用上面的代码中没有显示的 ``putData("Autonomous Command", command)`` 写的。选择者可以创造一个``SendableChooser`` 对象和字符串值。 ``Program Version`` 由 ``putString()`` 调用创建。

source: View of SmartDashboard
es_mx: Vista de SmartDashboard
fr_ca: Vue du SmartDashboard
zh_cn: 智能仪表盘显示

source: SmartDashboard display of the values generated in the code above.
fr_ca: Affichage sous SmartDashboard des valeurs générées dans le code ci-dessus.
zh_cn: SmartDashboard显示上面代码中生成的值。

source: The code from the previous step generates the table values as shown and the SmartDashboard display as shown here. The numbers correspond to the NetworkTables variables shown in the previous step.
es_mx: El código del paso anterior genera los valores de la tabla como se muestra y la pantalla del SmartDashboard como se muestra aquí. Los números corresponden a las variables de NetworkTables mostradas en el paso anterior.
fr_ca: Le code de l'étape précédente génère les valeurs de la table comme indiqué et l'affichage du SmartDashboard comme illustré ici. Les nombres correspondent aux variables NetworkTables affichées à l'étape précédente.
zh_cn: 上一步的代码生成如下所示的表值和如下所示的SmartDashboard显示。这些数字对应于前面步骤中显示的NetworkTables变量。

source: LiveWindow Data Values
es_mx: Valores de datos de LiveWindow
fr_ca: Valeurs des données LiveWindow

source: Viewing all of the LiveWindow data in SmartDashboard when in Test mode.
fr_ca: Affichage de toutes les données de LiveWindow dans le SmartDashboard en mode test.
zh_cn: 在测试模式下查看SmartDashboard中的所有LiveWindow数据。

source: LiveWindow data is automatically grouped by subsystem. The data is viewable in the SmartDashboard when the robot is in Test mode (set on the Driver Station). If you are not writing a command based program, you can still cause sensors and actuators to be grouped for easy viewing by specifying the subsystem name. In the above display you can see the key names and the resultant output in Test mode on the SmartDashboard. All the strings start with ``/LiveWindow`` then the Subsystem name, then a group of values that are used to display each element. The code that generates this LiveWindow display is shown below:
es_mx: Los datos de LiveWindow se agrupan automáticamente por subsistema. Los datos se pueden ver en el SmartDashboard cuando el robot está en modo de prueba (configurado en la Driver Station). Si no está escribiendo un programa basado en comandos, aún puede hacer que los sensores y actuadores se agrupen para facilitar la visualización especificando el nombre del subsistema. En la pantalla anterior, puede ver los nombres de las teclas y la salida resultante en el modo de prueba en el SmartDashboard. Todas las cadenas comienzan con ``/LiveWindow ``, luego el nombre del subsistema, luego un grupo de valores que se utilizan para mostrar cada elemento. El código que genera esta pantalla LiveWindow se muestra a continuación:
fr_ca: Les données LiveWindow sont automatiquement regroupées par sous-système. Les données peuvent être visualisées dans le SmartDashboard lorsque le robot est en mode Test (défini sur le Driver Station). Si vous n'écrivez pas un programme basé sur des commandes, vous pouvez toujours grouper les capteurs et les actionneurs pour une visualisation facile en spécifiant le nom du sous-système. Dans l'affichage ci-dessus, vous pouvez voir les noms des touches et la sortie résultante en mode Test sur le SmartDashboard. Toutes les chaînes de caractères commencent par ``/LiveWindow`` puis le nom du sous-système, puis un groupe de valeurs qui permettent d'afficher chaque élément. Le code qui génère cet affichage LiveWindow est indiqué ci-dessous:
zh_cn: LiveWindow 数据按子系统自动分组。当机器人处于测试模式（在驱动站上设置）时，可以在 SmartDashboard 中查看数据。如果您没有编写基于指令的程序，仍然可以通过指定子系统名称将传感器和执行器分组以便于查看。在上面的显示中，您可以在 SmartDashboard 上看到测试模式下的键名称和结果输出。所有字符串以 ``/LiveWindow` `开头，然后是子系统名称，然后是用于显示每个元素的一组值。生成此 LiveWindow 显示的代码如下所示：

source: Values that correspond to actuators are not only displayed, but can be set using sliders created in the SmartDashboard in Test mode.
es_mx: Los valores que corresponden a los actuadores no solo se muestran, sino que se pueden configurar mediante los controles deslizantes creados en el SmartDashboard en el modo de prueba.
fr_ca: Les valeurs qui correspondent aux actionneurs ne sont pas seulement affichées, mais peuvent être définies à l'aide des curseurs créés dans le SmartDashboard en mode Test.
zh_cn: 不仅显示与执行器对应的值，还可以在 Test 模式下使用 SmartDashboard 中创建的滑块进行设置。
