Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/smartdashboard/smartdashboard-intro.po
Languages: fr_ca

source: SmartDashboard Introduction
fr_ca: Introduction à SmartDashboard

source: The SmartDashboard is a Java program that will display robot data in real time. The SmartDashboard helps you with these things:
fr_ca: SmartDashboard est une application conçue en Java qui permet l'affichage en temps réel des données du robot. SmartDashboard est utile dans les situations suivantes:

source: Displays robot data of your choice while the program is running. It can be displayed as simple text fields or more elaborately in many other display types like graphs, dials, etc.
fr_ca: L'affichage, pendant l'exécution du programme, des données d'intérêt de votre robot. Ces données peuvent être affichées sous forme de simples champs de texte ou, de manière plus élaborée, sous forme de nombreux autres types d’affichage comme des graphiques, des cadrans, etc.

source: Displays the state of the robot program such as the currently executing commands and the status of any subsystems
fr_ca: L'affichage de l’état du programme du robot comme les commandes en cours d’exécution et l’état de tous les sous-systèmes

source: Displays buttons that you can press to cause variables to be set on your robot
fr_ca: L'affichage des boutons que vous pouvez actionner pour faire varier des valeurs de paramètres de votre robot.

source: Allows you to choose startup options on the dashboard that can be read by the robot program
fr_ca: La sélection d'options de démarrage depuis le tableau de bord pouvant ensuite être lues par le programme du robot

source: The displayed data is automatically formatted in real-time as the data is sent from the robot, but you can change the format or the display widget types and then save the new screen layouts to be used again later. And with all these options, it is still extremely simple to use. To display some data on the dashboard, simply call one of the SmartDashboard methods with the data and its name and the value will automatically appear on the dashboard screen.
fr_ca: Les données affichées sont automatiquement mises en forme en temps réel lorsqu'elles sont envoyées à partir du robot, mais vous pouvez modifier le format ou les types de widget d’affichage, puis vous pouvez enregistrer les nouvelles dispositions d’écran en vue d'une utilisation ultérieure. SmartDashboard demeure extrêmement simple à utiliser. Pour afficher une donnée au tableau de bord, il suffit d’appeler l’une des méthodes de la classe SmartDashboard avec la donnée et son nom, et la valeur apparaîtra automatiquement au tableau de bord.

source: Installing the SmartDashboard
fr_ca: Installation de SmartDashboard

source: The SmartDashboard is packaged with the WPILib Installer and can be launched directly from the Driver Station by selecting the **SmartDashboard** button on the Setup tab.
fr_ca: SmartDashboard est intégré dans l’installateur WPILib et peut être lancé directement à partir de Driver Station en sélectionnant le bouton **SmartDashboard** sous l’onglet Setup.

source: Configuring the Team Number
fr_ca: Configuration du numéro d’équipe

source: The first time you launch the SmartDashboard you should be prompted for your team number. To change the team number after this: click **File > Preferences** to open the Preferences dialog. Double-click the box to the right of **Team Number** and enter your FRC\ |reg| Team Number, then click outside the box to save.
fr_ca: La première fois que vous lancez le SmartDashboard, vous êtes invité à configuer votre numéro d’équipe. Pour modifier le numéro d’équipe par la suite : cliquez sur **File > Preferences** pour ouvrir le dialogue Preferences. Double-cliquez sur la boîte à droite de **Team Number** et entrez votre FRC |reg| Numéro d’équipe, puis cliquez en dehors de la boîte pour enregistrer.

source: SmartDashboard will take a moment to configure itself for the team number, do not be alarmed.
fr_ca: SmartDashboard prendra un peu de temps pour finaliser la configuration du numéro d’équipe, ne vous inquiétez pas.

source: Setting a Custom NetworkTables Server Location
fr_ca: Définition d'un emplacement de serveur NetworkTables personnalisé

source: By default, SmartDashboard will look for NetworkTables instances running on a connected RoboRIO, but it's sometimes useful to look for NetworkTables at a different IP address. To connect to SmartDashboard from a host other than the roboRIO, open SmartDashboard preferences under the ``File`` menu and in the ``Team Number`` field, enter the IP address or hostname of the NetworkTables host.
fr_ca: Par défaut, SmartDashboard recherchera les instances NetworkTables s'exécutant sur un RoboRIO connecté, mais il est parfois utile de rechercher des NetworkTables à une adresse IP différente. Pour vous connecter à SmartDashboard depuis un hôte autre que le roboRIO, ouvrez les préférences de SmartDashboard dans le menu ``File`` et dans le champ ``Team Number``, saisissez l'adresse IP ou le nom d'hôte de l'hôte NetworkTables.

source: This option is incredibly useful for using SmartDashboard with :doc:`WPILib simulation </docs/software/wpilib-tools/robot-simulation/introduction>`. Simply add ``localhost`` to the ``Team Number`` field and SmartDashboard will detect your locally-hosted robot!
fr_ca: Cette option est incroyablement utile pour utiliser SmartDashboard avec :doc:`WPILib simulation </docs>`. Ajoutez simplement ``localhost`` au champ ``Team Number`` et SmartDashboard détectera votre robot localement!

source: Locating the Save File
fr_ca: Localisation du fichier sauvegardé

source: Users may wish to customize the save location of the SmartDashboard. To do this click the box next to **Save File** then browse to the folder where you would like to save the configuration. Files saved in the installation directories for the WPILib components will likely be overwritten on updates to the tools.
fr_ca: L'utilisateur peut déterminer un repertoire de sauvegarde de SmartDashboard autre que le repertoire par défaut. Pour ce faire, cliquez sur la case voisine de **Save File** puis accédez au dossier dans lequel vous souhaitez placer la configuration. Les fichiers enregistrés dans les répertoires d’installation des composants WPILib seront probablement remplacés pendant les mises à jour de ces composants.

source: Adding a Connection Indicator
fr_ca: Ajout d’un indicateur de connexion

source: It is often helpful to see if the SmartDashboard is connected to the robot. To add a connection indicator, select **View > Add > Connection Indicator**. This indicator will be red when disconnected and green when connected. To move or resize this indicator, select **View > Editable** to toggle the SmartDashboard into editable mode, then drag the center of the indicator to move it or the edges to resize. Select the **Editable** item again to lock it in place.
fr_ca: Il est souvent utile de vérifier si SmartDashboard est connecté au robot ou pas. Pour ajouter un indicateur de connexion, sélectionnez **View > Add > Connection Indicator**. Cet indicateur sera rouge lorsqu’il est déconnecté et vert lorsqu’il est connecté. Pour déplacer ou redimensionner cet indicateur, sélectionnez **View > Editable** pour basculer SmartDashboard en mode modifiable, puis faites glisser le centre de l’indicateur pour le déplacer ou les bords à redimensionner. Sélectionnez à nouveau l’élément **Editable** pour le verrouiller en place.

source: Adding Widgets to the SmartDashboard
fr_ca: Ajout de widgets à SmartDashboard

source: Widgets are automatically added to the SmartDashboard for each "key" sent by the robot code. For instructions on adding robot code to write to the SmartDashboard see :doc:`Displaying Expressions from Within the Robot Program <displaying-expressions>`.
fr_ca: Des widgets sont automatiquement ajoutés à SmartDashboard pour chaque "clé" envoyée par le code robot. Pour des instructions sur l’ajout de code robot à écrire pour SmartDashboard voir :doc:`Displaying Expressions from Within the Robot Program <displaying-expressions>`.
