Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/smartdashboard/verifying-smartdashboard-*-working.po
Languages: tr_tr

source: Verifying SmartDashboard is working
tr_tr: SmartDashboard'un çalıştığının doğrulanması

source: Connection Indicator
tr_tr: Bağlantı Göstergesi

source: SmartDashboard will automatically include the connection status and IP address of the NetworkTables source in the title of the window.
tr_tr: SmartDashboard, pencerenin başlığına NetworkTables kaynağının bağlantı durumunu ve IP adresini kendiliğinden ekleyecektir.

source: SmartDashboard disconnected.
tr_tr: Bağlantısı kesilmiş bir SmartDashboard.

source: SmartDashboard connected and showing the IP address.
tr_tr: Bağlı ve IP adresini görüntüleyen bir SmartDashboard.

source: Connection Indicator Widget
tr_tr: Bağlantı Göstergesi Aracı

source: SmartDashboard includes a connection indicator widget which will turn red or green depending on the connection to NetworkTables, usually provided by the roboRIO. For instructions to add this widget, look at :ref:`Adding a Connection Indicator <docs/software/dashboards/smartdashboard/smartdashboard-intro:Adding a Connection Indicator>` in the SmartDashboard Intro.
tr_tr: SmartDashboard; genellikle roboRIO tarafından sağlanan, NetworkTables ile olan bağlantıya göre kırmızı veya yeşil yanan bir bağlantı göstergesi içermektedir. Bu aracı eklemeye dair talimatlar için bkz. SmartDashboard Girişindeki :ref:`Adding a Connection Indicator <docs/software/dashboards/smartdashboard/smartdashboard-intro:Adding a Connection Indicator>`.

source: Robot Program Example
tr_tr: Robot Programı Örneği

source: This is a minimal robot program that writes a value to the SmartDashboard. It simply increments a counter 50 times per second to verify that the connection is working. However, to minimize bandwidth usage, NetworkTables by default will throttle the updates to 10 times per second.
tr_tr: Bu program, SmartDashboard'a değer katan minimal bir robot programıdır. Sadece bağlantının çalıştığını doğrulamak için bir sayacı saniyede 50 kez arttırmaktadır. Ancak, bant genişliği kullanımını en aza indirmek için NetworkTables varsayılan olarak güncellemeleri saniyede 10 keze çıkarmaktadır.

source: SmartDashboard Output for the Sample Program
tr_tr: Örnek Program için SmartDashboard Çıktısı

source: SmartDashboard showing the output of "counter" set up in the code above.
tr_tr: Yukarıdaki kodda kurulan "sayaçın" çıktısını gösteren SmartDashboard.

source: The SmartDashboard display should look like this after about 6 seconds of the robot being enabled in Teleop mode. If it doesn't, then you need to check that the connection is correctly set up.
tr_tr: SmartDashboard ekranı, robot Teleop modunda etkinleştirildikten yaklaşık 6 saniye sonra bu şekilde görünmelidir. Aksi takdirde bağlantının doğru şekilde kurulup kurulmadığını kontrol etmeniz gerekmektedir.

source: Verifying the IP address in SmartDashboard
tr_tr: SmartDashboard'da IP adresininin doğrulanması

source: Checking the "Team Number" property in the Preferences dialog box.
tr_tr: Tercihler iletişim kutusunda "Team Number" - "Takım Numarası" özelliğinin işaretlenmesi.

source: If the display of the value is not appearing, verify that the team number is correctly set as shown in this picture. The preferences dialog can be viewed by selecting ``File``, then ``Preferences``.
tr_tr: Değerin görüntüsü gözükmüyorsa, takım numarasının bu resimde gösterildiği gibi doğru şekilde ayarlandığından emin olunuz. Tercihler menüsü, önce ``File`` ardından ``Preferences`` seçilerek görüntülenebilmektedir.

source: Verifying Program using OutlineViewer
tr_tr: OutlineViewer kullanarak Programı Doğrulamak

source: You can verify that the robot program is generating SmartDashboard values by using the :doc:`OutlineViewer program </docs/software/wpilib-tools/outlineviewer/index>`.
tr_tr: :doc:`OutlineViewer program </docs/software/wpilib-tools/outlineviewer/index>` programını kullanarak robot programının SmartDashboard değerleri oluşturup oluşturmadığını doğrulayabilirsiniz.

source: Expand the SmartDashboard row. The value ``Counter`` is the variable written to the SmartDashboard via NetworkTables. As the program runs you should see the value increasing (``1398.0`` in this case). If you don't see this variable in the OutlineViewer, look for something wrong with the robot program or the network configuration.
tr_tr: SmartDashboard satırını genişletiniz. ``Counter`` - Sayaç değeri NetworkTables aracılığıyla SmartDashboard'a yazılmış değişkendir. Program çalıştıkça bu değerin arttığını gözlemliyor olmalısınız (bu durumda ``1398.0``). Bu değişkeni OutlineViewer'da göremiyorsanız, robot programında veya ağ yapılandırmasında bir hata olup olmadığına bakınız.

source: Using OutlineViewer to view the NetworkTables data used by the program.
tr_tr: Program tarafından kullanılan NetworkTables verilerini görüntülemek için kullanılan OutlineViewer.
