Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/xrp-robot/getting-to-know-xrp.po
Languages: fr_ca

source: Getting to know your XRP
fr_ca: Apprendre à connaître votre XRP

source: Booting up the XRP
fr_ca: Démarrage du XRP

source: Upon start up (when power is applied to the XRP either via battery or USB), the following will happen:
fr_ca: Au démarrage (lorsque le XRP est alimenté via la batterie ou via USB), les événements suivants se produisent :

source: The IMU will calibrate itself. This lasts approximately 3-5 seconds, and will be indicated by the green LED blinking rapidly. Ideally, the XRP should be placed on a flat surface prior to power up, and if necessary, users can hit the reset button to restart the firmware and IMU calibration process.
fr_ca: L'IMU se calibrera elle-même. Cela dure environ 3 à 5 secondes et sera indiqué par le clignotement rapide de la LED verte. Idéalement, le XRP doit être placé sur une surface plane avant la mise sous tension et, si nécessaire, les utilisateurs peuvent appuyer sur le bouton de réinitialisation pour redémarrer le processus d'étalonnage du micrologiciel et de l'IMU.

source: The network will be configured, depending on the configuration settings. See the section on :doc:`the Web UI </docs/xrp-robot/web-ui>` for more information on how to configure the network settings. By default the XRP will broadcast its own WiFi Access Point.
fr_ca: Le réseau sera configuré en fonction des paramètres de configuration. Consultez la section sur :doc:`l'interface utilisateur Web ` pour plus d'informations sur la configuration des paramètres réseau. Par défaut, le XRP diffusera son propre point d'accès WiFi.

source: After this, the XRP is ready for use.
fr_ca: Après cela, le XRP est prêt à être utilisé.

source: Hardware, Sensors and GPIO
fr_ca: Matériel (Hardware), capteurs et GPIO

source: The XRP has the following built-in hardware/peripherals:
fr_ca: Le XRP dispose du matériel/périphériques intégrés suivants :

source: 2x geared drive motors with encoders
fr_ca: 2x motoréducteurs avec encodeurs

source: 2x additional geared motor connectors with encoder support (marked Motor3 and Motor4)
fr_ca: 2x connecteurs motoréducteur supplémentaires avec support encodeur (marqués Motor3 et Motor4)

source: 2x Servo connectors (marked Servo1 and Servo2)
fr_ca: 2x connecteurs servo (marqués Servo1 et Servo2)

source: 1x Inertial Measurement Unit (IMU)
fr_ca: 1x unité de mesure inertielle (IMU)

source: 1x LED (green)
fr_ca: 1x LED (verte)

source: 1x pushbutton (marked USER)
fr_ca: 1x bouton-poussoir (marqué USER)

source: 1x Line following sensor (exposed as 2 Analog inputs)
fr_ca: 1x capteur de suivi de ligne (exposé comme 2 entrées analogiques)

source: 1x Ultrasonic PING style rangefinder (uses 2 digital IO pins, exposed as an analog input)
fr_ca: 1x capteur à ultrasons de style PING (utilise 2 broches IO numériques, exposées comme une entrée analogique)

source: Motors, Wheels, and Encoders
fr_ca: Moteurs, roues et encodeurs

source: The motors used on the XRP have a 48.75:1 gear reduction and a no-load output speed of 90 RPM at 4.5V.
fr_ca: Les moteurs utilisés sur le XRP ont une réduction de 48,75:1 et une vitesse de sortie à vide de 90 tr/min à 4,5 V.

source: The wheels have a diameter of 60mm (2.3622"). They have a trackwidth of 155mm (6.1").
fr_ca: Les roues ont un diamètre de 60 mm (2,3622"). Elles ont une largeur de voie de 155 mm (6,1").

source: The encoders are connected directly to the motor output shaft and have 12 Counts Per Revolution (CPR). With the provided gear ratio, this nets 585 counts per wheel revolution.
fr_ca: Les encodeurs sont connectés directement à l'arbre de sortie du moteur et disposent de 12 comptes par révolution (CPR). Avec le rapport de démultiplication fourni, cela génère 585 comptes par tour de roue.

source: The motor channels are listed in the table below.
fr_ca: Les canaux du moteur sont répertoriés dans le tableau ci-dessous.

source: We use "motor channels" here instead of "PWM channels" as the XRP requires the use of a special ``XRPMotor`` object in WPILib code to interact with the hardware.
fr_ca: Nous utilisons ici des "canaux moteur" au lieu de "canaux PWM" car le XRP nécessite l'utilisation d'un objet spécial ``XRPMotor`` dans le code WPILib pour interagir avec le matériel.

source: Channel
fr_ca: Canal

source: XRP Hardware Component
fr_ca: Composant matériel XRP

source: Left Motor
fr_ca: Moteur gauche

source: Right Motor
fr_ca: Moteur droit

source: Motor 3
fr_ca: Moteur 3

source: Motor 4
fr_ca: Moteur 4

source: The right motor will spin in a backward direction when positive output is applied. Thus the corresponding motor controller needs to be inverted in robot code.
fr_ca: Le moteur droit tournera vers l’arrière lorsqu’une sortie positive est appliquée. Ainsi, le contrôleur de moteur correspondant doit être inversé dans le code du robot.

source: The servo channels are listed in the table below.
fr_ca: Les canaux de servo sont répertoriés dans le tableau ci-dessous.

source: We use "servo channels" here instead of "PWM channels" as the XRP requires the use of a special ``XRPServo`` object in WPILib code to interact with the hardware.
fr_ca: Nous utilisons ici des "canaux servo" au lieu de "canaux PWM" car le XRP nécessite l'utilisation d'un objet ``XRPServo`` spécial dans le code WPILib pour interagir avec le matériel.

source: The encoder channels are listed in the table below.
fr_ca: Les canaux relatifs aux encodeurs sont répertoriés dans le tableau ci-dessous.

source: Left Encoder Quadrature Channel A
fr_ca: Canal de quadrature encodeur gauche A

source: Left Encoder Quadrature Channel B
fr_ca: Canal de quadrature encodeur gauche B

source: Right Encoder Quadrature Channel A
fr_ca: Canal de quadrature encodeur droit A

source: Right Encoder Quadrature Channel B
fr_ca: Canal de quadrature encodeur droit B

source: Motor3 Encoder Quadrature Channel A
fr_ca: Canal A en quadrature de l'encodeur Motor3

source: Motor3 Encoder Quadrature Channel B
fr_ca: Canal B en quadrature de l'encodeur Motor3

source: Motor4 Encoder Quadrature Channel A
fr_ca: Canal A en quadrature de l'encodeur Motor4

source: Motor4 Encoder Quadrature Channel B
fr_ca: Canal B en quadrature de l'encodeur Motor4

source: By default, the encoders count up when the XRP moves forward.
fr_ca: Par défaut, les encodeurs comptent lorsque le XRP avance.

source: Inertial Measurement Unit
fr_ca: L'unité de mesure inertielle

source: The XRP includes an STMicroelectronics LSM6DSOX Inertial Measurement Unit (IMU) which contains a 3-axis gyro and a 3-axis accelerometer.
fr_ca: Le XRP comprend une unité de mesure inertielle (IMU) STMicroelectronics LSM6DSOX qui contient un gyroscope à 3 axes et un accéléromètre à 3 axes.

source: The XRP will calibrate the gyro and accelerometer upon each boot (the onboard LED will quickly flash for about 3-5 seconds at startup time).
fr_ca: Le XRP calibrera le gyroscope et l'accéléromètre à chaque démarrage (la LED intégrée clignotera rapidement pendant environ 3 à 5 secondes au démarrage).

source: Onboard LED and Push Button
fr_ca: LED et bouton poussoir intégrés

source: The XRP has a push button (labeled USER) and a green LED onboard that are exposed as Digital IO (DIO) channels to robot code.
fr_ca: Le XRP dispose d'un bouton-poussoir (étiqueté USER) et d'une LED verte intégrée qui sont exposés en tant que canaux Digital IO (DIO) au code du robot.

source: DIO Channel
fr_ca: Canal DIO

source: USER Button
fr_ca: Bouton USER

source: Green LED
fr_ca: LED verte

source: DIO 2 and 3 are reserved for future system use.
fr_ca: Les DIO 2 et 3 sont réservées à une utilisation future du système.

source: Line Following (Reflectance) Sensor
fr_ca: Capteur de suivi de ligne (réflectance)

source: When assembled according to the instructions, the XRP supports a line following sensor with 2 sensing elements. Each sensing element measures reflectance exposes these as AnalogInput channels to robot code. The returned values range from 0V (pure white) to 5V (pure black).
fr_ca: Lorsqu'il est assemblé conformément aux instructions, le XRP prend en charge un capteur de suivi de ligne avec 2 éléments de détection. Chaque élément de détection mesure la réflectance et les expose en tant que canaux d'entrée analogique au code du robot. Les valeurs renvoyées vont de 0 V (blanc pur) à 5 V (noir pur).

source: AnalogInput Channel
fr_ca: Canal d'entrée analogique

source: AnalogInput 0
fr_ca: Entrée analogique 0

source: Left Reflectance Sensor
fr_ca: Capteur de réflectance gauche

source: AnalogInput 1
fr_ca: Entrée analogique 1

source: Right Reflectance Sensor
fr_ca: Capteur de réflexion droit

source: Ultrasonic Rangefinder
fr_ca: Capteur à ultrasons

source: When assembled according to the instructions, the XRP supports an ultrasonic, PING style, rangefinder. This is exposed as an AnalogInput channel to robot code. The returned values range from 0V (20mm) to 5V (4000mm).
fr_ca: Lorsqu’il est assemblé conformément aux instructions, le XRP prend en charge un capteur à ultrasons de style PING. Ceci est exposé en tant que canal AnalogInput au code du robot. Les valeurs renvoyées vont de 0 V (20 mm) à 5 V (4 000 mm).

source: AnalogInput 2
fr_ca: Entrée analogique 2
