Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/xrp-robot/hardware-and-imaging.po
Languages: fr_ca

source: XRP Hardware, Assembly and Imaging
fr_ca: Matériel, assemblage et imagerie XRP

source: To get started with the XRP, you will need to have the necessary hardware.
fr_ca: Pour démarrer avec le XRP, vous aurez besoin du matériel suivant.

source: Assembly
fr_ca: Assemblage

source: You should follow the instructions up to and including the point where the XRP arm is mounted to the servo.
fr_ca: Vous devez suivre les instructions jusqu'au point où le bras XRP est monté sur le servo.

source: Imaging your XRP
fr_ca: Imager votre XRP

source: The XRP uses a Raspberry Pi Pico W as its main processor. A special firmware will need to be installed so that the robot operates properly.
fr_ca: Le XRP utilise un Raspberry Pi Pico W comme processeur principal. Un firmware spécial devra être installé pour que le robot fonctionne correctement.

source: Download
fr_ca: Téléchargement

source: The XRP firmware must be downloaded and written to the Pico W. Click on ``Assets`` at the bottom of the description to see the available image files:
fr_ca: Le firmware XRP doit être téléchargé et écrit sur le Pico W. Cliquez sur « Assets » en bas de la description pour voir les fichiers image disponibles :

source: Imaging
fr_ca: Installation de l'image

source: To image the XRP, perform the following steps:
fr_ca: Pour créer une image du XRP, effectuez les étapes suivantes :

source: Plug the XRP into your computer with a Micro-USB cable. You should see a red power LED that lights up.
fr_ca: Branchez le XRP sur votre ordinateur avec un câble Micro-USB. Vous devriez voir une LED d'alimentation rouge qui s'allume.

source: While holding the ``BOOTSEL`` button (the white button on the green Pico W, near the USB connector), quickly press the reset button (circled below), and then release the ``BOOTSEL`` button.
fr_ca: Tout en maintenant enfoncé le bouton « BOOTSEL » (le bouton blanc sur le Pico W vert, près du connecteur USB), appuyez rapidement sur le bouton de réinitialisation (encerclé ci-dessous), puis relâchez le bouton « BOOTSEL ».

source: XRP Reset button
fr_ca: Bouton de réinitialisation XRP

source: The board will temporarily disconnect from your computer, and then reconnect as a USB storage device named ``RPI-RP2``.
fr_ca: La carte se déconnectera temporairement de votre ordinateur, puis se reconnectera en tant que périphérique de stockage USB nommé « RPI-RP2 ».

source: Drag the ``.uf2`` firmware file into the ``RPI-RP2`` drive, and it will automatically update the firmware.
fr_ca: Faites glisser le fichier du firmware ``.uf2`` dans le lecteur ``RPI-RP2`` et il mettra automatiquement à jour le firmware.

source: Once complete, the ``RPI-RP2`` USB storage device will disconnect. At this point, you can disconnect the XRP board from your computer and run it off battery power.
fr_ca: Une fois terminé, le périphérique de stockage USB ``RPI-RP2`` se déconnectera. À ce stade, vous pouvez déconnecter la carte XRP de votre ordinateur et la faire fonctionner sur batterie.

source: First Boot
fr_ca: Premier démarrage

source: Perform the following steps to get your XRP ready for use:
fr_ca: Effectuez les étapes suivantes pour préparer votre XRP à l’utilisation :

source: Ensure that you have 4 AA batteries installed
fr_ca: Assurez-vous que 4 piles AA sont installées

source: Turn the XRP on by sliding the power switch (circled below) on the XRP board to the on position. A red power LED will turn on.
fr_ca: Allumez le XRP en faisant glisser l'interrupteur d'alimentation (encerclé ci-dessous) de la carte XRP en position marche. Une LED d'alimentation rouge s'allumera.

source: XRP Power switch
fr_ca: Interrupteur d'alimentation XRP

source: Using your computer, connect to the XRP WiFi network using the SSID ``XRP-<IDENT>`` (where ``<IDENT>`` is based on the unique ID of the Pico W) with the WPA2 passphrase ``xrp-wpilib``.
fr_ca: À l'aide de votre ordinateur, connectez-vous au réseau WiFi XRP en utilisant le SSID ``XRP-<IDENT>`` (où ``<IDENT>`` est basé sur l'ID unique du Pico W) avec la phrase secrète WPA2 ``xrp-wpilib``.

source: If powering on the XRP in an environment with multiple other XRPs, the SSID can also be found by connecting the XRP to a computer, navigating to the USB storage device (``PICODISK``) that appears and opening the ``xrp-status.txt`` file.
fr_ca: Si vous allumez le XRP dans un environnement avec plusieurs autres XRP, le SSID peut également être trouvé en connectant le XRP à un ordinateur, en accédant au périphérique de stockage USB (``PICODISK``) qui apparaît et en ouvrant le fichier ``xrp-status Fichier .txt``.

source: Open a web browser and connect to the web UI at ``http://192.168.42.1:5000``. If the page loads, you have established connectivity with the XRP.
fr_ca: Ouvrez un navigateur Web et connectez-vous à l'interface utilisateur Web à l'adresse ``http://192.168.42.1:5000``. Si la page se charge, vous avez établi la connectivité avec le XRP.

source: More information about the Web UI and configuration can be found in the :doc:`Web UI section</docs/xrp-robot/web-ui>`.
fr_ca: Plus d'informations sur l'interface utilisateur Web et la configuration peuvent être trouvées dans la section :doc:`Web UI`.
