Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/3rd-party-libraries.po
Languages: fr_ca, tr_tr, zh_cn

source: WPILib Command Libraries
fr_ca: Librairies des commandes WPILib
tr_tr: WPILib Komut Kütüphaneleri
zh_cn: WPILib命令库

source: `New Command Library <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/wpilibNewCommands/WPILibNewCommands.json>`__
fr_ca: `Librairie de la nouvelle architecture Command <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/wpilibNewCommands/WPILibNewCommands.json>`__

source: To remove a library dependency from a project, select **Manage Current Libraries** from the **Manage Vendor Libraries** menu, check the box for any libraries to uninstall and click OK. These libraries will be removed as dependencies from the project.
fr_ca: Pour supprimer une dépendance de librairie d'un projet, sélectionnez **Manage Current Libraries** du menu **Manage Vendor Libraries**, cochez la case des librairies à désinstaller et cliquez sur OK. Ces librairies seront supprimées en tant que dépendances du projet.
tr_tr: Bir projeden kütüphane destek dosyalarını kaldırmak için, **Manage Vendor Libraries -Üretici Kütüphaneleri Yönetin** menüsünden **Manage Current Libraries -Mevcut Kütüphaneleri Yönetin** seçeneğini seçin, kaldırılacak kitaplıkların kutusunu işaretleyin ve Tamam'a tıklayın. Bu kitaplıklar projeden destek dosyaları olarak kaldırılacaktır.
zh_cn: 要从项目中删除库依赖项，请从**管理供应商库**菜单中选择**管理当前库**，选中要卸载的任何库的复选框，然后单击**确定**。这些库将从项目中删除。

source: Romi Library
fr_ca: Librairy Romi

source: A Romi Library has been created to contain several helper classes that are a part of the ``RomiReference`` example.
fr_ca: Une librairie Romi a été créée pour contenir plusieurs classes d’assistance qui font partie de l’exemple ``RomiReference``.

source: The vendor JSON files are actually processed by GradleRIO once they are in your projects ``vendordeps`` folder. If you are using another IDE, you will need to manually create a “vendordeps” folder in your project and copy any desired vendor JSON files from the “wpilib/YYYY” folder (where they should be placed by an offline installer) or download them directly from the vendor and place them into the folder in the project.
tr_tr: Sağlayıcı JSON dosyaları, projelerinizin ``vendordeps`` klasörüne girdikten sonra aslında GradleRIO tarafından işlenir. Başka bir IDE kullanıyorsanız, projenizde manuel olarak bir "vendordeps" klasörü oluşturun ve istediğiniz sağlayıcı JSON dosyalarını “wpilib/YYYY” klasöründen (çevrimdışı bir yükleyici tarafından yerleştirilmeleri gereken yer) kopyalayın veya doğrudan sağlayıcıdan indirin ve bunları projedeki klasöre yerleştirin.

source: VS Code
tr_tr: VS Kodu

source: These are **not** links to directly plug in to the :guilabel:`VS Code` -> :guilabel:`Install New Libraries (online)` feature. Click these links to visit the vendor site to see whether they offer online installers, offline installers, or both.
tr_tr: Bunlar:guilabel:`VS Code` -> :guilabel:`Install New Libraries (online)` özelliğine doğrudan bağlantı **değildir**. Çevrimiçi yükleyiciler, çevrimdışı yükleyiciler veya her ikisini birden sunup sunmadıklarını görmek üzere satıcının sitesini ziyaret etmek için bu bağlantıları tıklayın.

source: `Analog Devices ADIS16448 IMU <https://github.com/juchong/ADIS16448-roboRIO-Driver>`__ - Driver for ADIS16448 IMU. More info `here <https://wiki.analog.com/first/first_robotics_donation_resources#adis16448_imu_board_for_first_robotics>`__
tr_tr: `Analog Devices ADIS16448 IMU <https://github.com/juchong/ADIS16448-roboRIO-Driver>`__ - ADIS16448 IMU için sürücü. Ayrıntılı bilgi `burada <https://wiki.analog.com/first/first_robotics_donation_resources#adis16448_imu_board_for_first_robotics>`__

source: `Analog Devices ADIS16470 IMU <https://github.com/juchong/ADIS16470-roboRIO-Driver>`__ - Driver for ADIS16470 IMU. More info `here <https://wiki.analog.com/first/first_robotics_donation_resources#adis16470_imu_board_for_first_robotics>`__
tr_tr: `Analog Devices ADIS16470 IMU <https://github.com/juchong/ADIS16470-roboRIO-Driver>`__ - ADIS16470 IMU için sürücü. Ayrıntılı bilgi `burada <https://wiki.analog.com/first/first_robotics_donation_resources#adis16470_imu_board_for_first_robotics>`__

source: `CTRE Phoenix Framework <https://github.com/CrossTheRoadElec/Phoenix-Releases/releases>`__ - Contains CANcoder, CANifier, Pigeon IMU, Talon FX, Talon SRX, and Victor SPX Libraries and Phoenix Tuner program for configuring CTRE CAN devices
tr_tr: `CTRE Phoenix Framework <https://github.com/CrossTheRoadElec/Phoenix-Releases/releases>`__ - CANcoder, CANifier, Pigeon IMU, Talon FX, Talon SRX ve Victor SPX Kitaplıkları ve CTRE CAN cihazlarını yapılandırmak için Phoenix Tuner programını içerir

source: `Rev Robotics SPARK MAX <https://www.revrobotics.com/sparkmax-software/>`__ - SPARK MAX Library
tr_tr: `Rev Robotics SPARK MAX <https://www.revrobotics.com/sparkmax-software/>`__ - SPARK MAX Kütüphanesi

source: The WPILib :doc:`old </docs/software/old-commandbased/index>` and :doc:`new </docs/software/commandbased/index>` command libraries have been split into vendor libraries in order to reduce the chances of mixing the two which will not work correctly. They are both installed by the wpilib installer for offline installation. They may also be installed with the following online links:
tr_tr: WPILib :doc:`eski </docs/software/old-commandbased/index>` ve :doc:`yeni </docs/software/commandbased/index>` komut kütüphaneleri, düzgün çalışmayacak bir versiyon ortaya çıkaran ikisini karıştırma şansını azaltmak için üretici kütüphanelerine bölünmüştür. Her ikisi de çevrimdışı kurulum için wpilib yükleyici tarafından yüklenir. Aşağıdaki çevrimiçi bağlantılarla da kurulabilirler:

source: `Old Command Library <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/wpilibOldCommands/WPILibOldCommands.json>`__ `New Command Library <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/wpilibNewCommands/WPILibNewCommands.json>`__
tr_tr: `Eski Komut Kitaplığı <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/wpilibOldCommands/WPILibOldCommands.json>` __ `Yeni Komut Kitaplığı <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/wpilibNewCommands/WPILibNewCommands.json>` __

source: The project template for the Old Command Library has been removed. New projects are no longer able to be created for this, and users are highly recommended to migrate to the new library.
zh_cn: 旧指令库的项目模板现在被移除了。新的项目不再会被加入旧的指令库，我们相当建议旧指令库的用户迁移到新的库

source: The WPILib old and :doc:`new </docs/software/commandbased/index>` command libraries have been split into vendor libraries in order to reduce the chances of mixing the two which will not work correctly. They are both installed by the wpilib installer for offline installation. They may also be installed with the following online links:
zh_cn: WPILib :doc:`旧 </docs/software/old-commandbased/index>` 命令库和 :doc:`新 </docs/software/commandbased/index>` 命令库 已被划分为供应商库，以减少将两者混合使用的机会，而这两者将无法正常工作。它们都由wpilib安装程序安装，以进行脱机安装。它们也可以通过以下在线链接进行安装：
