Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/3rd-party-libraries.po
Languages: fr_ca, tr_tr, zh_cn

source: 3rd Party Libraries
fr_ca: Librairies tierces
tr_tr: 3. Taraf Kütüphaneleri
zh_cn: 第三方库

source: Teams that are not using parts provided in the KoP will likely need to install external dependencies. Please view the below section to see information on adding an external library.
fr_ca: Les équipes qui n’utilisent pas les pièces fournies dans le KoP devront probablement installer des dépendances externes. Veuillez consulter la section ci-dessous pour voir les informations sur l’ajout d’une bibliothèque externe.
tr_tr: KoP'ta sağlanan parçaları kullanmayan ekiplerin büyük olasılıkla harici bağımlılıklar kurması gerekecektir. Harici kitaplık eklemeyle ilgili bilgileri görmek için lütfen aşağıdaki bölümü inceleyin.
zh_cn: 不使用KoP中提供的部分的团队可能需要安装外部库。 请查看以下部分以查看有关添加外部库的信息。

source: The Mechanism
fr_ca: Processus
tr_tr: Mekanizma
zh_cn: 机制

source: In support of this effort NI (for LabVIEW) and FIRST/WPI (for Java/C++) have developed mechanisms that should make it easy for vendors to plug their code into the WPILib software and for teams to use that code once it has been installed. A brief description of how the system works for each language can be found below.
fr_ca: À l’appui de cet effort, NI (pour LabVIEW) et FIRST/WPI (pour Java/C++) ont développé des mécanismes qui devraient permettre aux fournisseurs d'intégrer facilement leur code sur le logiciel WPILib et aux équipes d’utiliser ce code une fois qu’il a été installé. Vous trouverez ci-dessous une brève description du fonctionnement du système pour chaque langage de programmation.
tr_tr: Bu çabayı desteklemek için NI (LabVIEW için) ve FIRST/WPI (Java/C++ için), satıcıların kodlarını WPILib yazılımına eklemesini ve ekiplerin bu kodu yüklendikten sonra kullanmasını kolaylaştıracak mekanizmalar geliştirmiştir. . Sistemin her dil için nasıl çalıştığına dair kısa bir açıklama aşağıda bulunabilir.
zh_cn: 为了支持这项工作，NI（对于LabVIEW）和FIRST / WPI（对于Java / C ++）已经开发了机制，使供应商可以轻松地将其代码插入WPILib软件，并且一旦安装该代码，团队就可以使用该代码 。 可以在下面找到有关系统针对每种语言的工作方式的简要说明。

source: The Mechanism - Java/C++
fr_ca: Le mécanisme - Java/C++
tr_tr: Mekanizma - Java/C++
zh_cn: 机制-Java / C ++

source: For Java and C++ a JSON file describing the vendor library is installed on your system to ``~/wpilib/YYYY/vendordeps`` (where YYYY is the year and ~ is ``C:\Users\Public`` on Windows). This can either be done by an offline installer or the file can be fetched from an online location using the menu item in Visual Studio Code. This file is then used from VS Code to add to the library to each individual project. Vendor library information is managed on a per-project basis to make sure that a project is always pointing to a consistent version of a given vendor library. The libraries themselves are placed in the Maven cache at ``C:\Users\Public\wpilib\YYYY\maven``. Vendors can place a local copy here with an offline installer (recommended) or require users to be online for an initial build to fetch the library from a remote Maven location.
fr_ca: Pour Java et C++ un fichier JSON décrivant la librairie du fournisseur est installé dans votre système à ``~/wpilib/YYYY/vendordeps`` (où YYYY est l'année et ~ est ``C:\Users\Public`` sous Windows). Ceci peut être fait par un installateur hors ligne ou le fichier peut être récupéré à partir d’un emplacement en ligne en utilisant l’élément de menu dans Visual Studio Code. Ce fichier est ensuite utilisé à partir de VS Code pour être ajouté à la librairie de chaque projet individuel. Les informations de la librairie du fournisseur sont gérées par projet pour s’assurer qu’un projet pointe toujours vers une version cohérente de la librairie d'un fournisseur donné. Les librairies elles-mêmes sont placées dans le cache Maven à ``C:\Users\Public\wpilib\YYYY\maven``. Les vendeurs peuvent placer une copie locale ici avec un installateur hors ligne (recommandé) ou exiger des utilisateurs d’être en ligne pour une première compilation pour aller chercher la librairie dans un emplacement maven à distance.
tr_tr: Java ve C++ için, satıcı kitaplığını açıklayan bir JSON dosyası sisteminize `` ~/wpilib/YYYY/vendordeps`` olarak yüklenir (burada YYYY yıl ve ~, Windows'ta `` C:\ Users\Public`` şeklindedir) . Bu, çevrimdışı bir yükleyici tarafından yapılabilir veya dosya, Visual Studio Code'daki menü öğesi kullanılarak çevrimiçi bir konumdan getirilebilir. Bu dosya daha sonra VS Code'dan her bir projeye kitaplığa eklemek için kullanılır. Satıcı kitaplığı bilgileri, bir projenin her zaman belirli bir satıcı kitaplığının tutarlı bir sürümüne işaret ettiğinden emin olmak için proje bazında yönetilir. Kitaplıkların kendileri ``C:\Users\Public\wpilib\YYYY\maven`` konumunda Maven önbelleğine yerleştirilir. Satıcılar, çevrimdışı bir yükleyiciyle buraya yerel bir kopya yerleştirebilir (önerilir) veya kitaplığı uzak bir Maven konumundan getirmek için kullanıcıların ilk derlemede çevrimiçi olmalarını isteyebilir.
zh_cn: 对于Java和C ++，在将描述供应商库的JSON文件安装到你的系统上：〜/ wpilib / YYYY / vendordeps（其中YYYY是年份，而〜是Windows上的C：\ Users \ Public）。这可以由脱机安装程序完成，也可以使用Visual Studio Code中的菜单项从联机位置获取文件。然后，从VS Code中使用该文件将其添加到每个单独项目的库中。供应商库信息是按项目进行管理的，以确保项目始终指向给定供应商库的一致版本。库本身位于C：\ Users \ Public \ wpilib \ YYYY \ maven的Maven缓存中。供应商可以使用脱机安装程序在此处放置本地副本（推荐），或者要求用户在线以进行初始构建以从远程Maven位置获取库。

source: The JSON file allows specification of complex libraries with multiple components (Java, C++, JNI, etc.) and also helps handle some complexities related to simulation. Vendors choosing to provide a remote URL in the JSON also enable users to check for updates from within VS Code.
fr_ca: Le fichier JSON permet la spécification de librairies complexes avec plusieurs composants (Java, C++, JNI, etc.) et aide également à gérer certaines complexités liées à la simulation. Les fournisseurs qui choisissent de fournir une URL distante dans le fichier JSON permettent également aux utilisateurs de vérifier les mises à jour à partir de VS Code.
tr_tr: JSON dosyası, birden çok bileşenle (Java, C ++, JNI vb.) Karmaşık kitaplıkların belirtilmesine izin verir ve ayrıca simülasyonla ilgili bazı karmaşıklıkların üstesinden gelmeye yardımcı olur. JSON'da bir uzak URL sağlamayı seçen satıcılar, kullanıcıların VS Code içinden güncellemeleri kontrol etmesine de olanak tanır.
zh_cn: JSON文件允许指定具有多个组件（Java，C ++，JNI等）的复杂库，还可以帮助处理与仿真相关的一些复杂问题。选择在JSON中提供远程URL的供应商还使用户能够从VS Code中检查更新。

source: The vendor JSON files are actually processed by GradleRIO once they are in your projects ``vendordeps`` folder. If you are using another IDE, you will need to manually create a "vendordeps" folder in your project and copy any desired vendor JSON files from the "wpilib/YYYY" folder (where they should be placed by an offline installer) or download them directly from the vendor and place them into the folder in the project.
fr_ca: Les fichiers JSON des fournisseurs sont effectivement traités par GradleRIO une fois qu’ils sont dans votre dossier de projets ``vendordeps``. Si vous utilisez un autre IDE, vous devrez créer manuellement un dossier ``vendordeps`` dans votre projet et copier tous les fichiers JSON du fournisseur désiré à partir du dossier "wpilib/YYYY" (où ils doivent être placés par un installateur hors ligne) ou les télécharger directement à partir du fournisseur et les placer dans le dossier du projet.
zh_cn: 一旦供应商JSON文件位于您的项目的vendordeps文件夹中，它们便实际上由GradleRIO处理。 如果使用其他IDE，则需要在项目中手动创建“ vendordeps”文件夹，然后从“ wpilib / YYYY”文件夹（脱机安装程序放置它们的位置）复制任何所需的供应商JSON文件 或直接从供应商处下载并将它们放入项目的文件夹中。

source: The Mechanism - LabVIEW
fr_ca: Processus - LabVIEW
tr_tr: Mekanizma - LabVIEW
zh_cn: 机制-LabVIEW

source: For LabVIEW teams, you may notice a few new Third Party items on various palettes (specifically, one in :guilabel:`Actuators`, one in :guilabel:`Actuators` -> :guilabel:`Motor Control` labeled :guilabel:`CAN Motor`, and one in :guilabel:`Sensors`). These correspond to folders in ``C:\Program Files\National Instruments\LabVIEW YYYY\vi.lib\Rock Robotics\WPI\Third Party`` where ``YYYY`` is the current year - 1. If it’s 2020, the directory would be ``LabVIEW 2019``.
fr_ca: Pour les équipes labview, vous remarquerez peut-être quelques nouveaux éléments tiers partie sur différentes palettes (en particulier, un dans :guilabel:`Actuators`, un dans :guilabel:`Actuators` -> :guilabel:`Motor Control` étiqueté :guilabel:`CAN Motor`, et un dans :guilabel:`Sensors`). Ceux-ci correspondent à des dossiers dans ``C:\Program Files\National Instruments\LabVIEW YYYY\vi.lib\Rock Robotics\WPI\Third Party`` où ``YYYY`` est l’année en cours - 1. Si nous sommes en 2020, le repertoire devrait être ``LabVIEW 2019``.
tr_tr: LabVIEW ekipleri için, çeşitli paletlerde birkaç yeni Üçüncü Taraf öğesi fark edebilirsiniz (özellikle biri::guilabel:`Actuators` biri :guilabel:`Actuators` -> :guilabel:`Motor Control` etiketli::guilabel:`CAN Motor` ve biri: :guilabel:`Sensors`). Bunlar, ``C:\Program Files\National Instruments\LabVIEW YYYY\vi.lib\Rock Robotics\WPI\Third Party`` içindeki klasörlere karşılık gelir; burada ``YYYY`` mevcut yıl anlamına gelir - 1. 2020 ise, dizin ``LabVIEW 2019`` olacaktır.
zh_cn: 对于LabVIEW团队，您可能会注意到在各种选项版上有一些新的“Third Party”项（特别是，在“Actuators”中一项，在“Actuators -> Motor Control labeled CAN Motor”中一项，在“Sensors”中一项）。 它们对应于C：\ Program Files \ National Instruments \ LabVIEW YYYY \ vi.lib \ Rock Robotics \ WPI \ Third Party中的文件夹，其中YYYY是当前年份-1。如果是2020，则目录为LabVIEW 2019。

source: To use installed "Third Party" libraries, simply locate the VIs in one of these 3 locations and drag them into your project as you would with any other VI.
fr_ca: Pour utiliser les librairies "Tierce partie" installées, il vous suffit de localiser les VIs dans l’un de ces 3 emplacements et de les faire glisser dans votre projet comme vous le feriez avec n’importe quel autre VI.
tr_tr: Yüklü "Üçüncü Taraf" kitaplıklarını kullanmak için, VI'leri bu 3 konumdan birinde bulun ve diğer VI'larda olduğu gibi bunları projenize sürükleyin.
zh_cn: 要使用已安装的“第三方”库，只需将VI放在这三个位置之一，然后将它们拖到项目中即可，就像使用其他VI一样。

source: Managing VS Code Libraries
fr_ca: Gestion des librairies sous VS Code
tr_tr: VS Code Kütüphaneleri Yönetme
zh_cn: 管理VS code库

source: Adding Offline Libraries
fr_ca: Ajout de librairies hors ligne
tr_tr: Çevrimdışı Kütüphane Ekleme
zh_cn: 添加离线库

source: Using the Manage Vendor Libraries option of the WPILib Command Palette.
fr_ca: Utilisation de l’option Manage Vendor Libraries de la palette de commandes WPILib.

source: To add a vendor library that has been installed by an offline installer, press :kbd:`Ctrl+Shift+P` and type WPILib or click on the WPILib icon in the top right to open the WPILib Command Palette and begin typing :guilabel:`Manage Vendor Libraries`, then select it from the menu. Select the option to :guilabel:`Install new libraries (offline)`.
fr_ca: Pour ajouter une librairie d'un fournisseur qui a été installée par un installateur hors ligne, appuyez sur :kbd:`Ctrl+Shift+P` et tapez WPILib ou cliquez sur l’icône WPILib en haut à droite pour ouvrir la palette de commande WPILib et commencer à taper :guilabel:`Manage Vendor Libraries`, puis sélectionnez-la dans le menu. Sélectionnez l’option :guilabel:`Install new libraries (offline)`.
tr_tr: Çevrimdışı bir sağlayıcı tarafından kurulan bir satıcı kütüphanesini eklemek için, şu tuşa basın: kbd:`Ctrl +Shift+P` ve WPILib yazın veya WPILib Komut Paletini açmak için sağ üstteki WPILib simgesine tıklayın ve yazmaya başlayın: :guilabel:`Manage Vendor Libraries`, ardından menüden :guilabel:`Install new libraries (offline)` seçeneğini seçin.
zh_cn: 要添加由脱机安装程序安装的供应商库，请按Ctrl + Shift + P并输入WPILib/单击右上角的WPILib图标，以打开WPILib命令面板。然后，输入“Manage Vendor Libraries”，然后从下拉菜单中选择它。 选择“Install new libraries (offline)”的选项。

source: Select the libraries to add.
fr_ca: Sélectionnez les librairies à ajouter.

source: Select the desired libraries to add to the project by checking the box next to each, then click :guilabel:`OK`. The JSON file will be copied to the ``vendordeps`` folder in the project, adding the library as a dependency to the project.
fr_ca: Sélectionnez les librairies que l'on souhaite ajouter au projet en cochant la case à côté de chacune, puis cliquez sur :guilabel:`OK`. Le fichier JSON sera copié dans le dossier ``vendordeps`` dans le projet, ajoutant la librairie comme une dépendance au projet.
tr_tr: Her birinin yanındaki kutuyu işaretleyerek projeye eklemek için istenen kitaplıkları seçin ve ardından tıklayın :guilabel:`OK`. JSON dosyası, kütüphaneyi projeye bağımlılık olarak ekleyerek projedeki ``vendordeps`` klasörüne kopyalanacaktır.
zh_cn: 选中每个库旁边的框，选择 要添加到项目中的所需库，然后单击“确定”。 这样，JSON文件将被复制到项目中的vendordeps文件夹中，并将库添加为项目的依赖项。

source: Command-line
fr_ca: Ligne de commande
tr_tr: Komut satırı
zh_cn: 命令行

source: Adding a vendor library dependency from the vendor URL can also be done through the command-line via a gradle task. Open a command-line instance at the project root, and enter ``gradlew vendordep --url=<url>`` where ``<url>`` is the vendor JSON URL. This will add the vendor library dependency JSON file to the ``vendordeps`` folder of the project. Vendor libraries can be updated the same way.
fr_ca: L’ajout d’une dépendance d'une librairie tierce à partir de l’URL du fournisseur peut également se faire à travers la ligne de commande via une tâche gradle. Ouvrez une instance de ligne de commande à la racine du projet, puis entrez ``gradlew vendordep --url=<url>`` où ``<url>`` est l’URL JSON du fournisseur. Cette ajoutera le fichier JSON de dépendance de la librairie des fournisseurs au dossier ``vendordeps`` du projet. Les librairies des fournisseurs peuvent être mises à jour de la même façon.
tr_tr: Satıcı URL'sinden bir satıcı kitaplığı bağımlılığı eklemek, bir gradle görevi aracılığıyla komut satırı aracılığıyla da yapılabilir. Proje kökünde bir komut satırı örneği açın ve ``radlew vendordep --url =`` yazın; burada `` , satıcının JSON URL'sidir. Bu, satıcı kitaplığı bağımlılığı JSON dosyasını projenin `` vendordeps`` klasörüne ekleyecektir. Satıcı kitaplıkları da aynı şekilde güncellenebilir.
zh_cn: 还可以通过gradle任务通过命令行从供应商URL添加供应商库依赖项。在项目根目录下打开一个命令行，然后输入“gradlew vendordep --url = <url>”，其中<url>是供应商JSON URL。这会将供应商库依赖项JSON文件添加到项目的vendordeps文件夹中。供应商库可以用相同的方式更新。

source: The ``vendordep`` gradle task can also fetch vendordep JSONs from the user ``wpilib`` folder. To do so, pass ``FRCLOCAL/Filename.json`` as the file URL. For example, ``gradlew vendordep --url=FRCLOCAL/WPILibNewCommands.json`` will fetch the JSON for the new command-based framework.
fr_ca: La tâche gradle ``vendordep`` peut également aller chercher les fichiers vendordep JSONs dans le dossier de l’utilisateur ``wpilib``. Pour ce faire, passez ``FRCLOCAL/Filename.json`` comme URL du fichier. Par exemple, ``gradlew vendordep --url=FRCLOCAL/WPILibNewCommands.json`` va chercher le fichier JSON pour le nouveau cadre de développement orienté commande.
tr_tr: ``Vendordep`` gradle görevi, vendordep JSON'larını kullanıcı `` wpilib`` klasöründen de alabilir. Bunu yapmak için, dosya URL'si olarak ``FRCLOCAL/Filename.json`` yazın. Örneğin, ``gradlew vendordep --url = FRCLOCAL / WPILibNewCommands.json``, yeni komut tabanlı çerçeve için JSON'u getirecektir.
zh_cn: “vendordep” gradle任务还可以从用户“wpilib”文件夹中获取vendordep JSON。为此，请将“FRCLOCAL / Filename.json”作为文件URL传递。例如，“gradlew vendordep --url = FRCLOCAL / WPILibNewCommands.json”将为一个基于命令的新框架获取JSON。

source: Checking for Updates (Offline)
fr_ca: Vérification des mises à jour (hors ligne)
tr_tr: Güncellemeleri Kontrol Etme (Çevrimdışı)
zh_cn: 检查更新（离线）

source: Dependencies are now version managed and done on a per-project bases. Even if you have installed an updated library using an offline installer, you will need to :guilabel:`Manage Vendor Libraries` and select :guilabel:`Check for updates (offline)` for each project you wish to update.
fr_ca: Les dépendances sont maintenant gérées par version et effectuées sur une base par projet. Même si vous avez installé une librairie mise à jour à l’aide d’un installateur hors ligne, vous devrez vous servir de :guilabel:`Manage Vendor Libraries` et sélectionner :guilabel:`Check for updates (offline)` pour chaque projet que vous souhaitez mettre à jour.
tr_tr: Bağımlılıklar artık sürüm yönetiliyor ve proje bazında yapılıyor. Çevrimdışı bir yükleyici kullanarak güncellenmiş bir kitaplık kurmuş olsanız bile, şunları yapmanız gerekir :guilabel:`Manage Vendor Libraries` ve güncellemek istediğiniz her proje için :guilabel:`Check for updates (offline)` , seçeneğini belirleyin.
zh_cn: 现在，依赖项是在每个项目的基础上进行版本管理和完成的。即使您已使用脱机安装程序安装了更新的库，也需要点击“Manage Vendor Libraries”并为要更新的每个项目选择“Check for updates (offline)”。

source: Checking for Updates (Online)
fr_ca: Vérification des mises à jour (en ligne)
tr_tr: Güncellemeleri Kontrol Etme (Çevrimiçi)
zh_cn: 检查更新（在线）

source: Part of the JSON file that vendors may optionally populate is an online update location. If a library has an appropriate location specified, running :guilabel:`Check for updates (online)` will check if a newer version of the library is available from the remote location.
fr_ca: Une partie du fichier JSON que les fournisseurs peuvent optionnellement remplir est un emplacement de mise à jour en ligne. Si une librairie a un emplacement approprié spécifié, l'exécution de :guilabel:`Check for updates (online)` vérifiera si une nouvelle version de la librairie est disponible à partir de l’emplacement distant.
tr_tr: Satıcıların isteğe bağlı olarak doldurabileceği JSON dosyasının bir kısmı, çevrimiçi bir güncelleme konumudur. Bir kitaplıkta uygun bir konum belirtilmişse, çalıştırarak :guilabel:`Check for updates (online)` , kitaplığın daha yeni bir sürümünün uzak konumdan mevcut olup olmadığını kontrol eder.
zh_cn: 供应商可以选择填充一部分JSON文件为在线更新。如果库指定了适当的位置，则运行“Check for updates (online)”可检查远程位置是否有可用的较新版本的库。

source: Removing a Library Dependency
fr_ca: Suppression d'une dépendance
tr_tr: Bir Kütüphane Destek Dosyasını Kaldırma
zh_cn: 删除库依赖

source: To remove a library dependency from a project, select :guilabel:`Manage Current Libraries` from the :guilabel:`Manage Vendor Libraries` menu, check the box for any libraries to uninstall and click :guilabel:`OK`. These libraries will be removed as dependencies from the project.
fr_ca: Pour supprimer une dépendance d’un projet à une librairie, sélectionnez :guilabel:`Manage Current Libraries` du menu :guilabel:`Manage Vendor Libraries`, cochez les cases correspondant à toutes les librairies à désinstaller et cliquer sur :guilabel:`OK`. Ces librairies seront supprimées en tant que dépendances du projet.
tr_tr: Bir projeden kütüphane bağımlılığını kaldırmak için:guilabel:`Manage Current Libraries` menüsünden :guilabel:`Manage Vendor Libraries` seçeneğini seçin, kaldırılacak kitaplıklar için kutuyu işaretleyin ve tıklayın :guilabel:`OK`. Bu kitaplıklar projeden bağımlılıklar olarak kaldırılacaktır.
zh_cn: 要从项目中删除库依赖性，请从“Manage Vendor Libraries”菜单中选择“Manage Current Libraries”，选中要卸载的任何库的复选框，然后单击“确定”。这些库将从项目中删除。

source: Libraries
fr_ca: Librairies
tr_tr: Kütüphaneler
zh_cn: 库

source: Many vendors, such as CTRE & REV, recommend using their offline installers over using the online vendor json URL. This recommendation is because the offline installer is bundled with additional programs that are extremely useful when working with their devices.
fr_ca: De nombreux fournisseurs, tels que CTRE & REV, recommandent d’utiliser leurs programmes d’installation hors ligne plutôt que l’URL du fichier json du fournisseur en ligne. Cette recommandation est due au fait que le programme d’installation hors ligne est fourni avec des programmes supplémentaires qui sont extrêmement utiles lorsque vous travaillez avec leurs composants.

source: Click these links to visit the vendor site to see whether they offer online installers, offline installers, or both. URLs below are to plug in to the :guilabel:`VS Code` -> :guilabel:`Install New Libraries (online)` feature. The online vendor json will break if a team has not ran an "online" build after 30 days, since the cache will clear.
fr_ca: Cliquez sur ces liens pour visiter le site du fournisseur afin de voir s’il propose des programmes d’installation en ligne, des programmes d’installation hors ligne ou les deux. Les adresses URL ci-dessous sont à fournir lors de l'appell de la commande :guilabel:`VS Code` -> :guilabel:`Install New Libraries (online)`. Le fichier json en ligne du fournisseur plantera si une équipe n’a pas compilé son programme avec une version "online" après 30 jours, car le cache sera effacé.

source: `Copperforge LibCu Software Library <https://copperforge.cc/docs/software/libcu/>`__ - Library for all Copperforge devices including the Lasershark
fr_ca: `Copperforge LibCu Software Library <https://copperforge.cc/docs/software/libcu/>`__ - Librairie pour la prise en charge de tous les composants Copperforge, dont Lasershark
tr_tr: `Copperforge LibCu Software Library <https://copperforge.cc/docs/software/libcu/>`__ - Lasershark dahil tüm Copperforge aygıtları için kütüphane
zh_cn: `Copperforge LibCu Software Library <https://copperforge.cc/docs/software/libcu/>`__ - 包括Lasershark在内的所有 Copperforge 设备的库

source: `Digilent <https://reference.digilentinc.com/dmc-60c/getting-started>`__ - DMC-60C library
fr_ca: `Digilent <https://reference.digilentinc.com/dmc-60c/getting-started>`__ - Librairie DMC-60C
tr_tr: `Digilent <https://reference.digilentinc.com/dmc-60c/getting-started>`__ - DMC-60C kütüphanesi
zh_cn: `Digilent <https://reference.digilentinc.com/dmc-60c/getting-started>`__-DMC-60C库

source: `Playing With Fusion Driver <https://www.playingwithfusion.com/docview.php?docid=1205>`__ - Library for all PWF devices including the Venom motor/controller
fr_ca: `Playing With Fusion Driver <https://www.playingwithfusion.com/docview.php?docid=1205>`__ - Librairie pour tous les équipements PWF, dont le moteur/contrôleur Venom
tr_tr: `Fusion Driver ile oynamak <https://www.playingwithfusion.com/docview.php?docid=1205>`__- Venom motor/kontrol cihazı dahil tüm PWF cihazları için kütüphane
zh_cn: `Playing With Fusion Driver <https://www.playingwithfusion.com/docview.php?docid=1205>`__ - 包括 Venom motor/controller在内的所有PWF设备的库

source: `Kauai Labs <https://pdocs.kauailabs.com/navx-mxp/software/roborio-libraries/>`__ - Libraries for NavX-MXP, NavX-Micro, and Sensor Fusion
fr_ca: `Kauai Labs <https://pdocs.kauailabs.com/navx-mxp/software/roborio-libraries/>`__ - Librairies pour NavX-MXP, NavX-Micro, et Sensor Fusion
tr_tr: `Kauai Labs <https://pdocs.kauailabs.com/navx-mxp/software/roborio-libraries/>`__ - NavX-MXP, NavX-Micro, ve Sensor Fusion kütüphaneleri
zh_cn: `Kauai Labs <https://pdocs.kauailabs.com/navx-mxp/software/roborio-libraries/>`__ - NavX-MXP, NavX-Micro, 与Sensor Fusion的库

source: `REV Robotics REVLib <https://docs.revrobotics.com/sparkmax/software-resources/spark-max-api-information>`__ - Library for all REV devices including SPARK MAX and Color Sensor V3
fr_ca: `REV Robotics REVLib <https://docs.revrobotics.com/sparkmax/software-resources/spark-max-api-information>`__ - Librairie de tous les composants de la famille REV incluant SPARK MAX et le capteur Color Sensor V3

source: Community Libraries
fr_ca: Librairies communautaires
tr_tr: Topluluk Kütüphaneleri
zh_cn: 社区库

source: `PhotonVision <https://docs.photonvision.org/en/latest/docs/programming/photonlib/adding-vendordep.html>`_ - Library for PhotonVision CV software
fr_ca: Librairie du logiciel PhotonVision CV `PhotonVision <https://docs.photonvision.org/en/latest/docs/programming/photonlib/adding-vendordep.html>`_
tr_tr: `PhotonVision <https://docs.photonvision.org/en/latest/docs/programming/photonlib/adding-vendordep.html>`_ - PhotonVision CV yazılımı için Kütüphane
zh_cn: `PhotonVision <https://docs.photonvision.org/en/latest/docs/programming/photonlib/adding-vendordep.html>`_-PhotonVision CV软件库
