Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/creating-robot-program.po
Languages: fr_ca, ja, tr_tr, zh_cn

source: Creating a Robot Program
fr_ca: Créer le programme du robot
ja: ロボットプログラムの作成
tr_tr: Bir Robot Programı Oluşturmak
zh_cn: 创建机器人程序

source: Once everything is installed, we're ready to create a robot program. WPILib comes with several templates for robot programs. Use of these templates is highly recommended for new users; however, advanced users are free to write their own robot code from scratch.
fr_ca: Une fois que tout est installé, nous sommes prêts à créer un programme pour le robot. WPILib fournit plusieurs modèles de programmes de robot. L'utilisation de ces modèles est fortement recommandée pour les nouveaux utilisateurs; cependant, les utilisateurs avancés sont libres d'écrire leur propre code de robot à partir de zéro.
ja: すべてをインストールできたら、ロボットプログラムを作成することが出来ます。WPILibには複数のロボットプログラムテンプレートがあります。初心者にはこれらのテンプレートの利用をおすすめしますが、上級者はゼロからロボットのコードを書いても構いません。
tr_tr: Her şey kurulduktan sonra, bir robot programı oluşturmaya hazırız. WPILib, robot programları için çeşitli şablonlarla birlikte gelir. Bu şablonların kullanımı yeni kullanıcılar için şiddetle tavsiye edilir; ancak, ileri düzey kullanıcılar kendi robot kodlarını sıfırdan yazmakta özgürdür.
zh_cn: 安装完所有内容后，我们就可以创建机器人程序了。WPILib随附了多个机器人程序模板。强烈建议新用户使用这些模板。但是，高级用户可以自由地从头开始编写自己的机器人代码。

source: Choosing a Base Class
fr_ca: Choix d'une classe de base
ja: 基本クラスの選択
tr_tr: Temel Sınıf Seçme
zh_cn: 选择基类

source: To start a project using one of the WPILib robot program templates, users must first choose a base class for their robot. Users subclass these base classes to create their primary :code:`Robot` class, which controls the main flow of the robot program. There are three choices available for the base class:
fr_ca: Pour démarrer un projet à l'aide d'un des modèles WPILib de programme de robot, les utilisateurs doivent d'abord choisir une classe de base pour leur robot. Les utilisateurs sous-classent ces classes de base pour créer leur classe primaire :code:`Robot`, qui contrôle le flux principal du programme du robot. Trois choix sont disponibles pour la classe de base:
ja: WPILibのロボットプログラムテンプレートを使用してプロジェクトを開始するには、まずロボットの基本クラスを選択する必要があります。 ユーザーはこれらの基本クラスをサブクラス化して、ロボットプログラムのメインフローを制御する :code:`Robot` クラスを作成します。 基本クラスには3つの選択肢があります：
tr_tr: WPILib robot programı şablonlarından birini kullanarak bir projeye başlamak için, kullanıcılar önce robotları için bir temel sınıf seçmelidir. Kullanıcılar, robot programının ana akışını kontrol eden birincil :code:`Robot` sınıfını oluşturmak için bu temel sınıfları alt sınıflandırır. Temel sınıf için üç seçenek mevcuttur:
zh_cn: 要使用WPILib机器人程序模板之一启动项目，用户必须首先为其机器人选择基类。用户将这些基类子类化以创建其主Robot类，该主类控制机器人程序的主要流程。基类有三种选择：

source: Source: `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/TimedRobot.java>`__ - `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cpp/TimedRobot.cpp>`__
ja: ソース: `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/TimedRobot.java>`__ - `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cpp/TimedRobot.cpp>`__
tr_tr: Kaynak: `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/TimedRobot.java>` __ - `C ++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cpp/TimedRobot.cpp>` __
zh_cn: 源: `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/TimedRobot.java>`__ - `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cpp/TimedRobot.cpp>`__

source: A `TimedRobot Skeleton` template is available that removes some informative comments and the autonomous example. You can use this if you're already familiar with `TimedRobot`. The example shown below is of `TimedRobot Skeleton`.
fr_ca: Un modèle `TimedRobot Skeleton` est disponible; celui-ci supprime certains commentaires informatifs et l’exemple autonome. Vous pouvez l’utiliser si vous êtes déjà familier avec `TimedRobot`. L’exemple ci-dessous est de `TimedRobot Skeleton`.
ja: `TimedRobot Skeleton` テンプレートは、いくつかの有益なコメントとautonomousの例を取り除いたものです。すでに `TimedRobot` に慣れている場合は、これを使うことができます。以下に示す例は `TimedRobot Skeleton` のものです。
tr_tr: Bazı bilgilendirici yorumları ve otonom örneği kaldıran bir `TimedRobot Skeleton` şablonu mevcuttur. Zaten `TimedRobot` u biliyorsanız bunu kullanabilirsiniz. Aşağıda gösterilen örnek `TimedRobot Skeleton` içindir.
zh_cn: 提供了“ TimedRobot Skeleton”模板，该模板删除了一些有用的注释和自动阶段示例。如果您已经熟悉`TimedRobot`，则可以使用它。下面显示的示例是“ TimedRobot Skeleton”。

source: Periodic methods are called every 20 ms by default. This can be changed by calling the superclass constructor with the new desired update rate.
fr_ca: Les méthodes périodiques sont appelées toutes les 20 ms par défaut. Cela peut être changé en sollicitant le constructeur de superclasse avec le taux de mise à jour souhaité.
ja: 「Periodic」メソッドはデフォルトで20ミリ秒ごとに呼び出されます。これは、新しい更新レートを指定してスーパークラスのコンストラクタを呼び出すことで変更できます。
tr_tr: Periyodik yöntemler varsayılan olarak her 20 ms'de bir çağrılır. Bu, istenen yeni güncelleme oranıyla üst sınıf kurucusunu çağırarak değiştirilebilir.
zh_cn: 默认情况下，周期方法每20毫秒调用一次。这可以通过使用新的所需更新率调用超类构造函数来更改。

source: Source: `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/RobotBase.java>`__ - `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cppcs/RobotBase.cpp>`__
ja: ソース： `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/RobotBase.java>`__ - `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cppcs/RobotBase.cpp>`__
tr_tr: Kaynak: `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/RobotBase.java>` __ - `C ++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cppcs/RobotBase.cpp>` __
zh_cn: 源: `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/RobotBase.java>`__ - `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cppcs/RobotBase.cpp>`__

source: The :code:`RobotBase` class is the most minimal base-class offered, and is generally not recommended for direct use. No robot control flow is handled for the user; everything must be written from scratch inside the :code:`startCompetition()` method. The template by default showcases how to process the different operation modes (teleop, auto, etc).
fr_ca: La classe :code:`RobotBase` est la classe de base la plus simpliste offerte et n'est généralement pas recommandée pour une utilisation directe. Aucun flux de contrôle du robot n'est géré pour l'utilisateur; tout doit être écrit à partir de zéro dans la méthode :code:`startCompetition()`. Le modèle par défaut montre comment traiter les différents modes de fonctionnement (teleop, auto, etc.).
ja: :code:`RobotBase` クラスは最も最小限の基本クラスであり、一般的に直接使用することは推奨されません。ロボットの制御フローはユーザーのために処理されないので、 :code:`startCompetition()` メソッドの中でゼロからすべてを書かなければなりません。デフォルトでは、このテンプレートは異なるオペレーションモード（teleop、autoなど）の処理方法をを紹介しています。
tr_tr: :code: `RobotBase` sınıfı, sunulan en minimum temel sınıftır ve genellikle doğrudan kullanım için önerilmez. Kullanıcı için robot kontrol akışı ele alınmaz; her şey :code:`startCompetition()` metodunun içine sıfırdan yazılmalıdır. Şablon varsayılan olarak farklı çalışma modlarının (teleop, otomatik vb.) nasıl işleneceğini gösterir.
zh_cn: RobotBase类是提供最基本的基类，一般不建议直接使用。没有为用户处理机器人控制流程。一切都必须从头开始写在startCompetition()方法内部。默认情况下，模板展示了如何处理不同的操作模式（遥控，自动等）。

source: A ``RobotBase Skeleton`` template is available that offers a blank ``startCompetition()`` method.
fr_ca: Un modèle ``RobotBase Skeleton`` est disponible qui offre une méthode ``startCompetition()`` vide de code
ja: ``RobotBase Skeleton`` テンプレートが用意されており、空白の ``startCompetition()`` メソッドを提供します。
tr_tr: Boş bir ``startCompetition()`` metodu sunan bir ``RobotBase Skeleton`` şablonu mevcuttur.
zh_cn: RobotBase Skeleton模板提供了一个空白的方法startCompetition()。

source: Command Robot
fr_ca: Commande Robot
ja: コマンド・ロボット
tr_tr: Command Robot-Komut Robotu

source: The ``Command Robot`` framework adds to the basic functionality of a ``Timed Robot`` by automatically polling inputs and converting the raw input data into events. These events are tied to user code, which is executed when the event is triggered. For instance, when a button is pressed, code tied to the pressing of that button is automatically called and it is not necessary to poll or keep track of the state of that button directly. The ``Command Robot`` framework makes it easier to write compact easy-to-read code with complex behavior, but requires an additional up-front time investment from a programmer in order to understand how the Command Robot framework works.
fr_ca: Le framework ``Command Robot`` ajoute à la fonctionnalité de base d'un ``Timed Robot`` en interrogeant automatiquement les entrées et en convertissant les données d'entrée brutes en événements. Ces événements sont liés au code utilisateur, qui est exécuté lorsque l'événement est déclenché. Par exemple, lorsqu'un bouton est enfoncé, le code lié à l'appui sur ce bouton est automatiquement appelé et il n'est pas nécessaire d'interroger ou de suivre directement l'état de ce bouton. Le framework ``Command Robot`` facilite l'écriture de code compact facile à lire avec un comportement complexe, mais nécessite un investissement initial supplémentaire en temps de la part d'un programmeur afin de comprendre le fonctionnement du framework Command Robot.
ja: ``Command Robot`` フレームワークは、自動的に入力を取得し、生の入力データをイベントに変換することで、 ``Timed Robot`` の基本的な機能を拡張します。 これらのイベントは、イベントがトリガーされたときに実行されるユーザーコードに関連付けられています。例えば、ボタンが押されると、そのボタンが押されたことに関連するコードが自動的に呼び出され、そのボタンの状態を直接取得したり追跡したりする必要はありません。 コマンドロボットフレームワークは、複雑な動作をするコンパクトで読みやすいコードを書くことを容易にしますが、コマンドロボットフレームワークがどのように動作するかを理解するために、プログラマーに追加の先行時間投資時間が要求されます。

source: Teams using ``Command Robot`` should see the :ref:`Command-Based Programming Tutorial <docs/software/commandbased/index:Command-Based Programming>`.
fr_ca: Les équipes utilisant ``Commande Robot`` devraient se reférer à :ref:`Dictaticiel sur la programmation orientée commande <docs/software/commandbased/index:Command-Based Programming>`.
ja: ``Command Robot`` を使用しているチームは、 :ref:`Command-Based Programmingというチュートリアル <docs/software/commandbased/index:Command-Based Programming>` を参照してください。
zh_cn: 使用“Command Robot”的队伍需要查看:ref:`Command-Based Programming Tutorial <docs/software/commandbased/index:Command-Based Programming>`.

source: Teams using a :ref:`Romi <docs/romi-robot/index:Getting Started with Romi>` should use the ``Romi - Timed`` or ``Romi - Command Bot`` template.
fr_ca: Les équipes utilisant un :ref:`Romi <docs/romi-robot/index:Getting Started with Romi>` devraient utiliser le modèle ``Romi - Timed`` ou ``Romi - Command Bot``
ja: :ref:`Romi <docs/romi-robot/index:Getting Started with Romi>` を使用しているチームは ``Romi - Timed`` または ``Romi - Command Bot`` テンプレートを使用してください。
tr_tr: :ref:`Romi <docs/romi-robot/index:Getting Started with Romi>` kullanan takımlar ``Romi - Timed`` veya ``Romi - Command Bot`` şablonunu kullanmalıdır.
zh_cn: 使用 :ref:`Romi <docs/romi-robot/index:Getting Started with Romi>` 的团队应使用“ Romi-Timed”或“ Romi-Command Bot”模板。

source: The ``Romi - Timed`` template provides a ``RomiDrivetrain`` class that exposes an ``arcadeDrive(double xaxisSpeed, double zaxisRotate)`` method. It's up to the user to feed this arcadeDrive function.
fr_ca: Le modèle ``Romi - Timed`` fournit une classe ``RomiDrivetrain`` qui expose une méthode ``arcadeDrive(double xaxisSpeed, double zaxisRotate)``. C’est à l’utilisateur d’alimenter cette fonction arcadeDrive.
ja: ``Romi - Timed`` テンプレートは、 ``arcadeDrive(double xaxisSpeed, double zaxisRotate)`` メソッドを持つ ``RomiDrivetrain`` クラスを提供します。このarcadeDrive関数を実装するかどうかはユーザー次第です。
tr_tr: ``Romi - Timed`` şablonu, bir ``arcadeDrive (double xaxisSpeed, double zaxisRotate)`` metodunu ortaya çıkaran bir ``RomiDrivetrain`` sınıfı sağlar. Bu arcadeDrive işlevini beslemek kullanıcıya bağlıdır.
zh_cn: Romi - Timed模板提供了一个RomiDrivetrain类，该类公开了一个arcadeDrive(double xaxisSpeed, double zaxisRotate)方法。用户可以为此arcadeDrive函数提供参数。

source: This class also provides functions for retrieving and resetting the Romi's onboard encoders.
fr_ca: Cette classe fournit également des fonctions pour récupérer et réinitialiser les encodeurs embarqués du Romi.
ja: このクラスはまた、Romi のオンボードエンコーダーを取得し、リセットするための関数も提供します。
tr_tr: Bu sınıf ayrıca Romi'nin yerleşik kodlayıcılarının alınması ve sıfırlanması için işlevler de sağlar.
zh_cn: 该类还提供用于检索和重置Romi板载编码器的功能。

source: The ``Romi - Command Bot`` template provides a ``RomiDrivetrain`` subsystem that exposes an ``arcadeDrive(double xaxisSpeed, double zaxisRotate)`` method. It's up to the user to feed this arcadeDrive function.
fr_ca: Le modèle ``Romi - Command Bot`` fournit un sous-système ``RomiDrivetrain`` qui expose une méthode ``arcadeDrive(double xaxisSpeed, double zaxisRotate)``. C’est à l’utilisateur d’alimenter cette fonction arcadeDrive.
ja: ``Romi - Command Bot`` テンプレートは、 ``arcadeDrive(double xaxisSpeed, double zaxisRotate)`` メソッドを持つ ``RomiDrivetrain`` サブシステムを提供します。この arcadeDrive 関数を使うかどうかはユーザー次第です。
tr_tr: ``Romi - Command Bot`` şablonu, bir ``arcadeDrive (double xaxisSpeed, double zaxisRotate)`` metodunu ortaya çıkaran bir ``RomiDrivetrain`` alt sistemi sağlar. Bu arcadeDrive işlevini beslemek kullanıcıya bağlıdır.
zh_cn: Romi - Command Bot模板提供了一个RomiDrivetrain子系统，该子系统公开了一个arcadeDrive(double xaxisSpeed, double zaxisRotate)方法。用户可以给此arcadeDrive函数提供参数。

source: This subsystem also provides functions for retrieving and resetting the Romi's onboard encoders.
fr_ca: Ce sous-système fournit également des fonctions pour récupérer et réinitialiser les codeurs embarqués du Romi.
ja: このサブシステムはまた、Romiのオンボード・エンコーダーを取得したり、リセットしたりする機能も備えています。
tr_tr: Bu alt sistem aynı zamanda Romi'nin yerleşik kodlayıcılarının alınması ve sıfırlanması için işlevler de sağlar.
zh_cn: 该子系统还提供用于检索和重置Romi板载编码器的功能。

source: Not Using a Base Class
fr_ca: Choisir de ne pas utiliser une classe de base
ja: 基本クラスを使用しない場合
tr_tr: Temel Sınıf Kullanmama
zh_cn: 不使用基类

source: If desired, users can omit a base class entirely and simply write their program in a :code:`main()` method, as they would for any other program. This is *highly* discouraged - users should not "reinvent the wheel" when writing their robot code - but it is supported for those who wish to have absolute control over their program flow.
fr_ca: Les utilisateurs peuvent omettre complètement la classe de base et simplement écrire leur programme dans une méthode :code:`main()`, comme ils le feraient pour tout autre programme. Ceci est *fortement* déconseillé - les utilisateurs n'ont pas à "réinventer la roue" lors de l'écriture du code de leur robot - mais ceci est néanmoins pris en charge pour ceux qui souhaitent avoir un contrôle absolu sur le flux de leur programme.
ja: 必要であれば、ユーザは基本クラスを完全に省略し、他のプログラムと同じように :code:`main()` メソッドでプログラムを書くこともできます。 これは非常に推奨されませんが（ユーザーはロボットコードを書くときに「車輪の再発明」をすべきではありません）、プログラムの流れを完全にコントロールしたい人のためにサポートされています。
tr_tr: İstenirse, kullanıcılar bir temel sınıfı tamamen çıkarabilir ve programlarını başka herhangi bir programda olduğu gibi basitçe :code:`main()` yöntemine yazabilirler. Bu *kesinlikle* tavsiye edilmez - kullanıcılar robot kodlarını yazarken "tekerleği yeniden icat etmemelidir" - ancak program akışları üzerinde mutlak kontrole sahip olmak isteyenler için desteklenir.
zh_cn: 如果需要，用户可以完全省略基类，而只需使用一种main()方法编写其程序即可，就像处理其他任何程序一样。这非常不推荐-写机器人的代码时，用户不应该“另起炉灶” -但还是支持那些希望有他们的程序的绝对控制权的人。

source: Users should *not* modify the :code:`main()` method of a robot program unless they are absolutely sure of what they are doing.
fr_ca: Les utilisateurs ne doivent *pas* modifier la méthode :code:`main()` du programme du robot à moins qu'ils ne soient absolument sûrs de ce qu'ils font.
ja: ユーザーは、自分が何をやっているのか絶対に確信が持てない限り、ロボットプログラムの :code:`main()` メソッドを変更 **すべきではありません** 。
tr_tr: Kullanıcılar, ne yaptıklarından kesinlikle emin olmadıkları sürece bir robot programının :code:`main()` yöntemini *değiştirmemelidir*.
zh_cn: 用户不应该修改机器人程序的main()方法，除非他们绝对确定自己在做什么。

source: Creating a New WPILib Project
fr_ca: Créer un nouveau projet WPILib
ja: 新規WPILibプロジェクトの作成
tr_tr: Yeni bir WPILib Projesi Oluşturma
zh_cn: 创建新的 WPILib 项目

source: Once we've decided on a base class, we can create our new robot project. Bring up the Visual Studio Code command palette with :kbd:`Ctrl+Shift+P`. Then, type "WPILib" into the prompt. Since all WPILib commands start with "WPILib", this will bring up the list of WPILib-specific VS Code commands. Now, select the :guilabel:`Create a new project` command:
fr_ca: Une fois que nous avons décidé d'une classe de base, nous pouvons créer notre nouveau projet de robot. Affichez la palette de commandes de Visual Studio Code avec :kbd:`Ctrl+Shift+P`. Ensuite, tapez "WPILib" dans l'invite. Étant donné que toutes les commandes WPILib commencent par "WPILib", cela affichera la liste des commandes VS Code spécifiques à WPILib. Maintenant, sélectionnez la commande :guilabel:`Create a new project` :
ja: 基本クラスが決まったら、新しいロボットプロジェクトを作成することが出来ます。 :kbd:`Ctrl+Shift+P` でVisual Studio Codeのコマンドパレットを表示します。そしてプロンプトに 「WPILib」と入力します。 そうすると、WPILibのVS Codeコマンドの一覧が出ます。その中から、 :guilabel:`Create a new project` を選びます：

source: Highlights the "WPILib: Create a new project" command.
fr_ca: Met en surbrillance la commande "WPILib: Create a new project"
ja: 「WPILib: Create a new project」コマンドがハイライトされる。

source: This will bring up the "New Project Creator Window:"
fr_ca: La fenêtre "New Project Creator Window" apparaîtra.
ja: すると、「New Project Creator」ウィンドウが表示されます。
tr_tr: Bu, "New Project Creator Window-Yeni Proje Oluşturma Penceresi:" getirecektir:
zh_cn: 这将打开“新项目创建者窗口”：

source: The new project creator screen.
fr_ca: Écran du créateur de nouveau projet.
ja: 新しいプロジェクト作成画面。

source: The elements of the New Project Creator Window are explained below:
fr_ca: Le contenu de la fenêtre "New Project Creator Window" est expliqué ci-dessous:
ja: New Project Creator ウィンドウのそれぞれの要素の説明は以下です。
tr_tr: Yeni Proje Oluşturma Penceresinin öğeleri aşağıda açıklanmıştır:
zh_cn: 创建新建项目窗口的元素说明如下：

source: **Project Type**: The kind of project we wish to create. This can be an example project, or one of the project templates provided by WPILib. Templates exist for each of the robot base classes. Additionally, a template exists for :ref:`Command-based <docs/software/commandbased/what-is-command-based:What is "command-based" programming?>` projects, which are built on the :code:`TimedRobot` base class but include a number of additional features - this type of robot program is highly recommended for new teams.
fr_ca: **Project Type**: Le genre de projet à créer. Il peut s'agir d'un exemple de projet ou de l'un des modèles de projet fournis par WPILib. Des modèles existent pour chacune des classes de base de robot. De plus, un modèle existe pour des projets :ref:`orientés commandes <docs/software/commandbased/what-is-command-based:What is "command-based" programming?>` qui sont rédigés à partir de la classe de base :code:`TimedRobot` mais qui comprennent un certain nombre de fonctionnalités supplémentaires - ce type de programme de robot est fortement recommandé pour les nouvelles équipes.
ja: **Project Type**: 作成したいプロジェクトの種類。 これはサンプルプロジェクト、またはWPILibが提供するプロジェクトテンプレートの1つです。 テンプレートはロボットの基本クラスごとに存在します。 さらに、 :ref:`Command-based <docs/software/commandbased/what-is-command-based:What is "command-based" programming?>` プロジェクト用のテンプレートも存在します。これは :code:`TimedRobot` 基本クラスをベースに構築されていますが、多くの追加機能を含んでいます。この種のロボットプログラムは、新しいチームに強く推奨されます。
tr_tr: **Project Type -Proje Türü**: Oluşturmak istediğimiz proje türü. Bu örnek bir proje veya WPILib tarafından sağlanan proje şablonlarından biri olabilir. Robot temel sınıflarının her biri için şablonlar mevcuttur. Ek olarak, :ref:`Command-based <docs/software/commandbased/what-is-command-based:What is "command-based" programming?>` projeleri için bir şablon mevcuttur; bu projeler :code:`TimedRobot` temel sınıfı üzerine inşa edilmiştir, ancak bir dizi ek özellik içerir - bu tür robot programı yeni ekipler için şiddetle tavsiye edilir.
zh_cn: **项目类型**：我们希望创建的项目类型。这可以是示例项目，也可以是WPILib提供的项目模板之一。每个机器人基本类都有模板。此外，还有:ref:`Command-based <docs/software/commandbased/what-is-command-based:What is "command-based" programming?>`项目的模板，这些模板基于TimedRobot基类构建，但包含许多其他功能-强烈建议新团队使用这种类型的机器人程序。

source: **Language**: This is the language (C++ or Java) that will be used for this project.
fr_ca: **Language**: Le langage (C++ ou Java) qui sera utilisé pour ce projet.
ja: **Language**: プロジェクトで利用する言語 (C++またはJava)。
tr_tr: **Language -Dil**: Bu proje için kullanılacak dildir (C++ veya Java).
zh_cn: **语言**：这是将用于该项目的语言（C ++或Java）。

source: **Base Folder**: If this is a template project, this specifies the type of template that will be used.
fr_ca: **Base Folder**: S’il s’agit d’un modèle de projet, ce paramètre spécifie le type de modèle qui sera utilisé.
ja: **Base Folder**: テンプレートプロジェクトの場合、使用するテンプレートの種類を指定します。
tr_tr: ** Base Folder-Temel Klasör **: Bu bir şablon projeyse, bu kullanılacak şablonun türünü belirtir.
zh_cn: **基础文件夹**：如果这是模板项目，则指定将使用的模板类型。

source: **Project Location**: This determines the folder in which the robot project will be located.
fr_ca: **Project Location**: Le dossier dans lequel le projet du robot sera enregistré.
ja: **Project Location**: ロボットプロジェクトを配置するフォルダ。
tr_tr: **Project Location -Proje Konumu**: Robot projesinin konumlandırılacağı klasörü belirler.
zh_cn: **项目位置**：确定机器人项目所在的文件夹。

source: **Project Name**: The name of the robot project. This also specifies the name that the project folder will be given if the Create New Folder box is checked.
fr_ca: **Project Name**: Le nom du projet du robot. Cela spécifie également le nom du dossier du projet si la case Create New Folder est cochée.
ja: **Project Name**: プロジェクト名。「Create New Folder」と書かれたチェックボックスを選択した場合は、プロジェクトのフォルダの名前にもなります。
tr_tr: **Project Name -Proje Adı**: Robot projesinin adı. Bu ayrıca Create New Folder -Yeni Klasör Oluştur kutusu işaretlendiğinde proje klasörünün verileceği adı da belirtir.
zh_cn: **项目名称**：机器人项目的名称。如果选中了“创建新文件夹”框，这还将指定项目文件夹的名称。

source: **Create a New Folder**: If this is checked, a new folder will be created to hold the project within the previously-specified folder. If it is *not* checked, the project will be located directly in the previously-specified folder. An error will be thrown if the folder is not empty and this is not checked.
fr_ca: **Create a New Folder**: Si cette case est cochée, un nouveau dossier sera créé pour contenir le projet dans le dossier précédemment spécifié. Si elle n'est *pas* cochée, le projet sera situé directement dans le dossier précédemment spécifié. Une erreur sera générée si le dossier n'est pas vide et que cela n'est pas vérifié.
ja: **Create a New Folder**: これをチェックすると、以前に指定したフォルダー内にプロジェクトを保存するための新しいフォルダーが作成されます。 **チェックされていない** 場合、プロジェクトは以前に指定されたフォルダに直接配置されます。 フォルダが空でなく、このオプションがチェックされていない場合は、エラーが発生します。
tr_tr: ** Create a New Folder-Yeni Klasör Oluştur **: Bu işaretlenirse, projeyi önceden belirtilen klasör içinde tutmak için yeni bir klasör oluşturulur. *not-işaretli değilse *, proje doğrudan önceden belirtilen klasörde yer alacaktır. Klasör boş değilse ve bu kontrol edilmezse bir hata atılacaktır.
zh_cn: **创建新文件夹**：如果选中此选项，将创建一个新文件夹，以将项目保存在先前指定的文件夹中。如果未选中，则项目将直接位于先前指定的文件夹中。如果文件夹不为空且未选中，将引发错误。
