Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/creating-robot-program.po
Languages: fr_ca, ja, tr_tr, zh_cn

source: **Team Number**: The team number for the project, which will be used for package names within the project and to locate the robot when deploying code.
fr_ca: **Team Number**: Numéro d'équipe du projet, qui sera utilisé pour les noms de packages dans le projet et pour localiser le robot lors du déploiement du code.
ja: **Team Number**: プロジェクト用のチーム番号。プロジェクトのパッケージ名やロボットにデプロイするために利用されます。
tr_tr: **Team Number -Takım Numarası**: Proje içindeki paket isimleri için ve kodu yüklerken robotu bulmak için kullanılacak proje takım numarası.
zh_cn: **团队编号**：项目的团队编号，将用于项目中的程序包名称并在部署代码时定位机器人。

source: **Enable Desktop Support**: Enables unit test and simulation. While WPILib supports this, third party software libraries may not. If libraries do not support desktop, then your code may not compile or may crash. It should be left unchecked unless unit testing or simulation is needed and all libraries support it.
fr_ca: **Enable Desktop Support**: Permet les tests unitaires et la simulation. Bien que WPILib les prennent en charge, il est possible que les librairies tierces ne puissent pas le faire. Si les librairies ne supportent pas le l'application bureau, votre code peut ne pas compiler ou peut se planter. Ce paramètre ne doit pas être coché à moins que des tests unitaires ou des simulations ne soient nécessaires et que toutes les librairies le prennent en charge.
ja: **Enable Desktop Support**: ユニットテストとシミュレーションを有効にします。WPILibはこれをサポートしていますが、サードパーティのソフトウェア・ライブラリはサポートしていない場合があります。ライブラリがデスクトップをサポートしていない場合、コードがコンパイルできなかったり、クラッシュする可能性があります。ユニットテストやシミュレーションが必要で、すべてのライブラリーがサポートしている場合を除き、このチェックは外してください。
tr_tr: **Enable Desktop Support-Masaüstü Desteğini Etkinleştir **: Birim testi ve simülasyonu etkinleştirir. WPILib bunu desteklerken, üçüncü taraf yazılım kitaplıkları desteklemeyebilir. Kitaplıklar masaüstünü desteklemiyorsa, kodunuz derlenmeyebilir veya çökebilir. Birim testi veya simülasyon gerekmedikçe ve tüm kitaplıklar bunu desteklemedikçe, işaretlenmeden bırakılmalıdır.
zh_cn: **启用桌面支持**：启用单元测试和模拟。尽管WPILib支持此功能，但第三方软件库可能不支持。如果库不支持桌面，则您的代码可能无法编译或崩溃。除非需要进行单元测试或仿真并且所有库都支持它，否则应将其保持选中状态。

source: Once all the above have been configured, click "Generate Project" and the robot project will be created.
fr_ca: Une fois que tout ce qui précède a été configuré, cliquez sur "Generate Project" et le projet du robot sera créé.
ja: 上記項目を設定したら、「Generate Project」をクリックします。そうするとロボットのプロジェクトが作成されます。
tr_tr: Yukarıdakilerin tümü yapılandırıldıktan sonra, "Generate Project -Proje Oluştur" u tıklayın ve robot projesi oluşturulacaktır.
zh_cn: 完成以上所有配置后，单击“生成项目”，将创建机器人项目。

source: Any errors in project generation will appear in the bottom right-hand corner of the screen.
fr_ca: Les erreurs dans la génération du projet apparaîtront dans le coin inférieur droit de l'écran.
ja: プロジェクト作成のエラーは、画面の右下隅に表示されます。
tr_tr: Proje oluşturmadaki herhangi bir hata, ekranın sağ alt köşesinde görünecektir.
zh_cn: 项目生成中的任何错误将显示在屏幕的右下角。

source: Creating projects on OneDrive is not supported as OneDrive's caching interferes with the build system. Some Windows installations put the Documents and Desktop folders on OneDrive by default.
ja: OneDriveのキャッシュがビルドシステムに干渉するため、OneDrive上でのプロジェクトの作成はサポートされていません。Windowsのインストールによっては、デフォルトでOneDriveに「ドキュメント」と「デスクトップ」フォルダが置かれています。

source: An example after all options are selected is shown below.
fr_ca: Un exemple complet est illustré ci-dessous.
ja: すべての設定を選択した後の例を以下に表示します。
tr_tr: Tüm seçenekler seçildikten sonra bir örnek aşağıda gösterilmiştir.
zh_cn: 选择所有选项后的示例如下所示。

source: The new project creator screen filled out.
fr_ca: L’écran de créateur nouveau projet rempli.
ja: 新規プロジェクト作成画面が完成しました。

source: Opening The New Project
fr_ca: Ouvrir le nouveau projet
ja: 新しいプロジェクトを開く
tr_tr: Yeni Projeyi Açmak
zh_cn: 打开新项目

source: After successfully creating your project, VS Code will give the option of opening the project as shown below. We can choose to do that now or later by typing :kbd:`Ctrl+K` then :kbd:`Ctrl+O` (or just :kbd:`Command+O` on macOS) and select the folder where we saved our project.
fr_ca: Après avoir créé votre projet avec succès, VS Code vous donnera la possibilité d'ouvrir le projet comme indiqué ci-dessous. Nous pouvons choisir de le faire maintenant ou plus tard en tapant :kbd:`Ctrl+K` puis :kbd:`Ctrl+O` (ou simplement :kbd:`Command+O` sous macOS) et sélectionnez le dossier dans lequel nous avons enregistré notre projet.
ja: プロジェクトの作成後、VS Codeは以下のようにプロジェクトを開くかどうかの選択肢を表示します。 :kbd:`Ctrl+K` を押してから :kbd:`Ctrl+O` を押し(macOSでは単に :kbd:`Command+O` ) 、プロジェクトを保存したフォルダを選択することで、すぐやるか後でやるかを選択することができます。
tr_tr: Projenizi başarıyla oluşturduktan sonra, VS Code aşağıda gösterildiği gibi projeyi açma seçeneği verecektir. Bunu şimdi veya daha sonra şunu yazarak yapmayı seçebiliriz: kbd: `Ctrl + K` sonra: kbd:` Ctrl + O` (veya macOS'ta sadece: kbd: `Command + O`) ve kaydettiğimiz klasörü seçebiliriz. proje.

source: Opening Project pop-up in VS Code
ja: VS Codeでプロジェクトを開くポップアップ

source: Once opened we will see the project hierarchy on the left. Double clicking on the file will open that file in the editor.
fr_ca: Une fois ouvert, la hiérarchie du projet s'affiche sur la gauche. Double-cliquez sur le fichier pour l'ouvrir dans l'éditeur.
ja: プロジェクトを開くと、左の方にプロジェクト階層が表示されます。ファイルをダブルクリックするとエディタにてファイルを表示できます。
tr_tr: Açıldıktan sonra solda proje hiyerarşisini göreceğiz. Dosyaya çift tıklamak o dosyayı düzenleyicide açacaktır.
zh_cn: 打开后，我们将在左侧看到项目层次结构。双击文件将在编辑器中打开该文件。

source: Opening a file in the VS Code editor.
fr_ca: Ouverture d’un fichier dans l’éditeur VS Code.
ja: VS Codeエディタでファイルを開く。

source: C++ Configurations (C++ Only)
fr_ca: Configurations C++ (C++ seulement)
ja: C++の設定 (C++のみ)
tr_tr: C++ Yapılandırmaları (Yalnızca C++)
zh_cn: C ++配置（仅C ++）

source: For C++ projects, there is one more step to set up IntelliSense. Whenever we open a project, we should get a pop-up in the bottom right corner asking to refresh C++ configurations. Click "Yes" to set up IntelliSense.
fr_ca: Pour les projets C++, il y a une étape de plus pour configurer IntelliSense. Chaque fois que nous ouvrons un projet, nous devrions obtenir un pop-up dans le coin inférieur droit demandant de rafraîchir les configurations C++. Cliquez sur "Yes" pour configurer IntelliSense.
ja: C++プロジェクトでは、IntelliSenseをセットアップしなければなりません。プロジェクトを開くと、右下隅にC++の設定をリフレッシュするかを聞くポップアップが出現します。「Yes」をクリックしてIntelliSenseをセットアップします。
zh_cn: 对于C ++项目，还有另外一步来设置IntelliSense。每当我们打开一个项目时，我们都应该在右下角出现一个弹出窗口，要求刷新C ++配置。单击“是”以设置IntelliSense。

source: Choosing "Yes" when asked to refresh C++ configurations.
fr_ca: En choisissant "Yes" lorsque vous êtes invité à actualiser les configurations C++.
ja: C++の設定をリフレッシュするよう求められたときに「はい」を選択する様子。

source: Documentation: `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/TimedRobot.html>`__ - `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TimedRobot.html>`__
tr_tr: Belgeleme: `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/TimedRobot.html>`__ - `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TimedRobot.html>`__

source: The :code:`TimedRobot` class is the the base class recommended for most users. It provides control of the robot program through a collection of :code:`init()` and :code:`periodic()` methods, which are called by WPILib during specific robot states (e.g. autonomous or teleoperated). The ``TimedRobot`` class also provides an example of retrieving autonomous routines through SendableChooser (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/smartdashboard/SendableChooser.html>`__/ `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1SendableChooser.html>`__
tr_tr: :code: `TimedRobot` sınıfı, çoğu kullanıcı için önerilen temel sınıftır. Belirli robot durumları sırasında (örneğin otonom veya teleoperasyonlu) WPILib tarafından çağrılan :code:`init()` ve :code:`periodik()` yöntemlerinden oluşan bir koleksiyon aracılığıyla robot programının kontrolünü sağlar. ``TimedRobot`` sınıfı, SendableChooser (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/smartdashboard/SendableChooser.html>` __ / `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1SendableChooser.html>` __ aracılığıyla özerk rutinlerin alınmasına bir örnek de sağlar.

source: Changing your robot rate can cause some unintended behavior (loop overruns). Teams can also use `Notifiers <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Notifier.html>`__ to schedule methods at a custom rate.
fr_ca: Changer votre fréquence d'itération du code du robot peut provoquer un certain comportement involontaire (dépassements de boucle). Les équipes peuvent également utiliser `Notifiers <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Notifier.html>`___ pour planifier les méthodes à un taux personnalisé.
tr_tr: Robot hızınızı değiştirmek, bazı istenmeyen davranışlara (döngü taşmaları) neden olabilir. Ekipler, yöntemleri özel bir oranda planlamak için `Notifiers <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Notifier.html>`__ 'i de kullanabilir.

source: Documentation: `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/RobotBase.html>`__ - `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1RobotBase.html>`__
tr_tr: Belgeleme: `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/RobotBase.html>`__ - `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1RobotBase.html>`__

source: Teams using ``Command Robot`` or ``Old Command Robot`` should see the :ref:`Command-Based Programming Tutorial <docs/software/commandbased/index:Command-Based Programming>` or :ref:`[Old] Command Based Programming <docs/software/old-commandbased/index:[Old] Command Based Programming>`.
tr_tr: ``Command Robot`` veya ``Old Command Robot`` kullanan takımlar şunları görmelidir :ref:`Command-Based Programming Tutorial <docs/software/commandbased/index:Command-Based Programming>` veya :ref:`[Old] Command Based Programming <docs/software/old-commandbased/index:[Old] Command Based Programming>`.

source: Romi - Timed
tr_tr: Romi - Zamanlı

source: Romi - Command Bot
tr_tr: Romi - Komut Robotu

source: Once we've decided on a base class, we can create our new robot project. Bring up the Visual Studio Code command palette with :kbd:`Ctrl+Shift+P`:
tr_tr: Bir temel sınıfa karar verdiğimizde, yeni robot projemizi oluşturabiliriz. Visual Studio Code komut paletini şu şekilde getirin:kbd:`Ctrl+Shift+P`:

source: Then, type "WPILib" into the prompt. Since all WPILib commands start with "WPILib," this will bring up the list of WPILib-specific VS Code commands:
tr_tr: Ardından, bilgi istemine "WPILib" yazın. Tüm WPILib komutları "WPILib" ile başladığından, bu, WPILib'e özgü VS Code komutlarının listesini getirecektir:

source: Now, select the :guilabel:`Create a new project` command:
tr_tr: Şimdi, :guilabel:`Create a new project` komutunu seçin:

source: The :code:`TimedRobot` class is the the base class recommended for most users. It provides control of the robot program through a collection of :code:`init()`, :code:`periodic()`, and :code:`exit()` methods, which are called by WPILib during specific robot states (e.g. autonomous or teleoperated). During these calls, your code typically polls each input device and acts according to the data it receives. For instance, you would typically determine the position of the joystick and state of the joystick buttons on each call and act accordingly. The ``TimedRobot`` class also provides an example of retrieving autonomous routines through SendableChooser (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/smartdashboard/SendableChooser.html>`__/ `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_sendable_chooser.html>`__
fr_ca: La classe :code:`TimedRobot` est la classe de base recommandée pour la plupart des utilisateurs. Il fournit le contrôle du programme du robot via une collection de méthodes :code:`init()`, :code:`periodic()` et :code:`exit()`, qui sont appelées par WPILib lors d'états spécifiques du robot ( ex. autonome ou téléopéré). Au cours de ces appels, votre code interroge généralement chaque périphérique d'entrée et agit en fonction des données qu'il reçoit. Par exemple, vous déterminez généralement la position du joystick et l'état des boutons du joystick à chaque appel et agissez en conséquence. La classe ``TimedRobot`` fournit également un exemple de récupération de routines autonomes via SendableChooser (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/smartdashboard /SendableChooser.html>`__/ `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1_sendable_chooser.html>`__
