Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/debugging-robot-program.po
Languages: es_mx, fr_ca, zh_cn

source: Debugging a Robot Program
es_mx: Depurar un Programa de Robot
fr_ca: Débogage d’un programme de robot
zh_cn: 调试机器人程序

source: Inevitably, a program will not behave in the way we expect it to behave. When this occurs, it becomes necessary to figure out why the program is doing what it is doing, so that we can make it do what we want it to do, instead. Such an undesired program behavior is called a "bug," and this process is called "debugging."
es_mx: Inevitablemente, un programa no se comportará de la manera que esperamos que se comporte. Cuando esto ocurre, es necesario averiguar por qué el programa está haciendo lo que está haciendo, para que podamos hacer que haga lo que queremos que haga, en su lugar. Este comportamiento de programa no deseado se denomina "error", y este proceso se denomina "depuración".
fr_ca: Inévitablement, un programme ne se comportera pas de la façon dont nous nous attendons à ce qu’il se comporte. Lorsque cela se produit, il devient nécessaire de comprendre pourquoi le programme fait ce qu’il fait, afin que nous puissions lui faire faire ce que nous voulons qu’il fasse, à la place. Un tel comportement indésirable du programme est appelé "bogue," et ce processus est appelé "débogage."
zh_cn: 程序不可避免地不会像我们期望的那样运行。发生这种情况时，有必要弄清楚该程序为什么会执行其所执行的操作，以便我们可以使它执行我们想要执行的操作。这种期望外的程序行为称为“错误”，而此过程称为“调试”。

source: A debugger is a tool used to control program flow and monitor variables in order to assist in debugging a program. This section will describe how to set up a debug session for an FRC robot program.
fr_ca: Un débogueur est un outil utilisé pour contrôler le flux du programme et examiner les variables afin d’aider au débogage d’un programme. Cette section décrit comment configurer une session de débogage pour un programme de robot FRC.

source: For beginning users who need to debug their programs but do not know/have time to learn how to use a debugger, it is often possible to debug a program simply by printing the relevant program state to the console. However, it is strongly recommended that students eventually learn to use a debugger.
es_mx: Para los usuarios principiantes que necesitan depurar sus programas pero no saben/tienen tiempo para aprender a usar un depurador, a menudo es posible depurar un programa simplemente imprimiendo el estado del programa relevante en la consola. Sin embargo, se recomienda encarecidamente que los alumnos finalmente aprendan a usar un depurador.
fr_ca: Pour les utilisateurs débutants qui ont besoin de déboguer leurs programmes, mais ne savent pas/n'ont pas le temps d’apprendre à utiliser un débogueur, il est souvent possible de déboguer un programme simplement en imprimant l’état du programme pertinent à la console. Cependant, il est fortement recommandé que les élèves finissent par apprendre à utiliser un débogueur.
zh_cn: 对于需要调试程序但不知道/没有时间学习如何使用调试器的入门用户，通常只需将相关程序状态打印到控制台即可调试程序。但是，强烈建议学生最终学习使用调试器。

source: Breakpoints
fr_ca: Points d'interruption
zh_cn: 断点

source: A "breakpoint" is a line of code at which the debugger will stop the program execution so that the user can examine the program state. This is extremely useful while debugging, as it allows the user to pause the program at specific points in problematic code to determine where exactly the program is deviating from the expected behavior.
fr_ca: Un "point d'interruption" ou point d'arrêt est une ligne de code à laquelle le débogueur arrêtera l’exécution du programme afin que l’utilisateur puisse examiner l’état du programme. Ceci est extrêmement utile lors du débogage, car il permet à l’utilisateur de suspendre le programme à des points spécifiques dans le code à examiner pour déterminer exactement l'endroit où le programme ne fonctionne pas comme on s'y attend.

source: Setting a Breakpoint
es_mx: Estableciendo un Breakpoint
fr_ca: Configuration d'un point d'interruption
zh_cn: 设定断点

source: Double-click in the left margin of the source code window to set a breakpoint in your user program: A small red circle indicates the breakpoint has been set on the corresponding line.
fr_ca: Double-cliquez dans la marge gauche de la fenêtre de code source pour définir un point d’interruption dans votre programme utilisateur : un petit cercle rouge indique que le point d’interruption a été défini sur la ligne correspondante.

source: Viewing Program State
fr_ca: Affichage de l’état du programme

source: When the program is stopped at a breakpoint, various pieces of program state can be viewed from the debug tab. The Debug tab is accessed by clicking on the debug icon on the far left pane. Within the debug tab, the program state can be viewed from an assortment of "panes."
fr_ca: Lorsque le programme est arrêté à un point d’interruption, divers éléments de l’état du programme peuvent être visualisés à partir de l’onglet débogage. L’onglet Debug est accessible en cliquant sur l’icône de débogage sur le volet d’extrême gauche. Dans l’onglet débogage, l’état du programme peut être consulté à partir d’un assortiment de "volets."

source: The Variables Pane
fr_ca: Le volet Variables

source: The Variables view shows the current values of variables. To see a variable that is not displayed, select the “Watch” pane and enter the variable name. This will show the variable’s value if it’s in-scope. Clicking on the arrows next to a variable name will expand the tree and show its `fields <https://en.wikipedia.org/wiki/Field_(computer_science)>`__.
fr_ca: L’affichage des Variables montre les valeurs actuelles des variables. Pour afficher une variable qui n’est pas affichée, sélectionnez le volet “Watch” et entrez le nom de la variable. Cela indiquera la valeur de la variable si elle est dans la portée. En cliquant sur les flèches à côté d’un nom de variable, l’arborescence s'élargira et affichera ses `champs <https://en.wikipedia.org/wiki/Field_(computer_science)>`__.

source: Watch Pane
fr_ca: Volet Watch

source: The Watch Pane can be used to monitor specific variables or expressions while debugging. To add an expression, right-click and select Add Expression.
fr_ca: Le volet Watch ou surveilance peut être utilisé pour surveiller des variables ou des expressions spécifiques lors du débogage. Pour ajouter une expression, cliquez avec le bouton droit et sélectionnez Add Expression.

source: Call Stack
fr_ca: Volet Call Stack

source: The Call Stack pane is used to display the current `call stack <https://en.wikipedia.org/wiki/Call_stack>`__ of the running program. This can be used to monitor the current call hierarchy of the program while debugging.
fr_ca: Le volet Call Stack ou pile d'exécution est utilisé pour afficher la `pile d'exécution <https://en.wikipedia.org/wiki/Call_stack>`__ courante du programme en cours d’exécution. Cela peut être utilisé pour surveiller la hiérarchie d’appels actuelle du programme lors du débogage.

source: Breakpoint Pane
fr_ca: Volet Breakpoint

source: The Breakpoint Pane displays all of the current breakpoints. To temporarily disable a breakpoint without permanently removing it, click the corresponding checkbox.
fr_ca: Le volet Breakpoint affiche tous les points d’interruption courants. Pour désactiver temporairement un point d’interruption sans le supprimer définitivement, cliquez sur la case à cocher correspondante.

source: Running the Debugger
es_mx: Ejecución del depurador
fr_ca: Exécution du Débogueur
zh_cn: 运行调试器

source: Press Ctrl+Shift+P and type WPILib or click on the WPILib Menu item to open the Command palette with WPILib pre-populated. Type Debug and select the Debug Robot Code menu item to start debugging. The code will download to the roboRIO and begin debugging.
fr_ca: Appuyez sur Ctrl+Maj+P et tapez WPILib ou cliquez sur le Menu WPILib pour ouvrir la palette Command palette avec WPILib pré-rempli. Tapez Debug et sélectionnez l’élément de menu Debug Robot Code pour commencer le débogage. Le code sera déployé sur le roboRIO et le débogage pourra commencer.

source: The debugger will automatically pause at the first breakpoint it encounters. The user can then tell the debugger when to proceed to the next breakpoint.
fr_ca: Le débogueur s’arrête automatiquement au premier point d’interruption qu’il rencontre. L’utilisateur peut alors indiquer au débogueur quand passer au point d’interruption suivant.

source: Debugging with Console
fr_ca: Débogage avec la console

source: Another way to debug your program is to use System.out.println statements in your code and receive them using the RioLog in Visual Studio Code.
fr_ca: Une autre façon de déboguer votre programme est d’utiliser des instructions System.out.println dans votre code et de les visualiser à l’aide du RioLog dans Visual Studio Code.

source: A debugger is a tool used to control program flow and monitor variables in order to assist in debugging a program. This section will describe how to set up a debug session for an FRC\ |reg| robot program.
es_mx: Un depurador es una herramienta que se utiliza para controlar el flujo del programa y monitorear las variables para ayudar a depurar un programa. Esta sección describirá cómo configurar una sesión de depuración para un FRC\ |reg| programa de robot.
zh_cn: 调试器是用于控制程序流和监视变量以帮助调试程序的工具。本节将描述如何为FRC\ |reg|机器人程序设置调试会话。

source: Press :kbd:`Ctrl+Shift+P` and type ``WPILib`` or click on the :guilabel:`WPILib Menu Item` to open the Command palette with WPILib pre-populated. Type Debug and select the Debug Robot Code menu item to start debugging. The code will download to the roboRIO and begin debugging.
es_mx: Presione :kbd:`Ctrl+Mayús+P` y escriba ``WPILib`` o haga clic en el elemento :guilabel:`Menú WPILib` para abrir la paleta Comandos con WPILib rellenado previamente. Escriba Depurar y seleccione el elemento de menú Depurar código robot para iniciar la depuración. El código se descargará en la roboRIO y comenzará la depuración.
zh_cn: 按 :kbd:`Ctrl+Shift+P` 并输入 ``WPILib`` 或单击 :guilabel:`WPILib Menu Item` 打开带有预填充的WPILib的命令面板。键入Debug并选择Debug Robot Code menu项以开始调试。该代码将下载到roboRIO并开始调试。

source: A "breakpoint" is a line of code at which the debugger will pause the program execution so that the user can examine the program state. This is extremely useful while debugging, as it allows the user to pause the program at specific points in problematic code to determine where exactly the program is deviating from the expected behavior.
es_mx: Un "breakpoint" es una línea de código en la que el depurador detendrá la ejecución del programa para que el usuario pueda examinar el estado del programa. Esto es extremadamente útil durante la depuración, ya que permite al usuario pausar el programa en puntos específicos en código problemático para determinar dónde exactamente el programa se está desviando del comportamiento esperado.
zh_cn: “断点”是一行代码，调试器将在该代码行处暂停程序执行，以便用户可以检查程序状态。这在调试时非常有用，因为它允许用户在有问题的代码中的特定位置暂停程序，以确定程序在哪些地方偏离了预期的行为。

source: The debugger will automatically pause at the first breakpoint it encounters.
es_mx: El depurador se detendrá automáticamente en el primer breakpoint que encuentre.
zh_cn: 调试器将在遇到的第一个断点处自动暂停。

source: Click in the left margin of the source code window (to the left of the line number) to set a breakpoint in your user program: A small red circle indicates the breakpoint has been set on the corresponding line.
es_mx: Haga doble clic en el margen izquierdo de la ventana del código fuente (a la izquierda del numero de línea) para establecer un breakpoint en el programa: un pequeño círculo rojo indicará que el breakpoint se ha establecido en la línea correspondiente.
zh_cn: 在源代码窗口的左边距中（在行号的左边）单击以在用户程序中设置一个断点：红色小圆圈表示已在相应行上设置了断点。

source: Debugging with Print Statements
es_mx: Depurar con declaraciones impresas
zh_cn: 使用打印语句进行调试

source: Another way to debug your program is to use print statements in your code and view them using the RioLog in Visual Studio Code or the Driver Station. Print statements should be added with care as they are not very efficient especially when used in high quantities. They should be removed for competition as they can cause loop overruns.
es_mx: Otra forma de depurar su programa es usar declaraciones de impresión en su código y verlas usando RioLog en Visual Studio Code o Driver Station. Las declaraciones impresas deben agregarse con cuidado, ya que no son muy eficientes, especialmente cuando se usan en grandes cantidades. Deben eliminarse para la competencia, ya que pueden provocar desbordamientos de bucle.
zh_cn: 调试程序的另一种方法是在代码中使用print语句，并使用Visual Studio Code或Driver Station中的RioLog查看它们。打印语句应谨慎添加，因为它们效率不高，尤其是在大量使用时。应将它们及时移除，因为它们可能导致循环超限。

source: Debugging with NetworkTables
zh_cn: 使用网络表进行调试

source: :doc:`NetworkTables </docs/software/networktables/networktables-intro>` can be used to share robot information with your debugging computer. :term:`NetworkTables` can be viewed with your favorite Dashboard or :ref:`OutlineViewer <docs/software/wpilib-tools/outlineviewer/index:OutlineViewer>`. One advantage of NetworkTables is that tools like :doc:`Shuffleboard </docs/software/dashboards/shuffleboard/getting-started/shuffleboard-tour>` can be used to graphically analyze the data. These same tools can then be used with same data to later provide an operator interface for your drivers.
zh_cn: :doc:`网络表</docs/software/networktables/networktables-intro>`可用于与调试计算机共享机器人信息。可以使用您喜欢的仪表板或:ref:`OutlineViewer <docs/software/wpilib-tools/outlineviewer/index:OutlineViewer>`查看网络表。网络表的优点之一是可以使用:doc:`Shuffleboard </docs/software/dashboards/shuffleboard/getting-started/shuffleboard-tour>`之类的工具来图形化分析数据。然后，这些相同的工具可以与相同的数据一起使用，以在以后为驱动程序提供操作员界面。

source: Learn More
es_mx: Aprender más
zh_cn: 了解更多

source: To learn more about debugging with VS Code see this `link <https://code.visualstudio.com/docs/editor/debugging>`__.
es_mx: Para aprender más acerca de la depuración con VS Code visite este `link <https://code.visualstudio.com/docs/editor/debugging>`__.
zh_cn: 要了解有关使用VS Code进行调试的更多信息，请参见`链接<https://code.visualstudio.com/docs/editor/debugging>`__。

source: Some of the features mentioned in this VS Code `article <https://code.visualstudio.com/docs/editor/editingevolved>`__ will help you understand and diagnose problems with your code. The Quick Fix (yellow light bulb) feature can be very helpful with a variety of problems including what to import.
es_mx: Algunas de las características mencionadas en este artículo de `VS Code <https://code.visualstudio.com/docs/editor/editingevolved>`__ lo ayudarán a entender y diagnosticar problemas con su código. La función Quick Fix (Bombilla amarilla) puede ser muy útil con una variedad de problemas incluyendo qué importar.
zh_cn: VS Code`文章 <https://code.visualstudio.com/docs/editor/editingevolved>`__ 中提到的某些功能将帮助您了解和诊断代码问题。快速修复（黄色灯泡）功能对包括导入内容在内的各种问题很有帮助。

source: One of the best ways to prevent having to debug so many issues is to do Unit Testing.
es_mx: Una de las mejores maneras para prevenir el tener que depurar tantos problemas es hacer una prueba de la unidad.
zh_cn: 避免调试很多问题的最佳方法之一是进行单元测试。

source: Verifying that your robot works in :doc:`Simulation </docs/software/wpilib-tools/robot-simulation/introduction>` is also a great way to prevent having to do complex debugging on the actual robot.
es_mx: Verificar que su robot funcione en :doc:`Simulation </docs/software/wpilib-tools/robot-simulation/introduction>` es también una excelente forma de evitar tener que hacer depuraciones complejas en el robot actual.
zh_cn: 验证您的机器人是否可以在:doc:`模拟 </docs/software/wpilib-tools/robot-simulation/introduction>` 中运行，也是避免在实际机器人上进行复杂调试的一种好方法。
