Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/importing-eclipse-project.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Importing an Eclipse project into VS Code
es_mx: Importar un proyecto de Eclipse a VS Code
fr_ca: Importation d’un projet Eclipse dans VS Code
tr_tr: Bir Eclipse projesini VS Code'a aktarma
zh_cn: 将Eclipse项目导入VS Code

source: To make it easy for teams to use existing projects with the new IDE, WPILib includes a wizard for importing Eclipse projects into VS Code. This will generate the necessary Gradle components and load the project into VS Code. The importer automatically imports the old command framework 3rd party library.
es_mx: Para facilitar a los equipos el uso de proyectos existentes con el nuevo IDE, WPILib incluye un asistente para importar proyectos de Eclipse en VS Code. Esto generará los componentes de Gradle necesarios y cargará el proyecto en VS Code. El importador importa automáticamente la antigua biblioteca de 3ros del marco de comandos.
fr_ca: Pour faciliter l’utilisation des projets existants par les équipes avec le nouvel IDE, WPILib inclut un Assistant pour importer des projets Eclipse dans VS Code. Cela générera les composants Gradle nécessaires et chargera le projet dans VS Code. L’importateur importe automatiquement l’ancien cadre de commande de librairie tierce.
tr_tr: WPILib, Eclipse projelerini VS Code'a aktarırken, takımların yeni IDE ile mevcut projeleri kullanmasını kolaylaştırmak için bir sihirbaz içerir. Bu, gerekli Gradle bileşenlerini oluşturacak ve projeyi VS Code'a yükleyecektir. Aktarıcı, eski komut çerçevesi-command framework 3. şahıs kütüphanesini otomatik olarak içe aktarır.
zh_cn: 为了使团队可以轻松用新IDE来开发现有的项目，WPILib包含用于将Eclipse项目导入VS Code的向导。这将生成必要的Gradle组件，并将项目加载到VS Code中。导入向导将自动引用原来的命令框架中的第三方库。

source: Launching the Import Wizard
es_mx: Iniciar el asistente de importación
fr_ca: Lancement de l’Assistant Importation
tr_tr: Aktarma Sihirbazını Başlatmak
zh_cn: 启动导入向导

source: |Launching Import Wizard|
es_mx: |Iniciar el asistente de importación|
tr_tr: Aktarma Sihirbazını Başlatmak
zh_cn: |启动导入向导|

source: Press :kbd:`Ctrl+Shift+P` and type "WPILib" or click the WPILib icon to locate the WPILib commands. Begin typing "Import a WPILib Eclipse project" and select it from the dropdown.
es_mx: Presione :kbd:`Ctrl+Shift+P` y escriba "WPILib" o haga clic en el icono WPILib para localizar los comandos WPILib. Comience a escribir "Import a WPILib Eclipse project" y selecciónelo en el menú desplegable.
tr_tr: WPILib komutlarını bulmak için:kbd:`Ctrl+Shift+P` ye basın ve" WPILib" yazın veya WPILib simgesini tıklayın. "Bir WPILib Eclipse projesini içe aktar" yazmaya başlayın ve açılır menüden seçin.
zh_cn: 按Ctrl + Shift + P并键入“ WPILib”，或单击WPILib图标以找到WPILib命令。输入“Import a WPILib Eclipse project”，然后从下拉列表中选择它。

source: |Eclipse Project Importer|
es_mx: |Importador de proyectos Eclipse|
tr_tr: Eclipse Proje Aktarıcısı
zh_cn: | Eclipse项目导入器|

source: You'll be presented with the WPILib Eclipse Project Upgrade window. This is similar to the process of creating a new project and the window and the steps are shown below. This window contains the following elements:
es_mx: Se le presentará la ventana de actualización del proyecto WPILib Eclipse. Esto es similar al proceso de creación de un nuevo proyecto y la ventana y los pasos se muestran a continuación. Esta ventana contiene los siguientes elementos:
fr_ca: Il vous sera présentée la fenêtre *WPILib Eclipse Project Upgrade* ou mise à niveau du projet WPILib Eclipse. Ceci est similaire au processus de création d’un nouveau projet et la fenêtre et les étapes sont affichées ci-dessous. Cette fenêtre contient les éléments suivants :
tr_tr: WPILib Eclipse Proje Güncelleme penceresi karşınıza çıkacak. Bu, yeni bir proje oluşturma sürecine benzer, bu pencere ve adımlar aşağıda gösterilmiştir. Bu pencere aşağıdaki ögeleri içerir:
zh_cn: 您将看到WPILib Eclipse Project Upgrade窗口。这类似于创建新项目的过程，窗口和步骤如下所示。该窗口包含以下元素：

source: **Eclipse Project Selection**: Selects the Eclipse project to be imported. Users should select the build.properties file in the root directory of the eclipse project.
es_mx: **Eclipse Project Selection**: Selecciona el proyecto Eclipse que se va a importar. Los usuarios deben seleccionar el archivo build.properties en el directorio raíz del proyecto eclipse.
fr_ca: **Eclipse Project Selection**: Sélectionne le projet Eclipse à importer. Les utilisateurs doivent sélectionner le fichier *build.properties* dans le répertoire racine du projet eclipse.
tr_tr: **Eclipse Project Selection-Eclipse Proje Seçimi**: İçe aktarılacak Eclipse projesini seçer. Kullanıcılar, Eclipse projesinin kök dizinindeki build.properties dosyasını seçmelidir.
zh_cn: ** Eclipse项目选择**：选择要导入的Eclipse项目。用户应选择在eclipse项目的根目录下的 build.properties 文件。

source: **Project Location**: This determines the folder in which the robot project will be located.
es_mx: **Ubicación del proyecto**: Esto determina la carpeta en la que se ubicará el proyecto del robot.
fr_ca: **Project Location**: Ce paramètre détermine le dossier dans lequel le projet de robot sera situé.
tr_tr: **Project Location -Proje Konumu**: Robot projesinin konumlandırılacağı klasörü belirler.
zh_cn: **项目位置**：确定机器人项目所在的文件夹。

source: **Create New Folder**: If this is checked, a new folder will be created to hold the project within the previously-specified folder. If it is *not* checked, the project will be located directly in the previously-specified folder. An error will be thrown if the folder is not empty and this is not checked.
es_mx: **Crear nueva carpeta**: si esta opción está marcada, se creará una nueva carpeta para contener el proyecto dentro de la carpeta especificada anteriormente. Si *no* está marcada, el proyecto se ubicará directamente en la carpeta especificada anteriormente. Se producirá un error si la carpeta no está vacía y esto no está marcado.
fr_ca: **Create New Folder**: Si ce paramètre est coché, un nouveau dossier sera créé pour contenir le projet dans le dossier précédemment spécifié. S’il n’est *pas* coché, le projet sera situé directement dans le dossier précédemment spécifié. Un message d'erreur sera émis si le dossier n’est pas vide et le paramètre n’est pas coché.
tr_tr: **Create New Folder-Yeni Klasör Oluştur**: Bu işaretlenirse, projeyi önceden belirtilen klasör içinde tutmak için yeni bir klasör oluşturulur. *İşaretli değilse*, proje doğrudan önceden belirtilen klasörde yer alacaktır. Klasör boş değilse ve bu işaretlenmemişse bir hata alınacaktır.
zh_cn: **创建新文件夹**：如果选中此选项，将创建一个新文件夹以将项目保存在先前指定的文件夹中。如果未选中，则项目将直接位于先前指定的文件夹中。如果文件夹不为空且未选中，将引发错误。

source: **Project Name**: The name of the robot project. This also specifies the name that the project folder will be given if the Create New Folder box is checked.
es_mx: **Nombre del proyecto**: el nombre del proyecto del robot. Esto también especifica el nombre que se le dará a la carpeta del proyecto si la casilla Crear nueva carpeta está marcada.
fr_ca: **Project Name**: Le nom du projet de robot. Cela spécifie également le nom que le dossier de projet recevra si la zone Create New Folder est cochée.
tr_tr: **Project Name-Proje Adı**: Robot projesinin adıdır. Bu ayrıca, Create New Folder-Yeni Klasör Oluştur kutusu işaretlendiğinde proje klasörünün verileceği adı da belirtir.
zh_cn: **项目名称**：机器人项目的名称。如果选中了 “创建新文件夹” 框，项目名称还会是项目文件夹的名称。

source: **Team Number**: The team number for the project, which will be used for package names within the project and to locate the robot when deploying code.
es_mx: **Número de equipo**: el número de equipo del proyecto, que se utilizará para los nombres de los paquetes dentro del proyecto y para ubicar el robot al implementar el código.
fr_ca: **Team Number**: Numéro d’équipe pour le projet, qui sera utilisé pour les noms de package dans le projet et pour localiser le robot lors du déploiement du code.
tr_tr: **Team Number-Takım Numarası**: Proje içindeki paket isimleri için ve kodu yüklerken robotu konumunu bulmakta kullanılacak proje için takım numarası.
zh_cn: **队号**：项目的队号，将用于项目中的程序包名称并在部署代码时定位机器人。

source: Click "Upgrade Project" to begin the upgrade.
es_mx: Haga clic en "Proyecto de actualización" para comenzar la actualización.
fr_ca: Cliquez sur "Upgrade Project" pour commencer la mise à jour.
tr_tr: Güncellemeye başlamak için "Upgrade Project-Projeyi Güncelle" e tıklayın.
zh_cn: 单击“升级项目”开始升级。

source: The eclipse project will be upgraded and copied into the new project directory. You can then either open the new project immediately (the pop-up shown below should appear in the bottom right) or open it later using the :kbd:`Ctrl+O` (or Command-O for macOS) shortcut.
es_mx: El proyecto eclipse se actualizará y se copiará en el directorio del nuevo proyecto. A continuación, puede abrir el nuevo proyecto de inmediato (la ventana emergente que se muestra a continuación debería aparecer en la parte inferior derecha) o abrirlo más tarde con el acceso directo :kbd:`Ctrl+O`(o Comando-O para macOS).
tr_tr: Tutulma projesi yükseltilecek ve yeni proje dizinine kopyalanacaktır. Ardından yeni projeyi hemen açabilir (aşağıda gösterilen açılır pencere sağ altta görünmelidir) veya daha sonra: kbd:`Ctrl+O` (veya macOS için Command-O) kısayolunu kullanarak açabilirsiniz.
zh_cn: eclipse项目将被升级并复制到新的项目目录中。导入完成后，您可以立即打开新项目（以弹出窗口应显示在右下方），或稍后使用 Ctrl + O（或macOS的 Command-O ）快捷键将其打开。

source: |Opening Project|
es_mx: |Proyecto de apertura|
tr_tr: Projeyi Açmak
zh_cn: |开放项目|

source: C++ Configurations (C++ Only)
es_mx: Configuraciones de C ++ (solo C ++)
fr_ca: Configurations C++ (C++ uniquement)
tr_tr: C++ Yapılandırmaları (Yalnızca C++)
zh_cn: C ++配置（仅C ++）

source: For C++ projects, there is one more step to set up IntelliSense. Whenever you open a project, you should get a pop-up in the bottom right corner asking to refresh C++ configurations. Click "Yes" to set up IntelliSense.
es_mx: Para los proyectos de C ++, hay un paso más para configurar IntelliSense. Siempre que abra un proyecto, debería aparecer una ventana emergente en la esquina inferior derecha solicitando actualizar las configuraciones de C ++. Haga clic en "Sí" para configurar IntelliSense.
fr_ca: Pour les projets C++, il y a une étape de plus pour configurer IntelliSense. Chaque fois que vous ouvrez un projet, vous devez obtenir une fenêtre contextuelles dans le coin inférieur droit demandant d'actualiser les configurations C++. Cliquez sur "Yes" pour configurer IntelliSense.
tr_tr: C++ projeleri için, IntelliSense'i kurmak için bir adım daha vardır. Bir projeyi her açtığınızda, sağ alt köşede C++ yapılandırmalarını yenilemenizi isteyen bir pop-up pencere görmelisiniz. IntelliSense'i kurmak için "Yes" i tıklayın.
zh_cn: 对于C ++项目，还需要设置IntelliSense。每当您打开一个项目时，您都应该在右下角看到一个弹出窗口，要求刷新C ++配置。单击“是”以设置IntelliSense。

source: |C++ Configurations|
es_mx: |Configuraciones de C ++|
tr_tr: |C++ Yapılandırmaları|
zh_cn: | C ++配置|
