Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/using-test-mode.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Using Test Mode
es_mx: Usando el modo de prueba
fr_ca: Utilisation du Mode Test
tr_tr: Test Modunu Kullanma
zh_cn: 使用测试模式

source: Test mode is designed to enable programmers to have a place to put code to verify that all systems on the robot are functioning. In each of the robot program templates there is a place to add test code to the robot. If you use the TimedRobot template, or use command-based programming you can easily see the operation of all the motors and sensors through the LiveWindow.
es_mx: El modo de prueba está diseñado para permitir que los programadores tengan un lugar para colocar el código para verificar que todos los sistemas del robot estén funcionando. En cada una de las plantillas de programas de robot hay un lugar para agregar código de prueba al robot. Si usa la plantilla TimedRobot, o usa la programación basada en comandos, puede ver fácilmente el funcionamiento de todos los motores y sensores a través de LiveWindow.
fr_ca: Le mode test est conçu pour permettre aux programmeurs d’avoir un endroit où mettre du code en vue vérifier que tous les systèmes du robot fonctionnent. Dans chacun des modèles de programme robot, il y a un endroit où ajouter du code de test au robot. Si vous utilisez le modèle TimedRobot ou utilisez une programmation orientée commande, vous pouvez facilement visualiser le fonctionnement de tous les moteurs et capteurs à travers le LiveWindow.
tr_tr: Test modu, programcıların robot üzerindeki tüm sistemlerin çalıştığını doğrulamak için kod koyabilecekleri bir yere sahip olmasını sağlamak için tasarlanmıştır. Robot programı şablonlarının her birinde, robota test kodu eklemek için bir yer vardır. TimedRobot şablonunu kullanırsanız veya komut tabanlı programlamayı kullanırsanız, tüm motorların ve sensörlerin çalışmasını LiveWindow aracılığıyla kolayca görebilirsiniz.
zh_cn: 测试模式旨在使程序员能够验证机器人上的所有系统都在正常运行。在每个机器人程序模板中，都有一个向机器人添加测试代码的地方。如果使用 TimedRobot 模板，或使用基于命令的编程，则可以很容易地通过 LiveWindow 看到所有电机和传感器的运行。

source: Enabling Test Mode
es_mx: Habilitar del modo de prueba
fr_ca: Activation du Mode Test
tr_tr: Test Modunu Etkinleştirme
zh_cn: 启用测试模式

source: Test mode on the robot can be enabled from the Driver Station just like autonomous or teleop. When in test mode, the ``testInit`` method is run once, and the testPeriodic method is run once per tick, in addition to ``robotPeriodic``, the same as teleop and autonomous control modes. To enable test mode in the Driver Station, select the "Test" button and enable the robot. The test mode code will then run.
es_mx: El modo de prueba en el robot se puede habilitar desde la Driver Station como autónomo o teleop. Cuando está en modo de prueba, el método ``testInit`` se ejecuta una vez y el método testPeriodic se ejecuta una vez por tick, además de ``robotPeriodic``, al igual que los modos de control autónomo y teleop. Para habilitar el modo de prueba en la Driver Station, seleccione el botón "Prueba" y habilite el robot. Entonces se ejecutará el código del modo de prueba.
fr_ca: Le Mode Test sur le robot peut être activé à partir de la Driver Station tout comme lrs Modes Autonome ou Teleop. En Mode Test, la méthode ``testInit`` est exécuté une fois, et la méthode ``testPeriodic`` est exécutée une fois par itération, en plus de ``robotPeriodic``, de même que les Modes de Téléop et Autonome. Pour activer le Mode Test dans la Driver Station, sélectionnez le bouton "Test" et activez le robot. Le code du Mode de Test s’exécute alors.
tr_tr: Robot üzerindeki test modu, otonom veya teleop gibi Driver Station'dan etkinleştirilebilir. Test modundayken, ``testInit`` yöntemi bir kez çalıştırılır ve teleop ve otonom kontrol modlarında olduğu gibi ``robotPeriodic``e ek olarak testPeriodic yöntemi, her tık için bir kez çalıştırılır. Driver Station'da test modunu etkinleştirmek için "Test" düğmesini seçin ve robotu etkinleştirin. Test modu kodu daha sonra çalışacaktır.
zh_cn: 机器人的测试模式可以像自动模式和远程遥控模式一样从 Driver Station 启用。在测试模式下， testInit 方法仅运行一次，并且每 1 tick 除了 robotPeriodic 还运行一次 testPeriodic 方法（远程遥控模式和自动模式都是如此）。要在Driver Station中启用测试模式，请选择 “ Test” 按钮并启用机器人。测试模式代码将会运行。

source: Adding Test mode code to your robot code
es_mx: Agregar código de modo de prueba a su código de robot
fr_ca: Ajout du code du Mode Test à votre code robot
tr_tr: Robot kodunuza Test modu kodu ekleme
zh_cn: 将测试模式代码添加到您的机器人代码

source: Adding test mode can be as painless as calling your already written Teleop methods from Test. This will allow you to use the LiveWindow tuning features for classes such as PIDBase and PIDController, as well as PIDSubsystems and PIDCommands, to change PID constants and setpoints. Make sure to add your subsystems to SmartDashboard with the ``putData(subsystem)`` or ``PutData(subsystem)`` method.
es_mx: Agregar el modo de prueba puede ser tan sencillo como llamar a sus métodos Teleop ya escritos desde Test. Esto le permitirá utilizar las funciones de ajuste de LiveWindow para clases como PIDBase y PIDController, así como subsistemas PIDS y PIDCommands, para cambiar constantes y puntos de ajuste PID. Asegúrese de agregar sus subsistemas a SmartDashboard con el método ``putData (subsystem)`` o ``PutData (subsystem)``.
fr_ca: L’ajout du Mode de Test peut être aussi simple que d’appeler vos méthodes Teleop déjà écrites à partir de Test. Ce qui vous permettra d’utiliser les fonctionnalités de réglage LiveWindow pour des classes telles que PIDBase et PIDController, ainsi que PIDSubsystems et PIDCommands, dans le but de modifier les constantes et les points de consigne PID. Assurez-vous d’ajouter vos sous-systèmes à SmartDashboard avec la méthode ``putData(subsystem)`` ou ``PutData(subsystem)``.
tr_tr: Test modu eklemek, önceden yazılmış Teleop yöntemlerinizi Test'ten aramak kadar zahmetsiz olabilir. Bu, PID sabitlerini ve ayar noktalarını değiştirmek için PIDBase ve PIDController gibi sınıfların yanı sıra PIDSubsystems ve PIDCommands gibi LiveWindow ayarlama özelliklerini kullanmanıza olanak tanır. Alt sistemlerinizi SmartDashboard'a ``putData(subsystem)`` veya ``PutData(subsystem)`` yöntemiyle eklediğinizden emin olun.
zh_cn: 添加测试模式可以像从Test调用您已经编写的Teleop方法一样轻松。这将允许您将LiveWindow调整功能用于PIDBase和PIDController之类的类，以及PIDSubsystems和PIDCommands，以更改PID常数和设定值。确保使用``putData（subsystem）``或``PutData（subsystem）``方法将子系统添加到SmartDashboard。

source: Test Mode in SmartDashboard
es_mx: Modo de prueba en SmartDashboard
fr_ca: Mode Test dans le SmartDashboard
tr_tr: SmartDashboard'da Test Modu
zh_cn: SmartDashboard中的测试模式

source: The above sample code produces the following output when the Driver Station is put into Test mode then enabled. You can operate the motors by moving the sliders and read the values of sensors such as the wrist potentiometer.
es_mx: El código de muestra anterior produce la siguiente salida cuando la Driver Station se pone en modo de prueba y luego se habilita. Puede operar los motores moviendo los controles deslizantes y leer los valores de sensores como el potenciómetro de muñeca.
fr_ca: L’exemple de code ci-dessus produit la sortie suivante lorsque la Driver Station est configurée en Mode Test puis activée. Vous pouvez actionner les moteurs en déplaçant les curseurs et lire les valeurs des capteurs tels que le potentiomètre du poignet.
tr_tr: Yukarıdaki örnek kod, Driver Station Test moduna geçirilip etkinleştirildiğinde aşağıdaki çıktıyı üretir. Kaydırıcıları hareket ettirerek motorları çalıştırabilir ve bilek potansiyometresi gibi sensörlerin değerlerini okuyabilirsiniz.
zh_cn: 将Driver Station置于Test模式然后启用后，上面的示例代码将产生以下输出。您可以通过移动滑块来操作电动机，并读取传感器的值（如电位计）。

source: Notice that the values are grouped by the subsystem names to group related actuators and sensors for easy testing. The subsystem names are specified by supplying a name to the ``putData()`` method, or by calling ``SendableRegistry.setName()``. This grouping, while not required, makes it much easier to test one subsystem at a time and have all the values next to each other on the screen.
es_mx: Observe que los valores están agrupados por los nombres de los subsistemas para agrupar los actuadores y sensores relacionados para facilitar las pruebas. Los nombres de los subsistemas se especifican proporcionando un nombre al método ``putData()`` o llamando a ``SendableRegistry.setName()``. Esta agrupación, aunque no es necesaria, hace que sea mucho más fácil probar un subsistema a la vez y tener todos los valores uno al lado del otro en la pantalla.
fr_ca: Notez que les valeurs sont regroupées par les noms des sous-systèmes pour rassembler les actionneurs et capteurs associés pour des tests faciles. Les noms des sous-systèmes sont spécifiés en fournissant un nom à la méthode ``putData()`` ou en appelant ``SendableRegistry.setName()``. Ce regroupement, bien qu’il ne soit pas nécessaire, rend beaucoup plus facile de tester un sous-système à la fois et d’avoir toutes les valeurs cote à cote sur l’écran.
tr_tr: Değerlerin, kolay test için ilgili aktüatörleri ve sensörleri gruplamak için alt sistem adlarına göre gruplandığına dikkat edin. Alt sistem adları, ``putData()`` yöntemine bir ad sağlanarak veya ``SendableRegistry.setName()`` çağrılarak belirtilir. Bu gruplama, gerekli olmamakla birlikte, tek seferde bir alt sistemi test etmeyi çok daha kolaylaştırır ve tüm değerlerin ekranda yan yana olmasını sağlar.
zh_cn: 请注意，这些值已按子系统名称分组，以将相关的执行器和传感器分组，以便于测试。子系统名称可以通过 putData() 方法或 SendableRegistry.setName() 方法来指定。这种分组虽然不是必需的，但使一次测试一个子系统变得容易得多，并且所有值在屏幕上彼此相邻。

source: Using Test Mode with the TimedRobot Template
es_mx: Uso del modo de prueba con la plantilla de TimedRobot
fr_ca: Utilisation du Mode Test avec le modèle TimedRobot
tr_tr: TimedRobot Şablonu ile Test Modunu Kullanma
zh_cn: 将测试模式与TimedRobot模板一起使用

source: The TimedRobot template lends itself quite nicely to testing since it will periodically call the testPeriodic() method (or TestPeriodic() in C++) in your robot program. The testPeriodic() method will be called every 20ms and it is a good place to test commands or have LiveWindow update. The LiveWindow updating is built into the TimedRobot template so there is very little work to use LiveWindow.
es_mx: La plantilla de TimedRobot se presta bastante bien a las pruebas, ya que llamará periódicamente al método testPeriodic() (o TestPeriodic() en C++) en su programa de robot. El método testPeriodic() se llamará cada 20ms y es un buen lugar para probar comandos o actualizar LiveWindow. La actualización de LiveWindow está integrada en la plantilla de TimedRobot, por lo que hay muy poco trabajo para usar LiveWindow.
fr_ca: Le modèle TimedRobot se prête assez bien aux tests puisqu’il appellera périodiquement la méthode ``testPeriodic()`` (ou ``TestPeriodic()`` en C++) dans votre programme robot. La méthode ``testPeriodic()`` sera appelée toutes les 20ms et c’est un bon endroit pour tester des commandes ou avoir la mise à jour LiveWindow. La mise à jour LiveWindow est intégrée dans le modèle TimedRobot, il y a donc très peu de travail additionnel à faire pour pouvoir utiliser LiveWindow.
tr_tr: TimedRobot şablonu, robot programınızda periyodik olarak testPeriodic() yöntemini (veya C++ 'da TestPeriodic()'i) çağıracağından, test etmeye oldukça uygundur. TestPeriodic() yöntemi her 20 ms'de bir çağrılır ve komutları test etmek veya LiveWindow güncellemesini almak için iyi bir yerdir. LiveWindow güncellemesi, TimedRobot şablonuna yerleştirilmiştir, bu nedenle LiveWindow'u kullanmak için çok az iş gerekir.
zh_cn: TimedRobot 模板非常适合进行测试，因为它将定期在您的机器人程序中调用 testPeriodic() 方法（或C ++中的 TestPeriodic()）。testPeriodic() 方法每20毫秒调用一次，是测试命令或更新 LiveWindow 的好地方。LiveWindow 更新内置于 TimedRobot 模板中，因此使用 LiveWindow 的工作量很少。

source: This works even if you are using the TimedRobot template and not doing Command-based programming.
es_mx: Esto funciona incluso si está utilizando la plantilla de TimedRobot y no está realizando una programación basada en comandos.
fr_ca: Cela fonctionne même si vous utilisez le modèle TimedRobot et ne faites pas de programmation orientée commande.
tr_tr: Bu, TimedRobot şablonunu kullanıyor ve Komut-tabanlı programlama yapmıyor olsanız bile çalışır.
zh_cn: 即使您使用的是TimedRobot模板并且未进行基于命令的编程，此方法也可以使用。

source: In this example the sensors are registered with the LiveWindow and during the testPeriodic method, simply update all the values by calling the LiveWindow ``run()`` method. If your program is causing too much network traffic you can call the run method less frequently by, for example, only calling it every 5 updates for a 100ms update rate.
es_mx: En este ejemplo, los sensores se registran con LiveWindow y durante el método testPeriodic, simplemente actualice todos los valores llamando al método LiveWindow ``run()``. Si su programa está causando demasiado tráfico en la red, puede llamar al método de ejecución con menos frecuencia, por ejemplo, llamándolo solo cada 5 actualizaciones para una tasa de actualización de 100 ms.
fr_ca: Dans cet exemple, les capteurs sont enregistrés avec la méthode LiveWindow et pendant la méthode ``testPeriodic``, il suffit de mettre à jour toutes les valeurs en appelant la méthode LiveWindow ``run()``. Si votre programme cause trop de trafic réseau, vous pouvez appeler la méthode ``run()`` moins fréquemment en l’appelant, par exemple, uniquement toutes les 5 mises à jour pour un taux de mise à jour de 100 ms.
tr_tr: Bu örnekte, sensörler LiveWindow ile kaydedilir ve testPeriodic yöntemi sırasında, LiveWindow ``run()`` yöntemini çağırarak tüm değerleri güncelleyin. Programınız çok fazla ağ trafiğine neden oluyorsa, çalıştırma yöntemini daha seyrek olarak çağırabilirsiniz, örneğin 100 ms'lik bir güncelleme hızı için her 5 güncellemede bir çağırabilirsiniz.
zh_cn: 在此示例中，传感器已在 LiveWindow 中注册，并且在 testPeriodic 方法执行期间，只需调用 LiveWindow 的 run() 方法即可更新所有值。如果您的程序中网络通信太多以至于无法顺畅运行，则可以减少调用该方法的频率（如，每100ms调用方法5次）。

source: PID Tuning in Test Mode
es_mx: Ajuste de PID en modo de prueba
fr_ca: Réglage du PID en Mode Test
tr_tr: Test Modunda PID Ayarı
zh_cn: 测试模式下的PID调整

source: Tuning PID loops is often a challenging prospect with frequent recompiles of the program to get the correct values. When using the command based programming model, subclassing PIDSubsystem or PIDCommand in your PID commands allows the adjustment of PID constants with immediate feedback of the results.
es_mx: Ajustar los lazos de PID es a menudo una perspectiva desafiante con recompilaciones frecuentes del programa para obtener los valores correctos. Cuando se utiliza el modelo de programación basado en comandos, la subclasificación del subsistema PIDS o PIDCommand en sus comandos PID permite el ajuste de las constantes PID con retroalimentación inmediata de los resultados.
fr_ca: Le réglage des boucles PID est souvent une perspective difficile avec des compilations fréquentes du programme pour obtenir les valeurs correctes. Lorsque vous utilisez le modèle de programmation orientée commande, la sous-classification de PIDSubsystem ou PIDCommand dans vos commandes PID permet l’ajustement des constantes PID avec une rétroaction immédiate des résultats.
tr_tr: PID döngülerini ayarlamak, doğru değerleri elde etmek için programın sık sık yeniden derlenmesiyle genellikle zorlu bir olasılıktır. Komut-tabanlı programlama modelini kullanırken, PID komutlarınızda PIDSubsystem veya PIDCommand'in alt sınıflara ayrılması, sonuçların anında geri bildirimi ile PID sabitlerinin ayarlanmasına izin verir.
zh_cn: 调试PID循环通常是充满挑战的：程序必须被多次编译以找到合适的值。当使用基于命令的编程模型时，可以在 PID 命令中将 PIDSubsystem 或 PIDCommand 子类化。这样，调整 PID 参数后能立即得到结果反馈。
