Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/viewing-console-output.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Viewing Console Output
es_mx: Visualización de la salida de la consola
fr_ca: Affichage de la sortie de la console
tr_tr: Konsol Çıktısını Görüntüleme
zh_cn: 查看控制台输出

source: For viewing the console output of text based programs the roboRIO implements a NetConsole. There are two main ways to view the NetConsole output from the roboRIO: The Console Viewer in the FRC Driver Station and the Riolog plugin in VS Code.
es_mx: Para ver la salida de la consola de programas basados en texto, roboRIO implementa una NetConsole. Hay dos formas principales de ver la salida de NetConsole desde roboRIO: el visor de consola en FRC Driver Station y el complemento Riolog en VS Code.
fr_ca: Pour l'affichage de la sortie console des programmes basés sur du texte, le roboRIO implémente une NetConsole. Il existe deux façons principales d'afficher la sortie NetConsole du roboRIO: le Console Viewer dans le logiciel Driver Station FRC et l'extension Riolog dans VS Code.
tr_tr: Metin tabanlı-text based programların konsol çıktısını görüntülemek için roboRIO bir NetConsole uyarlar. RoboRIO'dan NetConsole çıktısını görüntülemenin iki ana yolu vardır: FRC Driver Station'daki Console Viewer ve VS Code'daki Riolog eklentisi.
zh_cn: 为了查看基于文本的程序的控制台输出，roboRIO实例化了一个NetConsole。查看roboRIO的NetConsole输出有两种主要方法：FRC Driver Station中的Console Viewer和VS Code中的Riolog插件。

source: On the roboRIO, the NetConsole is only for program output. If you want to interact with the system console you will need to use SSH or the Serial console.
es_mx: En roboRIO, NetConsole es solo para salida de programa. Si desea interactuar con la consola del sistema, deberá utilizar SSH o la consola en serie.
fr_ca: Sur le roboRIO, la NetConsole est uniquement pour les sorties du programme. Si vous souhaitez interagir avec la console système, vous devrez utiliser SSH ou la console série.
tr_tr: RoboRIO'da, NetConsole yalnızca program çıktısı içindir. Sistem konsolu ile etkileşim kurmak istiyorsanız, SSH veya Serial console kullanmanız gerekecektir.
zh_cn: 在roboRIO上，NetConsole仅用于程序输出。如果要与系统控制台进行交互，则需要使用SSH或串行控制台。

source: Console Viewer
zh_cn: 控制台查看器

source: Opening the Console Viewer
es_mx: Abrir el Console Viewer
fr_ca: Utiliser Console Viewer
tr_tr: Console Viewer'ı Açma
zh_cn: 打开控制台查看器

source: |Opening Console Viewer|
es_mx: |Abrir el Console Viewer|
tr_tr: |Console Viewer'ı Açma|
zh_cn: |打开控制台查看器|

source: To open Console Viewer, first open the FRC\ |reg| Driver Station. Then, click on the gear at the top of the message viewer window (1) and select "View Console".
es_mx: Para abrir Console Viewer, primero abra FRC\ |reg| Driver Station. Luego, haga clic en el engrane en la parte superior de la ventana del visor de mensajes (1) y seleccione "Ver consola".
tr_tr: Konsol Görüntüleyiciyi açmak için önce FRC\|reg| Sürücü İstasyonu. Ardından, mesaj görüntüleyici penceresinin (1) üst kısmındaki dişli çarkı tıklayın ve "Konsolu Görüntüle" yi seçin.
zh_cn: 要打开控制台查看器，请首先打开FRC\ |reg| Driver Station。然后，单击消息查看器窗口顶部的齿轮（1），然后选择“ View Console”。

source: Console Viewer Window
es_mx: Ventana del Console Viewer
fr_ca: La fenêtre Console Viewer
tr_tr: Console Viewer Penceresi
zh_cn: 控制台查看器窗口

source: |Console Viewer Window|
es_mx: |Ventana del Console Viewer|
tr_tr: |Console Viewer Penceresi|
zh_cn: |控制台查看器窗口|

source: The Console Viewer window displays the output from our robot program in green. The gear in the top right can clear the window and set the level of messages displayed.
es_mx: La ventana del Console Viewer muestra la salida de nuestro programa de robot en verde. El engranaje en la parte superior derecha puede limpiar la ventana y establecer el nivel de mensajes que se muestran.
fr_ca: La fenêtre Console Viewer affiche les sorties du programme du robot en vert. L'engrenage en haut à droite permet d'effacer la fenêtre et de définir le niveau des messages affichés.
tr_tr: Console Viewer penceresi robot programımızın çıktısını yeşil renkte gösterir. Sağ üstteki çark, pencereyi temizleyebilir ve görüntülenen mesajların düzeyini ayarlayabilir.
zh_cn: Console Viewer窗口以绿色显示我们的机器人程序的输出。右上方的齿轮可以清除窗口并设置显示的消息级别。

source: Riolog VS Code Plugin
es_mx: Riolog VS Complemeto Code
fr_ca: RioLog versus Code Plugin
tr_tr: Riolog VS Code Eklentisi
zh_cn: Riolog VS Code插件

source: The Riolog plugin is a VS Code view that can be used to view the NetConsole output in VS Code (credit for the original Eclipse version: Manuel Stoeckl, FRC1511).
es_mx: El complemento Riolog es una vista de VS Code que se puede usar para ver la salida de NetConsole en VS Code (crédito por la versión original de Eclipse: Manuel Stoeckl, FRC1511).
fr_ca: Le plugin RioLog est une vue VS Code qui peut être utilisée pour visualiser la sortie de NetConsole dans VS Code (crédit pour la version originale Eclipse: Manuel Stoeckl, FRC1511).
tr_tr: Riolog eklentisi, NetConsole çıktısını VS Code'da görüntülemek için kullanılabilen bir VS Code görünümüdür (orijinal Eclipse sürümü için atıf : Manuel Stoeckl, FRC1511).
zh_cn: Riolog插件是一个VS Code视图，可用于查看VS Code中的NetConsole输出（原始Eclipse版本的授权：Manuel Stoeckl，FRC1511）。

source: Opening the RioLog View
es_mx: Abrir la vista RioLog
fr_ca: Ouvrir la vue RioLog
tr_tr: RioLog View'ı Açma
zh_cn: 打开RioLog视图

source: |Opening Riolog View|
es_mx: |Abrir vista Riolog|
tr_tr: |RioLog View'ı Açma|
zh_cn: |打开Riolog视图|

source: By default, the RioLog view will open automatically at the end of each roboRIO deploy. To launch the RioLog view manually, press :kbd:`Ctrl+Shift+P` to open the command palette and start typing "RioLog", then select the WPILib: Start RioLog option.
es_mx: De forma predeterminada, la vista RioLog se abrirá automáticamente al final de cada implementación de roboRIO. Para iniciar la vista RioLog manualmente, presione:kbd:`Ctrl+Shift+P` para abrir la paleta de comandos y comience a escribir "RioLog", luego seleccione la opción WPILib: Iniciar RioLog.
tr_tr: Varsayılan olarak, RioLog görünümü her roboRIO dağıtımının sonunda otomatik olarak açılacaktır. RioLog görünümünü manuel olarak başlatmak için, komut paletini açmak ve "RioLog" yazmaya başlamak için: kbd:`Ctrl + Shift + P` tuşlarına basın, ardından WPILib: RioLog'u Başlat seçeneğini seçin.
zh_cn: 默认情况下，在每次roboRIO配置结束时，RioLog视图将自动打开。要手动启动RioLog视图，请按Ctrl+Shift+P打开指令选项板并键入“ RioLog”，然后选择WPILib：“启动RioLog”选项。

source: Riolog Window
es_mx: Ventana Riolog
fr_ca: La fenêtre RioLog
tr_tr: Riolog Penceresi
zh_cn: Riolog窗口

source: |Riolog Window|
es_mx: |Ventana Riolog|
tr_tr: |Riolog Penceresi|
zh_cn: | Riolog窗口|

source: The RioLog view should appear in the top pane. The Riolog contains a number of controls for manipulating the console:
es_mx: La vista RioLog debería aparecer en el panel superior. El Riolog contiene una serie de controles para manipular la consola:
fr_ca: La vue RioLog doit apparaître dans le volet supérieur. Riolog contient un certain nombre de commandes pour manipuler la console:
tr_tr: RioLog görünümü üst bölmede görünmelidir. Riolog, konsolu işlemek için bir dizi kontrol içerir:
zh_cn: RioLog视图应出现在顶部窗格中。 Riolog包含许多用于操纵控制台的控件：

source: **Pause/Resume Display** - This will pause/resume the display. In the background, the new packets will still be received and will be displayed when the resume button is clicked.
es_mx: **Pausar/reanudar la visualización** - esto pausará / reanudará la visualización. En segundo plano, los nuevos paquetes se seguirán recibiendo y se mostrarán cuando se haga clic en el botón Reanudar.
fr_ca: **Pause/Resume Display** - Ceci met en pause/reprend l'affichage. En arrière-plan, les nouveaux paquets seront toujours reçus et seront affichés lorsque le bouton de reprise sera cliqué.
tr_tr: **Pause/Resume Display-Görüntülemeyi Duraklat/Sürdür ** - Bu, görüntülemeyi duraklatır/devam ettirir. Arka planda, yeni paketler alınmaya devam edecek ve devam et düğmesine tıklandığında görüntülenecektir.
zh_cn: **暂停/继续显示**-这将暂停/继续显示。在后台，新数据包仍将被接收，并在单击恢复按钮时显示。

source: **Discard/Accept Incoming** - This will toggle whether to accept new packets. When packets are being discarded the display will be paused and all packets received will be discarded. Clicking the button again will resume receiving packets.
es_mx: **Descartar/Aceptar entrantes** - esto alternará entre aceptar nuevos paquetes. Cuando se descartan paquetes, la pantalla se detendrá y todos los paquetes recibidos se descartarán. Al hacer clic en el botón nuevamente, se reanudará la recepción de paquetes.
fr_ca: **Discard/Accept Incoming** - Ceci permet d'accepter ou non de nouveaux paquets. Lorsque les paquets sont rejetés, l'affichage est mis en pause et tous les paquets reçus sont rejetés. Cliquez à nouveau sur le bouton pour reprendre la réception des paquets.
tr_tr: **Discard/Accept Incoming-Gelenleri İptal Et/Kabul Et ** - Bu, yeni paketlerin kabul edilip edilmeyeceğini değiştirir. Paketler atılırken ekran duraklatılacak ve elde edilen tüm paketler atılacaktır. Düğmeye tekrar tıklamak, paketleri almaya devam edecektir.
zh_cn: **丢弃/接受传入**-这将切换是否接受新数据包。当数据包被丢弃时，显示将暂停，所有接收到的数据包将被丢弃。再次单击该按钮将恢复接收数据包。

source: **Clear** - This will clear the current contents of the display.
es_mx: **Clear** - esto borrará el contenido actual de la pantalla.
fr_ca: **Clear** - Ceci efface le contenu actuel de l'affichage.
tr_tr: **Clear-Temizle** - Bu, ekranın mevcut içeriğini temizler.
zh_cn: **清除**-这将清除显示的当前内容。

source: **Don't Show/Show Prints** - This shows or hides messages categorized as print statements
es_mx: **No mostrar/mostrar impresiones** - muestra u oculta mensajes categorizados como declaraciones impresas
fr_ca: **Don't Show/Show Prints** - Ceci affiche ou masque les messages classés pour impression.
tr_tr: **Don't Show/Show Prints-Printleri Göster/Gösterme** - Bu, print ifadeleri olarak kategorize edilen mesajları gösterir veya gizler.
zh_cn: **不显示/不显示打印内容**-显示或隐藏归类为打印语句的信息

source: **Switch to Viewer** - This switches to viewer for saved log files
es_mx: **Cambiar a Visualizador** - esto cambia a visualizador para los archivos de registro guardados
fr_ca: **Switch to Viewer** - Ceci passe à la visionneuse pour les fichiers journaux enregistrés
tr_tr: **Switch to Viewer-Görüntüleyiciye Geç** - Bu, kaydedilen log dosyaları için görüntüleyiciye geçer.
zh_cn: **切换到查看器**-切换到查看器以保存日志文件

source: **Don't Show/Show Warnings** - This shows or hides messages categorized as warnings
es_mx: **No mostrar/mostrar advertencias** - muestra u oculta los mensajes clasificados como advertencias
fr_ca: **Don't Show/Show Warnings** - Ceci affiche ou masque les messages classés comme des avertissements
tr_tr: **Don't Show/Show Warnings-Uyarıları Göster/Gösterme** - Bu, uyarı olarak kategorize edilen mesajları gösterir veya gizler.
zh_cn: **不显示/显示警告**-显示或隐藏归类为警告的消息

source: **Disconnect/Reconnect** - This disconnects or reconnects to the console stream
es_mx: **Desconectar/Volver a conectar** - esto desconecta o vuelve a conectar a la transmisión de la consola
fr_ca: **Disconnect/Reconnect** - Ceci déconnecte ou se reconnecte au flux de la console
tr_tr: **Disconnect/Reconnect-Bağlantıyı Kes/Yeniden Bağlan** - Bu, konsol akışına bağlantıyı keser veya yeniden bağlanır.
zh_cn: **断开/重新连接**-这断开或重新连接到控制台流

source: **Show/Don't Show Timestamps** - Shows or hides timestamps on messages in the window
es_mx: **Mostrar/No mostrar marcas de tiempo** - muestra u oculta las marcas de tiempo en los mensajes de la ventana
fr_ca: **Show/Don't Show Timestamps** - Ceci affiche ou masque l'horodatage des messages dans la fenêtre
tr_tr: **Show/Don't Show Timestamps-Zaman Damgalarını Göster/Gösterme** - Penceredeki iletilerde zaman damgalarını gösterir veya gizler.
zh_cn: **显示/不显示时间戳**-在窗口中显示或隐藏消息的时间戳

source: **Save Log** - Copies the log contents into a file you can save and view or open later with the RioLog viewer (see Switch to Viewer above)
es_mx: **Guardar registro**: copia el contenido del registro en un archivo que puede guardar y ver o abrir más tarde con el visor RioLog (consulte Cambiar al visor más arriba)
fr_ca: **Save Log** - Ceci copie le contenu du journal dans un fichier que vous pouvez enregistrer, afficher ou ouvrir plus tard avec la visionneuse RioLog (voir Switch to Viewer ci-dessus)
tr_tr: **Save Log-Log Kaydet** - Log içeriğini kaydedip görüntüleyebileceğiniz veya daha sonra RioLog görüntüleyiciyle açabileceğiniz bir dosyaya kopyalar (bkz. Switch to Viewer above Yukarıdaki Görüntüleyiciye Geç)
zh_cn: **保存日志**-将日志内容复制到一个文件中，您可以保存和查看该文件，或者以后再使用RioLog查看器打开（请参见上方的“切换到查看器”）

source: **Set Team Number** - Sets the team number of the roboRIO to connect to the console stream on, set automatically if RioLog is launched by the deploy process
es_mx: **Establecer número de equipo** - establece el número de equipo del roboRIO para conectarse a la transmisión de la consola, se establece automáticamente si el proceso de implementación inicia RioLog
fr_ca: **Set Team Number** - Ceci définit le numéro d'équipe du roboRIO pour se connecter au flux de la console. Défini automatiquement si RioLog est lancé par le processus de déploiement
tr_tr: **Set Team Number-Takım Numarasını Ayarla** - Konsol akışına bağlanmak için roboRIO'nun ekip numarasını ayarlar, RioLog yükleme işlemiyle başlatılırsa otomatik olarak ayarlanır.
zh_cn: **设置组号**-设置连接到控制台流的roboRIO的组号，如果在部署过程中启动RioLog，则自动设置
