Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/vscode-basics.po
Languages: es_mx, fr_ca, he_il, ja, tr_tr, zh_cn

source: Visual Studio Code Basics and the WPILib Extension
es_mx: Conceptos básicos de Visual Studio Code y la extensión WPILib
fr_ca: Les bases de Visual Studio Code et l’extension WPILib
he_il: יסודות Visual Studio Code והרחבת WPILib
ja: Visual Studio Codeの基礎とWPILib拡張機能
tr_tr: Visual Studio Code Temelleri ve WPILib Uzantısı
zh_cn: VS Code 基础以及WPILib扩展

source: Microsoft's Visual Studio Code is the supported IDE for C++ and Java development in FRC. This article introduces some of the basics of using Visual Studio Code and the WPILib extension.
fr_ca: Visual Studio Code de Microsoft est l’IDE pris en charge pour le développement C++ et Java dans FRC. Cet article présente certaines des bases de l’utilisation de Visual Studio Code et de l’extension WPILib.
ja: Microsoft Visual Studio Codeは、FRCのC++およびJava開発でサポートされているIDEです。この記事では、Visual Studio CodeとWPILib拡張機能の基本的な使い方を紹介します。

source: Welcome Page
es_mx: Pagina de bienvenida
fr_ca: Page d'accueil
he_il: מסך הפתיחה
ja: ウェルカムページ
tr_tr: Hoşgeldiniz Sayfası
zh_cn: 欢迎页面

source: |Welcome Screen|
es_mx: |Pantalla de bienvenida|
ja: |ウェルカム画面|
tr_tr: |Hoşgeldiniz EkranI|
zh_cn: |欢迎页面|

source: Welcome Screen
fr_ca: Écran d’accueil
ja: ウェルカム画面

source: When Visual Studio Code first opens, you are presented with a Welcome page. On this page you will find some quick links that allow you to customize Visual Studio Code as well as a number of links to help documents and videos that may help you learn about the basics of the IDE as well as some tips and tricks.
es_mx: Cuando se abre Visual Studio Code por primera vez, se le presenta una página de bienvenida. En esta página encontrará algunos enlaces rápidos que le permiten personalizar Visual Studio Code, así como una serie de enlaces a documentos y videos de ayuda que pueden ayudarlo a aprender sobre los conceptos básicos del IDE, así como algunos consejos y trucos.
fr_ca: Lorsque Visual Studio Code s’ouvre pour la première fois, une page d'accueil vous est présentée. Sur cette page, vous trouverez quelques liens rapides qui vous permettent de personnaliser Visual Studio Code ainsi qu’un certain nombre de liens vers des documents et vidéos d'aide qui peuvent vous être utiles pour en apprendre d'avantage sur les bases de l’IDE ainsi que quelques conseils et astuces.
he_il: כאשר Visual Studio Code נפתח לראשונה, מוצג בפניכם מסך פתיחה. במסך זה תוכלו למצוא כמה קישורים מהירים המאפשרים לכם להתאים אישית את ה-Visual Studio Code, מספר קישורים למסמכים ולסרטונים שיעזרו לכם ללמוד על יסודות ה-IDE וכן כמה טיפים וטריקים.
ja: Visual Studio Codeを最初に開くと、ウェルカムページが表示されます。このページには、Visual Studio Codeをカスタマイズするためのクイックリンクや、IDEの基本的な使い方やヒントを学ぶのに役立つヘルプドキュメントやビデオへのリンクがあります。
tr_tr: Visual Studio Code ilk açıldığında, Hoşgeldiniz sayfası sunulur. Bu sayfada, Visual Studio Code'u özelleştirmenize olanak tanıyan bazı hızlı bağlantıların yanı sıra, IDE'nin temellerini, bazı ipuçlarını ve püf noktalarını öğrenmenize yardımcı olabilecek belgelere ve videolara giden bir dizi bağlantı bulacaksınız.
zh_cn: 当你第一次打开Visual Studio Code，你会看见一个“欢迎”页面。在这个界面上你可以找到一些设定VS Code的链接，你还可以找到一些指引到帮助文档和视频的链接，这些或许可以帮助你学到一些这个IDE的基础和窍门。

source: You may also notice a small WPILib logo way up in the top right corner. This is one way to access the features provided by the WPILib extension (discussed further below).
es_mx: También puede notar un pequeño logotipo de WPILib en la esquina superior derecha. Esta es una forma de acceder a las funciones proporcionadas por la extensión WPILib (que se explican más adelante).
fr_ca: Vous pouvez également remarquer un petit logo WPILib dans le coin supérieur droit. Il s’agit d’une façon d’accéder aux fonctionnalités fournies par l’extension WPILib (discuté ci-dessous).
he_il: ייתכן ותבחינו גם בלוגו קטן של WPILib בפינה השמאלית העליונה. זוהי אחת הדרכים לגשת לפיצ'רים המסופקים על ידי הרחבת WPILib (שנדון עליה בהמשך).
ja: また、右上に小さなWPILibのロゴがあることに気づくかもしれません。これはWPILib拡張が提供する機能（後述）にアクセスするための一つの方法です。
tr_tr: Sağ üst köşede küçük bir WPILib logosu da görebilirsiniz. Bu, WPILib uzantısı tarafından sağlanan özelliklere erişmenin bir yoludur (aşağıda daha ayrıntılı olarak ele alınmıştır).
zh_cn: 你可能会注意到在右上角有个小的WPILib的标识。这可以帮助你获取那些WPILib插件提供的功能（下文将介绍）。

source: User Interface
es_mx: Interfaz de usuario
fr_ca: Interface utilisateur
he_il: ממשק משתמש
ja: ユーザーインターフェース
tr_tr: Kullanıcı arayüzü
zh_cn: 用户界面

source: The most important link to take a look at is probably the basic User Interface document. This document describes a lot of the basics of using the UI and provides the majority of the information you should need to get started using Visual Studio Code for FRC.
es_mx: El enlace más importante que se debe consultar es probablemente el documento básico de la interfaz de usuario. Este documento describe muchos de los conceptos básicos del uso de la interfaz de usuario y proporciona la mayor parte de la información que debe necesitar para comenzar a usar Visual Studio Code para FRC.
fr_ca: Le lien le plus important à examiner est probablement le document de base de l’interface utilisateur. Ce document décrit un grand nombre de fondements de l’utilisation de l’interface utilisateur et fournit la majorité des informations dont vous devez avoir besoin pour commencer à utiliser Visual Studio Code pour FRC.
he_il: הקישור החשוב ביותר לבחון הוא ככל הנראה מסמך ממשק המשתמש הבסיסי. מסמך זה מתאר הרבה מהיסודות של השימוש בממשק המשתמש ומספק את רוב המידע הדרוש לכם כדי להתחיל להשתמש ב-Visual Studio Code עבור FRC.
ja: 最も重要なリンクは、基本的なユーザーインターフェースのドキュメントです。このドキュメントでは、UIの基本的な使い方が説明されており、FRCでVisual Studio Codeを使い始めるために必要な情報の大部分が提供されています。
tr_tr: Programa bir göz atmak için en önemli bağlantı muhtemelen temel Kullanıcı Arayüzü belgesidir. Bu belge, kullanıcı arabirimini UI kullanmanın birçok temelini açıklar ve FRC için Visual Studio Code kullanmaya başlamak için ihtiyacınız olan bilgilerin çoğunu sağlar.
zh_cn: 对你来说最重要的链接或许会是有关用户界面基础的文档。这篇文档介绍了使用用户界面(UI)的许多基础知识，并提供了使用FRC VS Code之前你所需的大多数信息。

source: Command Palette
es_mx: Paleta de comandos
fr_ca: Palette de commandes
he_il: לוח הפקודות
ja: コマンドパレット
tr_tr: Komut Paleti
zh_cn: 指令面板

source: The Command Palette can be used to access or run almost any function or feature in Visual Studio Code (including those from the WPILib extension). The Command Palette can be accessed from the View menu or by pressing :kbd:`Ctrl+Shift+P` (:kbd:`Cmd+Shift+P` on macOS). Typing text into the window will dynamically narrow the search to relevant commands and show them in the dropdown.
es_mx: La paleta de comandos se puede usar para acceder o ejecutar casi cualquier función o característica en Visual Studio Code (incluidas las de la extensión WPILib). Se puede acceder a la paleta de comandos desde el menú View o presionando :kbd:`Ctrl+Shift+P` (:kbd:`Cmd+Shift+P` en macOS). Escribir texto en la ventana reducirá dinámicamente la búsqueda a comandos relevantes y los mostrará en el menú desplegable.
fr_ca: La palette de commandes peut être utilisée pour accéder ou exécuter presque toutes les fonctions ou fonctionnalités de Visual Studio Code (y compris celles de l'extension WPILib). La palette de commandes est accessible depuis le menu Affichage ou en appuyant sur :kbd:`Ctrl+Shift+P` (:kbd:`Cmd+Shift+P` sous macOS). Taper du texte dans la fenêtre restreindra dynamiquement la recherche aux commandes pertinentes et les affichera dans la liste déroulante.
he_il: ניתן להשתמש בלוח הפקודות כדי לגשת או להפעיל כמעט כל פונקציה או פיצ׳ר ב-Visual Studio Code (כולל אלו מהרחבת WPILib). ניתן לגשת ללוח הפקודות מתפריט "View" או על ידי לחיצה על :kbd:`Ctrl+Shift+P` (:kbd:`Cmd+Shift+P` ב-macOS) הקלדת טקסט בחלון תצמצם באופן דינמי את החיפוש לפקודות רלוונטיות ותראה אותן בתפריט הנפתח.
ja: コマンドパレットを使用すると、Visual Studio Code のほとんどすべての機能（WPILib 拡張機能のものも含む）にアクセスしたり、実行したりすることができます。コマンドパレットは「表示」メニューから、または :kbd:`Ctrl+Shift+P` (macOSでは :kbd:`Cmd+Shift+P`) を押すことでアクセスできます。ウィンドウにテキストを入力すると、関連するコマンドが動的に絞り込まれ、ドロップダウンに表示されます。
zh_cn: 指令面板可用于访问或运行Visual Studio Code中的几乎所有功能（包括WPILib扩展中的功能）。可以从查看菜单或快捷键 :kbd:`Ctrl+Shift+P`（在macOS上为 :kbd:`Cmd+Shift+P`）来访问命令面板。在指令面板的窗口中键入文本将缩小搜索范围，相关命令会动态地显示在下拉菜单中。

source: In the following example "wpilib" is typed into the search box after activating the Command Palette, and it narrows the list to functions containing WPILib.
es_mx: En el siguiente ejemplo, se escribe "wpilib" en el cuadro de búsqueda después de activar la paleta de comandos y reduce la lista a funciones que contienen WPILib.
fr_ca: Dans l’exemple suivant "wpilib" est saisi dans la zone de recherche après l’activation de la palette de commandes, et cette opération réduit la liste aux fonctions contenant WPILib.
he_il: בדוגמה הבאה "wpilib" מוקלד בתיבת החיפוש לאחר הפעלת לוח הפקודות, והוא מצמצם את הרשימה לפונקציות המכילות WPILib.
ja: コマンドパレットをアクティブにした後、検索ボックスに "wpilib "と入力し、WPILibを含む関数にリストが絞られている例。
tr_tr: Aşağıdaki örnekte "wpilib", Komut Paleti etkinleştirildikten sonra arama kutusuna yazılır ve listeyi WPILib içeren işlevlere daraltır.
zh_cn: 比如，激活“指令面板”后在搜索框中键入“ wpilib”，显示的命令范围将缩小到WPILib包含的功能。

source: WPILib Extension
es_mx: Extensión WPILib
fr_ca: Extension WPILib
he_il: הרחבת WPILib
ja: WPILib拡張機能
tr_tr: WPILib Uzantısı
zh_cn: WPILib扩展

source: |WPILib Commands|
es_mx: |Comandos de WPILib|
ja: |WPILibコマンド|
tr_tr: |WPILib Komutları|
zh_cn: | WPILib指令||

source: WPILib Commands
fr_ca: Commandes WPILib
ja: WPILibコマンド

source: The WPILib extension provides the FRC\ |reg| specific functionality related to creating projects and project components, building and downloading code to the roboRIO and more. You can access the WPILib commands one of two ways:
es_mx: La extensión WPILib proporciona la funcionalidad específica de FRC\ |reg| relacionada con la creación de proyectos y componentes de proyectos, la construcción y descarga de código al roboRIO y más. Puede acceder a los comandos de WPILib de dos formas:
fr_ca: L'extension WPILib fournit la fonctionnalité FRC\ |reg| spécifique liée à la création de projets et de composants de projet, à la création et au téléchargement de code sur le roboRIO et plus encore. Vous pouvez accéder aux commandes WPILib de deux manières:
he_il: הרחבת WPILib מספקת את הפונקציונליות FRC\ |reg| הספציפית הקשורה ליצירת פרויקטים ורכיבי פרויקט, בנייה והורדת קוד ל-roboRIO ועוד. ניתן לגשת לפקודות WPILib באחת משתי הדרכים הבאות:
ja: WPILib拡張機能は、プロジェクトやプロジェクトコンポーネントの作成、roboRIOへのコードのビルドやダウンロードなど、FRC\ |reg| 特有の機能を提供します。WPILibコマンドには2つの方法でアクセスできます：
zh_cn: WPILib插件提供了FRC\ |reg| 特有的功能，包括创建项目和项目组件，编译代码并下载到roboRIO等。您可以通过以下两种方式之一访问WPILib命令：

source: By typing "WPILib" into the Command Palette
es_mx: Escribiendo "WPILib" en la paleta de comandos
fr_ca: En tapant "WPILib" dans la palette de commandes
he_il: על ידי הקלדת ״WPILib״ בלוח הפקודות
ja: コマンドパレットに「WPILib」と入力する
tr_tr: Komut Paletine "WPILib" yazarak
zh_cn: 在指令面板中键入“ WPILib”

source: By clicking on the WPILib icon in the top right of most windows. This will open the Command Palette with "WPILib" pre-entered
es_mx: Haciendo clic en el icono de WPILib en la parte superior derecha de la mayoría de las ventanas. Esto abrirá la paleta de comandos con "WPILib" pre-ingresado
fr_ca: En cliquant sur l’icône WPILib en haut à droite de la plupart des fenêtres. Cette opération ouvre la palette de commandes avec "WPILib" déjà saisi
he_il: על ידי לחיצה על סמל WPILib בפינה השמאלית העליונה. פעולה זו תפתח את לוח הפקודות של WPILib שהוזן מראש.
ja: ほとんどのウィンドウの右上にあるWPILibアイコンをクリックします。「WPILib」が入力されたコマンドパレットが開きます。
tr_tr: Çoğu pencerenin en sağ üst köşesindeki WPILib simgesine tıklayarak. Bu, önceden yazılmış gibi "WPILib" ile Komut Paletini açacaktır
zh_cn: 单击大多数窗口右上方的WPILib图标。这将打开预先输入“ WPILib”的指令面板

source: It is **not** recommended to install the `Visual Studio IntelliCode <https://marketplace.visualstudio.com/items?itemName=VisualStudioExptTeam.vscodeintellicode>`_ plugin with the FRC installation of VS Code as it is known to break IntelliSense in odd ways.
es_mx: **No** se recomienda instalar el complemento `Visual Studio IntelliCode <https://marketplace.visualstudio.com/items?itemName=VisualStudioExptTeam.vscodeintellicode>`_ con la instalación FRC de VS Code, ya que se sabe que rompe IntelliSense de formas extrañas.
fr_ca: Il n’est **pas** recommandé d’installer le plugin `Visual Studio IntelliCode <https://marketplace.visualstudio.com/items?itemName=VisualStudioExptTeam.vscodeintellicode>`_ avec l’installation FRC de VS Code car il est connu pour arrêter IntelliSense de manière inattendue.
he_il: זה **לא** מומלץ להתקין את הרחבת `Visual Studio IntelliCode <https://marketplace.visualstudio.com/items?itemName=VisualStudioExptTeam.vscodeintellicode>`_ יחד עם ההתקנת VS Code עבור FRC שכן ידוע שהוא שובר את IntelliSense.
ja: これはインテリセンスを奇妙な方法で壊すことで知られているため、 `Visual StudioのIntelliCode <https://marketplace.visualstudio.com/items?itemName=VisualStudioExptTeam.vscodeintellicode>`_ プラグインをVS CodeのFRC固有のインストールと一緒にインストールすることは **お勧めしません** 。
tr_tr: IntelliSense'i garip şekillerde bozduğu bilindiği için VS Code'un FRC kurulumuyla Visual Studio IntelliCode <https://marketplace.visualstudio.com/items?itemName=VisualStudioExptTeam.vscodeintellicode>`_ eklentisinin yüklenmesi **önerilmez**.
zh_cn: **不**建议在FRC的VS Code 上安装Visual Studio IntelliCode <https://marketplace.visualstudio.com/items?itemName=VisualStudioExptTeam.vscodeintellicode>`_插件， IntelliSense会有玄学问题。

source: For more information about specific WPILib extension commands, see the other articles in this chapter.
es_mx: Para obtener más información sobre los comandos específicos de la extensión WPILib, consulte los otros artículos de este capítulo.
fr_ca: Pour plus d’informations sur les commandes spécifiques de l'extension WPILib, veuillez consulter les autres articles de ce chapitre.
he_il: למידע נוסף אודות פקודות ההרחבה של WPILib, עיינו במאמרים האחרים בפרק זה.
ja: 特定のWPILib拡張機能のコマンドの詳細については、この章の他の記事を参照してください。
tr_tr: Belirli WPILib uzantı komutları hakkında daha fazla bilgi için bu bölümdeki diğer makalelere bakın.
zh_cn: 请参阅本章中的其他文章来了解有关特定WPILib扩展命令的更多信息。

source: Microsoft's Visual Studio Code is the new supported IDE for C++ and Java development in FRC, replacing the Eclipse IDE used from 2015-2018. This article introduces some of the basics of using Visual Studio Code and the WPILib extension.
he_il: Visual Studio Code של מיקרוסופט הוא ה-IDE הנתמך החדש לפיתוח C++ ו-Java ב-FRC ומחליף את Eclipse IDE שהיה שימוש בעונות 2015-2018. מאמר זה מציג כמה מיסודות השימוש ב-Visual Studio Code ובהרחבת WPILib.
tr_tr: Microsoft Visual Studio Code, 2015-2018 arasında kullanılan Eclipse IDE'nin yerini alan, FRC'de C++ ve Java geliştirme için desteklenen yeni IDE'dir. Bu makale, Visual Studio Code ve WPILib uzantısını kullanmanın bazı temellerini tanıtır.
zh_cn: 对于C++和Java来说，微软的Visual Studio Code是一个新的FRC程序集成开发环境，用来替换2015-2018年的Eclipse。本文将介绍一些VS Code和WPILib插件的基础用法。

source: The Command Palette can be used to access or run almost any function or feature in Visual Studio Code (including those from the WPILib extension). The Command Palette can be accessed from the View menu or by pressing Ctrl+Shift+P (Cmd+Shift+P on macOS). Typing text into the window will dynamically narrow the search to relevant commands and show them in the dropdown.
tr_tr: Komut Paleti, Visual Studio Code'daki (WPILib uzantısından olanlar dahil) hemen hemen tüm işlev veya özelliklere erişmek veya bunları çalıştırmak için kullanılabilir. Komut Paletine View -Görünüm menüsünden veya Ctrl+Shift+P (macOS'ta Cmd+Shift+P) tuşlarına basılarak erişilebilir. Pencereye metin yazmaya başlamak, aramayı dinamik olarak ilgili komutlara daraltır ve bunları açılır menüde gösterir.

source: The WPILib extension provides the FRC specific functionality related to creating projects and project components, building and downloading code to the roboRIO and more. You can access the WPILib commands one of two ways:
tr_tr: WPILib uzantısı, projeler ve proje bileşenleri oluşturma, roboRIO'ya kod oluşturma, indirme ve daha fazlasıyla ilgili FRC'ye özgü işlevsellik sağlar. WPILib komutlarına iki yoldan biriyle erişebilirsiniz:
