Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/wpilib-commands-vscode.po
Languages: es_mx, he_il, tr_tr, zh_cn

source: WPILib Commands in Visual Studio Code
es_mx: Comandos WPILib en Visual Studio Code
he_il: פקודות WPILib ב-Visual Studio Code
tr_tr: Visual Studio Code'da WPILib Komutları
zh_cn: Visual Studio Code中的WPILib命令

source: This document contains a complete list of the commands provided by the WPILib VS Code Extension and what they do.
es_mx: Este documento contiene una lista completa de los comandos proporcionados por la extensión de código WPILib VS y lo que hacen.
he_il: מסמך זה מכיל רשימה מלאה של הפקודות המסופקות על ידי הרחבת WPILib עבור VS Code ומה הן עושות.
tr_tr: Bu belge, WPILib VS Code Uzantısı tarafından sağlanan komutların ve ne yaptıklarının tam bir listesini içerir.
zh_cn: 本文档包含VS Code的WPILib扩展提供的命令及其作用的完整列表。

source: To access these commands, press Ctrl+Shift+P to open the Command Palette, then begin typing the command name as shown here to filter the list of commands. Click on the command name to execute it.
es_mx: Para acceder a estos comandos, presione Ctrl + Shift + P para abrir la paleta de comandos, luego comience a escribir el nombre del comando como se muestra aquí para filtrar la lista de comandos. Haga clic en el nombre del comando para ejecutarlo.
he_il: כדי לגשת לפקודות אלה, לחצו Ctrl+Shift+P כדי לפתוח את לוח הפקודות, ואז התחילו להקליד את שם הפקודה כפי שמוצג כאן כדי לסנן את רשימת הפקודות. לחצו על שם הפקודה כדי לבצע אותה.
tr_tr: Bu komutlara erişmek için; Komut Paletini açmak için Ctrl+Shift+P tuşlarına basın, ardından komut listesini filtrelemek için burada gösterildiği gibi komut adını yazmaya başlayın. Komutu yürütmek için komut adına tıklayın.
zh_cn: 要使用这些指令，请先按Ctrl + Shift + P打开“指令面板”，然后开始输入命令名称（如下所示）以过滤命令列表。单击命令名称以执行它。

source: **WPILib: Build Robot Code** - Builds open project using GradleRIO
es_mx: **WPILib: Build Robot Code** - Construye un proyecto abierto usando GradleRIO
he_il: **WPILib: Build Robot Code** - בניית הפרויקט הפתוח כעת באמצעות GradleRIO
tr_tr: **WPILib: Build Robot Code** - GradleRIO kullanarak açık proje oluşturur.
zh_cn: **WPILib：Build Robot Code**-使用GradleRIO构建打开的项目

source: **WPILib: Create a new project** - Create a new robot project
es_mx: **WPILib: Create a new project** - Crea un nuevo proyecto de robot
he_il: **WPILib: Create a new project** - יצירת פרויקט רובוט חדש
tr_tr: **WPILib: Create a new project-WPILib: Yeni bir proje oluşturun** - Yeni bir robot projesi oluşturun
zh_cn: **WPILib：Create a new project**-创建一个新的机器人项目

source: **WPILib C++: Refresh C++ Intellisense** - Force an update to the C++ Intellisense configuration.
es_mx: **WPILib C++: Refresh C++ Intellisense**: fuerza una actualización de la configuración de C ++ Intellisense.
tr_tr: **WPILib C++: Refresh C++ Intellisense** - C++ Intellisense yapılandırmasına yönelik bir güncellemeyi zorlamaktadır.
zh_cn: **WPILib C ++：Refresh C ++ Intellisense**-强制更新C ++ Intellisense的配置。

source: **WPILib C++: Select current C++ toolchain** - Select the toolchain to use for Intellisense (i.e. desktop vs. roboRIO vs...). This is the same as clicking the current mode in the bottom right status bar.
zh_cn: **WPILib C ++：Select current C++ toolchain**-选择用于Intellisense的工具链（即台式机vs. roboRIO vs ...）。这与单击右下方状态栏中的"当前模式"相同。

source: **WPILib C++ Select Enabled C++ Intellisense Binary Types** - Switch Intellisense between static, shared, and executable
zh_cn: **WPILib C ++ Select Enabled C++ Intellisense Binary Types** - 在静态，共享和可执行文件之间切换Intellisense

source: **WPILib: Cancel currently running tasks** - Cancel any tasks the WPILib extension is currently running
es_mx: **WPILib: Cancel currently running tasks** - cancela cualquier tarea que la extensión WPILib esté ejecutando actualmente
he_il: **WPILib: Cancel currently running tasks** - ביטול כל המשימות שהרחבת WPILib מריצה כעת.
tr_tr: **WPILib: Cancel currently running tasks -WPILib: Şu anda çalışan görevleri iptal edin** - WPILib uzantısının şu anda çalıştırmakta olduğu tüm görevleri iptal eder.
zh_cn: ** WPILib：Cancel currently running tasks**-停止WPILib扩展正在运行的所有任务

source: **WPILib: Change Auto Save On Deploy Setting** - Change whether files are saved automatically when doing a Deploy. This defaults to Enabled.
es_mx: **WPILib: Change Auto Save On Deploy Setting** - Cambia si los archivos se guardan automáticamente al realizar una implementación. Este valor predeterminado es Activado.
he_il: **WPILib: Change Auto Save On Deploy Setting** - שינוי אם הקבצים יישמרו אוטומטית בעת ביצוע Deploy. ברירת המחדל היא מופעל.
tr_tr: **WPILib: Change Auto Save On Deploy Setting** - Bir yükleme yapılırken dosyaların otomatik olarak kaydedilip kaydedilmeyeceğini değiştirir. Bu varsayılan olarak etkinleştirilmiştir.
zh_cn: **WPILib：Change Auto Save On Deploy Setting**-更改在执行部署时是否自动保存文件。默认为启用。

source: **WPILib: Change Auto Start RioLog on Deploy Setting** - Change whether RioLog starts automatically on deploy. This defaults to Enabled.
es_mx: **WPILib: Change Auto Start RioLog on Deploy Setting** - Cambie si RioLog se inicia automáticamente al implementar. Este valor predeterminado es Activado.
tr_tr: **WPILib: Change Auto Start RioLog on Deploy Setting** - RioLog'un yüklemede otomatik olarak başlayıp başlamayacağını değiştirir. Bu varsayılan olarak etkinleştirilmiştir.
zh_cn: **WPILib：Change Auto Start RioLog on Deploy Setting**-更改RioLog是否在部署时自动启动。默认为启用。

source: **WPILib: Change Desktop Support Enabled Setting** - Change whether building robot code on Desktop is enabled. Enable this for test and simulation purposes. This defaults to Desktop Support off.
es_mx: **WPILib: Change Desktop Support Enabled Setting** - Cambie si está habilitada la creación de código de robot en el escritorio. Habilite esto para fines de prueba y simulación. De forma predeterminada, el soporte de escritorio está desactivado.
tr_tr: **WPILib: Change Desktop Support Enabled Setting** - Masaüstünde robot kodu oluşturmanın etkinleştirilip etkinleştirilmeyeceğini değiştirir. Bunu test ve simülasyon amaçları için etkinleştirir. Varsayılan olarak Masaüstü Desteği kapalıdır.
zh_cn: **WPILib：Change Desktop Support Enabled Setting**-更改是否启用在电脑上构建机器人代码。在测试和模拟时可以启用此功能。默认为关闭。

source: **WPILib: Change Language Setting** - Change whether the currently open project is C++ or Java.
es_mx: **WPILib: Change Language Setting** - Cambia si el proyecto actualmente abierto es C++ o Java.
he_il: **WPILib: Change Language Setting** - שינוי האם הפרויקט הפתוח כעת הוא C++ או Java.
tr_tr: **WPILib: Change Language Setting** - Şu anda açık olan projenin C++ veya Java olup olmadığını değiştirir.
zh_cn: **WPILib：Change Language Setting**-更改当前打开的是C ++还是Java项目。

source: **WPILib: Change Run Commands Except Deploy/Debug in Offline Mode Setting** - Change whether GradleRIO is running in Online Mode for commands other then deploy/debug (will attempt to automatically pull dependencies from online). Defaults to enabled (online mode).
es_mx: **WPILib: Change Run Commands Except Deploy/Debug in Offline Mode Setting** - Cambie si GradleRIO se está ejecutando en modo en línea para comandos diferentes a deploy/debug (intentará extraer automáticamente las dependencias de la red). El valor predeterminado es deshabilitado (modo en línea).
tr_tr: **WPILib: Change Run Commands Except Deploy/Debug in Offline Mode Setting-WPILib: Çevrimdışı Modda Dağıtma / Hata Ayıklama Hariç Çalıştırma Komutlarını Değiştirme** - GradleRIO'nun dağıtma / hata ayıklama dışındaki komutlar için Çevrimiçi Modda eğer çalışmıyorsa değiştirin (bağımlılıkları çevrimiçinden otomatik olarak çekmeye çalışır). Varsayılanlar etkin (online mode-çevrimiçi mod).
zh_cn: **WPILib：Change Run Commands Except Deploy/Debug in Offline Mode Setting**-更改GradleRIO是否在在线模式下运行除部署/调试以外的命令（将尝试从联机状态自动提取依赖项）。默认为启用（在线模式）。

source: **WPILib: Change Run Deploy/Debug Command in Offline Mode Setting** - Change whether GradleRIO is running in Online Mode for deploy/debug (will attempt to automatically pull dependencies from online). Defaults to disabled (offline mode).
es_mx: **WPILib: Change Run Deploy/Debug Command in Offline Mode Setting** - Cambia si GradleRIO se está ejecutando en modo en línea para deploy/debug (intentará extraer automáticamente las dependencias de la red). El valor predeterminado es deshabilitado (modo fuera de línea).
tr_tr: **WPILib: Change Run Deploy/Debug Command in Offline Mode Setting-WPILib: Çevrimdışı Mod Ayarında Çalıştırma Dağıtma / Hata Ayıklama Komutunu Değiştirin** - GradleRIO'nun dağıtım / hata ayıklama için Çevrimiçi Modda eğer çalışmıyorsa değiştirin (bağımlılıkları çevrimiçinden otomatik olarak çekmeye çalışacaktır). Varsayılanlar devre dışıdır (çevrimdışı mod).
zh_cn: **WPILib：Change Run Deploy/Debug Command in Offline Mode Setting**-更改GradleRIO是否在在线模式下进行部署/调试（将尝试从在线状态自动提取依赖项）。默认为禁用（离线模式）。

source: **WPILib: Change Select Default Simulate Extension Setting** - Change whether simulation extensions are enabled by default (all simulation extensions defined in ``build.gradle`` will be enabled)
es_mx: **WPILib: Change Select Default Simulate Extension Setting** - Cambia si las extensiones de simulación son habilitadas predeterminadamente (todas las extensiones de simulación que sean definidas en ``build.gradle`` serán deshabilitadas)
tr_tr: **WPILib: Varsayılan Simülasyon Uzantısı Ayarını Seçin** - Simülasyon uzantılarının varsayılan olarak etkinleştirilip etkinleştirilmeyeceğini değiştirin (``build.gradle`` içinde tanımlanan tüm simülasyon uzantıları etkinleştirilecektir)
zh_cn: **WPILib：Change Select Default Simulate Extension Setting**-更改默认情况下是否启用模拟扩展（``build.gradle``中定义的所有模拟扩展都将被启用）

source: **WPILib: Change Skip Tests On Deploy Setting** - Change whether to skip tests on deploy. Defaults to disabled (tests are run on deploy)
es_mx: **WPILib: Change Skip Tests On Deploy Setting**: cambie si se deben omitir las pruebas en la implementación. El valor predeterminado es deshabilitado (las pruebas se ejecutan en la implementación)
tr_tr: **WPILib: Change Skip Tests On Deploy Setting-WPILib: Yükleme Ayarında Testlerin Durumunu Değiştirin** - Yüklemede testlerin atlanıp atlanmayacağını değiştirir. Varsayılan olarak devre dışıdır (testler yüklemede çalıştırılır).
zh_cn: **WPILib: Change Skip Tests on Delpoy Setting**-设定在部署时是否跳过测试。默认为禁用（在部署时运行测试）

source: **WPILib: Change Stop Simulation on Entry Setting** - Change whether to stop robot code on entry when running simulation. Defaults to disabled (don't stop on entry).
es_mx: **WPILib: Change Stop Simulation on Entry Setting**: cambia si se debe detener el código del robot al ingresar al ejecutar la simulación. El valor predeterminado es deshabilitado (no se detiene al ingresar).
tr_tr: **WPILib: Change Stop Simulation on Entry Setting-WPILib: Giriş Ayarında Simülasyonun Durumunu Değiştir** - Simülasyon çalıştırılırken girişte robot kodunun durdurulup durdurulmayacağını değiştirir. Varsayılan olarak devre dışıdır (girişte durmaz).
zh_cn: **WPILib: Change Stop SImulation on Entry Setting** –更改在开始运行模拟时是否停止机器人代码。默认为禁用（不停止输入）。

source: **WPILib: Check for WPILib Updates** - Check for an update to the WPILib extensions
he_il: **WPILib: Check for WPILib Updates** - חיפוש עדכונים עבור הרחבת WPILib.
zh_cn: **WPILib: Check for WPILib Updates**-检查WPILib扩展的更新

source: **WPILib: Debug Robot Code** - Build and deploy robot code to roboRIO in debug mode and start debugging
es_mx: **WPILib: Debug Robot Code**: compile e implemente código de robot en roboRIO en modo de depuración y comience a depurar
tr_tr: **WPILib: Debug Robot Code-WPILib: Robot Kodunda Hata Ayıklama** - Hata ayıklama modunda robot kodunu oluşturun ve roboRIO'ya yükleyin, sonrasında hata ayıklamaya başlayın.
zh_cn: **WPILib: Debug Robot Code**-构建机器人代码，将其配置到roboRIO，以调试模式开始调试

source: **WPILib: Deploy Robot Code** - Build and deploy robot code to roboRIO
es_mx: **WPILib: Deploy Robot Code**: compile e implemente código de robot en roboRIO
he_il: **WPILib: Deploy Robot Code** - בנייה וביצוע Deploy הקוד ל-roboRIO.
tr_tr: **WPILib: Deploy Robot Code-WPILib: Robot Kodunu Yükleyin** - Robot kodunu oluşturur ve roboRIO'ya yükler.
zh_cn: **WPILib: Deploy Robot Code**-构建机器人代码并将其部署到roboRIO

source: **WPILib: Install tools from GradleRIO** - Install the WPILib Java tools (e.g. SmartDashboard, Shuffleboard, etc.). Note that this is done by default by the offline installer
es_mx: **WPILib: Install tools from GradleRIO** - Instale las herramientas de WPILib Java (por ejemplo, SmartDashboard, Shuffleboard, etc.). Tenga en cuenta que esto lo hace de forma predeterminada el instalador fuera de línea
tr_tr: **WPILib: Install tools from GradleRIO -WPILib: GradleRIO'dan araçlar yükleyin** - WPILib Java araçlarını yükler (örn. SmartDashboard, Shuffleboard, vb.). Bunun varsayılan olarak çevrimdışı yükleyici tarafından yapıldığını unutmayın.
zh_cn: **WPILib: Install tools from GradleRIO** -安装WPILib Java工具（例如SmartDashboard，Shuffleboard等）。请注意，默认情况下，此操作由离线安装程序完成

source: **WPILib: Manage Vendor Libraries** - Install/update 3rd party libraries
es_mx: **WPILib: Manage Vendor Libraries** - Instalar / actualizar bibliotecas de 3ros
he_il: **WPILib: Manage Vendor Libraries** - התקנה/עדכון של ספריות צד שלישי
tr_tr: **WPILib: Manage Vendor Libraries-WPILib: Üretici Kütüphanelerini Yönetin** - 3. şahıs kütüphanelerini yükler/günceller.
zh_cn: **WPILib: Manage Vendor Libraries**-安装/更新第三方库

source: **WPILib: Open API Documentation** - Opens either the WPILib Javadocs or C++ Doxygen documentation
es_mx: **WPILib: Open API Documentation** - Abre ya sea WPILib Javadocs o la documenación C++ Doxygen
tr_tr: **WPILib: Open API Documentation-WPILib: Açık API Belgeleri** - WPILib Javadocs veya C++ Doxygen belgelerini açar
zh_cn: **WPILib: Open API Documentation**-打开WPILib Javadocs或C ++ Doxygen文档

source: **WPILib: Open Project Information** - Opens a widget with project information (Project version, extension version, etc.)
es_mx: **WPILib: Open Project Information**: abre un widget con información del proyecto (versión del proyecto, versión de extensión, etc.)
tr_tr: **WPILib: Open Project Information -WPILib: Proje Bilgilerini Aç** - Proje bilgilerini içeren bir widget açar (Proje sürümü, uzantı sürümü vb.).
zh_cn: **WPILib: Open Project Information**-打开带有项目信息（项目版本，扩展版本等）的“小帮手”

source: **WPILib: Open WPILib Command Palette** - This command is used to open a WPILib Command Palette (equivalent of hitting :kbd:`Ctrl+Shift+P` and typing ``WPILib``)
es_mx: **WPILib: Open WPILib Command Palette** - Este comando es usado para abrir un WPILib Command Palette (equivalente de presionar :kbd:`Ctrl+Shift+P` y teclear ``WPILib``)
tr_tr: **WPILib: WPILib Komut Paletini Aç** - Bu komut, bir WPILib Komut Paletini açmak için kullanılır (şuna eşdeğer :kbd:`Ctrl+Shift+P` and typing ``WPILib`` yazarak)
zh_cn: **WPILib: Open WPILib Command Palette**-此指令用于打开WPILib指令面板（等同于按Ctrl + Shift + P并输入"WPILib''）

source: **WPILib: Open WPILib Help** - This opens a simple page which links to the WPILib documentation (this site)
es_mx: **WPILib: Open WPILib Help** - Esto abre una página simple que enlaza con la documentación de WPILib (este sitio)
tr_tr: **WPILib: Open WPILib Help-WPILib: WPILib Yardımını Aç** - Bu, WPILib belgelerine bağlantı veren basit bir sayfa açar (bu site).
zh_cn: **WPILib: Open WPILib Help**-这将打开一个链接到WPILib文档（此网站）的页面

source: **WPILib: Reset Ask for WPILib Updates Flag** - This will clear the flag on the current project, allowing you to re-prompt to update a project to the latest WPILib version if you previously chose to not update.
es_mx: **WPILib: Reset Ask for WPILib Updates Flag**: esto borrará el indicador del proyecto actual, lo que le permitirá volver a solicitar la actualización de un proyecto a la última versión de WPILib si previamente eligió no actualizar.
tr_tr: **WPILib: Reset Ask for WPILib Updates Flag-WPILib Güncellemelerini Sıfırlama** - Bu, mevcut projedeki işareti temizleyerek, daha önce güncelleme yapmamayı seçtiyseniz bir projeyi en son WPILib sürümüne güncellemenize olanak tanır.
zh_cn: **WPILib: Reset Ask for WPILib Updates Flag**-这将清除当前项目上的标志，如果您先前选择暂不更新，这使得您可以将项目更新为最新的WPILib版本。

source: **WPILib: Run a command in Gradle** - This lets you run an arbitrary command in the GradleRIO command environment
es_mx: **WPILib: Run a command in Gradle**: esto le permite ejecutar un comando arbitrario en el entorno de comandos de GradleRIO
tr_tr: **WPILib: Run a command in Gradle-WPILib: Gradle'da bir komut çalıştırın** - Bu, GradleRIO komut ortamında rastgele bir komut çalıştırmanıza olanak tanır.
zh_cn: **WPILib: Run a command in Gradle**-这使您可以在GradleRIO环境中运行任意指令

source: **WPILib: Set Team Number** - Used to modify the team number associated with a project. This is only needed if you need to change the team number from the one initially specified when creating the project.
es_mx: **WPILib: Set Team Number**: se utiliza para modificar el número de equipo asociado con un proyecto. Esto solo es necesario si necesita cambiar el número de equipo del que se especificó inicialmente al crear el proyecto.
he_il: **WPILib: Set Team Number** - שינוי מספר הקבוצה המשויך לפרויקט. נחוץ רק עבור שינוי את מספר הקבוצה מזה שצוין בתחילה בעת יצירת הפרויקט.
tr_tr: **WPILib: Set Team Number-WPILib: Takım Numarasını Ayarla** - Bir projeyle ilişkili takım numarasını değiştirmek için kullanılır. Bu, yalnızca proje oluştururken başlangıçta belirtilen takım numarasını değiştirmeniz gerektiğinde gereklidir.
zh_cn: **WPILib: Set Team Number**-用于修改与项目关联的团队编号。您只会在创建项目时更改最初指定的团队号时用到。

source: **WPILib: Set VS Code Java Home to FRC Home** - Set the VS Code Java Home variable to point to the Java Home discovered by the FRC extension. This is needed if not using the offline installer to make sure the intellisense settings are in sync with the WPILib build settings.
es_mx: **WPILib: Set VS Code Java Home to FRC Home** - Establezca la variable VS Code Java Home para que apunte al Java Home descubierto por la extensión FRC. Esto es necesario si no usa el instalador fuera de línea para asegurarse de que la configuración de intellisense esté sincronizada con la configuración de compilación de WPILib.
tr_tr: **WPILib: Set VS Code Java Home to FRC Home -WPILib: VS Code Java Home'u FRC Home'a Ayarla** - VS Code Java Home değişkenini FRC uzantısı tarafından keşfedilen Java Home'a yönlendirecek şekilde ayarlar. Bu, IntelliSense ayarlarının WPILib yapı ayarlarıyla uyumlu olduğundan emin olmak için çevrimdışı yükleyici kullanılmıyorsa gereklidir.
zh_cn: **WPILib: Set VS Code Java Home to FRC Home*-设置VS Code Java Home变量以指向FRC扩展发现的Java Home。如果不使用离线安装程序，您需要这样做以确保intellisense设置与WPILib构建设置同步。

source: **WPILib: Show Log Folder** - Shows the folder where the WPILib extension stores internal logs. This may be useful when debugging/reporting an extension issue to the WPILib developers
es_mx: **WPILib: Show Log Folder**: muestra la carpeta donde la extensión WPILib almacena los registros internos. Esto puede ser útil al depurar / informar un problema de extensión a los desarrolladores de WPILib
tr_tr: **WPILib: Show Log Folder-WPILib: Log Klasörünü Göster** - WPILib uzantısının dahili logları sakladığı klasörü gösterir. Bu, WPILib geliştiricilerine bir uzantı sorunu bildirirken/hata ayıklarken yararlı olabilir.
zh_cn: **WPILib: Show Log Folder**-显示WPILib扩展存储内部日志的文件夹。在调试或报告扩展问题给WPILib开发人员时，这或许很有用。

source: **WPILib: Simulate Robot Code on Desktop** - This builds the current robot code project on your PC and starts it running in simulation. This requires Desktop Support to be set to Enabled.
zh_cn: **WPILib: Simulate Robot Code on Desktop**-这将在您的电脑上构建当前的代码项目，并运行模拟程序。这需要将“Desktop Support”设置为已启用。

source: **WPILib: Start RioLog** - This starts the RioLog display used to view console output from a robot program
es_mx: **WPILib: Start RioLog**: esto inicia la pantalla RioLog utilizada para ver la salida de la consola desde un programa de robot
tr_tr: **WPILib: Start RioLog-WPILib: RioLog'u Başlat** - Bu, bir robot programından konsol çıkışını görüntülemek için kullanılan RioLog ekranını başlatır.
zh_cn: **WPILib: Start RioLog**-这将启动用于查看机器人程序的控制台输出的RioLog显示。

source: **WPILib: Start Tool** - This allows you to launch WPILib tools (e.g. SmartDashboard, Shuffleboard, etc.) from inside VS Code
es_mx: **WPILib: Start Tool**: esto le permite iniciar herramientas WPILib (por ejemplo, SmartDashboard, Shuffleboard, etc.) desde dentro de VS Code
tr_tr: **WPILib: Start Tool-WPILib: Başlangıç Aracı** - Bu, WPILib araçlarını (örn. SmartDashboard, Shuffleboard, vb.) VS Code içinden başlatmanıza olanak tanır.
zh_cn: **WPILib: Start Tool**-这使您可以从VS Code内部启动WPILib工具（例如SmartDashboard，Shuffleboard等）。

source: **WPILib: Test Robot Code** - This builds the current robot code project and runs any created tests. This requires Desktop Support to be set to Enabled.
es_mx: **WPILib: Test Robot Code**: esto crea el proyecto de código de robot actual y ejecuta las pruebas creadas. Esto requiere que Desktop Support esté configurado en Enabled.
tr_tr: **WPILib: Test Robot Code-WPILib: Robot Kodunu Test Etme** - Bu, mevcut robot kodu projesini oluşturur ve oluşturulan tüm testleri çalıştırır. Bu, Masaüstü Desteğinin-Desktop Support, Etkin-Enabled olarak ayarlanmasını gerektirir.
zh_cn: **WPILib: Test Robot Code**-这将构建当前的机器人代码项目并运行任何创建的测试。这需要将“Desktop Support”设置为已启用。
