Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/control-system-software.po
Languages: es_mx, fr_ca, tr_tr

source: SmartDashboard is an alternate dashboard application written in Java. SmartDashboard automatically creates a widget for each variable sent from the Robot sent using the SmartDashboard class or VIs. These widgets can be configured to a number of preset display types, or users can create custom extensions in Java. Vision extensions are available for the SmartDashboard which allow it to display images from the Axis camera on the robot. SmartDashboard is included in the C++ and Java language updates (enabled by clicking the C++ or Java buttons respectively on the Setup tab of the Driver Station). Additional documentation on SmartDashboard can be found :ref:`here <docs/software/wpilib-tools/smartdashboard/index:SmartDashboard>`.
es_mx: El Tablero Inteligente es una aplicación de tablero alternativa escrita en Java. El Tablero Inteligente crea automáticamente un aparato para cada variable enviada desde el robot, usando la clase del Tablero Inteligente o VIs. Estos aparatos pueden ser configurados a una serie de tipos de visualizaciones preestablecidas, o los usuarios pueden crear extensiones personalizadas en Java. Las extensiones de la visión están disponibles para el Tablero Inteligente, las cuales le permiten mostrar imágenes de la cámara Axis en el robot. El Tablero Inteligente está incluido en las actualizaciones de los lenguajes C++ y Java (habilitado haciendo clic en el respectivo botón de C++ o Java en la pestaña de Configuración de la Driver Station). Puede encontrar información adicional del Tablero Inteligente :ref:`aquí<docs/software/wpilib-tools/smartdashboard/index:SmartDashboard>`.
fr_ca: SmartDashboard est une application de tableau de bord alternative écrite en Java. L'application SmartDashboard crée automatiquement un widget relatif à chaque variable envoyée par le robot en utilisant la classe SmartDashboard ou les VIs. Ces widgets peuvent être configurées selon certains types d'affichage prédéfinis ou selon des extensions personnalisées en Java. Des extensions pour la vision sont disponibles pour le SmartDashboard qui lui permettent d'afficher des images d'une caméra Axis sur le robot. Le SmartDashboard est intégré dans les mises à jour des langages de programmation C++ et Java (activé en cliquant sur le bouton C++ ou Java respectivement sur l'onglet de configuration du Driver Station). De la documentation supplémentaire pour SmartDashboard peut être trouvée :ref:`ici <docs/software/wpilib-tools/smartdashboard/index:SmartDashboard>`.
tr_tr: SmartDashboard, Java ile yazılmış alternatif bir pano uygulamasıdır. SmartDashboard, robottan SmartDashboard sınıfı veya VI'lar kullanılarak gönderilen her değişken için otomatik olarak bir widget oluşturur. Bu widget'lar, önceden ayarlanmış bir dizi görüntü türüne göre yapılandırılabilir veya kullanıcılar Java'da özel uzantılar oluşturabilir. SmartDashboard için, robot üzerindeki Axis kamerasından gelen görüntüleri görüntülemesine izin veren vizyon uzantıları mevcuttur. SmartDashboard, C ++ ve Java dil güncellemelerine dahildir (sırasıyla Driver Station'ın Ayarlar sekmesinde C ++ veya Java düğmelerine tıklanarak etkinleştirilir). SmartDashboard ile ilgili ek belgeler buradan bulunabilir: :ref:`burada<docs/software/wpilib-tools/smartdashboard/index:SmartDashboard>`.

source: LiveWindow is a mode of SmartDashboard , designed for use with the Test Mode of the Driver Station. LiveWindow allows the user to see feedback from sensors on the robot and control actuators independent of the written user code. More information about LiveWindow can be found :ref:`here <docs/software/wpilib-tools/smartdashboard/test-mode-and-live-window/index:SmartDashboard: Test Mode and Live Window>`.
es_mx: LiveWindow es un modo del Tablero Inteligente, diseñado para usarlo con el Modo de Prueba de la Driver Station. LiveWindow le permite al usuario ver comentarios de los sensores del robot y de los actuadores de control independientes del código de usuario escrito. Más información sobre LiveWindow puede ser encontrada :ref:`aquí<docs/software/wpilib-tools/smartdashboard/test-mode-and-live-window/index:SmartDashboard: Test Mode and Live Window>`.
fr_ca: LiveWindow est un mode de SmartDashboard conçu pour être utilisé avec le mode Test de l'application Driver Station. LiveWindow permet à l'utilisateur de voir les données des capteurs sur le robot et de contrôler les mécanismes indépendamment du code écrit. Plus d'informations à propos de LiveWindow peuvent être trouvées :ref:`ici <docs/software/wpilib-tools/smartdashboard/test-mode-and-live-window/index:SmartDashboard: Test Mode and Live Window>`.
tr_tr: LiveWindow, Driver Station Test Modu ile kullanılmak üzere tasarlanmış bir SmartDashboard modudur. LiveWindow, kullanıcının robot üzerindeki sensörlerden gelen geri bildirimleri görmesine ve yazılı kullanıcı kodundan bağımsız olarak aktüatörleri kontrol etmesine olanak tanır. LiveWindow hakkında daha fazla bilgi şuradan bulunabilir::ref:`burada <docs/software/wpilib-tools/smartdashboard/test-mode-and-live-window/index:SmartDashboard: Test Mode and Live Window>`.

source: Shuffleboard is an alternative dashboard application written in Java. It takes many of the concepts from SmartDashboard such as automatic adding of widgets and adds new features including better layout control and record/playback functionality. Shuffleboard contains all of the basic widget types found in the SmartDashboard as well as a number of new ones intended to make visualizing specific robot components even easier. It has full integration with WPILib’s “cscore” for displaying, recording, and playing back camera streams. Shuffleboard is included in the C++ and Java language updates (enabled by selecting Shuffleboard from the dashboard type on the Setup tab of the Driver Station or by launching it from the WPILib start tool menu in Visual Studio Code). Additional documentation on Shuffleboard can be found :ref:`here <docs/software/wpilib-tools/shuffleboard/index:Shuffleboard>`.
es_mx: Shuffleboard es una aplicación de tablero alternativa escrita en Java. Tiene varios de los conceptos del Tablero Inteligente, tales como adición automática de aparatos y nuevas características, que incluyen un mejor control de diseño y funcionalidad de grabación/ reproducción. Shuffleboard contiene todos los tipos de aparatos básicos encontrados en el Tablero Inteligente así como nuevos destinados a hacer la visualización específica del robot aún más fácil. Tiene integración completa con “cscore” de WPILib's para mostrar, grabar, y reproducir transmisiones de cámara. Shuffleboard está incluida en las actualizaciones de los lenguajes C++ y Java (habilitada seleccionando Shuffleboard del tablero Tipo en la pestaña de Configuración de la Driver Station o iniciándolo desde el menú de herramientas de inicio de WPILib en el Código de Visual Studio). Documentación adicional de Shuffleboard puede ser encontrada ref:`aquí<docs/software/wpilib-tools/shuffleboard/index:Shuffleboard>`.
fr_ca: Shuffleboard est une application de tableau de bord alternative écrite en Java. Cette application reprend de nombreux concepts de l'application SmartDashboard, comme l'ajout automatique de widgets, et ajoute de nouvelles fonctions comme un meilleur contrôle de la disposition des widgets et la possibilité d'enregistrer et de rejouer des ensembles de données. Shuffleboard comprend tous les widgets de base trouvés dans le SmartDashboard ainsi qu'un certain nombre de nouveaux widgets destinés à rendre la visualisation de composants spécifiques du robot encore plus facile. Il a une intégration complète avec "cscore" de WPILib pour l'affichage, l'enregistrement et la lecture des flux de caméras. Shuffleboard est intégré dans les mises à jour des langages de programmation C++ et Java (activé par la sélection de Shuffleboard dans le type de tableau de bord sur l'onglet de configuration du Driver Station, ou par son lancement avec l'outil de démarrage WPILib en Visual Studio Code). De la documentation additionnelle sur Shuffleboard peut être trouvée :ref:`ici <docs/software/wpilib-tools/shuffleboard/index:Shuffleboard>`.
tr_tr: Shuffleboard, Java ile yazılmış alternatif bir pano uygulamasıdır. SmartDashboard'dan widget'ların otomatik olarak eklenmesi benzeri konseptlerin çoğunu alır ve daha iyi düzen kontrolü ve kayıt / oynatma işlevi gibi yeni özellikler de ekler. Shuffleboard, SmartDashboard'da bulunan tüm temel widget türlerini içermenin yanı sıra belirli robot bileşenlerini görselleştirmeyi daha da kolaylaştırma amacı güden bir dizi yeni widget'ı da içerir. Kamera akışlarını görüntülemek, kaydetmek ve oynatmak için WPILib’in "cscore"u ile tam entegrasyona sahiptir. Shuffleboard, C ++ ve Java dil güncellemelerine dahildir (Driver Station'ın Setup sekmesindeki pano türünden Shuffleboard seçilerek veya Visual Studio Code'daki WPILib başlatma aracı menüsünden başlatılarak etkinleştirilebilir). Shuffleboard ile ilgili ek belgeler buradan bulunabilir: :ref:`burada<docs/software/wpilib-tools/shuffleboard/index:Shuffleboard>`.

source: FRC roboRIO Imaging Tool (Windows Only)
es_mx: Herramienta de Imagen de la roboRIO para FRC (Exclusiva para Windows)
fr_ca: Outil d'installation d'image roboRIO FRC (Windows Seulement)
tr_tr: FRC roboRIO Imaging - Görüntüleme Aracı (Yalnızca Windows)

source: The FRC roboRIO Imaging Tool is a software tool used to format and setup an roboRIO-FRC device for use in FRC. The tool detects any roboRIO device on the network, reports the current MAC, name, IP and Image version. The tool allows the user to configure the team number, set options including Console Out and whether an applications runs on Startup, and install the latest software image on the device. The FRC roboRIO Imaging Tool is installed as part of the FRC Game Tools. Installation instructions can be found :ref:`here <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. Additional instructions on imaging your roboRIO using this tool can be found :doc:`here <imaging-your-roborio>`.
es_mx: La Herramienta de Imagen de la roboRIO para FRC es una herramienta de software utilizada para formatear y configurar un dispositivo roboRIO-FRC para su uso. La herramienta detecta cualquier dispositivo roboRIO en la red, informa el actual MAC, nombre, IP y versión de imagen. Esta herramienta le permite al usuario configurar el número del equipo, establecer opciones incluyendo Console Out y si una aplicación se abre en Configuración, e instalar la imagen de software en el dispositivo. La Herramienta de Imagen de la roboRIO se instala como parte de las Herramientas de Juego de FRC. Las instrucciones de instalación pueden ser encontradas :ref:`aquí<docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. Instrucciones adicionales de la imagen de la roboRIO utilizando esta herramienta pueden ser encontradas doc:`aquí<imaging-your-roborio>`.
fr_ca: L'utilitaire FRC roboRIO Imaging Tool est un outil logiciel utilisé pour formater et configurer un contrôleur roboRIO-FRC pour l'utilisation en FRC. Cet outil détecte n'importe quel contrôleur roboRIO sur le réseau et en affiche le MAC, nom, IP, et la version d'image actuelle. L'outil permet à l'utilisateur de configurer le numéro d'équipe, des options comme la sortie console ou le lancement d'une application au démarrage et d'installer l'image logicielle la plus récente dans le contrôleur. Le FRC roboRIO Imaging Tool est installé avec les FRC Game Tools. Les instructions d'installation peuvent être trouvées :ref:`ici <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. Des instructions additionnelles pour installer l'image de votre roboRIO en utilisant cet outil peuvent être trouvées :doc:`ici <imaging-your-roborio>`.
tr_tr: FRC roboRIO Görüntüleme Aracı, FRC'de kullanılmak üzere bir roboRIO-FRC cihazını biçimlendirmek ve ayarlamak için kullanılan bir yazılım aracıdır. Araç, ağdaki herhangi bir roboRIO cihazını algılar, mevcut MAC, isim, IP ve Görüntü sürümünü rapor eder. Araç, kullanıcının ekip numarasını yapılandırmasına, Konsol Çıkışı dahil seçenekleri ve bir uygulamanın Startup'ta çalışıp çalışmayacağını ayarlamasına ve cihaza en son yazılım görüntüsünü yüklemesine olanak tanır. FRC roboRIO Görüntüleme Aracı, FRC Oyun Araçlarının bir parçası olarak yüklenir. Kurulum talimatları bulunabilir: :ref:`burada <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. Bu aracı kullanarak roboRIO'nuzu görüntüleme konusunda ek talimatlar burada bulunabilir: :doc:`burada <imaging-your-roborio>`.

source: Setup Axis Camera (Windows Only)
es_mx: Configuración de la Cámara Axis (Sólo para Windows)
fr_ca: Configuration de la Caméra Axis (Windows Seulement)
tr_tr: Axis Camera Kurulumu (Yalnızca Windows)

source: The Setup Axis Camera utility is a LabVIEW program used to configure an Axis 206, M1011 or M1013 camera for use on the robot. The tool takes a factory reset camera connected directly to the computer and configures the IP, username and password, anonymous access, and default framerate and compression (for use with the SmartDashboard or other access methods). The Setup Axis Camera tool is installed as part of the FRC Game Tools.
es_mx: La Configuración de la utilidad de la Cámara Axis es un programa de LabVIEW usado para configurar una cámara Axis 206, M1011 o M1013 para usarla en el robot. La herramienta toma una cámara de restablecimiento conectada directamente a la computadora y configura la IP, nombre de usuario y contraseña, accesos anónimos, fotogramas por segundo y compresión preestablecidos (para usarlos con el Tablero Inteligente u otro método de acceso). La Configuración de la Cámara Axis está instalada como parte de las Herramientas de Juego de FRC.
fr_ca: L'utilitaire de Configuration de la Caméra Axis est un logiciel utilisé pour configurer une caméra Axis 206, M1011 ou M1013 pour l'utilisation sur le robot. L'utilitaire prend une caméra réinitialisée à sa configuration par défaut connectée directement à l'ordinateur et configure l'adresse IP, le nom d'utilisateur et le mot de passe, l'accès anonyme, le taux de raffraîchissement et la compression de défaut (pour une utilisation avec le SmartDashboard ou d'autre méthodes d'accès). L'outil de Configuration de Caméra Axis est installé en tant qu'élément des Outils de Jeu FRC.
tr_tr: Setup Axis Camera yardımcı programı, robotta kullanılmak üzere bir Axis 206, M1011 veya M1013 kamerayı yapılandırmak için kullanılan bir LabVIEW programıdır. Araç, doğrudan bilgisayara bağlı fabrika ayarlarına sıfırlanmış bir kamerayı alır ve IP'yi, kullanıcı adını ve şifreyi, anonim erişimi, varsayılan kare hızını ve sıkıştırmayı (SmartDashboard veya diğer erişim yöntemleriyle kullanım için) yapılandırır. Axis Camera Setup aracı, FRC Oyun Araçlarının bir parçası olarak yüklenir.

source: FRC Driver Station Log Viewer (Windows Only)
es_mx: Visor de Registro de la Driver Station para FRC (Sólo para Windows)
fr_ca: Visionneur de Journaux de la Driver Station FRC (Windows Seulement)
tr_tr: FRC Driver Station Günlük Görüntüleyicisi (Yalnızca Windows)

source: The FRC Driver Station Log Viewer is a LabVIEW program used to view logs created by the FRC Driver Station. These logs contain information such as battery voltage, trip time, CPU% and robot mode, as well as events such as joystick removal. The FRC Driver Station Log Viewer is included in the FRC Game Tools. Installation instructions can be found :ref:`here <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. More information about the FRC Driver Station Log Viewer and understanding the logs can be found :ref:`here <docs/software/driverstation/driver-station-log-viewer:Driver Station Log File Viewer>`
es_mx: El Visor de Registro de la Driver Station para FRC es un programa de LabVIEW usado para mostrar el registro creado por la Driver Station. Estos registros contienen información como el voltaje de la batería, el tiempo en recorrer, CPU% y modo del robot, así como eventos como remover la palanca de juego. El Visor de Registro de la Driver Station para FRC está incluido en las Herramientas de Juego de FRC. Las instrucciones de instalación pueden ser encontradas :ref:`aquí<docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. Puede encontrar más información sobre el Visor de Registro de la Driver Station para FRC :ref:`aquí<docs/software/driverstation/driver-station-log-viewer:Driver Station Log File Viewer>`
fr_ca: Le Visionneur de Journaux de la Driver Station FRC est un logiciel LabVIEW utilisé pour visionner les journaux crées par la Driver Station FRC. Ces journaux contiennent de l'information telle que la tension de la batterie, le temps de trajet, %CPU, le mode de robot ainsi que les événements tel que le retrait du joystick. Le Visionneur de Journaux de la Driver Station FRC est inclus dans les Outils de Jeu FRC. Les instructions d'installation peuventt être trouvées :ref:`ici <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. D'autres informations à propos du Visionneur de Journaux de la Driver Station FRC et comment comprendre les journaux peuvent être trouvées :ref:`ici <docs/software/driverstation/driver-station-log-viewer:Driver Station Log File Viewer>`.
tr_tr: FRC Driver Station Günlük Görüntüleyicisi, FRC Driver Station tarafından oluşturulan günlükleri görüntülemek için kullanılan bir LabVIEW programıdır. Bu günlükler pil voltajı, yolculuk süresi, CPU% ve robot modu gibi bilgilerin yanı sıra kumanda kolunun çıkarılması gibi olayları içerir. FRC Driver Station Günlük Görüntüleyicisi, FRC Oyun Araçlarına dahildir. Kurulum talimatları bulunabilir: :ref:`here <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. FRC Sürücü İstasyonu Günlük Görüntüleyicisi hakkında daha fazla bilgi ve günlükleri anlamak şu adreste bulunabilir: :ref:`here <docs/software/driverstation/driver-station-log-viewer:Driver Station Log File Viewer>`

source: RobotBuilder is a tool designed to aid in setup and structuring of a Command Based robot project for C++ or Java. RobotBuilder allows you to enter in the various components of your robot subsystems and operator interface and define what your commands are in a graphical tree structure. RobotBuilder will then verify that you have no port allocation conflicts and can generate a wiring table indicating what is connected to each port as well as C++ or Java code. The code created generates the appropriate files, constructs the appropriate objects and adds LiveWindow code for each sensor and actuator, but does not write any of the actual Subsystem or Command methods. The user must write the appropriate code for these methods for the robot to function. More information about RobotBuilder can be found :ref:`here <docs/software/wpilib-tools/robotbuilder/index:RobotBuilder>`. More information about the Command Based programming architecture can be found :ref:`here <docs/software/commandbased/index:Command-Based Programming>`.
es_mx: RobotBuilder es una herramienta diseñada para ayudar en la configuración y estructuración de un proyecto de robot basado en comandos para C++ o Java. RobotBuilder le permite ingresar en los diferentes componentes de los subsistemas de su robot e interfaz de su operador y definir cuáles son sus comandos en una estructura gráfica. RobotBuilder verificará que no tenga conflictos de asignación de puertos y puede generar una tabla de cableado indicando lo que está conectado a cada puerto, así como el código de C++ o Java. El código creado genera los archivos apropiados, construye los objetos adecuados y agrega un código de LiveWindow para cada sensor y actuador, pero no escribe nada de los métodos actuales de Subsistemas o Comandos. El usuario debe escribir el código para estos métodos para que el robot funcione. Más información acerca de RobotBuilder puede ser encontrada :ref:`aquí<docs/software/wpilib-tools/robotbuilder/index:RobotBuilder>`. Puede encontrar más información sobre la la programación basada en comandos :ref:`aquí<docs/software/commandbased/index:Command-Based Programming>`
fr_ca: RobotBuilder est un outil conçu pour vous aider avec la configuration et la structuration d'un projet de robot orienté commande en C++ ou Java. RobotBuilder vous permet de rentrer les différents composants des sous-systèmes de votre robot, l'interface opérateur et définir quelles sont vos commandes dans une structure aborescente graphique. RobotBuilder vérifiera ensuite que vous n'avez aucun conflit d'allocation de port et peut produire une table de câblage indiquant ce qui est connecté à chaque port ainsi que du code en C++ ou Java. Le code crée génère les fichiers appropriés, construit les objets appropriés et ajoute du code LiveWindow pour chaque capteur et actionneur, cependant il n'écrit pas les méthodes réelles pour les sous-systèmes ou les commandes. L'utilisateur doit écrire le code approprié pour ces méthodes afin que le robot fonctionne. Des informations supplémentaires à propos de RobotBuilder peuvent être trouvées :ref:`ici <docs/software/wpilib-tools/robotbuilder/index:RobotBuilder>`. D'autres informations à propos de l'architecture de programmation orientée commande peuvent être trouvées :ref:`ici <docs/software/commandbased/index:Command-Based Programming>`.
tr_tr: RobotBuilder, C ++ veya Java için Komut Tabanlı bir robot projesinin kurulumuna ve yapılandırılmasına yardımcı olmak için tasarlanmış bir araçtır. RobotBuilder, robot alt sistemlerinizin ve operatör arayüzünüzün çeşitli bileşenlerine girmenize ve komutlarınızın ne olduğunu grafiksel bir ağaç yapısında tanımlamanıza olanak tanır. RobotBuilder daha sonra bağlantı noktası çakışmalarınızın olmadığını doğrular ve her bağlantı noktasına neyin bağlı olduğunu ve C++ veya Java kodunu gösteren bir kablolama tablosu oluşturabilir. Oluşturulan kod, uygun dosyaları oluşturur, uygun nesneleri oluşturur ve her sensör ve aktüatör için LiveWindow kodunu ekler, ancak gerçek Subsystem veya Command yöntemlerinden hiçbirini yazmaz. Kullanıcı, robotun çalışması için bu yöntemlere uygun kodu yazmalıdır. RobotBuilder hakkında daha fazla bilgi bulunabilir: :ref:`burada <docs/software/wpilib-tools/robotbuilder/index:RobotBuilder>`. Komut Tabanlı programlama mimarisi hakkında daha fazla bilgi bulunabilir: :ref:`here <docs/software/commandbased/index:Command-Based Programming>`.

source: OutlineViewer
es_mx: Visor de Esquema

source: OutlineViewer is a utility used to view, modify and add to the contents of the NetworkTables for debugging purposes. It displays all key value pairs currently in the NetworkTables and can be used to modify the value of existing keys or add new keys to the table. OutlineViewer is included in the C++ and Java language updates (found in ``\tools\wpilib``. Teams may need to install the Java Runtime Environment to use the OutlineViewer on computers not set up for Java programming.
es_mx: El Visor de esquema es una utilidad usada para ver, modificar y agregar a los contenidos de NetworkTables para propósitos de depuración. Muestra todos los pares de valores clave actuales en NetworkTables y puede ser usado para modificar el valor de las claves existentes o agregar nuevas claves a la tabla. El Visor de Esquema está incluido en las actualizaciones de los programas C++ y Java (encontrado en ``\herramientas\wpilib``. Los equipos pueden necesitar instalar el Java Runtime Environment para usar el Visor de esquema en computadoras no configuradas para la programación en Java.
