Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/control-system-software.po
Languages: es_mx, fr_ca, tr_tr

source: FRC Software Component Overview
es_mx: Descripción del Componente de Software para FRC
fr_ca: Survol des composants logiciels FRC
tr_tr: FRC Yazılım Bileşenlerine Genel Bakış

source: The FRC control system consists of a wide variety of mandatory and optional software components. These elements are designed to assist you in the design, development, and debugging of your robot code as well as assist with control robot operation and to provide feedback when troubleshooting. For each software component this document will provide a brief overview of its purpose, a link to the package download, if appropriate, and a link to further documentation where available.
es_mx: El Sistema de Control de FRC consiste en una amplia variedad de componentes obligatorios y opcionales de software. Estos elementos están diseñados para brindar apoyo durante el diseño, desarrollo, y depuración del código de su robot, así como para ayudarlo a controlar la operación del robot y brindarle una retroalimentación al solucionar problemas. Este documento le proporcionará una descripción del propósito de cada componente de software, un enlace para descargar el mismo y un enlace a más documentación cuando esté disponible.
fr_ca: Le système de contrôle FRC se compose d'une grande variété de composants logiciels obligatoires et facultatifs. Ces éléments ont été conçus avec pour objectif de vous aider dans la conception, le développement, et le débogage de votre code de robot, mais aussi pour vous assister pendant l'opération du robot et pour fournir des informations lors du dépannage. Pour chaque composant logiciel ce document fournira un survol de son objet, un lien pour le téléchargement du package, le cas échéant, et un lien vers d'autres documents lorsqu'il en existe.
tr_tr: FRC kontrol sistemi, çok çeşitli zaruri ve seçime bağlı yazılım bileşenlerinden oluşur. Bu öğeler, robot kodunuzun tasarımı, geliştirilmesi ve hata ayıklamasında size yardımcı olmanın yanı sıra robotunun çalışmasının kontrolüne yardımcı olmak ve sorun giderme sırasında geri bildirim sağlamak için tasarlanmıştır. Bu belge, her bir yazılım bileşeni için, amacına ilişkin kısa bir genel bakış, uygunsa paket indirme bağlantısı ve varsa diğer belgelere bir bağlantı sağlar.

source: Operating System Compatibility
es_mx: Compatibilidad del Sistema Operativo
fr_ca: Compatibilité du système d'exploitation
tr_tr: İşletim Sistemi Uyumluluğu

source: The primary supported OS for FRC components is Windows. All required FRC software components have been tested on Windows 7, 8, and 10. Windows XP is not supported.
es_mx: Windows es el principal OS compatible para componentes de FRC. Todos los componentes requeridos de software para FRC han sido probados en Windows 7, 8 y 10. Windows XP no es compatible.
fr_ca: Le principal système d'exploitation pris en charge pour les composants FRC est Windows. Tous les composants logiciels de FRC ont été testés sur Windows 7, 8 et 10. Windows XP n'est pas pris en charge.
tr_tr: FRC bileşenleri için desteklenen birincil işletim sistemi Windows'tur. Tüm gerekli FRC yazılım bileşenleri Windows 7, 8 ve 10'da test edilmiştir. Windows XP desteklenmemektedir.

source: Having said that, many of the tools for C++/Java programming are also supported and tested on macOS and Linux. Teams programming in C++/Java should be able to develop using these systems, using a Windows system for the Windows-only operations such as Driver Station, radio programming, and roboRIO imaging.
es_mx: Dicho esto, muchas de las herramientas para programar en C++/Java también son compatibles y fueron probadas en macOS y Linux. Los equipos que programan en C++/Java deben ser capaces de utilizar estos sistemas, usando Windows para las operaciones exclusivas de Windows tales como la Driver Station, programación de radio, y la imagen de la roboRIO.
fr_ca: Ceci dit, beaucoup d'outils relatifs à la programmation C++/Java sont aussi pris en charge et testés sous macOS et Linux. Les équipes qui programment en C++/Java devraient pouvoir développer en utilisant ces outils, en utilisant un système Windows pour les opérations Windows uniquement telles que l'application Driver Station, la programmation de la radio et l'installation de l'image du roboRIO.
tr_tr: Bununla birlikte, C++ / Java programlama araçlarının çoğu, macOS ve Linux'ta da test edilmiştir ve desteklenmektedir. C++ / Java'da programlama ekipleri, Driver Station, radyo programlama ve roboRIO görüntüleme gibi yalnızca Windows'ta gerçekleştirilen işlemler için bir Windows sistemi kullanmanız gerekecektir.

source: LabVIEW FRC (Windows Only)
es_mx: LabVIEW FRC (Sólo para Windows)
fr_ca: LabVIEW FRC (Windows seulement)
tr_tr: LabVIEW FRC (Sadece Windows'ta)

source: LabVIEW FRC, based on NI’s LabVIEW 2019, is the development environment for LabVIEW, one of the three officially supported languages for programming an FRC robot. LabVIEW is a graphical, dataflow-driven language. LabVIEW programs consist of a collection of icons, called VIs, wired together with wires which pass data between the VIs. The LabVIEW FRC installer is distributed on a DVD found in the Kickoff Kit of Parts and is also available for download (see installation instructions page linked below). Instructions for installing the FRC libraries (package also includes Driver Station and Utilities) can be found :ref:`here <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. A guide to getting started with the LabVIEW FRC software, including installation instructions can be found :ref:`here <docs/getting-started/getting-started-frc-control-system/labview-setup:Installing LabVIEW for FRC (LabVIEW only)>`.
es_mx: LabVIEW para FRC, basada en NI’s LabVIEW 2019, es el entorno de desarrollo para LabVIEW, uno de los tres lenguajes de programación compatibles oficiales para un robot de FRC. LabVIEW es un lenguaje gráfico, impulsado por el flujo de datos. Los programas de LabVIEW consisten en una colección de íconos, llamados VIs, cableados junto con cables que pasan datos entre ellos. El instalador de LabVIEW para FRC es distribuido en un DVD que encuentras en el Kit de Partes entregado en el Kickoff, y también está disponible para descargarse (vea las instrucciones de instalación en la página vinculada a continuación). Las instrucciones para instalar las bibliotecas de FRC (el paquete también incluye Driver Station y Utilidades) pueden ser encontradas :ref:`aquí<docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. Una guía para empezar con el software LabVIEW para FRC, que incluye instrucciones de instalación puede encontrarla :ref:`aquí<docs/getting-started/getting-started-frc-control-system/labview-setup:Installing LabVIEW for FRC (LabVIEW only)>`.
fr_ca: LabVIEW FRC, basé sur LabVIEW 2019 de NI, est l'environnement de développement de LabVIEW, l'un des trois langages officiellement pris en charge pour la programmation d'un robot FRC. LabVIEW est un langage graphique piloté par flux de données. Les programmes LabVIEW consistent en un ensemble d'icônes, représentant des instruments virtuels ou VIs, liées entre eux par des connecteurs ou fils qui transmettent des données entre les VIs. Le programme d'installation de LabVIEW FRC est distribué sur un DVD inclus dans le kit de pièces de lancement mais est également disponible en téléchargement (voir le lien vers la page d'instructions d'installation, ci-dessous). Les instructions d'installation des bibliothèques FRC (le package comprend également la Driver Station et des utilitaires) peuvent être trouvées :ref:`ici <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. Un guide d'initiation au logiciel LabVIEW FRC, y compris les instructions d'installation, peut être trouvé :ref:`ici <docs/getting-started/getting-started-frc-control-system/labview-setup:Installing LabVIEW for FRC (LabVIEW only)>`.
tr_tr: NI'ın LabVIEW 2019'unu temel alan LabVIEW FRC, bir FRC robotu programlamak için resmi olarak desteklenen üç dilden biridir. LabVIEW grafiksel, veri akışı odaklı bir dildir. LabVIEW programları, VI adı verilen simgeler koleksiyonlarından ve bu VI'lar arasında veri ileten bağlantılardan oluşur. LabVIEW FRC yükleyici, Kickoff Parça Kitinde bulunan bir DVD'de dağıtılır ayrıca internetten de indirilebilir (aşağıda bağlantısı verilen kurulum talimatları sayfasına bakın). FRC kitaplıklarını kurma talimatları (paket Driver Station ve Utilities uygulamalarıını da içerir) şurada bulunmaktadır: :ref:`here <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. Kurulum talimatları da dahil olmak üzere LabVIEW FRC yazılımına başlarken kullanılabilecek bir diğer kılavuz şurada bulunmaktadır: :ref:`burada<docs/getting-started/getting-started-frc-control-system/labview-setup:Installing LabVIEW for FRC (LabVIEW only)>`.

source: FRC Robot Simulator (Windows Only)
es_mx: Simulador de Robot para FRC (Sólo para Windows)
fr_ca: Simulateur de Robot FRC (Windows Seulement)
tr_tr: FRC Robot Simülatörü (Yalnızca Windows için)

source: The FRC Robot Simulator is a component of the LabVIEW programming environment that allows you to operate a predefined robot in a simulated environment to test code and/or Driver Station functions. It utilizes a LabVIEW code project as the robot code and communicates with the FRC Driver Station for robot control and the FRC Default Dashboard for robot feedback. The FRC Robot Simulator is installed with the LabVIEW FRC package. Information on using the FRC Robot Simulator can be found by opening the Robot Simulation Readme.html file in the LabVIEW Project Explorer.
es_mx: El Simulador de Robot para FRC es un componente de programación de LabVIEW que permite operar un robot predefinido en un entorno de simulación para probar el código y/o las funciones de la Driver Station. Utiliza un proyecto de código en LabVIEW, así como el código del robot, y se comunica con la Driver Station de FRC para el control del robot y con el Tablero Predeterminado de FRC para una retroalimentación. El Simulador del Robot es instalado con el paquete de LabVIEW para FRC. La información sobre el uso del Simulador del Robot para FRC la puede encontrar abriendo el archivo Robot Simulation Readme.html en el Explorador de Proyectos de LabVIEW.
fr_ca: Le Simulateur de Robot FRC est un composant de l'environnement de développement LabVIEW qui vous permet de faire fonctionner un robot prédéfini dans un environnement simulé pour tester du code ou des fonctions de la Driver Station. Il utilise un projet codé en LabVIEW comme code de robot et communique avec la Driver Station pour le contrôle du robot et avec le Dashboard par défaut FRC pour l'affichage des informations du robot. Le Simulateur de Robot FRC est installé avec le package LabVIEW FRC. On peut obtenir plus d'informations sur l'utilisation du Simulateur de Robot FRC en ouvrant le fichier Readme.html du Simulation de Robot dans l'explorateur de projets LabVIEW.
tr_tr: FRC Robot Simülatörü, yazılım ve/veya Driver Station işlevlerini test etmek için simüle edilmiş bir ortamda önceden tanımlanmış bir robotu çalıştırmanıza olanak tanıyan LabVIEW programlama ortamının bir bileşenidir. Robot kodu olarak bir LabVIEW yazlım projesi kullanır ve robot kontrolü için FRC Driver Station, robot geri bildirimi için FRC Varsayılan Dashboard-gösterge tablosu ile iletişim kurar. FRC Robot Simülatörü, LabVIEW FRC paketiyle birlikte yüklenir. FRC Robot Simülatörünün kullanımına ilişkin bilgiler, LabVIEW Project Explorer içerisinden Robot Simulation Readme.html dosyasını açarak ulaşılabilir.

source: Visual Studio Code
es_mx: Código en Visual Studio

source: Visual Studio Code is the supported development environment for C++ and Java, two of the three supported languages used for programming an FRC robot. Both are object-oriented text based programming languages. A program in C++ (for FRC) consists of a number of header (.h) and implementation (.cpp) files where as a program in Java consists of .java files contained in one or more packages. A guide to getting started with C++ for FRC, including the installation and configuration of Visual Studio Code can be found :doc:`here <offline-installation-preparations>`.
es_mx: El código en Visual Studio es el entorno de desarrollo compatible para C++ y Java, dos de los tres lenguajes de programación utilizados en un robot de FRC. Ambos son códigos de programación orientada a objetos. Un programa en C++ (para FRC) consiste en un número de encabezado (.h) y archivos de implementación (.cpp) donde como en un programa en Java consiste en archivos .java contenidos en uno o más paquetes. Una guía de empezando con C++ para FRC, incluyendo la instalación y configuración de un Código en Visual Studio la puede encontrar :doc:`aquí<offline-installation-preparations>`.

source: FRC Driver Station Powered by NI LabVIEW (Windows Only)
es_mx: Driver Station de FRC Motorizada por NI LabVIEW (Exclusiva para Windows)
fr_ca: FRC Driver Station par NI LabVIEW (Windows seulement)
tr_tr: FRC Driver Station - FRC Sürücü İstasyonu Powered by NI LabVIEW (Sadece Windows'da)

source: The FRC Driver Station Powered by NI LabVIEW is the only software allowed to be used for the purpose of controlling the state of the robot during competition. This software contains the code necessary to send data to your robot from a variety of input devices such as joysticks, gamepads, and customizable IO boards. It also contains a number of tools used to help troubleshoot robot issues such as status indicators and log file creation. Instructions for installing the FRC Driver Station Powered by NI LabVIEW (included in the FRC Game Tools can be found :ref:`here <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. More information about the FRC Driver Station Powered by NI LabVIEW can be found :ref:`here <docs/software/driverstation/driver-station:FRC Driver Station Powered by NI LabVIEW>`.
es_mx: La Driver Station de FRC motorizada por NI LabVIEW es es único software permitido para usarse con el propósito de controlar el estado del robot durante la competencia. Este software contiene el código necesario para mandar datos al robot desde una variedad de dispositivos de entrada como palancas, controles, y tableros IO personalizados. También contiene un número de herramientas para ayudar a resolver problemas del robot, como indicadores de estado y creación de archivos de registro. Las instrucciones de instalación de la Driver Station para FRC motorizada por NI LabVIEW (incluida en las Herramientas de Juego de FRC puede ser encontrada :ref:`aquí<docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. Puede encontrar más información acerca de la Driver Station motorizada por NI LabVIEW :ref:`aquí<docs/software/driverstation/driver-station:FRC Driver Station Powered by NI LabVIEW>`.
fr_ca: Le logiciel FRC Driver Station optimisé par NI LabVIEW est le seul logiciel autorisé à être utilisé pour le contrôle de l'état du robot en compétition. Ce logiciel contient le code nécessaire pour envoyer des données à votre robot à partir d'une variété de périphériques d'entrée tels que des joysticks, des manettes de jeu et des cartes d'E/S personnalisables. Il contient aussi un certain nombre d'outils utilisés pour aider à résoudre les problèmes d'un robot, tels que les indicateurs d'état et la création de fichiers journaux. Les instructions pour l'installation de l'application FRC Driver Station optimisée par NI LabVIEW (inclus dans FRC Game Tools) peuvent être trouvées :ref:`ici <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. D'autres informations à propos de l'application FRC Driver Station optimisée par NI LabVIEW peuvent être trouvées :ref:`ici <docs/software/driverstation/driver-station:FRC Driver Station Powered by NI LabVIEW>`.
tr_tr: NI LabVIEW tarafından güçlendirilen FRC Sürücü İstasyonu, yarışma sırasında robotunuzu kontrol etmek amacıyla kullanılmasına izin verilen tek yazılımdır. Bu yazılım, oyun çubukları-joystick, oyun kumandaları-gamepad ve özelleştirilebilir IO kartları gibi çeşitli giriş cihazlarından robotunuza veri göndermek için gerekli kodu içerir. Ayrıca, durum göstergeleri ve günlük-log dosyası oluşturma gibi robot sorunlarını gidermeye yardımcı olmak için kullanılan bir dizi araç içerir. NI LabVIEW tarafından güçlendirilen FRC Driver Station kurma talimatları (FRC Oyun Araçlarında bulunur: ref:`burada <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. NI LabVIEW Tarafından Desteklenen FRC Sürücü İstasyonu hakkında daha fazla bilgi :ref:`burada <docs/software/driverstation/driver-station:FRC Driver Station Powered by NI LabVIEW>`bulunabilir.

source: FRC LabVIEW Dashboard (Windows Only)
es_mx: Tablero de LabVIEW para FRC (Sólo para Windows)
fr_ca: Dashboard FRC LabVIEW (Windows Seulement)
tr_tr: FRC LabVIEW Dashboard-Gösterge Ekranı (Sadece Windows'da)

source: The FRC LabVIEW Dashboard is the default dashboard program installed with, and automatically launched by, the FRC Driver Station. The purpose of the Dashboard is to provide feedback about the operation of the robot. The FRC Default Dashboard serves as a an example of the types of feedback teams may want from their robot. It includes a tabbed display that can switch between viewing an image from a camera on the robot or a display of NetworkTables variables, a display of information regarding the joysticks and drive motors, an indicator of the robot IP and battery voltage, and a second tabbed display that can switch between examples of custom indicators and controls, a test tab for use with the Driver Station Test Mode and a Checklist tab that teams can use to enter a custom checklist to complete before each match. The FRC Default Dashboard is included in the FRC Game Tools. Installation instructions can be found :ref:`here <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. More information about the FRC Default Dashboard software can be found :ref:`here <docs/software/driverstation/driver-station-labview-dashboard:FRC Driver Station LabVIEW Dashboard>`.
es_mx: El Tablero de LabVIEW para FRC es el programa predeterminado, instalado y automáticamente lanzado por la Driver Station para FRC. El propósito de este Tablero es proporcionar una retroalimentación del funcionamiento del robot. El Tablero Predeterminado para FRC sirve como un ejemplo de los distintos tipos de comentarios que los equipos puedan querer para su robot. Incluye una pantalla con pestañas que pueden cambiar entre ver una imagen desde una cámara en el robot o en un dispositivo de NetworkTables, una pantalla de información sobre las palancas y motores de accionamiento, un indicador del IP del robot y el voltaje de la batería, y una segunda pantalla con pestañas que puede cambiar entre ejemplos de indicadores y controles, una pestaña de prueba para usarla con la Driver Station en Modo de Prueba y una pestaña de Lista de Verificación que los equipos pueden usar para ingresar a una lista de verificación personalizada para completarla antes de cada partida. El Tablero Predeterminado de FRC está incluido en las Herramientas de Juego. Las instrucciones de su instalación pueden ser encontradas :ref:`aquí<docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. Más información sobre el software del Tablero Predeterminado de FRC puede ser encontrada :ref:`aquí<docs/software/driverstation/driver-station-labview-dashboard:FRC Driver Station LabVIEW Dashboard>`.
fr_ca: L'application FRC LabVIEW Dashboard est le tableau de bord part défaut installé avec et lancé automatiquement par l'application FRC Driver Station. L'objectif du Dashboard est de fournir de l'information sur le fonctionnement du robot. Le Dashboard par défaut sert d'exemple du type d'informations que les équipes pourraient vouloir recevoir de leur robot. Il inclut un affichage tabulé qui peut alterner entre la visualisation d'une image à partir d'une caméra installée sur le robot ou un affichage des variables NetworkTable, un affichage d'informations relatives aux joysticks et aux moteurs de déplacement, un indicateur de l'adresse IP du robot et de la tension de la batterie, un deuxième affichage tabulé qui peut changer entre les indicateurs personnalisés et les contrôles, un onglet de test à utiliser avec le mode Test de la Driver Station et un onglet contenant une liste de contrôle que les équipes peuvent utiliser pour créer une liste personnalisée à compléter avant chaque match. Le Dashboard FRC par défaut est intégré dans les ouitils de jeu FRC ou FRC Game Tools. Les instructions d'installation peuvent être trouvées :ref:`ici <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. D'autres informations à propos du Dashboard FRC par défaut peuvent être trouvées :ref:`ici <docs/software/driverstation/driver-station-labview-dashboard:FRC Driver Station LabVIEW Dashboard>`.
tr_tr: FRC LabVIEW Dashboard, FRC Driver Station ile birlikte yüklenen ve otomatik olarak başlatılan varsayılan gösterge tablosu programıdır. Dashboard'un amacı, robotun çalışması hakkında geri bildirim sağlamaktır. FRC Default Dashboard, ekiplerin robotlarından isteyebilecekleri geri bildirim türlerine bir örnek niteliğinde çalışır. Robot üzerindeki bir kameradan bir görüntüyü almak veya NetworkTables değişkenlerini görüntülemek arasında geçiş yapabilen sekmeli bir ekran, joystick ve sürücü motorlarına ilişkin bilgi ekranı, robot IP'si ve pil voltajı göstergesi ve ikinci bir sekmeli ekran içerir. Bu ikinci sekmeli ekran, İsteğe özel uyarlanmış göstergeler ve kontroller sekmesi ile Driver Station Test Modu'yla kullanım için bir test sekmesi ve takımların her maçtan önce tamamlamak üzere özel bir son kontrol listesi girmek için kullanabileceği bir Kontrol Listesi sekmesi arasında geçiş yapabilmektedir. FRC Default Dashboard, FRC Oyun Araçlarına dahildir. Kurulum talimatları şuradan bulunabilir :ref:`burada <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`. FRC Default Dashboard yazılımı hakkında daha fazla bilgi şuradan bulunabilir: :ref:`burada <docs/software/driverstation/driver-station-labview-dashboard:FRC Driver Station LabVIEW Dashboard>`.

source: SmartDashboard
es_mx: Tablero Inteligente
