Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/control-system-hardware.po
Languages: es_mx, pt, tr_tr

source: Other battery part numbers may be legal, consult the `FRC Manual <https://www.firstinspires.org/resource-library/frc/competition-manual-qa-system>`__ for a complete list.
es_mx: Otras baterías pueden ser legales, consulte el `FRC Manual <https://www.firstinspires.org/resource-library/frc/competition-manual-qa-system>`__ para la lista completa.
tr_tr: Diğer akü model numaraları da yasal olabilir, tam bir liste için `FRC Kılavuzu <https://www.firstinspires.org/resource-library/frc/competition-manual-qa-system>`__ 'na bakın.

source: Image Credits
es_mx: Créditos de Imágenes
pt: Créditos de Imagem
tr_tr: Gösel Atıflar

source: Image of roboRIO courtesy of National Instruments. Image of DMC-60 courtesy of Digilent. Image of SD540 courtesy of Mindsensors. Images of Jaguar Motor Controller, Talon SRX, Victor 888, Victor SP, Victor SPX, and Spike H-Bridge Relay courtesy of VEX Robotics, Inc. Image of SPARK MAX courtesy of REV Robotics. Lifecam, PDP, PCM, SPARK, and VRM photos courtesy of *FIRST*\ |reg|. All other photos courtesy of AndyMark Inc.
es_mx: Imagen de roboRIO cortesía de National Instruments. Imagen de DMC-60 cortesía de Digilent. Imagen de SD540 cortesía de Mindsensors. Imagenes de Jaguar Motor Controller, Talon SRX, Victor 888, Victor SP, Victor SPX, and Spike H-Bridge Relay cortesía de VEX Robotics, Inc. Imagen de SPARK MAX cortesía de REV Robotics. Fotos de Lifecam, PDP, PCM, SPARK, y VRM son cortesía de FIRST®. Todas las demás fotos son cortesía de AndyMark Inc.
tr_tr: RoboRIO resmi National Instruments tarafından sağlanmıştır. DMC-60 resmi Digilent tarafından sağlanmıştır. SD540 resmi Mindsensors tarafından sağlanmıştır. Jaguar Motor Controller, Talon SRX, Victor 888, Victor SP, Victor SPX ve Spike H-Bridge Relay resimleri VEX Robotics, Inc. tarafından sağlanmıştır SPARK MAX görüntüsü REV Robotics tarafından sağlanmıştır. Lifecam, PDP, PCM, SPARK ve VRM fotoğrafları *FIRST* \ | reg | izniyle. Diğer tüm fotoğraflar AndyMark Inc.'in izniyle kullanılmıştır.
