Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/control-system-software.po
Languages: es_mx, fr_ca, tr_tr

source: To connect to your robot, open OutlineViewer and set the “Server Location” to be your team number. After you click start, OutlineViewer will connect.
es_mx: Para conectarse a su robot, abra el Visor de esquema y configure la “Localización del Servidor” para que sea el número de su equipo. Después de darle clic en empezar, el Visor de esquema se conectará.
fr_ca: Pour connecter OutlineViewer à votre robot, ouvrez OutlineViewer et configurez le "Server Location" avec votre numéro d'équipe comme valeur. Ensuite, cliquez sur Start, OutlineViewer se connectera.
tr_tr: Robotunuza bağlanmak için OutlineViewer'ı açın ve “Server Location” nı takım numaranız olacak şekilde ayarlayın. Start'a tıkladıktan sonra OutlineViewer bağlanacaktır.

source: LabVIEW teams can use the Variables tab of the LabVIEW Dashboard to accomplish this functionality.
es_mx: Los equipos LabVIEW pueden usar la pestaña de Variables del Tablero de LabVIEW para lograr esta funcionalidad.
fr_ca: Les équipes LabVIEW peuvent utiliser l'onglet Variables du Dashboard LabVIEW pour accomplir cette fonctionnalité.
tr_tr: LabVIEW takımları, bu işlevi gerçekleştirmek için LabVIEW Dashboard'un Variables sekmesini kullanabilir.

source: FRC Radio Configuration Utility (Windows Only)
es_mx: Utilidad de Configuración de Red para FRC (Sólo para Windows)
fr_ca: Utilitaire de Configuration de Radio FRC (Windows Seulement)
tr_tr: FRC Radyo Configuration Utility Yardımcı Programı (Yalnızca Windows)

source: The FRC Radio Configuration Utility is a tool used to configure the the OpenMesh OM5P-AN or OM5P-AC radio for practice use at home. This tool sets the appropriate IP, and network settings for proper network connection, as well as the QOS settings required to mimic the bandwidth limiting and packet prioritization experience on the FRC playing field. The FRC Radio Configuration Utility is installed by a standalone installer, instructions on installing and using the FRC Radio Configuration Utility to configure your radio can be found :ref:`here <docs/getting-started/getting-started-frc-control-system/radio-programming:Programming your Radio>`.
es_mx: La Utilidad de Configuración de Radio para FRC es un herramienta usada para configurar el radio OpenMesh OM5P-AN o OM5P-AC para practicar su uso en casa. Esta herramienta establece el IP apropiado y los ajustes de red para una buena conexión, así como los ajustes de QOS requeridos para imitar la experiencia de limitación de banda y priorización de paquetes en el campo de juegos de FRC. La Utilidad de Configuración de Radio para FRC es instalada por un instalador autónomo, las instrucciones de instalación y de cómo usar la Utilidad de Configuración de Radio para FRC las encuentra :ref:`aquí <docs/getting-started/getting-started-frc-control-system/radio-programming:Programming your Radio>`.
fr_ca: L'utilitaire de configuration de radio FRC est un outil utilisé pour configurer le radio OpenMesh OM5P-AN ou OM5P-AC pour utilisation pratique à la maison. Cet outil définit l'IP appropriée, et les paramètres réseau pour une bonne connexion réseau, ainsi que les paramètres QOS nécessaires pour imiter l'expérience de limitation de la bande passante et la priorisation des paquets sur le terrain de compétition FRC. L'utilitaire de configuration de radio FRC est installé par un installateur autonome. Les instructions pour l'installation et l'usage de l'utilitaire de configuration de radio FRC afin de configurer votre radio peuvent être trouvées :ref:`ici <docs/getting-started/getting-started-frc-control-system/radio-programming:Programming your Radio>`.
tr_tr: FRC Radio Configuration Utility Yardımcı Programı, OpenMesh OM5P-AN veya OM5P-AC erişim noktası cihazını evde pratik kullanım için yapılandırmada kullanılan bir araçtır. Bu araç, uygun ağ bağlantısı için uygun IP ve ağ ayarlarını ayrıca FRC oyun alanında bant genişliği sınırlama ve paket önceliklendirme deneyimini taklit etmek için gereken QOS ayarlarını belirler. FRC Radio Configuration Tool bağımsız bir dosya ile kurulur, erişim noktası cihazını yapılandırmak için FRC Radio Configuration Utility Yardımcı Programını kurma ve kullanma talimatları bulunabilir :ref:`burada <docs/getting-started/getting-started-frc-control-system/radio-programming:Programming your Radio>`.

source: Visual Studio Code is the supported development environment for C++ and Java, two of the three supported languages used for programming an FRC robot. Both are object-oriented text based programming languages. A program in C++ (for FRC) consists of a number of header (.h) and implementation (.cpp) files where as a program in Java consists of ``.java`` files contained in one or more packages. A guide to getting started with C++ for FRC, including the installation and configuration of Visual Studio Code can be found :doc:`here <offline-installation-preparations>`.
fr_ca: Visual Studio Code est l’environnement de développement pris en charge pour C++ et Java, deux des trois langages pris en charge utilisés pour la programmation d’un robot FRC. Les deux sont des langages de programmation orientée objet. Un programme en C++ (pour FRC) se compose d’un certain nombre de fichiers d’en-tête (.h) et d’implémentation (.cpp) où, en tant que programme en Java, il se compose de fichiers ``.java`` contenus dans un ou plusieurs packages. Vous trouverez :doc:`ici<offline-installation-preparations>` un guide d'initiation à la programmation en C++ pour FRC, y compris la procédure d’installation et de configuration de Visual Studio Code.
tr_tr: Visual Studio Code, bir FRC robotunu programlamak için desteklenen üç dilden ikisi olan C ++ ve Java için desteklenen geliştirme ortamıdır. Her ikisi de nesne-yönelimli metin tabanlı programlama dilleridir. C ++ (FRC için) bir program, bir dizi başlık (.h) ve uygulama (.cpp) dosyalarından oluşur; burada Java'daki bir program, bir veya daha fazla pakette bulunan ``.java`` dosyalarından oluşur. Visual Studio Code'un yüklenmesi ve yapılandırılması dahil FRC için C ++ kullanmaya başlama kılavuzu şu adresten bulunabilir: :doc:`burada <offline-installation-preparations>`.

source: OutlineViewer is a utility used to view, modify and add to the contents of the NetworkTables for debugging purposes. It displays all key value pairs currently in the NetworkTables and can be used to modify the value of existing keys or add new keys to the table. OutlineViewer is included in the C++ and Java language updates (found in ``\tools\wpilib``). Teams may need to install the Java Runtime Environment to use the OutlineViewer on computers not set up for Java programming.
fr_ca: OutlineViewer est un utilitaire utilisé pour afficher, modifier et ajouter au contenu des NetworkTables à des fins de débogage. Il affiche toutes les paires valeurs et clés associées actuellement dans les NetworkTables et peut être utilisé pour modifier la valeur des clés existantes ou ajouter de nouvelles clés à la table. OutlineViewer est intégré dans les mises à jour en langage C++ et Java (localisées dans ``\tools\wpilib``). Les équipes devront installer l’environnement d’exécution Java afin d'utiliser le OutlineViewer sur les ordinateurs qui ne sont pas configurés pour la programmation en Java.
tr_tr: OutlineViewer, hata ayıklama amacıyla Ağ Tablolarının içeriğini görüntülemek, değiştirmek ve bunlara eklemek için kullanılan bir yardımcı programdır. Şu anda Ağ Tablolarında bulunan tüm anahtar değer çiftlerini görüntüler ve mevcut anahtarların değerini değiştirmek veya tabloya yeni anahtarlar eklemek için kullanılabilir. OutlineViewer, C ++ ve Java dili güncellemelerine dahildir (``\tools\wpilib`` konumunda bulunur). Ekiplerin, OutlineViewer'ı Java programlaması için ayarlanmamış bilgisayarlarda kullanmak için Java Runtime Environment yazılımını yüklemeleri gerekebilir.
