Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/control-system-hardware.po
Languages: es_mx, pt, tr_tr

source: The Talon SRX motor controller is a CAN-enabled “smart motor controller” from Cross The Road Electronics/VEX Robotics. The Talon SRX has an electrically isolated metal housing for heat dissipation, making the use of a fan optional. The Talon SRX can be controlled over the CAN bus or PWM interface. When using the CAN bus control, this device can take inputs from limit switches and potentiometers, encoders, or similar sensors in order to perform advanced control such as limiting or PID(F) closed loop control on the device. For more information see the `Talon SRX User Manual <https://www.ctr-electronics.com/talon-srx.html>`__.
es_mx: El controlador de motor Talon SRX es un “controlador de motor inteligente” habilitado por CAN de Cross The Road Electronics/ VEX Robotics. El Talon SRX tiene una carcasa de metal aislada eléctricamente para la disipación del calor, haciendo opcional el uso de un ventilador. El Talon SRX puede ser controlado a través de la interfaz de CAN o PWM. Cuando se usa el control de bus CAN, este dispositivo puede aceptar entradas desde interruptores de límite, potenciómetros, encoders, o sensores similares para realizar un control avanzado como la limitación del control de ciclo cerrado PID(F) en el dispositivo. Para más información vea el `Manual de Usuario Talon SRX <https://www.ctr-electronics.com/talon-srx.html>`__.
tr_tr: Talon SRX motor kontrolörü, Cross The Road Electronics / VEX Robotics'ten CAN özellikli bir "akıllı motor kontrolörü" dür. Talon SRX, ısı dağıtımı için elektriksel olarak izole edilmiş metal bir muhafazaya sahiptir, bu da isteğe bağlı bir fan kullanımını sağlar. Talon SRX, CAN veriyolu veya PWM arayüzü üzerinden kontrol edilebilir. CAN veri yolu kontrolünü kullanırken, bu cihaz, cihaz üzerinde sınırlama veya PID(F) kapalı döngü kontrolü gibi gelişmiş kontroller gerçekleştirmek için limit anahtarlarından ve potansiyometrelerden, kodlayıcılardan veya benzer sensörlerden giriş alabilir. Daha fazla bilgi için bkz. `Talon SRX Kullanım Kılavuzu <https://www.ctr-electronics.com/talon-srx.html>`__.

source: CAN Talon SRX has been removed from WPILib. See this `blog <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ for more info and find the CTRE Toolsuite installer `here <https://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__.
es_mx: Los CAN Talon SRX han sido removidos de WPILib. Vea este `blog <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ para más infprmación y encuentre el Instalador de Toolsuite CTRE `aquí <https://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__.
tr_tr: CAN Talon SRX, WPILib'den kaldırıldı. Daha fazla bilgi için bu `bloga <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ bakın ve CTRE Toolsuite yükleyicisini inceleyin `burada <https://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__.

source: Victor 888 Motor Controller / Victor 884 Motor Controller
es_mx: Controlador de Motor Victor 888/ Controlador de Motor Victor 884
pt: Controladores de Motor Victor 888 / Victor 884
tr_tr: Victor 888 Moto Controller / Victor 884 Motor Kontrolörü

source: The Victor 888 Motor Controller from VEX Robotics is a variable speed motor controller for use in FRC. The Victor 888 replaces the Victor 884, which is also usable in FRC. The Victor is controlled over the PWM interface. The Victor should be connected to a PWM output of the roboRIO and powered from the Power Distribution Panel. For more information, see the `Victor 884 User Manual <https://content.vexrobotics.com/docs/ifi-v884-users-manual-9-25-06.pdf>`__ and `Victor 888 User Manual <https://content.vexrobotics.com/docs/217-2769-Victor888UserManual.pdf>`__.
es_mx: El Controlador de Motor Victor 888 de VEX Robotics es un controlador de motor de velocidad variable que se usa en FRC. El Victor 888 remplaza a Victor 884, el cual también se usa en FRC. El Victor es controlado a través de la interfaz PWM, El Victor debe conectarse a salidas PWM de la roboRIO y debe ser alimentado desde el Panel de Distribución de Corriente. Para más información, vea el `Manual de Usuario Victor 884 <https://content.vexrobotics.com/docs/ifi-v884-users-manual-9-25-06.pdf>`__ y `Manual de Usuario Victor 888<https://content.vexrobotics.com/docs/217-2769-Victor888UserManual.pdf>`__.
tr_tr: VEX Robotics'in Victor 888 Motor Kontrolörü, FRC'de kullanım için değişken hızlı bir motor kontrolörüdür. Victor 888, FRC'de de kullanılabilen Victor 884'ün yerini alıyor. Victor, PWM arayüzü üzerinden kontrol edilir. Victor, roboRIO'nun bir PWM çıkışına bağlanmalı ve Power Distribution Panelinden beslenmelidir. Daha fazla bilgi için, bkz. `Victor 884 Kullanım Kılavuzu <https://content.vexrobotics.com/docs/ifi-v884-users-manual-9-25-06.pdf>`__ ve `Victor 888 Kullanım Kılavuzu <https : //content.vexrobotics.com/docs/217-2769-Victor888UserManual.pdf>`__.

source: Victor SP
tr_tr: Victor SP Motor Kontrolörü

source: The Victor SP motor controller is a PWM motor controller from Cross The Road Electronics/VEX Robotics. The Victor SP has an electrically isolated metal housing for heat dissipation, making the use of the fan optional. The case is sealed to prevent debris from entering the controller. The controller is approximately half the size of previous models.
es_mx: El controlador del motor Victor SP es un controlador de motor PWM de Cross The Road Electronics/VEX Robotics. El Victor SP tiene una carcasa de metal aislada eléctricamente para la disipación de calor, haciendo opcional el uso de un ventilador. La caja está sellada para evitar que los escombros entren al controlador. El controlador es aproximadamente la mitad del tamaño de los modelos anteriores.
tr_tr: Victor SP motor kontrolörü, Cross The Road Electronics / VEX Robotics'in bir PWM motor kontrolörüdür. Victor SP, ısı dağıtımı için elektriksel olarak izole edilmiş metal bir muhafazaya sahiptir, bu da fan kullanımını isteğe bağlı kılar. Muhafaza, toz yada metal tozlarının kontrolöre girmesini önlemek için kapatılmıştır. Denetleyici, önceki modellerin yaklaşık yarısı boyutundadır.

source: Victor SPX
tr_tr: Victor SPX Motor Kontrolörü

source: The Victor SPX motor controller is a CAN or PWM controlled motor controller from Cross The Road Electronics/VEX Robotics. The device is connectorized to allow easy connection to the roboRIO PWM connectors or a CAN bus chain. When controlled over the CAN bus, the device has a number of the closed loop features also present in the Talon SRX. The case is sealed to prevent debris from entering the controller. For more information, see the `Victor SPX Webpage <https://www.vexrobotics.com/217-9191.html>`__.
es_mx: El controlador del motor Victor SPX es controlado por CAN o PWM de Cross The Road Electronics/VEX Robotics. Este dispositivo está conectorizado para permitir la sencilla conexión a los conectores PWM de la roboRIO o una cadena de bus CAN. Cuando es controlado a través del bus CAN, el dispositivo tiene una serie de características también presentes en el Talon SRX. La caja está sellada para prevenir que escombros entren al controlador. Para más información entre a la `Página web de Victor SPX <https://www.vexrobotics.com/217-9191.html>`__.
tr_tr: Victor SPX motor kontrolörü, Cross The Road Electronics / VEX Robotics'ten CAN veya PWM kontrollü bir motor kontrolörüdür. Cihaz, roboRIO PWM konektörlerine veya bir CAN veri yolu zincirine kolay bağlantı sağlamak için tasarlanmıştır. CAN veriyolu üzerinden kontrol edildiğinde, cihaz Talon SRX'te de bulunan bir dizi kapalı döngü özelliğine sahiptir. Muhafaza, pisliklerin kontrolöre girmesini önlemek için kapatılmıştır. Daha fazla bilgi için, bkz. `Victor SPX Web Sayfası <https://www.vexrobotics.com/217-9191.html>`__.

source: Victor SPX CAN control is not supported from WPILib. See `this blog <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ for more info and find the CTRE Toolsuite installer `here <https://www.ctr-electronics.com/control-system/hro.html#product_tabs_technical_resources>`__.
es_mx: El control de Victor SPX CAN no es apoyado por WPILib. Vea `este blog <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ para más información y encuentre el instalador de Toolsuite CTRE `aquí<https://www.ctr-electronics.com/control-system/hro.html#product_tabs_technical_resources>`__.
tr_tr: Victor SPX CAN kontrolü, WPILib tarafından desteklenmemektedir. Daha fazla bilgi için buradaki`bloga <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ bakınız ve CTRE Toolsuite kurulun aracı için `buraya <https://www.ctr-electronics.com/control-system/hro.html#product_tabs_technical_resources>`__ bakınız.

source: Spike H-Bridge Relay
pt: Relé Spike H-Bridge
tr_tr: Spike H-Bridge Röle

source: The Spike H-Bridge Relay from VEX Robotics is a device used for controlling power to motors or other custom robot electronics. When connected to a motor, the Spike provides On/Off control in both the forward and reverse directions. The Spike outputs are independently controlled so it can also be used to provide power to up to 2 custom electronic circuits. The Spike H-Bridge Relay should be connected to a relay output of the roboRIO and powered from the Power Distribution Panel. For more information, see the `Spike User’s Guide <https://content.vexrobotics.com/docs/spike-blue-guide-sep05.pdf>`__.
es_mx: El Spike H-Bridge Relay de VEX Robotics es un dispositivo utilizado para controlar la corriente de los motores u otra electrónica personalizada del robot. Cuando se conecta a un motor, el Spike brinda un control On/Off en ambas direcciones, adelante y en reversa. Las salidas del Spike son controladas independientemente para que también puedan usarse para proporcionar energía hasta a 2 circuitos eléctricos personalizados. El Spike H-Bridge Relay debe conectarse a una salida de la roboRIO alimentada del Panel de Distribución de Corriente. Para más información, vea la `Guía de Usuario Spike <https://content.vexrobotics.com/docs/spike-blue-guide-sep05.pdf>`__.
tr_tr: VEX Robotics'in Spike H-Bridge Rölesi, motorlara veya diğer özel robot elektronik cihazlarına giden gücü kontrol etmek için kullanılan bir cihazdır. Bir motora bağlandığında, Spike hem ileri hem de geri yönlerde Açma / Kapama kontrolü sağlar. Spike çıkışları bağımsız olarak kontrol edildiğinden 2 adede kadar özel elektronik devreye güç sağlamak için de kullanılabilir. Spike H-Bridge Rölesi, roboRIO'nun bir röle çıkışına bağlanmalı ve Power Distribution Panel'den beslenmelidir. Daha fazla bilgi için, `Spike Kullanıcı Kılavuzu <https://content.vexrobotics.com/docs/spike-blue-guide-sep05.pdf>`__.

source: Servo Power Module
es_mx: Módulo de Corriente de Servo
tr_tr: Servo Güç Modülü

source: The Servo Power Module from Rev Robotics is capable of expanding the power available to servos beyond what the roboRIO integrated power supply is capable of. The Servo Power Module provides up to 90W of 6V power across 6 channels. All control signals are passed through directly from the roboRIO. For more information, see the `Servo Power Module webpage <https://www.revrobotics.com/rev-11-1144/>`__.
es_mx: El Módulo de Corriente del Servo de REV Robotics es capaz de expandir la energía disponible a los servos más allá de lo que el suministro de energía de la roboRIO es capaz. El Módulo de Energía del Servo brinda hasta 90W de 6V de energía a través de 6 canales. Todas las señales de control se transmiten directamente desde la roboRIO. Para más información, visite la `Página web del Módulo de Corriente del Servo <https://www.revrobotics.com/rev-11-1144/>`__.
tr_tr: Rev Robotics'in Servo Güç Modülü, servolara sağlanan gücü roboRIO entegre güç kaynağının yapabileceğinin ötesinde genişletebilir. Servo Güç Modülü, 6 kanalda 90W'a kadar 6V güç sağlar. Tüm kontrol sinyalleri doğrudan roboRIO'dan geçer. Daha fazla bilgi için, bkz. `Servo Güç Modülü web sayfası <https://www.revrobotics.com/rev-11-1144/>`__.

source: Axis M1013/M1011/206 Ethernet Camera
es_mx: Cámara Axis M1013/M1011/206 con Ethernet
pt: Câmera Ethernet Axis M1013/M1011/206
tr_tr: Axis M1013/M1011/206 Ethernet Kamera

source: The Axis M1013, M1011 and Axis 206 Ethernet cameras are used for capturing images for vision processing and/or sending video back to the Driver Station laptop. The camera should be wired to a 5V power output on the Voltage Regulator Module and an open ethernet port on the robot radio. For more information, see :ref:`Configuring an Axis Camera <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>` and the `Axis 206 <https://www.axis.com/en-us/products/axis-206>`__, `Axis M1011 <https://www.axis.com/en-us/products/axis-m1011>`__, `Axis M1013 pages <https://www.axis.com/en-us/products/axis-m1013>`__.
es_mx: Las cámaras Ethernet Axis M1013, M1011 and Axis 206 son usadas para capturar imágenes para el procesamiento de la visión y/o mandar el vídeo de regreso a la laptop de la Driver Station. La cámara debe conectarse a una salida de 5V en el Módulo Regulador de Voltaje y a un puerto Ethernet disponible en la radio del robot. Para más información, vea las páginas :ref:`Configurando una Cámara Axis <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>` y `Axis 206 <https://www.axis.com/en-us/products/axis-206>`__, `Axis M1011 <https://www.axis.com/en-us/products/axis-m1011>`__, `Axis M1013 pages <https://www.axis.com/en-us/products/axis-m1013>`__.
tr_tr: Axis M1013, M1011 ve Axis 206 Ethernet kameraları, görüntü işleme için görüntü yakalamak ve / veya videoyu Driver Station dizüstü bilgisayarına geri göndermek için kullanılır. Kamera, Voltage Regulator Module'deki 5V güç çıkışına ve robot modeminde boş bir ethernet bağlantı noktasına bağlanmalıdır. Daha fazla bilgi için bakınız: ref:`Configuring an Axis Camera<docs/software/vision-processing/axis-camera/configuration-an-axis-camera:Configuration an Axis Camera>` ve `Axis 206 <https://www.axis.com/en-us/products/axis-206>`__, `Axis M1011 <https://www.axis.com/en-us/products/axis-m1011>`__, `Axis M1013 sayfaları <https://www.axis.com/en-us/products/axis-m1013>`__.

source: The Microsoft Lifecam HD3000 is a USB webcam that can be plugged directly into the roboRIO. The camera is capable of capturing up to 1280x720 video at 30 FPS. For more information about the camera, see the `Microsoft product page <https://www.microsoft.com/accessories/en-us/products/webcams/lifecam-hd-3000/t3h-00011#support>`__. For more information about using the camera with the roboRIO, see the :ref:`Vision Processing <docs/software/vision-processing/index:Vision Processing>` section of this documentation.
es_mx: La Microsoft Lifecam HD3000 es una cámara USB que puede conectarse directamente a la roboRIO. La cámara es capaz de capturar vídeos de hasta 1280x720 a 30fps. Para más información acerca de la cámara, vea la `página de productos Microsoft <https://www.microsoft.com/accessories/en-us/products/webcams/lifecam-hd-3000/t3h-00011#support>`__. Para más información sobre el uso de la cámara con la roboRIO, vea la sección de este documento llamada :ref:`Procesamiento de Visión <docs/software/vision-processing/index:Vision Processing>`
tr_tr: Microsoft Lifecam HD3000, doğrudan roboRIO'ya takılabilen bir USB web kamerasıdır. Kamera, 30 FPS'de 1280x720'ye kadar video çekebilir. Kamera hakkında daha fazla bilgi için, `Microsoft ürün sayfasına <https://www.microsoft.com/accessories/en-us/products/webcams/lifecam-hd-3000/t3h-00011#support>`__ bakın. Kamerayı roboRIO ile kullanma hakkında daha fazla bilgi için, bu dokümantasyonun:ref:`Vision Processing <docs/software/vision-processing/index:Vision Processing>` bölümüne bakın.

source: OpenMesh OM5P-AN or OM5P-AC Radio
es_mx: OpenMesh OM5P-AN o OM5P-AC Radio
pt: OpenMesh OM5P-AN ou Rádio OM5P-AC
tr_tr: OpenMesh OM5P-AN or OM5P-AC Radio-Modem

source: Either the OpenMesh OM5P-AN or OpenMesh OM5P-AC wireless radio is used as the robot radio to provide wireless communication functionality to the robot. The device can be configured as an Access Point for direct connection of a laptop for use at home. It can also be configured as a bridge for use on the field. The robot radio should be powered by one of the 12V/2A outputs on the VRM and connected to the roboRIO controller over Ethernet. For more information, see :ref:`Programming your Radio <docs/getting-started/getting-started-frc-control-system/radio-programming:Programming your Radio>`.
es_mx: Ya sea un OpenMesh OM5P-AN o un OpenMesh OM5P-AC, un radio inalámbrico es usado como el radio del robot para proporcionar funcionalidad de comunicación inalámbrica al robot. El dispositivo puede configurarse como Access Point para conectarse directamente a una laptop para uso en casa. También puede configurarse como un puente para usarse en la cancha. El radio del robot debe ser alimentado por salidas de 12V/2A del VRM y conectarse al controlador de la roboRIO por Ethernet. Para más información, vea :ref:`Programando su Radio <docs/getting-started/getting-started-frc-control-system/radio-programming:Programming your Radio>`.
tr_tr: Robota kablosuz iletişim işlevselliği sağlamak için robot radyo olarak OpenMesh OM5P-AN veya OpenMesh OM5P-AC kablosuz radyo kullanılır. Cihaz, evde kullanım için bir dizüstü bilgisayarın doğrudan bağlantısı için erişim noktası olarak yapılandırılabilir. Ayrıca sahada kullanım için bir köprü-bridge olarak yapılandırılabilir. Robot radyosu, VRM üzerindeki 12V/2A çıkışlarından birinden güç almalı ve roboRIO kontrolörüne Ethernet üzerinden bağlanmalıdır. Daha fazla bilgi için, bakınız:ref:`Programming your Radio <docs/getting-started/getting-started-frc-control-system/radio-programming:Programming your Radio>`

source: The OM5P-AN `is no longer available for purchase <https://www.firstinspires.org/robotics/frc/blog/radio-silence>`__. The OM5P-AC is slightly heavier, has more cooling grates, and has a rough surface texture compared to the OM5P-AN.
es_mx: El OM5P-AN `ya no está disponible para su compra <https://www.firstinspires.org/robotics/frc/blog/radio-silence>`__. El OM5P-AC es ligeramente más pesado, tiene más rejillas de enfriamiento, y tiene una textura superficial rugosa comparada con la de OM5P-AN.
tr_tr: OM5P-AN `artık satın alınamıyor <https://www.firstinspires.org/robotics/frc/blog/radio-silence>`__. OM5P-AC, OM5P-AN'ye kıyasla biraz daha ağırdır, daha fazla soğutma ızgarasına sahiptir ve pürüzlü bir yüzey dokusuna sahiptir.

source: 120A Circuit Breaker
es_mx: Disyuntores de circuito de 120A
pt: Disjuntor 120A
tr_tr: 120A Devre Kesici - Sigorta

source: The 120A Main Circuit Breaker serves two roles on the robot: the main robot power switch and a protection device for downstream robot wiring and components. The 120A circuit breaker is wired to the positive terminals of the robot battery and Power Distribution boards. For more information, please see the `Cooper Bussmann 18X Series Datasheet (PN: 185120F) <http://www.cooperindustries.com/content/dam/public/bussmann/Transportation/Circuit%20Protection/resources/datasheets/BUS_Tns_DS_18X_CIRCUITBREAKER.pdf>`__
es_mx: El disyuntor de 120A tiene dos funciones principales en el robot: El interruptor principal de corriente y un dispositivo de protección de cableado y componentes del robot. El disyuntor de 120A está conectado a las terminales positivas de la batería del robot y a los tableros de Distribución de Energía. Para más información vea `Cooper Bussmann 18X Series Datasheet (PN: 185120F) <http://www.cooperindustries.com/content/dam/public/bussmann/Transportation/Circuit%20Protection/resources/datasheets/BUS_Tns_DS_18X_CIRCUITBREAKER.pdf>`__
tr_tr: 120A Ana Devre Kesici sigorta, robot üzerinde iki görev görür: ana robot güç anahtarı ve sigorta sonrası kablolar/bileşenler için bir koruma. 120A devre kesici, robot pilinin ve Güç Dağıtım panosunun pozitif terminallerine bağlanır. Daha fazla bilgi için lütfen bkz. `Cooper Bussmann 18X Series Veri Sayfası (PN: 185120F) <http://www.cooperindustries.com/content/dam/public/bussmann/Transportation/Circuit%20Protection/resources/datasheets/BUS_Tns_DS_18X_CIRCUITBREAKER.pdf>`__

source: Snap Action Circuit Breakers
es_mx: Disyuntores de Acción Inmediata
tr_tr: Snap Action Devre Kesici - Sigorta

source: The Snap Action circuit breakers, MX5-A40 and VB3 series, are used with the Power Distribution Panel to limit current to branch circuits. The MX5-A40 40A MAXI style circuit breaker is used with the larger channels on the Power Distribution Panel to power loads which draw current up to 40A continuous. The VB3 series are used with the smaller channels on the PDP to power circuits drawing current of 30A or less continuous. For more information, see the Datasheets for the `MX5 series <http://www.snapaction.net/pdf/MX5%20Spec%20Sheet.pdf>`__ and `VB3 Series <http://www.snapaction.net/pdf/vb3.pdf>`__.
es_mx: Los disyuntores de Acción Inmediata, MX5-A40 y VB3 series, son usados junto con el PDP para limitar la corriente a los circuitos derivados. El disyuntor de estilo MX5-A40 40A MAXI es usado con los canales más largos del Panel de Distribución de Corriente para alimentar cargas que consumen corriente continua de hasta 40A. Las series VB3 son usadas con los canales más pequeños de la PDP para alimentar circuitos que consumen continuamente 30A o menos. Para más información, vea las hojas de datos de `MX5 series <http://www.snapaction.net/pdf/MX5%20Spec%20Sheet.pdf>`__ and `VB3 Series <http://www.snapaction.net/pdf/vb3.pdf>`__.
tr_tr: Snap Action devre kesiciler, MX5-A40 ve VB3 serisi, akımı dal devrelerine sınırlamak için Power Distribution Panel ile birlikte kullanılır. MX5-A40 40A MAXI tarzı devre kesici, 40A'ya kadar sürekli akım çeken yüklere güç sağlamak için Power Distribution Panel deki daha büyük kanallarla birlikte kullanılır. VB3 serisi, 30A veya daha az sürekli akım çeken devreleri çalıştırmak için PDP üzerindeki daha küçük kanallarla birlikte kullanılır. Daha fazla bilgi için, `MX5 series <http://www.snapaction.net/pdf/MX5%20Spec%20Sheet.pdf>`__ and `VB3 Series <http://www.snapaction.net/pdf/vb3.pdf>`__.

source: Robot Battery
es_mx: Batería del Robot
pt: Bateria do Robô
tr_tr: Robot Aküsü

source: The power supply for an FRC robot is a single 12V 18Ah battery. The batteries used for FRC are sealed lead acid batteries capable of meeting the high current demands of an FRC robot. For more information, see the datasheet for the `MK ES17-12 <https://www.mkbattery.com/application/files/2515/3308/8109/ES17-12.pdf>`__.
es_mx: La fuente de alimentación de un robot FRC es una sola batería de 12V 18Ah. Las baterías usadas para FRC son baterías de plomo selladas capaces de satisfacer las altas demandas de corriente de un robot FRC. Para más información, vea la hoja de datos del `MK ES17-12 <https://www.mkbattery.com/application/files/2515/3308/8109/ES17-12.pdf>`__.
tr_tr: Bir FRC robotunun güç kaynağı tek bir 12V 18Ah bataryadır. FRC için kullanılan bataryalar, bir FRC robotunun yüksek akım taleplerini karşılayabilen mühürlü kurşun asit - sealed lead acid bataryalardır. Daha fazla bilgi için, `MK ES17-12 <https://www.mkbattery.com/application/files/2515/3308/8109/ES17-12.pdf>`__.
