Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/control-system-hardware.po
Languages: es_mx, pt, tr_tr

source: FRC Control System Hardware Overview
es_mx: Descripción General del Hardware del Sistema de Control de FRC
pt: Visão Geral dos componentes de Hardware da FRC
tr_tr: FRC Kontrol Sistemi Donanımına Genel Bakış

source: The goal of this document is to provide a brief overview of the hardware components that make up the FRC\ |reg| Control System. Each component will contain a brief description of the component function, a brief listing of critical connections, and a link to more documentation if available.
es_mx: El objetivo de este documento es proporcionar una breve descripción de los componentes de hardware que componen el Sistema de Control de FRC\ |reg| . Cada componente contendrá una breve descripción de la función del componente, una breve lista de conexiones críticas y un enlace a más documentación si está disponible.
pt: O objetivo deste documento é fornecer uma breve visão geral dos componentes de hardware que compõem o Sistema de Controle da FRC\ |reg|. Cada componente vai conter uma breve descrição da função do componente, uma breve lista de conexões críticas, e um link para mais documentação se disponível.
tr_tr: Bu belgenin amacı, FRC \ | reg | Kontrol sistemi'ni oluşturan donanım bileşenlerine kısa bir genel bakış sağlamaktır. Her bileşen, bileşen işlevinin kısa bir açıklamasını, kritik bağlantıların kısa bir listesini ve varsa daha fazla dokümantasyona bağlantı içerecektir.

source: For complete wiring instructions/diagrams, please see the :doc:`Wiring the FRC Control System <how-to-wire-a-robot>` document.
es_mx: Para obtener instrucciones/ diagramas de cableado, consulte el documento :doc:`Cómo Cablear un Sistema de Control de FRC <how-to-wire-a-robot>`.
pt: Para instruções/diagramas de fiação completos, acesse o documento :doc:`Wiring the FRC Control System <how-to-wire-a-robot>`.
tr_tr: Tam kablolama talimatları / şemaları için lütfen şu belgeye :doc:`Wiring the FRC Control System <how-to-wire-a-robot>` bakın.

source: Overview of Control System
es_mx: Descripción del Sistema de Control
pt: Visão Geral do Sistema de Controle
tr_tr: Kontrol Sistemine Genel Bakış

source: Diagram courtesy of FRC Team 3161 and Stefen Acepcion.
es_mx: Diagrama cortesía del equipo FRC 3161 y Stefen Acepcion.
pt: Diagrama cortesia do Time 3161 de FRC e Stefen Acepcion.
tr_tr: FRC Team 3161 ve Stefen Acepcion'un izniyle şema.

source: The NI-roboRIO is the main robot controller used for FRC. The roboRIO includes a dual-core ARM Cortex™-A9 processor and FPGA which runs both trusted elements for control and safety as well as team-generated code. Integrated controller I/O includes a variety of communication protocols (Ethernet, USB, CAN, SPI, I2C, and serial) as well as PWM, servo, digital I/O, and analog I/O channels used to connect to robot peripherals for sensing and control.The roboRIO should connect to the dedicated 12V port on the Power Distribution Panel for power. Wired communication is available via USB or Ethernet. Detailed information on the roboRIO can be found in the `roboRIO User Manual <https://www.ni.com/pdf/manuals/374474a.pdf>`__ and in the `roboRIO technical specifications <https://www.ni.com/pdf/manuals/374661a.pdf>`__.
es_mx: El NI-roboRIO es el principal controlador de robot utilizado para FRC. La roboRIO incluye un procesador ARM Cortex™-A9 de doble núcleo y un FPGA que ejecuta elementos confiables para el control y la seguridad, así como los códigos de los equipos. La E/S del controlador integrado incluye una variedad de protocolos de comunicación (Ethernet, USB, CAN, SPI, I2C y serie), así como PWM, servo, E/S digital, y canales de E/S análogos utilizados para conectarse a los periféricos del robot para detección y control. La roboRIO debe conectarse al puerto dedicado de 12V en el Panel de Distribución de Corriente para obtener energía. La comunicación por cable está disponible a través de USB o Ethernet. Puede encontrar información detallada sobre el roboRIO en el `Manual de Uso de la roboRIO <https://www.ni.com/pdf/manuals/374474a.pdf>`__ y en `Especificaciones técnicas de la roboRIO <https://www.ni.com/pdf/manuals/374661a.pdf>`__.
tr_tr: NI-roboRIO, FRC için kullanılan ana robot denetleyicidir. RoboRIO, çift çekirdekli bir ARM Cortex ™ -A9 işlemci ve hem kontrol hem de güvenlik için güvenilir unsurları ve ayrıca takım tarafından oluşturulan kodu çalıştıran bir FPGA içerir. Entegre kontrolör Giriş/Çıkışı, çeşitli iletişim protokollerinin (Ethernet, USB, CAN, SPI, I2C ve seri) yanı sıra, robot çevre birimlerine bağlanmak için kullanılan PWM, servo, dijital I/O ve analog I/O kanallarını içerir. roboRIO, güç için Power Distribution Panel - Güç Dağıtım Panelindeki özel 12V bağlantı noktasına bağlanmalıdır. Kablolu iletişim USB veya Ethernet üzerinden sağlanabilir. RoboRIO hakkında ayrıntılı bilgi, `roboRIO Kullanıcı Kılavuzu <https://www.ni.com/pdf/manuals/374474a.pdf>`__ ve `roboRIO teknik özellikleri <https://www.ni.com/pdf/manuals/374661a.pdf>`__.

source: Power Distribution Panel
es_mx: Panel de Distribución de Corriente
tr_tr: Power Distribution Panel - Güç Dağıtım Paneli

source: The Power Distribution Panel (PDP) is designed to distribute power from a 12VDC battery to various robot components through auto-resetting circuit breakers and a small number of special function fused connections. The PDP provides 8 output pairs rated for 40A continuous current and 8 pairs rated for 30A continuous current. The PDP provides dedicated 12V connectors for the roboRIO, as well as connectors for the Voltage Regulator Module and Pneumatics Control Module. It also includes a CAN interface for logging current, temperature, and battery voltage. For more detailed information, see the `PDP User Manual <https://www.ctr-electronics.com/downloads/pdf/PDP%20User's%20Guide.pdf>`__.
es_mx: El Panel de Distribución de Corriente (Power Distribution Panel o PDP) está diseñado para distribuir energía desde una batería de 12VDC a varios componentes del robot a través de disyuntores de reinicio automático y un pequeño número de conexiones fusionadas con una función especial. El PDP proporciona 8 pares de salida clasificados por corriente continua de 40A y 8 pares clasificados por corriente continua de 30A. El PDP proporciona conectores dedicados para la roboRIO de 12V, así como conectores pare el Módulo Regulador de Voltaje y el Módulo de Control Neumático. También incluye una interfaz CAN para corriente de registro, temperatura, y voltaje de la batería. Para más información detallada, vea el `Manual de Usuario del PDP <https://www.ctr-electronics.com/downloads/pdf/PDP%20User's%20Guide.pdf>`__.
tr_tr: Power Distribution Panel (PDP), gücü bir 12VDC bataryadan çeşitli robot bileşenlerine otomatik sıfırlamalı devre kesici sigortalar ve az sayıda özel işlevli sigortalı bağlantılar aracılığıyla dağıtmak için tasarlanmıştır. PDP, 40A sürekli akım için derecelendirilmiş 8 çıkış çifti ve 30A sürekli akım için derecelendirilmiş 8 çıkış çift sağlar. PDP, roboRIO için özel 12V konektörlerin yanı sıra Voltage Regulator Module - Voltaj Düzenleyici Modülü ve Pneumatics Control Module - Pnömatik Kontrol Modülü için besleme konektörleri de sağlar. Ayrıca akım, sıcaklık ve pil voltajını kaydetmek için bir CAN arabirimi içerir. Daha ayrıntılı bilgi için, bkz. `PDP Kullanım Kılavuzu <https://www.ctr-electronics.com/downloads/pdf/PDP%20User's%20Guide.pdf>`__.

source: Pneumatics Control Module
es_mx: Módulo de Control de Neumática
tr_tr: Pneumatics Control Module - Pnömatik Kontrol Modülü

source: The PCM is a device that contains all of the inputs and outputs required to operate 12V or 24V pneumatic solenoids and the on board compressor. The PCM is enabled/disabled by the roboRIO over the CAN interface. The PCM contains an input for the pressure sensor and will control the compressor automatically when the robot is enabled and a solenoid has been created in the code. The device also collects diagnostic information such as solenoid states, pressure switch state, and compressor state. The module includes diagnostic LED’s for both CAN and the individual solenoid channels. For more information see the `PCM User Manual <https://www.ctr-electronics.com/downloads/pdf/PCM%20User's%20Guide.pdf>`__.
es_mx: El PCM, o Pneumatic Control Module, es un dispositivo que contiene todas las entradas y salidas necesarias para operar solenoides neumáticos de 12V o 24V y el compresor a bordo. El PCM es habilitado/ deshabilitado por la roboRIO a través de la interfaz CAN. El PCM contiene una entrada para el sensor de presión y controlará el compresor automáticamente cuando el robot esté habilitado y se ha creado un solenoide en el código. El dispositivo también recopila información de diagnóstico como el estado del solenoide, el estado de presión del switch, y el estado del compresor. El módulo incluye un LED de diagnóstico para ambos canales, el CAN y el del solenoide individual. Para más información vea el `Manual de Usuario del PCM <https://www.ctr-electronics.com/downloads/pdf/PCM%20User's%20Guide.pdf>`__.
tr_tr: PCM, 12V veya 24V pnömatik solenoidleri ve yerleşik kompresörü çalıştırmak için gerekli tüm giriş ve çıkışları içeren bir cihazdır. PCM, CAN arayüzü üzerinden roboRIO tarafından etkinleştirilir/devre dışı bırakılır. PCM, basınç sensörü için bir giriş içerir ve robot etkinleştirildiğinde ve kodda bir solenoid oluşturulduğunda kompresörü otomatik olarak kontrol eder. Cihaz ayrıca solenoid durumları, basınç anahtarı durumu ve kompresör durumu gibi teşhis bilgilerini de toplar. Modül, hem CAN hem de bağımsız solenoid kanallar için bilgi LED'leri içerir. Daha fazla bilgi için bkz. `PCM Kullanıcı Kılavuzu <https://www.ctr-electronics.com/downloads/pdf/PCM%20User's%20Guide.pdf>`__.

source: Voltage Regulator Module
es_mx: Módulo de Regulador de Voltaje
tr_tr: Voltage Regulator Module - Voltaj Düzenleme Modülü

source: The VRM is an independent module that is powered by 12 volts. The device is wired to a dedicated connector on the PDP. The module has multiple regulated 12V and 5V outputs. The purpose of the VRM is to provide regulated power for the robot radio, custom circuits, and IP vision cameras. The two connector pairs associated with each label have a combined rating of what the label indicates (e.g. 5V/500mA total for both pairs not for each pair). The 12V/2A limit is a peak rating, the supply should not be loaded with more than 1.5A continuous current draw. For more information, see the `VRM User Manual <https://www.ctr-electronics.com/VRM%20User's%20Guide.pdf>`__.
es_mx: El VRM, o Voltage Regulator Module, es un módulo independiente que está alimentado por 12 volts. Este dispositivo está conectado a un conector dedicado en el PDP. El módulo tiene múltiples salidas reguladas por 12V y 5V. El objetivo del VRM es proporcionar energía regulada para el radio del robot, circuitos personalizados, y cámaras de visión IP. Los 2 pares de conectores asociados con cada etiqueta tienen una clasificación combinada de lo que la etiqueta indica (ej. 5V/ 500mA total por los 2 pares, no por uno solo). El límite de 12V/2A es una clasificación máxima, el suministro no deberá cargarse con más de 1.5A de corriente continua. Para más información, vea el `Manual de Usuario de VRM<https://www.ctr-electronics.com/VRM%20User's%20Guide.pdf>`__.
tr_tr: VRM, 12 volt ile çalışan bağımsız bir modüldür. Cihaz, PDP üzerindeki özel bir konektöre bağlanır. Modül, birden fazla regüle edilmiş 12V ve 5V çıkışa sahiptir. VRM'nin amacı, robot radyo, özel devreler ve IP görüş kameraları için regüle edilmiş güç sağlamaktır. Her etiketle ilişkili konektör çiftleri, etiketin gösterdiği değer için ortak bir çıkış gücüne sahiptir (örneğin, 5V/500mA etiketli çıkışlar için toplam akımı gösterir, ayrı ayrı değildir). 12V/2A sınırı bir tepe değeridir, bağlı cihazlar 1.5A' den fazla sürekli akım çekişiyle yüklenmemelidir. Daha fazla bilgi için, bkz. `VRM Kullanıcı Kılavuzu <https://www.ctr-electronics.com/VRM%20User's%20Guide.pdf>`__.

source: Motor Controllers
es_mx: Controladores de Motor
pt: Controladores de Motor
tr_tr: Motor Sürücüleri

source: There are a variety of different motor controllers which work with the FRC Control System and are approved for use. These devices are used to provide variable voltage control of the brushed DC motors used in FRC. They are listed here in alphabetical order.
es_mx: Hay una variedad de distintos controladores de motor, los cuales trabajan con el Sistema de Control de FRC y su uso está aprobado. Estos dispositivos son usados para proporcionar control de voltaje variable de los motores DC de cepillos ,o brushed motors, usados en FRC. Están listados aquí en orden alfabético.
tr_tr: FRC Kontrol Sistemi ile çalışan ve kullanım için onaylanmış farklı motor kontrolörleri vardır. Bu cihazlar, FRC'de kullanılan fırçalı DC motorların değişken voltaj kontrolünü sağlamak için kullanılır. Burada alfabetik sıraya göre listelenmiştir.

source: DMC-60 and DMC-60C Motor Controller
es_mx: Controladores de Motor DMC-60 y DMC-60C
pt: Controladores de Motor DMC-60 e DMC-60C
tr_tr: DMC-60 ve DMC-60C Motor Sürücü

source: The DMC-60 is a PWM motor controller from Digilent. The DMC-60 features integrated thermal sensing and protection including current-foldback to prevent overheating and damage, and four multi-color LEDs to indicate speed, direction, and status for easier debugging. For more information, see the `DMC-60 reference manual <https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__
es_mx: El DMC-60 es un controlador de motor PWM de Digilent. El DMC-60 cuenta con protección y detección térmica integradas, incluido el plegado de corriente para evitar el sobrecalentamiento y el daño, y cuatro LEDs multicolor que indican la velocidad, dirección, y estado para una depuración más sencilla. Para más información, vea el `manual de referencias del DMC-60 <https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__
tr_tr: DMC-60, Digilent'in bir PWM motor kontrolörüdür. DMC-60, aşırı ısınmayı ve hasarı önlemek için akım bükme dahil entegre termal algılama, koruma ve daha kolay hata ayıklama için hızı, yönü ve durumu gösteren dört çok renkli LED'i içerir. Daha fazla bilgi için, `DMC-60 referans kılavuzuna bakın <https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__

source: The DMC-60C adds CAN smart controller capabilities to the DMC-60 controller. This enables closed loop control features and other intelligent control options. For more information see the `DMC-60C Product Page <https://store.digilentinc.com/dmc60c-digital-motor-controller-approved-for-first-robotics/>`__
es_mx: El DMC-60 añade capacidades del controlador inteligente CAN al controlador DMC-60. Esto permite características de control de circuito cerrado y otras opciones de control inteligentes. Para más información vea la `Página de Producto DMC-60C <https://store.digilentinc.com/dmc60c-digital-motor-controller-approved-for-first-robotics/>`__
tr_tr: DMC-60C, DMC-60 kontrol cihazına ek olarak CAN akıllı kontrolör yetenekleri içerir. Bu, kapalı döngü kontrol özelliklerini ve diğer akıllı kontrol seçeneklerini etkinleştirir. Daha fazla bilgi için bkz. `DMC-60C Ürün Sayfası <https://store.digilentinc.com/dmc60c-digital-motor-controller-approved-for-first-robotics/>`__

source: Jaguar Motor Controller
es_mx: Controlador de Motor Jaguar
pt: Controlador de Motor Jaguar
tr_tr: Jaguar Motor Kontrolörü

source: The Jaguar Motor Controller from VEX Robotics (formerly made by Luminary Micro and Texas Instruments) is a variable speed motor controller for use in FRC. For FRC, the Jaguar may only be controlled using the PWM interface.
es_mx: El Controlador del Motor Jaguar de VEX Robotics (anteriormente creado por Luminary Micro y Texas Instruments) es un controlador del motor de velocidad variable para uso en FRC. Para FRC, el Jaguar puede ser controlado únicamente utilizando la interfaz PWM.
tr_tr: VEX Robotics'in Jaguar Motor Kontrolörü (önceden Luminary Micro ve Texas Instruments tarafından yapılmıştır), FRC'de kullanım için değişken hızlı bir motor kontrolörüdür. FRC için Jaguar yalnızca PWM arayüzü kullanılarak kontrol edilebilir.

source: SD540B and SD540C Motor Controllers
es_mx: Controladores de Motor SD540B y SD540C
pt: Controladores de Motor SD540B e SD540C
tr_tr: SD540B ve SD540C Motor Kontrolörü

source: The SD540 Motor Controller from Mindsensors is a variable speed motor controller for use in FRC. The SD540B is controlled using the PWM interface. The SD540C is controllable over CAN. Limit switches may be wired directly to the SD540 to limit motor travel in one or both directions. Switches on the device are used to flip the direction of motor travel, configure the wiring polarity of limit switches, set Brake or Coast mode, and put the device in calibration mode. For more information see the `Mindsensors FRC page <http://www.mindsensors.com/68-frc>`__
es_mx: El Controlador de Motor SD540 de Mindsensors es un controlador del motor de velocidad variable para usarlo en FRC. El SD540B es controlado utilizando la interfaz de PWM. El SD540C es controlable a través de CAN. Los interruptores de límite pueden estar conectados directamente al SD540 para limitar el recorrido del motor en una o ambas direcciones. Los interruptores en el dispositivo son utilizados para voltear la dirección del recorrido del motor, configure la polaridad de cableado de los interruptores de límite, establezca el modo Break o Coast, y ponga el dispositivo en modo de calibración. Para más información consulte la `Página de Mindsensors para FRC <http://www.mindsensors.com/68-frc>`__
tr_tr: Mindsensors SD540 Motor Kontrolörü, FRC'de kullanım için değişken hızlı bir motor kontrolörüdür. SD540B, PWM arayüzü kullanılarak kontrol edilir. SD540C, CAN üzerinden kontrol edilebilir. Limit anahtarları, bir veya her iki yönde motor hareketini sınırlamak için doğrudan SD540'a bağlanabilir. Cihaz üzerindeki anahtarlar, motor hareket yönünü değiştirmek, sınır anahtarlarının kablo bağlantı polaritesini yapılandırmak, fren veya serbest modunu ayarlamak ve cihazı kalibrasyon moduna geçirmek için kullanılır. Daha fazla bilgi için bkz. `Mindsensors FRC sayfası <http://www.mindsensors.com/68-frc>`__

source: SPARK Motor Controller
es_mx: Controlador de Motor SPARK
pt: Controlador de Motor SPARK
tr_tr: SPARK Motor Kontrolörü

source: The SPARK Motor Controller from REV Robotics is a variable speed motor controller for use in FRC. The SPARK is controlled using the PWM interface. Limit switches may be wired directly to the SPARK to limit motor travel in one or both directions. The RGB status LED displays the current state of the device including whether the device is currently in Brake mode or Coast mode. For more information, see the `REV Robotics SPARK product page <https://www.revrobotics.com/rev-11-1200/>`__
es_mx: El Controlador de Motor SPARK de REV Robotics es un controlador de motor de velocidad variable para uso en FRC. El SPARK es controlado utilizando la interfaz PWM. Los interruptores de límite pueden estar conectados directamente al SPARK para limitar el recorrido del motor en una o ambas direcciones. El estado RGB del LED muestra el estado actual del dispositivo ya sea en modo Brake o Coast. Para más información visite la `página de producto SPARK de REV Robotics <https://www.revrobotics.com/rev-11-1200/>`__
tr_tr: REV Robotics'in SPARK Motor Kontrolörü, FRC'de kullanım için değişken hızlı bir motor kontrolörüdür. SPARK, PWM arayüzü kullanılarak kontrol edilir. Limit anahtarları, bir veya her iki yönde motor hareketini sınırlandırmak için doğrudan SPARK'a bağlanabilir. RGB durum LED'i, cihazın o anda Fren modunda mı yoksa Serbest modda mı olduğu dahil olmak üzere cihazın mevcut durumunu gösterir. Daha fazla bilgi için, `REV Robotics SPARK ürün sayfasına bakın <https://www.revrobotics.com/rev-11-1200/>`__

source: SPARK MAX Motor Controller
es_mx: Controlador de Motor SPARK MAX
pt: Controlador de motor SPARK MAX
tr_tr: SPARK MAX Motor Kontrolörü

source: The SPARK MAX Motor Controller from REV Robotics is a variable speed motor controller for use in FRC. The SPARK MAX is capable of controlling either the traditional brushed DC motors commonly used in FRC or the REV Robotics NEO Brushless Motor. The SPARK MAX can be controlled over PWM, CAN or USB (for configuration/testing only). The controller has a data port for sensor input and is capable of closed loop control modes when controlled over CAN or USB. For more information see the `REV Robotics SPARK MAX product page <https://www.revrobotics.com/rev-11-2158/>`__.
es_mx: El Controlador deL Motor SPARK MAX es un controlador de motor de velocidad variable para uso en FRC. El SPARK MAX es capaz de controlar tanto los motores DC con cepillos tradicionales comúnmente usados en FRC como el Motor Brushless, sin cepillos, NEO de REV Robotics. El SPARK MAX puede ser controlado por PWM, CAN o USB (solo para configuración/ prueba). El controlador tiene un portal de datos para entrada de sensores y es capaz de modos de control de bucle cerrado cuando es controlado por CAN o USB. Para más información vea la `página de productos SPARK MAX de REV Robotics <https://www.revrobotics.com/rev-11-2158/>`__.
tr_tr: REV Robotics'in SPARK MAX Motor Kontrolörü, FRC'de kullanım için değişken hızlı bir motor kontrolörüdür. SPARK MAX, FRC'de yaygın olarak kullanılan geleneksel fırçalı DC motorları veya REV Robotics NEO Fırçasız Motoru kontrol edebilir. SPARK MAX, PWM, CAN veya USB (yalnızca yapılandırma / test için) üzerinden kontrol edilebilir. Kontrolör, sensör girişi için bir veri portuna sahiptir ve CAN veya USB üzerinden kontrol edildiğinde kapalı döngü kontrol modları kullanabilir. Daha fazla bilgi için, `REV Robotics SPARK MAX ürün sayfasına bakın <https://www.revrobotics.com/rev-11-2158/>`__.

source: Talon Motor Controller
es_mx: Controlador de Motor Talon
pt: Controlador de Motor Talon
tr_tr: Talon Motor Kontrolörü

source: The Talon Motor Controller from Cross the Road Electronics is a variable speed motor controller for use in FRC. The Talon is controlled over the PWM interface. The Talon should be connected to a PWM output of the roboRIO and powered from the Power Distribution Panel. For more information see the `Talon User Manual <https://ctr-electronics.com/Talon_User_Manual_1_1.pdf>`__.
es_mx: El Controlador de Motor Talon de Cross the Road Electronics es un controlador de motor de velocidad variable que se usa en FRC. El Talon es controlado a través de la interfaz PWM. El Talon debe conectarse a una salida PWM de la roboRIO y debe ser alimentado desde el Panel de Distribución de Corriente. Para más información vea el `Manual de Usuario Talon <https://ctr-electronics.com/Talon_User_Manual_1_1.pdf>`__.
tr_tr: Cross the Road Electronics'in Talon Motor Denetleyicisi, FRC'de kullanım için değişken hızlı bir motor denetleyicisidir. Talon, PWM arayüzü üzerinden kontrol edilir. Talon, roboRIO'nun bir PWM çıkışına bağlanmalı ve Power Distribution Panelden beslenmelidir. Daha fazla bilgi için bkz. `Talon Kullanım Kılavuzu <https://ctr-electronics.com/Talon_User_Manual_1_1.pdf>`__.

source: Talon SRX
tr_tr: Talon SRX Motor Kontrolörü
