Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/frc-game-tools.po
Languages: es_mx, fr_ca, tr_tr

source: Installing the FRC Game Tools
es_mx: Instalando FRC Game Tools
fr_ca: Installer les Outils de Jeu FRC
tr_tr: FRC Game Tool - Oyun Araçlarını Yükleme

source: The FRC Game Tools contains the following software components: LabVIEW Update, FRC Driver Station, and FRC Utilities. The LabVIEW runtime components required for the Driver Station and Utilities are included in this package. **No components from the LabVIEW Software for FRC package are required for running either the Driver Station or Utilities.**
es_mx: FRC Game Tools contienen los siguientes componentes de software: LabVIEW Update, FRC Driver Station y FRC Utilities. Los componentes de tiempo de ejecución de LabVIEW requeridos para la Driver Station y Utilities están incluidos en este paquete. **No hay componentes de LabVIEW Software para el paquete de FRC requeridos para ejecutar la Driver Station o Utilities.**
fr_ca: Les outils de jeu FRC contiennent les composants logiciels suivants: les mises à jour LabVIEW, Le Driver Station FRC, et les utilités FRC. Les composants en temps reel de LabVIEW requises pour le Driver Station et ses utilités et sont incluses dans ce package. **Pour faire fonctionner le Driver Station et les utilitaires, aucune portion du code LabVIEW est nécessaire**
tr_tr: FRC Oyun Araçları aşağıdaki yazılım bileşenlerini içerir: LabVIEW Güncellemesi, FRC Driver Station ve FRC Yardımcı Programları. Driver Station ve yardımcı programlar için gerekli LabVIEW runtime bileşenleri bu pakete dahildir. **Driver Station veya Utilities'i çalıştırmak için LabVIEW Software for FRC paketindeki hiçbir bileşen gerekmez.**

source: The Driver Station will only work on Windows 7, Windows 8,\ Windows 8.1, and Windows 10. It will not work on Windows XP.
es_mx: La Driver Station solo funcionará con Windows 7, Windows 8,\ Windows 8.1 y Windows 10. No funcionará con Windows XP.
fr_ca: Le Driver Station fonctionnera seulement sur Windows 7, Windows 8 / Windows 8.1 et Windows 10. Il ne fonctionnera pas sur Windows XP.
tr_tr: Driver Station yalnızca Windows 7, Windows 8, \ Windows 8.1 ve Windows 10'da çalışacaktır. Windows XP'de çalışmayacaktır.

source: Uninstall Old Versions (Recommended)
es_mx: Desinstalar Versiones Anteriores (Recomendado)
fr_ca: Désinstaller les anciennes versions (Conseillé)
tr_tr: Eski Sürümleri Kaldırma (Önerilir)

source: LabVIEW teams have already completed this step, do not repeat it.
es_mx: Los equipos LabVIEW que ya hayan completado este paso, no lo repitan.
fr_ca: Les équipes LabVIEW ont déjà complèter cette étape, ne le répète pas.
tr_tr: LabVIEW ekipleri bu adımı zaten tamamladı, tekrar etmeyin.

source: It is only necessary to uninstall previous versions when installing a new year's tools. For example, uninstall the 2019 tools before installing the 2020 tools. It is not necessary to uninstall before upgrading to a new update of the 2020 game tools.
es_mx: Solo es necesario desinstalar versiones anteriores cuando se instalan herramientas de nuevo año. Por ejemplo, desinstale las herramientas de 2019 antes de instalar las de 2020. No es necesario que desinstale antes de realizar una actualización de las herramientas de juego de 2020.
fr_ca: C'est seulement necessaire de désinstaller les versions anciennes lors de l'installations des outils d'un nouvelle année. Par exemple, désinstaller les outils de 2019 avant d'installer les outils de 2020. Ce n'est pas nécessaire de désinstaller si on fait seulement une mise à jour des outils de jeu 2020.
tr_tr: Yalnızca yeni yıl araçlarını kurarken önceki sürümleri kaldırmak gerekir. Örneğin, 2020 araçlarını yüklemeden önce 2019 araçlarını kaldırın. 2020 oyun araçlarının yeni bir güncellemesine yükseltmeden önce kaldırmaya gerek yoktur.

source: Before installing the new version of the FRC Game Tools it is recommended to remove any old versions. The new version will likely co-exist with the old version (note that the DS will overwrite old versions), but all testing has been done with FRC 2020 only. Then click Start >> Add or Remove Programs. Locate the entry labeled "National Instruments Software", and select Uninstall.
es_mx: Antes de instalar la nueva versión de FRC Game Tools es recomendado remover cualquier versión anterior. La nueva versión probablemente coexistirá con la versión anterior (note que el DS sobre escribirá versiones anteriores), pero todas las pruebas han sido hechas con FRC 2020 solamente. Después haga clic en Iniciar >> Agregar o Remover Programas. Localice la entrada denominada “National Instruments Software”, y seleccione Desinstalar.
fr_ca: Avant d'installer la version nouvelle des Outils de Jeu FRC, il recommandé de supprimer toutes les anciennes versions. La version nouvelle coexistera probablement avec la version ancienne (Notez que le DS écrasera les versions anciennes), mais tous les tests de fonctionnalité ont été effectué avec la version FRC 2020 seulement. Ensuite cliquez Start >> Add Or Remove Programs. Cherchez pour "National Instruments Software", et sélectionnez Uninstall.
tr_tr: FRC Oyun Araçlarının yeni sürümünü kurmadan önce eski sürümleri kaldırmanız önerilir. Yeni sürüm muhtemelen eski sürümle birlikte var olacaktır (DS'nin eski sürümlerin üzerine yazacağını unutmayın), ancak tüm testler yalnızca FRC 2020 ile yapılmıştır. Ardından Başlat >> Program Ekle veya Kaldır'ı tıklayın. "National Instruments Software" etiketli programı bulun ve Kaldır'ı seçin.

source: Select Components to Uninstall
es_mx: Seleccionar Componentes para Desinstalar
fr_ca: Sélection des Composants à Désinstaller
tr_tr: Kaldırılacak Bileşenleri Seçin

source: In the dialog box that appears, select all entries. The easiest way to do this is to de-select the "Products Only" check-box and select the check-box to the left of "Name". Click Remove. Wait for the uninstaller to complete and reboot if prompted.
es_mx: En el cuadro de diálogo que aparece, seleccione todas las entradas. La forma más fácil de hacerlo es desmarcar la casilla de verificación “Products Only" y seleccionar la casilla de verificación a la izquierda de "Name". Haga clic en Eliminar. Espere a que se complete el desinstalador y reinicie si se le solicita.
fr_ca: Dans le boîte de dialogue qui apparaît, sélectionnez toutes les entrées. Le moyen le plus simple de le faire est de dé-sélectionner la case "Products Only" et sélectionner le case à gauche de "Name". Cliquez "Remove". Laissez le désintallateur compléter sa tâche, et redémarrez si nécessaire.
tr_tr: Görünen iletişim kutusunda tüm girişleri seçin. Bunu yapmanın en kolay yolu, "Products Only" onay kutusunun seçimini kaldırmak ve "Name" in solundaki onay kutusunu seçmektir. Remova'a tıklayın. Kaldırıcının tamamlanmasını ve sorduğunda yeniden başlamasını bekleyin.

source: Downloading the Update
es_mx: Descargando la Actualización
fr_ca: Téléchargement de la Mise à Jour
tr_tr: Güncellemenin İndirilmesi - Update

source: Download the update from https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html
es_mx: Descargue la actualización de https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html
fr_ca: Téléchargez la mise à jour suivante: https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html
tr_tr: Güncellemeyi bu linkten indirin https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html

source: If you wish to install on other machines offline, do not click the Download button, click **Individual Offline Installers** and then click Download, to download the full installer.
es_mx: Si desea instalar en otras máquinas fuera de línea, no haga clic en el botón Descargar, haga clic en **Individual Offline Installers** y luego haga clic en Descargar para descargar el instalador completo.
fr_ca: Si vous voulez d'installer ce logiciel sur d'autres ordinateurs non reliés par réseau, ne cliquez pas sur le bouton de téléchargement, cliquez **Individual Offline Installers** puis cliquez "Download" pour télécharger le programme d'installation complète.
tr_tr: Çevrimdışı şekilde diğer makinelere yüklemek isterseniz, Download düğmesine tıklamayın, **Individual Offline Installers** 'e tıklayın ve ardından tam yükleyiciyi indirmek için Downlad'a tıklayın.

source: The Game Tools installer may prompt that .NET Framework 4.6.2 needs to be updated or installed. Follow prompts on-screen to complete the installation, including rebooting if requested. Then resume the installation of the FRC Game Tools, restarting the installer if necessary.
es_mx: El Game Tools installer puede solicitar que .NET Framework 4.6.2 deba actualizarse o instalarse. Siga las instrucciones en pantalla para completar la instalación, incluido el reinicio si se requiere. Luego, reanude la instalación de FRC Game Tools, reinicie el instalador si es necesario.
fr_ca: Le programme d'installation des Outils de Jeu peut indiquer que le .NET Framework 4.6.2 dois être mis à jour ou installé. Suivez les instructions à l'écran pour finaliser l'installation, y compris un redémarrage si demandé. Après, continuer l'installation des Outils de Jeu FRC, redémarrez l'installateur si nécessaire.
tr_tr: Game Tools yükleyicisi, .NET Framework 4.6.2'nin güncellenmesi veya yüklenmesi gerektiğini sorabilir. Kurulumu tamamlamak için, istenirse yeniden başlatma da dahil olmak üzere ekrandaki komut istemlerini izleyin. Ardından, gerekirse yükleyiciyi yeniden başlatarak FRC Game Tools kurulumuna devam edin.

source: Welcome
es_mx: Bienvenido
fr_ca: Bienvenue
tr_tr: Hoşgeldiniz

source: Starting Install
es_mx: Iniciando Instalación
fr_ca: Démarrage de l'installation
tr_tr: Kuruluma Başlama

source: Online Installer
es_mx: Instalador En Línea
fr_ca: Installateur en Ligne
tr_tr: Online Yükleyici

source: Run the downloaded exe file to start the install process. Click “Yes” if a Windows Security prompt
es_mx: Ejecute el archivo exe descargado para iniciar el proceso de instalación. Haga clic en "Yes" si aparece un mensaje de seguridad de Windows
fr_ca: Exécuter le fichier .exe téléchargé pour commencer le processus d'installation. Cliquez "Yes" (Oui) si Windows Security le demande.
tr_tr: İndirdiğiniz .exe dosyasını açarak kurulum işlemini başlatın. Eğer Windows Güvenlik sistemi uyarı verirse "Evet" seçeneğini seçin.

source: Offline Installer (Windows 10)
es_mx: Instalador Sin Conexión (Windows 10)
fr_ca: Installateur hors Ligne (Windows 10)
tr_tr: Offline Yükleyici (Windows 10)

source: Right click on the downloaded iso file and select mount. Run install.exe from the mounted iso. Click “Yes” if a Windows Security prompt
es_mx: Haga clic derecho en el archivo iso descargado y seleccione subir. Ejecute install.exe desde la iso subida. Haga clic en "Yes" si aparece un mensaje de seguridad de Windows
fr_ca: Faites un clic droit sur le fichier ISO téléchargé et sélectionnez "Mount". Exécutez install.exe à partir de l'ISO monté. Cliquez "Yes" si Windows Security le demande.
tr_tr: İndirilen iso dosyasına sağ tıklayın ve Bağla'yı seçin. Takılı iso'dan install.exe'yi çalıştırın. Windows Güvenlik istemi gelirse "Evet" i tıklayın

source: other installed programs may associate with iso files and the mount option may not appear. If that software does not give the option to mount or extract the iso file, then follow the directions in the "Offline Installer (Windows 7, 8, & 8.1)" tab.
es_mx: otros programas instalados pueden asociarse con archivos iso y la opción de subir puede no aparecer. Si ese software no ofrece la opción de subir o extraer el archivo iso, siga las instrucciones en la pestaña “Offline Installer” (Windows 7, 8 y 8.1)”.
fr_ca: certains autres programmes installés peuvent être associé avec les fichiers ISO et l'option "Mount" peut ne pas apparaître. Si l'option de monter ou d'extraire le fichier ISO n'est pas offerte, suivez les directions dans l'onglet "Offline Installer (Windows 7, 8 & 8.1)."
tr_tr: diğer yüklü programlar iso dosyalarıyla ilişkilendirilebilir ve bağlama seçeneği görünmeyebilir. Bu yazılım iso dosyasını bağlama veya çıkarma seçeneği sunmuyorsa, "Offline Installer (Windows 7, 8 ve 8.1)" sekmesindeki talimatları izleyin.

source: Offline Installer (Windows 7, 8, & 8.1)
es_mx: Instalador Sin Conexión (Windows 7, 8, & 8.1)
fr_ca: Installateur hors Ligne (Windows 7, 8 & 8.1)
tr_tr: Offline Yükleyici (Windows 7, 8, & 8.1)

source: Install 7-Zip (download `here <https://www.7-zip.org>`__). As of the writing of this document, the current released version is 19.00 (2019-02-21). Right click on the downloaded iso file and select Extract to.
es_mx: Instale 7-Zip (descargue `here <https://www.7-zip.org>`__). A la fecha de redacción de este documento, la versión actual es de 19.00 (2019-02-21). Haga clic derecho en el archivo iso descargado y seleccione Extraer en.
fr_ca: Installez 7-Zip (télécharger `ici <https://www.7-zip.org>`__). Au moment de la rédaction de ce document, la version actuelle publiée est 19.00 (2019-02-21). Faites un clic droit sur le fichier ISO téléchargé et sélectionnez Extract to.
tr_tr: 7-Zip'i kurun (`buradan <https://www.7-zip.org>`__ indirin). Bu belgenin yazıldığı tarih itibariyle, mevcut yayınlanmış sürüm 19.00 dır (2019-02-21). İndirilen iso dosyasına sağ tıklayın ve Extract - ayıkla seçeneğini seçin.

source: Run install.exe from the extracted folder. Click “Yes” if a Windows Security prompt appears.
es_mx: Ejecute install.exe desde la carpeta extraída. Haga clic en “Yes” si aparece un mensaje de seguridad de Windows.
fr_ca: Exécutez install.exe à partir du dossier décompressé. Cliquez sur “Yes” si une invite de sécurité Windows s’affiche.
tr_tr: Çıkarılan klasörden install.exe dosyasını çalıştırın. Windows Güvenlik istemi görünürse “Yes” i tıklayın.

source: If you see this screen, click "Next"
es_mx: Si ve esta pantalla, haga clic en “Next"
fr_ca: Si vous voyez cette écran, cliquez "Next"
tr_tr: Eğer bu ekranı görürseniz, "Next" seçeneğini seçin.

source: Disable Windows Fast Startup
es_mx: Desactivar el inicio Rápido de Windows
fr_ca: Désactiver le démarrage rapide de Windows
tr_tr: Windows Fast Startup - Hızlı Başlangıç özelliğini kapatın.

source: NI Package Manager Review
es_mx: Revisión de NI Package Manager
fr_ca: Revue du gestionnaire de packages NI
tr_tr: NI Package Manager Özeti

source: NI Package Manager Installation
es_mx: Instalación de NI Package Manager
fr_ca: L'installation du gestionnaire de packages NI
tr_tr: NI Package Manager Kurulumu

source: Installation progress of the NI Package Manager will be tracked in this window
es_mx: El progreso de la instalación del NI Package Manager se rastreará en esta ventana
fr_ca: Les progrès de l'installation du NI Package Manager seront illustrés dans cette fenêtre.
tr_tr: NI Paket Manager indirme ilerlemesini bu pencereden takip edebilirsiniz

source: Product List
es_mx: Lista de Productos
fr_ca: Liste de produits
tr_tr: Ürün Listesi

source: Additional Software
es_mx: Software Adicional
fr_ca: Logiciel Supplémentaire
tr_tr: Ek Yazılım

source: |Additional Software|
tr_tr: |Ek Yazılım|

source: License Agreements
es_mx: Acuerdos de Licencia
fr_ca: Accords de License
tr_tr: Lisans Anlaşmaları

source: |License Agreements|
tr_tr: |Lisans Anlaşmaları|

source: Select “I accept…” then click “Next”
es_mx: Seleccione “I accept ..." y luego haga clic en "Next"
fr_ca: Sélectionnez "I accept..." et cliquez "Next"
tr_tr: "I accept…" seçeneğini seçin, ardından "Next" seçeneğini seçin.

source: License Agreements Page 2
es_mx: Acuerdos de Licencia Página 2
fr_ca: Accords de License Page 2
tr_tr: Lisans Anlaşmaları Sayfa 2

source: |License Agreements Page 2|
tr_tr: |Lisans Anlaşmaları Sayfa 2|

source: If you see this screen, select “I accept…” then click “Next”
es_mx: Si ve esta pantalla, seleccione “I accept ..." y luego haga clic en “Next"
fr_ca: Si vous voyez cette écran, sélectionnez "I accept..." et cliquez "Next"
tr_tr: Eğer bu ekranı görürseniz, "I accept…" seçeneğini seçip ardından "Next" seçeneğini seçin.

source: Review Summary
es_mx: Resumen de la Revisión
fr_ca: Résumé des commentaires
tr_tr: Özeti İnceleyin

source: Click Next
es_mx: Haga clic en Siguiente
fr_ca: Cliquez Next
tr_tr: "Next" e tıklayınız

source: Detail Progress
es_mx: Progreso Detallado
fr_ca: Progrès de Détail
tr_tr: İlerleme Detayları

source: Installation Summary
es_mx: Resumen de Instalación
fr_ca: Résumé de l'Installation
tr_tr: Kurulum Özeti

source: |Installation Summary|
fr_ca: |Résumé de l'Installation|
tr_tr: |Kurulum Özeti|

source: click Close
es_mx: haga click en Cerrar
fr_ca: Cliquez Close
tr_tr: "Close" seçeneğini seçin.

source: NI Activation Wizard
es_mx: Asistente de activación de NI
fr_ca: Assistant d'Activation NI
tr_tr: NI Aktivasyon Sihirbazı

source: |NI Activation Wizard|
tr_tr: |NI Aktivasyon Sihirbazı|

source: Log into your ni.com account. If you don’t have an account, select ‘Create account’ to create a free account.
es_mx: Inicie sesión en su cuenta ni.com. Si no tiene una cuenta, seleccione ‘Create account’ para crear una cuenta gratuita.
fr_ca: Connectez-vous à votre compte ni.com. Si vous n'avez pas une compte, sélectionnez "Create account" pour créer une compte gratuit.
tr_tr: ni.com hesabınıza giriş yapın. Hesabınız yoksa, "Create account" seçeneğini seçerek ücretsiz yeni bir hesap oluşturun.

source: NI Activation Wizard (2)
es_mx: Asistente de Activación de NI (2)
fr_ca: Assistant d'Activation NI (2)
tr_tr: NI Aktivasyon Sihirbazı (2)

source: |NI Activation Wizard 2|
tr_tr: |NI Aktivasyon Sihirbazı 2|

source: Enter the serial number. Click “Activate”. Note: If this is the first time activating this year's software on this account, you will see the message shown above about a valid license not being found. You can ignore this.
es_mx: Ingrese el número de serie. Haga clic en "Activate". Nota: Si es la primera vez que activa el software de este año en esta cuenta, verá el mensaje que se muestra arriba acerca de que no se encuentra una licencia válida. Puede ignorar esto.
fr_ca: Entrez le numéro de série. Cliquez "Activate". Note: Si c'est la première fois que l'on active le logiciel de cette année sur cette compte, vous voyez le message ci-dessus à propos d'une license valide non trouvée. Vous pouvez ignorer cela.
tr_tr: Seri numarasını girin. "Activate" i tıklayın. Not: Bu yılki yazılımı bu hesapta ilk kez etkinleştiriyorsanız, geçerli bir lisansın bulunamadığına dair yukarıda gösterilen mesajı göreceksiniz. Bunu görmezden gelebilirsin.

source: NI Activation Wizard (3)
es_mx: Asistente de Activación de NI (3)
fr_ca: Assistant d'Activation NI (3)
tr_tr: NI Aktivasyon Sihirbazı (3)

source: |NI Activation Wizard 3|
tr_tr: |NI Aktivasyon Sihirbazı 3|

source: If your products activate successfully, an “Activation Successful” message will appear. If the serial number was incorrect, it will give you a text box and you can re-enter the number and select “Try Again”. If everything activated successfully, click “Next”.
es_mx: Si sus productos se activan correctamente, aparecerá el mensaje “Activation Successful". Si el número de serie es incorrecto, aparecerá un cuadro de texto y podrá volver a ingresar el número y seleccionar “Try Again". Si todo se activó correctamente, haga clic en “Next".
fr_ca: Si vos produits s'activent avec succès, un message "Activation Successful" apparaîtra. Si le numéro de série était incorrect, une zone de texte apparaîtera et vous pouvez retaper le numéro et sélectionner "Try Again". Si le tout s'est activé avec succès, cliquez "Next"
tr_tr: Ürünleriniz başarıyla etkinleştirilirse, "Activation Successful" mesajı görünecektir. Seri numarası yanlışsa, size bir metin kutusu verecektir ve numarayı yeniden girip "Try Again" yi seçebilirsiniz. Her şey başarıyla etkinleştirildiyse, "Next"i tıklayın.

source: NI Activation Wizard (4)
es_mx: Asistente de Activación de NI (4)
fr_ca: Assistant d'Activation NI (4)
tr_tr: NI Aktivasyon Sihirbazı (4)

source: |NI Activation Wizard 4|
tr_tr: |NI Aktivasyon Sihirbazı 4|

source: Click “Close”.
es_mx: Da click en "Close".
fr_ca: Cliquez "Close".
tr_tr: "Close" tuşuna tıklayın.

source: NI Update Service
es_mx: Servicio de Actualización de NI
fr_ca: Service de Mise à Jour NI
tr_tr: NI Güncelleme Servisi

source: You will be prompted whether to enable the NI update service. You can choose to not enable the update service.
es_mx: Se le preguntará si desea habilitar el servicio de actualización de NI. Puede elegir no habilitar el servicio de actualización.
fr_ca: Vous serez invité à activer le service de mise à jour NI. Vous pouvez chosir de ne pas l'activer, si vous le désirez.
tr_tr: NI güncelleme servisini etkinleştirip etkinleştirmemeniz sorulacaktır. Güncelleme hizmetini etkinleştirmemeyi seçebilirsiniz.

source: Reboot to Complete Installation
es_mx: Reiniciar para Completar la Instalación
fr_ca: Faire un redémarrage, pour compléter l'Installation.
tr_tr: Yüklemeyi tamamlamak için bilgisayarınızı yeniden başlatın.

source: If prompted, Select "Reboot Now" after closing any open programs.
es_mx: Si se le solicita, seleccione “Reebot now" después de cerrar cualquier programa abierto.
fr_ca: Si le programme le demande, sélectionnez "Reboot Now" après avoir fermé tous les programmes ouverts.
tr_tr: İstenirse, açık programları kapattıktan sonra "Reboot Now" ı seçin.

source: NI Package Manager License
es_mx: Licencia de NI Package Manager
fr_ca: License de Gestionnaire de Packages NI (NI Package Manager License)
