Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/how-to-wire-a-robot.po
Languages: fr_ca, pt, tr_tr

source: Wire should be 16AWG to 24AWG (consult rules to verify required gauge for power wiring)
fr_ca: Le calibre du fil devrait être entre 16AWG à 24AWG (consultez les règlements pour vérifier si le calibre requis est adéquat pour l'alimentation)
tr_tr: Kablo 16AWG ila 24AWG olmalıdır (güç kabloları için gerekli ölçüyü doğrulamak için kurallara bakın)

source: Wire ends should be stripped approximately 5/16"
fr_ca: Les extrémités de fil devrait être dénudées d'environ 5/16 (8mm)"
tr_tr: Kablo uçları yaklaşık 5/16" soyulmalıdır

source: To insert or remove the wire, press down on the corresponding "button" to open the terminal
fr_ca: Pour insérer ou retirer le fil, appuyez sur le petit picot, ou "bouton" correspondant pour ouvrir la borne.
tr_tr: Kabloyu takmak veya çıkarmak için, terminali açan düğmeye basın

source: After making the connection check to be sure that it is clean and secure:
fr_ca: Après avoir fait la connexion, vérifiez que c'est propre et sécurisé:
tr_tr: Bağlantıyı yaptıktan sonra temiz ve sağlam olduğundan emin olmak için:

source: Verify that there are no "whiskers" outside the connector that may cause a short circuit
fr_ca: Vérifiez qu'il n'y a aucun brin de fil qui dépasse à l'extérieur du connecteur, ce qui pourrait causer un court-circuit
tr_tr: Konnektörün dışında kısa devreye neden olabilecek hiçbir "kedi bıyığı" olmadığını doğrulayın

source: Tug on the wire to verify that it is seated fully. If the wire comes out and is the correct gauge it needs to be inserted further and/or stripped back further.
fr_ca: Ensuite, tirez sur le fil pour vérifiez que c'est bien solide. Si le fil sort du trou, et qu'il est du bon calibre, il faut alors le dénuder davantage et / ou l'insérer plus loin .
tr_tr: Tam olarak oturduğunu doğrulamak için kabloyu çekin. Ölçü doğru olmasına rağmen tel dışarı çıkar ise, daha fazla yerleştirilmesi ve / veya daha fazla sıyrılması gerekir.

source: roboRIO Power
fr_ca: L'alimentation du roboRIO
tr_tr: roboRIO Gücünü Bağlamak

source: Requires: 10A/20A mini fuses, Wire stripper, very small flat screwdriver, 18AWG Red and Black
fr_ca: Cela requiert: petits fusibles 10A / 20A, pince à dénuder, minuscule tournevis à tête plate, câble rouge et noir 18AWG
tr_tr: Gerekenler: 10A/20A mini sigortalar, kablo soyucu, çok küçük düz tornavida, 18AWG kırmızı ve siyah kablo

source: Insert the 10A and 20A mini fuses in the PDP in the locations shown on the silk screen (and in the image above)
fr_ca: Insérez les petits fusibles 10A et 20A dans le PDP aux locations illustrées sur la sérigraphie du PDP (et selon l'image ci-dessus)
tr_tr: 10A ve 20A mini sigortaları, silk screen'de (ve yukarıdaki resimde) gösterilen konumlara uygun şekilde PDP'ye takın.

source: Strip ~5/16" on both the red and black 18AWG wire and connect to the "Vbat Controller PWR" terminals on the PDB
fr_ca: Dénudez environ 5/16" (8mm) sur le fil rouge et noir 18AWG et connectez aux bornes "Vbat Controller PWR" sur le PDP
tr_tr: Hem kırmızı hem de siyah 18AWG kabloyu ~5/16" soyun ve PDP üzerindeki "Vbat Controller PWR" terminallerine bağlayın

source: Measure the required length to reach the power input on the roboRIO. Take care to leave enough length to route the wires around any other components such as the battery and to allow for any strain relief or cable management.
fr_ca: Mésurez la longeur nécessaire pour atteindre l'entrée d'alimentation sur le roboRIO. Prenez soin de laisser une longeur suffisante pour acheminer les fils autour de tout autre composant tel que le batterie et pour allouer assez de longueur pour gérer convenablement la disposition des câbles.
tr_tr: RoboRIO'daki güç girişine ulaşmak için gerekli uzunluğu ölçün. Kabloları akü gibi diğer bileşenlerin etrafından dolaştırmak ve herhangi bir gerilim azaltma veya kablo yönetimi sağlamak için yeterli uzunluk bırakmaya özen gösterin.

source: Cut and strip the wire.
fr_ca: Coupez et dénudez le fil.
tr_tr: Kabloyu kesin ve soyun.

source: Using a very small flat screwdriver connect the wires to the power input connector of the roboRIO (red to V, black to C). Also make sure that the power connector is screwed down securely to the roboRIO.
fr_ca: En utilisant le minuscule tournevis à tête plate, connectez les fils aux bornes d'alimentation du roboRIO (rouge à V, noir à C). Assurez aussi que le connecteur d'alimentation est vissé solidement au roboRIO.
tr_tr: Çok küçük bir düz tornavida kullanarak kabloları roboRIO'nun güç girişi konnektörüne bağlayın (kırmızıyı V'ye, siyahı C'ye). Ayrıca güç konnektörünün roboRIO'ya güvenli bir şekilde vidalandığından emin olun.

source: Voltage Regulator Module Power
fr_ca: L'alimentation du Régulateur de Tension
tr_tr: Voltaj Regülatör Modülü Gücünü Bağlamak

source: Requires: Wire stripper, small flat screwdriver (optional), 18AWG red and black wire:
fr_ca: Cela requiert: pince à dénuder, petit tournevis à tête plate (faculatif), fil rouge et noir 18AWG:
tr_tr: Gerekenler: Kablo soyucu, küçük düz tornavida (isteğe bağlı), 18AWG kırmızı ve siyah kablo

source: Strip ~5/16" on the end of the red and black 18AWG wire.
fr_ca: Dénudez environ 5/16" (8mm) sur l'extrémité des fils rouge et noir 18AWG.
tr_tr: Kırmızı ve siyah 18AWG kablonun ucunu ~5/16" soyun.

source: Connect the wire to one of the two terminal pairs labeled "Vbat VRM PCM PWR" on the PDP.
fr_ca: Connectez les fils à l'une des deux paires de bornes étiquetée "Vbat VRM PCM PWR" sur le PDP.
tr_tr: Kabloyu PDP'de "Vbat VRM PCM PWR" etiketli iki terminal çiftinden birine bağlayın.

source: Measure the length required to reach the "12Vin" terminals on the VRM. Take care to leave enough length to route the wires around any other components such as the battery and to allow for any strain relief or cable management.
fr_ca: Mesurez la longeur requise pour attendre les terminaux "12Vin" sur le VRM. Prenez soin de laisser une longeur suffisante pour achiminer les fils autours de tout autre composant tel que le batterie et allouez assez de longueur pour gérer convenablement la disposition des câbles.
tr_tr: VRM'deki "12Vin" terminallerine ulaşmak için gereken uzunluğu ölçün. Kabloları diğer bileşenlerin - akü gibi etrafından dolaştırmak ve herhangi bir gerginlik azaltma veya kablo yönetimine izin vermek için yeterli uzunluk bırakmaya özen gösterin.

source: Cut and strip ~5/16" from the end of the wire.
fr_ca: Coupez et dénudez environ 5/16" (8mm) de l'extrémité du fil.
tr_tr: Kabloyu kesin ve ~5/16" soyun.

source: Connect the wire to the VRM 12Vin terminals.
fr_ca: Connectez le fil aux terminaux 12Vin du VRM.
tr_tr: Kabloyu VRM 12Vin terminallerine bağlayın.

source: Pneumatics Control Module Power (Optional)
fr_ca: L'alimentation du Module de Contrôle Pneumatique (Optionnel)
tr_tr: Pneumatics Control Module - Pnömatik Kontrol Modülü Gücünü Bağlamak (Opsiyonel)

source: Requires: Wire stripper, small flat screwdriver (optional), 18AWG red and black wire
fr_ca: Cela requiert: Pince à dénuder, petit tournevis à tête plate (optionnel), câble rouge et noir 18AWG
tr_tr: Gerekenler: Kablo soyucu, küçük düz tornavida (isteğe bağlı), 18AWG kırmızı ve siyah kablo

source: Measure the length required to reach the "Vin" terminals on the PCM. Take care to leave enough length to route the wires around any other components such as the battery and to allow for any strain relief or cable management.
fr_ca: Mesurez la longeur requise pour attendre les terminaux "Vin" sur le PCM. Prenez soin de laisser une longeur suffisante pour achiminer les fils autours de tout autre composants tel que le batterie et et allouez assez de longueur pour gérer convenablement la disposition des câbles.
tr_tr: PCM'deki "Vin" terminallerine ulaşmak için gereken uzunluğu ölçün. Kabloları diğer bileşenlerin - akü gibi etrafından dolaştırmak ve herhangi bir gerginlik azaltma veya kablo yönetimine izin vermek için yeterli uzunluk bırakmaya özen gösterin.

source: Connect the wire to the PCM 12Vin terminals.
fr_ca: Connectez le fil aux terminaux 12Vin du PCM.
tr_tr: Kabloyu PCM 12Vin terminallerine bağlayın.

source: Radio Power and Ethernet
fr_ca: L'alimentation et le lien Ethernet de la Radio
tr_tr: Radyo Gücünü ve Ethernet'i Bağlamak

source: DO NOT connect the Rev passive POE injector cable directly to the roboRIO. The roboRIO MUST connect to the female end of the cable using an additional Ethernet cable as shown in the next step.
fr_ca: Ne connectez PAS le câble passif de type REV/POE directement au roboRIO. Le roboRIO DOIT être connecté à la radio en utilisant un câble Ethernet comme démontrée dans la prochaîne étape.
tr_tr: Rev POE enjektör kablosunu doğrudan roboRIO'ya BAĞLAMAYIN. RoboRIO, bir sonraki adımda gösterildiği gibi ek bir Ethernet kablosu kullanarak kablonun dişi ucuna BAĞLANMALIDIR.

source: Requires: Small flat screwdriver (optional), Rev radio PoE cable
fr_ca: Cela requiert: Petit Tournevis à tête plate (Optionnel), Câble POE de Radio REV
tr_tr: Gerekenler: Küçük düz tornavida (isteğe bağlı), Rev radyo PoE kablosu

source: Insert the ferrules of the passive PoE injector cable into the corresponding colored terminals on the 12V/2A section of the VRM.
fr_ca: Insérez les fils du câble d'alimentation pour la radio dans le connecteur 12V/2A du VRM.
tr_tr: Pasif PoE enjektör kablosunun yüksüklerini VRM'nin 12V / 2A bölümündeki ilgili renkli terminallere takın.

source: Connect the male RJ45 (Ethernet) end of the cable into the Ethernet port on the radio closest to the barrel connector (labeled 18-24v POE)
fr_ca: Connectez l'extrémité male RJ45 (Ethernet) dans le port Ethernet sur le radio le plus proche du connecteur cylindrique (étiqueté 18-24V POE)
tr_tr: Kablonun erkek RJ45 (Ethernet) ucunu radyodaki dişi konnektöre en yakın Ethernet bağlantı noktasına bağlayın (18-24v POE etiketli)

source: roboRIO to Radio Ethernet
fr_ca: Ethernet du roboRIO à la Radio
tr_tr: roboRIO'dan Radyo Ethernet'e

source: Requires: Ethernet cable
fr_ca: Cela requiert: Câble Ethernet
tr_tr: Gerekenler: Ethernet kablosu

source: Connect an Ethernet cable from the female RJ45 (Ethernet) port of the Rev Passive POE cable to the RJ45 (Ethernet) port on the roboRIO.
fr_ca: Connectez un câble Ethernet du port femelle RJ45 (Ethernet) au port RJ45 (Ethernet) du roboRIO.
tr_tr: Rev Pasif POE kablosunun dişi RJ45 (Ethernet) bağlantı noktasından roboRIO üzerindeki RJ45 (Ethernet) bağlantı noktasına bir Ethernet kablosu bağlayın.

source: CAN Devices
fr_ca: Les dispositifs CAN
tr_tr: CAN Cihazları

source: roboRIO to PCM CAN
fr_ca: CAN du roboRIO à PCM
tr_tr: roboRIO'dan PCM CAN'a

source: Requires: Wire stripper, small flat screwdriver (optional), yellow/green twisted CAN cable
fr_ca: Cela requiert: Pince à dénuder, petit tournevis à tête plate (optionnel), câble jaune / vert CAN torsadé
tr_tr: Gerekenler: Kablo soyucu, küçük düz tornavida (isteğe bağlı), sarı / yeşil kıvrılmış CAN kablosu

source: Strip ~5/16" off of each of the CAN wires.
fr_ca: Dénudez environ 5/16" (8mm) de chaque fil CAN
tr_tr: Her bir CAN kablosunu ~5/16" - 8 mm soyun.

source: Insert the wires into the appropriate CAN terminals on the roboRIO (Yellow->YEL, Green->GRN).
fr_ca: Insérez les fils dans les bornes approprié sur le roboRIO (Jaune->YEL, Vert->GRN).
tr_tr: Kabloları roboRIO üzerindeki uygun CAN terminallerine takın (Sarı-> YEL, Yeşil-> GRN).

source: Measure the length required to reach the CAN terminals of the PCM (either of the two available pairs). Cut and strip ~5/16" off this end of the wires.
fr_ca: Mesurez la longer requise pour atteindre les bornes CAN du PCM (n'importe quel des deux paires disponibles). Coupez et dénudez environ 5/16" (8mm) de l'extrémité des fils.
tr_tr: PCM'nin CAN terminallerine (mevcut iki çiftti de) ulaşmak için gereken uzunluğu ölçün. Kabloların bu ucunu kesip ~5/16" - 8 mm soyun.

source: Insert the wires into the appropriate color coded CAN terminals on the PCM. You may use either of the Yellow/Green terminal pairs on the PCM, there is no defined in or out.
fr_ca: Insérez les fils dans les bornes CAN selon le code de couleur approprié sur le PCM. Vous pouvez utiliser n'importe quelle paire de bornes jaune / vert sur le PCM.
tr_tr: Kabloları PCM'deki uygun renk kodlu CAN terminallerine takın. PCM'deki Sarı / Yeşil terminal çiftlerinden birini kullanabilirsiniz, tanımlanmış giriş veya çıkış yoktur.

source: PCM to PDP CAN
fr_ca: CAN du PCM au PDP
tr_tr: PCM'den PDP CAN'a

source: Insert the wires into the appropriate CAN terminals on the PCM.
fr_ca: Insérez les fils dans les bornes CAN appropriés sur le PCM.
tr_tr: Kabloları PCM üzerindeki uygun CAN terminallerine takın.

source: Measure the length required to reach the CAN terminals of the PDP (either of the two available pairs). Cut and strip ~5/16" off this end of the wires.
fr_ca: Mesurez la longeur requise pour atteindre les bornes CAN du PDP (l'une des deux paires disponibles). Coupez et dénudez environ 5/16" (8mm) de l'extrémité des fils.
tr_tr: PCM'nin CAN terminallerine (mevcut iki çifttinde) ulaşmak için gereken uzunluğu ölçün. Kabloların bu ucunu kesip ~5/16" - 8 mm soyun.

source: Insert the wires into the appropriate color coded CAN terminals on the PDP. You may use either of the Yellow/Green terminal pairs on the PDP, there is no defined in or out.
fr_ca: Insérez les fils dans les bornes CAN de code couleur approprié sur le PDP. Vous pouvez utilisé n'importe quelle paire de bornes jaune / vert sur le PDP.
tr_tr: Kabloları PDP üzerindeki uygun renk kodlu CAN terminallerine takın. PDP'deki Sarı / Yeşil terminal çiftlerinden birini kullanabilirsiniz, tanımlanmış giriş veya çıkış yoktur.

source: PWM Cables
fr_ca: Câbles PWM
tr_tr: PWM Kabloları

source: Requires: 4x PWM cables (if using non-integrated wire controllers), 2x PWM Y-cable (Optional)
fr_ca: Cela requiert: 4x câbles PWM (si vous utilisez des contrôleur sans fils intégrés), 2x câble Y PWM (Optionnel)
tr_tr: Gerekenler: 4 adet PWM kablo (harici kablolu sürücü kullanılıyorsa), 2 adet PWM Y kablosu (İsteğe bağlı)

source: Option 1 (Direct connect):
fr_ca: Option 1 (connexion directe):
tr_tr: Seçenek 1 (Doğrudan bağlantı):

source: Connect the PWM cables from each controller directly to the roboRIO. For Victor SPX's and other PWM/CAN controllers, the green wire (black wire for non-integrated controllers) should be towards the outside of the roboRIO. For controllers without integrated wires, make sure the controller side of the black wire is located according to the markings on the controller. It is recommended to connect the left side to PWM 0 and 1 and the right side to PWM 2 and 3 for the most straightforward programming experience, but any channel will work as long as you note which side goes to which channel and adjust the code accordingly.
fr_ca: Connectez les câbles PWM de chaque contrôleur directement au roboRIO. Pour les Victor SPXs et d'autre contrôleurs PWM ou CAN, le fil vert (fil noir pour les contrôleurs sans fil intégrés) devrait être vers l'extérieur du roboRIO. Pour les contrôleurs sans fils intégrés, assurez-vous que le fil noir sur le côté du contrôleur correspond au marquage sur le contrôleur. C'est recommandé de connecter le côté gauche du robot aux bornes PWM 0 et 1 et le côté droit aux bornes PWM 2 et 3 pour faciliter la programmation. Cependant, n'importe quel branchement fonctionnera convenablement si vous prenez soin de noter la disposition des PWMs et de changer le code en conséquence.
tr_tr: Sürücülerden gelen PWM kablolarını doğrudan roboRIO'ya bağlayın. Victor SPX'ler ve diğer PWM / CAN denetleyicileri için yeşil kablo (harici kablolu sürücüler için siyah kablo) roboRIO'nun dışına doğru olmalıdır. Harici kablolu sürücüler için, siyah kablonun sürücü tarafının sürücü üzerindeki işaretlere göre yerleştirildiğinden emin olun. En basit programlama deneyimi için sol tarafı PWM 0 ve 1'e, sağ tarafı PWM 2 ve 3'e bağlamanız önerilir, ancak hangi tarafın hangi kanala gittiğini not ettiğiniz ve kodu buna göre ayarladığınız sürece herhangi bir kanal çalışacaktır. .

source: Option 2 (Y-cable):
fr_ca: Option 2 (câble Y):
tr_tr: Seçenek 2 (Y kablosu):

source: Connect 1 PWM Y-cable to the PWM cables for the controllers controlling one side of the robot. The brown wire on the Y-cable should match the green/black wire on the PWM cable.
fr_ca: Connectez 1 câble Y PWM aux câbles PWM pur les contrôleurs sur un côté du robot. Le fil brun sur le câble Y devrait correspondre au cable vert/noir sur le câble PWM.
tr_tr: Robotun bir tarafını kontrol eden sürücülerin PWM kablolarına 1 PWM Y kablosunu bağlayın. Y kablosunun kahverengi kablosu, PWM kablosunun yeşil / siyah kablosuna denktir.

source: Connect the PWM Y-cables to the PWM ports on the roboRIO. The brown wire should be towards the outside of the roboRIO. It is recommended to connect the left side to PWM 0 and the right side to PWM 1 for the most straightforward programming experience, but any channel will work as long as you note which side goes to which channel and adjust the code accordingly.
fr_ca: Connectez les câbles Y PWM aux ports PWM sur le roboRIO. Le fil brun devrait être vers l'extérieur du roboRIO. Il est recommandé de connectez le côté gauche à PWM 0 et le côté droit à PWM 1 pour pour faciliter la programmation. Cependant, n'importe quel branchement fonctionnera convenablement si vous prenez soin de noter la disposition des PWMs et de changer le code en conséquence.
tr_tr: PWM Y kablolarını roboRIO üzerindeki PWM bağlantı noktalarına bağlayın. Kahverengi kablo roboRIO'nun dışına doğru olmalıdır. En basit programlama deneyimi için sol tarafı PWM 0'a ve sağ tarafı PWM 1'e bağlamanız önerilir, ancak hangi tarafın hangi kanala gittiğini not ettiğiniz ve kodu buna göre ayarladığınız sürece herhangi bir kanal çalışacaktır.

source: Robot Signal Light
fr_ca: La lumière de Signal du Robot
tr_tr: Robot Sinyal Işığı

source: Requires: Wire stripper, 2 pin cable, Robot Signal Light, 18AWG red wire, very small flat screwdriver
fr_ca: Cela requiert: Pince à dénuder, câble à 2 broches, Lumière de Signal du Robot, câble rouge 18AWG, minuscule tournevis à tête plate
tr_tr: Gerektenler: Kablo soyucu, 2 pin kablo, Robot Sinyal Işığı, 18AWG kırmızı kablo, çok küçük düz tornavida

source: Cut one end off of the 2 pin cable and strip both wires
fr_ca: Coupez une extrémité du câble à 2 broches et dénudez les deux fils
tr_tr: 2 pin kablonun bir ucunu kesin ve her iki kabloyu da soyun

source: Insert the black wire into the center, "N" terminal and tighten the terminal.
fr_ca: Insérez le fil noir dans la borne centrale "N" et serrez la borne.
tr_tr: Siyah teli ortaya, "N" terminaline sokun ve terminali sıkıştırın.

source: Strip the 18AWG red wire and insert into the "La" terminal and tighten the terminal.
fr_ca: Dénudez le fil rouge 18AWG et insérez-le dans la borne "La" et serrez la borne.
tr_tr: 18AWG kırmızı kabloyu soyun ve "La" terminaline yerleştirin ve terminali sıkıştırın.

source: Cut and strip the other end of the 18AWG wire to insert into the "Lb" terminal
fr_ca: Coupez et dénudez l'autre extrémité du fil 18AWG pour l'insérer dans la borne "Lb"
tr_tr: "Lb" terminaline yerleştirmek için 18AWG kablosunun diğer ucunu kesin ve soyun

source: Insert the red wire from the two pin cable into the "Lb" terminal with the 18AWG red wire and tighten the terminal.
fr_ca: Insérez le fil rouge du câble à deux broches dans la borne "Lb" avec le fil rouge 18AWG et serrez la borne.
tr_tr: İki pin kablodan kırmızı kabloyu 18AWG kırmızı tel ile "Lb" terminaline takın ve terminali sıkıştırın.

source: Connect the two-pin connector to the RSL port on the roboRIO. The black wire should be closest to the outside of the roboRIO.
fr_ca: Connectez le connecteur à deux broche au port RSL sur le roboRIO. Le fil noir devrait être plus proche à l'extérieur du roboRIO.
tr_tr: İki pin konnektörü roboRIO üzerindeki RSL bağlantı noktasına bağlayın. Siyah tel, roboRIO'nun dışına en yakın olmalıdır.

source: You may wish to temporarily secure the RSL to the control board using cable ties or Dual Lock (it is recommended to move the RSL to a more visible location as the robot is being constructed)
fr_ca: Il serait préférable de fixer temporairement le RSL au panneau de contrôle en utilisant des Zip-ties (Le RSL doit être très visible sur le robot).
tr_tr: RSL'yi plastik kelepçe veya Dual Lock kullanarak geçici olarak tahtanıza sabitlemek isteyebilirsiniz (robotunuzu yaparken RSL'yi daha görünür bir yere sabitlemeniz gerekli)

source: Circuit Breakers
fr_ca: Les disjoncteurs
tr_tr: Devre Kesiciler - Sigortalar

source: Requires: 4x 40A circuit breakers
fr_ca: Besoin: 4x disjoncteurs 40A
tr_tr: Gerektenler: 4 adet 40A sigorta

source: Insert 40-amp Circuit Breakers into the positions on the PDP corresponding with the Wago connectors the Talons are connected to. Note that, for all breakers, the breaker corresponds with the nearest positive (red) terminal (see graphic above). All negative terminals on the board are directly connected internally.
fr_ca: Insérez les disjoncteurs 40A dans les positions correspondantes aux connecteurs Wago sur le PDP. (ceux qui ont des fils reliés aux contrôleurs de moteurs). Notez que le disjoncteur correspond à la borne positive (rouge) la plus proche (voir graphique ci-dessus). Tout les bornes negatives sur le PDP sont électriquement reliées ensemble.
tr_tr: Talon'ların bağlı olduğu Wago terminallerine karşılık gelen PDP üzerindeki konumlara 40 amperlik sigortaları takın. Tüm sigortalar için, sigortanın en yakın pozitif (kırmızı) terminale karşılık geldiğini unutmayın (yukarıdaki grafiğe bakın). Panel üzerindeki tüm negatif terminaller doğrudan içten bağlanır.

source: If working on a Robot Quick Build, stop here and insert the board into the robot chassis before continuing.
fr_ca: Si vous optez de faire la Construction du Robot Rapide, arrêtez ici et insérez le panneau réalisé ci-haut dans le châssis de votre robot.
tr_tr: Bir deneme robotu üzerinde çalışıyorsanız, burada durun ve devam etmeden önce devre panosunu robot şasesine yerleştirin.

source: Motor Power
fr_ca: L'alimentation des Moteurs
tr_tr: Motorların Gücünü Bağlamak

source: Requires: Wire stripper, wire crimper, phillips head screwdriver, wire connecting hardware
fr_ca: Cela requiert: Pince à dénuder, sertisseur de fil, tournevis cruciforme, matériel de connexion de fil
tr_tr: Gerekenler: Kablo soyucu, kablo sıkıştırıcı, yıldız başlı tornavida, kablo bağlantı araçları

source: For each CIM motor:
fr_ca: Pour chaque moteur CIM:
tr_tr: Her CIM motoru için:

source: Strip the ends of the red and black wires from the CIM
fr_ca: Dénudez les extrémités des fils rouge et noir du CIM
tr_tr: CIM'in kırmızı ve siyah kablolarının uçlarını soyun

source: For integrated wire controllers (including Victor SPX):
fr_ca: Pour contrôleurs à fils intégrés (y compris Victor SPX):
tr_tr: Dahili kablolu motor sürücüler için (Victor SPX dahil):

source: Strip the white and green wires from the controller
fr_ca: Dénudez les fils blanc et vert du contrôleur
tr_tr: Sürücünün beyaz ve yeşil kablolarını soyun

source: Connect the motor wires to the controller output wires (it is recommended to connect the red wire to the white M+ output). The images/how-to-wire-a-robot above show examples using quick disconnect terminals.
fr_ca: Connectez les fils moteurs aux fils sortie du contrôleur (il est recommandé de connecter le fil rouge au fil blanc de sortie M+). Les images ci-dessus illustrent des exemples utilisant des bornes de déconnexion rapide.
tr_tr: Motor kablolarını sürücü çıkış kablolarına bağlayın (kırmızı kabloyu beyaz M+ çıkışına bağlamanız önerilir). Yukarıdaki resimler çıkarılıp takılabilen pabuçların kullanıldığı örnekleri gösteriyor.
