Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/how-to-wire-a-robot.po
Languages: fr_ca, pt, tr_tr

source: How to Wire an FRC Robot
fr_ca: Comment câbler un robot FRC
pt: Como fazer o cabeamento de um robô de FRC
tr_tr: FRC Robotu Nasıl Kablolanır

source: This document details the wiring of a basic electronics board for bench-top testing.
fr_ca: Ce document détaille le câblage des composants électronique de base pour un robot, afin de faire des tests de prototypage.
pt: Este documento descreve como fazer o cabeamento de uma placa com componentes eletrônicos para testes em bancada.
tr_tr: Bu döküman deneme amaçlı kullanılabilecek basit bir elektronik panelinin kablolanmasını açıklar.

source: Some images shown in this section reflect the setup for a Robot Control System using Spark motor controllers. Wiring diagram and layout should be similar for other motor controllers. Where appropriate, a second set of images shows the wiring steps for using PWM controllers with integrated wires.
fr_ca: Quelques images présentées dans cette section reflètent la configuration pour un système de contrôle de robot qui utilisent les contrôleurs de moteurs Spark. Le schéma de câblage et disposition devrait être similaire pour d'autre contrôleurs de moteurs. Le cas échéant, une deuxième séries d'images démontrait les étapes de câblage pour utiliser les contrôleurs PWM avec fils intégrés.
pt: Algumas das imagens presentes nessa seção demonstram o Setup do sistema de controle de um robô que utiliza controladores de motor Spark. Os diagramas e layouts do cabeamento a seguir são bem parecidos com o dos demais controladores. Há também um segundo conjunto de imagens que demonstram o passo-a-passo do cabeamento de controladores PWM com fios integrados.
tr_tr: Bu kısımdaki bazı görüntüler Spark motor sürücü kullanılarak yapılan bir Robot Kontrol Sistemini göstermektedir. Diğer motor sürücüler için de kabloların yerleşimi benzer olacaktır. Gerekli noktalarda PWM sürücülerin kendi kabloları ile kablolanmasını gösteren görüntüler dahildir.

source: Overview
fr_ca: Un survol des étapes
pt: Visão Geral
tr_tr: Genel Bakış

source: Diagram courtesy of FRC Team 3161 and Stefen Acepcion.
fr_ca: Ce diagramme est une gracieuseté de l’équipe FRC 3161 et Stefen Acepcion
pt: Diagramas são cortesias do Time de FRC 3161 e Stefen Acepcion.
tr_tr: FRC Team 3161 ve Stefen Acepcion'un izniyle şema.

source: Gather Materials
fr_ca: Rassembler des Matériaux
pt: Reúna Estes Materiais
tr_tr: Malzemeleri Topla

source: Locate the following control system components and tools
fr_ca: Localisez les outils et composants de système de contrôle suivants
pt: Encontre os seguintes componentes eletrônicos e ferramentas
tr_tr: Aşağıdaki kontrol sistemi bileşenlerini ve takımları edinin

source: Kit Materials:
fr_ca: Matériaux du Kit:
pt: Materiais do Kit:
tr_tr: Kit Malzemeleri

source: Power Distribution Panel (PDP)
fr_ca: Panneau de Distribution de Puissance (PDP)
tr_tr: Power Distribution Panel (PDP) - Güç Dağıtım Paneli

source: Pneumatics Control Module (PCM)
fr_ca: Module de Contrôle Pneumatique (MCP)
tr_tr: Pneumatics Control Module (PCM) - Pnömatik Kontrol Modülü

source: Voltage Regulator Module (VRM)
fr_ca: Régulateur de Tension (RT)
tr_tr: Voltage Regulator Module (VRM) - Voltaj Regülatör Modülü

source: OpenMesh radio (with power cable and Ethernet cable)
fr_ca: Radio OpenMesh (avec câble d'alimentation et câble Ethernet)
pt: OpenMesh radio (com seu cabo de alimentação e Ethernet)
tr_tr: OpenMesh radio (Güç kablosu ve ethernet kablosuyla)

source: Robot Signal Light (RSL)
fr_ca: Lumière de Signal de Robot (LSR)
tr_tr: Robot Signal Light (RSL) - Robot Sinyal Işığı

source: 4x Victor SPX or other speed controllers
fr_ca: 4x Victor SPX ou d'autre contrôleurs de vitesse
pt: 4x Victor SPX ou outro controlador de motor
tr_tr: 4x Victor SPX veya diğer hız kontrol cihazları

source: 2x PWM y-cables
fr_ca: 2x câbles en Y PWM
pt: 2x cabos PWM em Y
tr_tr: 2 adet PWM y-kablosu

source: 120A Circuit breaker
fr_ca: Disjoncteur 120A
pt: Disjuntor principal de 120A
tr_tr: 120A Circuit breaker - Devre Kesici

source: 4x 40A Circuit breaker
fr_ca: 4x Disjoncteur 40A
pt: 4x Fusíveis de 40A
tr_tr: 4 adet 40A Sigorta - Circuit Breaker

source: 6 AWG Red wire
fr_ca: Cable rouge 6 AWG
pt: Fio vermelho e preto de 6 AWG
tr_tr: 6 AWG Kırmızı kablo

source: 10 AWG Red/Black wire
fr_ca: Cable Rouge / Noir 10 AWG
pt: Fio vermelho e preto de 10 AWG
tr_tr: 10 AWG Kırmızı/Siyah Kablo

source: 18 AWG Red/Black wire
fr_ca: Cable Rouge / Noir 18 AWG
pt: Fio vermelho e preto de 18 AWG
tr_tr: 18 AWG Kırmızı/Siyah Kablo

source: 22AWG yellow/green twisted CAN cable
fr_ca: Câble CAN torsadé jaune / vert 22 AWG
pt: Fio amarelo e verde de 22AWG
tr_tr: 22AWG sarı/yeşil sargılı CAN kablosu

source: 16x 10-12 AWG (yellow) ring terminals (8x quick disconnect pairs if using integrated wire controllers)
fr_ca: 16x borne en anneau (jaune) 10-12 AWG (8x paires à déconnexion rapide si vous utilisez des contrôleurs à fil intégré)
pt: 16x 10-12 AWG terminais em olho (amarelos) (Ou 8x pares de conectores com desacoplamento rápido)
tr_tr: 16 adet 10-12 AWG (sarı) halka terminalleri (entegre kablolu kontrol cihazlar kullanılıyorsa 8 adet takıp çıkarılabilen kablo çifti)

source: 2x Andersen SB50 battery connectors
fr_ca: 2x connecteurs de batterie Anderson SB50
pt: 2x Anderson SB50 para baterias
tr_tr: 2xAndersen SB50 Batarya konnektörü

source: 6AWG Terminal lugs
fr_ca: Cosses à bornes 6 AWG
pt: Terminais em olho de 6 AWG
tr_tr: 6AWG Kablo Pabuçları

source: 12V Battery
fr_ca: Batterie 12V
pt: Bateria 12V
tr_tr: 12V Akü

source: Red/Black Electrical tape
fr_ca: Ruban électrique Rouge / Noir
pt: Fita isolante Vermelha/Preta
tr_tr: Kırmızı/Siyah Elektrik Bantı

source: Dual Lock material or fasteners
fr_ca: Ruban Velcro avec double bande adhésive, ou vis
pt: Dual Lock ou materiais para fixação
tr_tr: Dual Lock malzemesi veya bağlantı elemanları

source: Zip ties
fr_ca: Attaches de style Ty-rap ou Zip Ties
pt: Abraçadeiras plásticas
tr_tr: Plastik kelepçe

source: 1/4" or 1/2" plywood
fr_ca: Contre-plaqué 1/4" ou 1/2"
pt: Compensado de 1/2" ou 1/4". Ou Policarbonato
tr_tr: 1/4 "veya 1/2" kontrplak

source: Tools Required:
fr_ca: Outils Nécessaires:
pt: Ferramentas necessárias:
tr_tr: Gerekli Aletler:

source: Wago Tool or small flat-head screwdriver
fr_ca: Outil spécialisé pour le branchement aux connecteurs Wago ou encore petit tournevis à tête plate.
pt: Chave de fenda pequena ou a ferramenta Wago
tr_tr: Wago Aleti veya küçük düz başlı tornavida

source: Very small flat head screwdriver (eyeglass repair size)
fr_ca: Minuscule tournevis à tête plate (style réparation de lunettes)
pt: Chave de fenda muito pequena (do tipo utilizado em ajuste de óculos)
tr_tr: Oldukça küçük düz tornavida (gözlük tamir boyutu)

source: Philips head screw driver
fr_ca: Tournevis cruciforme
pt: Chave Phillips
tr_tr: Philips başlı tornavida

source: 5mm Hex key (3/16" may work if metric is unavailable)
fr_ca: Clé hexagonale 5mm (3/16" peut fonctionner si la métrique n'est pas disponible)
pt: Chave Allen de 5mm
tr_tr: 5 mm Altıgen anahtar - alyan (metrik yoksa 3/16"çalışabilir)

source: 1/16" Hex key
fr_ca: Clé hexagonale 1/16"
pt: Chave Allen de 1/16"
tr_tr: 1/16" Alyan

source: Wire cutters, strippers, and crimpers
fr_ca: Pinces coupantes, Pince à dénuder et pinces à sertir
pt: Alicate desencapador, crimpador e de corte
tr_tr: Yan keski, kablo soyucu ve kablo pabucu sıkıştırma pensesi

source: 7/16” box end wrench or nut driver
fr_ca: Clé de serrage ou tournevis à écrou 7/16"
pt: Chave de boca de 7/16"
tr_tr: 7/16”kapalı uçlu anahtar veya somun anahtarı

source: Create the Base for the Control System
fr_ca: Comment créer la Base, ou plaque de support pour le Système de Contrôle
pt: Produza a Base do para o Sistema de Controle
tr_tr: Kontrol Sistemini Monte Edecek Bir Yüzey Oluşturun

source: For a benchtop test board, cut piece of 1/4” or 1/2" material (wood or plastic) approximately 24" x 16". For a Robot Quick Build control board see the supporting documentation for the proper size board for the chosen chassis configuration.
fr_ca: Pour un panneau de prototypage, coupez un morceau de matériel 1/4" ou 1/2" (bois ou plastique) approximateiveent 24" x 16" (60cm x 40cm). Si vous désirez plutôt assembler un panneau de robot plus simplifié (Construction Rapide) veuillez voir la documentation supplémentaire pour obtenir la dimension spécifique pour ce panneau simplifié.
pt: Para a produção da placa, corte uma chapa (madeira ou plástico) de 1/4” ou 1/2" de espessura e aproximadamente 24" x 16"(60cm x 40cm) Se estiver construindo um chassi pré-fabricado, consulte a documentação e verifique o tamanho ideal para a configuração do chassi correspondente.
tr_tr: Tezgah üstü test tahtası için, 1/4 ”veya 1/2" malzemeden (ahşap veya plastik) yaklaşık 24 "x 16" bir parça kesin. Hızlı Robot Yapımı kontrol sistemi için seçtiğiniz şase konfigürasyonu ve tahta boyutuna göre yardımcı dökümana bakabilirsiniz.

source: Layout the Core Control System Components
fr_ca: Disposer les Composants du Système deContrôle de Base
pt: Organize os principais componentes do Sistema de Controle
tr_tr: Temel Kontrol Sistemi Bileşenlerini Düzenleme

source: Lay out the components on the board. An example layout is shown in the image above.
fr_ca: Disposez les composants sur la carte. Un exemple de disposition est illustré dans l'image ci-dessus.
pt: Posicione os componentes na placa. Um exemplo é mostrado na imagem acima.
tr_tr: Bileşenleri tahtaya yerleştirin. Yukarıdaki resimde örnek bir düzen gösterilmektedir.

source: Fasten Components
fr_ca: Comment fixer les Composants
pt: Fixe os componentes
tr_tr: Bileşenleri sabitleyin

source: Using the Dual Lock or hardware, fasten all components to the board. Note that in many FRC games robot-to-robot contact may be substantial and Dual Lock alone is unlikely to stand up as a fastener for many electronic components. Teams may wish to use nut and bolt fasteners or (as shown in the image above) cable ties, with or without Dual Lock to secure devices to the board.
fr_ca: En utilisant le ruban Velcro ou la quincaillerie, attachez tout les composants au panneau. Notez que lors des tournois FRC, les contacts entre les robots peuvent être intenses, et le Velcro peut quelquefois se détacher. L'usage de vis et écrous est de loin supérieur comme une façon de fixer les composants électriques de grande taille. Ou encore, l'emploi de zip-ties peut être adéquat..
pt: Utilizando fitas dupla-face (VHB por exemplo) ou ZIP ties, prenda todos componentes à placa. Tenha em mente que, em muitos dos jogos da FRC, há constante toque físico entre os robôs. Muitos times optam por utilizar fitas dupla face e, principalmente, ZIP ties para garantir a fixação apropriada dos componentes.
tr_tr: Dual Lock™ bant veya plastik kelepçe kullanarak, tüm bileşenleri panele sabitleyin. Birçok FRC oyununda robot bağlantısının önemli olabileceğini ve Dual Lock™ bantın tek başına birçok elektronik bileşeni tutamayacağını unutmayın. Bileşenlerini sabitlemek için vida ve somun veya (yukarıdaki resimde gösterildiği gibi) plastik kelepçe kullanmak isteyebilirsiniz.

source: Attach Battery Connector to PDP
fr_ca: Attacher le Connecteur de Batterie au PDP
pt: Fixe o conector da bateria à PDP
tr_tr: Akü konnektörünü PDP'ye Takın

source: Requires: Battery Connector, 6AWG terminal lugs, 1/16" Allen, 5mm Allen, 7/16" Box end
fr_ca: Cela requiert les items suivants: Connecteur de Batterie, Cosses à bornes 6AWG, Allen 1/16", Allen 5mm, Clé de serrage 7/16"
pt: Requer: Conector Anderson, Terminal olho de 6AWG , Allen de 1/16", Allen de 5mm e a chave de boca 7/16"
tr_tr: Malzemeler: Akü konnektörü, 6AWG kablo pabuçları, 1/16" alyan, 5mm alyan, 7/16" kapalı uç anahtar

source: Attach terminal lugs to battery connector:
fr_ca: Attachez les cosses à bornes au connecteur de batterie:
pt: Prenda os terminais em olho ao conector da bateria:
tr_tr: Kablo pabuçlarını akü konnektörüne takın.

source: Using a 1/16" Allen wrench, remove the two screws securing the PDP terminal cover.
fr_ca: En utilisant un clé Allen 1/16", retirez les deux vis fixant le couvercle des bournes du PDP.
pt: Utilizando a Allen 1/16", retire os dois parafusos que prendem a proteção dos terminais da PDP.
tr_tr: 1/16 "Alyen anahtarı kullanarak, PDP terminal kapağını sabitleyen iki vidayı çıkarın.

source: Using a 5mm Allen wrench (3/16" will work if metric is not available), remove the negative (-) bolt and washer from the PDP and fasten the negative terminal of the battery connector.
fr_ca: En utilisant un clé Allen 5mm (3/16" fonctionnera si vous ne possédez pas la taille métrique), retirez le boulon correspondant à la borne négative (-) du PDP et sa rondelle et attachez la borne négative du connecteur de batterie (couleur noire).
pt: Utilizando a Allen 5mm, remova o parafuso e a arruela que ficam rosqueados ao o polo negativo (-) da PDP e prenda o terminal negativo do conector da bateria.
tr_tr: 5 mm (veya 3/16") alyan anahtar kullanarak, negatif (-) cıvatayı ve pulu PDP'den çıkarın ve akü konnektörünün negatif pabucunu sabitleyin.

source: Using a 7/16" box end wrench, remove the nut on the "Batt" side of the main breaker and secure the positive terminal of the battery connector
fr_ca: En utilisant une clé de serrage 7/16", retirez l'écrou sur le côté "Batt" du disjoncteur principal et attachez la borne positive du connecteur de batterie (couleur rouge)
tr_tr: 7/16 "kapalı uçlu anahtar kullanarak, ana kesicinin" Akü "tarafındaki somunu çıkarın ve akü konektörünün pozitif terminalini sabitleyin

source: Wire Breaker to PDP
fr_ca: Câbler Disjoncteur au PDP
tr_tr: Kesiciyi PDP'ye bağlayın

source: Requires: 6AWG red wire, 2x 6AWG terminal lugs, 5mm Allen, 7/16" box end
fr_ca: Cela requiert: câble rouge 6AWG, 2x cosses à bornes 6AWG, Allen 5mm, clé de serrage 7/16"
tr_tr: Gerekenler: 6AWG kırmızı kablo, 2x 6AWG terminal pabuçları, 5 mm Alyen, 7/16 "kapalı uclu anahtar

source: Secure one terminal lug to the end of the 6AWG red wire. Using the 7/16" box end, remove the nut from the “AUX” side of the 120A main breaker and place the terminal over the stud. Loosely secure the nut (you may wish to remove it shortly to cut, strip, and crimp the other end of the wire). Measure out the length of wire required to reach the positive terminal of the PDP.
fr_ca: Securez une cosse à bornes au bout du câble 6AWG rouge. En utilisant la clé de serrage 7/16", retirez l'écrou du côté "AUX" du disjoncteur 120A principal et placez la borne sur la partie filetée. Visser l'écrou temporairement (plus tard, vous voudrez peut-être ôter le fil afin de couper et dénuder l'autre extrémité). Ensuite, mesurez la longeur du fil requise pour atteindre la borne positive du PDP.
tr_tr: Bir kablo pabucunu 6AWG kırmızı kablonun ucuna sabitleyin. 7/16" kapalı uç anahtarı kullanarak, 120A devre kesicinin "AUX" tarafındaki somunu sökün ve pabucu saplama vidanın üzerine yerleştirin. Somunu gevşek bir şekilde sabitleyin (kablonun diğer ucunu kesmek, soymak ve sıkıştırmak için çıkarnız gerekebilir) PDP'nin pozitif konektörüne ulaşmak için gereken kablonun uzunluğunu ölçün.

source: Cut, strip, and crimp the terminal to the 2nd end of the red 6AWG wire.
fr_ca: Coupez, dénudez et sertissez la borne au 2eme côte du câble rouge 6AWG.
tr_tr: Kırmızı 6AWG kablonun 2inci ucunu doğru uzunluğa kesin, soyun ve pabucu çakın.

source: Using the 7/16" box end, secure the wire to the "AUX" side of the 120A main breaker.
fr_ca: En utilisant la clé de serrage 7/16", attachez le cable sur le côté "AUX" du disjoncteur 120A principal.
tr_tr: 7/16" kapalı uç anahtarı kullanarak kabloyu 120A devre kesicinin "AUX" tarafına sabitleyin.

source: Using the 5mm, secure the other end to the PDP positive terminal.
fr_ca: En utilisant le clé Allen 5mm, sécurisez l'autre côté à la borne positive du PDP.
tr_tr: 5 mm alyanı kullanarak, diğer ucu PDPnin pozitif konektörüne sabitleyin.

source: Insulate PDP connections
fr_ca: Isolation des connexions au PDP
tr_tr: PDP bağlantılarını yalıtın

source: Requires: 1/16" Allen, Electrical tape
fr_ca: Cela requiert: Allen 1/16", Ruban électrique
tr_tr: Gerekenler: 1/16" Alyan, Elektrik bandı

source: Using electrical tape, insulate the two connections to the 120A breaker. Also insulate any part of the PDP terminals which will be exposed when the cover is replaced. One method for insulating the main breaker connections is to wrap the stud and nut first, then use the tape wrapped around the terminal and wire to secure the tape.
fr_ca: En utilisant du ruban électrique, isolez les deux connexions au disjoncteur 120A. Isolez aussi n'importe quelle partie des bornes PDP qui seront exposé lorsque le couvercle est remis en place. Une méthode pour isoler les connexions du disjoncteur principal est d'envelopper en premier la partie filetée et l'écrou, ensuite on enroule le ruban autour de la borne et du câble en faisant plusieurs tours afin de sécuriser le tout.
tr_tr: Elektrik bandı kullanarak 120A devre kesiciye giden iki bağlantıyı yalıtın. Ayrıca PDP konektörlerinin kapağı kaldırıldığında açığa çıkacak herhangi bir parçasını da yalıtın. Devre kesici bağlantılarını yalıtmanın bir yolu, önce saplamayı ve somunu sarmak, ardından somunun etrafındaki bandı sabitlemek için pabuç ve telin etrafına sarılmış bandı kullanmaktır.

source: Using the 1/16" Allen wrench, replace the PDP terminal cover
fr_ca: En utilisant la clé Allen 1/16", replacer le cache-borne PDP
tr_tr: 1/16" alyan anahtarı kullanarak PDP pabuç kapağını takın

source: Wago connectors
fr_ca: Connecteurs Wago
tr_tr: Wago konnektörleri

source: The next step will involve using the Wago connectors on the PDP. To use the Wago connectors, insert a small flat blade screwdriver into the rectangular hole at a shallow angle then angle the screwdriver upwards as you continue to press in to actuate the lever, opening the terminal. Two sizes of Wago connector are found on the PDP:
fr_ca: La prochaîne étape consiste à relier les fils aux connecteurs Wago sur le PDP. Pour utiliser les connecteurs Wago, insérez un petit tournevis à tête plate dans le trou rectangulaire à un angle peu prononcé (presque à l'horizontale) puis incliner le tournevis vers le haut pendant que vous continuez à appuyer pour actionner le levier, ce qui ouvre la borne. Le PDP a deux tailles de connecteurs Wago:
tr_tr: Sonraki adımda PDP'deki Wago konnektörlerini kullanmamız gerekecek. Wago konnektörlerini kullanmak için, dikdörtgen deliğe küçük bir düz uçlu tornavidayı, yere yaklaşık paralel olacak şekilde sokun ve ardından terminali açmak için tornavidayı hafifçe yukarı kaldırarak kablo kıskacını açın. PDP'de iki boyutta Wago konektörü bulunur:

source: Small Wago connector: Accepts 10AWG-24AWG, strip 11-12mm (~7/16")
fr_ca: Petit Connecteur Wago : Accepte 10AWG-24AWG, dénudez 11-12mm (environ 7/16")
tr_tr: Küçük Wago konnektörü: 10AWG-24AWG boyutları arasında kabul eder, kablonuzu 11-12mm (~7/16") kadar bakır gözükecek şekilde soyun

source: Large Wago connector: Accepts 6AWG-12AWG, strip 12-13mm(~1/2")
fr_ca: Gros Connecteur Wago : Accepte 6AWG-12AWG, dénudez 12-13mm (environ 1/2")
tr_tr: Büyük Wago konnektörü: 6AWG-12AWG boyutları arasında kablo kabul eder, kablonuzu 12-13mm(~1/2") kadar bakır gözükecek şekilde soyun

source: To maximize pullout force and minimize connection resistance wires should not be tinned (and ideally not twisted) before inserting into the Wago connector.
fr_ca: Pour maximiser la résistance mécanique à l'arrachement et minimiser la résistance électrique, les fils ne doivent pas être étamés (et idéalement non- torsadés) avant d'être inséré dans le connecteur Wago.
tr_tr: Kıstırma kuvvetini en üst düzeye çıkarmak ve bağlantı direncini en aza indirmek için, teller Wago konnektörüne takılmadan önce lehimlenmemeli (ve tercihen bükülmemelidir).

source: Motor Controller Power
fr_ca: L'alimentation du Contrôleur de Moteur
tr_tr: Motor Sürücüyü Güce Bağlamak

source: Requires: Wire Stripper, Small Flat Screwdriver, 10 or 12 AWG wire, 10 or 12 AWG fork/ring terminals (terminal controllers only), wire crimper
fr_ca: Cela requiert: Pince à dénuder, petit tournevis à tête plate, câble 10 ou 12 AWG, borne en anneau / en fourchette 10 ou 12AWG (contrôleurs à bornes seulement), sertisseur de fil
tr_tr: Malzemeler: Kablo soyucu, küçük düz tornavida, 10 veya 12 AWG kablo, 10 veya 12 AWG çatal / halka pabuçlar (sadece motor kontrolcüde vida tipi bağlantı varsa gerekli), kablo soyucu/pabuç çakma pensesi

source: For Victor SPX or other wire integrated motor controllers (top image):
fr_ca: Pour le Victor SPX ou les autres types de contrôleurs de moteur à fil intégré (voir image du haut):
tr_tr: Victor SPX veya diğer kendinden kablolu motor sürücüler için (üstteki resim):

source: Cut and strip the red and black power input wires wire, then insert into one of the 40A (larger) Wago terminal pairs.
fr_ca: Coupez et dénudez les câbles d'alimentation rouge et noir, ensuite insérez-les dans une des paires de bornes Wago 40A (les plus grosses).
tr_tr: Kırmızı ve siyah güç giriş kablolarını kesin ve soyun, ardından 40A (büyük) Wago terminal çiftlerinden birine takın.

source: For terminal motor controllers (bottom image):
fr_ca: Pour les contrôleurs de moteur avec bornes (image du bas):
tr_tr: Vida tipi bağlantılı motor sürücüleri için (alttaki resim):

source: Cut red and black wire to appropriate length to reach from one of the 40A (larger) Wago terminal pairs to the input side of the speed controller (with a little extra for the length that will be inserted into the terminals on each end)
fr_ca: Mesurer la distance requise pour relier les câbles rouge et noir à une des paires de bornes Wago 40A (les plus grosses). Ajouter quelques centimètres de plus, et ensuite couper les fils.
tr_tr: 40A (büyük) Wago terminal çiftlerinden birinden kırmızı ve siyah kabloyu motor sürücünün giriş tarafına ulaşacak uzunlukta kesin (her iki uçtaki pabuçlara eklenecek uzunluk için biraz fazladan kablo bırakın)

source: Strip one end of each of the wires, then insert into the Wago terminals.
fr_ca: Dénudez une extrémité de chaque fil, ensuite insérez dans les bornes Wago.
tr_tr: İki kablonun da bir ucunu soyun, Wago terminallerine yerleştirin.

source: Strip the other end of each wire, and crimp on a ring or fork terminal
fr_ca: Dénudez l'autre extrémité de chaque fil, et sertissez une borne en anneau ou à fourchette.
tr_tr: İki kablonun da diğer ucunu soyun ve bir halka veya çatal pabuç ile sıkıştırın

source: Attach the terminal to the speed controller input terminals (red to +, black to -)
fr_ca: Attachez la borne aux entrées du contrôleur de vitesse (rouge à +, noir à -)
tr_tr: Pabucları motor sürücü giriş terminallerine takın (kırmızı + 'ya, siyah -'ye)

source: Weidmuller Connectors
fr_ca: Les connecteurs Weidmuller
tr_tr: Weidmuller Konnektörleri

source: The correct strip length is ~5/16" (8mm), not the 5/8" mentioned in the video.
fr_ca: La longeur dénudée correcte est à peu près de 5/16" (8mm), pas 5/8" comme mentionné dans le vidéo.
tr_tr: Doğru şerit uzunluğu videoda bahsedilenin aksine 5/8" değil, 5/16" (8mm) dir.

source: A number of the CAN and power connectors in the system use a Weidmuller LSF series wire-to-board connector. There are a few things to keep in mind when using this connector for best results:
fr_ca: Certains connecteurs pour le bus CAN et l'alimentation basse puissance utilisent une série de connecteur de type Weidmuller LSF. Voici quelques conseils à retenir lorsque vous utilisez ce type de connecteur pour obtenir les meilleurs résultats:
tr_tr: Sistemdeki bazı CAN ve güç konnektörleri, Weidmuller LSF serisi kablodan-karta konnektöri kullanır. En iyi sonuçlar için bu konnektörü kullanırken akılda tutulması gereken birkaç nokta vardır:
