Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/how-to-wire-a-robot.po
Languages: fr_ca, pt, tr_tr

source: For Sparks or other non-integrated-wire controllers:
fr_ca: Pour les Sparks ou autres contrôleurs sans fils intégrés:
tr_tr: Spark veya diğer harici kablolu sürücüler için:

source: Crimp a ring/fork terminal on each of the motor wires.
fr_ca: Sertissez une borne d'anneau / de fourchette sur chacun des fils moteur
tr_tr: Motor kablolarının her birinin ucuna birer halka/çatal pabuç sıkın

source: Attach the wires to the output side of the motor controller (red to +, black to -)
fr_ca: Attachez les fils sur la sortie du contrôleur de moteur (rouge à +, noir à -)
tr_tr: Kabloları motor sürücünün çıkış tarafına bağlayın (kırmızı +, siyah -)

source: STOP
tr_tr: DUR

source: Before plugging in the battery, make sure all connections have been made with the proper polarity. Ideally have someone that did not wire the robot check to make sure all connections are correct.
fr_ca: Avant de brancher le batterie, assurez-vous que tout les connexions ont été faites avec la bonne polarité. Idéalement, demander à quelqu'un qui n'a pas câble le robot de réviser que tout les connexions soient correctes.
tr_tr: Aküyü takmadan önce tüm bağlantıların doğru taraflara yapıldığından emin olun. Mümkünse tüm bağlantıların doğru olduğundan emin olmak için robotu daha önce kablolamamış birine kontrol ettirin.

source: Start with the battery and verify that the red wire is connected to the positive terminal
fr_ca: Commencez avec le batterie et vérifiez que le fil rouge est connecté à la borne positive
tr_tr: Aküyle başlayın ve kırmızı kablonun pozitif terminale bağlı olduğunu doğrulayın

source: Check that the red wire passes through the main breaker and to the + terminal of the PDP and that the black wire travels directly to the - terminal.
fr_ca: Vérifiez que le fil rouge passe à travers le disjoncteur principal et aboutit à la borne + du PDP et que le fil noir se rend directement à la borne -.
tr_tr: Kırmızı kablonun ana kesiciden ve PDP'nin + terminalinden geçtiğini ve siyah kablonun doğrudan - terminaline gittiğini kontrol edin.

source: For each motor controller, verify that the red wire goes from the red PDP terminal to the Red wire on the Victor SPX (not the white M+!!!!)
fr_ca: Pour chaque contrôleur de moteur, vérifiez que le fil rouge va de la borne rouge du PDP au fil rouge sur le Victor SPX (Pas le M+ blanc!!!!)
tr_tr: Her motor sürücü için, kırmızı kablonun kırmızı PDP terminalinden Victor SPX üzerindeki Kırmızı kabloya gittiğini doğrulayın (beyaz M + değil !!!!).

source: For each device on the end of the PDP, verify that the red wire connects to the red terminal on the PDP and the red terminal on the component.
fr_ca: Pour chaque dispositif relié au PDP, vérifiez que le fil rouge est bien connecté à la borne rouge sur le PDP et à la borne rouge du composant.
tr_tr: PDP'nin ucundaki her cihaz için, kırmızı kablonun PDP'deki kırmızı terminale ve bileşen üzerindeki kırmızı terminale bağlandığını doğrulayın.

source: Make sure that the orange Passive PoE cable is plugged directly into the radio NOT THE roboRIO! It must be connected to the roboRIO using an additional Ethernet cable.
fr_ca: Vérifiez que le câble orange de POE passif est branché directement à la radio, et non au roboRIO! Il doit être connecté au roboRIO en utilisant un câble d'Ethernet supplémentaire.
tr_tr: Turuncu Pasif PoE kablosunun doğrudan radyoya takıldığından emin olun, roboRIO'ya DEĞİL! Ek bir Ethernet kablosu kullanılarak roboRIO'ya bağlanmalıdır.

source: It is also recommended to put the robot on blocks so the wheels are off the ground before proceeding. This will prevent any unexpected movement from becoming dangerous.
fr_ca: C'est aussi recommandé de mettre le robot sur des blocs afin que les roues ne touchent pas le sol ou la table de travail avant de procéder. Cette précaution évitera que le robot se déplace de façon dangereuse.
tr_tr: İlk testinizi yaparken robotu tekerlekler hiçbir yere değmeyecek şekilde bir zemin üzerine koymanızı da öneriyoruz. Bu, herhangi bir beklenmedik hareketin tehlikeli hale gelmesini önleyecektir.

source: Manage Wires
fr_ca: La gestion des Câbles
tr_tr: Kabloları Düzenlemek

source: Requires: Zip ties
fr_ca: Besoin: Attaches Zip Ties
tr_tr: Gerekenler: Plastik Kelepçe

source: Now may be a good time to add a few zip ties to manage some of the wires before proceeding. This will help keep the robot wiring neat.
fr_ca: A ce moment, il serait préférable d'ajouter quelques Zip Ties pour placer convenablement les câbles avant de procéder plus loin. Cela aidera à garder le câblage du robot ordonné.
tr_tr: Devam etmeden önce bazı kabloları düzenlemek için birkaç kelepçe eklemenin şimdi tam zamanı olabilir. Bu, robot kablolarının temiz kalmasına yardımcı olacaktır.

source: Connect Battery
fr_ca: Connecter la Batterie
tr_tr: Aküyü Bağlayın

source: Connect the battery to the robot side of the Andersen connector. Power on the robot by moving the lever on the top of the 120A main breaker into the ridge on the top of the housing.
fr_ca: Connectez le batterie au côté robot du connecteur Andersen. Démarrez le robot en déplaçant le levier sur le dessus du disjoncteur principal 120A .
tr_tr: Aküyü Andersen konnektörünün robot tarafına bağlayın. 120A devre kesicinin üstündeki küçük şalteri kapatarak robotu çalıştırın.

source: If stuff blinks, you probably did it right. From here, you should connect to the roboRIO and try uploading your code!
fr_ca: Si les lumières clignotent, vous avez probablement réussi. A partir d'ici, vous seriez en mesure de vous connecter au roboRIO et d'essayez de télécharger votre code!
tr_tr: Bir şeyler yanıp sönüyorsa, muhtemelen doğru yapmışsınızdır. Şimdi roboRIO'ya bağlanmalı ve kodunuzu yüklemeyi denemelisiniz!
