Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/imaging-your-roborio.po
Languages: fr_ca, tr_tr

source: Imaging your roboRIO
fr_ca: Imager votre roboRIO
tr_tr: RoboRIO'nuzu görüntüleme

source: Before imaging your roboRIO, you must have completed installation of the :doc:`FRC Game Tools<frc-game-tools>`. You also must have the roboRIO power properly wired to the Power Distribution Panel. Make sure the power wires to the roboRIO are secure and that the connector is secure firmly to the roboRIO (4 total screws to check).
fr_ca: Avant d'imager votre roboRIO, vous devez avoir terminé l'installation des :doc:`Outils de Jeu FRC <frc-game-tools>`. Vous devez aussi avoir les fils d'alimentation du roboRIO reliés correctement au Panneau de Distribution de Puissance. Assurez-vous que les fils allant au roboRIO soient sécures et que le connecteur est solidement fixé au roboRIO (4 vis en tout à vérifier).
tr_tr: RoboRIO'nuzu görüntülemeden önce, :doc:`FRC Game Tools<frc-game-tools>` kurulumunu tamamlamış olmanız gerekir. Ayrıca roboRIO gücünün Power Distribution Panel uygun şekilde kablolanmış olması gerekir. RoboRIO'ya giden güç kablolarının sağlam olduğundan ve konektörün roboRIO'ya sıkıca sabitlendiğinden emin olun (kontrol edilecek toplam 4 vida).

source: Configuring the roboRIO
fr_ca: Configuration du roboRIO
tr_tr: RoboRIO’yu yapılandırma

source: The roboRIO Imaging Tool will be used to image your roboRIO with the latest software.
fr_ca: L'Outil d'Imagerie du roboRIO sera utilisé pour imager votre roboRIO avec le dernier logiciel.
tr_tr: RoboRIO Imaging Tool, roboRIO'nuzu en son yazılımla formatlamak için kullanılacaktır.

source: USB Connection
fr_ca: Connexion USB
tr_tr: USB Bağlantısı

source: Connect a USB cable from the roboRIO USB Device port to the PC. This requires a USB Type A male (standard PC end) to Type B male cable (square with 2 cut corners), most commonly found as a printer USB cable.
fr_ca: Connectez un câble USB du roboRIO au PC. Cela nécessite un câble USB type A mâle (extrémité de PC standard) à Type B male (carré avec 2 coins coupés), le plus souvent trouvé comme câble USB d'imprimante.
tr_tr: RoboRIO USB Aygıtı bağlantı noktasından bilgisayara bir USB kablosu bağlayın. Bu, genellikle bir yazıcı USB kablosu olarak bulunan, USB Type A erkek (standart PC ucu) ile Tip B erkek kablo (2 kesik köşeli kare) gerektirir.

source: The roboRIO should only be imaged via the USB connection. It is not recommended to attempt imaging using the Ethernet connection.
fr_ca: Le roboRIO devrait seulement être imagé par le connexion USB. Ce n'est pas recommandé d'utiliser la connexion Ethernet pour créer l'image.
tr_tr: RoboRIO yalnızca USB bağlantısı aracılığıyla imajlanmalıdır. Ethernet bağlantısını kullanarak imaj atmaya çalışmanız önerilmez.

source: Driver Installation
fr_ca: Installation des pilotes (Drivers)
tr_tr: Sürücü Kurulumu

source: The device driver should install automatically. If you see a "New Device" pop-up in the bottom right of the screen, wait for the driver install to complete before continuing.
fr_ca: Les pilotes devraient s'installer automatiquement. Si vous voyez un pop-up "New Device" en bas à droite de l'écran, attendez que l'installation du pilote soit terminée avant de continuer.
tr_tr: Aygıt sürücüsü otomatik olarak kurulmalıdır. Ekranın sağ alt köşesinde bir "Yeni Aygıt" açılır penceresi görürseniz, devam etmeden önce sürücü kurulumunun tamamlanmasını bekleyin.

source: Launching the Imaging Tool
fr_ca: Démarrage de l'Outil d'Imagerie
tr_tr: Imaging Tool Aracını Başlatma

source: The roboRIO imaging tool and latest image are installed with the NI FRC Game Tools. Launch the imaging tool by double clicking on the shortcut on the Desktop. If you have difficulties imaging your roboRIO, you may need to try right-clicking on the icon and selecting Run as Administrator instead.
fr_ca: Le "roboRIO imaging tool" et la toute dernière image sont installés en utilisant les Outils de Jeu FRC NI. Démarrez "roboRIO imaging tool" en faisant un double-clic sur l'icône (raccourci). Si vous avez des problèmes avec "roboRIO imaging tool", vous pouvez alors faire un clic-droit sur l'icône et selectionnez "Run as Administrator" à la place.
tr_tr: RoboRIO imaj atma aracı ve en son imaj dosyası, NI FRC Game Tool ile yüklenir. Masaüstündeki kısayola çift tıklayarak görüntüleme aracını başlatın. RoboRIO'nuzu görüntülemede zorluk yaşıyorsanız, simgeye sağ tıklayıp bunun yerine Yönetici Olarak Çalıştır'ı seçmeniz gerekebilir.

source: The roboRIO imaging tool is also located at ``C:\Program Files (x86)\National Instruments\LabVIEW YYYY\project\roboRIO Tool`` where YYYY is the current year - 1. If it's 2020, the directory would be ``LabVIEW 2019``.
fr_ca: Le "roboRIO imaging tool" est également situé à ``C:\Program Files (x86)\National Instruments\LabVIEW YYYY\project\roboRIO Tool`` où YYYY est l'année actuelle - 1. Si c'est 2020, le répertoire serait `LabVIEW 2019``.
tr_tr: RoboRIO imajlama aracı, YYYY'nin ait olduğu yıl -1 olan ``C:\Program Files (x86)\National Instruments\LabVIEW YYYY\project\roboRIO Tool`` konumunda da bulunur. 2020 ise, dizin ``LabVIEW 2019``.

source: roboRIO Imaging Tool
fr_ca: Outil d'Imagerie de roboRIO
tr_tr: roboRIO Imaging Tool - İmaj atma aracı

source: After launching, the roboRIO Imaging Tool will scan for available roboRIOs and indicate any found in the top left box. The bottom left box will show information and settings for the roboRIO currently selected. The right hand pane contains controls for modifying the roboRIO settings:
fr_ca: Après le lancement, "roboRIO Imaging Tool" va scanner pour trouver des roboRIO disponibles et indiquer ceux qui sont trouvés en haut à gauche de l'écran. En bas et à gauche de l'écran, on peut visualiser l'information et les paramètres pour le roboRIO actuellement choisi. Le volet de droite contient les contrôles pour modifier les paramètres du roboRIO:
tr_tr: Başlatıldıktan sonra roboRIO Imaging Tool, mevcut roboRIO'ları tarayacak ve sol üst kutuda bulunanları gösterecektir. Sol alttaki kutu, halihazırda seçili roboRIO için bilgi ve ayarları gösterecektir. Sağdaki bölme, roboRIO ayarlarını değiştirmek için kontroller içerir:

source: **Edit Startup Settings** - This option is used when you want to configure the startup settings of the roboRIO (the settings in the right pane), without imaging the roboRIO.
fr_ca: **Edit Startup Settings** - Cette option est utilisée pour quand vous voulez configurer les paramètres de démarrage du roboRIO (les paramètres dans le volet droit), sans imager le roboRIO.
tr_tr: **Edit Startup Settings** - Bu seçenek, roboRIO'yu görüntülemeden roboRIO'nun başlangıç ayarlarını (sağ bölmedeki ayarlar) yapılandırmak istediğinizde kullanılır.

source: **Format Target** - This option is used when you want to load a new image on the roboRIO (or reflash the existing image). This is the most common option.
fr_ca: **Format Target** - Cette option est utilisée quand vous voulez charger une nouvelle image sur le roboRIO (où de reflasher l'image existante). C'est l'option la plus courante.
tr_tr: **Format Target** - Bu seçenek, roboRIO'ya yeni bir imaj yüklemek (veya mevcut görüntüyü yeniden atmak) istediğinizde kullanılır. Bu en yaygın seçenektir.

source: **Update Firmware** - This option is used to update the roboRIO firmware. For this season, the imaging tool will require roboRIO firmware to be version 5.0 or greater.
fr_ca: **Update Firmware** - Cette option est utilisé pour mettre à jour le micrologiciel du roboRIO. Pour cette saison, il faut le micrologiciel de roboRIO version 5.0 ou supérieure.
tr_tr: **Update Firmware** - Bu seçenek, roboRIO aygıt yazılımını güncellemek için kullanılır. Bu sezon için, görüntüleme aracı roboRIO aygıt yazılımının 5.0 veya üzeri sürümünü gerektirecek.

source: Updating Firmware
fr_ca: Mettre à Jour le Micrologiciel
tr_tr: Updating Firmware - Donanım Yazılımını Güncelleme

source: roboRIO firmware must be at least v5.0 to work with the 2019 image. If your roboRIO is at least version 5.0 (as shown in the bottom left of the imaging tool) you do not need to update.
fr_ca: Le micrologiciel de roboRIO doit être au moins la version 5.0 pour fonctionner avec l'image 2019. Si votre roboRIO a la version 5.0 ou plus (comme montré en bas à gauche de l'écran) vous n'avez pas besoin de mise à jour.
tr_tr: roboRIO donanım yazılımının 2019 imajıyla çalışması için en az v5.0 olması gerekir. RoboRIO'nuz en az 5.0 sürümüyse (imaging tool aracının sol alt kısmında gösterildiği gibi) güncelleme yapmanız gerekmez.

source: To update roboRIO firmware:
fr_ca: Pour mettre à jour le micrologiciel roboRIO:
tr_tr: RoboRIO donanım yazılımını güncellemek için:

source: Make sure your roboRIO is selected in the top left pane.
fr_ca: Assurez-vous que votre roboRIO est selectionné dans volet supérieur gauche.
tr_tr: Sol üst bölmede roboRIO'nuzun seçildiğinden emin olun.

source: Select Update Firmware in the top right pane
fr_ca: Selectionnez Update Firmware dans le volet supérieur droit
tr_tr: Sağ üst bölmede Update Firmware'yi seçin

source: Enter a team number in the Team Number box
fr_ca: Entrez votre numéro d'équipe dans la boîte Team Number
tr_tr: Takım Numarası kutusuna bir takım numarası girin

source: Select the latest firmware file in the bottom right
fr_ca: Selectionnez le dernier fichier de micrologiciel en bas à droite
tr_tr: Sağ alttaki en son üretici yazılımı dosyasını seçin

source: Click the **Update** button
fr_ca: Cliquez le bouton **Update**
tr_tr: **Update** düğmesini tıklayın

source: Imaging the roboRIO
fr_ca: Imager le roboRIO
tr_tr: RoboRIO’ya Imaj atmak

source: Make sure the roboRIO is selected in the top left pane
fr_ca: Assurez-vous que le roboRIO est selectionné dans le volet supérieur gauche
tr_tr: Sol üst bölmede roboRIO'nun seçildiğinden emin olun

source: Select Format Target in the right pane
fr_ca: Selectionnez Format Target dans le volet du droite
tr_tr: Sağ bölmede Format Target'ı seçin

source: Enter your team number in the box
fr_ca: Entrez votre numéro d'équipe dans le boîte
tr_tr: Takım numaranızı kutuya girin

source: Select the latest image version in the box.
fr_ca: Selectionnez la dernière version d'image dans la boîte
tr_tr: Kutudaki en son görüntü sürümünü seçin.

source: Click Reformat to begin the imaging process.
fr_ca: Cliquez Reformat pour commencez le processus.
tr_tr: İmaj atma sürecini başlatmak için Reformat'a tıklayın.

source: Imaging Progress
fr_ca: Processus de création de l'image
tr_tr: İmaj Atma İlerlemesi

source: The imaging process will take approximately 3-10 minutes. A progress bar in the bottom left of the window will indicate progress.
fr_ca: Le processus de création d'image prendra environ 3-10 minutes. Une barre de progression en bas à gauche de la fenêtre indique le progrès.
tr_tr: Görüntüleme işlemi yaklaşık 3-10 dakika sürecektir. Pencerenin sol alt kısmındaki ilerleme çubuğu, ilerlemeyi gösterecektir.

source: Imaging Complete
fr_ca: Image Terminée
tr_tr: İmaj Atma İşlemi Tamamlandı

source: When the imaging completes you should see the dialog above. Click Ok, then click the Close button at the bottom right to close the imaging tool. Reboot the roboRIO using the Reset button to have the new team number take effect.
fr_ca: Quand l'image est complété, vous allez voir la boîte de dialogue ci-dessus. Cliquez "Ok," puis cliquez le bouton "Close" en bas à droite pour fermer l'outil. Redémarrez le roboRIO en utilisant le bouton "Reset" pour que le nouveau numéro d'équipe prenne effet.
tr_tr: Görüntüleme tamamlandığında yukarıdaki iletişim kutusunu görmelisiniz. OK'e tıklayın, ardından imaging tool'u kapatmak için sağ alttaki Close düğmesine tıklayın. Yeni takım numarasının geçerli olması için Reset düğmesini kullanarak roboRIO'yu yeniden başlatın.

source: The default CAN webdash functionality has been removed from the image (CAN devices will still work from robot code). You will need to use the tools provided by individual vendors to service their CAN devices.
fr_ca: La fonctionnalité de webdash CAN par défaut à été supprimée dans l'image (les dispositifs CAN fonctionneront toujours, si appelé par le code du robot). Si vous rencontrez un problème, il faudra alors utiliser les outils de réinitialisation du CAN fournis par les vendeurs de ces dispositifs.
tr_tr: Varsayılan CAN webdash işlevi kaldırılmıştır (CAN cihazları yine de robot kodundan çalışacaktır). CAN cihazlarına ayar yapmak için üreticiler tarafından sağlanan araçları kullanmanız gerekecektir.

source: Troubleshooting
fr_ca: Dépannage
tr_tr: Sorun giderme

source: If you are unable to image your roboRIO, troubleshooting steps include:
fr_ca: Si vous êtes pas capable d'imager votre roboRIO, les étapes de dépannage sont:
tr_tr: RoboRIO'nuza İmaj atamıyorsanuz, sorun giderme adımları şunları içerir:

source: Try running the roboRIO Imaging Tool as Administrator by right-clicking on the Desktop icon to launch it.
fr_ca: Essayez de lancer "roboRIO Imaging Tool" comme Administrateur en faire un clic-droit sur l'icône du bureau pour le lancer.
tr_tr: RoboRIO Imaging Tool'u başlatmak için Masaüstü simgesine sağ tıklayarak Yönetici olarak çalıştırmayı deneyin.

source: Try accessing the roboRIO webpage with a web-browser at ``http://172.22.11.2/`` and/or verify that the NI network adapter appears in your list of Network Adapters in the Control Panel. If not, try re-installing the NI FRC Game Tools or try a different PC.
fr_ca: Essayez d'accéder à la page Web du roboRIO avec un navigateur web à ``http://172.22.11.2/`` et / ou vérifiez que l'adapteur réseau NI apparaît dans votre liste "Network Adapter" (adapteur réseau) dans le panneau de configuration. Sinon, essayez de réinstaller les Outils de Jeu FRC NI ou essayez un PC différent.
tr_tr: RoboRIO web sayfasına bir web tarayıcısı ile ``http://172.22.11.2/`` adresinden erişmeyi deneyin ve/veya NI ağ adaptörünün Kontrol Panelindeki Ağ Adaptörleri listenizde göründüğünü doğrulayın. Değilse, NI FRC Game Tools'u yeniden yüklemeyi veya farklı bir PC deneyin.

source: Make sure your firewall is turned off.
fr_ca: Assurez-vous que votre pare-feu (Firewall) est désactivé.
tr_tr: Güvenlik duvarınızın kapalı olduğundan emin olun.

source: Try a different PC
fr_ca: Essayez un PC différent
tr_tr: Farklı bir bilgisayar deneyin

source: Some teams have experienced an issue where imaging fails if the device name of the computer you're using has a dash (``-``) in it. Try renaming the computer (or using a different PC).
fr_ca: Quelques équipes ont rencontré un problème où l'image échoue si le nom de l'ordinateur que vous utilisez contient un tiret (``-``). Essayez de renommer l'ordinateur (ou d'utiliser un PC différent).
tr_tr: Bazı takımlar, kullandığınız bilgisayarın aygıt adında bir tire (``-``) varsa, imaj atma işleminin başarısız olduğu bir sorunla karşılaşmıştır. Bilgisayarı yeniden adlandırmayı (veya farklı bir bilgisayar kullanmayı) deneyin.

source: Try booting the roboRIO into Safe Mode by pressing and holding the reset button for at least 5 seconds.
fr_ca: Essayez de démarrer le roboRIO en "Safe Mode" en appuyant et en maintenant le bouton reset pendant au moins 5 secondes.
tr_tr: Reset düğmesini en az 5 saniye basılı tutarak roboRIO'yu Safe Mode - Güvenli Modda başlatmayı deneyin.
