Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/offline-installation-preparations.po
Languages: fr_ca, tr_tr

source: Offline Installation Preparation
fr_ca: Préparation de l’installation hors ligne
tr_tr: Offline Kurulum Hazırlığı

source: This article contains instructions/links to components you will want to gather if you need to do offline installation of the FRC\ |reg| Control System software.
fr_ca: Cet article contient des instructions/liens vers des composants qu'il serait souhaitable de réunir si vous devez effectuer l’installation hors ligne du logiciel de système de contrôle FRC\ |reg| .
tr_tr: Bu makale, FRC\ |reg| Kontrol Sistemi yazılımı çevrimdışı kurulumunu yapmanız gerektiğinde toplamak isteyeceğiniz bileşenlere yönelik yönergeler/bağlantılar içerir.

source: Documentation
tr_tr: Dokümantasyon

source: This documentation can be downloaded for offline viewing. The link to download the PDF can be found `here <https://buildmedia.readthedocs.org/media/pdf/frc-docs/latest/frc-docs.pdf>`__.
fr_ca: Cette documentation peut être téléchargée pour l’affichage hors connexion. Le lien pour télécharger le PDF peut être trouvé `ici <https://buildmedia.readthedocs.org/media/pdf/frc-docs/latest/frc-docs.pdf>`__.
tr_tr: Bu belgeler çevrimdışı görüntüleme için indirilebilir. PDF'yi indirme bağlantısı `burada <https://buildmedia.readthedocs.org/media/pdf/frc-docs/latest/frc-docs.pdf>`__ bulunabilir.

source: Installers
fr_ca: Installateurs
tr_tr: Kurulum Programları

source: All Teams
fr_ca: Toutes les équipes
tr_tr: Tüm Takımlar

source: `2020 FRC Game Tools <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__ (Note: Click on link for "Individual Offline Installers")
fr_ca: `Outils du jeu FRC 2020 <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__ (Note: Cliquer sur le lien pour "Individual Offline Installers")
tr_tr: `2020 FRC Oyun Araçları <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>` __ (Not: "Bireysel Çevrimdışı Kurulumlar" için linke tıklayın )

source: `2020 FRC Radio Configuration Utility <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0.zip>`__ or `2020 FRC Radio Configuration Utility Israel Version <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0_IL.zip>`__
fr_ca: `Utilitaire de configuration radio FRC 2020 <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0.zip>`__ ou `Utilitaire de configuration radio FRC 2020 Version Israel <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0_IL.zip>`__
tr_tr: `2020 FRC Radyo Yapılandırma Yardımcı Programı <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0.zip>`__ veya `2020 FRC Radyo Yapılandırma Yardımcı Programı İsrail Sürümü <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0_IL.zip>`__

source: (Optional - Veterans Only!) `Classmate/Acer PC Image <https://frc-events.firstinspires.org/services/DSImages/>`__
fr_ca: (Facultatif - Vétérans seulement!) `Image Classmate/Acer PC <https://frc-events.firstinspires.org/services/DSImages/>`__
tr_tr: (İsteğe Bağlı - Yalnızca veteranlar!) `Classmate/Acer PC İmajı<https://frc-events.firstinspires.org/services/DSImages/>`__

source: LabVIEW Teams
fr_ca: Équipes LabVIEW
tr_tr: LabVIEW Takımları

source: LabVIEW USB (from *FIRST*\ |reg| Choice) or `Download <https://www.ni.com/en-us/support/downloads/drivers/download.labview-software-for-frc.html>`__ (Note: Click on link for "Individual Offline Installers")
fr_ca: LabVIEW USB (à partir de *FIRST*\ |reg| Choice) ou `Télécharger <https://www.ni.com/en-us/support/downloads/drivers/download.labview-software-for-frc.html>`__ (Note: Cliquer sur le lien pour "Individual Offline Installers")
tr_tr: LabVIEW USB (*FIRST*\ |reg| Choice'den) veya `Download <https://www.ni.com/en-us/support/downloads/drivers/download.labview-software-for-frc.html>`__ (Not: "Individual Offline Installers" bağlantısını tıklayın)

source: C++/Java Teams
fr_ca: Équipes C++/Java
tr_tr: C++/Java Takımları

source: `C++/Java WPILib Installer <https://github.com/wpilibsuite/allwpilib/releases>`__
fr_ca: `Installateur WPILib C++/Java <https://github.com/wpilibsuite/allwpilib/releases>`__
tr_tr: `C ++ / Java WPILib Yükleyici <https://github.com/wpilibsuite/allwpilib/releases>`__

source: Visual Studio Code (if using Windows, run the installer and use it to download the appropriate VS Code file. If using macOS/Linux, download Visual Studio Code from `here <https://code.visualstudio.com/download>`__)
fr_ca: Visual Studio Code (si vous utilisez Windows, exécutez l’installateur et utilisez-le pour télécharger le fichier VS Code approprié. Si vous utilisez macOS/Linux, téléchargez Visual Studio Code à partir `d'ici <https://code.visualstudio.com/download>`__)
tr_tr: Visual Studio Code (Windows kullanıyorsanız, yükleyiciyi çalıştırın ve uygun VS Code dosyasını indirmek için kullanın. Eğer MacOS / Linux kullanıyorsanız, Visual Studio Code'u `buradan indirin<https://code.visualstudio.com/download>`__)

source: 3rd Party Libraries/Software
fr_ca: Bibliothèques/logiciels tiers
tr_tr: 3. Parti Kütüphaneleri/Yazılımları

source: A number of software components were broken out of WPILib in 2017 and are now maintained by third parties. See `this blog <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ for more details.
fr_ca: Un certain nombre de composants logiciels ont été retirés de WPILib en 2017 et sont maintenant maintenus par des tiers. Voir `ce blog <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ pour plus de détails.
tr_tr: 2017'de WPILib'den bir dizi yazılım bileşeni çıkarıldı ve şu anda üçüncü taraflar tarafından kontrol ediliyor. Daha fazla ayrıntı için `bu bloğa <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ bakın.

source: A directory of available 3rd party software that plugs in to WPILib can be found on :ref:`docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries`.
fr_ca: Un répertoire des logiciels de tierce-partie disponibles qui se connectent à WPILib peut être trouvé sur :ref:`docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries`.
tr_tr: WPILib'e bağlanan mevcut 3. taraf yazılımların bir dizini şu adreste bulunabilir :ref:`docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries`.
