Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/radio-programming.po
Languages: fr_ca, tr_tr

source: Select which operating mode you want to configure. For most cases, the default selection of 2.4GHz Access Point will be sufficient. If your computers support it, the 5GHz AP mode is recommended, as 5GHz is less congested in many environments.
fr_ca: Sélectionnez le mode d'opération à configurer. Dans la plupart des cas, la sélection par défaut du point d’accès 2.4 GHz sera suffisante. Si vos ordinateurs le supporte, le mode AP 5GHz est recommandé, car 5GHz est moins encombré dans de nombreux environnements.
tr_tr: Yapılandırmak istediğiniz çalışma modunu seçin. Çoğu durumda, varsayılan olarak 2.4GHz Erişim Noktası seçimi yeterli olacaktır. Bilgisayarlarınız destekliyorsa, 5GHz birçok ortamda daha az yoğun olduğu için 5GHz AP modu önerilir.

source: Select Options
fr_ca: Sélectionnez les options
tr_tr: Seçenekler'i belirleyin

source: The default values of the options have been selected to match the use case of most teams, however, you may wish to customize these options to your specific scenario:
fr_ca: Les valeurs par défaut des options ont été sélectionnées pour correspondre au cas d’utilisation de la plupart des équipes, cependant, vous pouvez personnaliser ces options à votre scénario spécifique :
tr_tr: Seçeneklerin varsayılan değerleri, çoğu takımın kullanım durumuyla eşleşecek şekilde seçilmiştir, ancak bu seçenekleri kendi senaryonuza göre özelleştirmek isteyebilirsiniz:

source: Robot Name: This is a string that gets appended to the SSID used by the radio. This allows you to have multiple networks with the same team number and still be able to distinguish them.
fr_ca: Robot Name: Il s’agit d’une chaîne de caractères qui est ajoutée au SSID utilisé par la radio. Ce paramètre vous permet d’avoir plusieurs réseaux avec le même numéro d’équipe et d’être en mesure de les distinguer.
tr_tr: Robot Name: Bu, radyo tarafından kullanılan SSID'ye eklenen bir dizedir. Bu, aynı takım numarasına sahip birden çok ağa sahip olmanıza ve bunları yine de ayırt edebilmenize olanak tanır.

source: Firewall: If this box is checked, the radio firewall will be configured to attempt to mimic the port blocking behavior of the firewall present on the FRC field. For a list of open ports, please see the FRC Game Manual.
fr_ca: Firewall: Si cette zone est cochée, le pare-feu radio sera configuré pour tenter d’imiter le comportement de blocage du port du pare-feu présent sur le terrain FRC. Pour obtenir une liste des ports ouverts, veuillez consulter le Manuel de jeu FRC.
tr_tr: Firewall: Bu kutu işaretlenirse, radyo güvenlik duvarı, FRC alanında bulunan güvenlik duvarının bağlantı noktası engelleme davranışını taklit etmeye çalışacak şekilde yapılandırılacaktır. Açık bağlantı noktalarının listesi için lütfen FRC Oyun Kılavuzuna bakın.

source: BW Limit: If this box is checked, the radio enforces a 4 Mbps bandwidth limit like it does when programmed at events. Note that in AP mode, this is a total limit, not per client, so streaming video to multiple clients simultaneously may cause undesired behavior.
fr_ca: BW Limit: Si cette case est cochée, la radio applique une limite de bande passante de 4 Mbps comme elle le fait lorsqu’elle est programmée pour les événements. Notez qu’en mode AP, il s’agit d’une limite totale, et non une limite par client, de telle sorte que la diffusion de vidéos en continu vers plusieurs clients peut provoquer un comportement indésirable.
tr_tr: BW Limit: Bu kutucuk işaretlenirse, radyo etkinliklerde programlandığında olduğu gibi 4 Mbps'lik bir bant genişliği limiti uygular. AP modunda, bunun istemci başına değil toplam bir sınır olduğunu ve bu nedenle birden çok istemciye aynı anda video akışının gönderilmesinin istenmeyen davranışlara neden olabileceğini unutmayın.

source: Firewall and BW Limit only apply to the OpenMesh radios. These options have no effect on D-Link radios.
fr_ca: Les options Firewall et BW Limit ne s’appliquent qu’aux radios OpenMesh. Ces options n’ont aucun effet sur les radios D-Link.
tr_tr: Firewall ve BW Limit sınırı yalnızca OpenMesh radyolar için geçerlidir. Bu seçeneklerin D-Link radyoları üzerinde hiçbir etkisi yoktur.

source: The "Firewall" option configures the radio to emulate the field firewall. This means that you will not be able to deploy code wirelessly with this option enabled.
fr_ca: L’option "Firewall" configure la radio pour émuler le pare-feu du terrain. Cela signifie que vous ne serez pas en mesure de déployer du code sans fil lorsque cette option est activée.
tr_tr: "Firewall" seçeneği, radyonun saha güvenlik duvarını taklit edecek şekilde yapılandırır. Bu seçenek etkinleştirildiğinde yazılım kodunu kablosuz olarak dağıtamayacağınız anlamına gelir.

source: Prepare and start the configuration process
fr_ca: Préparer et démarrer le processus de configuration
tr_tr: Yapılandırma sürecini hazırlayın ve başlatın

source: Follow the on-screen instructions for preparing your wireless bridge, entering the settings the bridge will be configured with, and starting the configuration process. These on-screen instructions update to match the bridge model and operating mode chosen.
fr_ca: Suivez les instructions à l’écran pour préparer votre passerelle sans fil, entrer les paramètres avec lesquels la passerelle sera configurée et démarrer le processus de configuration. Ces instructions à l’écran sont mises à jour pour correspondre au modèle de pont et au mode de fonctionnement choisi.
tr_tr: Kablosuz cihazınızı hazırlamak, cihazın yapılandırılacağı ayarları girmek ve yapılandırma sürecini başlatmak için ekrandaki talimatları izleyin. Bu ekran talimatları, seçilen cihaz modeli ve işletim moduna uyacak şekilde güncellenir.

source: Configuration Progress
fr_ca: Progression de la configuration
tr_tr: Yapılandırma İlerlemesi

source: Throughout the configuration process, the window will indicate:
fr_ca: Tout au long du processus de configuration, la fenêtre indique :
tr_tr: Yapılandırma işlemi boyunca pencere şunları gösterecektir:

source: The step currently being executed
fr_ca: L'étape en cours d’exécution
tr_tr: Şu anda yürütülen adım

source: The overall progress of the configuration process
fr_ca: La progression globale du processus de configuration
tr_tr: Yapılandırma sürecinin genel ilerlemesi

source: All steps executed so far
fr_ca: Toutes les étapes exécutées jusqu’à présent
tr_tr: Şimdiye kadar gerçekleştirilen tüm adımlar

source: Configuration completed
fr_ca: Configuration terminée
tr_tr: Yapılandırma tamamlandı

source: Once the configuration is complete:
fr_ca: Une fois la configuration terminée :
tr_tr: Yapılandırma tamamlandığında:

source: Press "OK" on the dialog window
fr_ca: Appuyez sur "OK" dans la fenêtre de dialogue
tr_tr: İletişim penceresinde "OK" a basın

source: Press "OK" on the main window to return to the settings screen
fr_ca: Appuyez sur "OK" sur la fenêtre principale pour revenir à l’écran des paramètres
tr_tr: Ayarlar ekranına dönmek için ana pencerede "OK" a basın

source: Configuration errors
fr_ca: Erreurs de configuration
tr_tr: Yapılandırma hataları

source: If an error occurs during the configuration process, follow the instructions in the error message to correct the problem.
fr_ca: Si une erreur se produit pendant le processus de configuration, suivez les instructions du message d’erreur pour corriger le problème.
tr_tr: Yapılandırma işlemi sırasında bir hata oluşursa, sorunu gidermek için hata mesajındaki talimatları izleyin.

source: Troubleshooting: Disabling Network Adapters
fr_ca: Résolution des problèmes : désactivation des cartes réseau
tr_tr: Sorun Giderme: Ağ Adaptörlerini Devre Dışı Bırakma

source: If you get an error message about "NPF adapter" when attempting to load firmware, you need to disable all other adapters. This is not always the same as turning the adapters off with a physical button or putting the PC into airplane mode. The following steps provide more detail on how to disable adapters.
fr_ca: Si vous recevez un message d’erreur sur "NPF adapter" lors de la tentative de chargement du firmware, vous devez désactiver tous les autres interfaces au réseau. Ce n’est pas toujours la même chose que d’éteindre les cartes avec un bouton physique ou de mettre le PC en mode "Airplane". Les étapes suivantes fournissent plus de détails sur la façon de désactiver les interfaces.
tr_tr: Cihaz yazılımını yüklemeye çalışırken "NPF adaptörü" ile ilgili bir hata mesajı alırsanız, diğer tüm adaptörleri devre dışı bırakmanız gerekir. Bu, adaptörleri fiziksel bir düğme ile kapatmak veya bilgisayarı uçak moduna almakla her zaman aynı değildir. Aşağıdaki adımlar, adaptörlerin nasıl devre dışı bırakılacağı hakkında daha fazla ayrıntı sağlar.

source: Open the Control Panel by going to Start->Control Panel
fr_ca: Ouvrer le Panneau de configuration en passant par Start->Control Panel
tr_tr: Başlat-> Denetim Masası'na giderek Denetim Masası'nı açın.

source: Choose the Network and Internet category.
fr_ca: Choisir: Network and Internet category.
tr_tr: Ağ ve İnternet kategorisini seçin.

source: Click Network and Sharing Center
fr_ca: Cliquer sur Network and Sharing Center
tr_tr: Ağ ve Paylaşım Merkezi'ne tıklayın

source: On the left pane, click Change Adapter Settings
fr_ca: Dans le volet gauche, cliquer sur: Change Adapter Settings
tr_tr: Sol bölmede, Bağdaştırıcı Ayarlarını Değiştir'i tıklayın.

source: For each adapter other than the one connected to the radio, right click on the adapter and select Disable from the menu.
fr_ca: Pour chaque "adapter" autre que celui connecté à la radio, cliquez avec le bouton droit sur "adapter" et sélectionnez "Disable" dans le menu.
tr_tr: Radyoya bağlı olanın dışındaki her bir adaptör için, adaptöre sağ tıklayın ve menüden Devre Dışı Bırak'ı seçin.
