Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/radio-programming.po
Languages: fr_ca, tr_tr

source: Programming your Radio
fr_ca: Programmer votre Radio
tr_tr: Radio - Erişim Noktası Programlama

source: This guide will show you how to use the FRC Radio Configuration Utility software to configure your robot's wireless bridge for use outside of FRC events.
fr_ca: Ce guide vous montrera comment utiliser le logiciel FRC Radio Configuration Utility pour configurer votre passerelle sans fil (wireless bridge) de votre robot pour l'utiliser dans des événements autre que ceux relatifs à la FRC.
tr_tr: Bu kılavuz, robotunuzun kablosuz ağ cihazını FRC etkinlikleri dışında kullanmak üzere yapılandırmak için FRC Radio Configuration Utility programını nasıl kullanacağınızı gösterecektir.

source: Before you begin using the software:
fr_ca: Avant de commencer avec le logiciel:
tr_tr: Yazılımı kullanmaya başlamadan önce:

source: Disable WiFi connections on your computer, as it may prevent the configuration utility from properly communicating with the bridge
fr_ca: Désactivez les connexions WiFi sur votre ordinateur, car l'activation de ces connexions WIFI peut empêcher l'utilitaire de configuration de communiquer correctement avec la passerelle.
tr_tr: Yapılandırma programının Erişim noktası cihazı ile düzgün bir şekilde iletişim kurmasını engelleyebileceğinden bilgisayarınızdaki WiFi bağlantılarını devre dışı bırakın.

source: Make sure no devices are connected to your computer via ethernet, other than the wireless bridge.
fr_ca: Assurez-vous qu'il n'y a aucun appareil connecté à votre ordinateur via Ethernet, en dehors de la passerelle sans fil.
tr_tr: Bilgisayarınıza ethernet kablosuyla kablosuz bağlantı cihazı dışında hiçbir aygıtın bağlı olmadığından emin olun.

source: The OM5P-AN and AC use the same power plug as the D-Link DAP1522, however they are 12V radios. Wire the radio to the 12V 2A terminals on the VRM (center-pin positive).
fr_ca: Le OM5P-AN et AC utilisent la même prise d'alimentation que le D-Link DAP1522, cependant ce sont des radios de 12V. Câblez la radio aux bornes 12V 2A sur le module VRM (la broche centrale étant de signe positif).
tr_tr: OM5P-AN ve AC, D-Link DAP1522 ile aynı elektrik fişini kullanır, ancak MO5P serisi 12V cihazlardır. Radyoyu VRM üzerindeki 12V 2A terminallerine bağlayın (orta-pin pozitif).

source: Pre-Requisites
fr_ca: Conditions préalables
tr_tr: Önkoşullar

source: The FRC Radio Configuration Utility requires the Java Runtime Engine (JRE). If you do not have Java installed, you can download the JRE from here: https://www.java.com/en/download/
fr_ca: L'Utilitaire de Configuration Radio FRC requiert Java Runtime Engine (JRE). Si vous n'avez pas installé Java, vous pouvez télécharger le JRE d'ici: https://www.java.com/en/download/
tr_tr: FRC Radio Configuration Utility Programı, Java Runtime Engine (JRE) gerektirir. Java kurulu değilse, JRE'yi buradan indirebilirsiniz: https://www.java.com/en/download/

source: The FRC Radio Configuration Utility requires Administrator privileges to configure the network settings on your machine. The program should request the necessary privileges automatically (may require a password if run from a non-Administrator account), but if you are having trouble, try running it from an Administrator account.
fr_ca: L'Utilitaire de Configuration du Radio FRC requiert les privilèges d'administrateur pour configurer les paramètres réseau sur votre machine. Le logiciel devrait demander les privilèges nécessaires automatiquement (ceci peut nécessiter un mot de passe si le logiciel est exécuté à partir d'un compte non administrateur), mais si vous rencontrez des problèmes, essayez de l'éxecuter d'un compte administrateur.
tr_tr: FRC FRC Radio Configuration Utility Programı, makinenizdeki ağ ayarlarını yapılandırmak için Yönetici ayrıcalıkları gerektirir. Program gerekli ayrıcalıkları otomatik olarak istemelidir (Yönetici olmayan bir hesaptan çalıştırılırsa bir parola gerektirebilir), ancak sorun yaşıyorsanız, bir Yönetici hesabından çalıştırmayı deneyin.

source: Application Notes
fr_ca: Notes d'application
tr_tr: Uygulama Notları

source: By default, the Radio Configuration Utility will program the radio to enforce the 4Mbps bandwidth limit on traffic exiting the radio over the wireless interface. In the home configuration (AP mode) this is a total, not a per client limit. This means that streaming video to multiple clients is not recommended.
fr_ca: Par défaut, l'Utilitaire de Configuration Radio programmera la radio pour appliquer la limite de bande passante de 4 Mbps sur le trafic sortant de la radio via l'interface sans fil. Dans le configuration maison (mode AP), ce nombre de 4Mbps signifie la totalité de la bande passante, et non une limite par client. Cela veut dire que la vidéo en streaming vers plusieurs clients n'est pas recommandée.
tr_tr: Varsayılan olarak, Radio Configuration Utility Programı, radio'yu kablosuz bağlantısı üzerinden çıkan trafiği 4Mbps bant genişliği sınırını uygulayacak şekilde programlayacaktır. Ev yapılandırmasında (AP modu) bu, istemci başına bir sınır değil, toplamdır. Bu, birden fazla istemciye video akışının gönderilmesinin tavsiye edilmediği anlamına gelir.

source: The Utility has been tested on Windows 7, 8 and 10. It may work on other operating systems, but has not been tested.
fr_ca: L’utilitaire a été testé sur Windows 7, 8 et 10. Il peut fonctionner sur d’autres systèmes d’exploitation, mais n’y a pas été testé.
tr_tr: Bu program Windows 7, 8 ve 10'da test edilmiştir. Diğer işletim sistemlerinde çalışabilir, ancak test edilmemiştir.

source: Programmed Configuration
fr_ca: Configuration programmée
tr_tr: Programlanmış Konfigürasyon

source: The Radio Configuration Utility programs a number of configuration settings into the radio when run. These settings apply to the radio in all modes (including at events). These include:
fr_ca: L’utilitaire "Radio Configuration Utility" programme un certain nombre de paramètres de configuration dans la radio lors de son exécution. Ces paramètres s’appliquent à la radio dans tous les modes (y compris lors d’événements). Il s’agit notamment de:
tr_tr: Radio Configuration Utility Programı, çalıştırıldığında radyoya bir dizi yapılandırma ayarı programlar. Bu ayarlar tüm modlarda (etkinliklerde dahil) telsiz için geçerlidir. Bunlar şunları içerir:

source: Set a static IP of 10.TE.AM.1
fr_ca: Définir une adresse IP statique de 10.TE.AM.1
tr_tr: 10.TE.AM.1 statik IP'si ayarlamak

source: Set an alternate IP on the wired side of 192.168.1.1 for future programming
fr_ca: Définir une adresse IP alternative de 192.168.1.1 pour une installation câblée, ceci pour une programmation future
tr_tr: Gelecekteki programlama ihtiyaçları için 192.168.1.1'in kablolu tarafında alternatif bir IP ayarı.

source: Bridge the wired ports so they may be used interchangeably
fr_ca: Relier des ports câblés afin qu’ils puissent être utilisés de façon interchangeable
tr_tr: Kablolu bağlantı noktalarını köprülemek, böylece birbirlerinin yerine kullanılabilirler.

source: The LED configuration noted in the graphic above.
fr_ca: La DEL de configuration notée dans le graphique ci-dessus.
tr_tr: Yukarıdaki grafikte belirtilen LED konfigürasyonu.

source: 4Mb/s bandwidth limit on the outbound side of the wireless interface (may be disabled for home use)
fr_ca: Limiter la bande passante à 4 Mo/s du côté sortie de l’interface sans fil (ceci peut être désactivé pour une utilisation à la maison)
tr_tr: Kablosuz arayüzün giden tarafında 4Mb/s bant genişliği sınırı (evde kullanım için devre dışı bırakılabilir)

source: QoS rules for internal packet prioritization (affects internal buffer and which packets to discard if bandwidth limit is reached). These rules are:
fr_ca: La qualité de service ou QS régularise la hiérarchisation interne des paquets (affecte la mémoire tampon interne et les paquets à éliminer si la limite de bande passante est atteinte). Les règles appliquées sont les suivantes :
tr_tr: İç paket önceliklendirme için QoS kuralları (dahili arabelleği ve bant genişliği sınırına ulaşıldığında hangi paketlerin dikkate alınmayacağını etkiler). Bu kurallar:

source: Robot Control and Status (UDP 1110, 1115, 1150)
fr_ca: Contrôle et statut du robot (UDP 1110, 1115, 1150)
tr_tr: Robot Kontrolü ve Durumu (UDP 1110, 1115, 1150)

source: Robot TCP & Network Tables (TCP 1735, 1740)
fr_ca: TCP et NetworkTables du robot (TCP 1735, 1740)
tr_tr: Robot TCP ve Ağ Tabloları (TCP 1735, 1740)

source: Bulk (All other traffic). (disabled if BW limit is disabled)
fr_ca: En vrac (Tout autre trafic). (désactivé si la limite de largeur de bande (BW) est désactivée)
tr_tr: Bulk (Diğer tüm trafik). (BW sınırı devre dışıysa geçerli değil)

source: DHCP server enabled. Serves out:
fr_ca: Serveur DHCP activé. Sert:
tr_tr: DHCP sunucusu etkinleştirilme. Verilen Hizmet:

source: 10.TE.AM.11 - 10.TE.AM.111 on the wired side
fr_ca: 10.TE.AM.11 - 10.TE.AM.111 sur le côté câblé
tr_tr: 10.TE.AM.11 - 10.TE.AM.111 kablolu tarafta

source: 10.TE.AM.138 - 10.TE.AM.237 on the wireless side
fr_ca: 10.TE.AM.138 - 10.TE.AM.237 sur le côté sans-fil
tr_tr: 10.TE.AM.138 - 10.TE.AM.237 kablosuz tarafta

source: Subnet mask of 255.255.255.0
fr_ca: Masque de sous-réseau de 255.255.255.0
tr_tr: 255.255.255.0 alt ağ maskesi

source: Broadcast address 10.TE.AM.255
fr_ca: Adresse de diffusion 10.TE.AM.255
tr_tr: Yayın adresi 10.TE.AM.255

source: DNS server enabled. DNS server IP and domain suffix (.lan) are served as part of the DHCP.
fr_ca: Serveur DNS activé. L’IP du serveur DNS et le suffixe de domaine (.lan) font partie du DHCP.
tr_tr: DNS sunucusu etkinleştirme. DNS sunucusu IP'si ve etki alanı soneki (.lan) DHCP'nin bir parçası olarak sunulur.

source: At home only:
fr_ca: À la maison seulement:
tr_tr: Yalnızca evde:

source: SSID may have a "Robot Name" appended to the team number to distinguish multiple networks.
fr_ca: SSID peut avoir un "Nom de robot" joint au numéro d’équipe pour distinguer plusieurs réseaux.
tr_tr: SSID, birden fazla ağı ayırt etmek için ekip numarasına eklenmiş bir "Robot Adı" içerebilir.

source: Firewall option may be enabled to mimic the field firewall rules (open ports may be found in the Game Manual)
fr_ca: L’option Pare-feu peut être activée pour imiter les règles du champ pare-feu (pour les ports ouverts veuillez consulter le Manuel de jeu)
tr_tr: Güvenlik duvarı seçeneği, saha güvenlik duvarı kurallarını taklit etmek için etkinleştirilebilir (açık bağlantı noktaları Oyun Kılavuzunda bulunabilir)

source: It is not possible to modify the configuration manually
fr_ca: Il n’est pas possible de modifier la configuration manuellement
tr_tr: Yapılandırmayı manuel olarak değiştirmek mümkün değildir

source: Download the software Download the latest FRC Radio Configuration Utility Installer from the following links:
fr_ca: Téléchargez le dernier installateur du logiciel FRC Radio Configuration Utility à partir des liens suivants:
tr_tr: Yazılımı indirin aşağıdaki bağlantılardan en son FRC Radio Configuration Utility Programı Yükleyicisini indirin:

source: `FRC Radio Configuration 20.0.0 <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0.zip>`_
fr_ca: `FRC Configuration Radio 20.0.0 <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0.zip>`_

source: `FRC Radio Configuration 20.0.0 Israel Version <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0_IL.zip>`_
fr_ca: `FRC Configuration Radio 20.0.0 Version Israel <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0_IL.zip>`_
tr_tr: `FRC Radio Configuration 20.0.0 Israil versiyonu<https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0_IL.zip>`_

source: The _IL version is for Israel teams and contains a version of the OM5PAC firmware with restricted channels for use in Israel.
fr_ca: La version _IL est destinée aux équipes israéliennes et contient une version du firmware OM5PAC avec des canaux restreints pour une utilisation en Israël.
tr_tr: _IL sürümü İsrail ekipleri içindir ve İsrail'de kullanım için kısıtlanmış kanallara sahip OM5PAC ürün yazılımının bir sürümünü içerir.

source: Install the software
fr_ca: Installer le logiciel
tr_tr: Yazılımı kurun

source: Double click on FRC_Radio_Configuration_VERSION.exe to launch the installer. Follow the prompts to complete the installation.
fr_ca: Double-cliquez sur FRC_Radio_Configuration_VERSION.exe pour lancer l’installateur. Suivez les instructions pour terminer l’installation.
tr_tr: Yükleyiciyi başlatmak için FRC_Radio_Configuration_VERSION.exe üzerine çift tıklayın. Kurulumu tamamlamak için talimatları izleyin.

source: Part of the installation prompts will include installing Npcap if it is not already present. The Npcap installer contains a number of checkboxes to configure the install. You should leave the options as the defaults.
fr_ca: Durant l'installation, on proposera d'installer Npcap si il n’est pas déjà présent. L’installateur pour Npcap contient un certain nombre de cases à cocher pour configurer l’installation. Vous devez laisser les valeurs par défaut pour chacune des options.
tr_tr: Kurulum sırasında eğer zaten mevcut değilse Npcap kurulumunu içerecektir. Npcap yükleyici, yüklemeyi yapılandırmak için bir dizi onay kutusu içerir. Seçenekleri varsayılanlar olarak bırakmalısınız.

source: Launch the software
fr_ca: Lancer le logiciel
tr_tr: Yazılımı başlatın

source: Use the Start menu or desktop shortcut to launch the program.
fr_ca: Utilisez le menu Démarrer ou le raccourci de bureau pour lancer le programme.
tr_tr: Programı başlatmak için Başlat menüsünü veya masaüstü kısayolunu kullanın.

source: Note: If you need to locate the program it is installed to C:\Program Files (x86)\FRC Radio Configuration Utility. For 32-bit machines the path is C:\Program Files\FRC Radio Configuration Utility\
fr_ca: Remarque: si vous devez localiser le programme, il est installé sur C:\\Program Files (x86)\\FRC Radio Configuration Utility. Pour les machines 32 bits, le chemin d’accès est C:\\Program Files\\FRC Radio Configuration Utility\\
tr_tr: Not: Programı bulmanız gerekirse, C:\Program Files (x86)\FRC Radio Configuration Utility klasörü altına yüklenir. 32 bit makineler için yol C:\Program Files\FRC Radio Configuration Utility\ 'dır.

source: Allow the program to make changes, if prompted
fr_ca: Autoriser le programme à apporter des modifications, si vous y êtes invité
tr_tr: Eğer sorulursa programın değişiklik yapmasına izin verin

source: If the your computer is running Windows Vista or Windows 7, a prompt may appear about allowing the configuration utility to make changes to the computer. Click "Yes" if the prompt appears.
fr_ca: Si votre ordinateur exécute Windows Vista ou Windows 7, un message peut apparaître pour autoriser l’utilitaire de configuration à faire des modifications sur l’ordinateur. Cliquez sur "Yes" si cela s’affiche.
tr_tr: Bilgisayarınız Windows Vista veya Windows 7 çalıştırıyorsa, yapılandırma yardımcı programının bilgisayarda değişiklik yapmasına izin verilmesi hakkında bir istem görünebilir. İstem görünürse "Yes" i tıklayın.

source: Select the network interface
fr_ca: Sélectionner l’interface réseau
tr_tr: Ağ arayüzünü seçin

source: Use the pop-up window to select the which ethernet interface the configuration utility will use to communicate with the wireless bridge. On Windows machines, ethernet interfaces are typically named "Local Area Connection". The configuration utility can not program a bridge over a wireless connection.
fr_ca: Utilisez la fenêtre contextuelle pour sélectionner l’interface ethernet que l’utilitaire de configuration utilisera pour communiquer avec la passerelle sans fil. Sur les ordinateurs Windows, les interfaces ethernet sont généralement nommées "Local Area Connection". L’utilitaire de configuration ne peut pas programmer une passerelle via une connexion sans fil.
tr_tr: Yapılandırma yardımcı programının kablosuz cihaz ile iletişim kurmak için kullanacağı ethernet arayüzünü seçmek için açılır pencereyi kullanın. Windows makinelerde, ethernet arayüzleri tipik olarak "Yerel Alan Bağlantısı" olarak adlandırılır. Yapılandırma programı kablosuz bağlantı üzerinden bir köprü programlayamaz.

source: If no ethernet interfaces are listed, click "Refresh" to re-scan for available interfaces
fr_ca: Si aucune interface ethernet n’est répertoriée, cliquez sur "Refresh" pour ré-examiner les interfaces disponibles
tr_tr: Hiçbir ethernet arabirimi listelenmemişse, mevcut arabirimleri yeniden taramak için "Refresh" düğmesine tıklayın

source: Select the interface you want to use from the drop-down list
fr_ca: Sélectionnez l’interface à utiliser dans la liste déroulante
tr_tr: Açılır listeden kullanmak istediğiniz arayüzü seçin

source: Click "OK"
fr_ca: Cliquez sur "OK"
tr_tr: "OK" ı tıklayın

source: Open Mesh Firmware Note
fr_ca: Note concernant le Firmware Open Mesh
tr_tr: Open Mesh Firmware Notu

source: For the FRC Radio Configuration Utility to program the OM5P-AN and OM5P-AC radio, the radio must be running an FRC specific build of the OpenWRT firmware. OM5P-AC radios in the 2019 KoP should not need an update.
fr_ca: Pour que l’utilitaire de configuration radio FRC puisse programmer la radio OM5P-AN et OM5P-AC, la radio doit exécuter une version FRC spécifique du firmware OpenWRT. Les radios OM5P-AC du KoP 2019 ne devraient pas avoir besoin d’une mise à jour.
tr_tr: FRC Radio Configuration Utility Programının OM5P-AN ve OM5P-AC radyoyu programlaması için, cihazın OpenWRT sisteminin FRC'ye özgü bir yapısını çalıştırması gerekir. 2019 KoP'deki OM5P-AC radyolarının bir güncellemeye ihtiyacı olmayabilir.

source: If you do not need to update or re-load the firmware, skip the next step.
fr_ca: Si vous n’avez pas besoin de mettre à jour ou de re-charger le firmware, sautez l’étape suivante.
tr_tr: Ürün yazılımını güncellemeniz veya yeniden yüklemeniz gerekmiyorsa, sonraki adımı atlayın.

source: Note: Radios used in 2019 **do not** need to be updated before configuring, the 2020 tool uses the same 2019 firmware.
fr_ca: Remarque: les radios utilisées en 2019 **n’ont pas** besoin d’être mises à jour avant la configuration, l’outil 2020 utilise le même firmware qu'en 2019.
tr_tr: Not: 2019'da kullanılan radyoların **yapılandırmadan önce güncellenmesi gerekmez**, 2020 aracı aynı 2019 ürün yazılımını kullanır.

source: Loading FRC Firmware to OpenMesh radio
fr_ca: Chargement du firmware FRC à la radio OpenMesh
tr_tr: OpenMesh radyoya FRC Donanım Yazılımını Yükleme

source: If you need to load the FRC firmware (or reset the radio), you can do so using the FRC Radio Configuration Utility.
fr_ca: Si vous devez charger le firmware FRC (ou réinitialiser la radio), vous pouvez le faire à l’aide de l’utilitaire de configuration radio FRC.
tr_tr: FRC aygıt yazılımını yüklemeniz (veya cihazı sıfırlamanız) gerekirse, bunu FFRC Radio Configuration Utility Programını kullanarak yapabilirsiniz.

source: Follow the instructions above to install the software, launch the program and select the Ethernet interface.
fr_ca: Suivez les instructions ci-dessus pour installer le logiciel, lancer le programme et sélectionner l’interface Ethernet.
tr_tr: Yazılımı kurmak, programı başlatmak ve Ethernet arayüzünü seçmek için yukarıdaki talimatları izleyin.

source: Make sure the OpenMesh radio is selected in the Radio dropdown.
fr_ca: Assurez-vous que la radio OpenMesh est sélectionnée dans la liste déroulante Radio.
tr_tr: Radio açılır menüsünde OpenMesh radyosunun seçildiğinden emin olun.

source: Make sure the radio is connected to the PC via Ethernet.
fr_ca: Assurez-vous que la radio est connectée au PC via Ethernet.
tr_tr: Radyonun bilgisayara Ethernet üzerinden bağlı olduğundan emin olun.

source: Unplug the power from the radio. (If using a PoE cable, this will also be unplugging the Ethernet to the PC, this is fine)
fr_ca: Débranchez l’alimentation de la radio. (Si vous utilisez un câble PoE, il faudra également débrancher le Ethernet sur le PC, ce qui est correct)
tr_tr: Radyodan gücü kesin. (Bir PoE kablosu kullanıyorsanız, bu aynı zamanda PC'ye giden kabloyu çıkarabilirisiniz, buda doğru bir yönetimdir)

source: Press the Load Firmware button
fr_ca: Appuyez sur le bouton Load Firmware
tr_tr: Load Firmware düğmesine basın

source: When prompted, plug in the radio power. The software should detect the radio, load the firmware and prompt you when complete.
fr_ca: Lorsque vous y êtes invité, branchez l'alimentation de la radio. Le logiciel doit détecter la radio, charger le firmware et vous informer, une fois terminé.
tr_tr: İstendiğinde, radyo gücünü bağlayın. Yazılım radyoyu algılamalı, aygıt yazılımını yüklemeli ve tamamlandığında sizi uyarmalıdır.

source: If you see an error about NPF name, try disabling all adapters other than the one being used to program the radio. If only one adapter is found, the tool should attempt to use that one. See the steps in "`Troubleshooting: Disabling Network Adapters`_" for more info.
fr_ca: Si vous voyez une erreur sur le nom NPF, essayez de désactiver tous les interfaces autres que celle utilisé pour programmer la radio. Si une seule interface est trouvée, l’utilitaire doit tenter de l’utiliser. Pour plus d’informations, consultez les étapes dans "`Troubleshooting: Disabling Network Adapters`_".
tr_tr: NPF adı ile ilgili bir hata görürseniz, radyoyu programlamak için kullanılan adaptör dışındaki tüm adaptörleri devre dışı bırakmayı deneyin. Yalnızca bir adaptör bulunursa, araç bunu kullanmaya çalışmalıdır. Daha fazla bilgi için "Sorun Giderme: Ağ Adaptörlerini Devre Dışı Bırakma`_" bölümündeki adımlara bakın.

source: Teams may also see this error with foreign language Operating Systems. If you experience issues loading firmware or programming on a foreign language OS, try using an English OS, such as on the KOP provided PC or setting the Locale setting to "en_us" as described on `this page <https://www.java.com/en/download/help/locale.xml>`_.
fr_ca: Les équipes peuvent également voir cette erreur avec les systèmes d’exploitation en langue étrangère. Si vous rencontrez des problèmes de chargement du firmware ou de la programmation sur un système d’exploitation en langue étrangère, essayez d’utiliser un système d’exploitation en anglais, par exemple sur le PC fourni dans le Kit de Pièces (KOP) ou de configurer les paramètres locaux sur "en_us" comme décrit sur `cette page <https://www.java.com/en/download/help/locale.xml>`_.
tr_tr: Takımlar bu hatayı yabancı dil İşletim Sistemlerinde de görebilir. Yabancı dilli bir işletim sisteminde aygıt yazılımı veya programlama yüklemeyle ilgili sorunlar yaşıyorsanız, KOP tarafından sağlanan bilgisayarda olduğu gibi İngilizce bir işletim sistemi kullanmayı veya `bu sayfada <https://www.java.com/en/download/help/locale.xml>`_ 'da açıklandığı gibi bölgesel ayarları "en_us" olarak ayarlamayı deneyin.

source: Select a bridge model and operating mode
fr_ca: Sélectionner le modèle de la passerelle et son mode de fonctionnement
tr_tr: Bir model ve çalışma modu seçin

source: Select which radio you are configuring using the drop-down list.
fr_ca: Sélectionnez la radio que vous configurez à l’aide de la liste déroulante.
tr_tr: Açılır listeyi kullanarak yapılandırmakta olduğunuz radyoyu seçin.
