Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/wpilib-setup.po
Languages: es_mx, fr_ca, tr_tr

source: To update all the additional tools WPILib tools, open a terminal window and change directory to ~/wpilib/2020/tools and run the script ``ToolsUpdater.py`` with the commands:
es_mx: Para actualizar todas las herramientas adicionales de WPILib, abra una ventana terminal y cambie el directorio a ~/wpilib/2020/tools y ejecute el script ``ToolsUpdater.py`` con los comandos:
fr_ca: Pour mettre à jour tous les outils supplémentaires de WPILib, ouvrez une fenêtre de terminal et changez le répertoire pour ~/wpilib/2020/tools et exécutez le script ``ToolsUpdater.py`` avec les commandes:
tr_tr: Tüm ek WPILib araçlarını güncellemek için, bir terminal penceresi açın ve dizini ~/wpilib/2020/tools olarak değiştirin ve komutlarla ``ToolsUpdater.py`` komut dosyasını çalıştırın:

source: This should populate the tools directory with all of the WPILib tools (Shuffleboard, Robot Builder, PathWeaver, etc.)
es_mx: Esto debería llenar el directorio de herramientas con todas las herramientas de WPILib (Shuffleboard, Robot Builder, PathWeaver, etc.)
fr_ca: Cela devrait remplir ce répertoire avec tous les outils WPILib (Shuffleboard, Robot Builder, PathWeaver, etc.)
tr_tr: Bu, araçlar dizinini tüm WPILib araçlarıyla (Shuffleboard, Robot Builder, PathWeaver, vb.) dolduracaktır.

source: **Installing the extensions for WPILib development**
es_mx: **Instalación de las extensiones para el desarrollo de WPILib**
fr_ca: **Installation des extensions pour le développement WPILib**
tr_tr: **WPILib geliştirme için uzantıları yükleme**

source: Before using VS Code for WPILib development there are a number of extensions that need to be installed. Start up VS Code and type the shortcut Cmd-Shift-P to bring up the list of commands available. Start typing "Install from VSIX" into the search box. Choose that command. In the file selection box select Cpp.vsix.
fr_ca: Avant d’utiliser VS Code comme environnement de développement WPILib, un certain nombre d’extensions doivent être installées. Démarrez VS Code et tapez le raccourci Cmd-Shift-P pour afficher la liste des commandes disponibles. Commencez à taper "Install from VSIX" dans la zone de recherche. Choisissez cette commande. Dans la zone de sélection des fichiers, sélectionnez Cpp.vsix.
tr_tr: WPILib geliştirme için VS Code'u kullanmadan önce yüklenmesi gereken birkaç eklenti vardır. VS Code'u başlatın ve mevcut komutların listesini açmak için Cmd-Shift-P kısayolunu yazın. Arama kutusuna "Install from VSIX" yazmaya başlayın. Bu komutu seçin. Dosya seçim kutusunda Cpp.vsix 'i seçin.

source: You should see a message confirming the install and asking to reload VS Code. Click the reload button then repeat the vsix installation for the rest of the vsix files in this order:
es_mx: Deberá ver un mensaje confirmando la instalación y preguntando sobre volver a cargar el VS Code. Haga clic en el botón de volver a cargar, luego repita la instalación de vsix para el resto de archivos en este orden:
fr_ca: Vous devriez voir un message confirmant l'installation et demandant de recharger VS Code. Cliquez sur le bouton recharger puis répétez l'installation de VSIX pour le reste des fichiers vsix dans cet ordre:
tr_tr: Kurulumu onaylayan ve VS Kodunu yeniden çalıştırmanızı isteyen bir mesaj görmelisiniz. Reload düğmesine tıklayın ve ardından vsix dosyalarının geri kalanı için vsix kurulumunu şu sırayla tekrarlayın:

source: **Setting up Visual Studio Code to use Java 11**
es_mx: **Configuración del Visual Studio Code para usarse en Java 11**
fr_ca: **Configuration de Visual Studio Code pour utiliser Java 11**
tr_tr: **Java 11'i kullanmak için Visual Studio Code'u ayarlama**

source: The WPILib installation includes a JDK, however you need to point VS Code at where it is. To do this:
es_mx: La instalación del WPILib incluye JDK, sin embargo tiene que señalar al Visual Studio Code en donde está. Para hacer esto:
fr_ca: L'installation WPILib inclut un JDK, mais vous devez faire pointer VS Code là où il se trouve. Pour faire ça:
tr_tr: WPILib yüklemesi bir JDK içerir, ancak VS Kodunu olduğu yere yönlendirmeniz gerekir. Bunu yapmak için:

source: Open VS Code
es_mx: Abra el VS Code
fr_ca: Ouvrir VS Code
tr_tr: VS Code'u Aç

source: Press *Ctrl + Shift + P* and type *WPILib* or click on the WPILib icon in the top right to open the WPILib Command Palette
es_mx: Presione *Ctrl + Shift + P* y escriba *WPILib* o haga clic en el icono WPILib arriba a la derecha para abrir la bandeja de comandos de WPILib
fr_ca: Appuyez sur *Ctrl + Maj + P* et tapez *WPILib* ou cliquez sur l'icône WPILib en haut à droite pour ouvrir la palette de commandes WPILib
tr_tr: *Ctrl + Shift + P* tuşlarına basın ve *WPILib* yazın veya WPILib Komut Paletini açmak için sağ üstteki WPILib simgesine tıklayın

source: Begin typing *Set VS Code Java Home to FRC Home* and select that item from the dropdown
es_mx: Comience escribiendo *Establecer VS Code Java Home en FRC Home* y seleccione esa opción de la barra desplegable
fr_ca: Commencez à taper *Set VS Code Java Home to FRC Home* et sélectionnez cet élément dans la liste déroulante
tr_tr: *Set VS Code Java Home to FRC Home* yazmaya başlayın ve açılır menüden bu öğeyi seçin

source: **Allow toolchain to bypass Gatekeeper**
es_mx: **Permitir que la cadena de herramientas pase por alto Gateekeeper**
fr_ca: **Autoriser la chaîne d'outils à contourner Gatekeeper**
tr_tr: **Gatekeeper'ı atlamasına izin verin**

source: In order to build certain components, you may be prompted with a Gatekeeper dialog that says: "cannot be opened because the developer cannot be verified".
es_mx: Con el fin de construir ciertos componentes, usted puede ser interrumpido con un mensaje Gatekeeper que dirá: "No se puede abrir porque no puede ser verificado el desarrollo".
fr_ca: Afin de construire certains composants, vous pouvez être signalé par une boîte de dialogue Gatekeeper qui dit: "cannot be opened because the developer cannot be verified".
tr_tr: Belirli bileşenleri oluşturmak için, "cannot be opened because the developer cannot be verified" yazan bir Gatekeeper iletişim kutusu ile karşılaşabilirsiniz.

source: The name of the programs that will cause this are named:
es_mx: El nombre de los programas que causarán esto son:
fr_ca: Le nom des programmes à l'origine de ce problème sont:
tr_tr: Buna neden olacak programların isimleri şöyledir:

source: Builds will fail when this dialog appears. Follow the steps below and try to rerun the build.
es_mx: Las compilaciones fallarán cuando este mensaje aparezca. Siga los pasos a continuación e intente volver a ejecutar la compilación.
fr_ca: Les compilations "builds" échoueront lorsque cette boîte de dialogue apparaîtra. Suivez les étapes ci-dessous et essayez de réexécuter la compilation.
tr_tr: Bu iletişim kutusu göründüğünde derlemeler başarısız olacaktır. Aşağıdaki adımları izleyin ve derlemeyi yeniden çalıştırmayı deneyin.

source: Press the *Cancel* button on the dialog.
es_mx: Presione el botón *Cancelar* en el mensaje.
fr_ca: Appuyez sur le bouton *Cancel* dans la boîte de dialogue.
tr_tr: İletişim kutusundaki *Cancel* düğmesine basın.

source: Open System Preferences to the "Security and Privacy" pane
es_mx: Abra Preferencias de Sistema en el panel de “Seguridad y Privacidad”
fr_ca: Ouvrez les Préférences Système dans le volet "Security and Privacy"
tr_tr: System Preferences den "Security and Privacy" bölmesine açın

source: On the "General" tab, press *Allow Anyway*
es_mx: En la pestaña "General", presione *Permitir de todos modos*
fr_ca: Dans l'onglet "General" , appuyez sur *Allow Anyway*
tr_tr: "General" sekmesinde, *Allow Anyway* seçeneğine basın

source: Rerun the build that caused the initial dialog to appear
es_mx: Vuelva a correr lo que causo que el dialogo inicial apareciera
fr_ca: Ré-exécuter la compilation qui a provoqué l'affichage de la boîte de dialogue initiale
tr_tr: İlk iletişim kutusunun görünmesine neden olan yapıyı yeniden çalıştırın

source: A similar dialog will appear but will have a *Open* button. Press the *Open* button
es_mx: Un mensaje similar aparecerá pero tendrá un botón de *Abrir*. Presione ese botón.
fr_ca: Une boîte de dialogue similaire apparaîtra mais aura un bouton *Open*. Appuyez sur le bouton *Open*.
tr_tr: Benzer bir iletişim kutusu görünecek, ancak bir *Open* düğmesine sahip olacaktır. *Open* düğmesine basın

source: You may need to repeat this process multiple times for each of the programs listed above but once each program has been whitelisted, it should stay whitelisted and not prompt you again.
es_mx: Tendrá que repetir ese proceso varias veces para cada uno de los programas enlistados anteriormente, pero una vez que cada programa se haya incluido en la lista blanca, debe permanecer en la lista blanca y no volver a solicitarlo.
fr_ca: Vous devrez peut-être répéter ce processus plusieurs fois pour chacun des programmes répertoriés ci-dessus, mais une fois que chaque programme a été ajouté à la "liste blanche" (Whitelist), il va rester sur la liste blanche et ne plus vous signaler à nouveau.
tr_tr: Yukarıda listelenen programların her biri için bu işlemi birden çok kez tekrarlamanız gerekebilir, ancak her program beyaz listeye alındıktan sonra beyaz listede kalmalı ve sizden tekrar onay istememelidir.

source: Linux
fr_ca: Pour Linux

source: These instructions are based on Ubuntu 18.04, but would be similar for other Debian based Linux distributions.
es_mx: Estas instrucciones se basan en Ubuntu 18.04, pero serían similares para otras distribuciones de Linux en Debian.
fr_ca: Ces instructions sont basées sur Ubuntu 18.04, mais seraient similaires pour les autres distributions Linux basées sur Debian.
tr_tr: Bu talimatlar Ubuntu 18.04'e dayalıdır, ancak diğer Debian tabanlı Linux dağıtımları için benzer olacaktır.

source: **Installing Visual Studio Code**
es_mx: **Instalar Visual Studio Code**
fr_ca: **Installation de Visual Studio Code**
tr_tr: **Visual Studio Code Kurulumu**

source: Download the Linux ``.deb`` file from `code.visualstudio.com <https://code.visualstudio.com/>`__. For 2020, the recommended version is 1.41.1 which can be directly downloaded here: `https://update.code.visualstudio.com/1.41.1/linux-deb-x64/stable <https://update.code.visualstudio.com/1.41.1/linux-deb-x64/stable>`__
fr_ca: Téléchargez le fichier Linux ``.deb`` à partir de `code.visualstudio.com <https://code.visualstudio.com/>`__. Pour 2020, la version recommandée est 1.41.1 qui peut être téléchargée directement ici: `https://update.code.visualstudio.com/1.41.1/linux-deb-x64/stable <https://update.code.visualstudio.com/1.41.1/linux-deb-x64/stable>`__
tr_tr: Linux ``.deb`` dosyasını `code.visualstudio.com <https://code.visualstudio.com/>`__ adresinden indirin. 2020 için, doğrudan buradan indirilebilen önerilen sürüm 1.41.1 'dir: buradan indirin `https://update.code.visualstudio.com/1.41.1/linux-deb-x64/stable <https://update.code.visualstudio.com/1.41.1/linux-deb-x64/stable>`__

source: Double-click on the ``.deb`` file in the file explorer
fr_ca: Double-cliquez sur le fichier ``.deb`` dans l’explorateur de fichiers
tr_tr: Dosya gezgininde ``.deb``dosyasına çift tıklayın

source: Click the "Install" button to install VS Code
es_mx: Haga clic en botón “Instalar” para instalar el VS Code
fr_ca: Cliquez sur le bouton "Install" pour installer VS Code
tr_tr: VS Code'u yüklemek için "Install" düğmesini tıklayın

source: **Download the most recent WPILib release**
es_mx: **Descargue la versión más reciente de WPILib*
fr_ca: **Télécharger la version la plus récente de WPILib**
tr_tr: **En son WPILib sürümünü indirin**

source: Download the latest Linux release from https://github.com/wpilibsuite/allwpilib/releases Right-click on the downloaded archive, click "Extract Here"
es_mx: Descargue la versión más reciente de Linux en https://github.com/wpilibsuite/allwpilib/releases. Haga clic derecho en el archivo descargado y después haga clic en “Extraer Aquí”
fr_ca: Téléchargez la dernière version Linux sur https://github.com/wpilibsuite/allwpilib/releases. Cliquez avec le bouton droit sur l'archive téléchargée, cliquez sur "Extract Here"
tr_tr: En son Linux sürümünü https://github.com/wpilibsuite/allwpilib/releases adresinden indirin, İndirilen arşive sağ tıklayın, "Buraya Çıkar" seçeneğine tıklayın

source: **Moving to wpilib/2020**
es_mx: **Cambiar a WPILib/2020**
fr_ca: **Le passage à wpilib/2020**
tr_tr: **wpilib/2020 ye geçiş**

source: Create a directory structure in your home directory called wpilib/2020 - either from the file manager or with ``$ mkdir -p ~/wpilib/2020``
es_mx: Cree una estructura de directorios en su directorio de inicio llamado wpilib/2020 – ya sea desde el administrador de archivos o con ``$ mkdir -p ~/wpilib/2020``
fr_ca: Créez une structure de répertoires dans votre répertoire personnel appelé wpilib/2020 - soit à partir du gestionnaire de fichiers, soit avec ``$ mkdir -p ~/wpilib/2020``
tr_tr: Ana dizininizde wpilib/2020 adında bir dizin yapısı oluşturun - dosya yöneticisinden veya ``$ mkdir -p ~/wpilib/ 2020'' ile

source: Drag the contents of WPILib_Linux-VERSIONUM directory to ~/wpilib/2020 or run ``$ mv -v WPILib_Linux-VERSIONUM/* ~/wpilib/2020``
es_mx: Arrastre el contenido del directorio WPILib_Linux-VERSIONUM a ~/wpilib/2020 o ejecute ``$ mv -v WPILib_Linux-VERSIONUM/* ~/wpilib/2020``
fr_ca: Faites glisser le contenu du répertoire WPILib_Linux-VERSIONUM vers ~/wpilib/2020 ou exécuter ``$ mv -v WPILib_Linux-VERSIONUM/* ~/wpilib/2020``
tr_tr: WPILib_Linux-VERSIONUM dizininin içeriğini ~/wpilib/2020'ye sürükleyin veya ``$ mv -v WPILib_Linux-VERSIONUM/* ~/wpilib/2020`` komutunu çalıştırın.

source: **Running Tools Updater**
es_mx: **Ejecutando el Actualizador de Herramientas**
fr_ca: **L'exécution de l'utilitaire de mise à jour des outils**
tr_tr: **Tool Updater - Araç Güncelleyici çalıştırmak**

source: To update or extract the WPILib tools (Dashboards, Robot Builder, etc.), run:
es_mx: Para actualizar o extraer las herramientas WPILib (Dashboards, Robot Builder, etc.), ejecute:
fr_ca: Pour mettre à jour ou extraire les outils WPILib (Dashboards, Robot Builder, etc.), exécutez:
tr_tr: WPILib araçlarını (Dashboards, Robot Builder, vb.) güncellemek veya çıkarmak için şunu çalıştırın:

source: **Installing the extensions for WPILib Visual Studio Code**
es_mx: **Instalación de las extensiones del VS Code para WPILib **
fr_ca: **Installation des extensions pour WPILib Visual Studio Code**
tr_tr: **WPILib Visual Studio Code için uzantıları yükleme**

source: Start VS Code (``$ code`` or search "Visual Studio Code" in your application launcher)
es_mx: Inicie el código Visual Studio (``$ code`` o busque "Visual Studio Code" en su lanzador de aplicaciones)
fr_ca: Démarrer VS Code (``$ code`` ou recherchez "Visual Studio Code" dans votre lanceur d'application)
tr_tr: VS Code'u başlatın (``$ code`` veya uygulama başlatıcınızda "Visual Studio Code" u arayın)

source: *Control-Shift-P* to bring up the command palette, type "Install from VSIX"
es_mx: *Control-Shift-P* para abrir la bandeja de comandos, escriba "Instalar desde VSIX"
fr_ca: *Control-Shift-P* pour faire apparaître la palette de commandes, tapez "Install from VSIX"
tr_tr: *Control-Shift-P* komut paletini açmak için "Install from VSIX" yazın

source: Select "Extensions: Install from VSIX"
es_mx: Seleccione “Extensiones: Instalar desde VSIX”
fr_ca: Sélectionner "Extensions: Install from VSIX"
tr_tr: "Extensions: Install from VSIX" yi seçin

source: Navigate to ``~/wpilib/2020/vsCodeExtensions`` and select Cpp.vsix
es_mx: Navegue a ``~/wpilib/2020/vsCodeExtensions`` y seleccione Cpp.vsix
fr_ca: Accéder à ``~/wpilib/2020/vsCodeExtensions`` et sélectionnez Cpp.vsix
tr_tr: ``~/Wpilib/2020/vsCodeExtensions'' seçeneğine gidin ve Cpp.vsix'i seçin

source: Repeat for JavaLang.vsix, JavaDeps.vsix, JavaDebug.vsix, and WPILib.vsix in that order
es_mx: Repita en orden para JavaLang.vsix, JavaDeps.vsix, JavaDebug.vsix, y WPILib.vsix
fr_ca: Répéter pour JavaLang.vsix, JavaDeps.vsix, JavaDebug.vsix et WPILib.vsix dans cet ordre
tr_tr: Sırayla JavaLang.vsix, JavaDeps.vsix, JavaDebug.vsix ve WPILib.vsix için tekrarlayın

source: Press *Ctrl-Shift-P* and type *WPILib* or click on the WPILib icon in the top right to open the WPILib Command Palette
es_mx: Presione *Ctrl-Shift-P* y escriba *WPILib* o haga clic en el icono WPILib arriba a la derecha para abrir la bandeja de comandos de WPILib
fr_ca: Appuyer sur *Ctrl-Shift-P* et tapez *WPILib* ou cliquer sur l'icône WPILib en haut à droite pour ouvrir la palette de commandes WPILib
tr_tr: *Ctrl-Shift-P* tuşlarına basın ve *WPILib* yazın veya WPILib Komut Paletini açmak için sağ üstteki WPILib simgesine tıklayın

source: Begin typing *Set VS Code Java Home to FRC Home* and select that item from the dropdown.
es_mx: Comience escribiendo *Establecer VS Code Java Home en FRC Home* y seleccione esa opción de la barra desplegable
fr_ca: Commencer à taper *Set VS Code Java Home to FRC Home* et sélectionner cet élément dans la liste déroulante.
tr_tr: *Set VS Code Java Home to FRC Home* yazmaya başlayın ve açılır menüden bu öğeyi seçin.

source: **Install libvulkan for simulation GUI**
es_mx: **Instale libvulkan para la GUI de simulación**
fr_ca: **Installer libvulkan pour l'interface graphique de simulation**
tr_tr: **Simülasyon GUI'si için libvulkan'ı kurun**

source: To install libvulkan in order to run the simulation GUI run:
es_mx: Para instalar libvulkan y para que la ejecución de la GUI simulación, ejecute:
fr_ca: Pour installer libvulkan afin d'exécuter l'interface graphique de simulation:
tr_tr: Simülasyon GUI çalıştırmak amacıyla libvulkan'ı kurmak için:

source: The installation directory has changed for 2020. In 2019 the software was installed to ``~\frcYYYY`` where ~ is ``C:\Users\Public`` on Windows and YYYY is the FRC year. In 2020 and later it is installed to ``~\wpilib\YYYY``. This lessens clutter when multiple years software are installed.
es_mx: El directorio de instalación ha cambiado para 2020. En el 2019 se instaló el software a ``~\frcYYYY`` donde ~ is ``C:\Users\Public`` en Windows y YYYY se refiere al año de FRC. En el 2020 y después se instala en ``~\wpilib\YYYY``. Esto ayuda a evitar el desorden cuando se tienen instalados software de varios años.
fr_ca: Le répertoire d'installation a changé pour 2020. En 2019, le logiciel a été installé sur ``~\frcYYYY`` ou le tilde ~ correspond à ``C:\Users\Public`` sous Windows et YYYY est l'année FRC. Pour 2020 et ultérieurement, il sera installé sur ``~\wpilib\YYYY``. Cela réduit l'encombrement sur votre disque dur lorsque plusieurs versions (années) de logiciel sont installées.
tr_tr: Kurulum dizini 2020 için değiştirildi. 2019'da yazılım ``~\frcYYYY`` olarak kuruldu; burada ~, Windows'ta ``C:\Users\Public`` ve YYYY FRC yılıdır. 2020 ve sonrasında ``~\wpilib\YYYY`` dizinine kurulur. Bu, üst üste birkaç yıllık yazılım yüklendiğinde karmaşayı azaltır.

source: Uninstall Instructions
es_mx: Desinstalar Instrucciones
fr_ca: Instructions de désinstallation
tr_tr: Kaldırma talimatları

source: WPILib is designed to install to different folders for different years, so that it is not necessary to uninstall a previous version before installing this year's WPILib. However, the following instructions can be used to uninstall WPILib if desired.
es_mx: WPILib está diseñado para poderse instalar en diferentes carpetas durante diferentes años, así que no es necesario desinstalar una versión previa antes de instalar WPILib de este año. No obstante, las siguientes instrucciones pueden usarse para desinstalar WPILib si es que se desea.
fr_ca: WPILib est conçu pour être installé dans différents dossiers pendant différentes années, de sorte qu'il n'est pas nécessaire de désinstaller une version précédente avant d'installer le WPILib de cette année courante. Cependant, les instructions suivantes peuvent être utilisées pour désinstaller WPILib si vous le souhaitez.
tr_tr: WPILib, farklı yıllar için farklı klasörlere yüklenecek şekilde tasarlanmıştır, bu nedenle bu yılın WPILib'ini kurmadan önce önceki bir sürümü kaldırmaya gerek yoktur. Ancak, istenirse aşağıdaki talimatlar WPILib'i kaldırmak için kullanılabilir.

source: Delete the appropriate wpilib folder (2019: ``c:\Users\Public\frc2019``, 2020 and later: ``c:\Users\Public\wpilib\YYYY`` where ``YYYY`` is the year to uninstall)
es_mx: Elimine la carpeta correcta de wpilib (2019: ``c:\Users\Public\frc2019``, 2020 y después: ``c:\Users\Public\wpilib\YYYY`` donde ``YYYY`` es el año en que se desinstala)
fr_ca: Supprimez le dossier wpilib approprié (pour 2019: ``c:\Users\Public\frc2019``, pour 2020 et versions ultérieures: ``c:\Users\Public\wpilib\YYYY`` où ``YYYY`` est l'année à désinstaller)
tr_tr: Uygun wpilib klasörünü silin (2019: ``c:\Users\Public\frc2019``, 2020 ve sonrası: ``c:\Users\Public\wpilib\YYYY`` burada ``YYYY`` kaldırılacak yıldır)

source: Delete the desktop icons at ``C:\Users\Public\Public Desktop``
es_mx: Elimine los iconos del escritorio en ``C:\Users\Public\Public Desktop``
fr_ca: Supprimez les icônes du bureau dans ``C:\Users\Public\Public Desktop``
tr_tr: ``C:\Users\Public\Public Desktop`` konumundaki masaüstü simgelerini silin.

source: Delete the path environment variables.
es_mx: Elimine las variables de entorno de ruta de acceso.
fr_ca: Supprimez les variables d'environnement de chemin (Path).
tr_tr: Yol ortam değişkenlerini - path environment silin.

source: In the start menu, type environment and select "edit the system environment variables"
es_mx: En el menú de inicio, escriba entorno y seleccione "Editar las variables de entorno del sistema"
fr_ca: Dans le menu Start, taper Environment et sélectionnez "edit the system environment variables"
tr_tr: Başlangıç menüsünde environment yazın ve "edit the system environment variables" yi seçin

source: Click on the environment variables button (1).
es_mx: Haga clic en el botón de variables de entorno (1).
fr_ca: Cliquez sur le bouton des variables d'environnement (1).
tr_tr: Ortam değişkenleri - environment variables düğmesine (1) tıklayın.

source: In the user variables, select path (2) and then click on edit (3).
es_mx: En las variables de usuario, seleccione la ruta (2) y luego haga clic en editar (3).
fr_ca: Dans les variables utilisateur, sélectionnez le chemin (path) (2) puis cliquez sur edit (3).
tr_tr: Kullanıcı değişkenlerinde, yolu - path (2) seçin ve ardından edit(3) üzerine tıklayın.

source: Select the path with ``roborio\bin`` (4) and click on delete (5).
es_mx: Seleccione la ruta con de ``roborio\bin`` (4) y haga clic en eliminar (5).
fr_ca: Sélectionnez le chemin avec ``roborio\bin`` (4) et cliquez sur supprimer (5).
tr_tr: Yolu ``roborio\bin`` (4) ile seçin ve delete - sil'e (5) tıklayın.

source: Select the path with ``frccode`` and click on delete (5).
es_mx: Seleccione la ruta con ``frccode`` y haga clic en eliminar (5).
fr_ca: Sélectionnez le chemin avec ``frccode`` et cliquez sur supprimer (5).
tr_tr: ``frccode`` ile yolu seçin ve sil'e tıklayın (5).

source: Repeat steps 3-6 in the Systems Variable pane.
es_mx: Repita los pasos de 3-6 veces en el panel variable de sistemas.
fr_ca: Répétez les étapes 3 à 6 dans le volet "Systems Variable".
tr_tr: System Variable bölmesinde 3-6 adımlarını tekrarlayın.
