Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/wpilib-setup.po
Languages: es_mx, fr_ca, tr_tr

source: WPILib Installation Guide
es_mx: Guía de Instalación WPILib
fr_ca: Guide d'installation WPILib
tr_tr: WPILib Kurulum Kılavuzu

source: This setup is for C++/Java teams. LabVIEW teams should proceed to :doc:`Installing LabVIEW for FRC </docs/getting-started/getting-started-frc-control-system/labview-setup>`.
es_mx: Esta configuración es para los equipos con C++/Java, Los equipos con LabVIEW deben proceder a :doc:`Instalar LabVIEW para FRC 1`.
fr_ca: Cette configuration est destinée aux équipes qui utilisent C ++ ou Java. Les équipes LabVIEW doivent procéder à :doc:`Installing LabVIEW for FRC </docs/getting-started/getting-started-frc-control-system/labview-setup>`.
tr_tr: Bu kurulum C ++ / Java ekipleri içindir. LabVIEW ekipleri şu şekilde ilerlemelidir :doc:`FRC </docs/getting-started/getting-started-frc-control-system/labview-setup> için LabVIEW Kurulumu`.

source: Windows
fr_ca: Pour Windows

source: **Offline Installer**
es_mx: **Instalador Sin Conexión**
fr_ca: **Installateur hors ligne**
tr_tr: **Offline Kurulum**

source: Download the appropriate installer for your Windows installation (32 bit or 64 bit) `from GitHub <https://github.com/wpilibsuite/allwpilib/releases>`__. If you're not sure, open Control Panel -> System to check. After the zip file is downloaded, ensure that the installer is extracted before attempting to run it. Running it while the installer is inside the zip will cause the installation process to fail.
es_mx: Descargue el instalador apropiado para la instalación de Windows (32 bits o 64 bits) `de GitHub <https://github.com/wpilibsuite/allwpilib/releases>`__. Si no está seguro, abra Panel de Control -> Sistema para verificar. Después de que el archivo zip este descargado, asegúrese de que el instalador se extrae antes de intentar ejecutarlo. Ejecutarlo mientras el instalador está dentro del archivo zip hará que el proceso de instalación falle.
fr_ca: Téléchargez le programme d'installation approprié pour votre installation Windows (32 bits ou 64 bits) `à partir de GitHub <https://github.com/wpilibsuite/allwpilib/releases>`__. Si vous n'êtes pas sûr, ouvrez Control Panel -> System pour vérifier. Une fois le fichier zip téléchargé, assurez-vous que le programme d'installation est extrait avant d'essayer de l'exécuter. L'exécuter alors que le programme d'installation est à l'intérieur du zip entraînera l'échec du processus d'installation.
tr_tr: Windows kurulumunuz için uygun yükleyiciyi (32 bit veya 64 bit) `GitHub <https://github.com/wpilibsuite/allwpilib/releases>`__ adresinden indirin. Sisteminizden emin değilseniz kontrol etmek için Denetim Masası -> Sistem'i açın. Zip dosyası indirildikten sonra, çalıştırmayı denemeden önce yükleyicinin dosyadan çıkarıldığından emin olun. Yükleyici zip dosyası içindeyken çalıştırmak, yükleme işleminin başarısız olmasına neden olur.

source: Double click on the installer to run it. If you see any Security warnings, click *Run (Windows 7)* or *More Info -> Run Anyway* (Windows 8+).
es_mx: Haga doble clic en el instalador para ejecutarlo. Si ve alguna advertencia de seguridad, haga clic en *Ejecutar (Windows 7)* o *Más información -> Ejecutar de todos modos (Windows 8+)*.
fr_ca: Double-cliquez sur le programme d'installation pour l'exécuter. Si vous voyez des avertissements de sécurité, cliquez sur *Run (Windows 7)* ou *More Info -> Run Anyway* (Windows 8+).
tr_tr: Çalıştırmak için yükleyiciye çift tıklayın. Herhangi bir Güvenlik uyarısı görürseniz, *Çalıştır (Windows 7)* veya *Daha Fazla Bilgi -> Yine de Çalıştır* (Windows 8+) seçeneğini tıklayın.

source: Choose whether to install for *All Users* on the machine or the *Current User*. The *All Users* option requires administrator privileges, but installs in a way that is accessible to all user accounts, the *Current User* install is only accessible from the account it is installed from.
es_mx: Elija si desea instalar para *Todos los Usuarios* en el equipo o el *Usuario Actual*. La opción de *Todos los Usuarios* requiere un administrador de privilegios, se tiene que instalar de tal manera que sea accesible para todas las cuentas de los usuarios, la instalación *Usuario Actual* solo es accesible desde la cuenta en la que se instaló.
fr_ca: Choisissez d'installer pour *All Users* sur la machine ou pour *Current User*. L'option *All Users* nécessite des privilèges d'administrateur, mais s'installe d'une manière qui est accessible à tous les comptes d'utilisateurs, l'installation *Current User* n'est accessible qu'à partir du compte à partir duquel elle est installée.
tr_tr: Makinede *Tüm Kullanıcılar* için mi yoksa *Mevcut Kullanıcı* için mi kurulacağını seçin. *Tüm Kullanıcılar* seçeneği, yönetici ayrıcalıkları gerektirir, ancak tüm kullanıcı hesaplarının erişebileceği bir şekilde yükler, *Geçerli Kullanıcı* kurulumuna yalnızca yüklendiği hesaptan erişilebilir.

source: If you select *All Users*, you will need to accept the security prompt that appears to allow administrator access.
es_mx: Si seleccionas *Todos los Usuarios*, deberá aceptar el aviso de seguridad que aparece para permitir el acceso al administrador.
fr_ca: Si vous sélectionnez *All Users*, vous devrez accepter l'invitation de sécurité qui apparaît pour autoriser l'accès administrateur.
tr_tr: *Tüm Kullanıcılar*'ı seçerseniz, yönetici erişimine izin vermek için görünen güvenlik istemini kabul etmeniz gerekecektir.

source: Regardless of whether *All Users* or *Current User* is chosen, the software is installed to ``C:\Users\Public\wpilib\YYYY`` where YYYY is the current FRC year. If you choose *All Users*, then shortcuts are installed to all users desktop and start menu and system environment variables are set. If *Current User* is chosen, then shortcuts and environment variables are set for only the current user.
es_mx: Independientemente de si se elige *Todos los Usuarios* o *Usuario Actual*, el software se instalará en ``C:\Users\Public\wpilib\YYYY`` donde YYYY es el año actual de FRC. Si elige *Todos los Usuarios*, los accesos directos se instalan en el escritorio de todos los usuarios y se establecen las variables de entorno del menú de inicio y del sistema. Si se elige al *Usuario Actual*, los accesos directos y las variables de entorno se establecen solo para el usuario actual.
fr_ca: Peu importe si *All Users* ou *Current User* est choisi, le logiciel est installé dans ``C:\Users\Public\wpilib\YYYY`` où YYYY est l'année FRC actuelle. Si vous choisissez *All Users*, des raccourcis sont installés sur le bureau de tous les utilisateurs et le menu Démarrer et les variables d'environnement système sont définis. Si *Current User* est choisi, les raccourcis et les variables d'environnement sont définis uniquement pour l'utilisateur actuel.
tr_tr: *Tüm Kullanıcılar* veya *Geçerli Kullanıcı* seçimine bakılmaksınız, yazılım YYYY'nin geçerli FRC yılı olduğu ``C:\Users\Public\wpilib\YYYY`` konumuna yüklenir. *Tüm Kullanıcılar*'ı seçerseniz, kısayollar tüm kullanıcıların masaüstüne yüklenir ve başlat menüsü ve sistem ortamı değişkenleri ayarlanır. *Geçerli Kullanıcı* seçilirse, kısayollar ve ortam değişkenleri yalnızca geçerli kullanıcı için ayarlanır.

source: **Download Visual Studio Code**
es_mx: **Descargar Visual Studio Code**
fr_ca: **Téléchargez Visual Studio Code**
tr_tr: **Visual Studio Code'u indirin**

source: For licensing reasons, the installer cannot contain the VS Code installer bundled in. Click *Select/Download VS Code* to either download the VS Code installer or select a pre-downloaded copy. If you intend to install on other machines without internet connections, after the download completes, you can click *Open Downloaded File* to be taken to the zip file on the file system to copy along with the Offline Installer.
es_mx: Por motivos de licencia, el instalador no puede contener el instalador de VS Code incluido. Haga clic en *Seleccionar/Descargar VS Code * para descargar el instalador de VS Code o seleccionar una copia previamente descargada. Si su intención es instalar en otros dispositivos sin conexión a internet, una vez completa la descarga, pude hacer clic en *Abrir Archivo Descargado* para ser llevado al archivo zip del sistema de archivos y copiarlo junto con el instalador sin conexión.
fr_ca: Pour des raisons de licence, le programme d'installation ne peut pas contenir le programme d'installation VS Code fourni. Cliquez sur *Select/Download VS Code* pour télécharger le programme d'installation VS Code ou sélectionner une copie pré-téléchargée. Si vous avez l'intention d'installer sur d'autres machines sans connexion Internet, une fois le téléchargement terminé, vous pouvez cliquer sur *Open Downloaded File* pour accéder au fichier zip du système de fichiers à copier avec le programme d'installation hors ligne.
tr_tr: Lisanslama nedenlerinden dolayı, yükleyici, birlikte verilen VS Code yükleyicisini içeremez. VS Code yükleyicisini indirmek veya önceden indirilmiş bir kopyayı seçmek için *Select/Download VS Code* seçeneğini tıklayın. İnternet bağlantısı olmayan diğer makinelere yüklemeyi planlıyorsanız, indirme işlemi tamamlandıktan sonra, çevrimdışı yükleyici ile birlikte kopyalamak üzere dosya sistemindeki zip dosyasına götürmek için *Open Downloaded File* seçeneğine tıklayabilirsiniz.

source: **Execute Install**
es_mx: **Ejecutar Instalación**
fr_ca: **Exécuter l'installation**
tr_tr: **Kuruluma Başlamak**

source: Make sure all checkboxes are checked (unless you have already installed 2020 WPILib software on this machine and the software unchecked them automatically), then click *Execute Install*.
es_mx: Asegúrese de que todas las casillas de verificación estén marcadas (a menos de haber instalado previamente 2020 WPILib software en el dispositivo y el software los haya desmarcado automáticamente), luego haga clic en *Ejecutar Instalación*.
fr_ca: Assurez-vous que toutes les cases à cocher sont cochées (sauf si vous avez déjà installé le logiciel 2020 WPILib sur cette machine et que le logiciel les a décochées automatiquement), puis cliquez sur *Execute Install*.
tr_tr: Tüm onay kutularının işaretlendiğinden emin olun (bu makineye 2020 WPILib yazılımını zaten yüklemediyseniz ve yazılım bunları otomatik olarak işaretlemediyse), ardından *Execute Install* öğesine tıklayın.

source: **Finished**
es_mx: Terminado
fr_ca: **Lorsque c'est terminé**
tr_tr: ** Bitti **

source: When the installer completes, you will now be able to open and use the WPILib version of VS Code. If you are using any 3rd party libraries, you will still need to install those separately before using them in robot code.
es_mx: Cuando el instalador este completo, ahora podrá abrirlo y utilizar WPILib versión de VS Code. Si está utilizando alguna biblioteca de 3eros, aún tendrá que instalarlos por separado antes de usarlos en el código del robot.
fr_ca: Une fois le programme d'installation terminé, vous pourrez désormais ouvrir et utiliser la version WPILib de VS Code. Si vous utilisez des librairies tierces, vous devrez toujours les installer séparément avant de les utiliser dans le code du robot.
tr_tr: Yükleyici tamamlandığında, artık VS Code'un WPILib sürümünü açıp kullanabileceksiniz. Herhangi bir 3. parti kitaplığı kullanıyorsanız, bunları robot kodunda kullanmadan önce yine de ayrı ayrı yüklemeniz gerekecektir.

source: **What's installed?**
es_mx: **¿Qué está instalado?**
fr_ca: **Qu'est-ce qui est installé?**
tr_tr: **Ne yüklendi?**

source: The Offline Installer installs the following components:
es_mx: El instalador sin conexión instala los siguientes componentes:
fr_ca: Le programme d'installation hors ligne installe les composants suivants:
tr_tr: Çevrimdışı Yükleyici aşağıdaki bileşenleri yükler:

source: *Visual Studio Code* - The supported IDE for 2019 and later robot code development. The offline installer sets up a separate copy of VS Code for WPILib development, even if you already have VS Code on your machine. This is done because some of the settings that make the WPILib setup work may break existing workflows if you use VS Code for other projects.
es_mx: *Visual Studio Code* - El IDE compatible para el desarrollo de código del robot de 2019 y posteriormente. El instalador sin conexión establece una copia independiente de VS Code para el desarrollo de WPILib, incluso cuando ya se tiene VS en el dispositivo. Esto es porque algunos ajustes que hacen que la configuración de WPILib funcione puedan interrumpir los flujos de trabajo existentes si se usa el VS Code para otros proyectos.
fr_ca: *Le Visual Studio Code* - L'IDE pris en charge pour 2019 et pour le développement ultérieur de code robot. Le programme d'installation hors ligne configure une copie distincte de VS Code pour le développement WPILib, même si vous avez déjà VS Code sur votre ordinateur. Cela est fait car certains des paramètres qui font fonctionner le programme d'installation de WPILib peuvent interrompre les flux de travail existants si vous utilisez VS Code pour d'autres projets.
tr_tr: *Visual Studio Code* - 2019 ve ilerisi için robot kodu geliştirme için desteklenen IDE. Çevrimdışı yükleyici, makinenizde zaten VS Kodunuz olsa bile, WPILib geliştirme için VS Code'un ayrı bir kopyasını ayarlar. Bu, WPILib kurulumunun çalışmasını sağlayan bazı ayarların diğer projeler için VS Code kullanırsanız mevcut iş akışlarını bozabileceği için yapılır.

source: *C++ Compiler* - The toolchains for building C++ code for the roboRIO
es_mx: *Compilador C++* - Las cadenas de herramientas para crear el código C++ para la roboRIO.
fr_ca: *Le compilateur C++* - Les chaînes d'outils pour créer du code C++ pour le roboRIO
tr_tr: *C ++ Compiler* - roboRIO için C++ kodu oluşturmaya yönelik araçlar topluluğu

source: *Gradle* - The specific version of Gradle used for building/deploying C++ or Java robot code
es_mx: *Gradle* - La versión específica de Gradle que se utiliza para construir/desarrollar el código en C++ o Java para el robot.
fr_ca: *Gradle* - La version spécifique de Gradle utilisée pour créer / déployer du code robot C++ ou Java
tr_tr: *Gradle* - C++ veya Java robot kodu oluşturmak/dağıtmak için kullanılan belirli Gradle sürümü

source: *Java JDK/JRE* - A specific version of the Java JDK/JRE that is used to build Java robot code and to run any of the Java based Tools (Dashboards, etc.). This exists side by side with any existing JDK installs and does not overwrite the ``JAVA_HOME`` variable
es_mx: *Java JDK/JRE* - Una versión específica de Java JDK/JRE que se utiliza para crear el código del robot en Java y para ejecutar cualquiera de las herramientas establecidas de Java (Dashboards, etc.). Esto existe al lado de cualquier instalación JDK existente y no sobrescribe la variable ``JAVA_HOME``.
fr_ca: *Java JDK / JRE* - Une version spécifique du Java JDK / JRE qui est utilisée pour créer du code de robot Java et pour exécuter l'un des outils basés sur Java (tableaux de bord, etc.). Cela existe côte à côte avec toutes les installations JDK existantes et n'écrase pas la variable ``JAVA_HOME``.
tr_tr: *Java JDK/JRE* - Java robot kodu oluşturmak ve Java tabanlı Araçlardan herhangi birini (Gösterge Tabloları, vb.) çalıştırmak için kullanılan Java JDK/JRE'nin belirli bir sürümü. Bu, mevcut herhangi bir JDK kurulumuyla yan yana bulunur ve ``JAVA_HOME`` değişkeninin üzerine yazmaz

source: *WPILib Tools* - SmartDashboard, Shuffleboard, Robot Builder, Outline Viewer, Pathweaver
es_mx: *Herramientas WPILib* - SmartDashboard, Shuffleboard, Robot Builder, Outline Viewer, Pathweaver.
fr_ca: *Les outils WPILib* - SmartDashboard, Shuffleboard, Robot Builder, Outline Viewer, Pathweaver

source: *WPILib Dependencies* - OpenCV, etc.
es_mx: *Dependencias WPILib* - OpenCV, etc.
fr_ca: *Les dépendances WPILib* - OpenCV, etc.
tr_tr: *WPILib Dependencies* - OpenCV, v.b.

source: *VS Code Extensions* - WPILib extensions for robot code development in VS Code
es_mx: *Extensiones de VS Code* - Las extensiones de WPILib para el desarrollo del código del robot en VS Code.
fr_ca: *Les extensions VS Code* - Extensions WPILib pour le développement de code robot dans VS Code
tr_tr: *VS Code Extensions* - VS Code'da robot kodu geliştirme için WPILib uzantıları

source: **What's Installed - Continued**
es_mx: **Lo que está instalado - Continuación**
fr_ca: **Ce qui est installé - la suite**
tr_tr: **Ne Yüklenir - Devam**

source: The Offline Installer also installs a Desktop Shortcut to the WPILib copy of VS Code and sets up a command shortcut so this copy of VS Code can be opened from the command line using the command ``frccode2020``.
es_mx: El instalador sin conexión también instala un acceso directo de escritorio a la copia WPILib del VS Code y configura un atajo de comando para que esta copia del VS Code pueda abrirse desde la línea de comandos mediante el comando `frccode2020``.
fr_ca: Le programme d'installation hors ligne installe également un raccourci de bureau vers la copie WPILib de VS Code et configure un raccourci de commande afin que cette copie de VS Code puisse être ouverte à partir de la ligne de commande à l'aide de la commande ``frccode2020``.
tr_tr: Çevrimdışı Yükleyici ayrıca VS Code'un WPILib kopyasına bir Masaüstü Kısayolu yükler ve bir komut kısayolu kurar, böylece VS Code'un bu kopyası ``frccode2020`` komutu kullanılarak komut satırından açılabilir.

source: Both of these reference the specific year as the WPILib C++ tools will now support side-by-side installs of multiple environments from different seasons.
fr_ca: Les deux font référence à l'année spécifique car les outils WPILib C ++ prendront désormais en charge les installations côte à côte de plusieurs environnements de différentes saisons.
tr_tr: WPILib C++ araçları artık farklı sezonlarda birden çok ortamın yan yana kurulumunu destekleyeceği için bunların her ikisi de belirli bir yıla atıfta bulunmaktadır.

source: macOS
fr_ca: Pour macOS

source: **Getting Visual Studio Code**
es_mx: **Obtener el Código Visual Studio**
fr_ca: **Obtenir Visual Studio Code**
tr_tr: **Visual Studio Code Edinme**

source: VS Code is the IDE (Integrated Development Environment) that is used for 2019 and beyond. It needs to be installed on any development computer. It can be downloaded here: `code.visualstudio.com <https://code.visualstudio.com/>`__. For 2020, the recommended version is 1.41.1 which can be directly downloaded here: `https://update.code.visualstudio.com/1.41.1/darwin/stable <https://update.code.visualstudio.com/1.41.1/darwin/stable>`__
es_mx: El VS Code es el IDE (Entorno de Desarrollo Integrado) que se utiliza a partir del 2019. Debe estar instalado en cualquier computadora de desarrollo. Puede descargarse aquí: `code.visualstudio.com <https://code.visualstudio.com/>`__. Para el 2020, la versión recomendada es 1.41.1 la cual se puede descargar directamente aquí: `https://update.code.visualstudio.com/1.41.1/darwin/stable <https://update.code.visualstudio.com/1.41.1/darwin/stable>`__
fr_ca: VS Code est l'IDE (Environnement de Développement Intégré) utilisé pour 2019 et ultérieurement. Il doit être installé sur n'importe quel ordinateur de développement. Il peut être téléchargé ici: `code.visualstudio.com <https://code.visualstudio.com/>`__. Pour 2020, la version recommandée est la 1.41.1 qui peut être directement téléchargée ici: `https://update.code.visualstudio.com/1.41.1/darwin/stable <https://update.code.visualstudio.com/1.41.1/darwin/stable>`__
tr_tr: VS Code, 2019 ve sonrası için kullanılan IDE'dir (Integrated Development Environment - Entegre Geliştirme Ortamı). Herhangi bir geliştirme bilgisayarına yüklenmesi gerekir. Buradan indirilebilir: `code.visualstudio.com <https://code.visualstudio.com/>`__. 2020 için önerilen sürüm 1.41.1'dir ve buradan doğrudan indirilebilir: https://update.code.visualstudio.com/1.41.1/darwin/stable <https://update.code.visualstudio.com/1.41.1/darwin/stable>`__

source: The downloaded file will be "VSCode-darwin-stable.zip" (1)
es_mx: El archivo descargado será "VSCode-darwin-stable.zip" (1)
fr_ca: Le fichier téléchargé sera "VSCode-darwin-stable.zip" (1)
tr_tr: İndirilen dosya "VSCode-darwin-stable.zip" (1) olacaktır.

source: Once downloaded, double-click on the zip file to expand it and copy the new file: "Visual Studio Code" to the Applications folder (2).
es_mx: Una vez descargado, haga doble clic en el archivo zip para expandirlo y copie el nuevo archivo: "Visual Studio Code" a la carpeta de Aplicaciones (2).
fr_ca: Une fois téléchargé, double-cliquez sur le fichier zip pour le décompresser et copiez le nouveau fichier: "Visual Studio Code" dans le dossier Applications (2).
tr_tr: İndirildikten sonra, açmak için zip dosyasına çift tıklayın ve yeni dosya olan "Visual Studio Code" u Uygulamalar klasörüne (2) kopyalayın.

source: **Download the WPILib release and move the directory**
es_mx: **Descargue la versión WPILib y mueva el directorio**
fr_ca: **Télécharger la version WPILib et déplacer le répertoire**
tr_tr: **WPILib sürümünü indirin ve dizini taşıyın**

source: Download the software release by navigating to this page: https://github.com/wpilibsuite/allwpilib/releases and downloading the macOS release.
es_mx: Descargue la versión del software navegando a esta página: https://github.com/wpilibsuite/allwpilib/releases al igual que la versión de macOS.
fr_ca: Télécharger la version du logiciel en accédant à cette page: https://github.com/wpilibsuite/allwpilib/releases et en téléchargeant la version macOS.
tr_tr: Bu sayfaya giderek yazılım sürümünü indirin: https://github.com/wpilibsuite/allwpilib/releases ve macOS sürümünü indirin.

source: Unzip and untar the file by looking at the file in the explorer and double-clicking on it, once or twice to unzip (remove the ``.gz`` extension) and again to untar it (remove the ``.tar`` extension). When finished it should look like the folder shown below.
fr_ca: Décompresser les fichiers d’extension ``.gz`` et d’extension ``.tar`` en les localisant à l'aide de l’explorateur et en cliquant ou en double-cliquant dessus pour supprimer l’extension ``.gz``, faites de même pour supprimer l’extension ``.tar``. Une fois terminé, il doit ressembler au dossier ci-dessous.
tr_tr: Gezginde dosyaya bakarak ve dosyaya çift tıklayarak, bir veya iki kez açarak (``.gz`` uzantısını kaldırın) ve yeniden açmak için untar yapın ( ``.tar`` uzantısını kaldırın). Bittiğinde, aşağıda gösterilen klasör gibi görünmelidir.

source: Using Finder (or command line) copy the contents of the folder to a new folder in your home directory, ~/wpilib/2020 as shown below.
es_mx: Usando Finder (o línea de comando) copie el contenido de la carpeta a una nueva carpeta en su directorio de inicio, ~/wpilib/2020 como se muestra a continuación.
fr_ca: À l'aide du Finder (ou de la ligne de commande), copiez le contenu du dossier dans un nouveau dossier de votre répertoire personnel, ~/wpilib/2020 comme indiqué ci-dessous.
tr_tr: Finder'ı (veya komut satırını) kullanarak, klasörün içeriğini aşağıda gösterildiği gibi ~/wpilib/2020 ana dizininizdeki yeni bir klasöre kopyalayın.

source: **Run the ToolsUpdater.py script**
es_mx: Ejecute el ToolsUpdater.py script
fr_ca: **Exécuter le script ToolsUpdater.py**
tr_tr: **ToolsUpdater.py komut dosyasını çalıştırın**
