Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/getting-started/getting-started-frc-control-system/wpilib-setup.po
Languages: es_mx, fr_ca, tr_tr

source: Delete Visual Studio Code from the Applications folder. Alternately, the extensions can be `uninstalled <https://code.visualstudio.com/docs/editor/extension-gallery#_manage-extensions>`__
es_mx: Elimine el Visual Studio Code de la carpeta de Aplicaciones: Alternativamente, las extensiones pueden ser `desinstaladas. <https://code.visualstudio.com/docs/editor/extension-gallery#_manage-extensions>`__
fr_ca: Supprimez Visual Studio Code du dossier Applications. Alternativement, les extensions peuvent être `désinstallées <https://code.visualstudio.com/docs/editor/extension-gallery#_manage-extensions>`__
tr_tr: Visual Studio Code'u Uygulamalar klasöründen silin. Alternatif olarak, uzantılar `buradan kaldırılabilir<https://code.visualstudio.com/docs/editor/extension-gallery#_manage-extensions>`__

source: Delete the appropriate wpilib folder (2019: ``~/frc2019``, 2020 and later: ``~/wpilib/YYYY`` where ``YYYY`` is the year to uninstall)
es_mx: Elimine la carpeta correcta de WPILib (2019: ``~/frc2019``, 2020 y después: ``~/wpilib/YYYY`` donde ``YYYY`` es el año en el que se desinstala)
fr_ca: Supprimez le dossier wpilib approprié (pour 2019: ``~/frc2019``, pour 2020 et versions ultérieures: ``~/wpilib/YYYY`` où ``YYYY`` est l'année à désinstaller)
tr_tr: Uygun wpilib klasörünü silin (2019: ``~/frc2019``, 2020 ve sonrası: ``~/wpilib/YYYY`` burada ``YYYY`` kaldırılacak yıldır)

source: Delete the appropriate wpilib folder (2019: ``~/frc2019``, 2020 and later: ``~/wpilib/YYYY`` where ``YYYY`` is the year to uninstall). eg ``rm -rf ~/frc2019``
es_mx: Elimine la carpeta correcta de WPILib (2019: ``~/frc2019``, 2020 y después: ``~/wpilib/YYYY`` donde ``YYYY`` es el año en el que se desinstala). eg ``rm -rf ~/frc2019``
fr_ca: Supprimez le dossier wpilib approprié (pour 2019: ``~/frc2019``, pour 2020 et versions ultérieures: ``~/wpilib/YYYY`` où ``YYYY`` est l'année à désinstaller); par exemple ``rm -rf ~/frc2019``
tr_tr: Uygun wpilib klasörünü silin (2019: ``~/frc2019``, 2020 ve sonrası: ``~/wpilib/YYYY`` burada ``YYYY`` kaldırılacak yıldır). Örneğin: ``rm -rf ~/frc2019``

source: Uninstall Visual Studio Code ``sudo dpkg -r code``. Alternately, the extensions can be `uninstalled <https://code.visualstudio.com/docs/editor/extension-gallery#_manage-extensions>`__
es_mx: Desinstale el Visual Studio Code: ``sudo dpkg -r code``. Alternativamente, las extensiones pueden ser `desinstaladas. <https://code.visualstudio.com/docs/editor/extension-gallery#_manage-extensions>`__
fr_ca: Désinstallez Visual Studio Code ``sudo dpkg -r code``. Alternativement, les extensions peuvent être `désinstallées <https://code.visualstudio.com/docs/editor/extension-gallery#_manage-extensions>`__
tr_tr: ``sudo dpkg -r code`` ile Visual Studio Code'u kaldırın. Alternatif olarak, uzantılar `buradan kaldırılabilir<https://code.visualstudio.com/docs/editor/extension-gallery#_manage-extensions>`__

source: Both of these reference the specific year as the WPIlib C++ tools will now support side-by-side installs of multiple environments from different seasons.
es_mx: Ambos hacen referencia al año específico en donde las herramientas de WPILib C++ ahora admitirán instalaciones en paralelo con múltiples entornos de diferentes temporadas.

source: Unzip and untar the file by looking at the file in the explorer and double-clicking on it, once or twice to unzip (remove the .gz extension) and again to untar it (remove the .tar extension). When finished it should like like the folder shown below.
es_mx: Descomprime y abre el archivo viéndolo en el explorador y haciendo doble clic en él, una o dos veces para descomprimir (Eliminar la extensión .gz) y otra vez para abrir (Eliminar la extensión .tar). Cuando haya terminado, debería gustarle la carpeta que se muestra a continuación.

source: Before using VS Code for WPILib development there are a number of extensions that need to be installed. Start up VS Code and type the shortcut Cmd-Shift-P to bring up the list of commands available. Start typing "Install from VSIX into the search box. Choose that command. In the file selection box select Cpp.vsix.
es_mx: Antes de usar el VS Code para el desarrollo WPILib, hay una serie de extensiones que se deben instalar. Comience con el VS Code y escriba el acceso directo Cmd-Shift-P para que aparezca la lista de comandos disponibles. Comience escribiendo “Install from VSIX…” dentro del cuadro de búsqueda. Elija el comando. En el cuadro de selección de tipo de archivo seleccione Cpp.vsix

source: Download the Linux .deb file from `code.visualstudio.com <https://code.visualstudio.com/>`__. For 2020, the recommended version is 1.41.1 which can be directly downloaded here: `https://update.code.visualstudio.com/1.41.1/linux-deb-x64/stable <https://update.code.visualstudio.com/1.41.1/linux-deb-x64/stable>`__
es_mx: Descargue el archivo .deb de Linux en `code.visualstudio.com <https://code.visualstudio.com/>`__. Para 2020, la versión recomendada es 1.41.1, el cual puede descargarse directamente aquí: `https://update.code.visualstudio.com/1.41.1/linux-deb-x64/stable <https://update.code.visualstudio.com/1.41.1/linux-deb-x64/stable>`__

source: Double-click on the .deb file in the file explorer
es_mx: Haga doble clic en el archivo .deb en el explorador de archivos
