Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/robot-characterization/additional-utils.po
Languages: es_mx

source: Additional Utilities and Tools
es_mx: Utilidades y herramientas adicionales

source: This page mainly covers useful information about additional functionality that this tool provides.
es_mx: Esta página abarca principalmente información útil sobre las funciones adicionales que ofrece esta herramienta.

source: There are a two JSON Utility tools that can be used in the :guilabel:`JSON Converters` tab: FRC-Char Converter and JSON to CSV Converter.
es_mx: En la pestaña :guilabel:`JSON Converters` hay dos herramientas de utilidad JSON que se pueden utilizar: FRC-Char Converter y JSON to CSV Converter.

source: Picture of the json converters
es_mx: Imagen de los Jason Converters

source: The FRC-Char Converter reads in an FRC-Char JSON and converts it into a SysId JSON that the tool can read.
es_mx: El convertidor de FRC-Char lee un JSON de FRC-Char y lo convierte en un JSON de SysId que la herramienta puede leer.

source: The JSON to CSV Converter takes a SysId JSON and outputs a CSV file. If the JSON had Drivetrain Mechanism data, the columns are: ``Timestamp (s)``, ``Test``, ``Left Volts (V)`` , ``Right Volts (V)``, ``Left Position ({0})``, ``Right Position ({units})``, ``Left Velocity ({units}/s)``, ``Right Velocity ({units}/s)``, ``Gyro Position (deg)``, ``Gyro Rate (deg/s)``. If the JSON had General Mechanism data, the CSV has the following columns: ``Timestamp (s)``, ``Test``, ``Volts (V)``, ``Position({units})``, ``Velocity ({units}/s)``.
es_mx: El convertidor de JSON a CSV toma un JSON de SysId y produce un archivo CSV. Si el JSON tenía datos del mecanismo de transmisión, las columnas son: ``Timestamp (s)``, ``Test``, ``Left Volts (V)`` , ``Right Volts (V)``, ``Left Position ({0})``, ``Right Position ({units})``, ``Left Velocity ({units}/s)``, ``Right Velocity ({units}/s)``, ``Gyro Position (deg)``, ``Gyro Rate (deg/s)``. Si el JSON tenía datos del Mecanismo General, el CSV tiene las siguientes columnas: ``Timestamp (s)``, ``Test``, ``Volts (V)``, ``Position({units})``, ``Velocity ({units}/s)``.

source: ImGui Tips
es_mx: Consejos para ImGui

source: The following are essentially handy features that come with the ImGui framework that SysId uses:
es_mx: Las siguientes son características esencialmente prácticas que vienen con el framework ImGui que utiliza SysId:

source: Showing and Hiding Plot Data
es_mx: Mostrar y ocultar datos de la parcela

source: To add or remove certain data from the plots, click on the color of the data that you would like to hide or remove.
es_mx: Para añadir o eliminar determinados datos de los gráficos, haga clic en el color de los datos que desea ocultar o eliminar.

source: For example, if we want to hide sim data, we can click the green color box.
es_mx: Por ejemplo, si queremos ocultar los datos de la sim, podemos hacer clic en la casilla de color verde.

source: Where one would need to click to hide sim data on an example plot
es_mx: Dónde habría que hacer clic para ocultar los datos de la sim en un gráfico de ejemplo

source: Picture of a plot after sim is hidden
es_mx: Imagen de una parcela después de ocultar la sim

source: If you zoom in to plots and want to revert back to the normally sized plots, just double click on the plot and it will automatically resize it.
es_mx: Si se amplían las parcelas y se quiere volver a las parcelas de tamaño normal, basta con hacer doble clic en la parcela y se redimensionará automáticamente.

source: Here is a plot that is zoomed in:
es_mx: Aquí hay un gráfico ampliado:

source: Picture of a plot that is zoomed in
es_mx: Imagen de un gráfico ampliado
