Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/robot-characterization/analyzing-data.po
Languages: fr_ca

source: Analyzing Data
fr_ca: Analyse des données

source: WPILib standarizes on SI units, so its recommended that the :guilabel:`Units` option is set to **Meters**.
fr_ca: WPILib standardise les unités pour n'utiliser désormais que les unités en SI, de sorte qu’il a recommandé que l’option :guilabel:`Units` est définie à **Meters**.

source: Once we have data from a characterization run, we can analyze it using the :guilabel:`Analyzer` and :guilabel:`Diagnostic Plots` widgets.
fr_ca: Une fois que nous avons des données d’une série de caractérisation, nous pouvons les analyser à l'aide des widgets :guilabel:`Analyzer` et :guilabel:`Diagnostic Plots`.

source: Using the data analyzer
fr_ca: Utilisation de l’analyseur de données

source: Loading your Data File
fr_ca: Chargement de votre fichier de données

source: Now it's time to load the data file we saved from the logger tool. Click on :guilabel:`Select`.
fr_ca: Maintenant, il est temps de charger le fichier de données que nous avons enregistré à partir de l’outil enregistreur de données. Cliquez sur :guilabel:`Select`.

source: Selecting the existing data file
fr_ca: Sélection du fichier de données existant

source: In the resulting file dialog, select the JSON file you want to analyze. If the file appears to be malformed, an error will be shown.
fr_ca: Dans la boîte de dialogue de fichier résultante, sélectionnez le fichier JSON à analyser. Si le fichier semble mal formé, une erreur s’affiche.

source: Running Feedforward Analysis
fr_ca: Exécution de l’analyse prédictive

source: Click the dropdown arrow on the :guilabel:`Feedforward` Section.
fr_ca: Cliquez sur la flèche déroulante dans la section :guilabel:`Feedforward`.

source: If you would like to change units, you will have to press the :guilabel:`Override Units` button and fill out the information on the popup.
fr_ca: Si vous souhaitez changer d’unité, vous devrez appuyer sur le bouton :guilabel:`Override Units` et remplir les informations dans la fenêtre contextuelle.

source: Analyzing data for feedforward
fr_ca: Analyse des données pour feedforward

source: By default, the analysis will be run by combining all the data in the test. For a finer-grained analysis, the analysis may be limited to a specific subset of data using the subset dropdown menu.
fr_ca: Par défaut, l’analyse sera effectuée en combinant toutes les données du test. Pour une analyse plus fine, l’analyse peut être limitée à un sous-ensemble spécifique de données à l’aide du menu déroulant sous-ensemble.

source: Limiting analysis data by using the subset dropdown
fr_ca: Limitation des données d’analyse à l’aide de la liste déroulante des sous-ensembles

source: The computed coefficients of the mechanism characterization will then be displayed.
fr_ca: Les coefficients calculés de la caractérisation du mécanisme seront alors affichés.

source: Analysis coefficient results
fr_ca: Résultats du coefficient d’analyse

source: There are also two accuracy metrics that are computed with this tool: r-squared and RMSE. The `r-squared <https://en.wikipedia.org/wiki/Coefficient_of_determination>`__ metric refers to the goodness of fit of the tool's `OLS (Ordinary Least Squares) fit <https://en.wikipedia.org/wiki/Ordinary_least_squares>`__. The `RMSE (Root Mean Squared Error) <https://en.wikipedia.org/wiki/Root-mean-square_deviation>`__ is the error (in the measured units) between the collected velocities and the predicted velocities from a simulation based on the feedforward gains.
fr_ca: Il existe également deux mesures de précision qui sont calculées avec cet outil : r-carré et RMSE. La métrique `r-carré <https://en.wikipedia.org/wiki/Coefficient_of_determination>`__ fait référence à la qualité de l’ajustement de l’outil `ajstement MCO (Moindre carré ordinaire) <https://en.wikipedia.org/wiki/Ordinary_least_squares>`__. l'erreur `RMSE (ou Erreur quadratique moyenne) <https://en.wikipedia.org/wiki/Root-mean-square_deviation>`__ est l’erreur (dans les unités mesurées) entre les vitesses mesurées et les vitesses prédites à partir d’une simulation basée sur les gains de la commande prédictive.

source: Analysis accuracy metrics
fr_ca: Mesures de la précision de l’analyse
