Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/robot-characterization/analyzing-feedback.po
Languages: fr_ca

source: Feedback Analysis
fr_ca: Analyse en boucle de rétroaction

source: These gains are, in effect, "educated guesses" - they are not guaranteed to be perfect, and should be viewed as a "starting point" for further tuning.
fr_ca: Ces gains sont, en effet, "des estimations éclairées": leur exactitude n'est pas garantie et ils devraient donc être considérés comme un "point de départ" nécessitant plus de réglage.

source: To view the feedback constants, click on the dropdown arrow on the :guilabel:`Feedback` section.
fr_ca: Pour afficher les constantes de feedback (rétroaction), cliquez sur la flèche déroulante de la section :guilabel:`Feedback`.

source: Feedback analysis pane
fr_ca: Volet Analyse de la rétroaction

source: This view can be used to calculate optimal feedback gains for a PD or P controller for your mechanism (via `LQR <https://en.wikipedia.org/wiki/Linear%E2%80%93quadratic_regulator>`__).
fr_ca: Cette vue peut être utilisée pour calculer les gains optimaux de rétroaction pour un contrôleur PD ou P pour votre mécanisme (via `LQR <https://en.wikipedia.org/wiki/Linear%E2%80%93quadratic_regulator>`__).

source: Enter Controller Parameters
fr_ca: Entrer les paramètres du contrôleur

source: The "Spark Max" preset assumes that the user has configured the controller to operate in the units of analysis with the SPARK MAX API's position/velocity scaling factor feature.
fr_ca: Le préréglage fourni avec le "Spark Max" suppose que l’utilisateur a configuré le contrôleur pour fonctionner dans les unités d’analyse avec la fonction de facteur de mise à l’échelle de position/vitesse de l’API SPARK MAX.

source: The calculated feedforward gains are *dimensioned quantities*. Unfortunately, not much attention is often paid to the units of PID gains in FRC\ |reg| controls, and so the various typical options for PID controller implementations differ in their unit conventions (which are often not made clear to the user).
fr_ca: Les gains de prédiction calculés sont des *quantités dimensionnées*. Malheureusement, on accorde souvent peu d’attention aux unités de gains PID en contrôles FRC\ |reg|, et donc les différentes options typiques pour les implémentations de contrôleur PID diffèrent dans leurs conventions d’unités (qui ne sont souvent pas clairement indiquées à l’utilisateur).

source: To specify the correct settings for your PID controller, use the following options.
fr_ca: Pour spécifier les bons réglages de votre contrôleur PID, utilisez les options suivantes.

source: Picture of the controller settings
fr_ca: Image des paramètres du contrôleur

source: :guilabel:`Gain Settings Preset` This drop-down menu will auto-populate the remaining fields with likely settings for one of a number of common FRC controller setups. Note that some settings, such as post-encoder gearing, PPR, and the presence of a follower motor must still be manually specified (as the analyzer has no way of knowing these without user input), and that others may vary from the given defaults depending on user setup.
fr_ca: :guilabel:`Gain Settings Preset` Ce menu déroulant remplira automatiquement les champs restants avec les paramètres probables pour l’une des nombreuses configurations courantes du contrôleur FRC. Notez que certains paramètres, tels que le rapport d’engrenage post-encodeur, le PPR et la présence d’un moteur suiveur doivent toujours être spécifiés manuellement (car l’analyseur n’a aucun moyen de les connaître sans intervention de l’utilisateur), et que d’autres peuvent varier en fonction de la configuration de l’utilisateur relativement aux valeurs par défaut données

source: :guilabel:`Controller Period` This is the execution period of the control loop, in seconds. The default RIO loop rate is 50Hz, corresponding to a period of 0.02s. The onboard controllers on most "smart controllers" run at 1Khz, or a period of 0.001s.
fr_ca: :guilabel:`Controller Period` Il s’agit de la période d’exécution de la boucle de contrôle, en secondes. La fréquence par défaut de la boucle du RIO est de 50 Hz, ce qui correspond à une période de 0,02 s. Les contrôleurs embarqués de la plupart des "contrôleurs intelligents" fonctionnent à 1 Khz, soit une période de 0,001 s.

source: :guilabel:`Max Controller Output` This is the maximum value of the controller output, with respect to the PID calculation. Most controllers calculate outputs with a maximum value of 1, but Talon controllers have a maximum output of 1023.
fr_ca: :guilabel:`Max Controller Output` Il s’agit de la valeur maximale de la sortie du contrôleur, par rapport aux calculs PID. La plupart des contrôleurs calculent les sorties avec une valeur maximale de 1, mais les contrôleurs de moteur Talon ont une sortie maximale de 1023.

source: :guilabel:`Time-Normalized Controller` This specifies whether the PID calculation is normalized to the period of execution, which affects the scaling of the D gain.
fr_ca: :guilabel:`Time-Normalized Controller` Ce paramètre spécifie si le calcul PID est normalisé à la période d’exécution, ce qui affecte la mise à l’échelle du gain D.

source: :guilabel:`Controller Type` This specifies whether the controller is an onboard RIO loop, or is running on a smart motor controller such as a Talon or a SPARK MAX.
fr_ca: :guilabel:`Controller Type` Ce paramètre spécifie si le contrôleur est une boucle intégrée au RIO ou s’il fonctionne sur un contrôleur de moteur intelligent tel qu’un Talon ou un SPARK MAX.

source: :guilabel:`Post-Encoder Gearing` This specifies the gearing between the encoder and the mechanism itself. This is necessary for control loops that do not allow user-specified unit scaling in their PID computations (e.g. those running on Talons). This will be disabled if not relevant.
fr_ca: :guilabel:`Post-Encoder Gearing` Ce paramètre spécifie le rapport d'engrenage entre l’encodeur et le mécanisme lui-même. Ceci est nécessaire pour les boucles de contrôle qui ne permettent pas la mise à l’échelle d’unité spécifiée par l’utilisateur dans leurs calculs PID (par exemple, ceux qui s’exécutent sur Talons). Ce paramètre sera désactivé s’il n’est pas pertinent.

source: :guilabel:`Encoder EPR` This specifies the edges-per-revolution (not cycles per revolution) of the encoder used, which is needed in the same cases as Post-Encoder Gearing.
fr_ca: :guilabel:`Encoder EPR` Ce paramètre spécifie le nombre de fronts par rotation (et non les cycles par rotation) de l’encodeur utilisé, ce qui est nécessaire dans les mêmes cas que le rapport d'engrenage post-encodeur.

source: :guilabel:`Has Follower` Whether there is a motor controller following the controller running the control loop, if the control loop is being run on a peripheral device. This changes the effective loop period.
fr_ca: :guilabel:`Has Follower` S’il y a un contrôleur de moteur qui suit le contrôleur exécutant la boucle de contrôle, si la boucle de contrôle est exécutée sur un périphérique. Ce paramètre modifie la période de boucle effective.

source: :guilabel:`Follower Update Period` The rate at which the follower (if present) is updated. By default, this is 100Hz (every 0.01s) for the Talon SRX, Talon FX, and the SPARK MAX, but can be changed.
fr_ca: :guilabel:`Follower Update Period` Ce paramètre est le taux auquel le moteur suiveur (s’il est présent) est mis à jour. Par défaut, il s’agit de 100 Hz (tous les 0,01 s) pour le Talon SRX, le Talon FX et le SPARK MAX, mais peut être modifié.

source: If you select a smart motor controller as the preset (e.g. TalonSRX, SPARK MAX, etc.) the :guilabel:`Convert Gains` checkbox will be automatically checked. This means the tool will convert your gains so that they can be used through the smart motor controller's PID methods. Therefore, if you would like to use WPILib's PID Loops, you must uncheck that box.
fr_ca: Si vous sélectionnez un contrôleur de moteur intelligent tel que prédéfini (p. ex. TalonSRX, SPARK MAX, etc.), la case :guilabel:`Convert Gains` sera automatiquement cochée. Cela signifie que l’outil convertira vos gains afin qu’ils puissent être utilisés par les méthodes PID du contrôleur de moteur intelligent. Par conséquent, si vous souhaitez utiliser les boucles PID de WPILib, vous devez décocher cette case.

source: Measurement Delays
fr_ca: Délais de mesure

source: If you are using default smart motor controller settings or WPILib PID Control without additional filtering, SysId handles this for you.
fr_ca: Si vous utilisez les paramètres par défaut d'un contrôleur de moteur intelligent ou la boucle de contrôl PID fournie par WPILib sans filtrage supplémentaire, SysId le gère pour vous.

source: Many "smart motor controllers" (such as the ``Talon SRX``, ``Venom``, ``Talon FX``, and ``SPARK MAX``) apply substantial :ref:`low-pass filtering <docs/software/advanced-controls/filters/introduction:Introduction to Filters>` to their encoder velocity measurements, which can introduce a significant amount of phase lag. This can cause the calculated gains for velocity loops to be unstable. This can be accounted for with the :guilabel:`Measurement Delay` box.
fr_ca: De nombreux "contrôleurs de moteur intelligents" (tels que le ``Talon SRX``, ``Venom``, ``Talon FX``, et ``SPARK MAX``) appliquent un filtrage passe-bas substantiel :ref:`low-pass filtering <docs/software/advanced-controls/filters/introduction:Introduction to Filters>` à leurs mesures de vitesse d’encodeur, ce qui peut introduire une quantité importante de décalage de phase. Ce qui peut entraîner l’instabilité des gains calculés pour les boucles de vitesse. Cela peut être pris en compte à l'aide de la case :guilabel:`Measurement Delay`

source: However, the measurement delays have already been calculated for the default settings of the previously mentioned motor controllers so for most users this is handled by selecting the right preset in :guilabel:`Gain Settings Preset`.
fr_ca: Cependant, les délais de mesure ont déjà été calculés pour les paramètres par défaut des contrôleurs de moteur mentionnés précédemment, donc pour la plupart des utilisateurs, cela est géré en sélectionnant le bon préréglage dans :guilabel:`Gain Settings Preset`.

source: The following only applies if the user decides to implement their own custom filtering settings (e.g. adding a moving average filter to a WPILib PID loop or changing smart motorcontroller measurement period and/or measurement window size) as the measurement delay must be recalculated. Here is the general formula that can be used for filters with moving windows (e.g. median filter + moving average filter):
fr_ca: Ce qui suit ne s’applique que si l’utilisateur décide d’implémenter ses propres paramètres de filtrage personnalisés (par exemple, l’ajout d’un filtre à moyenne mobile à une boucle PID WPILib ou la modification de la période de mesure du contrôleur d'un moteur intelligent et/ou de la taille de la fenêtre de mesure), car le délai de mesure doit être recalculé. Voici la formule générale qui peut être utilisée pour les filtres avec des fenêtres mobiles (par exemple, filtre médian + filtre de moyenne mobile):

source: Where ``T`` is the period at which measurements are sampled (RIO default is 20 ms) and ``n`` is the size of the moving window used.
fr_ca: Où ``T`` est la période à laquelle les mesures sont échantillonnées (pour le roboRIO cette période est de 20 ms par défaut) et ``n`` est la taille de la fenêtre mobile utilisée.

source: Specify Optimality Criteria
fr_ca: Spécifier les critères d’optimalité

source: Finally, the user must specify what will be considered an "optimal" controller. This takes the form of desired tolerances for the system error and control effort - note that it is *not* guaranteed that the system will obey these tolerances at all times.
fr_ca: Finalement, l’utilisateur doit préciser ce qui sera considéré comme un contrôleur "optimal". Ce qui se fait en spécifiant les tolérances souhaitées pour l’erreur du système et l’effort de contrôle - notez qu’il n’est *pas* garanti que le système obéira à ces tolérances en tout temps.

source: Entering optimality criteria for the feedback controller
fr_ca: Saisie de critères d’optimalité pour le contrôleur de rétroaction

source: As a rule, smaller values for the :guilabel:`Max Acceptable Error` and larger values for the :guilabel:`Max Acceptable Control Effort` will result in larger gains - this will result in larger control efforts, which can grant better setpoint-tracking but may cause more violent behavior and greater wear on components.
fr_ca: En règle générale, des valeurs plus petites pour le paramètre :guilabel:`Max Acceptable Error` et des valeurs plus grandes pour le paramètre :guilabel:`Max Acceptable Control Effort` se traduiront par des gains plus importants - cela se traduira par des efforts de contrôle plus importants, ce qui peut aider à avoir un meilleur suivi des points de consigne, mais peut causer un comportement plus violent et une plus grande usure sur les composants.

source: The :guilabel:`Max Acceptable Control Effort` should never exceed 12V, as that corresponds to full battery voltage, and ideally should be somewhat lower than this.
fr_ca: La valeur du paramètre :guilabel:`Max Acceptable Control Effort` ne doit jamais dépasser 12V, car cela correspond à la tension maximale de la batterie, et idéalement cette valeur devrait être un peu plus basse que la tension maximale.

source: Select Loop Type
fr_ca: Sélectionner le type de boucle

source: It is typical to control mechanisms with both position and velocity PIDs, depending on application. Either can be selected using the drop-down :guilabel:`Loop Type` menu.
fr_ca: Il est typique de contrôler les mécanismes avec des PID de position et de vitesse, selon l’application. L’un ou l’autre peut être sélectionné à l’aide du menu déroulant :guilabel:`Loop Type`.

source: Specifying characterization loop type
fr_ca: Spécification du type de boucle de caractérisation
