Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/robot-characterization/characterization-routine.po
Languages: es_mx

source: Running the Characterization Routine
es_mx: Corriendo la rutina de caracterización

source: Once the characterization code has been deployed, we can now run the characterization routine, and record the resulting data for analysis.
es_mx: Una vez que el código de caracterización ha sido desplegado, ahora podemos iniciar la caracterización de rutina, y grabar los datos resultantes para el análisis.

source: Ensure you have sufficient space around the robot before running any characterization routine! The drive characterization requires at least 10' of space, ideally closer to 20'. The robot drive can not be accurately characterized while on blocks.
es_mx: ¡Asegúrese de tener el suficiente espacio alrededor del robot antes de iniciar cualquier caracterización de rutina! La caracterización de la unidad necesita por lo menos 10 ft. de espacio, idealmente cerca de 20 ft. La unidad del robot no se podrá caracterizar con precisión mientras esté en bloques.

source: Connect to the Robot
es_mx: Conexión al robot

source: Running Tests
es_mx: Pruebas para correrlo

source: A standard motor characterization routine consists of two types of tests:
es_mx: Una caracterización estándar de rutina consiste en dos tipos de prueba:

source: **Quasistatic:** In this test, the mechanism is gradually sped-up such that the voltage corresponding to acceleration is negligible (hence, "as if static").
es_mx: **Quasistatic:** En esta prueba, el mecanismo acelerará gradualmente tal que el voltaje correspondiente a la aceleración es despreciado (por lo tanto, “como si fuera estático”).

source: **Dynamic:** In this test, a constant 'step voltage' is given to the mechanism, so that the behavior while accelerating can be determined.
es_mx: **Dinámico:** En esta prueba, una constante de 'voltaje de paso' es brindada al mecanismo, de manera que se pueda comprobar el comportamiento mientras se acelera.

source: Each test type is run both forwards and backwards, for four tests in total, corresponding to the four buttons.
es_mx: Cada tipo de prueba se ejecuta tanto como adelante como hacía atrás, para cuatro pruebas en total, correspondientes a los 4 botones.

source: The tests can be run in any order, but running a "backwards" test directly after a "forwards" test is generally advisable (as it will more or less reset the mechanism to its original position).
es_mx: La pruebas pueden ser ejecutadas en cualquier orden, pero ejecutando una prueba “hacia atrás” directamente después de una prueba “hacia adelante” es generalmente aconsejable (ya que restablecerá más o menos el mecanismo a su posición original).

source: Follow the instructions in the pop-up windows after pressing each test button.
es_mx: Siga las instrucciones en la ventana pop-up de Windows después de presionar cada botón de prueba.

source: The entire routine should look something like this:
es_mx: La rutina entera deberá verse algo así:
