Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/robot-characterization/generating-project.po
Languages: fr_ca, zh_cn

source: Generating a Project
fr_ca: Génération d'un projet
zh_cn: 生成一个项目

source: To use the toolsuite, we first need to generate a robot project.
fr_ca: Pour utiliser la suite logicielle, nous avons d’abord besoin de générer un projet de robot.
zh_cn: 要使用工具套件，我们首先需要生成一个机器人项目。

source: Select Project Location
fr_ca: Sélectionner l’emplacement du projet
zh_cn: 然后选择项目位置

source: First, select the desired project location on the new project GUI:
fr_ca: Premièrement, sélectionner l’emplacement du projet souhaité dans la nouvelle interface graphique du projet :
zh_cn: 首先，在“新项目”界面上选择你想要的的项目位置：

source: Selecting the project location in the robot characterization GUI
zh_cn: 在机器人表征GUI中选择项目位置

source: The project type dropdown now chooses between the different types of characterization tests as the previous motor setups have been integrated into the :guilabel:`Control Type` field.
fr_ca: Le menu déroulant pour le type de projet choisit désormais entre les différents types de tests de caractérisation car les configurations de moteur précédentes ont été intégrées dans le champ :guilabel:`Control Type`.
zh_cn: 由于先前的电动机设置已集成到“控制类型”字段中，因此项目类型下拉列表现在可以在不同类型的特性测试之间进行选择。

source: Configure Project Parameters
fr_ca: Configurer les paramètres du projet
zh_cn: 配置项目参数

source: In order to run on your robot, the tool must know some parameters about how your robot is set up.
fr_ca: Afin de fonctionner sur votre robot, l’outil doit connaître certains paramètres donnant des indications sur la façon dont votre robot est configuré.
zh_cn: 为了在机器人上运行，该工具必须知道一些有关如何设置机器人的参数。

source: First, you need to use the :guilabel:`Control Type` field to select the appropriate project config template. ``Simple`` is for PWM Based motor controllers, ``CTRE`` is for CAN connected CTRE Motor Controllers (e.g. Talon SRX), and ``SparkMax`` is for the Spark Max Motor Controller. This allows you to fill out the parameters specific to the type of controllers you are using.
fr_ca: Pour commencer, vous devez utiliser le champ :guilabel:`Control Type` pour sélectionner le modèle approprié de configuration de projet. ``Simple`` correspond à des contrôleurs de moteurs de type PWM, `CTRE`` correspond aux contrôleurs de moteurs CTRE (par exemple Talon SRX) connectés au réseau CAN, et ``SparkMax`` correspond au contrôleur de moteur Spark Max. Cela vous permet de remplir les paramètres spécifiques au type de contrôleurs que vous utilisez.
zh_cn: 首先，您需要使用“控件类型”字段来选择适当的项目配置模板。 ``Simple''用于基于PWM的电机控制器，``CTRE''用于CAN连接的CTRE电机控制器（例如Talon SRX），``SparkMax''用于Spark Max电机控制器。这使您可以填写特定于所使用控制器类型的参数。

source: Selecting the appropriate control type.
zh_cn: 选择适当的控件类型。

source: Project config settings are formatted as a `Python dictionary literal <https://docs.python.org/3/library/stdtypes.html#mapping-types-dict>`__. These can be modified via the in-window config editor:
fr_ca: Les paramètres de configuration de projet sont formatés comme un `dictionnaire Python littéral <https://docs.python.org/3/library/stdtypes.html#mapping-types-dict>`__. Ceux-ci peuvent être modifiés via la fenêtre intégrée dans l’éditeur de configuration:
zh_cn: 项目配置设置的格式为Python字典文字<https://docs.python.org/3/library/stdtypes.html#mapping-types-dict>`__。这些可以通过窗口内配置编辑器进行修改：

source: Using the robot characterization configuration editor
zh_cn: 使用机器人特性配置编辑器

source: Take care of the following caveats when entering your robot specifications:
fr_ca: Prenez soin des mises en garde suivantes lorsque vous entrez les spécifications de votre robot :
zh_cn: 输入机器人规格的时候，请注意以下注意事项：

source: The key names must *not be changed*, as they are hard-coded for each project type. Only the values (i.e. the things on the right-hand side of the colons) should be modified.
fr_ca: Les noms des clés ne doivent *pas être modifiés*, car ils sont figés dans le code pour chaque type de projet. Seules les valeurs (situées sur le côté droit des deux points) doivent être modifiées.
zh_cn: 键名*必不能*被更改，因为它们是每种项目类型的硬编码。只有数据值可以被修改（即冒号右侧的内容）。

source: ``True`` and ``False`` *must* be capitalized, as they are evaluated as native Python.
fr_ca: ``True`` et ``False`` *doivent* être en majuscules, car ils sont évalués comme Python natif.
zh_cn: True 和 False *必须*大写，因为它们被视为本机的Python。

source: All string values (e.g. controller names and unit types) *must* be wrapped in quotes and *must* correspond exactly to one of the options described.
fr_ca: Toutes les valeurs de chaîne de caractères (p. ex. noms de contrôleur et types d’unités) *doivent* être enveloppées dans des guillemets et *doivent* correspondre exactement à l’une des options décrites.
zh_cn: 所有字符串值（例如控制器名称和单位类型）必须用引号引起来，并且必须完全对应于所描述的选项之一。

source: Read the comments provided in the config file carefully.
fr_ca: Lisez attentivement les commentaires fournis dans le fichier de configuration.
zh_cn: 仔细阅读配置文件中提供的注释。

source: Once your robot configuration is set, you may save it to a location/name of your choice:
fr_ca: Une fois la configuration de votre robot définie, vous pouvez l’enregistrer à un emplacement/nom de votre choix :
zh_cn: 设置机器人配置后，您可以将其保存到您选择的位置/名称：

source: Saving the configuration file
zh_cn: 保存配置文件

source: Accordingly, you can also load an existing config file (config files are project-type-specific):
fr_ca: Par conséquent, vous pouvez également charger un fichier config existant (les fichiers de configuration sont spécifiques au type de projet) :
zh_cn: 因此，您还可以加载现有的配置文件(配置文件是特定于项目类型的)：

source: Loading a saved configuration file
zh_cn: 加载已保存的配置文件

source: Setting Units
fr_ca: Configuration des unités
zh_cn: 设定单位

source: Now is also a good time to set the Team Number box and modify the units and units per rotation if necessary (units per rotation is NOT equivalent to the wheel diameter from last year's tool).
fr_ca: À présent, c’est également le bon moment pour configurer la case Team Number et modifier les unités et les unités par rotation si nécessaire (les unités par rotation ne sont pas l'équivalent du diamètre de la roue de l’outilitaire de l’année dernière).
zh_cn: 现在也是设置“团队编号”框和在需要时修改每转单位和单位的好时机（每转单位不等于去年工具的轮径）。

source: The :guilabel:`Unit Type` field lets you choose between various rotational and translational units (rotations, radians, degrees, feet, meters, and inches). You should choose a unit that facilitates a rough validation of the recorded measurements. For example, you could choose rotations when testing a flywheel to see if the tool's recorded rotations seem reasonable, or you could choose feet when testing a drive base to see if the recorded distance seems reasonable.
fr_ca: Le champ :guilabel:`Unit Type` vous permet de choisir entre différentes unités de rotation et translation (rotations, radians, degrés, pieds, mètres et pouces). Vous devez choisir une unité qui facilite une validation approximative des mesures enregistrées. Par exemple, vous pouvez choisir des rotations lors de l’essai d’un volant d'inertie pour voir si les rotations enregistrées par l’outil de caractérisation semblent raisonnables, ou vous pouvez choisir des pieds lors de l’essai d’une base d’entraînement pour voir si la distance enregistrée semble raisonnable.
zh_cn: 单位类型字段可让您在各种旋转和平移单位（旋转，弧度，度，英尺，米和英寸）之间进行选择。您应该选择一个有助于粗略验证所记录测量值的单位。例如，您可以在测试飞轮时选择旋转，以查看工具记录的旋转是否合理，或者在测试驱动器基座时可以选择支脚，以查看记录的距离是否合理。

source: Setting the units of the data collection
zh_cn: 设置数据采集的单位

source: On the other hand, the :guilabel:`Units per Rotation` entry is how many of the previously specified units are recorded per rotation of the shaft. Do note that rotational units (rotations, radians, and degrees) have predefined/unmutable units per rotations. In contrast, translational units (meters, feet, inches) require that you specify the conversion, such as a wheel with a 3-inch diameter can be converted to 9.42 inches per rotation (:math:`\pi * 3`).
fr_ca: D’autre part, l’entrée :guilabel:`Units per Rotation` est le nombre d’unités précédemment spécifiées enregistrées par rotation de l’arbre. Notez que les unités de rotation (rotations, radians et degrés) ont des unités prédéfinis/immuables par rotation. En revanche, les unités correspondant à des mouvement de translation (mètres, pieds, pouces) exigent que vous spécifiez la conversion, comme par exemple, une roue d’un diamètre de 3 pouces peut être convertie en 9,42 pouces par rotation (:math:`\pi * 3`).
zh_cn: 另一方面，“每转单位”条目是每转轴记录多少个先前指定的单位。值得注意的是，旋转单位（旋转，弧度和度）每旋转一圈具有预定单位/不变的单位。相反，平移单位（米，英尺，英寸）需要您指定转换方式，例如，直径为3英寸的车轮每转可以转换为9.42英寸（：math：`\ pi * 3`）。

source: Settings the units per rotation of the data collection
zh_cn: 设置每次数据采集旋转的单位

source: Generate Project
fr_ca: Générer un projet
zh_cn: 生成项目

source: Once your project has been configured, it's time to generate a deployable robot project to run the characterization:
fr_ca: Une fois que votre projet a été configuré, il est temps de générer un projet de robot déployable en vue de lancer la caractérisation :
zh_cn: 一当配置完项目后，就需要生成一个可部署的机器人项目来运行表征了：

source: Generating the robot project button
zh_cn: 生成机器人项目按钮

source: A generated robot project will be placed in a subfolder (named characterization-project) of your specified project location.
fr_ca: Le projet généré de robot sera placé dans un sous-dossier (nommé *characterization-project*) de l’emplacement spécifié de votre projet .
zh_cn: 生成的机器人项目将放置在您指定项目位置的子文件夹(名为 characterization-project )中。

source: The generated robot code will be in Java, and will reflect the settings specified in your config file. Advanced users are free to modify the generated code to their liking, if the existing configuration options do not suffice.
fr_ca: Le code robot généré sera en Java et reflétera les paramètres spécifiés dans votre fichier config. Les utilisateurs chevronnés sont libres de modifier le code généré à leur goût, si les options de configuration existantes ne suffisent pas.
zh_cn: 生成的机器人代码将使用 Java，并将反映您的配置文件中指定的设置。如果现有的配置选项不足，高级用户可以随意修改生成的代码。
