Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/robot-characterization/introduction.po
Languages: fr_ca

source: Introduction to Robot Characterization
fr_ca: Introduction à la caractérisation des robots

source: The characterization tools consist of an application that runs on the user's PC and matching robot code that runs on the user's robot. The PC application will send control signals to the robot over NetworkTables, while the robot sends data back to the application. The application then processes the data and determines characterization parameters for the user's robot mechanism, as well as producing diagnostic plots. Data can be saved (in JSON format) for future use, if desired.
fr_ca: L'utilitaire de caractérisation consiste en une application qui s’exécute sur le PC de l’utilisateur et correspondant au code robot qui s’exécute dans le robot de l’utilisateur. L’application PC enverra des signaux de contrôle au robot via des NetworkTables, tandis que le robot renvoie des données à l’application. L’application traite ensuite les données et détermine les paramètres de caractérisation du mécanisme du robot à caractériser, ainsi que la production de courbe de diagnostiques. Les données peuvent être enregistrées (au format JSON) pour une utilisation future, au besoin.

source: What is "Characterization?"
fr_ca: En quoi consiste la caractérisation?

source: "Characterization" - or, more formally, `system identification <https://en.wikipedia.org/wiki/System_identification>`__ - is the process of determining a mathematical model for the behavior of a system through statistical analysis of its inputs and outputs.
fr_ca: "La caractérisation" - ou, de façon plus formelle, `l'identification de système <https://fr.wikipedia.org/wiki/Identification_de_syst%C3%A8me>`__ -est le processus de détermination d’un modèle mathématique pour le comportement d’un système par l’analyse statistique de ses entrées et sorties.

source: In FRC, the most common system that we're interested in characterizing is the `permanent-magnet DC motor <https://en.wikipedia.org/wiki/Brushed_DC_electric_motor#Permanent-magnet_motors>`__. In particular, we're interested in figuring out which motor *input* (i.e. voltage from the motor controller) is required to achieve our desired *outputs* (i.e. velocity and acceleration of the motor).
fr_ca: En FRC, le système le plus commun que nous sommes intéressés à caractériser est le `moteur DC à aimant permanent <https://en.wikipedia.org/wiki/Brushed_DC_electric_motor#Permanent-magnet_motors>`__. En particulier, nous sommes intéressés à déterminer quelle *entrée* du moteur (c.-à-d. tension du contrôleur de moteur) est nécessaire pour produire nos *sorties* souhaitées (c.-à-d. vitesse et accélération du moteur).

source: Fortunately, it is not so difficult to do this. A permanent-magnet DC motor (with no load other than friction and inertia) will obey the following "voltage-balance equation" (for more information, see `this paper <https://www.chiefdelphi.com/uploads/default/original/3X/f/7/f79d24101e6f1487e76099774e4ba60683e86cda.pdf>`__):
fr_ca: Heureusement, il n’est pas si difficile de le faire. Un moteur DC à aimant permanent (sans charge autre que la friction et l’inertie) obéira à l’équation "tension-équilibrée" suivante (pour plus d’informations, voir `cet article <https://www.chiefdelphi.com/uploads/default/original/3X/f/7/f79d24101e6f1487e76099774e4ba60683e86cda.pdf>`__):

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the motor, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration (the "overdot" notation traditionally denotes the `derivative <https://en.wikipedia.org/wiki/Derivative>`__ with respect to time).
fr_ca: où :math:`V` est la tension appliquée, :math:`d` est le déplacement (position) du moteur, :math:`\dot{d}` est la vitesse, et :math:`\ddot{d}` est son accélération (dans cette notation le "point" représente traditionnellement la `dérivée <https://en.wikipedia.org/wiki/Derivative>`__ par rapport au temps).

source: Heuristically, we can interpret the coefficients in the above equation as follows:
fr_ca: Heuristiquement, nous pouvons interpréter les coefficients dans l'équation ci-dessus comme suit:

source: ``kS`` is the voltage needed to overcome the motor's static friction, or in other words to just barely get it moving; it turns out that this static friction (because it’s, well, static) has the same effect regardless of velocity or acceleration. That is, no matter what speed you’re going or how fast you're accelerating, some constant portion of the voltage you've applied to your motor (depending on the specific mechanism assembly) will be going towards overcoming the static friction in your gears, bearings, etc; this value is your kS. Note the presence of the `signum function <https://en.wikipedia.org/wiki/Sign_function>`__, because friction force always opposes the direction-of-motion.
fr_ca: ``kS`` est la tension nécessaire pour surmonter la friction statique du moteur, ou en d’autres termes pour à peine le faire bouger; il s’avère que cette friction statique (parce qu’elle est, bel et bien, statique) a le même effet indépendamment de la vitesse ou de l’accélération. Autrement dit, quelle que soit votre vitesse de fonctionnement ou avec quelle rapidité vous accélérez, une partie constante de la tension que vous avez appliquée à votre moteur (selon l’assemblage du mécanisme spécifique à caractériser) servira à surmonter la friction statique dans vos engrenages, roulements, etc; cette valeur est votre kS. Notez la présence de la `fonction signe <https://fr.wikipedia.org/wiki/Fonction_signe>`__, parce que la force de friction s’oppose toujours à la direction de mouvement.

source: ``kV`` describes how much voltage is needed to hold (or "cruise") at a given constant velocity while overcoming the `electromagnetic resistance in the motor <https://en.wikipedia.org/wiki/Counter-electromotive_force>`__ and any additional friction that increases with speed (known as `viscous drag <https://en.wikipedia.org/wiki/Drag_(physics)#Very_low_Reynolds_numbers:_Stokes'_drag>`__). The relationship between speed and voltage (at constant acceleration) is almost entirely linear (with FRC\ |reg| components, anyway) because of how permanent-magnet DC motors work.
fr_ca: ``kV`` décrit la quantité de tension nécessaire pour se maintenir (ou "croisière") à une vitesse constante donnée tout en surmontant la `résistance électromagnétique dans le moteur <https://en.wikipedia.org/wiki/Counter-electromotive_force>`__ et toute friction supplémentaire qui augmente avec la vitesse (connu sous le nom de `traînée visqueuse <https://en.wikipedia.org/wiki/Drag_(physics)#Very_low_Reynolds_numbers:_Stokes'_drag>`__). La relation entre la vitesse et la tension (à une accélération constante) est presque entièrement linéaire (avec les composants FRC\ |reg|, de toute façon) en raison de la manière dont fonctionnent les moteurs DC à aimant permanent.

source: ``kA`` describes the voltage needed to induce a given acceleration in the motor shaft. As with ``kV``, the relationship between voltage and acceleration (at constant velocity) is almost perfectly linear for FRC components.
fr_ca: ``kA`` décrit la tension nécessaire pour induire une accélération donnée dans l’arbre moteur. Comme pour ``kV``, la relation entre la tension et l'accélération (à vitesse constante) est quasiment parfaitement linéaire pour les composants FRC.

source: Once these coefficients have been determined (here accomplished by a `multiple linear regression <https://en.wikipedia.org/wiki/Linear_regression>`__), we can then take a given desired velocity and acceleration for the motor and calculate the voltage that should be applied to achieve it. This is very useful - not only for, say, following motion profiles, but also for making mechanisms more controllable in open-loop control, because your joystick inputs will more closely match the actual mechanism motion.
fr_ca: Une fois que ces coefficients ont été déterminés (accompli in par une `régression linéaire multiple <https://en.wikipedia.org/wiki/Linear_regression>`__), nous pouvons alors prendre une vitesse et une accélération souhaitées pour le moteur et calculer la tension qui doit être appliquée pour les produire. Ceci est très utile - non seulement pour, disons, suivre les profils de mouvement, mais aussi pour rendre les mécanismes plus contrôlables dans le contrôle en boucle ouverte, parce que vos entrées joystick correspondront plus étroitement au mouvement du mécanisme réel.

source: Some of the tools in this toolsuite introduce additional terms into the above equation to account for known differences from the simple case described above - details for each tool can be found below:
fr_ca: Certains des outils de cette suite logicielle introduisent des termes supplémentaires dans l’équation ci-dessus pour tenir compte des différences connues par rapport au cas simple décrit ci-dessus - les détails pour chaque outil peuvent être trouvés ci-dessous:

source: Included Characterization Tools
fr_ca: Outils de caractérisation inclus

source: Many other types of mechanisms can be characterized by simply adapting the existing code in this library.
fr_ca: De nombreux autres types de mécanismes peuvent être caractérisés par l’adaptation du code existant dans cette logithèque.

source: The robot characterization toolsuite currently supports characterization for:
fr_ca: La suite logicielle de caractérisation de robot prend actuellement en charge la caractérisation pour:

source: Simple Motor Setups
fr_ca: Configurations de simples moteurs

source: Drivetrains
fr_ca: Bases pilotables

source: Arms
fr_ca: Bras

source: Elevators
fr_ca: Élevateurs

source: Simple Motor Characterization
fr_ca: Caractérisation d'un simple moteur

source: The simple motor characterization tool determines the best-fit parameters for the equation:
fr_ca: L’outil de caractérisation d'un simple moteur détermine les paramètres les mieux adaptés à l’équation :

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the drive, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration. This is the model for a permanent-magnet dc motor with no loading other than friction and inertia, as mentioned above, and is an accurate model for flywheels, turrets, and horizontal linear sliders.
fr_ca: où::math:`V` est la tension appliquée,: :math:`d` est le déplacement (position) du variateur, :math:`\dot{d}` est sa vitesse, et :math:`\ddot{d}` est son accélération. Il s'agit du modèle pour un moteur à courant continu à aimant permanent sans charge autre que le frottement et l'inertie, comme mentionné ci-dessus, et ceci est un modèle précis pour les volants d'inertie, les tourelles et les curseurs linéaires horizontaux.

source: Drivetrain Characterization
fr_ca: Caractérisation de la base pilotable

source: The drivetrain characterization tool determines the best-fit parameters for the equation:
fr_ca: L’outil de caractérisation de la base pilotable détermine les paramètres les mieux adaptés à l’équation :

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the drive, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration. This is the same modeling equation as is used in the simple motor characterization - however, the drivetrain characterizer is specifically set up to run on differential drives, and will characterize each side of the drive independently if desired.
fr_ca: où :math:`V` est la tension appliquée, :math:`d` est le déplacement (position) de l'entraînement, :math:`\dot{d}` est sa vitesse, et :math:`\ddot{d}` est son accélération. Il s’agit de la même équation de modélisation que celle utilisée dans la caractérisation du moteur simple - cependant, l'outil de caractérisation de la base pilotable est conçu spécifiquement pour fonctionner sur les entraînements différentiels, et caractérisera indépendamment chaque côté de l'entraînement au besoin.

source: The drivetrain characterizer can also determine the effective trackwidth of your robot using a gyro. More information on how to run the characterization is available in the :ref:`track width characterization <docs/software/pathplanning/robot-characterization/characterization-routine:Running Tests>` article.
fr_ca: Le dispositif de caractérisation de la transmission peut également déterminer la largeur de voie effective de votre robot à l'aide d'un gyroscope. Plus d'informations sur la façon d'exécuter la caractérisation sont disponibles dans l'article :ref:`track width characterization <docs/software/pathplanning/robot-characterization/characterization-routine:Running Tests>`.

source: Arm Characterization
fr_ca: Caractérisation du bras

source: The arm characterization tool determines the best-fit parameters for the equation:
fr_ca: L’outil de caractérisation du bras détermine les paramètres les mieux adaptés à l’équation :

source: where :math:`V` is the applied voltage, :math:`\theta` is the angular displacement (position) of the arm, :math:`\dot{\theta}` is its angular velocity, and :math:`\ddot{\theta}` is its angular acceleration. The cosine term (:math:`kCos`) is added to correctly account for the effect of gravity.
fr_ca: où :math:`V` est la tension appliquée, :math:`\theta` est le déplacement angulaire (position) du bras, :math:`\dot{\theta}` est la vitesse angulaire, et :math:`\ddot{\theta}` est son accélération angulaire. Le terme en cosinus (:math:`kCos`) est ajouté pour parfaitement tenir compte de l'effet de la gravité.

source: Elevator Characterization
fr_ca: Caractérisation de l'élevateur

source: The elevator characterization tool determines the best-fit parameters for the equation:
fr_ca: L’outil de caractérisation de l'élevateur détermine les paramètres les mieux adaptés à l’équation :

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the drive, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration. The constant term (:math:`kG`) is added to correctly account for the effect of gravity.
fr_ca: où :math:`V` est la tension appliquée, :math:`d` est le déplacement (position) de l'entraînement, :math:`\dot{d}` est sa vitesse, et :math:`\ddot{d}` est son accélération. Le terme constant (:math:`kG`) est ajouté pour parfaitement tenir compte de l’effet de la gravité.

source: Installing the System Identification Tool
fr_ca: Installation de l’outil d’identification du système

source: The system identification tool (also referred to as ``sysid``) is included with the WPILib Installer.
fr_ca: L’outil d’identification du système (également appelé ``sysid``) est inclus avec le programme d’installation de la WPILib.

source: The old Python characterization tool from previous years is no longer supported.
fr_ca: L’ancien outil de caractérisation à base de Python des années précédentes n’est plus pris en charge.

source: Launching the System Identification Tool
fr_ca: Lancement de l’outil d’identification du système
