Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/pathplanning/robot-characterization/viewing-diagnostics.po
Languages: es_mx, fr_ca, zh_cn

source: Viewing Diagnostics
es_mx: Observación de diagnósticos
fr_ca: Affichage des diagnostics
zh_cn: 查看诊断

source: The first diagnostic to look at is the r-squared - it should be somewhere north of ~.9. If it is significantly lower than this, there is likely a problem with your characterization data.
es_mx: El primer diagnóstico para ver es el r-cuadrada - debería estar por encima de ~.9. Si se encuentra significativamente más bajo que esto, hay un problema con su caracterización de datos.
fr_ca: Le premier diagnostic à regarder est le r-carré - il devrait être quelque part au-dessus de ~.9. Si elle est inférieure à cette valeur de manière significative, il y a probablement un problème avec vos données de caractérisation.
zh_cn: 首先要看的诊断是r²：它应该在〜.9以北的某个地方。如果它远低于此值，则特征数据可能存在问题。

source: To investigate further, you can generate a number of diagnostic plots with the buttons on the left-hand side:
zh_cn: 要进一步调查，您可以使用左侧的按钮生成许多诊断图：

source: Picture of the diagnostic plot buttons
zh_cn: 诊断图按钮的图片

source: Time-Domain Diagnostics
es_mx: Diagnósticos de dominio de tiempo
fr_ca: Diagnostics dans le domaine temporel
zh_cn: 时域诊断

source: The Time-Domain Diagnostics plots display velocity and acceleration versus time over the course of the analyzed tests. For a typical drive characterization, these should look something like this (other mechanisms will be highly similar):
zh_cn: “时域诊断”图显示了经过分析的测试过程中速度和加速度与时间的关系。对于典型的驱动器表征，这些应该看起来像这样（其他机制将非常相似）：

source: Picture of the time domain plots
zh_cn: 时域图的图片

source: The vertical "mirroring" visible here is normal, and is simply the result of the left- and right-side encoders having different signs - this does not cause any trouble for the characterization tool.
zh_cn: 此处可见的垂直“镜像”是正常现象，并且仅仅是具有不同符号的左侧和右侧编码器的结果-这不会对特征化工具造成任何麻烦。

source: The quasistatic test ought to have nearly linear velocity, and nearly-zero acceleration (hense "quasistatic"). The dynamic test ought to have velocity that asymptotically approaches a steady-state speed (the shape of the curve should be exponential, in fact), and acceleration that, accordingly, rapidly falls to zero (also exponentially, as the derivative of an exponential function is also an exponential function).
es_mx: La prueba cuasiestática debería tener una velocidad lineal necesaria, y cercana a la aceleración cercana al cero (por lo tanto cuasiestática). La prueba dinámica debería tener velocidad que asintóticamente se acerca a una velocidad de estado estacionario (la forma de la curva deberá ser exponencial, de hecho), y la aceleración que en consecuencia cae a cero (además exponencial, como la derivada de una función exponencial también es una función exponencial).
fr_ca: Le test quasistatique devrait avoir une vitesse presque linéaire et une accélération presque nulle (de ce fait "quasistatic »). Le test dynamique devrait avoir une vitesse qui approche asymptotiquement une vitesse en régime permanent (la forme de la courbe devrait être exponentielle, en fait), et l’accélération qui, par conséquent, tombe rapidement à zéro (également exponentiellement, comme la dérivée d’une fonction exponentielle est également une fonction exponentielle).
zh_cn: 准静态测试应具有接近线性的速度和接近零的加速度（即“准静态”）。这个动态测试应该具有渐近接近稳态速度的速度（实际上，曲线的形状应该是指数形式的），并且加速度，相应地，迅速下降到零（也是指数函数，因为指数函数的导数仍为指数函数）。

source: Deviation from this behavior is a sign of an :ref:`error <docs/software/pathplanning/robot-characterization/viewing-diagnostics:Common Failure Modes>`, either in your robot setup, analysis settings, or your test procedure.
fr_ca: Un écart par rapport à ce comportement est le signe d'une :ref:`erreur <docs/software/pathplanning/robot-characterization/viewing-diagnostics:Common Failure Modes>`, que ce soit dans la configuration de votre robot, les paramètres d'analyse ou votre procédure de test.
zh_cn: 偏离此行为是机器人设置、分析设置或测试程序中出现错误 <docs/software/pathplanning/robot-characteristic/viewing-diagnostics:Common Failure Modes>` 的标志。

source: Voltage-Domain Diagnostics
es_mx: Diagnósticos de dominio de voltaje
fr_ca: Diagnostics dans le domaine du voltage
zh_cn: 电压域诊断

source: The :guilabel:`Voltage-Domain` Diagnostics button plots velocity and acceleration versus voltage. Velocity is ploted for the quasistatic test, and acceleration is plotted for the dynamic test. For a typical drive characterization, the plots should resemble this (again, other mechanisms will be similar)
zh_cn: :guilabel:`Voltage-Domain` 诊断按钮绘制速度和加速度与电压的关系图。准静态测试绘制速度，动态测试绘制加速度。对于典型的驱动器特性，图应该与此类似（同样，其他机制将类似）

source: Voltage domain plots picture
fr_ca: Image des tracés dans le domaine de tension
zh_cn: 电压域图

source: Both plots should be linear, however the dynamic plot will almost certainly have substantially-more noise. The noise on the dynamic plot may be reduced by increasing the ``Accel Window Size`` setting.
zh_cn: 两个图都应该是线性的，但是动态图一般会具有更多的噪声。动态图上的噪声可以通过增加设置中的``加速窗口大小''参数来减少。

source: Picture of the accel window size selector
zh_cn: 加速窗口大小选择器的图片

source: However, if your robot or mechanism has low mass compared to the motor power, this may "eat" what little meaningful acceleration data you have (however, in these cases ``kA`` will tend towards zero and can usually be ignored, anyway).
es_mx: De cualquier modo, si su robot o mecanismo tiene una menor masa comparada con el poder del motor, esto podría "comerse" los pocos datos significativos de aceleración que tenga (de cualquier modo, en este caso ´kA´ tenderá hacia cero y puede ser ignorado, de todas formas).
fr_ca: Toutefois, si votre robot ou mécanisme a une faible masse par rapport à la puissance du moteur, cela peut "manger" le peu de données d’accélération significatives que vous avez (cependant, dans ces cas ``kA`` tendra vers zéro et peut généralement être ignoré, de toute façon).
zh_cn: 但是，如果您的机器人或机械装置与电机功率相比，质量相对较小，这可能"吃掉"您本拥有的几乎没有意义的加速度数据（然而，在这些情况下，"kA"将趋于零，而且通常可以忽略， 所以并不会产生大的影响）。

source: The x-axis corresponds to ``velocity-portion voltage`` and ``acceleration-portion voltage``, respectively - as the governing voltage-balance equations are multi-dimensional, plots against raw voltage are not as useful as one might expect.
es_mx: El x-asis corresponde al voltaje de la porción de velocidad y la porción de aceleración voltaje, respectivamente - como las ecuaciones de equilibrio de voltaje que rigen son multidimensionales, los gráficos contra el voltaje bruto no son tan útiles como se esperaría.
fr_ca: L’axe x correspond à la ``portion vitesse du voltage`` et à la ``portion accélération du voltage``, respectivement - comme les équations régissant l'équilibre des tensions sont multidimensionnelles, les graphiques obtenues en fonction de la tension brute ne sont pas aussi utiles qu’on pourrait s’y attendre.
zh_cn: x轴分别对应于``速度部分电压''和``加速度部分电压''：由于控制电压平衡方程是多维的，因此相对于原始电压的绘图并不像人们期望的那样有用。

source: 3D Diagnostics
zh_cn: 3D诊断

source: The :guilabel:`3D Diagnostics` button will generate a 3d plot of voltage over the entire velocity-acceleration plane (this may be an adjusted voltage to remove the nonlinearity in mechanisms with nonlinear equations, such as arms).
zh_cn: :guilabel:`3D Diagnostics` 按钮将在整个速度-加速度平面上生成一个 3d 电压图（这可能是一个经过调整的电压，以消除具有非线性方程的机制中的非线性，例如手臂）。

source: Picture of the 3D diagnostic plot
zh_cn: 3D 诊断图的图片

source: This plot is interactive, and may be rotated by clicking-and-dragging. The quasistatic and dynamic tests should both be clearly visible as streaks of data, and the best fit-plane should pass through all the data points. The data from both the quasistatic and dynamic tests should appear as straight lines (the reason for this is left as an exercise for the reader).
zh_cn: 此图是交互式的，并可以通过单击并拖动鼠标来旋转。准静态测试和动态测试都应因作为数据体条纹而清晰可见，并且最佳拟合平面应穿过所有数据点。准静态和动态测试的数据均应显示为直线（其原因留给读者练习）。

source: The discontinuity corresponds to ``kS``, which always opposes the direction of motion and thus changes direction as the plot crosses the 0 velocity mark.
zh_cn: 不连续性对应于``kS''，它始终与运动方向相反，因此在绘图穿过0速度标记时会改变方向。

source: Common Failure Modes
es_mx: Modos de fallo comunes
fr_ca: Modes de défaillances courantes
zh_cn: 常见故障模式

source: When something has gone wrong with the characterization, diagnostic plots and console output provide crucial clues as to *what* has gone wrong. This section describes some common failures encountered while running the characterization tool, the identifying features of their diagnostic plots, and the steps that can be taken to fix them.
es_mx: Cuando algo ha ido mal en la caracterización, los gráficos de diagnóstico y la salida de la consola proporcionan pistas cruciales sobre *qué* ha ido mal. En esta sección se describen algunos de los fallos más comunes que se encuentran al ejecutar la herramienta de caracterización, los rasgos identificativos de sus gráficos de diagnóstico y los pasos que se pueden dar para solucionarlos.
fr_ca: Lorsque quelque chose a mal tourné avec la caractérisation, les graphiques de diagnostic fournissent des indices cruciaux quant à *ce* qui a mal tourné. Cette section décrit certaines défaillances couramment rencontrées lors de l’exécution de l’outil de caractérisation, les caractéristiques d’identification de leurs graphiques de diagnostic et les mesures qui peuvent être prises pour les corriger.
zh_cn: 当特征出现问题时，诊断图和控制台输出会提供关于*什么*出了问题的关键线索。本节描述了在运行表征工具时遇到的一些常见故障、其诊断图的识别特征以及可以采取的修复步骤。

source: Improperly Set Motion Threshold
es_mx: Establecer incorrectamente el umbral de movimiento
fr_ca: Seuil de mouvement mal défini
zh_cn: 动作阈值设置不正确

source: One of the most-common errors is an inappropriate value for the motion threshold.
es_mx: Uno de los errores más comunes es un valor inapropiado para el umbral de movimiento.
fr_ca: L’une des erreurs les plus courantes est le choix d'une valeur inappropriée pour le seuil de mouvement.
zh_cn: 最常见的错误之一是运动阈值不合适。

source: Motion threshold selector
fr_ca: Sélecteur de seuil de mouvement
zh_cn: 运动阈值选择器

source: Motion Threshold Too Low
es_mx: Umbral de movimiento demasiado bajo
fr_ca: Seuil de mouvement trop bas
zh_cn: 运动阈值太低

source: Time domain plot with threshold too low
zh_cn: 阈值过低的时域图

source: Voltage domain plot with threshold too low
fr_ca: Diagramme dans le domaine de tension avec seuil trop bas
zh_cn: 阈值过低的电压域图

source: The presence of a "leading tail" (emphasized by added red circle) on the time-domain and voltage-domain plots indicates that the :guilabel:`Motion Threshold` setting is too low, and thus data points from before the robot begins to move are being included.
zh_cn: 时域和电压域图上存在“前导尾部”（通过添加的红色圆圈强调）表明 :guilabel:`Motion Threshold` 设置太低，因此机器人开始之前的数据点移动被包括在内。

source: To solve this, increase the setting and re-analyze the data.
es_mx: Para resolver esto, incremente la configuración y vuelva a analizar los datos.
fr_ca: Pour résoudre ce problème, augmenter la valeur du paramètre ``Motion Threshold`` et relancer l'analyse des données.
zh_cn: 要解决此问题，请增加设置并重新分析数据。

source: Motion Threshold Too High
es_mx: Umbral de movimiento demasiado alto
fr_ca: Seuil de mouvement trop élevé
zh_cn: 运动阈值过高

source: Voltage domain plot with threshold too high
fr_ca: Diagramme dans le domaine de tension avec seuil trop élevé
zh_cn: 阈值过高的电压域图

source: While not nearly as problematic as a too-low threshold, a motion threshold that is too high will result in a large "gap" in the voltage domain quasistatic plot.
es_mx: Si bien no es tan problemático como un umbral bajo, un límite de movimiento que sea muy alto resulta en una larga brecha en un trazo cuasiestático.
fr_ca: Bien qu’il ne soit pas aussi problématique qu’un seuil trop bas, un seuil de mouvement trop élevé se traduira par un grand "écart" dans le graphique quasistatique du domaine de la tension.
zh_cn: 虽然运动阈值过高不像过低的阈值那样有问题，但过高的运动阈值会在电压域准静态图中导致较大的“间隙”。

source: To solve this, decrease the setting and re-analyze the data.
es_mx: Para resolver esto, incremente la configuración y vuelva a analizar los datos.
fr_ca: Pour résoudre ce problème, réduire la valeur du paramètre et relancer l'analyse des données.
zh_cn: 要解决此问题，请降低设置并重新分析数据。

source: Magnetic Encoders Velocity Noise
es_mx: Velocidad de sonido de codificadores magnéticos
fr_ca: Bruit de vitesse des encodeurs magnétiques
zh_cn: 电磁编码器速度噪声

source: Time domain plot with mag encoder EMI
fr_ca: Graphique dans le domaine temporel avec un encodeur mag EMI
zh_cn: 具有磁编码器 EMI 的时域图

source: Voltage domain plot with mag encoder EMI
fr_ca: Graphique dans le domaine de tension avec un encodeur mag EMI
zh_cn: 带磁编码器 EMI 的电压域图

source: Magnetic encoders such as the `CTRE Mag Encoder <http://www.ctr-electronics.com/srx-magnetic-encoder.html>`__ and the `AndyMark magnetic encoder <https://www.andymark.com/products/am-mag-encoder>`__ are extremely popular in FRC. However, a particular noise pattern has been observed when these encoders are used on robot drives, whose particular cause is not yet known. This noise pattern is uniquely distinguished by significant velocity noise proportional to motor velocity, and is particularly common on the kit-of-parts `toughbox mini <https://www.andymark.com/products/toughbox-mini-options>`__ gearboxes.
es_mx: Los codificadores magnéticos `CTRE Mag Encoder <http://www.ctr-electronics.com/srx-magnetic-encoder.html>`__ y `codificador magnético de AndyMark <https://www.andymark.com/products/am-mag-encoder>`__ son extremadamente populares en FRC. Sin embargo, un patrón particular de sonidos ha sido observado cuando estos codificadores son utilizados en las unidades de robot, cuya causa particular aun es desconocida. Este patrón de sonido es distinguido por su significante velocidad de sonido proporcional al motor de velocidad, y es particularmente común en el kit de partes en `toughbox mini <https://www.andymark.com/products/toughbox-mini-options>`__ caja de cambios.
zh_cn: 电磁编码器，例如“ CTRE磁性编码器 http://www.ctr-electronics.com/srx-magnetic-encoder.html “和“ AndyMark磁性编码器 https://www.andymark.com/products/am-mag-encoder ” 在FRC中非常流行。但是，将这些编码器用于机器人驱动器时，会观察到特定的噪声模式，其具体原因尚不清楚。这种噪声模式通过与电动机速度成比例的明显的速度噪声而得到独特的区分，并且在零件套件“ Toughbox mini https://www.andymark.com/products/toughbox-mini-options” 变速箱上特别常见。

source: Characterization constants can sometimes be accurately determined even from data polluted this noise by increasing the accel window size setting. However, this sort of encoder noise is problematic for robot code much the same way it is problematic for the characterization tool. As the root cause of the noise is not known, it is recommended to try a different encoder setup if this is observed, either by moving the encoders to a different shaft or replacing them with a different type of encoder.
zh_cn: 有时甚至可以通过增加加速窗口大小设置，甚至从被该噪声污染的数据中准确确定特征常数。但是，这种编码器噪声对机器人代码来说是有问题的，与对特征化工具来说是有问题的方式非常相似。由于不知道产生噪声的根本原因，因此建议您尝试使用不同的编码器设置，方法是将编码器移至不同的轴上，或将其替换为其他类型的编码器。

source: Template Lag
zh_cn: 模板滞后

source: With the new characterization tool, the logging code might not be able to keep up with its 5 ms refresh rate thus causing faulty data to be collected.
zh_cn: 使用新的表征工具，记录代码可能无法跟上其 5 毫秒的刷新率，从而导致收集到错误数据。

source: To see if this is the case, enable print statements on the Driver Station whenever running the data logger. When Autonomous mode is exited, the console will output ``Collected : n in t seconds`` where ``n`` is the number of samples and ``t`` is the time elapsed. If the sampling was successful, ``n`` should equal ``200t`` (rounded).
zh_cn: 要查看是否是这种情况，请在运行数据记录器时在机器操控台上启用打印语句。退出自动阶段时，控制台将输出“Collected : n in t seconds”，其中“n”是样本数，“t”是经过的时间。如果采样成功，“n”应该等于“200t”（四舍五入）。

source: The next diagnostic to look at is the RMSE to make sure that the error is reasonable and within your desired constraints.
fr_ca: Le diagnostic suivant à examiner est le RMSE qui permet de s’assurer que l’erreur est raisonnable et dans les limites souhaitées.

source: To investigate further, you can look at several diagnostic plots on the side.
fr_ca: Pour approfondir votre investigation, vous pouvez examiner quelques courbes de diagnostic sur le côté:

source: Diagnostic plot location
fr_ca: Emplacement de la courbe de diagnostic

source: The Time-Domain Diagnostics plots display velocity and acceleration versus time over the course of the analyzed tests. These should look something like this (other mechanisms will be highly similar):
fr_ca: Les graphiques des diagnostics dans le domaine temporel affichent la vitesse et l’accélération par rapport au temps pendant la durée des tests analysés. Ceux-ci devraient ressembler à quelque chose comme ceci (d’autres mécanismes seront très semblables) :

source: Picture of the quasistatic time domain plots
fr_ca: Image des tracés quasistatiques dans le domaine temporel

source: Picture of the dynamic time domain plots
fr_ca: Image des tracés dynamiques dans le domaine temporel

source: There may be mirroring across the x axis for the drivetrain test. That is normal and is simply the result of the left- and right-side encoders having different signs - this does not cause any trouble for the characterization tool.
fr_ca: Il pourrait avoir une "symétrie" le long de l'axe x pour le test relatif à sous-système de déplacement normale. Cette symétrie est normale et est simplement le résultat des encodeurs des côtés gauche et droit qui ayant des signes différents - cela ne cause aucun problème pour ce qui est de l’outil de caractérisation.

source: The velocity time domain plots contain three sets of data: Raw Data, Filtered Data, and Simulation. The Raw Data is the recorded data from your robot, the Filtered Data is the data after a median filter has been applied to the data, and the Simulation represents the velocity predictions of a model based off of the feedforward gains from the tool. The acceleration graphs only contain the Raw Data and Filtered Data.
fr_ca: Les courbes de la vitesse dans le domaine temporel contiennent trois ensembles de données : Données brutes, Données filtrées et Simulation. Les données brutes sont les données enregistrées relatives à votre robot, les données filtrées sont les données obtenues après qu’un filtre médian a été appliqué aux données brutes, et la simulation représente les prédictions de vitesse d’un modèle basées sur les gains de la commande prédictive de l’outil. Les courbes de l'accélération contiennent uniquement les données brutes et les données filtrées.

source: The Voltage-Domain Diagnostics plots velocity and acceleration versus voltage. Velocity is ploted for the quasistatic test, and acceleration is plotted for the dynamic test. For a typical drive characterization, the plots should resemble this (again, other mechanisms will be similar)
fr_ca: Les courbes de diagnostics dans le domaine de tension représentent la variation de la vitesse et l’accélération par rapport à la tension. La vitesse est tracée pour le test quasistatique et l’accélération est tracée pour le test dynamique. Pour une caractérisation typique de l’entraînement, les courbes doivent ressembler à ceci (encore une fois, pour d’autres mécanismes ces tracés seront semblables)

source: Both plots should be linear, however the dynamic plot will almost certainly have substantially-more noise. The noise on the dynamic plot may be reduced by increasing the :guilabel:`Window Size` setting.
fr_ca: Les deux courbes doivent être linéaires, mais la courbe dynamique aura presque certainement beaucoup plus de bruit. Le bruit sur la courbe dynamique peut être réduit en augmentant la valeur du paramètre :guilabel:`Window Size`.

source: Picture of the window size selector
fr_ca: Image du sélecteur de taille de fenêtre

source: The presence of a "leading tail" (emphasized by added red circle) on the voltage-domain plots indicates that the :guilabel:`Motion Threshold` setting is too low, and thus data points from before the robot begins to move are being included.
fr_ca: La présence d’une "queue de tête" (soulignée par un cercle rouge ajouté) des courbes dans le domaine de la tension indique que la valeur configurée pour le paramètre :guilabel:`Motion Threshold` est trop faible, et donc les points correspondant aux données présentes avant que le robot ne commence à se déplacer sont inclus.

source: Too Long of a Dynamic Test
fr_ca: Test dynamique trop long

source: If the dynamic test is run too long, it tends to accumulate data that will only skew the kA fit. This is noticeable with a large concentration of points towards the middle of the Voltage Domain Acceleration plot. This issue can be assisted by decreasing the :guilabel:`Test Duration` slider.
fr_ca: Si le test dynamique est exécuté trop longtemps, il a tendance à accumuler des données qui ne feront que fausser l’ajustement du paramètre kA. Ceci est perceptible par la présence d'une grande concentration de points vers le milieu de la courbe d’accélération dans le domaine de tension. Ce problème peut être réglé diminuant du durée du test à l'aide du curseur :guilabel:`Test Duration`.

source: Magnetic encoders such as the `CTRE Mag Encoder <https://newsite.ctr-electronics.com/srx-mag-encoder/>`__ and the `AndyMark magnetic encoder <https://www.andymark.com/products/am-mag-encoder>`__ are extremely popular in FRC. However, a particular noise pattern has been observed when these encoders are used on robot drives, whose particular cause is not yet known. This noise pattern is uniquely distinguished by significant velocity noise proportional to motor velocity, and is particularly common on the kit-of-parts `toughbox mini <https://www.andymark.com/products/toughbox-mini-options>`__ gearboxes.
fr_ca: Les encodeurs magnétiques tels que le `CTRE Mag Encoder <http://www.ctr-electronics.com/srx-magnetic-encoder.html>`__ et `l'encodeur magnétique AndyMark <https://www.andymark.com/products/am-mag-encoder>`__ sont extrêmement populaires en FRC. Toutefois, un bruit particulier, dont la cause précise n’est pas encore connue, a été observé lorsque ces encodeurs sont utilisés dans les entraînements des robots. Ce bruit particulier se distingue par une lecture bruitée de la vitesse qui est proportionnelle à la vitesse de rotation du moteur. Ce bruit est particulièrement courant dans les réducteurs `toughbox mini <https://www.andymark.com/products/toughbox-mini-options>`__ du kit-de-pièces.

source: Characterization constants can sometimes be accurately determined even from data polluted this noise by increasing the window size setting. However, this sort of encoder noise is problematic for robot code much the same way it is problematic for the characterization tool. As the root cause of the noise is not known, it is recommended to try a different encoder setup if this is observed, either by moving the encoders to a different shaft, replacing them with a different type of encoder, or increasing the sample per average in project generation (adds an additional layer of filtering).
fr_ca: Les constantes de caractérisation peuvent parfois être déterminées avec précision même à partir de données affectées par ce bruit en augmentant le réglage de la taille de la fenêtre. Cependant, ce type de bruit d’encodeur est problématique pour le code robot de la même manière qu’il est problématique pour l’outil de caractérisation. Comme la cause première du bruit n’est pas connu, il est recommandé d’essayer une configuration d’encodeur différente si cela est observé, soit en déplaçant les encodeurs vers un autre shaft, soit en les remplaçant par un autre type d’encodeur, soit en augmentant l’échantillon par moyenne dans la génération du projet (ajout d'une couche supplémentaire de filtrage).
