Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station.po
Languages: es_mx, ja

source: A Locked "Logitech Attack 3" joystick. This device will stay in this position unless dragged somewhere else or unlocked
es_mx: Un joystick “Logitech Attack 3” bloqueado. Este dispositivo se quedará en esta posición a menos de que sea arrastrada a otro lugar o desbloqueado.
ja: ロックされた「Logitech Attack 3」ジョイスティック。このデバイスは、他の位置にドラッグするか、ロックを解除しない限り、この位置に留まります。

source: An unlocked "Logitech Extreme 3D" joystick
es_mx: Un joystick “Logitech Extreme 3D” desbloqueado.
ja: ロック解除された「Logitech Extreme 3D」ジョイスティック

source: An unlocked "Gamepad F310 (Controller)" which is a Logitech F310 gamepad
es_mx: Un “Gamepad F310 (Controller)” desbloqueado, el cual es un gamepad Logitech F310.
ja: ロックされていないロジクールF310ゲームパッド「Gamepad F310 (Controller)」

source: A Locked, but disconnected "MadCatz GamePad (Controller)" which is a MadCatz Xbox 360 Controller
es_mx: Un “MadCatz GamePad (Controller)” que está bloqueado, pero desconectado, el cual es un MadCatz Xbox 360 Controller.
ja: ロックされているが、接続されていない MadCatz Xbox 360 コントローラー「MadCatz GamePad (Controller)」

source: In this example, unplugging the Logitech Extreme 3D joystick will result in the F310 Gamepad moving up to slot 1. Plugging in the MadCatz Gamepad (even if the devices in Slots 1 and 2 are removed and those slots are empty) will result in it occupying Slot 3.
es_mx: En este ejemplo, si desconecta el joystick Logitech Extreme 3D resultará que el F310 Gamepad se moverá a la ranura 1. Conectar el MadCatz Gamepad (aunque los dispositivos en las ranuras 1 y 2 sean removidos y esas ranuras estén vacías) resultará en que este ocupe la ranura 3.
ja: この例では、ロジクールExtreme 3Dジョイスティックを抜くと、F310ゲームパッドがスロット1に移動します。MadCatz Gamepadを差し込むと（スロット1と2のデバイスが取り外され、それらのスロットが空であっても）、スロット3が使用されます。

source: CAN/Power Tab
ja: CAN/パワータブ

source: This is the fifth tab from the top on the left hand side.
ja: 左側の上から5番目のタブです。

source: The last tab on the left side of the DS is the CAN/Robot Power Tab. This tab contains information about the power status of the roboRIO and the status of the CAN bus:
es_mx: La última pestaña del lado izquierdo de la DS es la CAN/Robot Power Tab. Esta pestaña contiene información sobre el estado de energía de la roboRIO y el estado del CAN bus:
ja: DSの左側の最後のタブは、CAN/ロボット電源タブです。このタブには、roboRIOの電源状態とCANバスの状態に関する情報が表示されます：

source: Comms Faults - Indicates the number of Comms faults that have occurred since the DS has been connected
es_mx: Comms Faults – Indica el número de falla de comunicaciones desde que la DS ha estado conectada.
ja: Comms Faults（通信障害） - DS が接続されてから発生した通信障害の回数を示す

source: 12V Faults - Indicates the number of input power faults (Brownouts) that have occurred since the DS has been connected
es_mx: 12V Faults – Indica el número de fallas de alimentación de entrada (Brownouts) que han ocurrido desde que la DS ha estado conectada.
ja: 12V Faults - DS が接続されてから発生した入力電源障害 （ブラウンアウト）の数を示す

source: 6V/5V/3.3V Faults - Indicates the number of faults (typically caused by short circuits) that have occurred on the User Voltage Rails since the DS has been connected
ja: 6V/5V/3.3V Faults - DSが接続されてからユーザー電圧レールで発生したフォルト（通常は短絡が原因）の数を示す

source: CAN Bus Utilization - Indicates the percentage utilization of the CAN bus
es_mx: CAN Bus Utilization – Indica el porcentaje de utilización del CAN bus.
ja: CANバス使用率 - CANバスの使用率を示す

source: CAN faults - Indicates the counts of each of the 4 types of CAN faults since the DS has been connected
es_mx: CAN faults – Indica los recuentos de cada uno de los 4 tipos de fallas de CAN desde que la DS ha estado conectada.
ja: CANフォルト - DSが接続されてからの4種類のCANフォルトの回数を示す

source: If a fault is detected, the indicator for this tab (shown in blue in the image above) will turn red.
es_mx: Si una falla es detectada, el indicador de esta pestaña (mostrado en azul en la imagen de arriba) se volverá roja.
ja: フォルトが検出されると、このタブのインジケーター（上の画像では青で表示）が赤く点灯します。

source: Messages Tab
ja: メッセージタブ

source: This is the first tab from the top on the right hand side.
ja: 右側の上から1番目のタブです。

source: The Messages tab displays diagnostic messages from the DS, WPILib, User Code, and/or the roboRIO.
ja: メッセージタブには、DS、WPILib、ユーザーが書いたコード、あるいはroboRIOからの診断メッセージが表示されます。

source: To access settings for the Messages tab, click the Gear icon. This will display a menu that will allow you to clear the box, launch a larger Console window for viewing messages, launch the DS Log Viewer, launch a viewer for program timing, or download log files from the robot.
ja: メッセージタブの設定にアクセスするには、ギアアイコンをクリックします。これにより、ボックスをクリアしたり、メッセージを表示するための大きなコンソールウィンドウを起動したり、DSログビューアを起動したり、プログラムのタイミングを表示するビューアを起動したり、ロボットからログファイルをダウンロードしたりすることができるメニューが表示されます。

source: Charts Tab
ja: チャートタブ

source: This is the second tab from the top on the right hand side.
ja: 右側の上から2番目のタブです。

source: The Charts tab plots and displays advanced indicators of robot status to help teams diagnose robot issues:
es_mx: La Charts tab traza y muestra indicadores avanzados del estado del robot para ayudar a los equipos a diagnosticar los problemas del robot:
ja: チャートタブは、ロボットの状態を示す高度な指標をプロットして表示し、チームがロボットの問題を診断するのに役立ちます：

source: The top graph charts trip time in milliseconds in green (against the axis on the right) and lost packets per second in orange (against the axis on the left).
ja: 上のグラフは、トリップ時間をミリ秒単位で緑色（右の軸に対して）、1秒あたりのパケット損失をオレンジ色（左の軸に対して）で表しています。

source: The bottom graph plots battery voltage in yellow (against the axis on the left), roboRIO CPU in red (against the axis on the right), DS Requested mode as a continuous line on the bottom of the chart and robot mode as a discontinuous line above it.
es_mx: La gráfica inferior traza el voltaje de la batería en amarillo (contra el eje a la izquierda), roboRIO CPU en rojo (contra el eje de la derecha), el DS Requested Mode como una línea continua en el fondo de las gráficas y el robot mode como una línea discontinua arriba de esta.
ja: 下のグラフは、バッテリー電圧（左の軸に対して黄色で表示）、roboRIO CPU（右の軸に対して赤で表示）、チャートの下部には連続線でDSリクエストモード、それを上部には不連続線でロボットモードを示しています。

source: This key shows the colors used for the DS Requested and Robot Reported modes in the bottom chart.
es_mx: Esta clave muestra los colores usados para la DS Requested y Robot Reported modes en la tabla inferior.
ja: この凡例は、DSから要求されたモードとロボットから報告されたモードの両方の色を下図に示しています。

source: Chart scale - These controls change the time scale of the DS Charts.
ja: チャートスケール - DSチャートの時間スケールを変更します。

source: This button launches the :doc:`DS Log File Viewer <driver-station-log-viewer>`.
ja: このボタンは :doc:`DS Log File Viewer <driver-station-log-viewer>` を起動します。

source: The DS Requested mode is the mode that the Driver Station is commanding the robot to be in. The Robot Reported mode is what code is actually running based on reporting methods contained in the coding frameworks for each language.
es_mx: El DS Requested mode es el modo en el que la Driver Station le ordena al robot que esté dentro. El Robot Reported mode es que código es el que se está ejecutando actualmente, basado en los métodos de informes contenidos en los marcos de codificación para cada lenguaje.
ja: DSから要求されたモードはドライバーステーションがロボットに指令しているモードです。ロボットから報告されたモードは、各言語のコーディングフレームワークに含まれるレポートメソッドに基づき、実際に実行されているコードです。

source: Both Tab
ja: 両タブ

source: The last tab on the right side is the Both tab which displays Messages and Charts side by side.
ja: 右側の最後のタブは、メッセージとチャートを並べて表示する「両方」タブです。

source: This article describes the use and features of the FRC Driver Station Powered by NI LabVIEW.
es_mx: Este artículo describe el uso y características de la Driver Station de FRC Powered by NI LabVIEW.

source: For information on installing the Driver Station software see :ref:`this document <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`.
es_mx: Para información sobre la instalación del software de la Driver Station vea :ref:`this document <docs/getting-started/getting-started-frc-control-system/frc-game-tools:Installing the FRC Game Tools>`.

source: The FRC Driver Station can be launched by double-clicking the icon on the Desktop or by selecting Start->All Programs->FRC Driver Station.
es_mx: La FRC Driver Station se puede iniciar haciendo doble clic en el icono del Escritorio o seleccionando Inicio->Todos los programas ->FRC Driver Station.

source: The DS must be set to your team number in order to connect to your robot. In order to do this click the Setup tab then enter your team number in the team number box. Press return or click outside the box for the setting to take effect.
es_mx: La DS se debe configurarse con el número de su equipo para conectarse a su robot. Para hacer esto, de clic en la pestaña de Setup, después ingrese el número de su equipo en el cuadro del número de equipo. Presione Return o de clic fuera del cuadro para que la configuración tenga efecto.

source: PCs will typically have the correct network settings for the DS to connect to the robot already, but if not, make sure your Network adapter is set to DHCP.
es_mx: Las PCs tendrán normalmente la configuración de red correcta para que la DS se conecte al robot, pero si no, asegúrese de que su adaptador de red esté configurado en DHCP.

source: Status String - The Status String provides an overall status message indicating the state of the robot, some examples are "No Robot Communication", "No Robot Code", "Emergency Stopped", and "Teleoperated Enabled". When the roboRIO brownout is triggered this will display "Voltage Brownout".
es_mx: Status String – Status String proporciona un mensaje del estado general indicando el estado del robot, algunos ejemplos son “No Robot Communication”, “No Robot Code”, “Emergency Stopped”, y “Teleoperated Enabled”. Cuando la roboRIO desencadene un apagón se mostrará “Voltage Brownout”.

source: Robot Mode - This section controls the Robot Mode. Practice Mode causes the robot to cycle through the same transitions as an FRC match after the Enable button is pressed (timing for practice mode can be found on the setup tab).
es_mx: Robot Mode - Esta sección controla el Robot Mode. Practice Mode hace que el robot recorra las mismas transiciones que en un match de FRC después de que el botón de Enable es presionado (el tiempo para practicing mode se puede encontrar en la pestaña de Setup).

source: Enable/Disable - These controls enable and disable the robot. See also `Driver Station Key Shortcuts`_
es_mx: Enable/Disable – Estos controles habilitan y deshabilitan el robot. Vea `Driver Station Key Shortcuts`_

source: Elapsed Time - Indicates the amount of time the robot has been enabled
es_mx: Elapsed Time – Indica la cantidad de tiempo que el robot ha estado habilitado.

source: PC Battery - Indicates current state of DS PC battery and whether the PC is plugged in
es_mx: PC Battery – Indica el estado actual de la batería de la PC de la DS si la PC está conectada.

source: PC CPU% - Indicates the CPU Utilization of the DS PC
es_mx: PC CPU% - Indica el porcentaje de uso de la CPU de la PC de la DS.

source: Window Mode - When not on the Driver account on the Classmate allows the user to toggle between floating (arrow) and docked (rectangle)
es_mx: Window Mode – Cuando no se encuentra la cuenta del Driver en Classmate, se permite al usuario alternar entre floating (flecha) y docked (rectángulo).

source: When connected to the Field Management System the controls in sections 1, and 2 will be replaced by the words FMS Connected and the control in Section 7 will be greyed out.
es_mx: Cuando se conecte al Field Management System los controles en las Secciones 1, y 2 serán remplazados por las palabras FMS Connected y el control en la Sección 7 estará en gris.

source: DS Version - Indicates the Driver Station Version number
es_mx: DS Version – Indica el número de versión de la Driver Station.

source: roboRIO Image Version - String indicating the version of the roboRIO Image
es_mx: roboRIO Image Version – Enunciado que indica la versión de la roboRIO Image.

source: WPILib Version - String indicating the version of WPILib in use
es_mx: WPILib Version – Enunciado que indica la versión de WPILib que se usa.

source: CAN Device Versions - String indicating the firmware version of devices connected to the CAN bus. These items may not be present if the CTRE Phoenix framework has not been loaded
es_mx: CAN Device Versions – Enunciado que indica la versión del firmware de los dispositivos conectados al CAN Bus. Estos elementos pueden no estar presentados si el CTRE Phoenix framework no se ha cargado.

source: Memory Stats - This section shows stats about the roboRIO memory
es_mx: Memory Stats – Esta sección muestra estadísticas sobre la memoria de la roboRIO.

source: Network Indicators - The second section of indicators indicates status of network adapters and firewalls. These are provided for informational purposes, communication may be established with one or more unlit indicators in this section
es_mx: Network Indicators – La segunda sección de indicadores, indica el estado de los adaptadores de red y firewalls. Estos son proporcionados para fines informativos, la comunicación puede ser establecida con uno o más indicadores apagados de esta sección

source: "Firewall" indicates if any firewalls are detected as enabled. Enabled firewalls will show in orange ( Dom = Domain, Pub = Public, Prv = Private)
es_mx: “Firewall” indica si alguno de los firewalls es detectado como habilitado. Los firewalls habilitados se mostrarán en naranja (Dom = Domain, Pub = Public, Prv = Private)

source: Reboot roboRIO - This button attempts to perform a remote reboot of the roboRIO (after clicking through a confirmation dialog)
es_mx: Reboot roboRIO – Este botón intenta realizar un reinicio remoto de la roboRIO (después de dar clic a un diálogo de confirmación)

source: Restart Robot Code - This button attempts to restart the code running on the robot (but not restart the OS)
es_mx: Restart Robot Code – Este botón intenta reiniciar el código que se ejecuta en el robot (pero no reinicia el OS)

source: Team Number - Should contain your FRC Team Number. This controls the mDNS name that the DS expects the robot to be at. Shift clicking on the dropdown arrow will show all roboRIO names detected on the network for troubleshooting purposes.
es_mx: Team Number – Debe de contener el número de su equipo de FRC. Esto controla el nombre de la mDNS en la cual la DS espera que el robot esté ahí. Cambie haciendo clic en la flecha de la pestaña desplegable, esta mostrará todos los nombres de las roboRIO detectadas en la red para solucionar problemas.

source: Dashboard Type - Controls what Dashboard is launched by the Driver Station. Default launches the file pointed to by the "FRC DS Data Storage.ini" file, by default this is Dashboard.exe in the Program Files\\FRC Dashboard folder. LabVIEW attempts to launch a dashboard at the default location for a custom built LabVIEW dashboard, but will fall back to the default if no dashboard is found. SmartDashboard and Shuffleboard launch the respective dashboards included with the C++ and Java WPILib installation.
es_mx: Dashboard Type – Controla que Dashboard es iniciado por la Driver Station. Predeterminadamente inicia el archivo señalado por el archivo “FRC DS Data Storage.ini”, por defecto este es un Dashboard.exe en la carpeta Program Files\\FRC Dashboard. LabVIEW intenta lanzar un dashboard a la localización predeterminada para un dashboard de LabVIEW personalizado, pero retrocederá al predeterminado si no se encuentra el tablero. SmartDashboard y Shuffleboard inician sus respectivos dashbords incluido con la instalación de C++ y Java WPILib.

source: Game Data - This box can be used for at home testing of the Game Data API. Text entered into this box will appear in the Game Data API on the Robot Side. When connected to FMS, this data will be populated by the field automatically.
es_mx: Game Data – Esta caja se puede utilizar para realizar pruebas de Game Data API en el hogar. El texto introducido en esta caja aparecerá en el Robot Side de la Game Data API. Cuando esté conectado en el FMS, estos datos serán rellenados por el campo automáticamente.

source: Rescan - This button will force a Rescan of the USB devices. While the robot is disabled, the DS will automatically scan for new devices and add them to the list. To force a complete re-scan or to re-scan while the robot is Enabled (such as when connected to FMS during a match) press F1 or use this button.
es_mx: Rescan – Este botón forzará un reescaneo de los dispositivos USB. Mientras el robot está deshabilitado, la DS escaneará automáticamente nuevos dispositivos y los agregará a la lista. Para forzar un reescaneo completo o reescanear mientras el robot esté habilitado (cuando está conectado a FMS durante un partido) presione F1 o utilice este botón.

source: The Driver Station has the capability of "locking" a USB device into a specific slot. This is done automatically if the device is dragged to a new position and can also be triggered by double clicking on the device. "Locked" devices will show up with an underline under the device. A locked device will reserve it's slot even when the device is not connected to the computer (shown as grayed out and underlined). Devices can be unlocked (and unconnected devices removed) by double clicking on the entry.
es_mx: La Driver Station tiene la capacidad de “bloquear” un dispositivo USB en una ranura específica. Esto se hace automáticamente si el dispositivo es arrastrado a una nueva posición y puede ser desencadenada por un doble clic en el dispositivo. Los dispositivos “bloqueados” aparecerán con un subrayado debajo del dispositivo. Un dispositivo bloqueado reservará su ranura incluso cuando el dispositivo no está conectado a la computadora (se muestra en gris y subrayado). Los dispositivos pueden ser desbloqueados (y los dispositivos desconectados eliminados) haciendo doble clic en la entrada.

source: If you have two or more of the same device, they should maintain their position as long as all devices remain plugged into the computer in the same ports they were locked in. If you switch the ports of two identical devices the lock should follow the port, not the device. If you re-arrange the ports (take one device and plug it into a new port instead of swapping) the behavior is not determinate (the devices may swap slots). If you unplug one or more of the set of devices, the positions of the others may move, they should return to the proper locked slots when all devices are reconnected.
es_mx: Si tiene dos o más dispositivos iguales, deberían de mantener su posición siempre que todos los dispositivos permanezcan conectados en la computadora en los mismos puertos en los que estaban bloqueados. Si usted cambia los puertos de dos dispositivos iguales, debería de seguir el puerto, y no el dispositivo. Si reorganiza los puertos (tomar un dispositivo y conectarlo en un puerto nuevo en vez de intercambiarlo) el funcionamiento no está determinado (los dispositivos pueden cambiar de ranuras mucho). Si desconecta uno o más del set de dispositivos, la posición de los otros podría cambiarse, deberían de regresar a las ranuras bloqueadas adecuadas cuando todos los dispositivos sean reconectados.

source: 6V/5V/3.3V Faults - Indicates the number of faults (typically cause by short circuits) that have occurred on the User Voltage Rails since the DS has been connected
es_mx: 6V/5V/3.3V Faults – Indica el número de fallas (causadas típicamente por cortocircuitos) que han ocurrido en el User Voltage Rails desde que la DS ha estado conectada.

source: The Messages tab displays diagnostic messages from the DS, WPILib, User Code, and/or the roboRIO. The messages are filtered by severity. By default, only Errors are displayed.
es_mx: La Messages Tab muestra los mensajes de diagnóstico de la DS, WPILib, User Code, y/o la roboRIO. Estos mensajes son filtrados por gravedad. Por defecto, solo los errores son mostrados.

source: To access settings for the Messages tab, click the Gear icon. This will display a menu that will allow you to select the detail level (Errors, Errors+Warnings or Errors+Warnings+Prints), Clear the box, launch a larger Console window for viewing messages, or launch the DS Log Viewer.
es_mx: Para ver la configuración de la Messages Tab, de clic en el icono de engranaje. Este mostrará un menú que le permitirá seleccionar el nivel de detalle (Errors, Errors+Warnings o Errors+Warnings+Prints), limpiar la casilla, iniciar una ventana de consola más grande para ver los mensajes, o iniciar el DS Log Viewer.

source: The top graph charts trip time in milliseconds in green (against the axis on the right) and lost packets per second in orange (against the axis on the left)
es_mx: La gráfica superior muestra el tiempo de viaje en milisegundos en verde (contra el eje a la derecha) y los paquetes perdidos por segundo en naranja. (contra el eje a la izquierda).

source: Chart scale - These controls change the time scale of the DS Charts
es_mx: Chart scale – Estos controles cambian la escala de tiempos para la DS Charts.

source: This button launches the :doc:`DS Log File Viewer <driver-station-log-viewer>`
es_mx: Este botón lo lleva a :doc:`DS Log File Viewer <driver-station-log-viewer>`

source: The last tab on the right side is the Both tab which displays Messages and Charts side by side
es_mx: La ultima pestaña en el lado derecho es la Both tab, la cual muestra mensajes y gráficos uno al lado de otro.

source: `F1` - Force a Joystick refresh.
es_mx: `F1` – Fuerza una actualización del Joystick.

source: `[` + `]` + `\\` - Enable the robot (the 3 keys above Enter on most keyboards)
es_mx: `[` + `]` + `\\` - Habilita el robot (las 3 teclas encima de Enter en la mayoría de los teclados).

source: `Enter` - Disable the Robot
es_mx: `Enter` – Deshabilita el robot.

source: `Space` - Emergency Stop the robot. After an emergency stop is triggered the roboRIO will need to be rebooted before the robot can be enabled again.
es_mx: `Space` - Parada de emergencia del robot. Después de que se active una parada de emergencia, la roboRIO deberá de ser reiniciada antes de que el robot pueda ser habilitado otra vez.

source: When connected to FMS in a match, teams must press the Team Station E-Stop button to emergency stop their robot as the DS enable/disable and E-Stop key shortcuts are ignored.
es_mx: Cuando se conectan a FMS en un partido, los equipos deben presionar el botón de parada de emergencia de la estación para detener de emergencia su robot, ya que se ignoran los atajos de Enable/Disable y parada de emergencia de la DS.
