Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station-log-viewer.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Driver Station Log File Viewer
fr_ca: Visionneur de fichiers journaux de Driver Station
zh_cn: Driver Station日志文件查看器

source: In an effort to provide information to aid in debugging, the FRC\ |reg| Driver Station creates log files of important diagnostic data while running. These logs can be reviewed later using the FRC Driver Station Log Viewer. The Log Viewer can be found via the shortcut installed in the Start menu or in the FRC Driver Station folder in Program Files.
es_mx: En un esfuerzo para proporcionar información para ayudar a depurar, la FRC\ |reg| Driver Station crea log files de diagnóstico importantes mientras funciona. Estos archivos pueden revisarse más tarde utilizando la FRC Driver Station Log Viewer. La Log Viewer puede encontrase a través del atajo instalado en el Start menú o en la carpeta FRC Driver Station en Program Files.
fr_ca: Dans le but de fournir des informations pour aider au débogage, l'application Driver Station FRC\ |reg| crée des fichiers journaux de données diagnostiques importantes pendant l’exécution. Ces journaux peuvent être examinés ultérieurement à l’aide de la visionneur FRC Driver Station Log Viewer. La visionneur de journal peut être trouvé via le raccourci installé dans le menu Démarrer ou dans le dossier FRC Driver Station situé dans Fichiers de programme.
tr_tr: Hata ayıklamaya yardımcı olacak bilgi sağlama çabasıyla, FRC \ |reg| Driver Station, çalışırken önemli tanılama verilerinin günlük dosyalarını oluşturur. Bu günlükler daha sonra FRC Sürücü İstasyonu Günlük Görüntüleyicisi kullanılarak incelenebilir. Günlük Görüntüleyici, Başlat menüsünde veya Program Dosyaları içindeki FRC Driver Station klasöründe yüklenen kısayol aracılığıyla bulunabilir.
zh_cn: 为了提供有助于调试的信息，FRC ® Driver Station在运行时会创建重要诊断数据的日志文件。 以后可以使用FRC Driver Station Log Viewer查看这些日志。 可以通过“开始”菜单或“Program Files”中的FRC Driver Station文件夹中安装的快捷方式找到“日志查看器”。

source: Event Logs
es_mx: Archivos De Eventos
fr_ca: Journaux d’événements
tr_tr: Etkinlik Kayıtları- Logs
zh_cn: 活动日志

source: The Driver Station logs all messages sent to the Messages box on the Diagnostics tab (not the User Messages box on the Operation tab) into a new Event Log file. When viewing Log Files with the Driver Station Log File Viewer, the Event Log and DSLog files are overlaid in a single display.
es_mx: La Driver Station archiva todos los mensajes enviados a la caja de mensajes en la Diagnostics tab (no la caja de mensajes del usuario en la Operation Tab) en un nuevo Event Log file. Al ver los Log Files con la Driver Station Log File Viewer, los archivos de eventos y DSlog son sobrepuestos en una sola visualización.
fr_ca: Driver Station enregistre tous les messages envoyés dans la zone Messages de son onglet Diagnostics (et non la zone Messages utilisateur de son onglet Opération) dans un nouveau fichier journal des événements. Lorsque vous visionnez des fichiers journaux avec Driver Station Log Viewer, les fichiers journaux d'événements et les fichiers DSLog sont superposés dans un seul affichage.
tr_tr: Driver Station, Tanılama sekmesindeki- Diagnostics Tab Mesajlar kutusuna ( Operation sekmesindeki User Messages kutusuna değil) gönderilen tüm mesajları yeni bir Olay Günlüğü dosyasına kaydeder. Günlük Dosyalarını Driver Station Log File Viewer ile görüntülerken, Event Log ve DSLog dosyaları tek bir ekranda üst üste bindirilir.
zh_cn: DS将发送到“诊断”选项上“消息”框的所有消息（而不是“操作”选项上的“用户消息”框）记录到新的事件日志文件中。 使用Driver Station日志文件查看器查看日志文件时，事件日志和DS日志文件会覆盖在一个显示器中。

source: Log Viewer UI
fr_ca: Interface du visionneur
zh_cn: 日志浏览器用户界面

source: Overview of the home Log Viewer screen.
fr_ca: Vue d’ensemble de l’écran d’accueil de la visionneuse du journal.
zh_cn: 首页日志查看器界面概述。

source: The Log Viewer contains a number of controls and displays to aid in the analysis of the Driver Station log files:
es_mx: El Log Viewer contiene varios controles y visualizadores para ayudar en el análisis de los archivos de la Driver Station:
fr_ca: Le visionneur de journaux contient un certain nombre de contrôles et d’affichages pour faciliter l’analyse des fichiers journaux de Driver Station :
tr_tr: Log Viewer, Driver Station günlük dosyalarının analizine yardımcı olacak bir dizi kontrol ve ekran içerir:
zh_cn: 日志查看器包含许多控件和显示栏，以帮助分析Driver Station日志文件：

source: File Selection Box - This window displays all available log files in the currently selected folder. Click on a log file in the list to select it.
es_mx: File Selection Box – Esta ventana muestra todos los archivos de datos disponibles en la carpeta seleccionada. De clic en un archivo de la lista para seleccionarlo.
fr_ca: Zone de sélection des fichiers - Cette fenêtre affiche tous les fichiers journaux disponibles dans le dossier actuellement sélectionné. Cliquez sur un fichier journal dans la liste pour le sélectionner.
tr_tr: File Selection Box - Bu pencere, seçili klasördeki tüm kullanılabilir günlük dosyalarını görüntüler. Listedeki bir günlük dosyasını seçmek için tıklayın.
zh_cn: 文件选择框-此窗口显示当前所选文件夹中的所有可用日志文件。 单击列表中的日志文件以将其选中。

source: Path to Log Files - This box displays the current folder the viewer is looking in for log files. This defaults to the folder that the Driver Station stores log files in. Click the folder icon to browse to a different location.
es_mx: Path to Log Files – Este recuadro muestra la carpeta en la que el viewer está buscando archivos. Esto predetermina a la carpeta donde la driver station guarda los archivos. De clic en el icono de la carpeta para buscar en una ubicación diferente.
fr_ca: Chemin d’accès aux fichiers journaux - Cette zone affiche le dossier actuel dans lequel le visionneur recherche des fichiers journaux. Par défaut, ce dossier est le dossier dans lequel Driver Station range les fichiers journaux. Cliquez sur l’icône du dossier pour accéder à un autre emplacement.
tr_tr: Path to Log Files - Bu kutu, görüntüleyicinin günlük dosyaları için aradığı geçerli klasörü görüntüler. Bu, varsayılan olarak Driver Station'ın günlük dosyalarını içinde sakladığı klasördür. Farklı bir konuma göz atmak için klasör simgesini tıklayın.
zh_cn: 日志文件的路径-此框显示查看器正在寻找日志文件的当前文件夹。 这默认为Driver Station在其中存储日志文件的文件夹。单击文件夹图标浏览到其他位置。

source: Message Box - This box displays a summary of all messages from the Event Log. When hovering over an event on the graph this box changes to display the information for that event.
es_mx: Message Box – Este recuadro muestra un resumen de todos los mensajes de los archivos de eventos. Al flotar sobre un evento en la gráfica este recuadro cambia, mostrando información para ese evento.
fr_ca: Zone de message - Cette zone affiche un résumé de tous les messages du journal d'événements. Lorsque vous passez le curseur au dessus d'un événement sur le graphique, cette case change pour afficher les informations relatives à cet événement.
tr_tr: Mesaj Kutusu-Message Box - Bu kutu, Olay Günlüğündeki tüm mesajların bir özetini görüntüler. Grafikteki bir olayın üzerine gelindiğinde, bu kutu o olayın bilgilerini görüntülemek için değişir.
zh_cn: 消息框-此框显示事件日志中所有消息的摘要。 将鼠标悬停在图表上的事件上时，此框将更改为显示该事件的信息。

source: Scroll Bar - When the graph is zoomed in, this scroll bar allows for horizontal scrolling of the graph.
es_mx: Scroll Bar – Cuando la gráfica esta ampliada, esta barra de desplazamiento permite desplazarse horizontalmente por la gráfica.
fr_ca: Barre de défilement - Lorsque le graphique est agrandi, cette barre de défilement permet de faire un défilement horizontal du graphique.
tr_tr: Scroll Bar - Grafik yakınlaştırıldığında, bu kaydırma çubuğu grafiğin yatay kaydırılmasına izin verir.
zh_cn: 滚动条-放大图表时，该滚动条允许水平滚动图形。

source: Voltage Filter - This control turns the Voltage Filter on and off (defaults to on). The Voltage Filter filters out data such as CPU %, robot mode and trip time when no Battery Voltage is received (indicating that the DS is no in communication with the roboRIO).
es_mx: Voltage Filter – Este control prende y apaga el filtro de voltaje (predeterminados también). El filtro de voltaje filtra datos como CPU%, modo del robot y tiempo de viaje cuando no se recibe voltaje de batería (indicando que la DS no está en comunicación con la roboRIO).
fr_ca: Filtre de tension - Ce contrôle active et désactive le filtre de tension (par défaut, actif). Le filtre de tension filtre les données telles que le % CPU, le Mode du Robot et le temps de surtension lorsqu’aucune tension de batterie n’est reçue (ce qui indique que DS n’est pas en communication avec le roboRIO).
tr_tr: Voltage Filter - Bu kontrol Voltaj Filtresini açar ve kapatır (varsayılan olarak açıktır). Voltaj Filtresi, Pil Voltajı alınmadığında CPU%, robot modu ve trip time gibi verileri filtreler (DS'nin roboRIO ile iletişim halinde olmadığını gösterir).
zh_cn: 电压筛选器-此控件可打开和关闭电压筛选（默认为打开）。 当未收到电池电压时（表示DS未与roboRIO通信），电压筛选会过滤掉CPU占用率，机械模式和往返时延等数据。

source: AutoScale - This button zooms the graph out to show all data in the log.
es_mx: AutoScale – Este botón cambia de tamaño la gráfica para mostrar todos los datos en el archivo.
fr_ca: AutoScale - Ce bouton effectue un zoom arrière du graphique pour afficher toutes les données du journal.
tr_tr: AutoScale - Bu düğme, günlükteki tüm verileri göstermek için grafiği uzaklaştırır.
zh_cn: 自动缩放-此按钮将图表缩小以显示日志中的所有数据。

source: Match Length - This button scales the graph to approximately the length of an FRC match (2 minutes and 30 seconds shown). It does not automatically locate the start of the match, you will have to scroll using the scroll bar to locate the beginning of the Autonomous mode.
es_mx: Match Length – Este botón cambia el tamaño de la gráfica a aproximadamente la duración de un partido de FRC (2 minutos y 30 segundos). No localiza automáticamente el inicio del partido, usted tendrá que desplazarse usando el la barra desplazatoria para localizar el inicio del modo autónomo.
fr_ca: Match length - Ce bouton étale le graphique à environ la durée d’un match FRC (2 minutes et 30 secondes indiquées). Il ne localise pas automatiquement le début du match, vous devrez parcourir le graphe à l’aide de la barre de défilement pour localiser le début du mode autonome.
tr_tr: Match Length-Maç Uzunluğu - Bu düğme, grafiği yaklaşık olarak bir FRC eşleşmesinin uzunluğuna ölçeklendirir (2 dakika ve 30 saniye gösterilir). Maçın başlangıcını otomatik olarak bulmaz, Otonom modun başlangıcını bulmak için kaydırma çubuğunu kullanarak kaydırmanız gerekecektir.
zh_cn: 比赛时长-此按钮将图表缩放到大约FRC比赛时长（显示2分钟30秒）。 它不会自动定位比赛开始的地方，您将不得不使用滚动条滚动以定位自动模式的开始。

source: Graph - This display shows graph data from the DS Log file (voltage, trip time, roboRIO CPU%, Lost Packets, and robot mode) as well as overlaid event data (shown as dots on the graph with select events showing as vertical lines across the entire graph). Hovering over event markers on the graph displays information about the event in the Messages window in the bottom left of the screen.
es_mx: Graph – Esto muestra gráficos con datos de la DS Log File (voltaje, tiempo de viaje, roboRIO CPU%, paquetes perdidos y modo del robot) así como datos de eventos sobrepuestos (mostrados como puntos en la gráfica con eventos seleccionados mostrados como líneas verticales a través de toda la gráfica). Al pasar el cursor sobre los indicadores de eventos en la gráfica muestra información sobre el evento en la ventana de mensajes en la parte inferior izquierda de la pantalla.
fr_ca: Graphique - Cet écran montre sous forme graphique les données du fichier journal DS (tension, surtension, %CPU du roboRIO, paquets perdus et mode du robot) ainsi que les données d’événements superposées (affichées sous forme de points sur le graphique avec certains événements montrant des lignes verticales sur l’ensemble du graphique). En passant le curseur sur les marqueurs d’événements du graphique, on affiche des informations sur l’événement dans la fenêtre Messages en bas à gauche de l’écran.
tr_tr: Grafik-Graph - Bu ekran, DS Günlük dosyasından (voltaj, yolculuk süresi, roboRIO CPU%, Kayıp Paketler ve robot modu) alınan grafik verilerini ve ayrıca üst üste binen olay verilerini (grafikte noktalar olarak gösterilen, seçili olayların dikey çizgiler olarak gösterildiği tüm grafik). Grafikteki olay işaretçilerinin üzerine gelmek, ekranın sol alt kısmındaki Messages penceresinde olayla ilgili bilgileri görüntüler.
zh_cn: 图表-此显示显示来自DS日志文件的图表数据（电压，往返时延，roboRIO的CPU占用率，丢失的数据包和机械模式），以及叠加的事件数据（在图表上显示为点，在选定事件中显示为跨越整个事件的竖线）。 将鼠标悬停在图表上的事件标记上，屏幕左下方的“消息”窗口中会显示有关事件的信息。

source: Robot Mode Key - Key for the Robot Mode displayed at the top of the screen
es_mx: Robot Mode Key – Clave para que el modo del robot se muestre en la parte superior de la pantalla.
fr_ca: Légende du Mode Robot - Légende pour le Mode Robot affiché en haut de l’écran
tr_tr: Robot Mode Key - Ekranın üst kısmında görüntülenen Robot Modu için anahtar
zh_cn: 机械模式键-屏幕顶部显示的机械模式键

source: Major event key - Key for the major events, displayed as vertical lines on the graph
es_mx: Major event key – Clave para los eventos más grandes, se muestra como líneas verticales en la gráfica
fr_ca: Légende d’événement majeur - Légende pour les événements majeurs, affichés sous forme de lignes verticales sur le graphique
tr_tr: Önemli olay belirteçleri - Grafikte dikey çizgiler olarak gösterilen, önemli olayların belirteçleridir
zh_cn: 主要事件键-主要事件的键，在图表上显示为竖线

source: Graph key - Key for the graph data
es_mx: Graph key – Clave para los datos gráficos.
fr_ca: Légende graphique - Légende pour les données graphiques
tr_tr: Graph tuşu - Grafik verileri için önemlidir
zh_cn: 图形键 - 图表数据的按键

source: Filter Control - Drop-down to select the filter mode (filter modes explained below)
es_mx: Filter Control – Despliegue para seleccionar el modo del filtro (modo de filtro se explican debajo).
fr_ca: Contrôle du filtrage - Liste déroulante pour sélectionner le mode de filtrage (modes de filtrage expliqués ci-dessous)
tr_tr: Filtre Kontrolü-Filter Control - Filtre modunu seçmek için açılır menü (filtre modları aşağıda açıklanmıştır)
zh_cn: 筛选控制-下拉菜单选择筛选的模式（下面会说明筛选模式）

source: Tab Control - Control to switch between the Graph (Data and Events vs. Time) and Event List displays.
es_mx: Tab Control – Control para cambiar entre gráficos (Data and Events vs. Time) y muestras de listas de eventos.
fr_ca: Contrôle d’onglet - Contrôle pour basculer entre les affichages graphique (données et événements vs temps) et liste d’événements.
tr_tr: Sekme Kontrolü-Tab Control - Grafik (Veriler ve Olaylara karşı Zaman) ve Olay Listesi ekranları arasında geçiş yapma kontrolü.
zh_cn: 选项控制 - 在显示图表（数据与事件 关于 时间）和事件列表之间切换的控件

source: Using the Graph Display
es_mx: Uso de la pantalla gráfica
fr_ca: Comment utiliser l'affichage graphique
zh_cn: 使用图形显示

source: The different parts of the graph screen and some of the basic signals.
fr_ca: Les différentes parties de l’écran graphique et certains des signaux de base.
zh_cn: 图形屏幕的不同部分和一些基本信号。

source: The Graph Display contains the following information:
es_mx: La visualización de la gráfica contiene la siguiente información:
fr_ca: L’affichage graphique contient les informations suivantes :
tr_tr: Grafik Ekranı aşağıdaki bilgileri içerir:
zh_cn: 图表显示包含下面的信息：

source: Graphs of Trip Time in ms (green line) and Lost Packets per second (displayed as blue vertical bars). In these example images Trip Time is a flat green line at the bottom of the graph and there are no lost packets
es_mx: Gráficas del tiempo de viaje en ms (línea verde) y paquetes perdidos por segundo (mostrados como líneas azules verticales). En estas imágenes de ejemplo el tiempo de viaje es una linea plana verde al fondo de la gráfica y no hay paquetes perdidos.
fr_ca: Graphiques du temps de surtension en ms (ligne verte) et paquets perdus par seconde (affichés sous forme de barres verticales bleues). Dans ces exemples, la surtension est une ligne verte plate au bas du graphique et il n’y a pas de paquets perdus
tr_tr: Gezi Süresi - Trip Time ms (yeşil çizgi) ve saniye başına Kayıp Paket - Lost Packets (mavi dikey çubuklar olarak görüntülenir) cinsinden gösterilir. Bu örnek resimlerde Trip Time, grafiğin altında düz yeşil bir çizgidir ve kayıp paket yoktur
zh_cn: 以毫秒为单位的跳闸时间图（绿线）和每秒丢失的数据包数（显示为蓝色竖线）。 在这些示例图像中，“往返时延”在图的底部是一条平坦的绿线，并且没有丢失的数据包

source: Graph of Battery voltage displayed as a yellow line.
es_mx: Gráfica de voltaje de la batería mostrada como una línea amarilla.
fr_ca: Graphique de la tension de la batterie affichée sous la forme d'une ligne jaune.
tr_tr: Sarı çizgi olarak gösterilen Pil voltajı grafiği.
zh_cn: 电池电压显示为一条黄线。

source: Graph of roboRIO CPU % as a red line
es_mx: Gráfica del roboRIO CPU % como una línea roja
fr_ca: Graphique du % CPU du roboRIO comme ligne rouge
tr_tr: Kırmızı çizgi olarak roboRIO CPU% grafiği
zh_cn: roboRIO CPU占用率是一条红线

source: Graph of robot mode and DS mode. The top set of the display shows the mode commanded by the Driver Station. The bottom set shows the mode reported by the robot code. In this example the robot is not reporting it's mode during the disabled and autonomous modes, but is reported during Teleop.
es_mx: Gráfica del modo del robot y de la DS. El conjunto superior de la visualización muestra el modo ordenado por la Driver Station. El conjunto inferior muestra el modo reportado por el código del robot. En este ejemplo el robot no está reportando su modo durante los modos disabled y autónomo, pero lo reporta durante Teleop.
fr_ca: Graphique des modes Robot et DS. L’ensemble supérieur de l’écran montre le mode dicté par Driver Station. L’ensemble inférieur montre le mode exécuté par le code du robot. Dans cet exemple, le robot ne communique pas son mode pendant les phases désactivé et autonome, mais il le communique pendant le Mode Teleop.
tr_tr: Robot modu ve DS modu grafiği. Ekranın üst grubu, Driver Station tarafından komut verilen modu gösterir. Alttaki set, robot kodu tarafından bildirilen modu gösterir. Bu örnekte robot, devre dışı ve otonom modlar sırasında modunu rapor etmiyor, ancak Teleop sırasında rapor edilmiş.
zh_cn: 机械模式和DS模式的图形。 显示屏的顶部显示了由机器操控台控制的模式。 底部显示的是机器人代码报告的模式。 在此示例中，机器人在禁用和自动阶段下不会报告其模式，而会在手动阶段期间报告。

source: Event markers will be displayed on the graph indicating the time the event occurred. Errors will display in red; warnings will display in yellow. Hovering over an event marker will display information about the event in the Messages box at the bottom left of the screen.
es_mx: Marcadores de evento se mostrarán en la gráfica indicando el cuándo sucedió el evento. Los errores se mostraran en rojo; advertencias en amarillo. Pasar sobre un marcador de evento mostrará información sobre el evento en la caja de mensajes en la parte inferior izquierda de la pantalla.
fr_ca: Les marqueurs d’événements sont affichés sur le graphique indiquant le moment où l’événement a eu lieu. Les erreurs s’affichent en rouge; les avertissements en jaune. En passant le curseur par dessus un marqueur d’événement, vous afficherez des informations sur l’événement dans la zone Messages en bas à gauche de l’écran.
tr_tr: Olayın meydana geldiği zamanı gösteren olay işaretçileri grafikte görüntülenecektir. Hatalar kırmızı renkte görüntülenecektir; uyarılar sarı renkte görüntülenecektir. Bir olay işaretleyicisinin üzerine gelmek, ekranın sol alt kısmındaki Messages kutusunda olayla ilgili bilgileri görüntüler.
zh_cn: 事件标记将显示在图表上，指示事件发生的时间。 错误将以红色显示； 警告将显示为黄色。 将鼠标悬停在事件标记上，将在屏幕左下方的“消息”框中显示有关事件的信息。

source: Major events are shown as vertical lines across the graph display.
es_mx: Eventos grandes se muestran como líneas verticales a través de la gráfica.
fr_ca: Les événements majeurs apparaissent sous forme de lignes verticales sur l’affichage du graphique.
tr_tr: Önemli olaylar, grafik ekranı boyunca dikey çizgiler olarak gösterilir.
zh_cn: 主要事件显示为穿过显示界面的竖线。

source: To zoom in on a portion of the graph, click and drag around the desired viewing area. You can only zoom the time axis, you cannot zoom vertically.
es_mx: Para amplificar una parte de la gráfica, dé clic y arrastre alrededor del área deseada. Usted solo puede amplificar el eje del tiempo, no puede amplificar verticalmente.
fr_ca: Pour agrandir une partie du graphique, cliquez et faites glisser autour de la zone d’affichage souhaitée. Vous ne pouvez zoomer que sur l’axe de temps, vous ne pouvez pas zoomer verticalement.
tr_tr: Grafiğin bir bölümünü yakınlaştırmak için, istenen görüntüleme alanını tıklayıp sürükleyin. Yalnızca zaman eksenini yakınlaştırabilirsiniz, dikey olarak yakınlaştıramazsınız.
zh_cn: 单击并拖动目标区域，来放大图表的一部分。你可以只放大时间线，但是不能垂直放大。

source: Event List
fr_ca: Liste des événements
zh_cn: 事件列表

source: Event List that is gotten to by the tab at the top center.
fr_ca: Liste des événements qui est obtenue par l’onglet en haut au centre.
zh_cn: 由顶部中心的选项卡获取的事件列表。

source: The Event List tab displays a list of events (warnings and errors) recorded by the Driver Station. The events and detail displayed are determined by the currently active filter (images shows "All Events, All Info" filter active).
es_mx: La Event List tab muestra una lista de eventos (advertencias y errores) grabados por la Driver Station. Estos eventos y detalles son determinados por el filtro activo en ese momento (la imagen muestra el filtro “All Events, All Info” activado).
fr_ca: L’onglet Event List affiche une liste d’événements (avertissements et erreurs) enregistrés par Driver Station. Les événements et les détails affichés sont déterminés par le filtre actuellement actif (l'image montre le résultat obtenu du filtre actif "All Events, All Info").
tr_tr: Event List sekmesi, Driver Station tarafından kaydedilen olayların (uyarılar ve hatalar) bir listesini görüntüler. Görüntülenen olaylar ve ayrıntılar, o anda etkin olan filtre tarafından belirlenir (resimlerde "All Events, All Info" filtresi etkin gösterilir).
zh_cn: “事件列表”选项显示由Driver Station记录的事件（警告和错误）列表。 显示的事件和详细信息由当前活动的晒选确定（图像显示“所有事件，所有信息”过滤器处于活动状态）。

source: Filters
es_mx: Filtros
fr_ca: Filtres
tr_tr: Filtreler
zh_cn: 筛选

source: Three filters are currently available in the Log Viewer:
es_mx: Estos tres filtros están disponibles actualmente en el Log Viewer:
fr_ca: Trois filtres sont disponibles dans le visionneur de journaux :
tr_tr: Şu anda Günlük Görüntüleyicide-Log Viewer üç filtre bulunmaktadır:
zh_cn: 日志查看器里三个筛选器现在可用：

source: Default: This filter filters out many of the errors and warnings produced by the Driver Station. This filter is useful for identifying errors thrown by the code on the Robot.
es_mx: Default: Este filtro remueve muchos de los errores y advertencias producidas por la Driver Station. Este filtro es útil para identificar los errores hechos por el mismo código del Robot.
fr_ca: Default: ce filtre filtre bon nombre des erreurs et avertissements rapportés par Driver Station. Ce filtre est utile pour identifier les erreurs émises par le code sur le robot.
tr_tr: Default: Bu filtre, Driver Station tarafından üretilen birçok hata ve uyarıyı filtreler. Bu filtre, Robot'ta kod tarafından atılan hataları tanımlamak için kullanışlıdır.
zh_cn: 默认：此筛选器过滤掉由Driver Station产生的许多错误和警告。 该筛选器对于识别由机器人上的代码引发的错误很有用。

source: All Events and Time: This filter shows all events and the time they occurred
es_mx: All Events and Time: Este filtro muestra todos los eventos y el tiempo en el que ocurrieron.
fr_ca: All Events and Time: ce filtre affiche tous les événements et l’heure à laquelle ils se sont produits
tr_tr: All Events and Time: Bu filtre tüm olayları ve meydana geldikleri zamanı gösterir
zh_cn: “所有事件和时间”：此筛选器显示所有事件及其发生的时间
