Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station-labview-dashboard.po
Languages: es_mx, fr_ca

source: FRC Driver Station LabVIEW Dashboard
fr_ca: Dashboard de LabVIEW avec FRC Driver Station

source: The Dashboard application installed and launched by the FRC\ |reg| Driver Station is a LabVIEW program designed to provide teams with basic feedback from their robot, with the ability to expand and customize the information to suit their needs. This Dashboard application uses Network Tables and contains a variety of tools that teams may find useful.
fr_ca: L’application Dashboard installée et lancée automatiquement par l'application Driver Station FRC\ |reg| est un programme LabVIEW conçu pour fournir aux équipes des informations de base en provenance de leur robot, avec la possibilité d’étendre et de personnaliser l’information en fonction de leurs besoins. Cette application Dashboard utilise des Network Tables et contient une variété d’outils qui peuvent être utiles pour les équipes.

source: LabVIEW Dashboard
fr_ca: Dashboard de LabVIEW

source: The Dashboard is broken into two main sections. The left pane is for displaying a camera image. The right pane contains:
es_mx: La Dashboard está dividida en dos paneles principales. El panel izquierdo es para mostrar la imagen de la cámara. El panel derecho contiene:
fr_ca: Le tableau de bord Dashboard est divisé en deux sections principales. Le volet gauche permet l’affichage d’une image de caméra. Le volet droit contient :

source: Drive tab that contains indicators for joystick and drive motor values (hooked up by default when used with LabVIEW robot code), a gyro indicator, an Autonomous selection text box, a connection indicator and some controls and indicators for the camera
es_mx: Pestaña Drive que contiene indicadores para valores de joysticks y motores (anclado por default cuando el código del robot esta en LabVIEW) , un indicador de giro, un recuadro de texto para selección de Autónomo, un indicador de conexión y algunos controles e indicadores para la cámara.
fr_ca: L'onglet Drive contient des indicateurs de valeurs de données provenant de la manette et des moteurs de déplacement (connectés par défaut lorsque utilisés avec le code robot en LabVIEW), un indicateur pour le gyroscope, une zone de texte de sélection pour le choix du mode autonome, un indicateur de connexion et quelques contrôles et indicateurs pour la caméra

source: Basic tab that contains some default controls and indicators
es_mx: Pestaña Basic que contiene algunos controles e indicadores predeterminados.
fr_ca: L'onglet Basic contient par défaut quelques contrôles et indicateurs

source: Camera tab that contains a secondary camera viewer, similar to the viewer in the left pane
es_mx: Pestaña de Camera que contiene una vista secundaria de la cámara, parecida a la del panel izquierdo.
fr_ca: L'onglet Camera contient une visionneuse secondaire du signal caméra, semblable à la visionneuse dans le volet gauche du Dashboard

source: Custom tab for customizing the dashboard using LabVIEW
es_mx: Pestaña Custom para personalizar la dashboard usando LabVIEW.
fr_ca: L'onglet Custom permet de personnaliser le tableau de bord à l’aide de LabVIEW

source: Test tab for use with Test Mode in the LabVIEW framework
es_mx: Pestaña Test para usar con el Test Mode dentro de la estructura de LabVIEW.
fr_ca: L'onglet Test a été conçu pour une utilisation avec le mode Test dans l'environnement LabVIEW

source: Commands tab for use with the new LabVIEW C&C Framework
es_mx: Pestaña Commands para usar con la nueva estructura LabVIEW C&C .
fr_ca: L'onglet Commands est utilisé dans le nouvel environnement LabVIEW C&C

source: Checklist tab that can be used to create task lists to complete before and/or between matches
es_mx: Pestaña Checklist que se puede usar para crear listas de tareas para completar antes y/o entre partidos.
fr_ca: L'onglet Checklist permet de créer des listes de tâches à compléter avant ou entre les matchs

source: Variables tab that displays the raw Network Tables variables in a tree view format
es_mx: Pestaña Variables que muestra las variables de Network Tables en tres diferentes formatos.
fr_ca: L'onglet Variables affiche les variables brutes des Network Tables sous la forme d'une arborescence

source: The LabVIEW Dashboard also includes Record/Playback functionality, located in the bottom right. More detail about this feature is included below under `Record/Playback`_.
es_mx: La Dashboard de LabVIEW también incluye las funciones Record/Playback, ubicadas al fondo a la derecha. Más detalles sobre esta función se incluyen más abajo en `Record/Playback`_.
fr_ca: Le Dashboard LabVIEW comprend aussi la fonctionnalité Enregistrement/Lecture, située en bas à droite. On peut trouver plus de détails sur cette fonctionnalité plus bas, sous `Record/Playback`_.

source: Camera Image and Controls
es_mx: Imagen de la Cámara y controles.
fr_ca: Caméra : images et commandes

source: The left pane is used to display a video feed from an Axis camera or USB camera located on the robot. For instructions on setting up the Axis Camera to work with this display :ref:`see here <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>`. There are also some controls and indicators related to the camera below the tab area:
es_mx: El panel izquierdo es usado para mostrar la vista de una cámara Axis o una cámara de USB ubicada en el robot. Para instrucciones sobre como configurar la cámara Axis para que funcione con esta visualización :ref:`see here <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>`. También hay algunos controles e indicadores relacionados a la cámara debajo del área de las pestañas.
fr_ca: Le volet gauche est utilisé pour afficher un flux vidéo depuis une caméra de type Axis ou une caméra USB installée sur le robot. Pour obtenir des instructions sur la configuration de la caméra Axis afin qu'elle fonctionne avec cet écran, voir :ref:`ici <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>`. Il existe aussi quelques contrôles et indicateurs liés à la caméra sous la zone onglet:

source: Camera Image Display
es_mx: Transmisión de imagen de la cámara.
fr_ca: Affichage de l’image de la caméra

source: Mode Selector - This drop-down allows you to select the type of camera display to use. The choices are Camera Off, USB Camera SW (software compression), USB Camera HW (hardware compression) and IP Camera (Axis camera). Note that the IP Camera setting will not work when your PC is connected to the roboRIO over USB.
es_mx: Modo Seleccionador – Este menú desplegable le permite seleccionar el tipo de visualización de la cámara para usar. Las opciones son Camera Off , USB Camera SW (software compression), USB Camera HW (hardware compression) e IP Camera (Axis camera). Note que la configuración de la IP Camera no funcionara cuando su PC este conectada a la roboRIO por medio USB.
fr_ca: Sélecteur de mode - Cette liste déroulante vous permet de sélectionner le type d'affichage de caméra à utiliser. Les choix sont Camera Off, USB Camera SW (compression logicielle), USB Camera HW (compression matérielle) et IP Camera (caméra Axis). Notez que le paramètre IP Camera ne fonctionnera pas lorsque votre PC est connecté au roboRIO à travers un port USB.

source: Camera Settings - This control allows you to change the resolution, framerate and compression of the image stream to the dashboard, click the control to pop-up the configuration.
es_mx: Ajustes de la cámara – Este control le permite cambiar la resolución, cuadros por segundo y compresión de la transmisión de imagen a la dashboard, de click en control para mostrar la configuración.
fr_ca: Paramètres de la caméra - Ce contrôle vous permet de modifier la résolution, la fréquence des images et la compression du flux d’images vers le tableau de bord, cliquez sur le contrôle pour afficher la configuration.

source: Bandwidth Indicator - Indicates approximate bandwidth usage of the image stream. The indicator will display green for "safe" bandwidth usage, yellow when teams should use caution and red if the stream bandwidth is beyond levels that will work on the competition field.
es_mx: Indicador de ancho de banda – Indica aproximadamente el uso del ancho de banda de la imagen. El indicador estará verde cuando el ancho de banda sea seguro, amarillo cuando el equipo debe tener precaución y rojo cuando el ancho de banda de la transmisión sobrepasa los niveles que funcionan en la cancha durante la competencia.
fr_ca: Indicateur de bande passante - Indique l’utilisation approximative de la bande passante du flux d’images. L’indicateur affichera une couleur verte pour indiquer l'utilisation d'une bande passante "sûre", jaune lorsque les équipes doivent faire preuve de prudence et rouge si la bande passante du flux est au-delà des niveaux de fonctionnement adéquats du terrain de compétition.

source: Framerate - Indicates the approximate received framerate of the image stream.
es_mx: Framerate – Indica aproximadamente los cuadros por segundo que se reciben de la transmisión.
fr_ca: Fréquence d'images - Indique le taux de rafraichissement approximatif reçu du flux d’images.

source: The bandwidth indicator indicates the combined bandwidth for all camera streams open.
es_mx: El indicador de ancho de banda indica el ancho de banda combinado para todas las transmisiones de cámara abiertas.
fr_ca: L’indicateur de bande passante indique la bande passante combinée de tous les flux de caméra ouverts.

source: The center pane contains a section that provides feedback on the joysticks and drive commands when used with the LabVIEW framework and a section that displays the NetworkTables status and autonomous selector:
es_mx: El panel del centro contiene una sección que proporciona retroalimentación de los comandos de joysticks y drive cuando se usa dentro de la estructura de LabVIEW, y una sección que muestra el estado de los Network Tables y el selector de autónomo:
fr_ca: Le volet central contient une section qui fournit des informations sur les manettes et les commandes de déplacement lorsqu’il est utilisé avec l’environnement LabVIEW ainsi q'une section qui affiche l’état des Network Tables et le sélecteur de mode autonome :

source: Displays X,Y and Throttle information and button values for up to 2 joysticks when using the LabVIEW framework
es_mx: Muestra los ejes X, Y, información del acelerador y valores de no más de 2 joysticks cuando se usa al estructura de LabVIEW.
fr_ca: Pour une utilisation dans l'environnement LabVIEW et jusqu'à 2 manettes, affiche les informations sur les axes X, Y, l'accélérateur ainsi que les valeurs des boutons.

source: Displays values being sent to motor controllers when using LabVIEW framework
es_mx: Muestra valores siendo enviados a los controladores de motor al usar la estructura de LabVIEW.
fr_ca: Affiche les valeurs envoyées aux contrôleurs de moteur lorsqu'on trouve sous LabVIEW

source: Displays a connection indicator for the NetworkTables (NT) data from the robot
es_mx: Muestra un indicador de conexión para los datos de Network Tables (NT) del robot.
fr_ca: Affiche un indicateur de connexion pour les données des NetworkTables (NT) du robot

source: Displays a Gyro value
es_mx: Muestra un valor Gyro.
fr_ca: Affiche une valeur provenant du gyroscope

source: Displays a text box that can be used to select Autonomous modes. Each language's code templates have examples of using this box to select from multiple autonomous programs.
es_mx: Muestra un recuadro de texto que puede usarse para seleccionar un modo de autónomo. Cada lenguaje de un código tiene ejemplos sobre usar este recuadro para seleccionar de múltiples programas autónomos.
fr_ca: Affiche une zone de texte pouvant être utilisée pour sélectionner les modes autonomes. Les modèles de code fournis pour nos langages de programmation ont des exemples d’utilisation de cette zone afin de choisir parmi plusieurs programmes autonomes.

source: These indicators (other than the Gyro) are hooked up to appropriate values by default when using the LabVIEW framework. For information on using them with C++/Java code see :doc:`using-the-labview-dashboard-with-c++-java-code`.
es_mx: Estos indicadores (además de Gyro) están llenados con valores adecuados de manera predeterminada al tener la estructura de LabVIEW. Para más información en cómo usarlos con código en C++/Java vea :doc:`using-the-labview-dashboard-with-c++-java-code`.
fr_ca: Ces indicateurs (autres que le gyroscope) sont reliés par défaut à des valeurs appropriées lors de l’utilisation sous LabVIEW. Pour plus d’informations sur leur utilisation en C++/Java, voir :doc:`using-the-labview-dashboard-with-c++-java-code`.

source: The Basic tab contains a variety of pre-populated bi-directional controls/indicators which can be used to control the robot or display information from the robot. The SmartDashboard key names associated with each item are labeled next to the indicator with the exception of the Strings which follow the same naming pattern and increment from DB/String 0 to DB/String 4 on the left and DB/String 5 to DB/String 9 on the right. The LabVIEW framework contains an example of reading from the Buttons and Sliders in Teleop. It also contains an example of customizing the labels in Begin. For more detail on using this tab with C++\Java code, see :doc:`using-the-labview-dashboard-with-c++-java-code`.
es_mx: La pestaña Basic contiene una variedad de controles/indicadores pre- llenados y bidireccionales que pueden usarse para controlar el robot o mostrar información de este. Los nombres clave de la SmartDashboard asociados con cada objeto son etiquetados junto al indicador, excepto los strings que siguen el mismo patrón de nombrado e incrementan de DB/String 0 a DB/String 4 en la izquierda y DB/String 5 a DB/String 9 en la derecha. La estructura de LabVIEW contiene un ejemplo de leer desde los botones y deslizadores en modo Teleop. También contiene un ejemplo sobre personalizar las etiquetas en Begin. Para mas detalles sobre como usar esta pestaña con código en C++/Java, vea :doc:`using-the-labview-dashboard-with-c++-java-code`.
fr_ca: L’onglet Basic contient une variété de contrôles/indicateurs bidirectionnels préparés d'avance pour être utilisés afin de contrôler le robot ou afficher les informations du robot. Les noms de clés du SmartDashboard associées à chaque élément sont étiquetés à côté de l’indicateur, à l’exception des chaînes de caractères qui suivent le même modèle de dénomination et incrément de DB/String 0 à DB/String 4 à gauche et DB/String 5 à DB/String 9 à droite. L’environnement LabVIEW fournit un exemple de lecture des boutons et curseurs de Teleop. Il contient également un exemple de personnalisation des étiquettes dans Begin. Pour plus de détails sur l’utilisation de cet onglet avec le code C++Java, voir :doc:`using-the-labview-dashboard-with-c++-java-code`.

source: The left pane can only display a single camera output, so use the camera tab on the right pane to display a second camera output if needed.
es_mx: El panel izquierdo solo puede mostrar una sola transmisión de cámara, entonces use la pestaña camera del panel derecho para mostrar una segunda transmisión si necesita.
fr_ca: Le volet gauche peut seulement afficher la sortie d'une caméra, vous pouvez utiliser l’onglet Camera du volet droit pour afficher, si nécessaire, la sortie d'une deuxième caméra.

source: The camera tab is used to display a video feed from an Axis camera or USB camera located on the robot. For instructions on setting up the Axis Camera to work with this display :ref:`see here <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>`. There are also some controls and indicators related to the camera below the tab area:
es_mx: La pestaña Camera es usada para mostrar una transmisión de video desde una cámara Axis o una cámara USB localizada en el robot. Para indicaciones sobre como configurar la cámara Axis para que funcione con esta visualización :ref:`see here <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>`. También hay algunos controles e indicadores relacionados a la cámara debajo de la pestaña.
fr_ca: L’onglet Camera est utilisé pour afficher un flux vidéo à partir d’une caméra Axis ou d’une caméra USB sur le robot. Pour obtenir des instructions sur la configuration de la caméra Axis pour fonctionner avec cet écran voir :ref:`ici <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>`. Il existe aussi quelques contrôles et indicateurs liés à la caméra sous la zone onglet:

source: The Custom tab allows you to add additional controls/indicators to the dashboard using LabVIEW without removing any existing functionality. To customize this tab you will need to create a Dashboard project in LabVIEW.
es_mx: La pestaña Custom le permite agregar controles /indicadores adicionales a la dashboard usando LabVIEW sin quitar ninguna función ya existente. Para personalizar esta pestaña usted necesitará crear un proyecto Dashboard en LabVIEW.
fr_ca: L’onglet Custom vous permet, en vous servant de LabVIEW, de d’ajouter des contrôles/indicateurs supplémentaires au tableau de bord sans supprimer aucune des fonctionnalités déjà existantes. Pour personnaliser cet onglet, vous devez créer un projet Dashboard dans LabVIEW.

source: The Test tab is for use with Test mode for teams using LabVIEW (Java and C++ teams should use SmartDashboard or Shuffleboard when using Test Mode). For many items in the libraries, Input/Output info will be populated here automatically. All items which have ** next to them are outputs that can be controlled by the dashboard. To control an output, click on it to select it, drag the slider to set the value then press and hold the green button to enable the output. As soon as the green button is released, the output will be disabled. This tab can also be used to run and monitor tests on the robot. An example test is provided in the LabVIEW framework. Selecting this test from the dropdown box will show the status of the test in place of the slider and enable controls.
es_mx: La pestaña Test es para usar junto el Test mode para equipos que usan LabVIEW (equipos que usen Java y C++ deben usar la SmartDashboard o la Shuffleboard al usar el Test mode). Para muchos objetos en la librería, información de salida y entrada será llenada automáticamente aquí. Todos los objetos que tengan ** a un lado de ellos es información de salida que puede controlarse por la dashboard. Para controlarlo, de click en el para seleccionarlo, arrastre la barra para establecer el valor, después presione el botón verde y mantengalo presionado para habilitar la información de salida. Tan pronto usted suelte el botón verde, la información de salida se habilitará. Esta pestaña también se puede usarse para ejecutar un programa de prueba y monitorearlo. El marco de trabajo de LabVIEW proporciona un programa de prueba. Seleccionar este programa del menú mostrara el estatus del programa de prueba en el lugar de la barra de desplazamiento y habilita los controles.
fr_ca: L’onglet Test est utilisé avec le mode Test par les équipes utilisant LabVIEW (les équipes Java et C++ doivent utiliser SmartDashboard ou Shuffleboard pour l’utilisation du mode Test). Pour de nombreuses fonctionnalités définies dans les bibliothèques, les informations d’entrée/sortie s'insèrent automatiquement. Tous les éléments sont marqués par** correspondent à des sorties et peuvent être contrôlées par Dashboard. Pour contrôler une sortie, cliquez dessus pour la sélectionner, faites glisser le curseur pour définir la valeur, puis appuyez sur et maintenez le bouton vert pour activer la sortie. Dès que le bouton vert est relâché, la sortie sera désactivée. Cet onglet peut également être utilisé pour exécuter et suivre les tests sur le robot. Un exemple de test est fourni dans la plateforme LabVIEW. En sélectionnant ce test à partir de la zone déroulante, on affichera l’état du test à la place du curseur et activera les contrôles.

source: The Commands tab can be used with the Robot in Test mode to see which commands are running and to manually run commands for test purposes.
es_mx: La pestaña de Commands puede ser usada con el Robot en Test mode para ver que comandos se están ejecutando y para manualmente ejecutar comandos para probarlos.
fr_ca: L’onglet Commands peut être utilisé avec le robot en mode Test pour voir quelles commandes sont en cours d’exécution et pour exécuter manuellement des commandes à des fins de test.

source: The Checklist tab can be used by teams to create a list of tasks to perform before or between matches. Instructions for using the Checklist tab are pre-populated in the default checklist file.
es_mx: La pestaña de Checklist puede ser usada por los equipos para crear una lista de tareas a realizar antes o entre partidos. Indicaciones para usar la pestaña de Checklist son pre-llenadas en el archivo predeterminado de lista de tareas.
fr_ca: L’onglet Checklist peut être utilisé pour créer une liste de tâches à effectuer avant ou entre les matchs. Les instructions pour l’utilisation de cet onglet sont déjà écrites dans le fichier de liste de contrôle par défaut.

source: The Variables tab of the left pane shows all Network Tables variables in a tree display. The Variable Name (Key), Value and data type are shown for each variable. Information about the Network Tables bandwidth usage is also displayed in this tab. Entries will be shown with black diamonds if they are not currently synced with the robot.
es_mx: La pestaña de Variables en el panel izquierdo muestra todas las variables de Network Tables en una visualización ramificada. El nombre de las variable (Key), valor y tipo de dato de cada variable. Información sobre el ancho de banda del uso de Network Tables también se muestra en esta pestaña. Entradas se mostrarán con diamantes negros si no están sincronizados con el robot.
fr_ca: L’onglet Variables du volet gauche affiche toutes les variables des Network Tables sous la forme d'une arborescence. Le nom de la variable (clé), la valeur et le type de données sont affichés pour chaque variable. Des informations sur l’utilisation de la bande passante des Network Tables s’affichent également dans cet onglet. Les entrées s’affichent avec des diamants noirs si elles ne sont pas actuellement synchronisées avec le robot.

source: Record/Playback
fr_ca: Enregistrement/Lecture

source: The LabVIEW Dashboard includes a Record/Playback feature that allows you to record video and Network Tables data (such as the state of your Dashboard indicators) and play it back later.
es_mx: La LabVIEW Dashboard incluye una función llamada Record/Playback que le permite grabar video y datos de Network Tables (como el estado de los indicadores de su Dashboard) y repetirlo mas tarde.
fr_ca: Dashboard de LabVIEW comprend une fonction Enregistrement/Lecture qui vous permet d’enregistrer des données vidéo et des Network Tables (telles que l’état de vos indicateurs Dashboard ) et de les lire ultérieurement.

source: Recording
es_mx: Grabar
fr_ca: Enregistrement
