Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station-best-practices.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Driver Station Best Practices
fr_ca: Meilleures pratiques avec Driver Station
tr_tr: En iyi Driver Station pratikleri
zh_cn: Driver Station 葵花宝典

source: This document was created by Steve Peterson, with contributions from Juan Chong, James Cole-Henry, Rick Kosbab, Greg McKaskle, Chris Picone, Chris Roadfeldt, Joe Ross, and Ryan Sjostrand. The original post and follow-up posts can be found `here <https://www.chiefdelphi.com/t/paper-driver-station-best-practices/164429>`__
fr_ca: Ce document a été créé par Steve Peterson, avec les contributions de Juan Chong, James Cole-Henry, Rick Kosbab, Greg McKaskle, Chris Picone, Chris Roadfeldt, Joe Ross, et Ryan Sjostrand. La publication originale et les suivis de celle-ci peuvent être retrouvés `ici <https://www.chiefdelphi.com/t/paper-driver-station-best-practices/164429>`__
tr_tr: Bu belge, Juan Chong, James Cole-Henry, Rick Kosbab, Greg McKaskle, Chris Picone, Chris Roadfeldt, Joe Ross ve Ryan Sjostrand'ın katkılarıyla Steve Peterson tarafından oluşturuldu. Orijinal gönderi ve takip gönderileri şu adresten bulunabilir : <https://www.chiefdelphi.com/t/paper-driver-station-best-practices/164429> "__

source: Want to ensure the driver station isn't a stopper for your team at the FIRST Robotics Competition (FRC) field? Building and configuring a solid driver station laptop is an easy project for the time between stop build day and your competition. Read on to find lessons learned by many teams over thousands of matches.
es_mx: ¿Quiere asegurarse de que la driver station no sea un obstáculo para su equipo en el campo de FIRST Robotics Competition (FRC)? Construir y configurar una laptop sólida para la driver station es un proyecto fácil gracias a el tiempo entre el stop build day y el día de su competencia. Siga leyendo para encontrar lecciones aprendidas por muchos equipos en más de miles de partidos.
fr_ca: Le poste de pilotage ne doit pas constituer un embêtement pour votre équipe sur le terrain de la Compétition de robotique FIRST (FRC). Construire une console solide et y configurer un ordinateur portable stable est un projet facile à réaliser avant la compétition. Lisez la suite pour découvrir les leçons apprises par de nombreuses équipes ayant disputé des milliers de matchs.
tr_tr: Driver Station'u FIRST Robotik Yarışması (FRC) sahasındaki takımınız için bir engel olmadığından emin olmak ister misiniz? Sağlam bir Driver Station dizüstü bilgisayarı oluşturmak ve yapılandırmak, son yapım günü ile yarışmanız arasındaki süre için kolay bir projedir. Binlerce maçta birçok takım tarafından öğrenilen dersleri bulmak için okumaya devam edin.
zh_cn: 是否想确保 Driver Station 不是您在FIRST机器人大赛（FRC）比赛中的拦路虎？在停止搭建日与竞争之间的这段时间内，搭建和配置可靠的 Driver Station 笔记本电脑是一个简单的项目。继续阅读以查找许多团队在数千场比赛中吸取的教训。

source: Prior To Departing For The Competition
es_mx: Antes De Partir A La Competencia
fr_ca: Avant le départ pour la compétition
tr_tr: Yarışmaya Gitmeden Önce
zh_cn: 出发参加比赛之前

source: Dedicate a laptop to be used solely as a driver station. Many teams do. A dedicated machine allows you manage the configuration for one goal – being ready to compete at the field. Dedicated means no other software except the FRC-provided Driver Station software and associated Dashboard installed or running.
es_mx: Dedique una laptop para ser usada solamente como una driver station. Varios equipos lo hacen. Una máquina dedicada permite que maneje la configuración para una meta - estar listos para competir en la cancha. Dedicada significa ningún otro software excepto el FRC - provided Driver Station software y Dashboard asociado instalado o en ejecución.
fr_ca: Dédiez un ordinateur portable à utiliser uniquement comme station de pilotage. Beaucoup d’équipes le font. Un portable dédié vous permet de gérer sa configuration pour un seul objectif: être prêt à jouer votre match sur le terrain. Dédié signifie qu’aucun autre logiciel, à l’exception du logiciel Driver Station fourni par FRC et Dashboard, seront installés et en cours d'exécution.
tr_tr: Yalnızca Driver Station olarak kullanılacak bir dizüstü bilgisayar ayırın. Birçok takım bunu yapar. Özel bir makine, konfigürasyonu tek bir amaç için yönetmenize olanak tanır - sahada rekabet etmeye hazır olmak. Adanmış, FRC tarafından sağlanan Driver Station yazılımı ve kurulu veya çalışan ilişkili Dashboard dışında başka hiçbir yazılım olmadığı anlamına gelir.
zh_cn: 专门将笔记本电脑仅用作 Driver Station。许多团队都这样做。一台专用机器可让您管理目标的配置 – 准备好在现场比赛。“专用”表示除安装或正在运行的FRC提供的Driver Station软件和关联的 Dashboard 外，没有其他软件。

source: Use a business-class laptop for your driver station. Why? They're much more durable than the $300 Black Friday special at Best Buy. They'll survive being banged around at the competition. Business-class laptops have higher quality device drivers, and the drivers are maintained for a longer period than consumer laptops. This makes your investment last longer. Lenovo ThinkPad T series and Dell Latitude are two popular business-class brands you'll commonly see at competitions. There are thousands for sale every day on eBay. The laptop provided in recent rookie kits is a good entry level machine. Teams often graduate from it to bigger displays as they do more with vision and dashboards.
es_mx: Use una laptop bussines-class para su driver station. ¿Por qué? Son mucho más duraderas que las de $300 USD en precio especial en Black Friday en Best Buy. Sobrevivirán los golpes de la competencia. Las laptops de bussines-class, tienen controladores de dispositivos de una mejor calidad y los controladores se mantienen por un periodo más largo que las laptops de consumo. Esto hace que su inversión dure más. Lenovo ThinkPad T series y Dell Latitude son dos marcas bussines-class populares que verá en las competencias. Hay miles de ofertas diariamente en eBay. Las laptops proporcionadas por los rookie kits recientes, es una buena máquina de nivel de entrada. Los equipos con frecuencia se gradúan en pantallas más grandes a medida que hacen más con la visión y dashboards.
fr_ca: Utilisez un ordinateur portable de classe affaires pour votre poste de pilotage. Pourquoi? Ils sont beaucoup plus durables que les aubaines Black Friday à 300 $ chez Best Buy. Ils survivront à la compétition. Les ordinateurs portables de classe affaires ont des pilotes de périphérique de meilleure qualité et ces pilotes seront supportés plus longtemps par les manufacturiers que ceux trouvés dans les ordinateurs portables grand public. Cela prolonge la durée de votre investissement. Les séries Lenovo ThinkPad T et Dell Latitude sont deux marques de classe affaires populaires que vous verrez souvent en tournoi. Il y en a des milliers en vente chaque jour sur eBay. L'ordinateur portable fourni dans le kit de pièces des équipes recrues est une bonne machine d'entrée de gamme. Les équipes font le saut vers des écrans plus grands, car ils sont plus pratiques avec la vision et les tableaux de bord.
tr_tr: Driver Station için iş sınıfı bir dizüstü bilgisayar kullanın. Neden? Çünkü Best Buy'daki 300 $ 'lık Black Friday özel etkinliğinden çok daha dayanıklı olası gerekir. Bu bilgisayar yarışmada zor şartlarda çalışacaktır. İşletme sınıfı dizüstü bilgisayarlar daha kaliteli aygıt sürücülerine sahiptir ve sürücüler tüketici dizüstü bilgisayarlarından daha uzun süre korunur. Bu, yatırımınızın daha uzun ömürlü olmasını sağlar. Lenovo ThinkPad T serisi ve Dell Latitude, yarışmalarda sıkça göreceğiniz iki popüler işletme sınıfı markadır. EBay'de her gün binlerce satış var. Yeni çaylak kitlerinde sağlanan dizüstü bilgisayar, giriş seviyesi için iyi bir makinedir. Takımlar, görüş ve gösterge tablolarıyla daha fazlasını yaptıkça genellikle ondan daha büyük ekranlara geçiş yapar.
zh_cn: 在您的Driver Station使用商务级笔记本电脑。为什么？它们比Best Buy买的$ 300黑色星期五特别款更加耐用。他们将在比赛碰撞中存活下来。商业级笔记本电脑具有更高质量的设备驱动程序，并且与消费类笔记本电脑相比，驱动程序的维护时间更长。这使您的投资持续更长时间。联想ThinkPad T系列和Dell Latitude是您在竞赛中经常看到的两个受欢迎的商务级品牌。 eBay上每天都有成千上万的待售商品。rookie kit中提供的笔记本电脑是入门级机器。团队通常会升级到更大的显示器，因为他们通过视觉和Dashboard来做更多的事情。

source: Laptop recommended features
es_mx: Características recomendadas para una laptop
fr_ca: Caractéristiques recommandées pour l’ordinateur portable
tr_tr: Dizüstü bilgisayarda önerilen özellikler
zh_cn: 笔记本推荐性能

source: RAM -- 2GB of RAM is minimum, if you have a SSD.
fr_ca: RAM -- 2 Go de RAM est le minimum, si vous avez un disque SSD
tr_tr: RAM - SSD'niz varsa minimum 2 GB RAM'dir.

source: A display size of 13" or greater, with minimum resolution of 1440x1050.
es_mx: Un monitor de 13” o mayor, con un mínimo de resolución de 1440x1050.
fr_ca: Une taille d’affichage de 13 po ou plus, avec une résolution minimale de 1440x1050.
tr_tr: Minimum 1440x1050 çözünürlükle 13 "veya daha büyük bir ekran boyutu.
zh_cn: 显示尺寸为13英寸或更大，最低分辨率为1440x1050。

source: A built-in Ethernet port is highly preferred. Ensure that it's a full-sized port. The hinged Ethernet ports don't hold up to repeated use.
es_mx: Un puerto incorporado de Ethernet es altamente preferido. Asegúrese de que sea un puerto de tamaño completo. Los puertos de Ethernet con bisagras no soportan el uso repetido.
fr_ca: Un port Ethernet intégré est très recommandé. Assurez-vous qu’il s’agit d’un port de pleine grandeur. Les ports Ethernet articulés ne tiennent pas quand ils sont trop souvent utilisés.
tr_tr: Yerleşik bir Ethernet bağlantı noktası çok tercih edilir. Tam boyutlu bir bağlantı noktası olduğundan emin olun. Menteşeli Ethernet bağlantı noktaları, tekrar tekrar kullanıma dayanmaz.
zh_cn: 内置以太网端口是首选。确保它是标准端口。铰接式以太网端口不能承受重复使用。

source: Use an Ethernet port saver to make your Ethernet connection. This extends the life of the port on the laptop. This is particularly important if you have a consumer-grade laptop with a hinged Ethernet port.
es_mx: Use un protector de puerto de Ethernet para hacer su conexión Ethernet. Esto extiende la vida del puerto Ethernet de su laptop. Esto es particularmente importante si tiene una laptop de grado de consumidor con un puerto de Ethernet con bisagra.
fr_ca: Utilisez un protecteur de port Ethernet pour créer votre connexion Ethernet. Il s'agit d'une petite extension Ethernet que vous laissez habituellement connectée sur l’ordinateur. Cela prolonge la durée de vie du port sur l’ordinateur portable. Ceci est particulièrement important si vous avez un ordinateur portable grand public avec un port Ethernet articulé.
tr_tr: Ethernet bağlantınızı yapmak için bir Ethernet bağlantı noktası koruyucusu kullanın. Bu, dizüstü bilgisayardaki bağlantı noktasının ömrünü uzatır. Menteşeli Ethernet bağlantı noktasına sahip tüketici sınıfı bir dizüstü bilgisayarınız varsa, bu özellikle önemlidir.
zh_cn: 使用以太网端口保护程序进行以太网连接。这样可以延长笔记本电脑上端口的寿命。如果您有一台带有铰接式以太网端口的消费级笔记本电脑，这尤其重要。

source: If the Ethernet port on your laptop is dodgy, either replace the laptop (recommended) or buy a USB Ethernet dongle from a reputable brand. Many teams find that USB Ethernet is less reliable than built-in Ethernet, primarily due to cheap hardware and bad drivers. The dongles given to rookies in the KOP have a reputation for working well.
es_mx: Si el puerto de Ethernet de su laptop es dudoso, ya sea que reemplace su laptop (recomendado) o compre un Ethernet USB dongle de alguna marca reconocida. Varios equipos encuentran que el Ethernet USB es menos confiable que el Ethernet incorporado, principalmente, debido al hardware barato y malos controladores. Los dongles que se les dan a los rookies en su KOP tienen una reputación de trabajar bien.
fr_ca: Si le port Ethernet de votre ordinateur portable est douteux, remplacez l’ordinateur portable (recommandé) ou achetez un adaptateur Ethernet USB d’une marque réputée. Beaucoup d’équipes trouvent qu'un adaptateur Ethernet USB est moins fiable que le port Ethernet intégré, principalement en raison de matériel de mauvaise qualité et de mauvais pilotes. Les adaptateurs donnés aux recrues dans le kit de pièces ont la réputation de bien fonctionner.
tr_tr: Dizüstü bilgisayarınızdaki Ethernet bağlantı noktası tehlikeli ise ya dizüstü bilgisayarınızı değiştirin (önerilir) ya da tanınmış bir markadan bir USB Ethernet dongle satın alın. Çoğu ekip, öncelikle ucuz donanım ve kötü sürücüler nedeniyle USB Ethernet'in yerleşik Ethernet'ten daha az güvenilir olduğunu fark eder. KOP'ta çaylaklara verilen dongle'lar iyi çalışma konusunda bir üne sahiptir.
zh_cn: 如果您的笔记本电脑上的以太网端口不可靠，请更换笔记本电脑（推荐过的）或从知名品牌处购买USB以太网加密狗。许多团队发现USB以太网不如内置以太网可靠，这主要是由于廉价的硬件和不良的驱动程序。在KOP中，给新手使用的加密狗因运作良好而享有盛誉。

source: 2 USB ports minimum
es_mx: 2 puertos USB mínimo
fr_ca: 2 ports USB minimum
tr_tr: Minimum 2 USB bağlantı noktası
zh_cn: 最少2个USB端口

source: A keyboard. It’s hard to quickly do troubleshooting on touch-only computers at the field.
es_mx: Un teclado. Es difícil solucionar rápidamente los problemas de las computadoras táctiles en la cancha.
fr_ca: Un clavier. Il est difficile de faire rapidement du dépannage sur le terrain sur les ordinateurs uniquement tactiles.
tr_tr: Klavye. Sahadaki yalnızca dokunmatik bilgisayarlarda hızlı bir şekilde sorun gidermek zordur.
zh_cn: 键盘。很难在现场对仅触屏笔记本进行故障排除。

source: A solid-state disk (SSD). If the laptop has a rotating disk, spend $50 and replace it with a SSD.
es_mx: Una unidad de estado sólido (SSD). Si la laptop tiene un disco giratorio, gaste $50 USD y remplácelo con un SSD.
fr_ca: Un disque électronique (SSD). Si l’ordinateur portable a un disque rotatif, dépensez 50 $ et remplacez-le par un SSD.
tr_tr: Solid disk (SSD). Dizüstü bilgisayarın dönen bir diski varsa, 50 $ harcayın ve bir SSD ile değiştirin.
zh_cn: 固态磁盘（SSD）。如果笔记本电脑有机械硬盘，请花费50美元并用SSD替换它。

source: Updated to the current release of Windows 10. Being the most common OS now seen at competitions, bugs are more likely to be found and fixed for Windows 10 than on older Windows versions.
fr_ca: Mis à jour à la version actuelle de Windows 10. Étant le système d’exploitation le plus commun en tournoi, les bogues sont plus susceptibles d’être trouvés et corrigés rapidement sur Windows 10 que sur les anciennes versions de Windows.

source: Install all Windows updates a week before the competition. This allows you time to ensure the updates will not interfere with driver station functions. To do so, open the Windows Update settings page and see that you're up-to-date. Install pending updates if not. Reboot and check again to make sure you’re up to date.
es_mx: Instale todas las actualizaciones de Windows una semana antes de la competencia. Esto le permite asegurarse con tiempo que las actualizaciones no interferirán en las funciones de la driver station. Para hacerlo, abra la página de ajustes de las actualizaciones de Windows y compruebe que esté actualizado. Instale las actualizaciones pendientes si es que tiene. Reinicie y revise de nuevo para asegurarse de que esté actualizado.
fr_ca: Installez toutes les mises à jour Windows une semaine avant la compétition. Cela vous donne le temps de vous assurer que les mises à jour n’interféreront pas avec les fonctions du Driver Station. Pour ce faire, ouvrez la page Paramètres de Windows Update et voyez si vous êtes à jour. Si vous ne l'êtes pas, installez les mises à jour en attente. Redémarrez et vérifiez à nouveau pour vous assurer que vous êtes à jour.
tr_tr: Yarışmadan bir hafta önce tüm Windows güncellemelerini yükleyin. Bu, güncellemelerin Driver Station işlevlerini etkilememesini sağlamak için size zaman tanır. Bunu yapmak için Windows Update ayarları sayfasını açın ve güncel olduğunuzu görün. Değilse bekleyen güncellemeleri yükleyin. Güncel olduğunuzdan emin olmak için yeniden başlatın ve tekrar kontrol edin.
zh_cn: 比赛前一周安装所有Windows更新。这使您有时间确保更新不会干扰驱动程序站功能。为此，请打开Windows Update设置页面，然后查看您是否是最新的。如果没有，请安装挂起的更新。重新启动并再次检查以确保您是最新的。

source: Change "Active Hours" for Windows Updates to prevent updates from installing during competition hours. Navigate to Start -> Settings -> Update & Security -> Windows Update, then select Change active hours. If you’re traveling to a competition, take time zone differences into account. This will help ensure your driver station does not reboot or fail due to update installing on the field.
es_mx: Cambie “Active hours” de las actualizaciones de Windows para qprevenir que se instalen las actualizaciones durante las horas de la competencia. Navegue a Start -> Settings -> Update & Security -> Windows Update, después seleccione Change active hours. Si está viajando para una competencia tome en Cuenta las diferencias de la zona horaria. Esto le ayuda a asegurarse a que su driver station no se reinicie o falle debido a la instalación de una actualización en la cancha.
fr_ca: Modifiez les "heures d'activité" pour les mises à jour Windows pour empêcher les mises à jour d’être installées pendant les heures de compétition. Accédez à Start -> Settings -> Update & Security -> Windows Update, puis sélectionnez Change active hours. Si vous voyagez à une compétition, prenez en compte les différences de fuseau horaire. Cela vous permettra de vous assurer que votre station de pilotage ne redémarre pas ou n'arrête pas de fonctionner en raison de l'installation d'une mise à jour sur place.
tr_tr: Güncellemelerin yarışma saatleri sırasında yüklenmesini önlemek için Windows Güncellemeleri için "Etkin Saatleri" değiştirin. Başlat -> Ayarlar -> Güncelleme ve Güvenlik -> Windows Güncelleme'ye gidin, ardından Etkin saatleri değiştir'i seçin. Bir yarışmaya seyahat ediyorsanız, saat dilimi farklılıklarını dikkate alın. Bu, sahada güncelleme yüklenmesi nedeniyle sürücü istasyonunuzun yeniden başlatılmamasını veya başarısız olmamasını sağlamaya yardımcı olacaktır.
zh_cn: 更改Windows更新的“更新时间”，以防止在比赛时间安装更新。导航到“开始”->“设置”->“更新和安全性”->“ Windows Update”，然后选择“更改更新时间”。如果您要参加比赛，请考虑时区差异。这将有助于确保您的驱动程序站不会由于在现场安装更新而重启或失败。

source: Remove any 3rd party antivirus or antimalware software. Instead, use Windows Defender on Windows 10. Since you're only connecting to the internet for Windows and FRC software updating, the risk is low. Only install software on your driver station that's needed for driving. Your goal here is to eliminate variables that might interfere with proper operation. Remove any unneeded preinstalled software ("bloatware") that came with the machine. Don't use the laptop as your Steam machine for gaming back at the hotel the night before the event. Many teams go as far as having a separate programming laptop.
fr_ca: Supprimez tout logiciel antivirus ou antimalware tiers. Utilisez plutôt Windows Defender sur Windows 10. Puisque vous vous connectez uniquement à Internet pour la mise à jour des logiciels Windows et FRC, le risque est faible. Installez uniquement les logiciels nécessaires au pilotage du robot. Votre but ici est d’éliminer les variables qui pourraient interférer avec le bon fonctionnement. Supprimez tout logiciel préinstallé inutile ("bloatware") qui est venu avec la machine. N’utilisez pas l’ordinateur portable pour jouer à des jeux à l’hôtel la veille de l’événement. Beaucoup d’équipes ont un ordinateur portable de programmation séparé.

source: Avoid managed Windows 10 installations from the school's IT department. These deployments are built for the school environment and often come with unwanted software that interferes with your robot's operation.
fr_ca: Évitez les installations Windows 10 gérées par le département informatique de l’école. Ces déploiements sont conçus pour l’environnement scolaire et viennent souvent avec des logiciels indésirables qui interfèrent avec le fonctionnement de votre robot.

source: Laptop battery / power
es_mx: Batería/energía de la laptop
fr_ca: Batterie d’ordinateur portable / alimentation
tr_tr: Dizüstü bilgisayar pili / gücü
zh_cn: 笔记本电池/电源

source: Turn off Put the computer to sleep in your power plan for both battery and powered operation.
es_mx: Apague Ponga la computadora en suspender en su plan de energía para la batería y la alimentación de la operación.
fr_ca: Désactivez l'option "mettre le PC en veille" pour le mode batterie et le mode branché dans vos paramètres d'alimentation et veille.
tr_tr: Bilgisayarı kapatın hem pille hem de elektrikli çalıştırmak için güç planınızda uyku moduna alın.
zh_cn: 在你的电源计划中，在“用电池”和“接通电源”中关闭“使计算机进入睡眠”

source: Turn off USB Selective Suspend:
es_mx: Apague el USB Selective Suspend:
fr_ca: Désactiver la suspension sélective USB :
tr_tr: USB Seçmeli Askıya Almayı kapatın:
zh_cn: 关闭USB选择性暂停：

source: Right click on the battery/charging icon in the tray, then select Power Options.
es_mx: Dé clic derecho en el icono de batería/carga en la bandeja, después seleccione Power Options.
fr_ca: Cliquez avec le bouton droit sur l’icône batterie/charge dans la barre des tâches, puis sélectionnez Options d’alimentation.
tr_tr: Tepsideki pil / şarj simgesine sağ tıklayın, ardından Güç Seçenekleri'ni seçin.
zh_cn: 右键单击工具栏的电池图标，然后选择“电源选项”。

source: Edit the plan settings of your power plan.
es_mx: Edite el plan de ajustes de su plan de energía.
fr_ca: Choisissez un des modes de gestion de l'alimentation.
tr_tr: Güç planınızın plan ayarlarını düzenleyin.
zh_cn: 电源计划中“更改计划设置”

source: Click the Change advanced power settings link.
es_mx: Dé clic en el enlace de Cambiar la configuración avanzada de energía.
fr_ca: Dans le menu de gauche, cliquez sur Choisir quand éteindre l'écran. Ensuite, cliquez sur Modifier les paramètres d'alimentation avancés.
tr_tr: Gelişmiş güç ayarlarını değiştir bağlantısını tıklayın.
zh_cn: 点击“更改高级电源设置”

source: Scroll down in the advanced settings and disable the USB selective suspend setting for both Battery and Plugged in.
es_mx: Desplácese hacia abajo en las configuraciones avanzadas y deshabilite la suspensión selectiva de configuración de USB para batería y enchufe.
fr_ca: Faites défiler vers le bas dans les paramètres avancés et désactivez le paramètre de suspension sélective USB pour batterie et branché.
tr_tr: Gelişmiş ayarlarda aşağı kaydırın ve hem Pil hem de Takılı için USB seçmeli askıya alma ayarını devre dışı bırakın.
zh_cn: 在“高级电源设置”中向下滚动，并分别禁用在“使用电池”和“插入电源”情况下“USB选择性暂停”

source: Ensure the laptop battery can hold a charge for at least an hour after making the changes above. This allows plenty of time for the robot and drive team to go through the queue and reach the alliance station without mains power.
es_mx: Asegúrese de que la batería de la laptop pueda mantener una carga de al menos una hora después de hacer los cambios de arriba. Esto permite bastante tiempo para que el robot y el drive team puedan pasar por el queue y llegar a la estación de la alianza sin red eléctrica.
fr_ca: Assurez-vous que la batterie de l’ordinateur portable peut contenir une charge pendant au moins une heure après avoir fait les changements ci-dessus. Cela laisse beaucoup de temps pour le robot et l’équipe de pilotage de passer par la file d’attente et d’atteindre la station d’alliance sans être branché.
tr_tr: Yukarıdaki değişiklikleri yaptıktan sonra dizüstü bilgisayar pilinin en az bir saat şarj edilebildiğinden emin olun. Bu, robotun ve sürücü ekibinin kuyruktan geçmesi ve şebeke gücü olmadan ittifak istasyonuna ulaşması için bolca zaman sağlar.
zh_cn: 进行上面的更改后，请确保笔记本电脑电池至少可以续航一个小时。这样，机器人和drive team就可以在没有电源的情况下有足够的时间穿过队列到达联盟站。

source: Bring a trusted USB and Ethernet cable for use connecting to the roboRIO.
es_mx: Traiga una USB y un cable de Ethernet confiable para su uso conectando a la roboRIO.
fr_ca: Apportez un câble USB et Ethernet de confiance pour la connexion au roboRIO.
tr_tr: RoboRIO'ya bağlanmak için güvenilir bir USB ve Ethernet kablosu getirin.
zh_cn: 带上可靠的USB转以太网线以用于连接到roboRIO。
