Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station-best-practices.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Add retention/strain relief to prevent your joystick/gamepad controllers from falling on the floor and/or yanking on the USB ports. This helps prevent issues with intermittent controller connections.
es_mx: Agregue retención / alivio de tensión para prevenir que sus joystick / controladores de gamepad de caer al suelo y/o tirar de los puertos USB. Esta ayuda previene problemas con las conexiones intermitentes a los controladores.
fr_ca: Ajoutez un dispositif de rétention, ou qui limite la traction sur les fils de vos manettes / contrôleurs pour les empêcher de tomber au sol ou se déconnecter des ports USB. Cela permet d'éviter les problèmes de connexions intermittentes de contrôleur.
tr_tr: Joystick / oyun kumandası denetleyicilerinizin yere düşmesini ve / veya USB bağlantı noktalarına kaymasını önlemek için tutma / gerilim azaltma ekleyin. Bu, kesintili denetleyici bağlantılarıyla ilgili sorunları önlemeye yardımcı olur.
zh_cn: 增加保持力/应力释放，以防止游戏杆/游戏手柄控制器掉落在地板上和/扯到USB端口。这有助于防止控制器连接出现间歇性问题。

source: The Windows user account you use to drive must be a member of the Administrator group.
es_mx: La cuenta de usuario de Windows que se utiliza para manejar, debe de ser un miembro del grupo administrador.
fr_ca: Le compte d’utilisateur Windows que vous utilisez pour piloter doit faire partie du groupe Administrateur.
tr_tr: Sürmek için kullandığınız Windows kullanıcı hesabı, Yönetici grubunun bir üyesi olmalıdır.
zh_cn: 您的Windows用户账户必须是Administrator账户。

source: At The Competition
es_mx: En La Competencia
fr_ca: En tournoi
tr_tr: Yarışmada
zh_cn: 赛场时

source: Turn off Windows firewall using these instructions.
fr_ca: Désactivez le pare-feu Windows à l’aide de ces instructions.
tr_tr: Bu talimatları kullanarak Windows güvenlik duvarını kapatın.

source: Turn off the Wi-Fi adapter, either using the dedicated hardware Wi-Fi switch or by disabling it in the Adapter Settings control panel.
es_mx: Apague el adaptador del Wi-Fi, ya sea utilizando el conmutador de Wi-Fi de hardware dedicado o deshabilitándolo en el panel de control de Adapter Settings.
fr_ca: Désactivez l’adaptateur Wi-Fi, soit à l’aide du bouton Wi-Fi physique, soit en le désactivant dans le panneau de configuration dans les Paramètres de l’adaptateur.
tr_tr: Özel donanım Wi-Fi anahtarını kullanarak veya Adaptör Ayarları kontrol panelinden devre dışı bırakarak Wi-Fi adaptörünü kapatın.
zh_cn: 使用专用的硬件Wi-Fi开关或在控制面板中将无线网卡禁用，以关闭Wi-Fi。

source: Charge the driver station when it’s in the pit.
es_mx: Cargue la driver station cuando esté en el pit.
fr_ca: Chargez la station de pilotage quand elle est dans le puits.
tr_tr: Pitteyken sürücü istasyonunu şarj edin.
zh_cn: 在pit区给driver station充电

source: Remove login passwords or ensure everyone on the drive team knows the password. You'd be surprised at how often drivers arrive at the field without knowing the password for the laptop.
es_mx: Remueva todas las contraseñas para iniciar sesión o asegúrese de que todo el drive team conozca la contraseña. Se sorprendería al saber que tan seguido los drivers llegan a la cancha sin saber la contraseña de la laptop.
fr_ca: Supprimez les mots de passe de connexion ou assurez-vous que tous les membres de l’équipe de terrain connaissent le mot de passe. Vous seriez surpris de voir combien de fois les pilotes arrivent sur le terrain sans connaître le mot de passe de l’ordinateur portable.
tr_tr: Oturum açma parolalarını kaldırın veya sürücü ekibindeki herkesin parolayı bildiğinden emin olun. Sürücülerin dizüstü bilgisayarın şifresini bilmeden sahaya ne sıklıkla geldiklerine şaşıracaksınız.
zh_cn: 删除登录密码或确保drive team团队中的每个人都知道密码。您会惊奇地发现操作手不知道笔记本电脑的密码就经常到达现场。

source: Ensure your LabView code is deployed permanently and set to "run as startup", using the instructions in the LabView Tutorial. If you must deploy code every time you turn the robot on, you’re doing it wrong.
es_mx: Asegúrese que su código de LabView se implemente permanentemente y se establece en “run as startup”, usando las instrucciones del Tutorial de LabView. Si debe de implementar el código cada vez que encienda de nuevo el robot, lo está haciendo mal.
fr_ca: Assurez-vous que votre code LabView est déployé en permanence et défini sur "run as startup", en utilisant les instructions du tutoriel LabView. Si vous devez déployer le code chaque fois que vous allumez le robot, quelque chose ne fonctionne pas.
tr_tr: LabView kodunuzun kalıcı olarak dağıtıldığından ve LabView Eğitim Kılavuzundaki talimatları kullanarak "run as startup-başlangıç olarak çalıştır" olarak ayarlandığından emin olun. Robotu her açtığınızda kodu dağıtmanız gerekiyorsa, yanlış yapıyorsunuz demektir.
zh_cn: 使用LabView教程中的说明，确保将LabView代码永久部署并设置为“启动时运行”。如果每次打开机器人时都必须部署代码，那说明您出大问题。

source: Limit web browsing to FRC related web sites. This minimizes the chance of getting malware during the competition.
es_mx: Limítese a buscar en la red en sitios web relacionados con FRC. Esto minimiza la oportunidad de que se obtenga malware durante la competencia.
fr_ca: Limitez la navigation web aux sites web liés à FRC. Cela minimise les chances d’obtenir des logiciels malveillants pendant la compétition.
tr_tr: Web taramasını FRC ile ilgili web siteleriyle sınırlayın. Bu, yarışma sırasında kötü amaçlı yazılım alma olasılığını en aza indirir.
zh_cn: 将网站浏览限制为FRC相关的网站。这样可以最大程度地减少比赛中感染恶意软件的机会。

source: Don't plan on using internet access to do software updates. There likely won't be any in the venue, and hotel Wi-Fi varies widely in quality. If you do need updates, contact a Control System Advisor in the pit.
es_mx: No planee usar acceso a internet para hacer actualizaciones del software. Es probable que no haya ninguno en el lugar y el Wi-Fi del hotel varíe ampliamente en la calidad. Si necesita hacer actualizaciones contacte al Control System Advisor en el pit.
fr_ca: Ne comptez pas utiliser Internet pour effectuer des mises à jour logicielles. Il n'y en aura probablement pas dans la salle et le Wi-Fi de l'hôtel varie considérablement en qualité. Si vous avez besoin de mises à jour, contactez un conseiller en système de contrôle durant la compétition.
tr_tr: Yazılım güncellemeleri yapmak için internet erişimini kullanmayı planlamayın. Mekanda muhtemelen hiç olmayacak ve otel Wi-Fi kalitesi büyük ölçüde farklılık gösteriyor. Güncellemelere ihtiyacınız varsa, pitteki bir Kontrol Sistemi Danışmanı ile iletişime geçin.
zh_cn: 不要计划使用互联网进行软件更新。场地中可能没有Wi-Fi，并且酒店的Wi-Fi的质量差异很大。如果确实需要更新，请与pit区中的Control System Advisor联系。

source: Before Each Match
es_mx: Antes De Cada Partido
fr_ca: Avant chaque match
tr_tr: Her Maçtan Önce
zh_cn: 每场比赛之前

source: Make sure the laptop is on and logged in prior to the end of the match before yours.
es_mx: Asegúrese que la laptop esté encendida y conectada antes del término del partido anterior al suyo.
fr_ca: Assurez-vous que l’ordinateur portable est allumé et connecté sur le bon compte d'utilisateur avant la fin du match avant le vôtre.
tr_tr: Sizin maçınızdan önceki maçın bitiminden önce dizüstü bilgisayarınızın açık olduğundan ve oturum açtığınızdan emin olun.
zh_cn: 请确保笔记本电脑在你上一场之前保持打开和登录

source: Close programs that aren’t needed during the match – e.g., Visual Studio Code or LabView – when you are competing.
es_mx: Cierre los programas que no sean necesarios durante el partido – p. ej., Visual Studio Code o Lab View – cuando esté compitiendo.
fr_ca: Fermez les programmes qui ne sont pas nécessaires pendant le match – par exemple, Visual Studio Code ou LabView – lorsque vous êtes en compétition.
tr_tr: Maç sırasında ihtiyaç duyulmayan programları - örneğin, Visual Studio Code veya LabView - yarışırken ederken kapatın.
zh_cn: 比赛时，关闭比赛中不需要的程序，例如Visual Studio Code或LabView。

source: Bring your laptop charger to the field. Power is provided for you in each player station.
es_mx: Lleve el cargador de su laptop a la cancha. Se proporciona energía en cada player station.
fr_ca: Apportez votre chargeur du portable sur le terrain. Des prises de courant sont fournies dans chaque station.
tr_tr: Dizüstü bilgisayar şarj cihazınızı sahaya getirin. Her oyuncu istasyonunda size güç sağlanır.
zh_cn: 将笔记本电脑充电器带到现场。每个操作区都为您提供电源。

source: Fasten your laptop with hook-and-loop tape to the player station shelf. You never know when your alliance partner will have an autonomous programming issue and blast the wall.
es_mx: Sujete su computadora con cinta hook-and-loop al estante de la player station. Nunca sabrá cuando su equipo de alianza tenga algún problema en la programación en autónomo y golpee la pared.
fr_ca: Attachez votre ordinateur portable avec du ruban velcro sur la tablette de la station de pilotage. Vous ne savez jamais quand votre partenaire d’alliance aura un problème de programmation autonome et que son robot ira frapper le mur de la station de pilotage.
tr_tr: Dizüstü bilgisayarınızı cırt cırtlı bantla oynatıcı istasyonu rafına sabitleyin. İttifak ortağınızın ne zaman otonom bir programlama sorunu yaşayacağını ve duvarı patlatacağını asla bilemezsiniz.
zh_cn: 用魔术贴胶带将笔记本电脑固定在操作站桌子上。您永远不会知道您的联盟合作伙伴何时会遇到自主编程问题并毁于一旦。

source: Ensure joysticks and controllers are assigned to the correct USB ports.
es_mx: Asegúrese que sus joysticks y controladores estén asignados a los puertos USB correctos.
fr_ca: Assurez-vous que les manettes et les contrôleurs sont affectés aux bons ports USB.
tr_tr: Kumanda çubuklarının ve denetleyicilerin doğru USB bağlantı noktalarına atandığından emin olun
zh_cn: 确保将操纵杆和控制器插进正确的USB端口。

source: In the USB tab in the FRC Driver Station software, drag and drop to assign joysticks as needed.
es_mx: En la USB tab en el software de la FRC Driver Station, arrastre y suelte para asignar joysticks como sea necesario.
fr_ca: Dans l’onglet USB du logiciel FRC Driver Station, faites glisser/déposer pour attribuer des manettes au besoin.
tr_tr: FRC Driver Station yazılımındaki USB sekmesinde, gerektiğinde oyun çubukları atamak için sürükleyip bırakın.
zh_cn: 在FRC Driver Station软件的USB选项中，拖放以根据需要分配操纵杆。

source: Use the rescan button (F1) if joysticks / controllers do not appear green
es_mx: Use el botón de reescaneo (F1) si los joysticks / controladores no aparecen el verde.
fr_ca: Utilisez le bouton Rescan (F1) si les manettes/contrôleurs n’apparaissent pas en vert.
tr_tr: Joystickler / denetleyiciler yeşil görünmüyorsa yeniden tarama düğmesini (F1) kullanın
zh_cn: 如果操纵杆/控制器未显示为绿色，请使用重新扫描按钮（F1）

source: Use the rescan button (F1) during competition if joystick or controllers become unplugged and then are plugged back in or otherwise turn gray during competition.
es_mx: Use el botón de reescaneo (F1) durante la competencia si los joysticks o controladores son desconectados y conectados de vuelta o si se vuelve gris durante la competencia.
fr_ca: Utilisez le bouton Rescan (F1) pendant la compétition si les manettes ou les contrôleurs se débranchent et se rebranchent ou apparaissent en gris pendant la compétition.
tr_tr: Yarışma sırasında, oyun çubuğu veya kontrol cihazlarının fişi çekilir ve ardından tekrar takılırsa veya yarışma sırasında gri renge dönerse, yeniden tarama düğmesini (F1) kullanın.
zh_cn: 如果在比赛期间拔下操纵杆或控制器并重新插回电源或者变成灰色，那么使用重新扫描按钮（F1）。

source: Consider used laptops rather than new. The FRC\ |reg| Driver Station and dashboard software uses very few system resources, so you don't need to buy a new laptop -- instead, buy a cheap 4-5 year old used one. You might even get one donated by a used computer store in your area.
es_mx: Considere las laptops usadas en lugar de las nuevas. El FRC \ |reg| El software de la Driver Station y la dashboard utiliza muy pocos recursos del sistema, por lo que no necesita comprar una computadora portátil nueva; en su lugar, compre una usada barata de 4-5 años. Incluso puede obtener una donada por una tienda de computadoras usadas en su área.
tr_tr: Yeni yerine kullanılmış dizüstü bilgisayarları düşünün. FRC\| reg| Driver Station ve kontrol paneli yazılımı çok az sistem kaynağı kullanır, bu nedenle yeni bir dizüstü bilgisayar satın almanıza gerek kalmaz - bunun yerine 4-5 yıllık ucuz bir kullanılmış olanı satın alın. Hatta bölgenizdeki kullanılmış bir bilgisayar mağazasından bağışlanmış bir tane bile alabilirsiniz.
zh_cn: 考虑使用二手笔记本电脑而不是新笔记本电脑。 FRC ® Driver Station和Dashboard软件使用的系统资源很少，因此您不用购买新的笔记本电脑 - 而是购买便宜的4-5岁的二手笔记本电脑。您甚至可能会获得通过您所在地区的二手电脑商店的捐赠。

source: Ports
es_mx: Puertos
tr_tr: Portlar
zh_cn: 接口

source: Updated to the current release of Windows 10 or 11. Being the most common OS now seen at competitions, bugs are more likely to be found and fixed for Windows 10 and 11 than on older Windows versions.
zh_cn: 更新到当前版本的Windows 10或11。作为目前在竞赛中最常见的操作系统，Windows 10和Windows 11比旧版本更容易发现并修复漏洞。

source: Remove any 3rd party antivirus or antimalware software. Instead, use Windows Defender on Windows 10 or 11. Since you're only connecting to the internet for Windows and FRC software updating, the risk is low. Only install software on your driver station that's needed for driving. Your goal here is to eliminate variables that might interfere with proper operation. Remove any unneeded preinstalled software ("bloatware") that came with the machine. Don't use the laptop as your Steam machine for gaming back at the hotel the night before the event. Many teams go as far as having a separate programming laptop.
zh_cn: 删除任何 3rd 方防病毒或反恶意软件。相反，请在 Windows 10 或 11 上使用 Windows Defender。由于您只是为了 Windows 和 FRC 软件更新而连接到 Internet，因此风险很低。仅在您的机器操控台上安装驾驶所需的软件。您的目标是消除可能干扰正常操作的变量。删除机器附带的所有不需要的预装软件（“膨胀软件”）。在活动前一天晚上回到酒店时，不要将笔记本电脑用作 Steam 机器来玩游戏。许多团队甚至拥有单独的编程笔记本电脑。

source: Avoid managed Windows 10 or 11 installations from the school's IT department. These deployments are built for the school environment and often come with unwanted software that interferes with your robot's operation.
zh_cn: 避免学校IT部门管理的Windows 10或11安装。这些部署是为学校环境而建立的，并且经常伴随着干扰机器人操作的不必要的软件。
