Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station-log-viewer.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: A reboot of the robot radio is typically characterized by a loss of connection to the radio for ~40-45 seconds. In this example, the radio briefly lost power at 3:22:44, causing it to start rebooting. The event at 3:22:45 indicates that the ping to the radio failed. At 3:23:11, the DS regains communication with the roboRIO and the roboRIO indicates it has been up for 1272.775 seconds, ruling out a roboRIO reboot. Note that the network switch on the radio comes back up very quickly so a momentary power loss may not result in a "radio lost"/"radio seen" event pair. A longer disturbance may result in radio events being logged by the DS. In that case, the distinguishing factor which points towards a radio reboot is the ping status of the radio from the DS. If the radio resets, the radio will be unreachable. If the issue is a cabling or connection issue on the robot, the radio ping should remain "GOOD".
es_mx: El reinicio del radio del robot se caracteriza por la pérdida de conexión a la radio por 40-45 segundos. En este ejemplo, la radio pierde poder brevemente a las 3:22:44, causando que empiece a reiniciarse .El evento a las 3:22:45 indica que el ping de la radio fallo. A las 3:23:11 la DS vuelve a ganar comunicación con la roboRIO y la roboRIO indica que ha estado funcionando por 1272.775 segundos, descartando un reinicio de la roboRIO. Note que el network switch en la radio regresa arriba rápidamente entonces una pérdida de poder puede que no resulte en el par de eventos “radio lost” /”radio seen”. Una molestia más larga puede que resulte en que los eventos de la radio sean archivados por la DS. En ese caso, el factor distinguido que apunta a un reinicio de la radio es el estatus del ping de la radio de la DS. Si la radio se reinicia, esta será inalcanzable. Si el problema es el cableado o conexión del robot, el ping de la radio debería permanecer en “GOOD”.
fr_ca: Un redémarrage de la radio du robot est généralement caractérisé par une perte de connexion avec la radio pendant environ 40-45 secondes. Dans cet exemple, la radio a brièvement perdu de la puissance à 3:22:44, ce qui l’a conduit à redémarrer. L’événement survenu à 3:22:45 indique que le ping à la radio a échoué. À 3:23:11, DS retrouve la communication avec le roboRIO et le roboRIO indique qu’il a été actif pendant 1272.775 secondes, excluant un redémarrage roboRIO. Notez que l’interrupteur réseau de la radio se rétablit très rapidement de sorte qu’une perte de puissance momentanée peut ne pas entraîner une séquence d’événements "radio lost"/"radio seen". Une perturbation plus longue peut entraîner l’enregistrement d’événements radio par DS. Dans ce cas, le facteur distinctif qui pointe vers un redémarrage radio est l’état ping de la radio dans DS. Si la radio se réinitialise, la radio sera inaccessible. Si le problème est un problème de câblage ou de connexion sur le robot, le ping radio doit demeure "GOOD".
tr_tr: Robot telsizinin yeniden başlatılması, tipik olarak telsizle ~40-45 saniye süreyle bağlantının kesilmesiyle karakterize edilir. Bu örnekte, radyo kısa bir süre 3:22:44 de güç kaybetti ve bu da yeniden başlatılmasına neden oldu. 3:22:45 olay, telsize gelen ping'in başarısız olduğunu gösterir. 3:23:11'de DS, roboRIO ile iletişimi yeniden kazanır ve roboRIO 1272.775 saniyedir açık olduğunu belirtir. Telsizdeki ağ cihazının çok hızlı bir şekilde geri geldiğini unutmayın, bu nedenle anlık bir güç kaybı, "telsizin kaybolması"/"telsizin görülmesi" olay çiftiyle sonuçlanmayabilir. Daha uzun bir bozulma, radyo olaylarının DS tarafından günlüğe kaydedilmesine neden olabilir. Bu durumda, telsizin yeniden başlatılmasına işaret eden ayırt edici faktör, DS'den gelen radyonun ping durumudur. Radyo sıfırlanırsa, telsize ulaşılamaz. Sorun robotta bir kablolama veya bağlantı sorunuysa, radyo pingi "Good" kalmalıdır.
zh_cn: 机器人路由器的重新启动通常特点为40-45秒与无线电的连接断开。 在此示例中，无线电在 3:22:44 短暂断电，导致无线电开始重新启动。3:22:45 的事件表明对 ping 无线电失败。DS在 3:23:11 重新恢复与 roboRIO 的通信，并且 roboRIO 指示其已启动 1272.775 秒，从而排除了 roboRIO 重新启动的情况。请注意，路由器上的网络开关会很快恢复，因此瞬时断电可能不会导致“无线电丢失” 或“看到无线电”两个事件。较长的干扰可能导致DS记录路由器事件。 在这种情况下，指向路由器重新启动的区别因素是路由器与DS的ping状态。 如果路由器重置，则路由器将无法连接。 如果问题是机器人上的网线或连接问题，则路由器 ping 应该保持“良好”状态。
