Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station-labview-dashboard.po
Languages: es_mx, fr_ca

source: To begin recording, click the red circular Record button. The background of the right pane will turn red to indicate you are recording. To stop recording, press the red square Stop button.
es_mx: Para iniciar a grabar, de click en el botón circular rojo. El fondo del panel derecho se volverá roja para indicar que usted esta grabando. Para parar la grabación, presione el botón cuadrado rojo.
fr_ca: Pour commencer un enregistrement, cliquez sur le bouton circulaire rouge Record. L’arrière-plan du volet droit devient rouge pour indiquer que vous enregistrez. Pour arrêter l’enregistrement, appuyez sur le bouton carré rouge Stop.

source: Playback
fr_ca: Lecture

source: To play a recording back, click the green triangle Play button. The background of the right pane will begin pulsing green and playback controls will appear at the bottom of the camera pane.
es_mx: Para reproducir una grabación de nuevo, de click en el triangulo verde - botón Play. El fondo de la sección derecha empezara a mostrarse verde y los controles de la función playback aparecerán al fondo de la ventana de la cámara.
fr_ca: Pour lire un enregistrement, cliquez sur le bouton triangulaire vert Play. L’arrière-plan du volet droit commence à émettre un clignotement vert et les contrôles de lecture apparaissent au bas du volet de la caméra.

source: File Selector - The dropdown allows you to select a log file to play back. The log files are named using the date and time and the dropdown will also indicate the length of the file. Selecting a logfile will immediately begin playing that file.
es_mx: Selector de archivos – El menu le permite seleccionar un archivo para reproducir de nuevo. Los archivos de datos son nombrados usando la fecha y el menú también indicará la longitud del archivo. Al seleccionar un archivo este se empezará a reproducir inmediatamente.
fr_ca: Sélecteur de fichiers - La liste déroulante vous permet de sélectionner un fichier journal pour lecture. La combinaision de la date et l'heure de l'enregistrement sert de nom aux fichiers journaux et la liste déroulante indiquera également la longueur du fichier. La sélection d’un fichier journal lance immédiatement la lecture de ce fichier.

source: Play/Pause button - This button allows you to pause and resume playback of the log file.
es_mx: Botón Inicio/Pausa – Este botón le permite pausar y continuar la reproducción del archivo.
fr_ca: Le bouton Lecture/Pause - Ce bouton vous permet de mettre en pause et de reprendre la lecture du fichier journal.

source: Playback Speed - This dropdown allows you to adjust playback speed from 1/10 speed to 10x speed, the default is real-time (1x)
es_mx: Velocidad de reproducción -Este menu le permite ajustar la velocidad de la reproducción de 1/10 a 10x, la velocidad predeterminada es a tiempo real (1x).
fr_ca: Vitesse de lecture - Cette liste déroulante vous permet d’ajuster la vitesse de lecture de 1/10 vitesse à 10x vitesse, la valeur par défaut est en temps réel (1x)

source: Time Control Slider - This slider allows you to fast-forward or rewind through the logfile by clicking on the desired location or dragging the slider.
es_mx: Barra de tiempo – Esta barra le permite repetir o avanzar/retroceder rápidamente a través del archivo al dar click en la posición que desea o arrastrar el indicador por la línea del tiempo.
fr_ca: Curseur de contrôle de temps - Ce curseur vous permet d'avancer rapidement ou de reculer à travers le fichier journal en cliquant sur l’emplacement souhaité ou en faisant glisser le curseur.

source: Settings - With a log file selected, this dropdown allows you to rename or delete a file or open the folder containing the logs in Windows Explorer (Typically ``C:\Users\Public\Documents\FRC\Log Files\Dashboard``)
es_mx: Ajustes - Con el archivo ya seleccionado, este menu le permite renombrar, eliminar un archivo o abrir una carpeta que contiene los archivos en Windows Explorer (Normalmente en ``C:\Users\Public\Documents\FRC\Log Files\Dashboard``)
fr_ca: Paramètres - Avec un fichier journal sélectionné, cette liste déroulante vous permet de renommer ou de supprimer un fichier ou d’ouvrir le dossier contenant les journaux de l’Explorateur Windows (Typiquement ``C:\Users\Public\Documents\FRC\Log Files\Dashboard``)

source: The Dashboard application installed and launched by the FRC Driver Station is a LabVIEW program designed to provide teams with basic feedback from their robot, with the ability to expand and customize the information to suit their needs. This Dashboard application uses Network Tables and contains a variety of tools that teams may find useful.
es_mx: La aplicación Dashboard instalada e iniciada por la FRC Driver Station es un programa de LabVIEW diseñado para proporcionar retroalimentación básica a equipos sobre su robot, con la habilidad de expandir y personalizar la información según sus necesidades. La aplicación Dashboard usa Network Tables y contiene una variedad de herramientas que pueden ser muy útiles.
