Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station.po
Languages: es_mx, ja

source: This article describes the use and features of the FRC\ |reg| Driver Station Powered by NI LabVIEW.
ja: この記事では、FRC\ |reg| Driver Station Powered by NI LabVIEWの使用方法と機能について説明します。

source: For information on installing the Driver Station software see :ref:`this document <docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools>`.
ja: ドライバーステーションソフトウェアのインストールについては、 :ref:`こちらのドキュメント <docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools>` を参照してください。

source: Starting the FRC Driver Station
es_mx: Empezar la FRC Driver Station
ja: FRCドライバーステーションの起動

source: This is the FRC Driver Station icon.
ja: これはFRCドライバーステーションのアイコンです。

source: The FRC Driver Station can be launched by double-clicking the icon on the Desktop or by selecting Start->All Apps->FRC Driver Station.
ja: FRCドライバーステーションはデスクトップ上のアイコンをダブルクリックするか、「スタート」をクリックしてから「FRC Driver Station」を検索して選択することで起動できます。

source: By default the FRC Driver Station launches the :ref:`LabVIEW Dashboard <docs/software/dashboards/labview-dashboard/driver-station-labview-dashboard:FRC LabVIEW Dashboard>`. It can also be configured on :ref:`docs/software/driverstation/driver-station:Setup Tab` to launch the other Dashboards: :ref:`SmartDashboard <docs/software/dashboards/smartdashboard/smartdashboard-intro:SmartDashboard Introduction>` and :ref:`Shuffleboard <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>`. WPILib must be :ref:`installed <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>` to use SmartDashboard and Shuffleboard.
ja: デフォルトで、ドライバーステーションは :ref:`LabVIEW Dashboard <docs/software/dashboards/labview-dashboard/driver-station-labview-dashboard:FRC LabVIEW Dashboard>` を起動します。また、 :ref:`docs/software/driverstation/driver-station:Setup Tab` で他のダッシュボード（ :ref:`SmartDashboard <docs/software/dashboards/smartdashboard/smartdashboard-intro:SmartDashboard Introduction>` と :ref:`Shuffleboard <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>` ）を起動するように設定することもできます。SmartDashboardあるいはShuffleboardを使うため、WPILibを :ref:`インストールする <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>` 必要があります。

source: Driver Station Key Shortcuts
es_mx: Atajos de teclado de la Driver Station
ja: ドライバーステーションの キーボードショートカット

source: :kbd:`F1` - Force a Joystick refresh.
ja: :kbd:`F1` - ジョイスティックのリフレッシュを強制する。

source: :kbd:`[` + :kbd:`]` + :kbd:`\\` - Enable the robot (the 3 keys above Enter on most keyboards)
ja: :kbd:`[` + :kbd:`]` + :kbd:`\\` - ロボットを有効に(enable)する（ほとんどのキーボードでエンターキーの上にある3つのキー）

source: :kbd:`Enter` - Disable the Robot
ja: :kbd:`Enter` - ロボットを無効に(disable)する

source: :kbd:`Space` - Emergency Stop the robot. After an emergency stop is triggered the roboRIO will need to be rebooted before the robot can be enabled again.
ja: :kbd:`Space` - ロボットを緊急停止します。緊急停止したロボットを再び有効に(enable)するには、roboRIOを再起動する必要があります。

source: Space bar will E-Stop the robot regardless of if the Driver Station window has focus or not
es_mx: La barra espaciadora detendrá al robot independientemente de si la ventana de la Driver Station está enfocado o no.
ja: ドライバーステーション(Driver Station)ウィンドウにフォーカスがあるかどうかに関係なく、スペースバーでロボットを緊急停止します。

source: When connected to :term:`FMS` in a match, teams must press the Team Station E-Stop button to emergency stop their robot as the DS enable/disable and E-Stop key shortcuts are ignored.
ja: 試合中に :term:`FMS` に接続された場合、DS のenable/disableおよび E-Stop キーボードショートカットは無視されるため、チームステーションの E-Stop ボタンを押してロボットを緊急停止させなければなりません。

source: Setting Up the Driver Station
es_mx: Configurar la FRC Driver Station
ja: ドライバーステーションのセットアップ

source: The team number box on the setup (gear) tab.
ja: セットアップ（ギア）タブのチーム番号ボックス。

source: The DS should be set to your team number in order to connect to your robot. In order to do this click the Setup tab then enter your team number in the team number box. Press return or click outside the box for the setting to take effect.
ja: ロボットに接続するためには、DSにチーム番号を設定する必要があります。これを行うには、Setupタブをクリックし、チーム番号ボックスにチーム番号を入力します。リターンキーを押すか、ボックスの外をクリックすると、設定が有効になります。

source: PCs will typically have the correct network settings for the DS to connect to the robot already, but if not, make sure your Network adapter is set to :term:`DHCP`.
ja: PCは通常、DSがロボットに接続するための正しいネットワーク設定をしていますが、そうでない場合は、ネットワークアダプタが :term:`DHCP` に設定されていることを確認してください。

source: Status Pane
ja: ステータス ペイン

source: This is the pane in the center of the Driver station that is always visible.
ja: これはドライバーステーションの中央にあるペインで、常に表示されています。

source: The Status Pane of the Driver Station is located in the center of the display and is always visible regardless of the tab selected. It displays a selection of critical information about the state of the DS and robot:
es_mx: El Status Pane de la Driver Station está localizado en el centro del monitor y siempre está visible independientemente de la pestaña que esté seleccionada. Muestra una selección de información crítica sobre el estado de la DS y el robot:
ja: ドライバーステーションのステータスペインはディスプレイの中央にあり、選択したタブに関係なく常に表示されます。DS とロボットの状態に関する重要な情報が表示されます：

source: Team # - The Team number the DS is currently configured for. This should match your FRC team number. To change the team number see the Setup Tab.
es_mx: Team # – El número del equipo para el cual el DS está configurado actualmente. Esto debería de coincidir con su número de equipo de FRC. Para cambiar el número de equipo vea la pestaña de Setup.
ja: Team # - DSが現在設定されているチーム番号です。FRCのチーム番号と一致する必要があります。チーム番号を変更するには、「Setup」 タブを参照してください。

source: Battery Voltage - If the DS is connected and communicating with the roboRIO this displays current battery voltage as a number and with a small chart of voltage over time in the battery icon. The background of the numeric indicator will turn red when the roboRIO brownout is triggered. See :doc:`/docs/software/roborio-info/roborio-brownouts` for more information.
es_mx: Battery Voltage – Si la DS está conectada y comunicándose con la roboRIO, esta muestra el voltaje de la batería actual como un número con una pequeña tabla del voltaje a lo largo del tiempo en el ícono de la batería. El fondo del indicador numérico se volverá rojo cuando se desencadene un apagón de la roboRIO. Vea :doc:`/docs/software/roborio-info/roborio-brownouts` para más información.
ja: バッテリー電圧 - DSが接続され、roboRIOと通信している場合、現在のバッテリー電圧が数字で表示され、バッテリーアイコンに経時電圧の小さなグラフが表示されます。roboRIOの電圧低下が発生すると、数字表示の背景が赤くなります。詳しくは :doc:`/docs/software/roborio-info/roborio-brownouts` を参照してください。

source: Major Status Indicators - These three indicators display major status items for the DS. The "Communications" indicates whether the DS is currently communicating with the FRC Network Communications Task on the roboRIO (it is split in half for the TCP and UDP communication). The "Robot Code" indicator shows whether the team Robot Code is currently running (determined by whether or not the Driver Station Task in the robot code is updating the battery voltage), The "Joysticks" indicator shows if at least one joystick is plugged in and recognized by the DS.
es_mx: Major Status Indicator – Estos tres indicadores muestran los principales elementos de estado para la DS. “Communications” indica cuando la DS está actualmente comunicándose con FRC Communications Task en la roboRIO (está dividido por la mitad para la comunicación de TCP y UDP). El indicador del código del robot muestra cuando el código del robot se está ejecutando actualmente (determinado cuando la Driver Station Task del código del robot está o no actualizando el voltaje de la batería), el indicador de los “joysticks” muestra si por lo menos alguno de los joysticks está conectado y reconocido por la DS.
ja: 主なステータスインジケータ - これら3つのインジケータは、DSの主なステータス項目を表示します。「Communications」は、DSが現在roboRIO上のFRCネットワーク通信タスクと通信しているかどうかを示します（TCP通信とUDP通信で半分に分かれています）。「Robot Code」インジケータは、チームのロボットコードが現在実行されているかどうかを示します（ロボットコード内のDriver Stationタスクがバッテリー電圧を更新しているかどうかで判断される）。「Joysticks」インジケータは、少なくとも1本のジョイスティックがDSに接続され、DSによって認識されているかどうかを示します。

source: Status String - The Status String provides an overall status message indicating the state of the robot. Some examples are "No Robot Communication", "No Robot Code", "Emergency Stopped", and "Teleoperated Enabled". When the roboRIO brownout is triggered this will display "Voltage Brownout".
ja: ステータス文字列 - ステータス文字列は、ロボットの状態を示す全体的なステータス情報を提供します。いくつかの例は「No Robot Communication」、「No Robot Code」、「Emergency Stopped」、「Teleoperated Enabled」です。roboRIOの電圧低下が発生すると、「Voltage Brownout」が表示されます。

source: Operation Tab
ja: 操作タブ

source: This is the first tab from the top on the left hand side.
ja: 左側の上から1番目のタブです。

source: The Operations Tab is used to control the mode of the robot and provide additional key status indicators while the robot is running.
es_mx: La Operation Tab es usada para controlar el modo del robot y proporcionar indicadores clave de estado adicionales mientras el robot está funcionando.
ja: 操作タブはロボットのモードを制御するために使用され、ロボットの実行中に追加の主要なステータスインジケータを提供します。

source: Robot Mode - This section controls the Robot Mode.
ja: ロボットモード - このセクションでは、ロボットモードを制御します。

source: Teleoperated Mode causes the robot to run the code in the Teleoperated portion of the match.
ja: Teleoperatedモードでは、ロボットは試合のTeleoperated Periodのコードを実行します。

source: Autonomous Mode causes the robot to run the code in the Autonomous portion of the match.
ja: Autonomousモードでは、ロボットは試合のAutonomous Periodのコードを実行します。

source: :doc:`Test Mode </docs/software/basic-programming/using-test-mode>` is an additional mode where test code that doesn't run in a regular match can be tested.
ja: :doc:`Testモード </docs/software/basic-programming/using-test-mode>` は、通常の試合では実行されないテストコードをテストできる追加モードです。

source: Enable/Disable - These controls enable and disable the robot. See also `Driver Station Key Shortcuts`_.
ja: Enable/Disable - これらのコントロールはロボットを有効あるいは無効にします。 `ドライバーステーションの キーボードショートカット`_ を参照してください。

source: Elapsed Time - Indicates the amount of time the robot has been enabled.
ja: Elapsed Time - ロボットが有効(enabled)になってからの時間を示す。

source: PC Battery - Indicates current state of DS PC battery and whether the PC is plugged in.
ja: PC Battery - DSを実行するPCのバッテリーの現在の状態と、PCが電源に差し込まれているかどうかを示す。

source: PC CPU% - Indicates the CPU Utilization of the DS PC.
ja: PC CPU% - DSを実行するPCのCPU使用率を示す。

source: Window Mode - When not on the Driver account on the Classmate allows the user to toggle between floating (arrow) and docked (rectangle).
ja: ウィンドウモード - Classmateのドライバーアカウントでない場合、フローティング（矢印）とドッキング（長方形）を切り替えることができます。

source: Team Station - When not connected to FMS, sets the team station to transmit to the robot.
es_mx: Team Station – Cuando no esté conectada a FMS, configure la team station para transmitir al robot.
ja: チームステーション - FMS に接続されていない場合、ロボットへ送信するチームステーションを設定します。

source: When connected to the Field Management System the controls in sections 1 and 2 will be replaced by the words FMS Connected and the control in Section 7 will be greyed out.
ja: フィールド管理システム(FMS)に接続されると、1番目と2番目のセクションのコントロールはFMS Connectedの文字に変わり、7番目のセクション7のコントロールはグレーアウトします。

source: Diagnostics Tab
ja: 診断タブ

source: This is the second tab from the top on the left hand side.
ja: 左側の上から2番目のタブです。

source: The Diagnostics Tab contains additional status indicators that teams can use to diagnose issues with their robot:
es_mx: La Diagnostics Tab contiene indicadores de estado adicionales que los equipos pueden usar para diagnosticar los problemas con su robot:
ja: 診断タブには、チームがロボットの問題を診断するために使用できるステータスインジケータが追加されています：

source: DS Version - Indicates the Driver Station Version number.
ja: DS バージョン - ドライバーステーションのバージョン番号。

source: roboRIO Image Version - String indicating the version of the roboRIO Image.
ja: roboRIO イメージバージョン - roboRIO イメージのバージョンを示す文字列。

source: WPILib Version - String indicating the version of WPILib in use.
ja: WPILib バージョン - 使用中の WPILib のバージョンを示す文字列。

source: :term:`CAN` Device Versions - String indicating the firmware version of devices connected to the CAN bus. These items may not be present if the CTRE Phoenix Framework has not been loaded.
ja: :term:`CAN` デバイスのバージョン - CANバスに接続されているデバイスのファームウェアバージョンを示す文字列。CTRE Phoenix Frameworkがロードされていない場合、これらの項目は表示されないことがあります。

source: Memory Stats - This section shows stats about the roboRIO memory.
ja: メモリー統計 - roboRIO のメモリーに関する統計情報を表示す。

source: Connection Indicators - The top half of these indicators show connection status to various components.
es_mx: Connection Indicators – La mitad superior de estos indicadores muestra el estado de conexión a varios componentes.
ja: 接続インジケータ - これらのインジケータの上半分は、様々なコンポーネントへの接続ステータスを示す。

source: "Enet Link" indicates the computer has something connected to the ethernet port.
es_mx: “Enet Link” indica que la computadora tiene algo conectado en el puerto de Ethernet.
ja: 「Enet Link」は、コンピュータがイーサネットポートに何かが接続されていることを示す。

source: "Robot Radio" indicates the ping status to the robot wireless bridge at 10.XX.YY.1.
es_mx: “Robot Radio” indica el estado de ping al puente inalámbrico del robot en 10.XX.YY.1.
ja: 「Robot Radio」は10.XX.YY.1のロボット無線ブリッジへのping状態を示す。

source: "Robot" indicates the ping status to the roboRIO using mDNS (with a fallback of a static 10.TE.AM.2 address).
es_mx: “Robot” indica el estado de Ping a la roboRIO utilizando mDNS (con un respaldo de dirección estática 10.TE.AM.2).
ja: 「Robot」は、mDNS（フォールバックとして静的アドレスは10.TE.AM.2）を使用したroboRIOへのpingステータスを示す。

source: "FMS" indicates if the DS is receiving packets from FMS (this is NOT a ping indicator).
es_mx: “FMS” indica si la DS está recibiendo paquetes de FMS (esto NO es un indicador de ping).
ja: 「FMS」は、DSがFMSからパケットを受信しているかどうかを示す(これはpingインジケータではない)。

source: Network Indicators - The second section of indicators indicates status of network adapters and firewalls. These are provided for informational purposes; communication may be established even with one or more unlit indicators in this section.
ja: ネットワーク・インジケータ - インジケータの2番目のセクションは、ネットワーク・アダプタとファイアウォールのステータスを示します。このセクションのインジケータが1つ以上点灯していなくても、通信は確立できます。

source: "Enet" indicates the IP address of the detected Ethernet adapter
es_mx: “Enet” indica la dirección IP del adaptador de Ethernet detectado.
ja: 「Enet」は、検出されたイーサネット・アダプターのIPアドレスを示す。

source: "WiFi" indicates if a wireless adapter has been detected as enabled
es_mx: “WiFi” indica si un adaptador inalámbrico ha sido detectado como habilitado.
ja: 「WiFi」は、ワイヤレス・アダプタが有効であると検出されたかを示す。

source: "USB" indicates if a roboRIO USB connection has been detected
es_mx: “USB” indica si una conexión USB de la roboRIO ha sido detectada.
ja: 「USB」は、roboRIOのUSB接続が検出されたことを示す。

source: "Firewall" indicates if any firewalls are detected as enabled. Enabled firewalls will show in orange (Dom = Domain, Pub = Public, Prv = Private)
ja: 「Firewall」は、有効なファイアウォールが検出されたかどうかを示します。有効なファイアウォールはオレンジ色で表示されます（Dom = Domain, Pub = Public, Prv = Private）。

source: :guilabel:`Reboot roboRIO` - This button attempts to perform a remote reboot of the roboRIO (after clicking through a confirmation dialog).
ja: :guilabel:`Reboot roboRIO` - このボタンをクリックすると、roboRIO がリモートで再起動されます（ダイアログで確認後）。

source: :guilabel:`Restart Robot Code` - This button attempts to restart the code running on the robot (but not restart the OS).
ja: :guilabel:`Restart Robot Code` - このボタンはロボット上で動作しているコードを再起動します（OSは再起動しません）。

source: Setup Tab
ja: セットアップタブ

source: This is the third tab from the top on the left hand side.
ja: 左側の上から3番目のタブです。

source: The Setup Tab contains a number of buttons teams can use to control the operation of the Driver Station:
es_mx: La Setup Tab contiene un número de botones los cuales el equipo puede utilizar para controlar la operación de la Driver Station:
ja: セットアップタブには、ドライバーステーションの操作を制御するためのボタンがいくつかあります：

source: :guilabel:`Team Number` - Should contain your FRC Team Number. This controls the mDNS name that the DS expects the robot to be at. Shift clicking on the dropdown arrow will show all roboRIO names detected on the network for troubleshooting purposes.
ja: :guilabel:`Team Number` - FRCチーム番号を入力してください。これは、DSがロボットに期待するmDNS名を制御します。ドロップダウンの矢印をシフトクリックすると、トラブルシューティングのためにネットワーク上で検出されたすべてのroboRIO名が表示されます。

source: :guilabel:`Dashboard Type` - Controls what Dashboard is launched by the Driver Station. :guilabel:`Default` launches the file pointed to by the "FRC DS Data Storage.ini" (for more information about setting a :ref:`custom dashboard <docs/software/driverstation/manually-setting-the-driver-station-to-start-custom-dashboard:Manually Setting the Driver Station to Start Custom Dashboard>`). By default this is Dashboard.exe in the Program Files (x86)\\FRC Dashboard folder. :guilabel:`LabVIEW` attempts to launch a dashboard at the default location for a custom built LabVIEW dashboard, but will fall back to the default if no dashboard is found. :guilabel:`SmartDashboard` and :guilabel:`Shuffleboard` launch the respective dashboards included with the C++ and Java WPILib installation. :guilabel:`Remote` forwards LabVIEW dashboard data to the IP specified in :guilabel:`Dashboard IP` field.
ja: :guilabel:`Dashboard Type` - ドライバーステーションが起動するダッシュボードを制御します。 :guilabel:`Default` は「FRC DS Data Storage.ini」が指すファイルを起動します ( :ref:`カスタムダッシュボードの設定についてはこちら <docs/software/driverstation/manually-setting-the-driver-station-to-start-custom-dashboard:Manually Setting the Driver Station to Start Custom Dashboard>` ) 。デフォルトでは、Program Files (x86)￥FRC DashboardフォルダのDashboard.exeです。 :guilabel:`LabVIEW` はカスタムビルドされたLabVIEWダッシュボードのデフォルトの場所でダッシュボードを起動しようとしますが、ダッシュボードが見つからない場合はデフォルトにフォールバックします。 :guilabel:`SmartDashboard` と :guilabel:`Shuffleboard` は C++ と Java WPILib のインストールに含まれるそれぞれのダッシュボードを起動します。 :guilabel:`Remote` は LabVIEW ダッシュボードのデータを :guilabel:`Dashboard IP` フィールドで指定された IP アドレスに転送します。

source: :guilabel:`Game Data` - This box can be used for at home testing of the Game Data API. Text entered into this box will appear in the Game Data API on the Robot Side. When connected to FMS, this data will be populated by the field automatically.
ja: :guilabel:`Game Data` - このボックスはGame Data APIをホームグラウンドでテストするために使用します。このボックスに入力されたテキストは、ロボット側の Game Data API に送信されます。FMSに接続すると、このデータは自動的にフィールドに入力されます。

source: Practice Mode Timing - These boxes control the timing of each portion of the practice mode sequence. When the robot is enabled in practice mode the DS automatically proceeds through the modes indicated from top to bottom.
es_mx: Practice Mode Timing – Estas cajas controlan el tiempo de cada porción de la secuencia del modo de práctica. Cuando el robot está habilitado en modo de práctica la DS automáticamente avanza a través de los modos de indicados desde arriba hacia abajo.
ja: Practice Timing - これらのボックスはプラクティスモードの連続のタイミングを制御します。ロボットがプラクティスモードで有効になると、DSは自動的に上から下に表示されたモードを進みます。

source: Audio Control - This button controls whether audio tones are sounded when the Practice Mode is used.
es_mx: Audio Control – Este botón controla si los tonos de audio suenan cuando se utiliza el modo de práctica.
ja: オーディオ・コントロール - このボタンは、プラクティスモード使用時にオーディオ・トーンを鳴らすかどうかを制御します。

source: USB Devices Tab
ja: USBデバイスタブ

source: This is the fourth tab from the top on the left hand side.
ja: 左側の上から4番目のタブです。

source: The USB Devices tab includes the information about the USB Devices connected to the DS
es_mx: La USB Devices tab incluye la información sobre los dispositivos USB conectados a la DS
ja: USBデバイスタブには、DS に接続されている USB デバイスの情報が表示されます。

source: USB Setup List - This contains a list of all compatible USB devices connected to the DS. Pressing a button on a device will highlight the name in green and put 2 \*s before the device name
es_mx: USB Setup List – Esta contiene una lista de todos los dispositivos USB compatibles conectados a la DS. Si presiona un botón en un dispositivo, resaltará el nombre del dispositivo en verde y pondrá 2 \*s antes del nombre del dispositivo.
ja: USBセットアップリスト - DS に接続されているすべての互換 USB デバイスのリストです。デバイスのボタンを押すと、そのデバイス名が緑色でハイライトされ、デバイス名の前に2つの「\*」が表示されます。

source: :guilabel:`Rescan` - This button will force a Rescan of the USB devices. While the robot is disabled, the DS will automatically scan for new devices and add them to the list. To force a complete re-scan or to re-scan while the robot is Enabled (such as when connected to FMS during a match) press F1 or use this button.
ja: :guilabel:`Rescan` - このボタンを押すと、USB デバイスの再スキャンが実行されます。ロボットが無効になっている間、DS は自動的に新しいデバイスをスキャンし、リストに追加します。完全な再スキャンを実行する場合、またはロボットが有効な状態（試合中に FMS に接続している場合など）で再スキャンを実行する場合は、F1 キーを押すか、このボタンを使用します。

source: Device indicators - These indicators show the current status of the Axes, buttons and POV of the joystick.
es_mx: Device Indicators – Estos indicadores muestran el estado actual de Axes, botones y POV del joystick.
ja: デバイスインジケータ - ジョイスティックの軸、ボタン、POV の現在のステータスを示すインジケータです。

source: Rumble - For XInput devices (such as X-Box controllers) the Rumble control will appear. This can be used to test the rumble functionality of the device. The top bar is "Right Rumble" and the bottom bar is "Left Rumble". Clicking and holding anywhere along the bar will activate the rumble proportionally (left is no rumble = 0, right is full rumble = 1). This is a control only and will not indicate the Rumble value set in robot code.
es_mx: Rumble – Para dispositivos XInput (como controladores de X-Box) el control Rumble aparecerá. Este puede ser usado para probar la funcionalidad rumble del dispositivo. La barra superior es “Right Rumble” y la barra inferior es “Left Rumble”. Haciendo clic y manteniendo en cualquier lugar a lo largo de la barra, activará la proporcionalidad de Rumble ( izquierda es no rumble = 0 , derecha es rumble lleno = 1 ). Este es un control único y no indicará el valor de Rumble establecido en el código del robot.
ja: Rumble - XInputデバイス（X-Boxコントローラーなど）の場合、Rumbleコントロールが表示されます。これは、デバイスのランブル機能をテストするために使用できます。上のバーは「右ランブル」、下のバーは「左ランブル」です。バーのどこかをクリックしたままにすると、ランブルは比例してアクティブになります（左はランブルなし＝0、右はフルランブル＝1）。これはコントロールのみで、ロボットコードで設定されたランブル値は表示されません。

source: Re-Arranging and Locking Devices
es_mx: Dispositivos de reordenamiento y bloqueo
ja: デバイス順序の並べ替えと固定

source: USB Order box where you can click and drag to rearrange the joysticks.
ja: クリック＆ドラッグでジョイスティックを並べ替えることができる「USB Order」ボックス。

source: The Driver Station has the capability of "locking" a USB device into a specific slot. This is done automatically if the device is dragged to a new position and can also be triggered by double clicking on the device. "Locked" devices will show up with an underline under the device. A locked device will reserve its slot even when the device is not connected to the computer (shown as grayed out and underlined). Devices can be unlocked (and unconnected devices removed) by double clicking on the entry.
ja: ドライバステーションは、USB デバイスを特定のスロットに「ロック」する機能を持っています。これは、デバイスが新しい位置にドラッグされると自動的に行われ、またデバイスをダブルクリックすることでも起動します。「ロック」されたデバイスは、デバイスの下にアンダーラインが表示されます。ロックされたデバイスは、デバイスがコンピュータに接続されていないときでもスロットが確保されます（灰色で表示され、下線が引かれています）。デバイスをダブルクリックすると、ロックが解除されます（接続されていないデバイスは削除されます）。

source: If you have two or more of the same device, they should maintain their position as long as all devices remain plugged into the computer in the same ports they were locked in. If you switch the ports of two identical devices the lock should follow the port, not the device. If you re-arrange the ports (take one device and plug it into a new port instead of swapping) the behavior is not determinate (the devices may swap slots). If you unplug one or more of the set of devices, the positions of the others may move; they should return to the proper locked slots when all devices are reconnected.
ja: 同じタイプのデバイスが2台以上ある場合、すべてのデバイスがロックされたのと同じポートでコンピュータに接続されている限り、その位置に留まるはずです。2つの同じタイプのデバイスのポートを入れ替えた場合、ロックはデバイスではなくポートに従います。ポートを並べ替えた場合（デバイスを交換する代わりに、1つのデバイスを新しいポートに差し込む）、動作は確定しません（デバイスがスロットを交換する可能性があります）。1つまたは複数のデバイスのプラグを抜くと、他のデバイスの位置が移動することがありますが、すべてのデバイスを再接続すると、適切なロックされたスロットに戻るはずです。

source: Example: The image above shows 4 devices:
es_mx: Ejemplo: la imagen de arriba muestra 4 dispositivos:
ja: 例： 上の画像は4つのデバイスを示しています：
