Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station-log-viewer.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: All Events, All Info: This filter shows all events and all recorded info. At this time the primary difference between this filter and "All Events and Time" is that this option shows the "unique" designator for the first occurrence of a particular message.
es_mx: All Events, All Info: Este filtro muestra todos los eventos y toda la información guardada. En este momento la principal diferencia entre este filtro y el “All Events and Time” es que esta opción muestra un designante único para la primera aparición de un mensaje en específico.
fr_ca: All Events, All Info: ce filtre affiche tous les événements et toutes les informations enregistrées. La différence principale entre ce filtre et "All Events and Time" est que cette option affiche le qualificatif "unique" pour la première occurrence d’un message particulier.
tr_tr: All Events, All Info: Bu filtre tüm olayları ve tüm kayıtlı bilgileri gösterir. Şu anda, bu filtre ile "All Events and Time" arasındaki temel fark, bu seçeneğin belirli bir mesajın ilk oluşumu için "benzersiz" göstericiyi göstermesidir.
zh_cn: “所有事件，所有信息”：此筛选器显示所有事件和所有记录的信息。此时，此过滤器与“所有事件和时间”之间的主要区别在于，此选项显示首次出现特定消息的“唯一”指示符。

source: Identifying Logs from Matches
es_mx: Identificar Archivos De Datos De Partidos.
fr_ca: Identification des journaux des matches
tr_tr: Maçlardan Günlükleri Tanımlama
zh_cn: 根据比赛识别日志

source: To identify a log from a match look for the "FMS Connected" message then the match number.
fr_ca: Pour identifier un journal d'un match, recherchez le message "FMS Connected" puis le numéro du match.
zh_cn: 为了识别匹配的日志，查找“FMS Connected”消息，然后匹配号码。

source: A common task when working with the Driver Station Logs is to identify which logs came from competition matches. Logs which were taken during a match can now be identified using the FMS Connected event which will display the match type (Practice, Qualification or Elimination), match number, and the current time according to the FMS server. In this example, you can see that the FMS server time and the time of the Driver Station computer are fairly close, approximately 7 seconds apart.
es_mx: Una tarea común al trabajar con datos en la Driver Station, es identificar cuales datos vienen de los partidos de la competencia. Los datos obtenidos durante un match pueden ahora identificarse al usar la FMS Connected event que mosrarán el tipo de match (Practica, Clasificación o Eliminatoria), número de match, y tiempo actual correcto según el servidor de a FMS. En este ejemplo, usted puede ver que el tiempo del servidor de la FMS y el tiempo de la Driver Station son algo cercanos, solo tienen aproximadamente 7 segundos de diferencia.
fr_ca: Une étape usuelle en travaillant avec les journaux de Driver Station consiste à identifier les journaux provenant des matches en tournoi. Les journaux qui ont été produits durant un match peuvent maintenant être identifiés à l’aide de l’événement FMS Connected qui affichera le type de match (Pratique, Qualification ou Fin de tournoi), son numéro et son heure précise telle que donnée par le serveur FMS. Dans cet exemple, vous pouvez voir que le temps du serveur FMS et l’heure Driver Station sur le PC sont assez proches, à environ 7 secondes d’intervalle.
tr_tr: Driver Station Logs ile çalışırken yaygın bir görev, hangi günlüklerin yarışma maçlarından geldiğini belirlemektir. Bir maç sırasında alınan günlükler artık FMS sunucusuna göre maç türünü (Practice, Qualification or Elimination), maç numarasını ve geçerli saati gösteren FMS Connected olayı kullanılarak tanımlanabilir. Bu örnekte, FMS sunucu zamanının ve Driver Station bilgisayarının saatinin oldukça yakın, yaklaşık 7 saniye arayla olduğunu görebilirsiniz.
zh_cn: 使用Driver Station Logs时，常见的任务是确定哪些日志来自比赛。现在，可以使用FMS Connected事件来识别在比赛期间获取的日志，该事件将根据FMS服务器显示比赛类型（练习，资格或淘汰赛），比赛编号和当前时间。在此示例中，您可以看到FMS服务器时间和Driver Station计算机的时间非常接近，相隔大约7秒。

source: Identifying Common Connection Failures with the Log Viewer
es_mx: Identificar Fallas De Conexión Comunes Con El Low Viewer
fr_ca: Identification avec le visionneur de journaux des problèmes de connexion courants
tr_tr: Günlük Görüntüleyici-Log Viewer ile Yaygın Bağlantı Hatalarını Tanımlama
zh_cn: 使用日志查看器识别常见的连接失败

source: When diagnosing robot issues, there is no substitute for thorough knowledge of the system and a methodical debugging approach. If you need assistance diagnosing a connection problem at your events it is strongly recommended to seek assistance from your FTA and/or CSA. The goal of this section is to familiarize teams with how some common failures can manifest themselves in the DS Log files. Please note that depending on a variety of conditions a particular failure show slightly differently in a log file.
es_mx: Al diagnosticar problemas del robot, no hay sustituto para el conocimiento completo del sistema y un enfoque metódico de depuración. Si usted necesita ayuda para diagnosticar un problema de conexión durante un evento es fuertemente recomendado buscar ayuda de su FTA y/o CSA. El objetivo de esta sección es para familiarizar a los equipos con como algunas fallas comunes pueden manifestarse en las mismas en el DS Log Files. Por favor note que dependiendo en una variedad de condiciones una falla particular se muestra algo diferente en un log file.
fr_ca: Lors du diagnostic des problèmes avec le robot, il n’y a rien de mieux qu'une connaissance approfondie du système et une approche méthodique de débogage. Si vous avez besoin d’aide pour diagnostiquer un problème de connexion en tournoi, il est fortement recommandé de chercher de l’aide auprès de votre FTA ou de votre CSA. L’objectif de cette section est de vous familiariser avec la façon dont certaines pannes courantes peuvent se manifester dans les fichiers journaux de DS. Notez que, dépendant d'une variété de conditions, une défaillance particulière peut s’afficher légèrement différemment dans un fichier journal.
tr_tr: Robot sorunlarını teşhis ederken, sistem hakkında kapsamlı bilgi ve metodik hata ayıklama yaklaşımının yerini hiçbir şey tutamaz. Etkinliklerinizde bir bağlantı sorununu teşhis etmek için yardıma ihtiyacınız varsa, FTA ve/veya CSA'nızdan yardım almanız şiddetle tavsiye edilir. Bu bölümün amacı, ekiplere bazı yaygın hataların kendilerini DS Günlük dosyalarında nasıl gösterebileceğini öğretmektir. Lütfen çeşitli koşullara bağlı olarak belirli bir hatanın günlük dosyasında biraz farklı göründüğünü unutmayın.
zh_cn: 在诊断机器人问题时，没什么能替代对系统知识的全面了解和有条不紊的调试方法。如果您在活动中需要诊断连接问题的帮助，强烈建议您向FTA和/或CSA寻求帮助。本部分的目的是使团队熟悉一些常见故障如何在DS Log文件中显示出来。请注意，各种情况下，特定故障在日志文件中的显示会略有不同。

source: Note that all log files shown in this section have been scaled to match length using the Match Length button and then scrolling to the beginning of the autonomous mode. Also, many of the logs do not contain battery voltage information, the platform used for log capture was not properly wired for reporting the battery voltage.
es_mx: Note que todos los log files en esta sección han sido redimensionados para tener la misma longitud usando el botón Match Length y después desplazarse al principio del modo autónomo. También muchos de los archivos no contienen información sobre voltaje de la batería, la plataforma usada para la captura de archivos no se conectó de manera correcta para reportar el voltaje de la batería.
fr_ca: Notez que tous les fichiers journaux affichés dans cette section ont été mis à l’échelle pour correspondre à la longueur d'un match à l’aide du bouton Match Length, puis parcourus jusqu’au début du Mode Autonome. En outre, la plateforme utilisée pour la production des journaux n’ayant pas été correctement câblée pour signaler la tension de la batterie, beaucoup de journaux ne contiennent pas d’informations sur la tension de la batterie.
tr_tr: Bu bölümde gösterilen tüm günlük dosyalarının Match Length - Uzunluğu Eşleştir düğmesi kullanılarak uzunluk eşleşecek şekilde ölçeklendiğini ve ardından otonom modun başlangıcına kaydırıldığını unutmayın. Ayrıca, günlüklerin çoğu pil voltajı bilgilerini içermez, günlük kaydı için kullanılan platform pil voltajını bildirmek için uygun şekilde kablolanmamıştır.
zh_cn: 请注意，已使用“匹配长度”按钮将本节中显示的所有日志文件缩放为匹配长度，然后滚动到自主模式的开头。另外，许多日志都不包含电池电压信息，用于日志捕获的平台未正确接线以报告电池电压。

source: Some error messages that are found in the Log Viewer are show below and more are detailed in the :doc:`driver-station-errors-warnings` article.
es_mx: Algunos mensajes de error que se encuentran en el Log Viewer se muestran debajo y más son detallados en la sección :doc:`driver-station-errors-warnings`
fr_ca: Certains messages d’erreur trouvés dans le visionneur de journaux sont présentés ci-dessous et d’autres sont détaillés dans l'article :doc:`driver-station-errors-warnings`.
tr_tr: Günlük Görüntüleyicide bulunan bazı hata mesajları aşağıda gösterilmektedir ve daha fazlası: doc: :doc:`driver-station-errors-warnings` makalesinde detaylandırılmıştır.
zh_cn: 下面显示了在日志查看器中找到的一些错误消息，并且在 driver-station-errors-warnings 文章中进行了详细说明。

source: "Normal" Log
es_mx: Log "Normal"
fr_ca: Journal "Normal"
tr_tr: "Normal" Log-Kayıtlar
zh_cn: "Normal“ 日志

source: A normal graph and a couple of harmless events.
fr_ca: Un graphique normal et quelques événements mineurs.
zh_cn: 一个正常的图表和一些无害的事件。

source: This is an example of a normal match log. The errors and warnings contained in the first box are from when the DS first started and can be ignored. This is confirmed by observing that these events occurred prior to the "FMS Connected:" event. The last event shown can also be ignored, it is also from the robot first connecting to the DS (it occurs 3 seconds after connecting to FMS) and occurs roughly 30 seconds before the match started.
es_mx: Este es un ejemplo de un archivo de datos log normal de un match. Los errores y advertencias contenidas en el primer recuadro son de cuando la DS inicio por primera vez y puede ser ignorado. Esto es confirmado por observar que estos eventos suceden antes del evento. El último evento también puede ser ignorado, también surge de la primera conexión del robot a la DS (ocurre 3 segundos después de conectarse a la FMS) y sucede casi 30 segundos antes que inicie el match.
fr_ca: Ceci représente un exemple du journal d'un match régulier. Les erreurs et les avertissements contenus dans la première zone proviennent du moment où DS a démarré et peuvent être ignorés. Ceci est confirmé en observant que ces événements se sont produits avant l'événement "FMS Connected:". Le dernier événement montré peut également être ignoré, il est aussi lié à la première connexion du robot à DS (il se produit 3 secondes après la connexion au FMS) et se produit environ 30 secondes avant le début du match.
tr_tr: Bu, normal bir maç günlüğü örneğidir. İlk kutuda yer alan hatalar ve uyarılar, DS'nin ilk başlatıldığı zamandır ve göz ardı edilebilir. Bu, bu olayların "FMS Connected:" olayından önce meydana geldiği gözlemlenerek doğrulanır. Gösterilen son olay da göz ardı edilebilir, aynı zamanda robotun DS'ye ilk bağlanmasından (FMS'ye bağlandıktan 3 saniye sonra gerçekleşir) ve maç başlamadan yaklaşık 30 saniye önce gerçekleşir.
zh_cn: 这是正常比赛日志的示例。 第一个框中包含的错误和警告来自 Driver Station 首次启动时的时间，可以忽略。 看到这些事件在“ FMS Connected：”事件之前发生就能确认。 所显示的最后一个事件也可以忽略，它也是从机器人第一次连接到 Driver Station 以来（它发生在连接FMS后3秒），发生在比赛开始前约30秒。

source: Disconnected from FMS
es_mx: Desconectado de la FMS
fr_ca: Déconnecté du FMS
tr_tr: FMS'den bağlantı kesik
zh_cn: 从场控系统断连

source: A disconnect can cause the log to be split into two pieces but will at least haved events showing the disconnect.
fr_ca: Une déconnexion peut entraîner la division du journal en deux parties, mais contiendra au moins des événements indiquant la déconnexion.
zh_cn: 断开连接可能导致日志被分成两部分，但至少会有显示断开连接的事件。

source: When the DS disconnects from FMS, and therefore the robot, during the match it may segment the log into pieces. The key indicators to this failure are the last event of the first log, indicating that the connection to FMS is now "bad" and the second event from the 2nd log which is a new FMS connected message followed by the DS immediately transitioning into Teleop Enabled. The most common cause of this type of failure is an ethernet cable with no latching tab or a damaged ethernet port on the DS computer.
es_mx: Cuando la DS se desconecta de la FMS, por lo tanto del robot, durante un match puede dividir el archivo en piezas. Los indicadores clave para esta falla son el último evento del primer archivo, indicando que la conexión a la FMS es ahora “mala” y que el 2do evento del segundo archivo, el cual es un mensaje nuevo de la FMS seguido por la transición inmediata de la DS a Teleop Enabled. La causa más común de este tipo de falla es un cable Ethernet mal conectado o un puerto Ethernet dañado de la computadora DS.
fr_ca: Lorsque DS se déconnecte du FMS, et donc du robot, pendant le match, le journal peut se subdiviser en morceaux. Les indicateurs clés de cette panne sont le dernier événement du premier journal, indiquant que la connexion au FMS est maintenant "bad" et le deuxième événement du 2ème journal qui est un nouveau message "FMS connected" suivi par DS transitant immédiatement vers Teleop Enabled. La cause la plus fréquente de ce type de défaillance est un câble ethernet sans griffe de verrouillage ou un port ethernet endommagé sur l’ordinateur de pilotage.
tr_tr: DS, FMS'den ve dolayısıyla robottan ayrıldığında, maç sırasında günlüğü parçalara ayırabilir. Bu problemin temel göstergeleri, 1. günlüğün son olayı olup, FMS'ye bağlantının artık "bad" olduğunu ve 2. günlükten gelen ikinci olaydır; bu, yeni bir FMS bağlı mesajdır ve ardından DS'nin hemen Teleop Enabled'e geçiş yapması gelir. . Bu tür bir arızanın en yaygın nedeni, mandalı olmayan bir ethernet kablosu veya DS bilgisayarında hasarlı bir ethernet bağlantı noktasıdır.
zh_cn: 当 DS 与 FMS 断开连接，并与机器人断开连接时，在比赛期间，它可能会将日志分段。 连接失败的关键指标是第一个日志的最后一个事件，表明与FMS的连接现在处于“不良”状态，第二个日志中的第二个事件是一条新的FMS连接消息，随后DS立即转换为Teleop Enabled。 此类故障的最常见原因是以太网线没有插好或者 DS 电脑上的以太网端口损坏。

source: roboRIO Reboot
es_mx: Reiniciar la roboRIO
fr_ca: Redémarrage du roboRIO
tr_tr: roboRIO Reboot-Yeniden başlatmak
zh_cn: roboRIO 重启

source: A roboRIO reboot is most evident by a "Time since robot boot" message.
fr_ca: Un redémarrage du roboRIO est d'avantage mis en évidence par un message "Time since robot boot".
zh_cn: roboRIO重启最明显的是一条“机器人启动时间到了”的信息。

source: The "Time since robot boot" message is the primary indicator in a connection failure caused by the roboRIO rebooting. In this log the DS loses connection with the roboRIO at 3:01:36 as indicated by the first event. The second event indicates that the ping initiated after the connection failed was successful to all devices other than the roboRIO. At 3:01:47 the roboRIO begins responding to pings again, one additional ping fails at 3:01:52. At 3:02:02 the Driver Station connects to the roboRIO and the roboRIO reports that it has been up for 3.682 seconds. This is a clear indicator that the roboRIO has rebooted. The code continues to load and at 3:02:24 the code reports an error communicating with the camera. A warning is also reported indicating that no robot code is running right before the code finishes starting up.
es_mx: El mensaje “Time since robot boot” es el principal indicador de una falla de conexión causada por el reinicio de la roboRIO. En este archivo la DS pierde conexión con la roboRIO con 3:01:36 como se indica en el primer evento. El segundo evento indica que el sonido iniciado después que la conexión falló fue exitosa en todos los dipositivos además de la roboRIO. A las 3:01:47 la roboRIO inicia respondiendo a sonidos de Nuevo, un sonido adicional falla a las 3:01:52. A las 3:02:02 la Driver Station se conecta a la roboRIO y la roboRIO reporta que ha estado funcionando por 3.682 segundos. Este es un indicador muy claro que la roboRIO se ha reiniciado. El código continua cargándose y a las 3:02:24 el código reporta un error al comunicarse con la cámara. Una advertencia también se reporta indicando que ningún código del robot está ejecutándose antes que el código termine de iniciar.
fr_ca: Le message "Time since robot boot" est le principal indicateur d’une défaillance de connexion causée par un redémarrage du roboRIO. Dans ce journal, DS perd la connexion avec le roboRIO à 3:01:36 tel qu'indiqué par le premier événement. Le deuxième événement indique que le ping initié après l’échec de la connexion a réussi avec tous les appareils excepté le roboRIO. À 3:01:47 le roboRIO commence à répondre à nouveau aux pings, un ping supplémentaire échoue à 3:01:52. À 3:02:02, Driver Station se connecte au roboRIO et le roboRIO rapporte qu’il a été en place pendant 3.682 secondes. Il s’agit d’un indicateur clair que le roboRIO a redémarré. Le code continue à se charger et à 3:02:24 le code signale une erreur de communication avec la caméra. Un avertissement est également signalé indiquant qu’aucun Code Robot n’est en cours d’exécution juste avant la fin du démarrage du programme.
tr_tr: "Time since robot boot" mesajı, roboRIO'nun yeniden başlatılmasının neden olduğu bir bağlantı hatasındaki birincil göstergedir. Bu günlükte DS, ilk olayda belirtildiği gibi 3:01:36'da roboRIO ile bağlantısını kaybeder. İkinci olay, bağlantı başarısız olduktan sonra başlatılan ping'in roboRIO dışındaki tüm cihazlarda başarılı olduğunu gösterir. 3:01:47'de roboRIO pinglere tekrar yanıt vermeye başlar, 3:01:52'de ek bir ping başarısız olur. 3:02:02'de Driver Station roboRIO'ya bağlanır ve roboRIO bunun 3.682 saniyedir açık olduğunu bildirir. Bu, roboRIO'nun yeniden başlatıldığının açık bir göstergesidir. Kod yüklenmeye devam ediyor ve 3:02:24'te kod, kamera ile iletişimde bir hata olduğunu bildiriyor. Kodun başlaması tamamlanmadan hemen önce hiçbir robot kodunun çalışmadığını belirten bir uyarı da rapor edilmiştir.
zh_cn: “robot启动后的时间”消息是roboRIO重新启动导致连接失败的主要指示。 在此日志中，DS 如第一个事件所示，在 3:01:36 失去了与 roboRIO 的连接。 第二个事件表明，连接失败后启动的 ping 操作对 roboRIO 以外的所有设备均成功。 在 3:01:47，roboRIO 再次开始对 ping 做出响应，另外一个 ping 在 3:01:52 失败。 在 3:02:02，Driver Station 连接到 roboRIO，并且 roboRIO 报告它已启动 3.682 秒。 这清楚表明 roboRIO 已重新启动。 代码继续加载，并在 3:02:24 时报告与相机通信的错误。 还有一条警告，指示在代码完成启动之前，没有机器人代码正在运行。

source: Ethernet cable issue on robot
es_mx: Problema de cable Ethernet en el robot
fr_ca: Problème de câble Ethernet sur le robot
tr_tr: Robot üzerindeli Ethernet kablo problemleri
zh_cn: 机器人上以太网线有误

source: This issue is evident because the driverstation could connect to the radio but not the roboRIO yet the roboRIO hadn't rebooted.
fr_ca: Ce problème est évident car l'application Driver Station pouvait se connecter à la radio mais pas au roboRIO mais le roboRIO ne s'était pas redémarré.
zh_cn: 这个问题很明显，因为操控站可以连接无线电，但无法连接到机器人，因为机器人还没有重启

source: An issue with the ethernet cable on the robot is primarily indicated by the ping to the roboRIO going to bad and Radio Lost and Radio Seen events when the roboRIO reconnects. The "Time since robot boot" message when the roboRIO reconnects will also indicate that the roboRIO has not rebooted. In this example, the robot Ethernet cable was disconnected at 3:31:38. The ping status indicates that the radio is still connected. When the robot reconnects at 3:32:08 the "Tim since robot boot" is 1809 seconds indicating that the roboRIO clearly did not reboot. At 3:32:12 the robot indicates that it lost the radio 24.505 seconds ago and it returned 0.000 seconds ago. These points are plotted as vertical lines on the graph, yellow for radio lost and green for radio seen. Note that the times are slightly offset from the actual events as shown via the disconnection and connection, but help to provide additional information about what is occurring.
es_mx: Un problema con un cable de Ethernet en el robot es indicado principalmente por el ping de la roboRIO cambia a mal y los eventos Radio Lost y Radio Seen cuando la roboRIO se reconecta. El mensaje “Time since robot boot” cuando la roboRIO se reconecte también indicara que la roboRIO no se ha reiniciado. En este ejemplo, el cable de Ethernet del robot fue desconectado a las 3:31:38. El estatus del ping indica que el D-Link radio sigue conectado. Cuando el robot se reconecta a las 3:32:08 el“Tim since robot boot” está en 1809 segundos indicando que la roboRIO claramente no se reinició. A las 3:32:12 el robot indica que perdió la radio hace 24.505 segundos y regresó hace 0.000 segundos. Estos puntos se muestran como líneas verticales en la gráfica, amarillo para la radio y verde para la vista de radio. Note que los tiempos están ligeramente desacomodados de los eventos actuales como se muestran vía desconexión y conexión, pero ayuda a proporcionar información adicional sobre lo que esta pasando.
fr_ca: Un problème avec le câble ethernet sur le robot est principalement indiqué par un ping non concluant au roboRIO et l'apparition des événements *Radio Lost* et *Radio Seen* lorsque le roboRIO se reconnecte. Le message "Time since robot boot" lorsque le roboRIO se reconnecte indiquera également que le roboRIO n’a pas redémarré. Dans cet exemple, le câble Ethernet du robot a été déconnecté à 3:31:38. Le statut du ping indique que la radio est toujours connectée. Lorsque le robot se reconnecte à 3:32:08 l'évènement "Time since robot boot" est de 1809 secondes indiquant clairement que le roboRIO n’a pas redémarré. À 3:32:12, le robot indique qu’il a perdu la radio il y a 24.505 secondes et qu’il est revenu il y a 0.000 seconde. Ces points sont tracés sous forme de lignes verticales sur le graphique, jaune pour la radio perdue et vert pour la radio présente. Notez que les heures sont légèrement décalées par rapport aux événements réels tels qu’ils sont indiqués via la déconnexion et la connexion, mais ces heures aident à fournir des informations supplémentaires sur ce qui se passe.
tr_tr: Robot üzerindeki ethernet kablosuyla ilgili bir sorun, öncelikle roboRIO'nun kötüye giden pingi ve roboRIO yeniden bağlandığında Telsiz Kayboldu ve Telsiz Görüldü olayları ile gösterilir. RoboRIO yeniden bağlandığında "Time since robot boot-Robot açılışından itibaren geçen süre" mesajı, roboRIO'nun yeniden başlatılmadığını da gösterir. Bu örnekte, robot Ethernet kablosunun bağlantısı 3:31:38'de kesildi. Ping durumu, radyonun hala bağlı olduğunu gösterir. Robot 3:32:08 de yeniden bağlandığında "Time since robot boot-Robot açılışından itibaren geçen süre" 1809 saniyedir ve bu roboRIO'nun açıkça yeniden başlamadığını gösterir. 3:32: 12'de robot, radyoyu 24.505 saniye önce kaybettiğini ve 0.000 saniye önce geri geldiğini belirtir. Bu noktalar grafikte dikey çizgiler olarak, radyo kayıpları için sarı ve radyo görülenler için yeşil olarak işaretlenmiştir. Bağlantının kesilmesi ve bağlantı yoluyla gösterildiği gibi zamanların gerçek olaylardan biraz farklı olduğunu, ancak ne olduğu hakkında ek bilgi sağlamaya yardımcı olduğunu unutmayın.
zh_cn: 机械人上的以太网电缆出现问题，主要是通过 roboRIO 的 ping 延迟变高以及 roboRIO 重新连接时出现的 Radio Lost 和 Radio Seen 事件表示。roboRIO重新连接时的“自机械手启动后的时间”消息还将指示 roboRIO 尚未重新启动。 在此示例中，机器人以太网电缆在 3:31:38 断开连接。ping 状态指示无线电仍处于连接状态。当机器人在 3:32:08 重新连接时，“自机器人启动以来的提示”为 1809 秒，表明 roboRIO 显然没有重新启动。 在 3:32:12，机器人指示它在 24.505 秒前丢失了无线电并在 0.000 秒前返回。 这些点在图表上绘制为竖线，黄色表示无线电丢失，绿色表示可见无线电。 请注意，时间与实际事件略有偏差，如通过断开连接和连接所示，但有助于提供有关正在发生的事件的其他信息。

source: Radio reboot
es_mx: Reinicio del radio
fr_ca: Redémarrage de la radio
tr_tr: Radio yeniden başlatma-reboot
zh_cn: 路由器重启

source: The ping here shows the roboRIO and the radio as BAD.
fr_ca: Le ping ici montre le roboRIO et la radio comme MAUVAIS.
zh_cn: 这里的ping显示机器人和无线电都是坏的
