Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station-errors-warnings.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Driver Station Errors/Warnings
es_mx: Errores/Advertencias de la Driver Station
fr_ca: Erreurs/Avertissements de Driver Station
tr_tr: Driver Station Hataları / Uyarıları
zh_cn: Driver Station报错/警告

source: In an effort to provide both Teams and Volunteers (FTAs/CSAs/etc.) more information to use when diagnosing robot problems, a number of Warning and Error messages have been added to the Driver Station. These messages are displayed in the DS diagnostics tab when they occur and are also included in the DS Log Files that can be viewed with the Log File Viewer. This document discusses the messages produced by the DS (messages produced by WPILib can also appear in this box and the DS Logs).
es_mx: En el esfuerzo de proporcionar a equipos y voluntarios (FTAs/CSAs/etc.) más información para usar al identificar problemas del robot, varios mensajes de errores y advertencias se añadieron a la Driver Station. Estos mensajes se muestran en la pestaña de “diagnostics” en la DS cuando suceden y también se incluyen en la DS Log Files, que se puede ver con la Log File Viewer. Este documento habla sobre los mensajes producidos por la DS (mensajes producidos por WPILib pueden aparecer en este recuadro y en los archivos de la DS).
fr_ca: Afin de fournir aux équipes et aux bénévoles (FTA, CSA, etc.) plus d’informations pour le diagnostic de problèmes de robot, un certain nombre de messages d’avertissement et d’erreur ont été ajoutés à Driver Station. Ces messages sont affichés dans l’onglet Diagnostics de Driver Station lorsqu’ils se produisent et sont également inclus dans les fichiers journaux de Driver Station qui peuvent être consultés avec le visionneur de fichiers journaux. Le présent document traite des messages produits par Diver Station (les messages produits par WPILib peuvent également apparaître dans cette zone et les journaux de Driver Station).
tr_tr: Hem Takımlara hem de Gönüllülere (FTA'lar / CSA'lar / vb.) Robot sorunlarını teşhis ederken kullanabilecekleri daha fazla bilgi sağlayabilme amacıyla, Driver Station'a Uyarı ve Hata mesajı eklenmiştir.Bu mesajlar, oluştuklarında DS tanılama sekmesinde görüntülenir ve ayrıca DS Log Files ile görüntülenebilen Log File Viewer dahil edilir. Bu belge, DS tarafından üretilen mesajları tartışır (WPILib tarafından üretilen mesajlar bu kutuda ve de DS Logs görünebilir).
zh_cn: 了在诊断机器人问题时为团队和志愿者（FTA / CSA / etc。）提供更多信息，已在driver station中添加了许多警告和错误消息。这些消息出现时将显示在DS诊断选项中，并且也包含在DS Log Files，可通过Log File Viewer查看这些消息。本文档讨论了DS产生的消息（WPILib产生的消息也可以出现在此框中和DS日志中）。

source: Joystick Unplugged
es_mx: Joystick Desconectado
fr_ca: Manette débranchée
tr_tr: Joystick'in bağlantısız olması
zh_cn: 没插上的操作柄

source: This error is triggered when a Joystick is unplugged. Contrary to the message text this error will be printed even if the robot is not enabled, or even connected to the DS. You will see a single instance of this message occur each time the Driver Station is started, even if Joysticks are properly connected and functioning.
es_mx: Este error es desencadenado cuando un joystick es desconectado. Al contrario que el mensaje de texto este error se mostrara aún si el robot no está funcionando, o conectado a la DS. Usted verá una sola instancia de este mensaje suceder cada vez que la Driver Station inicia, incluso si los Joysticks están conectados correctamente y funcionando.
fr_ca: Cette erreur est déclenchée lorsqu’une manette est débranchée. Contrairement au texte du message, cette erreur s'affichera même si le robot n’est pas activé, ou même connecté à DS. Vous verrez une seule instance de ce message se produire chaque fois que Driver Station est démarré, même si les manettes sont correctement connectées et fonctionnent.
tr_tr: Bu hata, bir Joystick bağlantısız olduğunda tetiklenir. Mesaj metninin aksine bu hata, robot etkinleştirilmemiş veya hatta DS'ye bağlı olmasa bile oluşacaktır. Joystick'ler doğru şekilde bağlanmış ve çalışıyor olsa bile, Driver Station her başlatıldığında bu mesajın tek bir örneğinin oluştuğunu göreceksiniz.
zh_cn: 拔下操纵杆时会触发此错误。 与消息文本相反，即使未启用机械手，甚至未将其连接到DS，也会打印此错误。 即使操纵杆已正确连接并正常工作，每次启动Driver Station时，您都会看到此消息的单个实例。

source: Lost Communication
es_mx: Comunicación Perdida
fr_ca: Communication perdue
tr_tr: İletişimi Kaybetmek
zh_cn: 丢失通信

source: This Warning message is printed whenever the Driver Station loses communication with the robot (Communications indicator changing from green to red). A single instance of this message is printed when the DS starts up, before communication is established.
es_mx: Este mensaje de advertencia es mostrado cuando la Driver Station pierde comunicación con el robot (Indicador de comunicación cambia de verde a rojo). Una sola instancia de este mensaje es mostrada cuando la DS inicia, antes que se establezca comunicación.
fr_ca: Ce message d’avertissement s'affiche à chaque fois que Driver Station perd la communication avec le robot (indicateur de communication passant du vert au rouge). Une seule instance de ce message s'affiche lorsque DS démarre, avant que la communication ne soit établie.
tr_tr: Bu Uyarı mesajı, Driver Station robotla iletişimi kaybettiğinde oluşur (İletişim göstergesi yeşilden kırmızıya döner). Bu mesajın tek bir örneği, iletişim kurulmadan önce DS başladığında oluşur.
zh_cn: 每当Driver Station失去与机器人的通信（通信指示灯从绿色变为红色）时，就会打印此警告消息。 在建立通信之前，DS启动时将打印此消息的单个实例。

source: Ping Status
fr_ca: Statut ping
tr_tr: Ping Durumu
zh_cn: ping状态

source: A Ping Status warning is generated each time the Ping Status to a device changes while the DS is not in communication with the roboRIO. As communications is being established when the DS starts up, a few of these warnings will appear as the Ethernet link comes up, then the connection to the robot radio, then the roboRIO (with FMS mixed in if applicable). If communications are later lost, the ping status change may help identify at which component the communication chain broke.
es_mx: Una advertencia de estado de Ping es generada cada vez que el estado de ping a de un dispositivo cambia mientras la DS no se está comunicando con la roboRIO. Mientras la comunicación se establece cuando la DS está iniciándose, algunas de estas advertencias aparecerán mientras el link del Ethernet aparece, después la conexión del radio del robot, luego la roboRIO (con FMs combinados si es aplicable). Si la comunicación se pierde más tarde, el cambio del estado del ping podría ayudar a identificar que componente de la cadena de comunicación falló.
fr_ca: Un avertissement d'avis de statut est généré à chaque fois que l'avis de statut d'un périphérique change alors que DS n’est pas en communication avec le roboRIO. Comme les communications sont en cours d’établissement lorsque DS démarre, quelques-uns de ces avertissements apparaîtront au fur et à mesure que le lien Ethernet apparaît, puis la connexion à la radio du robot, puis le roboRIO (avec FMS inclus le cas échéant). Si les communications sont perdues ultérieurement, le changement d'avis de statut ping pourra aider à identifier le composant où la chaîne de communication s’est rompue.
tr_tr: DS roboRIO ile iletişim halinde değilken bir cihazda Ping Durumu her değiştiğinde bir Ping Durumu uyarısı oluşturulur. DS başladığında iletişim kurulduğu için, Ethernet bağlantısı geldiğinde bu uyarılardan birkaçı görünecek, ardından robot radyosuna, ardından roboRIO'ya (uygulanabilirse FMS karıştırılarak) bağlantı kurulacaktır. İletişim daha sonra kaybedilirse, ping durumu değişikliği iletişim zincirinin hangi bileşende kırıldığını belirlemeye yardımcı olabilir.
zh_cn: DS不与roboRIO通信时，每次设备的Ping状态更改时，都会生成Ping状态警告。 在DS启动时建立通信时，当以太网链接建立，与机器人无线电的连接，然后是roboRIO（如果有FMS的话）连接时，将出现一些警告。 如果以后丢失了通信，则ping状态更改可能有助于确定通信链中哪个组件断开连接。

source: Time Since Robot Boot
es_mx: Tiempo Desde El Reinicio Del Robot
fr_ca: Temps écoulé depuis le démarrage du robot
tr_tr: Robot Önyüklemesinden Bu Yana Geçen Süre
zh_cn: 自机器人启动后时间

source: This message is printed each time the DS begins communicating with the roboRIO. The message indicates the up-time, in seconds, of the roboRIO and can be used to determine if a loss of communication was due to a roboRIO Reboot.
es_mx: Este mensaje se muestra cada vez que la DS empieza a comunicarse con la roboRIO. El mensaje indica el tiempo de actividad, en segundos, de la roboRIO y puede usarse para determinar si la perdida de comunicación fue por el reinicio de la roboRIO.
fr_ca: Ce message s'affiche à chaque fois que DS commence à communiquer avec le roboRIO. Le message indique la durée de fonctionnement, en secondes, du roboRIO et peut être utilisé pour déterminer si une perte de communication était due à un redémarrage du roboRIO.
tr_tr: Bu mesaj, DS roboRIO ile her iletişim kurmaya başladığında oluşur. Mesaj roboRIO’nun çalışma süresini saniye cinsinden belirtir ve bir roboRIO Yeniden Başlatılması nedeniyle iletişim kaybının olup olmadığını belirlemek için kullanılabilir.
zh_cn: 每次DS开始与roboRIO通信时，都会打印此消息。 该消息指示roboRIO的正常运行时间（以秒为单位），可用于确定是否由于roboRIO重新启动而导致通信丢失。

source: Radio Detection Times
fr_ca: Temps de détection de la radio
tr_tr: Radyo-Modem Algılama Süreleri
zh_cn: 信号检测时间

source: This message may be printed when the DS begins communicating with the roboRIO and indicates the time, in seconds, since the last time the radio was lost and seen. In the first example image above the message indicates that the roboRIO's connection to the radio was lost 19 seconds before the message was printed and the radio was seen again right when the message was printed. If multiple radioLost or radioSeen events have occurred since the roboRIO booted, up to 2 events of each type will be included, separated by commas.
es_mx: Este mensaje puede mostrarse cuando la DS inicie a comunicarse con la roboRIO e indica el tiempo, en segundos, desde la última vez que el radio paso por los eventos “lost” y “seen”. En el primer ejemplo, la imagen sobre el mensaje indica que la conexión entre radio y roboRIO se perdió 19 segundos antes que el mensaje se mostrará y el radio se viera correctamente cuando el mensaje se mostró. Si múltiples eventos de radioLost o radioSeen han ocurrido desde que la roboRIO se reinició, se incluirán hasta 2 eventos de cada tipo, separados por comas.
fr_ca: Ce message peut s'afficher lorsque DS commence à communiquer avec le roboRIO et indique le temps, en secondes, depuis la dernière fois que la radio a été perdue et vue. Dans le premier exemple, l’image au-dessus du message indique que la connexion du roboRIO avec la radio a été perdue 19 secondes avant l’impression du message et que la radio a été revue à nouveau juste lorsque le message a été imprimé. Si plusieurs événements radioLost ou radioseen se sont produits depuis le démarrage du roboRIO, jusqu’à 2 événements de chaque type seront inclus, séparés par des virgules.
tr_tr: Bu mesaj, DS roboRIO ile iletişim kurmaya başladığında yazdırılabilir ve modemin en son kaybolup görülmesinden bu yana geçen süreyi saniye cinsinden gösterir. Yukarıdaki ilk örnek görüntüde mesaj, roboRIO'nun telsiz bağlantısının mesaj yazdırılmadan 19 saniye önce kesildiğini ve mesaj yazdırıldığında telsizin tekrar görüldüğünü gösterir. RoboRIO'nun başlatılmasından bu yana birden fazla radioLost veya radioSeen olayı meydana gelirse, virgülle ayrılmış her türden en fazla 2 olay dahil edilecektir.
zh_cn: 当DS开始与roboRIO通信时，可能会打印此消息，并指示自上次丢失和看到无线电以来的时间（以秒为单位）。 在消息上方的第一个示例图像中，该消息指示roboRIO与无线电的连接在消息被打印之前19秒钟已丢失，并且在消息被打印时就再次看到了无线电。 如果自启动roboRIO以来发生了多个radioLost或radioSeen事件，则将包括每种类型的最多2个事件，并以逗号分隔。

source: No Robot Code
fr_ca: Pas de programme sur le robot
tr_tr: Robot Kodu Yok
zh_cn: 没有代码

source: This message is printed when the DS begins communicating with the roboRIO, but detects no robot code running. A single instance of this message will be printed if the Driver Station is open and running while the roboRIO is booting as the DS will begin communication with the roboRIO before the robot code finishes loading.
es_mx: Este mensaje se muestra cuando la DS inicia a comunicarse con la roboRIO, pero detecta que no hay un código ejecutándose. Una sola instancia de este mensaje será mostrada si la Driver Station está abierta y funcionando mientras la roboRIO está arrancando mientras la DS empezara una comunicación con la roboRIO antes que el código del robot termine de cargar.
fr_ca: Ce message s'affiche lorsque DS commence à communiquer avec le roboRIO, mais ne détecte aucun code Robot en cours d’exécution. Une seule instance de ce message sera émis si Driver Station est déjà ouvert et en cours d’exécution pendant que le roboRIO est en train de démarrer tandis que DS commencera la communication avec le roboRIO avant la fin du chargement du programme Robot.
tr_tr: Bu mesaj, DS roboRIO ile iletişim kurmaya başladığında, ancak çalışan robot kodu algılamadığında oluşur. RoboRIO önyüklenirken Driver Station açıksa ve çalışıyorsa bu mesajın tek bir örneği oluşacaktır, çünkü DS robot kodu yüklemeyi bitirmeden önce roboRIO ile iletişime başlayacaktır.
zh_cn: DS开始与roboRIO通信但未检测到运行中的机械人代码时，将显示此消息。 如果在启动roboRIO时Driver Station已打开并正在运行，则将打印此消息的1个实例，因为DS将在机器人代码完成加载之前开始与roboRIO通信。
