Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/imaging-your-classmate.po
Languages: es_mx, fr_ca, tr_tr

source: Imaging your Classmate (Veteran Image Download)
es_mx: Crear la visualización de su Classmate (Descargar imágenes)
fr_ca: Installation de l'image du Classmate (Vétérans: télécharger l'image)
tr_tr: Classmate Görüntüleme (Profesyonel Resim İndirme)

source: Veteran teams are not required to re-image their classmate
es_mx: Los equipos veteranos no están obligados a volver a crear una imagen para su Classmate.
fr_ca: Les équipes vétéranes ne sont pas contraintes de re-installer une image dans leur Classmate
tr_tr: Deneyimli takımların Classmate computer imajını yeniden oluşturmaları gerekmez.

source: This document describes the procedure for creating a bootable USB drive to restore the FRC\ |reg| image on a Classmate computer. If you do not wish to re-image your Classmate then you can start with the appropriate document for C++/Java, LabVIEW, or DS only.
es_mx: Este documento describe el procedimiento para crear una unidad USB de arranque para restaurar la imagen FRC\ |reg| en la computadora Classmate. Si no desea volver a crear la imagen de su Classmate, entonces puede comenzar con el documento apropiado para C++/Java, LabVIEW, o DS solamente.
fr_ca: Ce document décrit la procédure de création d’une clé USB de démarrage pour restaurer l'image FRC\ |reg| sur un ordinateur Classmate. Si vous ne souhaitez pas re-installer l'image de votre ordinateur Classmate, alors vous pouvez commencer avec le document approprié pour C++/Java, LabVIEW, ou DS seulement.
tr_tr: Bu belge, FRC \ |reg| geri yüklemek için önyüklenebilir bir USB sürücü oluşturma prosedürünü açıklar Classmate bilgisayarındaki görüntü. Classmate imajını yeniden oluşturmak istemiyorsanız, yalnızca C ++ / Java, LabVIEW veya DS için uygun belgeyle başlayabilirsiniz.

source: Prerequisites
es_mx: Requisitos previos
fr_ca: Prérequis
tr_tr: Önkoşullar

source: E09, E11, E12, or E14 Classmate computer or Acer ES1 computer
es_mx: Computadora Classmate E09, E11, E12, o E14 o computadora Acer ES1
fr_ca: Classmate portable E09, E11, E12, ou E14 ou un ordinateur Acer ES1
tr_tr: E09, E11, E12 veya E14 takım arkadaşınızın bilgisayarı veya Acer ES1 bilgisayarı

source: 16GB or larger USB drive
es_mx: Unidad USB de 16GB o más grande
fr_ca: Une clé USB de 16Go ou de plus grande capacité
tr_tr: 16GB veya daha büyük USB sürücü

source: 7-Zip software installed (download `here <https://www.7-zip.org>`__). As of the writing of this document, the current released version is 19.00 (2019-02-21).
es_mx: Software 7-Zip instalado (descargue `here <https://www.7-zip.org>`__). A partir de la redacción de este documento , la versión actual es 19.00 (2019-02-21).
fr_ca: Logiciel 7-Zip installé (le télécharger `ici <https://www.7-zip.org>`__). Au moment de rédiger ce document, la version publiée est 19.00 (2019-02-21).
tr_tr: 7-Zip yazılımı yüklendi (`buradan <https://www.7-zip.org>` __ indirin). Bu belgenin yazıldığı tarih itibariyle, mevcut yayınlanmış sürüm 19.00'dır (2019-02-21).

source: RMprepUSB software installed (download `here <https://rmprepusb.com/>`__). Scroll down the page and select the stable (Full) version download link. As of the writing of this document, the current stable version is 2.1.745.
es_mx: El software RMprepUSB está instalado (descárguelo `aquí <https://rmprepusb.com/>`__). Desplácese hacia abajo en la página y seleccione el enlace de descarga de la versión estable (completa). En el momento de escribir este documento, la versión estable actual es la 2.1.745.
fr_ca: Logiciel RMprepUSB installé (télécharger `ici <https://rmprepusb.com/>`__). Faites défiler la page et sélectionnez le lien de téléchargement de la version stable (complète). Au moment de la rédaction de ce document, la version stable actuelle est de 2.1.745.

source: Download the Computer Image
es_mx: Descargar la visualización para la computadora
fr_ca: Télécharger l'image de l'ordinateur
tr_tr: Bilgisayar Görüntüsünü İndirin

source: Image of portal website showing each of the different classmate computers and their image.
fr_ca: Image du portail Web montrant chacun des différents ordinateurs portables classmate et leur image.

source: Download the image from the `FIRST FRC Driver Station System Image Portal <https://frc-events.firstinspires.org/services/DSImages/>`__. There are several computer images available, one for each model. On the download site, select the option that matches your computer by clicking the button below the image. Due to the limited size of the hard drive in the E09, it is supported with a DS/Utilities image only and does not have the IDEs for LabVIEW or C++/Java installed. All other images have the LabVIEW base installation already present.
es_mx: Descargue la imagen de `FIRST FRC Driver Station System Image Portal <https://frc-events.firstinspires.org/services/DSImages/>`__. Hay diferentes tipos de visualizaciones disponibles, para cada modelo. En el sitio de descargas, seleccione la opción que corresponda con su computadora, dando click al botón debajo de la imagen. Debido al tamaño limitado del disco duro en el E09, solo es compatible con una imagen de DS/Utilities y no tiene los IDEs para LabVIEW o C++/ Java instalados. Todas las otras imágenes tienen la base para la instalación de LabVIEW ya presente.
fr_ca: Téléchargez l’image à partir de `FIRST FRC Driver Station System Image Portal <https://frc-events.firstinspires.org/services/DSImages/>`__.. Il existe plusieurs images d'ordinateur disponibles, une pour chaque modèle. Sur le site de téléchargement, sélectionnez l’option qui correspond à votre ordinateur en cliquant sur le bouton sous l’image. En raison de la taille limitée du disque dur dans l’E09, il est pris en charge avec une image DS/Utilities uniquement et n’a pas les IDE pour LabVIEW ou C++/Java installés. Toutes les autres images ont déjà l’installation de base LabVIEW.
tr_tr: Görüntüyü `FIRST FRC Driver Station System Image Portal <https://frc-events.firstinspires.org/services/DSImages/>` __ 'dan indirin. Her model için bir tane olmak üzere birkaç bilgisayar görüntüsü mevcuttur. İndirme sitesinde, görselin altındaki düğmeyi tıklayarak bilgisayarınızla eşleşen seçeneği seçin. E09'daki sabit sürücünün sınırlı boyutu nedeniyle, yalnızca bir DS / Utilities görüntüsü ile desteklenir ve LabVIEW veya C ++ / Java için IDE'ler kurulu değildir. Diğer tüm görüntülerde LabVIEW temel kurulumu zaten mevcuttur.

source: These images only install the prerequisite core FRC software, it is still necessary to install the FRC specific updates. See the Update Software step for more information.
es_mx: Estas visualizaciones solo instalan el software de FRC pre requerido básico , aún es necesario instalar las actualizaciones específicas. Vea el apartado Update Software para más información.
fr_ca: Ces images n’installent que le préalable de base du logiciel FRC, il est toujours nécessaire d’installer les mises à jour FRC spécifiques. Pour plus d’informations, consultez l’étape Mettre à jour le logiciel.
tr_tr: Bu imajlar sadece önkoşul olan çekirdek FRC yazılımını kurarlar, yine de FRC'ye özgü güncellemelerin yüklenmesi gerekir. Daha fazla bilgi için lütfen ''Yazılımı Güncelle'' adımına bakın.

source: Due to computer availability, the E14 image provided is the 2018 image. If using this image, teams may need to remove the old IDE (LabVIEW or Eclipse) and install the new IDE.
es_mx: Debido a la disponibilidad de la computadora, la visualización de la E14 es una del 2018. Si está usando esta visualización, los equipos necesitarían remover el IDE antiguo (LabVIEW o Eclipse) e instalar el nuevo IDE.
fr_ca: En raison de la disponibilité de l’ordinateur, l’image E14 fournie est l’image 2018. Si vous utilisez cette image, les équipes peuvent devoir supprimer l’ancien IDE (LabVIEW ou Eclipse) et installer la nouvelle IDE.
tr_tr: Bilgisayar kullanılabilirliği nedeniyle, sağlanan E14 görüntüsü 2018 görüntüsüdür. Bu görüntüyü kullanıyorsanız, ekiplerin eski IDE'yi (LabVIEW veya Eclipse) kaldırması ve yeni IDE'yi yüklemesi gerekebilir.

source: Preparation
es_mx: Preparación
fr_ca: Préparation
tr_tr: Hazırlık

source: Place the image file downloaded from the site to a folder on your root drive (e.g. ``C:\2016_Image``).
es_mx: Coloque el archivo de la visualización descargado del sitio a una carpeta en su unidad raíz (e.g. ``C:\2016_Image``).
fr_ca: Placez le fichier image téléchargé à partir du site dans un dossier sur votre lecteur racine (p. ex. ``C:\2016_Image``).
tr_tr: Siteden indirilen görüntü dosyasını kök sürücünüzdeki bir klasöre yerleştirin (örneğin, `` C: \ 2016_Image ``).

source: Connect 16GB or larger USB Flash drive to the PC to use as the new restoration drive.
es_mx: Conecte una unidad Flash USB de 16GB o de mayor capacidad a la PC para utilizarla como nueva unidad de restauración.
fr_ca: Connectez un lecteur flash USB de 16 Go ou plus au PC afin de l’utiliser comme nouveau lecteur de restauration.
tr_tr: Yeni geri yükleme sürücüsü olarak kullanmak için 16 GB veya daha büyük USB Flash sürücüsünü bilgisayara bağlayın.

source: Using RMPrep with a USB drive.
fr_ca: Utilisation de RMPrep avec un lecteur USB.

source: Start/Run RMprepUSB
es_mx: Inicie/Ejecute RMprepUSB
fr_ca: Démarrer/Exécuter RMprepUSB
tr_tr: RMprepUSB'yi Başlat / Çalıştır

source: Select USB Drive
es_mx: Seleccione USB Drive
fr_ca: Sélectionner le lecteur USB
tr_tr: USB Sürücüyü Seçin

source: Set Partition Size
es_mx: Establecer tamaño de división
fr_ca: Définir la taille de la partition
tr_tr: Bölme Boyutunu Ayarla

source: Highlights the "Partition Size" box.
fr_ca: Met en surbrillance la case "Partition Size" (Taille de partition).

source: Set Partition Size to MAX
es_mx: Establezca el tamaño de división a MAX.
fr_ca: Fixez la taille de la partition à MAX
tr_tr: Bölme Boyutunu ''MAX'' olarak ayarlayın

source: Set Volume Label
es_mx: Establecer el Volumen Label
fr_ca: Définir l’étiquette de volume
tr_tr: Hacim Etiketini Ayarla

source: Hightlights the "Volume Label" box to the right of the partition size.
fr_ca: Hightlights la case "Volume Label" ou " Étiquette de volume" à droite de la taille de la partition.

source: Set Volume Label to Generic
es_mx: Configure el Volume Label en Generic.
fr_ca: Réglez l’étiquette de volume sur générique
tr_tr: Birim Etiketini Genel Olarak Ayarlayın

source: Set Bootloader Option
es_mx: Seleccionar una opción Bootloader
fr_ca: Définir l’option du Bootloader
tr_tr: Bootloader Seçeneğini Ayarla

source: Highlights the “WinPE v2/WinPE v3/Vista/Win7 bootable” radio button.
fr_ca: Met en surbrillance la case d’option “WinPE v2/WinPE v3/Vista/Win7 bootable”.

source: Select Bootloader Option "WinPE v2/WinPE v3/Vista/Win7 bootable"
es_mx: Seleccione la opción de Bootloader "WinPE v2/WinPE v3/Vista/Win7 bootable"
fr_ca: Sélectionnez l'option Bootloader "WinPE v2/WinPE v3/Vista/Win7 bootable"

source: Select Filesystem
es_mx: Selecciona Filesystem
fr_ca: Sélectionner le système de fichiers
tr_tr: Dosya sistemini seçin

source: Highlights the "NTFS" radio button.
fr_ca: Met en surbrillance la case d’option "NTFS".

source: Select NTFS Filesystem
es_mx: Seleccione NTFS como Filesystem
fr_ca: Sélectionnez le système de fichiers NTFS
tr_tr: NTFS Dosya Sistemini Seçin

source: Copy OS Files Option
es_mx: Opción Copy OS Files
fr_ca: Option copier les fichiers OS
tr_tr: İşletim Sistemi Dosyalarını Kopyalama Seçeneği

source: Highlights the “Copy OS files after Format” checkbox.
fr_ca: Met en surbrillance la case à cocher “Copy OS files after Format”.

source: Ensure the "Copy OS files after Format" box is checked
es_mx: Asegúrese de que la casilla "Copiar archivos del sistema operativo después de formatear" esté marcada
fr_ca: Assurez-vous que la case "Copy OS files after Format" est cochée

source: Locate Image
es_mx: Ubicar la visualización
fr_ca: Localiser l’image
tr_tr: Resmi Bul

source: Highlights the “Choose Folder/File” button.
fr_ca: Met en surbrillance le bouton “Choose Folder/File”.

source: Select the "Choose Folder/File" button
es_mx: Seleccione el botón "Choose Folder/File"
fr_ca: Sélectionnez le bouton "Choose Folder/File"

source: Copy Files Dialog
es_mx: Solicitud de Copiar Archivos
fr_ca: Boîte de dialogue Copier les fichiers
tr_tr: Dosyaları Kopyala İletişim Kutusu

source: Choose "No" from the options of "Yes", "No", and "Cancel" of the dialog box.
fr_ca: Choisissez "No" dans les options "Yes", "No", et "Cancel" de la boîte de dialogue.

source: Choose "No" and select your ``.7z`` image
es_mx: Elija "No" y seleccione su imagen `` .7z ''
fr_ca: Choisissez "No" et sélectionnez votre image ``.7z``

source: Prepare Drive
fr_ca: Préparer le lecteur
tr_tr: Sürüşü Hazırlayın

source: Click the “Prepare Drive” button.
fr_ca: Cliquez sur le bouton “Prepare Drive”.

source: All configuration settings are now complete. Select "Prepare Drive" to begin the process
es_mx: Todos los ajustes de configuración ahora están completos. Seleccione "Preparar unidad" para comenzar el proceso.
fr_ca: La configuration de tous les paramètres est maintenant terminée. Sélectionnez "Prepare Drive" pour lancer le processus

source: Confirmation Dialog 1
es_mx: Solicitud de confirmación 1
fr_ca: Boîte de dialogue de confirmation 1
tr_tr: Onay İletişim Kutusu 1

source: Click the "OK" button on the dialog.
fr_ca: Cliquez sur le bouton "OK" dans la boîte de dialogue.

source: Click "OK" to execute the command on the selected USB Flash drive. A Command Prompt will open showing the progress
es_mx: Haga clic en "OK" para ejecutar el comando en la unidad flash USB seleccionada. Se abrirá un símbolo del sistema que muestra el progreso
fr_ca: Cliquez sur "OK" pour exécuter la commande sur le lecteur Flash USB sélectionné. Une invite de commande s’ouvrira montrant la progression

source: Confirmation Dialog 2
es_mx: Solicitud de confirmación 2
fr_ca: Boîte de dialogue de confirmation 2
tr_tr: Onay İletişim Kutusu 2

source: Click "OK" again that it is okay to erase all data on the drive.
fr_ca: Cliquez à nouveau sur "OK" pour effacer toutes les données du lecteur.

source: Click "OK" to format the USB drive
es_mx: Haga clic en "OK" para formatear la unidad USB.
fr_ca: Cliquez sur "OK" pour formater la clé USB

source: **ALL DATA ON THE DRIVE WILL BE ERASED!**
es_mx: **¡TODA LA INFORMACIÓN EN EL DRIVE SERÁ ELIMINADA!**
fr_ca: **TOUTES LES DONNÉES DANS LA CLÉ SERONT EFFACÉES!**
tr_tr: ** SÜRÜCÜDEKİ TÜM VERİLER SİLİNECEKTİR! **

source: Decryption
es_mx: Descifrar
fr_ca: Décryptage
tr_tr: Şifre çözme

source: If you are using an encrypted version of the image downloaded before kickoff you will be prompted to enter the decryption key found at the end of the Kickoff video.
es_mx: Si está usando una versión encriptada de la visualización descargada antes de iniciar se le pedirá que ingrese la clave para descifrarla, que se encuentra al final del video.
fr_ca: Si vous utilisez une version cryptée de l’image téléchargée avant le kickoff, vous serez invité à entrer la clé de décryptage trouvée à la fin de la vidéo de lancement.
tr_tr: Başlamadan önce indirilen görüntünün şifreli bir sürümünü kullanıyorsanız, Kickoff videosunun sonunda bulunan şifre çözme anahtarını girmeniz istenecektir.

source: Copy Complete
es_mx: Copia Completa
fr_ca: Copie terminée
tr_tr: Kopyalama Tamamlandı

source: Click "OK" to acknowledge that the copy completed.
fr_ca: Cliquez sur "OK" pour confirmer que la copie est terminée.

source: Once formatting is complete, the restoration files will be extracted and copied to the USB drive. This process should take ~15 minutes when connected to a USB 2.0 port. When all files have been copied, this message will appear, press OK to continue.
es_mx: Una vez que se ha completado el formateo, los archivos de restauración serán extraidos y copiados a la unidad USB. Este proceso debería de tomar ~ 15 minutos cuando se conecte a un puerto USB 2.0. Cuando todos los archivos hayan sido copiados, este mensaje aparecerá, presione OK para continuar.
fr_ca: Une fois le formatage terminé, les fichiers de restauration seront extraits et copiés dans la clé USB. Ce processus devrait prendre environ 15 minutes lorsqu’il est connecté à un port USB 2.0. Lorsque tous les fichiers ont été copiés, ce message s’affiche, appuyez sur OK pour continuer.
tr_tr: Biçimlendirme tamamlandığında, geri yükleme dosyaları çıkarılacak ve USB sürücüye kopyalanacaktır. Bu işlem, bir USB 2.0 bağlantı noktasına bağlandığında yaklaşık 15 dakika sürecektir. Tüm dosyalar kopyalandığında bu mesaj görünecektir, devam etmek için ''OK'' tuşuna basın.

source: Eject Drive
es_mx: Expulsar unidad Drive
fr_ca: Éjection de la clé USB
tr_tr: Sürücüyü Çıkar

source: Click the “Eject Drive” button on the right hand side in the center.
fr_ca: Cliquez sur le bouton “Eject Drive” sur le côté droit au centre.

source: Press the "Eject Drive" button to safely remove the USB drive. The USB drive is now ready to be used to restore the image onto the PC.
es_mx: Presione el botón "Expulsar unidad" para extraer de forma segura la unidad USB. La unidad USB ahora está lista para ser utilizada para restaurar la imagen en la PC.
fr_ca: Appuyez sur le bouton "Eject Drive" pour retirer la clé USB en toute sécurité. La clé USB est maintenant prête à être utilisée pour restaurer l’image du PC.

source: Hardware Setup
es_mx: Configuración del Hardware
fr_ca: Configuration matérielle
tr_tr: Donanım Kurulumu

source: Make sure the computer is turned off, but plugged in.
es_mx: Asegúrese que la computadora está apagada, pero enchufada.
fr_ca: Assurez-vous que l’ordinateur est éteint, mais branché.
tr_tr: Bilgisayarın kapalı ama prize takılı olduğundan emin olun.

source: Insert the USB Thumb Drive into a USB port on the Driver Station computer.
es_mx: Inserte la memoria USB en un puerto USB en la computadora de la Driver Station
fr_ca: Insérez la clé USB dans un port USB de l’ordinateur de pilotage.
tr_tr: USB Thumb Sürücüsünü Driver Station bilgisayarındaki bir USB bağlantı noktasına takın.

source: Boot to USB
es_mx: Iniciar en la USB
fr_ca: Démarrer sur USB
tr_tr: USB'ye önyükleme

source: Three images that show the 2GO PC then the boot menu in BIOS.
fr_ca: Trois images qui montrent le PC 2GO puis le menu de démarrage dans le BIOS.

source: Power on the Classmate and tap the F11 key on the keyboard. Tapping the F11 key during boot will bring up the boot menu.
es_mx: Encienda la Classmate y presione la tecla F11 en el teclado. Presionar la Tecla F11 durante el inicio mostrará el menú de inicio.
fr_ca: Allumez le Classmate et appuyez sur la touche F11 sur le clavier. Appuyer sur la touche F11 pendant le démarrage fera apparaître le menu de démarrage.
tr_tr: Classmate computeri açın ve klavyedeki F11 tuşuna dokunun. Önyükleme sırasında F11 tuşuna dokunmak önyükleme menüsünü getirecektir.

source: Use the up/down keys to select the **USB HDD:** entry on the menu, then press the right arrow to expand the listing
es_mx: Use las teclas de arriba/abajo para seleccionar la entrada **USB HDD:** en el menú, después presione la flecha de la derecha para expandir la lista.
fr_ca: Utilisez les touches haut/bas pour sélectionner l’entrée **USB HDD:** dans le menu, puis appuyez sur la flèche droite pour étendre la liste
tr_tr: Menüdeki ** USB HDD: ** girişini seçmek için yukarı / aşağı tuşlarını kullanın, ardından listeyi genişletmek için sağ oka basın.

source: Use the up/down arrow keys on the keyboard to select the USB device (it will be called "Generic Flash Disk"). Press the ENTER key when the USB device is highlighted.
es_mx: Use las teclas de flecha arriba / abajo del teclado para seleccionar el dispositivo USB (se llamará "Disco Flash genérico"). Presione la tecla ENTER cuando el dispositivo USB esté resaltado.
fr_ca: Utilisez les touches de fléchées haut/bas du clavier pour sélectionner le périphérique USB (on le nommera "Generic Flash Disk"). Appuyez sur la touche ENTRÉE lorsque le périphérique USB est mis en surbrillance.

source: Power on the computer and tap the F12 key on the keyboard. Tapping the F12 key during boot will bring up the boot menu.
es_mx: Encienda la computadora y presione la tecla F12 en el teclado. Presione la tecla F12 durante el inicio para mostrar el menu de inicio.
fr_ca: Allumez l’ordinateur et appuyez sur la touche F12 sur le clavier. Appuyer sur la touche F12 pendant le démarrage fera apparaitre le menu de démarrage.
tr_tr: Bilgisayarı açın ve klavyedeki F12 tuşuna dokunun. Önyükleme sırasında F12 tuşuna dokunmak önyükleme menüsünü getirecektir.

source: Use the up/down keys to select the **USB HDD: Generic** entry on the menu, then press the ENTER key when the USB device is highlighted.
es_mx: Use las teclas de arriba/abajo para seleccionar la entrada **USB HDD: Generic** en el menú, después presione la tecla ENTER cuando el dispositivo USB esté resaltado.
fr_ca: Utilisez les touches haut/bas pour sélectionner l’entrée **USB HDD: Generic** dans le menu, puis appuyez sur la touche ENTRÉE lorsque le périphérique USB est mis en surbrillance.
tr_tr: Menüdeki ** USB HDD: Genel ** girişini seçmek için yukarı / aşağı tuşlarını kullanın, ardından USB cihazı vurgulandığında ''ENTER'' tuşuna basın.

source: **Acer ES1: If pressing F12 does not pull up the boot menu or if the USB device is not listed in the boot menu, see "Checking BIOS Settings" at the bottom of this article.**
es_mx: **Acer ES1: Si presiona F12 y no abre el menú de inicio o si el dispositivo USB no está listado en el menú de inicio, vea “Checking BIOS Setting” al fondo de este articulo.**
fr_ca: **Acer ES1: Si le fait d'appuyer sur F12 n'ouvre pas le menu de démarrage ou si le périphérique USB n’est pas répertorié dans le menu de démarrage, consultez "Checking BIOS Settings" en bas de cet article.**
tr_tr: ** Acer ES1: F12'ye basmak önyükleme menüsünü açmazsa veya USB aygıtı önyükleme menüsünde listelenmiyorsa, bu makalenin altındaki "BIOS Ayarlarını Kontrol Etme" bölümüne bakın. **

source: Image the Classmate
es_mx: Establecer una imagen a su Classmate
fr_ca: Installation de l'image du Classmate
tr_tr: Classmate görüntüsü

source: Two images of a command prompt where you type "1" then "Y".
fr_ca: Deux images d’une invite de commande où vous tapez "1" puis "Y".

source: To confirm that you want to reimage the Classmate, type "1" and press ENTER.
es_mx: Para confirmar que desea volver a crear una imagen del Classmate, escriba "1" y presione ENTER.
fr_ca: Pour confirmer que vous souhaitez réinstaller une image dans votre Classmate, tapez "1" et appuyez sur ENTRÉE.

source: Then, type "Y" and press ENTER. The Classmate will begin re-imaging. The installation will take 15-30 minutes.
es_mx: Luego, escriba "Y" y presione ENTER. El compañero de clase comenzará a crear nuevas imágenes. La instalación tardará entre 15 -30 minutos.
fr_ca: Ensuite, tapez "Y" et appuyez sur ENTRÉE. La réinstallation de l'image dans votre Classmate va débuter. L’installation prendra 15-30 minutes.

source: When the installation is complete, remove the USB drive.
es_mx: Cuando la instalación sea completada, remueva la unidad USB.
fr_ca: Lorsque l’installation est terminée, retirez la clé USB.
tr_tr: Kurulum tamamlandığında USB sürücüsünü çıkarın.

source: Restart the Classmate. The Classmate will boot into Windows.
es_mx: Reinicie la Classmate. La Classmate arrancará en Windows.
fr_ca: Redémarrez le Classmate. Le Classmate va démarrer sous Windows.
tr_tr: Classmate computeri yeniden başlatın. Classmate computer Windows'a önyükleme yapacaktır.

source: Initial Driver Station Boot
es_mx: Arranque inicial de la Driver Station
fr_ca: Démarrage initial de l'ordinateur de pilotage
tr_tr: Başlangıçta Sürücü İstasyonunu Önyükleme
