Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/imaging-your-classmate.po
Languages: es_mx, fr_ca, tr_tr

source: The first time the Classmate is turned on, there are some unique steps, listed below, that you’ll need to take. The initial boot may take several minutes; make sure you do not cycle power during the process.
es_mx: La primera vez que la Classmate es encendida, hay varios pasos, enlistados debajo, que deberá de tomar. El arranque inicial puede tardar varios minutos; asegúrese de no prender y apagar la computadora durante el proceso.
fr_ca: La première fois que le Classmate est activé, il y a quelques étapes, énumérés ci-dessous, que vous aurez besoin de suivre. Le démarrage initial peut prendre plusieurs minutes; assurez-vous de ne pas éteindre et rallumer l'ordinateur pendant le processus.
tr_tr: Classmate computeri ilk açtığınızda, aşağıda listelenen ve uygulamanız gereken bazı adımlar vardır. İlk başlatma birkaç dakika sürebilir; işlem sırasında gücü kapatıp açmadığınızdan emin olun.

source: These steps are only required during original startup.
es_mx: Estos pasos son solo requeridos durante la primera configuración.
fr_ca: Ces étapes ne sont requises que lors du démarrage initial.
tr_tr: Bu adımlar yalnızca orijinal başlatma sırasında gereklidir.

source: Enter Setup
es_mx: Empezar la configuración
fr_ca: Entrez la configuration
tr_tr: Kuruluma gir.

source: Log into the Developer account.
es_mx: Inicie sesión en la cuenta del desarrollador.
fr_ca: Connectez-vous au compte Developer
tr_tr: Geliştirici hesabına giriş yapın.

source: Click "Ask me later".
es_mx: Haga clic en "Preguntarme más tarde".
fr_ca: Cliquez sur "Ask me later".

source: Click "OK". The computer now enters a Set Up that may take a few minutes.
es_mx: Haga clic en "OK". La computadora ingresa ahora en una Configuración que puede demorar unos minutos.
fr_ca: Cliquez sur "OK". L’ordinateur entre maintenant en mode configuration, ce qui peut prendre quelques minutes.

source: Activate Windows
es_mx: Activar Windows
fr_ca: Activation de Windows
tr_tr: Windows'u etkinleştir

source: Establish an Internet connection.
es_mx: Establezca una conexión a Internet.
fr_ca: Établissez une connexion Internet.
tr_tr: İnternet bağlantısı kurun.

source: Once you have an Internet connection, click the Start menu, right click "Computer" and click "Properties".
es_mx: Una vez que tenga una conexión a Internet, haga clic en el menú Inicio, haga clic derecho en "Equipo" y haga clic en "Propiedades".
fr_ca: Une fois que vous avez une connexion Internet, cliquez sur le menu Start cliquez avec le bouton droit sur "Computer" et cliquez sur "Properties".

source: Scroll to the bottom section, "Windows activation", and Click "Activate Windows now"
es_mx: Desplácese hasta la sección inferior, "Activación de Windows" y haga clic en "Activar Windows ahora".
fr_ca: Faites défiler vers la section inférieure, "Windows activation", puis cliquez sur "Activate Windows now"

source: Click "Activate Windows online now". The activation may take a few minutes.
es_mx: Haga clic en "Activar Windows en línea ahora". La activación puede tardar unos minutos.
fr_ca: Cliquez sur "Activate Windows online now". L’activation peut prendre quelques minutes.

source: When the activation is complete, close all of the windows.
es_mx: Cuando la activación se complete, cierre todas las ventanas.
fr_ca: Lorsque l’activation est complétée, fermez toutes les fenêtres.
tr_tr: Aktivasyon tamamlandığında tüm pencereleri kapatın.

source: Microsoft Security Essentials
fr_ca: Essentiels de sécurité Microsoft
tr_tr: Microsoft Güvenlik Araçları

source: Navigate through the Microsoft Security Essentials Setup Wizard. Once it is complete, close all of the windows.
es_mx: Navegue a través de Microsoft Security Essential Setup Wizard. Una vez que sea completado, cierre todas las ventanas.
fr_ca: Naviguez dans l’assistant de configuration de Microsoft Security Essentials. Une fois terminé, fermez toutes les fenêtres.
tr_tr: ''Microsoft Kurulum Sihirbazı''nda gezinin. Tamamlandığında tüm pencereleri kapatın.

source: Acer ES1: Fix Wireless Driver
es_mx: Acer ES1: Arreglar controlador inalámbrico
fr_ca: Acer ES1 : Réparer le pilote de la carte sans fil
tr_tr: Acer ES1: Kablosuz Sürücüyü Düzeltin

source: Highlights the "Device Manager" option in the start menu.
fr_ca: Met en surbrillance l’option "Device Manager" ou "Gestionnaire de périphériques" dans le menu Démarrer.

source: **Acer ES1 PC only!**
es_mx: **¡Solo computadoras Acer ES1!**
fr_ca: **Seulement pour PC Acer ES1 PC!**
tr_tr: **Yalnızca Acer ES1 PC!**

source: The default wireless driver in the image may have issues with intermittent communication with the robot radio. The correct driver is in the image, but could not be set to load by default. To load the correct driver, open the Device Manager by clicking start, typing "Device Manager" in the box and clicking Device Manager.
es_mx: El controlador inalámbrico predeterminado en la imagen puede tener problemas con la comunicación intermitente con el radio del robot. El controlador correcto está en la imagen, pero no se puede cargar por defecto. Para cargar el controlador correcto, abra el Device Manager dando clic en start, tecleando “Device Manager” en la casilla y dando click en Device Manager.
fr_ca: Le pilote par défaut de la carte sans fil peut présenter des problèmes de communication intermittente avec la radio du robot. Le pilote approprié est celui inclus dans l’image, mais il n’est pas configuré pour se charger par défaut. Pour remédier à cela, ouvrez le Gestionnaire de périphériques en cliquant sur Start, en tapant "Device manager" dans la zone texte et en cliquant sur Device manager.
tr_tr: Görüntüdeki varsayılan kablosuz sürücü, robot radyosuyla kesintili iletişimle ilgili sorunlar yaşıyor olabilir. Doğru sürücü görüntüdedir, ancak varsayılan olarak yüklenecek şekilde ayarlanmamıştır. Doğru sürücüyü yüklemek için, ''Başlat''a tıklayarak, kutuya "Aygıt Yöneticisi" yazın ve ''Aygıt Yöneticisi''nden ''Aygıt Yöneticisi''ni açın.

source: Open Wireless Device Properties
es_mx: Abrir las propiedades de dispositivos inalámbricos
fr_ca: Ouvrir Wireless Device Properties
tr_tr: Kablosuz Cihaz Özelliklerini Açın

source: Opening the properties of the wireless adapter.
fr_ca: Ouverture des propriétés de la carte sans fil.

source: Click on the arrow next to Network Adapters to expand it and locate the Wireless Network Adapter. Right click the adapter and select Properties.
es_mx: De clic en la flecha siguiente a Network Adapters para expandirla y localizar el Wireless Network Adapter. Click derecho en el adaptador y seleccione Properties.
fr_ca: Cliquez sur la flèche à côté de Network Adapters pour l’étendre et localiser l'Adaptateur Réseau Sans Fil. Cliquez avec le bouton droit sur l’adaptateur et sélectionnez Properties.
tr_tr: Genişletmek ve Kablosuz Ağ Adaptörünü bulmak için ''Ağ Adaptörleri''nin yanındaki oka tıklayın. Bağdaştırıcıya sağ tıklayın ve ''Özellikler''i seçin.

source: Uninstall-Driver
es_mx: Desinsatalar -Driver
fr_ca: Désinstallation du pilote
tr_tr: Kaldırma Sürücüsü

source: Clicking on the Driver tab in top center and then on the "Uninstall" button.
fr_ca: En cliquant sur l’onglet Driver en haut au centre, puis sur le bouton "Uninstall" ou "Désinstaller".

source: Click on the Driver tab, then click the Uninstall button. Click Yes at any prompts.
es_mx: De click en la pestaña Driver, después de click en el botón Desinstalar, De click en Yes en cualquier solicitud.
fr_ca: Cliquez sur l’onglet Driver, puis cliquez sur le bouton Uninstall. Cliquez sur Yes à toutes les invites.
tr_tr: Sürücü sekmesine ve ardından ''Kaldır'' düğmesine tıklayın. Herhangi bir istemde ''Evet''i tıklayın.

source: Scan for New Hardware
es_mx: Buscar un nuevo dispositivo hardware
fr_ca: Recherche de tout nouveau composant matériel
tr_tr: Yeni Donanımı Tara

source: Within Device Manager right click on the PC and choose "Scan for hardware changes".
fr_ca: Dans le Gestionnaire de périphériques, cliquez sur le bouton droit et choisissez "Rechercher les modifications matérielles".

source: Right click on the top entry of the tree and click "Scan for hardware changes". The wireless adapter should automatically be re-detected and the correct driver should be installed.
es_mx: Click derecho en la entrada superior de los tres y click en “Scan for hardware changes”. El adaptador inalámbrico debería de ser detectado automáticamente de nuevo y el driver correcto debería de estar instalado.
fr_ca: Cliquez avec le bouton droit sur l’entrée supérieure de l’arborescence et cliquez sur "Scan for hardware changes". L’adaptateur sans fil devrait automatiquement être détecté et le bon pilote installé.
tr_tr: Ağacın üst girişini sağ tıklayın ve "Donanım değişikliklerini tara" seçeneğini tıklayın. Kablosuz adaptör otomatik olarak yeniden algılanmalı ve doğru sürücü kurulmalıdır.

source: Update Software
es_mx: Actualizar el Software
fr_ca: Mise à jour du logiciel
tr_tr: Yazılımı Güncelle

source: In order for the Classmate images to be prepared on time, they are created before the final versions of the software were ready. To use the software for FRC some additional components will need to be installed. LabVIEW teams should continue with Installing the FRC Game Tools (All Languages). C++ or Java teams should continue Installing C++ and Java Development Tools for FRC.
es_mx: Para que las imágenes de la Classmate estén a tiempo, son creadas antes de la versión final del software esté lista. Para utilizar el software de FRC, algunos componentes adicionales necesitan ser instalados. Los equipos que usen LabVIEW deberían de continuar instalando las FRC Game Tools (Todos los lenguajes). Los equipos C++ o Java deberían de continuar instalando C++ and Java Developement Tools para FRC.
fr_ca: Afin que les images de Classmate soient préparées à temps, elles sont créées avant que les versions finales du logiciel ne soient prêtes. Pour utiliser le logiciel dédié à la FRC, certains composants supplémentaires devront être installés. Les équipes LabVIEW doivent continuer à installer les FRC Game Tools (pour tous les langages). Les équipes C++ ou Java doivent continuer à installer C++ and Java Development Tools for FRC.
tr_tr: Classmate görsellerinin zamanında hazırlanabilmesi için yazılımın son sürümleri hazır olmadan önce oluşturulurlar. Yazılımı FRC için kullanmak için bazı ek bileşenlerin yüklenmesi gerekir. LabVIEW ekipleri FRC Oyun Araçlarını (Tüm Diller) Yükleme ile devam etmelidir. C ++ veya Java ekipleri FRC için C ++ ve Java Geliştirme araçlarını kurmaya devam etmelidir.

source: Errors during Imaging Process
es_mx: Errores durante el procesamiento de imágenes
fr_ca: Erreurs possibles durant le processus d'installation de l’image
tr_tr: Görüntüleme İşlemi Sırasındaki Hatalar

source: Command prompt error window on image failure.
fr_ca: Fenêtre d’invite de commandes d’erreur en cas d’échec de l’image.

source: If an error is detected during the imaging process, the following screen will appear. Note that the screenshot below shows the error screen for the Driver Station-only image for the E09. The specific image filename shown will vary depending on the image being applied.
es_mx: Si un error es detectado durante el proceso de image, la siguiente pantalla aparecerá. Observe que la captura de pantalla de abajo, muestra la pantalla de error para la imagen de la Driver Station -solamente en la E09. El nombre del archivo de la imagen específica que se muestre, varía dependiendo de la imagen que se aplique.
fr_ca: Si une erreur est détectée pendant l'installation de l’image, l’écran suivant s’affiche. Notez que la capture d’écran ci-dessous montre le message d’erreur de l’image Driver Station-only de l'ordinateur E09. Le nom précis affiché de l'image dépend de l’image installée.
tr_tr: Görüntüleme işlemi sırasında bir hata tespit edilirse, aşağıdaki ekran görünecektir. Aşağıdaki ekran görüntüsünün, E09 için yalnızca Driver Station görüntüsünün hata ekranını gösterdiğini unutmayın. Gösterilen belirli görüntü dosya adı, uygulanan görüntüye bağlı olarak değişecektir.

source: The typical reason for the appearance of this message is due to an error with the USB device on which the image is stored. Each option is listed below with further details as to the actions you can take in pursuing a solution. Pressing any key once this error message is shown will return the user to the menu screen shown in Image the Classmate.
es_mx: La razón más común de la aparición de este mensaje es debido a un error con el dispositivo USB en el cual se almacena la imagen. Cada opción se enumera a continuación con más detalles que puede tomar al buscar una solución. Al presionar cualquier tecla una vez que el mensaje se muestre, regresará al usuario a la pantalla del menú en la imagen de Classmate
fr_ca: Généralement, l’apparition de ce message est due à une erreur avec le périphérique USB dans lequel l’image est stockée. Chaque option est répertoriée ci-dessous accompagnée de détails relatifs aux actions que vous pouvez prendre dans la recherche d’une solution. En appuyant sur n’importe quelle touche avec ce message d’erreur affiché, l’utilisateur est renvoyé à l’écran de menu affiché dans l'image du Classmate.
tr_tr: Bu mesajın ortaya çıkmasının tipik nedeni, görüntünün depolandığı USB cihazındaki bir hatadan kaynaklanmaktadır. Her seçenek, bir çözümün peşinden giderken yapabileceğiniz eylemlerle ilgili daha fazla ayrıntıyla aşağıda listelenmiştir. Bu hata mesajı görüntülendiğinde herhangi bir tuşa basmak kullanıcıyı ''Classmate Image''da gösterilen menü ekranına döndürür.

source: Using same image on the existing USB Flash drive
es_mx: Usar la misma imagen en la unidad USB existente.
fr_ca: Utilisation de la même image déjà installée dans une clé USB existante
tr_tr: Mevcut USB Flash sürücüsünde aynı görüntünün kullanılması

source: To try this option, press any key to return to the main menu and select #1. This will run the imaging process again.
es_mx: Para intentar esta opción, presione cualquier tecla para regresar al menú principal y seleccione #1. Esto ejecutará el proceso de imagen nuevamente.
fr_ca: Pour essayer cette option, appuyez sur n’importe quelle touche pour revenir au menu principal et sélectionnez #1. Cela permettra d’exécuter le processus d’installation de l'image à nouveau.
tr_tr: Bu seçeneği denemek için herhangi bir tuşa basarak ana menüye dönün ve #1'i seçin. Bu, görüntüleme sürecini yeniden çalıştıracaktır.

source: Reload the same image onto the USB Flash drive using RMPrepUSB
es_mx: Vuelva a cargar la misma imagen a la memoria USB usando RMPrepUSB.
fr_ca: Recharger la même image dans la clé USB à l’aide de RMPrepUSB
tr_tr: Aynı görüntüyü RMPrepUSB kullanarak USB Flash sürücüsüne yeniden yükleyin

source: It’s possible the error message was displayed due to an error caused during the creation of the USB Flash drive (e.g. file copy error, data corruption, etc.) Press any key to return to the main menu and select #4 to safely shutdown the Classmate then follow the steps starting with RMPrep to create a new USB Restoration Key using the same USB Flash drive.
es_mx: Es posible que el mensaje de error fue mostrado debido a un error causado mientras se creó la memoria USB (p.ej. error de copia de archivo, corrupción de datos, etc.) Presione cualquier tecla para regresar al menú principal y seleccione #4 para cerrar de forma segura la Classmate, después siga los pasos empezando con RMPrep para crear una nueva clave de restauración usando la misma memoria USB.
fr_ca: Il est possible que le message d’erreur ait été affiché en raison d’une erreur causée lors de la création de la clé USB de restauration (par exemple: erreur de copie de fichier, corruption de données, etc.). Appuyez sur n’importe quelle touche pour revenir au menu principal et sélectionnez #4 pour arrêter le Classmate en toute sécurité, puis suivez les étapes commençant par RMPrep pour créer une nouvelle clé de restauration USB à l’aide du même lecteur flash USB.
tr_tr: USB Flash sürücüsünün oluşturulması sırasında oluşan bir hata nedeniyle hata mesajı görüntülenmiş olabilir (örn. Dosya kopyalama hatası, veri bozulması, vb.). Ana menüye dönmek için herhangi bir tuşa basın ve Classmate' i güvenli bir şekilde kapatmak için #4'ü seçin ardından aynı USB Flash sürücüsünü kullanarak yeni bir USB restorasyon anahtarı oluşturmak için RMPrep ile başlayan adımları izleyin.

source: Reload the same image onto a new USB Flash drive using RMPrepUSB
es_mx: Vuelva a cargar la misma imagen a una nueva memoria USB usando RMPrepUSB.
fr_ca: Re-installer la même image dans une nouvelle clé flash USB à l’aide de RMPrepUSB
tr_tr: Aynı görüntüyü RMPrepUSB kullanarak yeni bir USB Flash sürücüsüne yeniden yükleyin

source: The error message displayed may also be caused by an error with the USB Flash drive itself. Press any key to return to the main menu and select #4 to safely shutdown the Classmate. Select a new USB Flash drive and follow the steps starting with RMPrep.
es_mx: El mensaje de error mostrado también pudo ser causado por un error con la memoria USB. Presione cualquier tecla para regresar al menú principal y seleccione #4 para cerrar de una manera segura Classmate. Seleccione una nueva memoria USB y siga los pasos empezando con RMPrep.
fr_ca: Le message d’erreur affiché peut également être causé par une erreur due à la clé USB elle-même. Appuyez sur n’importe quelle touche pour revenir au menu principal et sélectionnez #4 pour arrêter en toute sécurité le Classmate. Sélectionnez un nouveau lecteur Flash USB et suivez les étapes commençant par RMPrep.
tr_tr: Görüntülenen hata mesajı, USB Flash sürücüsünün kendisindeki bir hatadan da kaynaklanıyor olabilir. Ana menüye dönmek için herhangi bir tuşa basın ve Classmate' i güvenli bir şekilde kapatmak için #4'ü seçin. Yeni bir USB Flash sürücü seçin ve RMPrep ile başlayan adımları izleyin.

source: Download a new image
es_mx: Descargar una nueva imagen.
fr_ca: Télécharger une nouvelle image
tr_tr: Yeni bir resim indirin

source: An issue with the downloaded image may also cause an error when imaging. Press any key to return to the main menu and select #4 to safely shutdown the Classmate. Staring with Download the Classmate Image create a new copy of the imaging stick.
es_mx: Un problema con la descarga de la imagen puede causar un error durante el procesamiento de imagen. Presione cualquier tecla para regresar al menú principal y seleccione #4 para cerrar de una manera segura la Classmate. Empezando con descargar la imagen de la Classmate creando una nueva copia del imaging stick.
fr_ca: Un problème avec l’image téléchargée peut également provoquer une erreur lors du processus d'installation de l'image. Appuyez sur n’importe quelle touche pour revenir au menu principal et sélectionnez #4 pour arrêter le Classmate en toute sécurité. Commencez par télécharger l’image du Classmate puis créez une nouvelle copie de l’image.
tr_tr: İndirilen görüntü ile ilgili bir sorun, görüntüleme sırasında da bir hataya neden olabilir. Ana menüye dönmek için herhangi bir tuşa basın ve Classmate' i güvenli bir şekilde kapatmak için #4'ü seçin. Classmate resmini indir ile bakmak için görüntüleme çubuğunun yeni bir kopyasını oluşturun.

source: Checking BIOS Settings
es_mx: Revisar los ajustes de BIOS
fr_ca: Vérification des paramètres du BIOS
tr_tr: BIOS Ayarlarını Kontrol Etme

source: Two images of the BIOS making sure the boot menu is enabled and the mode is "Legacy".
fr_ca: Deux images du BIOS s’assurant que le menu de démarrage est activé et que le mode est "Legacy".

source: If you are having difficulty booting to USB, check the BIOS settings to insure they are correct. To do this:
es_mx: Si está teniendo dificultad para iniciar la USB, revise los ajustes de BIOS para asegurarse de que estén correctos. Para hacer esto:
fr_ca: Si vous éprouvez de la difficulté à démarrer sur USB, vérifiez les paramètres du BIOS pour vous assurer qu’ils sont corrects. Pour ce faire, procédez ainsi :
tr_tr: USB'ye önyükleme yaparken sorun yaşıyorsanız, doğru olduklarından emin olmak için BIOS ayarlarını kontrol edin. Bunu yapmak için:

source: Repeatedly tap the **F2** key while the computer is booting to enter the BIOS settings
es_mx: Presione repetidamente la tecla **F2** mientras la computadora está arrancando para entrar a los ajustes de BIOS.
fr_ca: Appuyez à plusieurs reprises sur la touche **F2** pendant le démarrage de l’ordinateur pour accéder aux paramètres du BIOS
tr_tr: BIOS ayarlarına girmek için bilgisayar önyüklenirken tekrar tekrar ** F2 ** tuşuna basın

source: Once the BIOS settings screen has loaded, use the right and left arrow keys to select the "Main" tab, then check if the line for "F12 Boot Menu" is set to "Enabled". If it is not, use the Up/Down keys to highlight it, press Enter, use Up/Down to select "Enabled" and press Enter again.
es_mx: Una vez que la pantalla de ajustes de BIOS se cargó, use las teclas de flechas derecha e izquierda para seleccionar la pestaña “Main”, después revise si la línea de “F12 Boot Menu” está en “Enabled”. Si no es así, use las flechas arriba/abajo para remarcarlo, presione Enter, use las teclas arriba/abajo para seleccionar "Enable" y presione Enter otra vez.
fr_ca: Une fois que l’écran des paramètres du BIOS a été chargé, utilisez les touches fléchées droite et gauche pour sélectionner l’onglet "Main" , puis vérifiez si la ligne contenant "F12 Boot Menu" est configurée à "Enabled ». Si ce n’est pas le cas, utilisez les touches Haut/Bas pour la mettre en surbrillance, appuyez sur Entrée, utilisez Haut/Bas pour sélectionner "Enabled" et appuyez à nouveau sur Entrée.
tr_tr: BIOS ayarları ekranı yüklendikten sonra, "Ana" sekmesini seçmek için sağ ve sol ok tuşlarını kullanın, ardından "F12 Önyükleme Menüsü" satırının "Etkin" olarak ayarlanıp ayarlanmadığını kontrol edin. Değilse, Yukarı / Aşağı tuşlarını kullanarak vurgulayın, ''Enter'' tuşuna basın, "Etkin" seçeneğini seçmek için Yukarı / Aşağı tuşlarını kullanın ve tekrar ''Enter'' tuşuna basın.

source: Next, use the Left/Right keys to select the "Boot" tab. Make sure that the "Boot Mode" is set to "Legacy". If it is not, highlight it using Up\Down, press Enter, highlight "Legacy" and press Enter again. Press Enter to move through any pop-up dialogs you may see.
es_mx: Después, use las teclas Izquierda/Derecha para seleccionar la pestaña “Boot”. Asegúrese que el “Boot Mode” esté en “Legacy”. Si no es así, resáltelo usando las teclas arriba/abajo, presione Enter, resalte “Legacy” y presione Enter de nuevo. Presione Enter para desplazarse por los cuadros de diálogo que pueda ver.
fr_ca: Ensuite, utilisez les touches gauche/droite pour sélectionner l’onglet "Boot". Assurez-vous que le "Boot Mode" est configuré à "Legacy". Si ce n’est pas le cas, mettez-le en surbrillance à l'aide de UpDown, appuyez sur Entrée, surligner "Legacy" et appuyez à nouveau sur Entrée. Appuyez sur Entrée pour passer à travers toutes les boîtes de dialogues contextuelles qui apparaitraient.
tr_tr: Ardından, "Önyükleme" sekmesini seçmek için Sol / Sağ tuşlarını kullanın. "Önyükleme Modu" nun "Eski" olarak ayarlandığından emin olun. Değilse, Yukarı \ Aşağı kullanarak vurgulayın, ''Enter''a basın, "Eski" seçeneğini vurgulayın ve tekrar ''Enter'' tuşuna basın. Görebileceğiniz herhangi bir açılır iletişim kutusu arasında gezinmek için ''Enter'' tuşuna basın.

source: Press F10 to save any changes and exit.
es_mx: Presione F10 para guardar los cambios y salir.
fr_ca: Appuyez sur F10 pour enregistrer les modifications et quitter.
tr_tr: Değişiklikleri kaydetmek ve çıkmak için F10 tuşuna basın.

source: Option 1
es_mx: Opción 1
tr_tr: Seçenek 1

source: Option 2
es_mx: Opción 2
tr_tr: Seçenek 2

source: Option 3
es_mx: Opción 3
tr_tr: Seçenek 3
