Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/imaging-your-classmate.po
Languages: es_mx, fr_ca, tr_tr

source: Option 4
es_mx: Opción 4
tr_tr: Seçenek 4

source: RMprepUSB software installed (download `here <https://www.rmprepusb.com/documents/release-2-0>`__). Scroll down the page and select the stable (Full) version download link. As of the writing of this document, the current stable version is 2.1.743e.
tr_tr: RMprepUSB yazılımı yüklendi (`buradan <https://www.rmprepusb.com/documents/release-2-0>` __ indirin). Sayfayı aşağı kaydırın ve kararlı (Tam) sürüm indirme bağlantısını seçin. Bu belgenin yazıldığı tarih itibariyle, mevcut kararlı sürüm 2.1.743e'dir.
