Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/manually-setting-the-driver-station-to-start-custom-dashboard.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Manually Setting the Driver Station to Start Custom Dashboard
es_mx: Configurar manualmente la Driver Station para iniciar a personalizar la Dashboard
fr_ca: Configuration manuelle de Driver Station pour lancer un Dashboard personnalisé
tr_tr: Driver Station'ı Özel Panoyu Başlatacak Şekilde Manuel Olarak Ayarlama
zh_cn: 手动设置操控站以启动自定义仪表盘

source: If WPILib is not installed to the default location (such as when files are copied to a PC manually), the dashboard of choice may not launch properly. To have the DS start a custom dashboard when it starts up, you have to manually modify the settings for the default dashboard.
es_mx: Si WPILib no está instalando en la ubicación predeterminada (como cuando un archivo es copiado a la computadora manualmente), es probable que la dashboard seleccionada no se inicie correctamente. Para hacer que la DS inicie una dashboard personalizada cuando inicie, tiene que modificar manualmente los ajustes predeterminados en la dashboard.
fr_ca: Si WPILib n’est pas installé à l’emplacement par défaut (par exemple lorsque les fichiers sont copiés manuellement sur un PC), le Dashboard choisi peut ne pas être lancé correctement. Pour que le DS lance un Dashboard personnalisé lorsqu’il démarre, vous devez modifier manuellement les paramètres du Dashboard par défaut.
tr_tr: WPILib varsayılan konuma yüklenmemişse (örneğin, dosyalar bir PC'ye manuel olarak kopyalandığında), tercih edilen kontrol paneli düzgün başlatılamayabilir. DS'nin başladığında özel bir kontrol paneli başlatmasını sağlamak için varsayılan kontrol panelinin ayarlarını manuel olarak değiştirmeniz gerekir.
zh_cn: 如果 WPILib 没有安装到默认位置(例如当文件手动复制到 PC 时)，选择的仪表盘可能不能正确启动。要让 DS 在启动时启动自定义指示板，必须手动修改默认指示板的设置。

source: This is not needed for most installations, try using the appropriate :ref:`Dashboard Type setting <docs/software/driverstation/driver-station:Setup Tab>` for your language first.
es_mx: Esto no es necesario para la mayoría de las instalaciones, trate de usar el tipo de configuración apropiada :ref:`Dashboard Type setting <docs/software/driverstation/driver-station:Setup Tab>` de acuerdo al lenguaje que use.
fr_ca: Ceci n’est pas nécessaire pour la plupart des installations, essayez d'abord d’utiliser le :ref:`type de Dashboard <docs/software/driverstation/driver-station:Setup Tab>` défini pour votre langage de programmation.
tr_tr: Çoğu kurulum için buna gerek yoktur, önce diliniz için uygun: ref: `Dashboard Type ayarı <docs / software / driverstation / driver-station: Setup Tab> 'seçeneğini kullanmayı deneyin.
zh_cn: 大多数安装都不需要这样，尝试首先使用适当的:ref:`Dashboard Type setting <docs/software/driverstation/driver-station:Setup Tab>` 用于你的语言。

source: Set Driver Station to Default
es_mx: Establecer la Driver Station a Default
fr_ca: Mettre la Driver Station sur Default
tr_tr: Driver Station'ı Varsayılana Ayarlayın
zh_cn: 将操控站设置为默认

source: Click on the Setup tab (gear icon) and then change the "Dashboard Type".
fr_ca: Cliquez sur l’onglet Setup (icône sous forme d'engrenage), puis changez le "Dashboard Type".
zh_cn: 单击设置选项卡（齿轮图标），然后更改“仪表板类型”。

source: Open the Driver Station software, click on the Setup tab and set the Dashboard setting to Default. **Then close the Driver Station!**
es_mx: Abra el software de Driver Station, dé click en la pestaña “Setup” y seleccione “Default” en el tipo de Dashboard. **Then close the Driver Station!**
fr_ca: Ouvrez l'application Driver Station, cliquez sur l’onglet Setup et configurez le paramètre Dashboard à Default. **Fermez ensuite Driver Station!**
tr_tr: Driver Station yazılımını açın, Setup sekmesine tıklayın ve Dashboard ayarını Default olarak ayarlayın. ** Ardından Driver Station'ı kapatın! **
zh_cn: 打开操控站软件，点击设置选项卡，将仪表盘设置为默认值。**然后关闭操控站!**

source: Open DS Data Storage file
es_mx: Abrir el archivo DS Data Storage file
fr_ca: Ouvrir le fichier de stockage de données de la DS
tr_tr: DS Veri Depolama dosyasını açın
zh_cn: 打开DS数据存储文件

source: Highlights the "FRC DS Data Storage.ini" file in Windows explorer.
fr_ca: Met en surbrillance le fichier "FRC DS Data Storage.ini" dans l’explorateur Windows.
zh_cn: 在 Windows 资源管理器中突出显示“FRC DS Data Storage.ini”文件。

source: Browse to ``C:\Users\Public\Documents\FRC`` and double click on ``FRC DS Data Storage`` to open it.
es_mx: Vaya a la siguiente ubicación ``C:\Users\Public\Documents\FRC`` y dé doble click en ``FRC DS Data Storage`` para abrir el archivo.
fr_ca: Parcourez ``C:\Users\Public\Documents\FRC`` et cliquez deux fois sur ``FRC DS Data Storage`` pour l’ouvrir.
tr_tr: `` C: \ Users \ Public \ Documents \ FRC '' ye göz atın ve açmak için `` FRC DS Data Storage '' üzerine çift tıklayın.
zh_cn: 浏览文件夹 ``C:\Users\Public\Documents\FRC`` ，双击 ``FRC DS Data Storage`` 来打开它.

source: Modify the "DashboardCmdLine" entry to control where it looks for the file that it will start.
fr_ca: Modifiez l’entrée "DashboardCmdLine" pour contrôler où il recherche le fichier qu’il va démarrer.
zh_cn: 修改“DashboardCmdLine”条目以控制它在何处查找将启动的文件。

source: Locate the line beginning with ``DashboardCmdLine``. Modify it to point to the dashboard to launch when the driver station starts
es_mx: Localice la linea empezando con ``DashboardCmdLine``. Modifíquelo para que apunte la dashboard para que se inicie cuando abra la driver station
fr_ca: Localisez la ligne commençant par ``DashboardCmdLine``. Modifiez-la pour qu'elle pointe vers le tableau de bord à lancer lorsque le DriverStation démarre
tr_tr: ``DashboardCmdLine``ile başlayan satırı bulun. Sürücü istasyonu başladığında başlatılması için kontrol panelini gösterecek şekilde değiştirin
zh_cn: 定位以 ``DashboardCmdLine``开头的行。修改它，使其指向仪表板，以便在操控站启动时启动

source: LabVIEW Custom Dashboard
fr_ca: Dashboard personnalisé LabVIEW
tr_tr: LabVIEW Özel Kontrol Paneli
zh_cn: 虚拟仪器自定义仪表板

source: Replace the string after ``=`` with ``"C:\\PATH\\TO\\DASHBOARD.exe"`` where the path specified is the path to the dashboard ``exe`` file. Save the ``FRC DS Data Storage`` file.
es_mx: Remplace la cadena después del ``=`` con ``"C:\\PATH\\TO\\DASHBOARD.exe"`` donde el path/camino especificado es el camino al archivo ``exe`` de la dashboard. Guarde el archivo ``FRC DS Data Storage``.
fr_ca: Remplacez la chaîne après ``=`` avec ``"C:\\PATH\\TO\\DASHBOARD.exe"`` où le chemin spécifié est le chemin du fichier ``exe`` du Dashboard. Enregistrez le fichier ``FRC DS Data Storage``.
tr_tr: ``=`` 'den sonraki dizeyi şununla değiştirin: ``"C:\\PATH\\TO\\DASHBOARD.exe"`` burada belirtilen yol, gösterge tablosu ``exe`` dosyasına giden yoldur. `` FRC DS Data Storage`` dosyasını kaydedin.
zh_cn: 将 ``=`` 后面的字符串替换为 ``"C:\\PATH\\TO\\DASHBOARD.exe"`` 其中指定的路径是到仪表板 ``exe`` 文件的路径。保存 ``FRC DS Data Storage`` 文件。

source: Java Dashboard
fr_ca: Dashboard Java
tr_tr: Java Dashboard- Java Kontrol Paneli
zh_cn: java 仪表盘

source: Replace the string after ``=`` with ``java -jar "C:\\PATH\\TO\\DASHBOARD.jar"`` where the path specified is the path to the dashboard ``jar`` file. Save the ``FRC DS Data Storage`` file.
es_mx: Reemplace la línea después de ``=`` with ``java -jar "C:\\PATH\\TO\\DASHBOARD.jar"`` donde la trayectoria especificada es la trayectoria del archivo dashboard ``jar`` . Guarde el archivo ``FRC DS Data Storage``.
fr_ca: Remplacez la chaîne de caractères après ``=`` par ``java -jar "C:\\PATH\\TO\\DASHBOARD.jar"`` où le chemin d’accès spécifié est le chemin d’accès au Dashboard ``jar`` file. Enregistrez le fichier ``FRC DS Data Storage``.
tr_tr: "=" 'Den sonraki dizeyi `` java -jar "C: \\ PATH \\ TO \\ DASHBOARD.jar" "ile değiştirin; burada belirtilen yol, gösterge panosu` `jar' 'dosyasına giden yoldur. `` FRC DS Data Storage '' dosyasını kaydedin.
zh_cn: 使用 ``java -jar "C:\\PATH\\TO\\DASHBOARD.jar"`` 替换 ``=`` 后的字符串，其中指定的路径是仪表板 ``jar`` 文件的路径。 保存 ``FRC DS Data Storage`` 文件。

source: Shuffleboard and Smartdashboard require Java 11.
es_mx: Shuffleboard y Smartdashboard requieren Java 11.
fr_ca: Shuffleboard et Smartdashboard nécessitent Java 11.
tr_tr: Shuffleboard ve Smartdashboard için Java 11 gerekir.
zh_cn: Shuffleboard 和 Smartdashboard 要求 Java 11

source: Dashboard from WPILib installer
es_mx: Dashboard desde el instalador de WPILib
fr_ca: Dashboard du programme d'installation de WPILib
tr_tr: WPILib yükleyiciden Dashboard
zh_cn: WPILib 安装程序中的仪表板

source: Replace the string after ``=`` with ``wscript "C:\\Users\\Public\\wpilib\\YYYY\\tools\\DASHBOARD.vbs"`` where ``YYYY`` is the year and ``DASHBOARD.vbs`` is either ``Shuffleboard.vbs`` or ``Smartdashboard.vbs``. Save the ``FRC DS Data Storage`` file.
es_mx: Remplace la cadena después del ``=`` con ``wscript "C:\\Users\\Public\\wpilib\\YYYY\\tools\\DASHBOARD.vbs"`` donde ``YYYY`` es el año y ``DASHBOARD.vbs`` es ya sea ``Shuffleboard.vbs`` o ``Smartdashboard.vbs``. Guarde el archivo ``FRC DS Data Storage``.
fr_ca: Remplacez la chaîne après ``=`` with ``wscript "C:\\Users\\Public\\wpilib\\YYYY\\tools\\DASHBOARD.vbs"`` où ``YYYY`` est l'année et ``DASHBOARD.vbs`` est soit ``Shuffleboard.vbs`` ou ``Smartdashboard.vbs``. Enregistrez le fichier ``FRC DS Data Storage``.
tr_tr: ``=`` 'den sonraki dizeyi ``wscript`` ile değiştirin C: \\ Users \\ Public \\ wpilib \\ YYYY \\ tools \\ DASHBOARD.vbs `` i burada `` YYYY`` i yıl ve ` `` DASHBOARD.vbs `` , `` Shuffleboard.vbs `` iveya `` Smartdashboard.vbs`` idir. `` FRC DS Data Storage`` idosyasını kaydedin.
zh_cn: 用 ``wscript "C:\\Users\\Public\\wpilib\\YYYY\\tools\\DASHBOARD.vbs"`` 替换 ``=`` 后的字符串。``YYYY`` 是年份， ``DASHBOARD.vbs`` 是 ``Shuffleboard.vbs`` 或 ``Smartdashboard.vbs`` 。保存 ``FRC DS Data Storage`` 文件

source: Launch Driver Station
es_mx: Inicie la Driver Station
fr_ca: Lancer Driver Station
tr_tr: Driver Station'ı başlatın
zh_cn: 启动 Driver Station

source: The Driver Station should now launch the dashboard each time it is opened.
es_mx: Ahora la Driver Station debe iniciar automáticamente la dashboard cada vez que se abra.
fr_ca: Driver Station devrait maintenant lancer l'application Dashboard configurée chaque fois qu’il est ouvert.
tr_tr: Driver Station artık her açıldığında kontrol panelini başlatmalıdır.
zh_cn: 现在，Driver Station 每次打开时都应启动仪表板。

source: Locate Dashboard JAR file
es_mx: Localice el archivo Dashboard JAR
tr_tr: Kontrol Paneli JAR dosyasını bulun

source: Find the location of the dashboard ``jar`` file.
es_mx: Encuentre la ubicación del archivo dashboard ``jar``.
tr_tr: Kontrol panelindeki`` jar '' dosyasının bulun.

source: DashboardCmdLine
tr_tr: DashboardCmdLine -dashboard komut satırı
