Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/programming-radios-for-fms-offseason.po
Languages: fr_ca

source: Programming Radios for FMS Offseason
fr_ca: Programmer la radio pour FMS Offseason

source: When using the FMS Offseason software, the typical networking setup is to use a single access point with a single SSID and WPA key. This means that the radios should all be programmed to connect to this network, but with different IPs for each team. The Team version of the FRC\ |reg| Bridge Configuration Utility has an FMS Offseason mode that can be used to do this configuration.
fr_ca: Lors de l’utilisation du logiciel FMS Offseason, la configuration réseau typique consiste à utiliser un point d’accès unique avec un seul SSID et une seule clé WPA. Cela signifie que les radios doivent toutes être programmées pour se connecter à ce réseau, mais avec des adresses IP différentes pour chaque équipe. La version d'équipe de l'utilitaire FRC\ |reg| Bridge Configuration Utility dispose d’un mode FMS Offseason qui peut être utilisé pour effectuer cette configuration.

source: Pre-Requisites
fr_ca: Prérequis

source: Install the FRC\ |reg| Radio Configuration Utility software per the instructions in :ref:`Programming your radio <docs/zero-to-robot/step-3/radio-programming:Prerequisites>`
fr_ca: Installez l'utilitaire FRC\ |reg| Radio Configuration Utility selon les instructions accessibles dans :ref:`Programmation de votre radio <docs/zero-to-robot/step-3/radio-programming:Prerequisites>`

source: Before you begin using the software:
fr_ca: Avant de commencer à utiliser le logiciel :

source: Disable WiFi connections on your computer, as it may prevent the configuration utility from properly communicating with the bridge
fr_ca: Désactiver les connexions WiFi sur votre ordinateur, car ils peuvent empêcher l’utilitaire de configuration de communiquer correctement avec la passerelle

source: Plug directly from your computer into the wireless bridge ethernet port closest to the power jack. Make sure no other devices are connected to your computer via ethernet. If powering the radio via PoE, plug an Ethernet cable from the PC into the socket side of the PoE adapter (where the roboRIO would plug in). If you experience issues configuring through the PoE adapter, you may try connecting the PC to the alternate port on the radio.
fr_ca: Branchez directement à partir de votre ordinateur dans le port Ethernet du pont sans fil le plus proche de la prise d’alimentation. Assurez-vous qu’aucun autre appareil n’est connecté à votre ordinateur via le port Ethernet. Si vous alimentez la radio via le port PoE, branchez un câble Ethernet du PC sur le côté de la prise de l’adaptateur PoE (où le roboRIO se brancherait). Si vous rencontrez des problèmes de configuration via l’adaptateur PoE, vous pouvez essayer de connecter le PC à l’autre port de la radio.

source: Programmed Configuration
fr_ca: Configuration programmée

source: The Radio Configuration Utility programs a number of configuration settings into the radio when run. These settings apply to the radio in all modes (including at events). These include:
fr_ca: L’utilitaire de configuration radio, pendant son exécution, programme un certain nombre de paramètres de configuration dans la radio. Ces paramètres s’appliquent à la radio dans tous les modes (y compris lors d’événements). Il s’agit notamment de:

source: Set a static IP of ``10.TE.AM.1``
fr_ca: Configurez une IP statique de ``10.TE.AM.1``

source: Set an alternate IP on the wired side of ``192.168.1.1`` for future programming
fr_ca: Définissez une adresse IP alternative du côté relié par fil de ``192.168.1.1`` pour la programmation future

source: Bridge the wired ports so they may be used interchangeably
fr_ca: Relier en pont les ports câblés afin qu’ils puissent être utilisés de façon interchangeable

source: The LED configuration noted in the status light referenced below.
fr_ca: La DEL témoin de la configuration notée dans le voyant d’état référencé ci-dessous.

source: 4Mb/s bandwidth limit on the outbound side of the wireless interface (may be disabled for home use)
fr_ca: Limiter la bande passante à 4 Mo/s du côté sortie de l’interface sans fil (ceci peut être désactivé pour une utilisation à la maison)

source: QoS rules for internal packet prioritization (affects internal buffer and which packets to discard if bandwidth limit is reached). These rules are:
fr_ca: La qualité de service ou QS régularise la hiérarchisation interne des paquets (affecte la mémoire tampon interne et les paquets à éliminer si la limite de bande passante est atteinte). Les règles appliquées sont les suivantes:

source: Robot Control and Status (UDP ``1110``, ``1115``, ``1150``)
fr_ca: Contrôle et état du robot (UDP ``1110``, ``1115``, ``1150``)

source: Bulk (All other traffic). (disabled if BW limit is disabled)
fr_ca: En vrac (Tout autre trafic). (désactivé si la limite de largeur de bande (BW) est désactivée)

source: DHCP server enabled. Serves out:
fr_ca: Serveur DHCP activé. Sert:

source: ``10.TE.AM.11`` - ``10.TE.AM.111`` on the wired side
fr_ca: ``10.TE.AM.11`` - ``10.TE.AM.111`` du côté relié par fil

source: ``10.TE.AM.138`` - ``10.TE.AM.237`` on the wireless side
fr_ca: ``10.TE.AM.138`` - ``10.TE.AM.237`` du côté sans-fil

source: Subnet mask of ``255.255.255.0``
fr_ca: Masque Subnet de ``255.255.255.0``

source: Broadcast address ``10.TE.AM.255``
fr_ca: Adresse de diffusion ``10.TE.AM.255``

source: DNS server enabled. DNS server IP and domain suffix (``.lan``) are served as part of the DHCP.
fr_ca: Serveur DNS activé. L’adresse IP du serveur DNS et le suffixe de domaine (``.lan``) sont servis dans le cadre du DHCP.

source: See the :ref:`Status Light Reference <docs/hardware/hardware-basics/status-lights-ref:OpenMesh Radio>` for details on the behavior of the radio status lights when configured.
fr_ca: Voir la :ref:` Référence sur les témoins d’état <docs/hardware/hardware-basics/status-lights-ref:OpenMesh Radio>` pour plus de détails sur le comportement des lumières d'indication d’état de la radio lorsqu’elle est configurée.

source: When programmed with the team version of the Radio Configuration - Utility, the user accounts will be left at (or set to) the firmware - defaults **for the DAPs only**:
fr_ca: Lorsqu’ils sont programmés avec la version d’équipe de l’utilitaire Radio Configuration Utility, les comptes utilisateurs seront laissés (ou configurés) au défaut **pour les DAP uniquement**:

source: It is not recommended to modify the configuration manually
fr_ca: Il n’est pas recommandé de modifier la configuration manuellement

source: Launch the software
fr_ca: Lancer le logiciel

source: The FRC Radio Configuration Utility in the start menu.
fr_ca: L’utilitaire FRC Radio Configuration Utility dans le menu Démarrer.

source: Use the Start menu or desktop shortcut to launch the program.
fr_ca: Utilisez le menu Démarrer ou le raccourci de bureau pour lancer le programme.

source: If you need to locate the program, it is installed to ``C:\Program Files (x86)\FRC Radio Configuration Utility``. For 32-bit machines the path is ``C:\Program Files\FRC Radio Configuration Utility``
fr_ca: Si vous avez besoin de localiser le programme, il est installé dans ``C:\Program Files (x86)\FRC Radio Configuration Utility``. Pour les machines 32 bits, le chemin est ``C:\Program Files\FRC Radio Configuration Utility``

source: Allow the program to make changes, if prompted
fr_ca: Autoriser le programme à apporter des modifications, si vous y êtes invité

source: User Account Control dialog that pops up when running the config utility.
fr_ca: Boîte de dialogue User Account Control qui s’affiche lors de l’exécution de l’utilitaire de configuration.

source: A prompt may appear about allowing the configuration utility to make changes to the computer. Click :guilabel:`Yes` if the prompt appears.
fr_ca: Une invite peut s’afficher pour autoriser l’utilitaire de configuration à apporter des modifications à l’ordinateur. Cliquez sur :guilabel:`Yes` si l’invite s’affiche.

source: Enter FMS Offseason Mode
fr_ca: Entrez en mode FMS Offseason

source: Click on "Tools" then "FMS-Lite Mode".
fr_ca: Cliquez sur "Tools" puis sur "FMS-Lite Mode".

source: Click ``Tools`` -> ``FMS-Lite Mode`` to enter FMS-Lite Mode.
fr_ca: Cliquez sur ''Tools'' -> ''FMS-Lite Mode'' pour entrer en mode FMS-Lite.

source: Enter SSID
fr_ca: Entrer le SSID

source: Enter the network SSID in the dialog box.
fr_ca: Entrez le SSID réseau dans la boîte de dialogue.

source: Enter the SSID (name) of your wireless network in the box and click OK.
fr_ca: Entrez le SSID (nom) de votre réseau sans fil dans la zone et cliquez sur OK.

source: Enter WPA Key
fr_ca: Entrer la clé WPA

source: Enter the WPA Key (password) for this SSID.
fr_ca: Écrivez la clé WPA (mot de passe) pour ce SSID.

source: Enter the WPA key for your network in the box and click OK. Leave the box blank if you are using an unsecured network.
fr_ca: Entrez la clé WPA de votre réseau dans la zone et cliquez sur OK. Laissez la boîte vide si vous utilisez un réseau non sécurisé.

source: Program Radios
fr_ca: Programmer les radios

source: Program the radio through the utility like normal for all of the radios at your event.
fr_ca: Programmez la radio via l’utilitaire comme d’habitude pour toutes les radios de votre événement.

source: The Kiosk is now ready to program any number of radios to connect to the network entered. To program each radio, connect the radio to the Kiosk, set the Team Number in the box, and click Configure.
fr_ca: Le kiosque est maintenant prêt à programmer autant de radios qu'on veut pour se connecter au réseau configuré. Pour programmer chaque radio, connectez la radio au kiosque, définissez le numéro d’équipe dans la zone, puis cliquez sur Configure.

source: The kiosk will program OpenMesh, D-Link Rev A or D-Link Rev B radios to work on an offseason FMS network by selecting the appropriate option from the "Radio" dropdown.
fr_ca: Le kiosque programmera les radios OpenMesh, D-Link Rev A ou D-Link Rev B pour travailler sur un réseau FMS hors saison en sélectionnant l’option appropriée dans la liste déroulante "Radio".

source: Bandwidth limitations and QoS will not be configured on the D-Link radios in this mode.
fr_ca: Les limitations de bande passante et QoS ne seront pas configurées sur les radios D-Link dans ce mode.

source: Changing SSID or Key
fr_ca: Modification du SSID ou de la clé

source: If you enter something incorrectly or need to change the SSID or WPA Key, go to the Tools menu and click FMS-Lite Mode to take the kiosk out of FMS-Lite Mode. When you click again to put the Kiosk back in FMS-Lite Mode, you will be re-prompted for the SSID and Key.
fr_ca: Si vous entrez incorrectement un paramètre ou si vous devez modifier la clé SSID ou WPA, accédez au menu Tools et cliquez sur mode FMS-Lite pour sortir le kiosque du Mode FMS-Lite. Lorsque vous cliquez à nouveau pour remettre le kiosque en Mode FMS-Lite, vous serez ré-invité pour le SSID et la clé.

source: Troubleshooting
fr_ca: Dépannage

source: See the troubleshooting steps in :ref:`Programming your radio <docs/zero-to-robot/step-3/radio-programming:Troubleshooting>`
fr_ca: Consultez les étapes de dépannage dans la section :ref:`Programmation de votre radio <docs/zero-to-robot/step-3/radio-programming:Troubleshooting>`
