Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/troubleshooting-dashboard-connectivity.po
Languages: es_mx, fr_ca, tr_tr

source: Troubleshooting Dashboard Connectivity
es_mx: Solución de problemas de conexión de la Dashboard
fr_ca: Résolution des problèmes liés à la connectivité de Dashboard
tr_tr: Kontrol Paneli Bağlantısında Sorun Giderme

source: We have received a number of reports of Dashboard connectivity issues from events. This document will help explain how to recognize if the Dashboard is not connected to your robot, steps to troubleshoot this condition and a code modification you can make.
es_mx: Hemos recibido una serie de informes de problemas de conexión de la Dashboard. Este documento ayudará a explicar cómo reconocer si la Dashboard no está conectada a su robot, pasos para solucionar esta condición y una modificación de código que puede realizar.
fr_ca: Nous avons reçu un certain nombre de rapports concernant des problèmes de connectivité du Dashboard lors d’événements. Ce document aidera à expliquer comment reconnaître si Dashboard n’est pas connecté à votre robot, les étapes pour résoudre cette situation et une modification de code que vous pouvez apporter.
tr_tr: Etkinliklerden Gösterge Tablosu bağlantı sorunlarıyla ilgili bir sürü rapor aldık. Bu belge, Gösterge Panosunun robotunuza bağlı olup olmadığını nasıl anlayacağınızı, bu durumu gidermek için adımları ve yapabileceğiniz bir kod değişikliğini açıklamaya yardımcı olacaktır.

source: LabVIEW Dashboard
fr_ca: Le Dashboard de LabVIEW
tr_tr: LabVIEW Kontrol Paneli

source: This section discusses connectivity between the robot and LabVIEW dashboard
es_mx: Ésta sección discute sobre la conexión entre el robot y laDasboard de LabVIEW.
fr_ca: Cette section traite de la connectivité entre le robot et Dashboard de LabVIEW
tr_tr: Bu bölümde robot ve LabVIEW kontrol paneli arasındaki bağlantı anlatılmaktadır.

source: Recognizing LabVIEW Dashboard Connectivity
es_mx: Reconocer la conexión de la Dashboard de LaVIEW
fr_ca: Reconnaître la connectivité du Dashboard LabVIEW de
tr_tr: LabVIEW Dashboard Bağlantısını Tanıma

source: If you have an indicator on your dashboard that you expect to be changing it may be fairly trivial to recognize if the Dashboard is connected. If not, there is a way to check without making any changes to your robot code. On the Variables tab of the Dashboard, the variables are shown with a black diamond when they are not synced with the robot. Once the Dashboard connects to the robot and these variables are synced, the diamond will disappear.
es_mx: Si tiene un indicador en su dashboard que espera cambiar puede ser bastante trivial para reconocer si el panel está conectado. Si no, hay una manera de comprobar sin realizar cualquier cambio en el código del robot. En la pestaña Variables del panel, las variables se muestran con un diamante negro cuando no están sincronizados con el robot. Una vez que el panel se conecta al robot y estas variables se sincronizan, el diamante desaparecerá.
fr_ca: Si vous avez un indicateur sur votre Dashboard qui ne change pas mais qui devrait changer, commencez simplement par vérifier si Dashboard est connecté. Sinon, il existe un moyen de vérifier sans apporter de modifications à votre code robot. Sous l’onglet Variables de Dashboard, les variables sont affichées avec un diamant noir lorsqu’elles ne sont pas synchronisées avec le robot. Une fois que Dashboard se connecte au robot et que ces variables sont synchronisées, le diamant disparaît.
tr_tr: Kontrol panelinizde değiştirmeyi beklediğiniz bir gösterge varsa, Kontrol Panelinin bağlı olup olmadığını anlamak oldukça önemsiz olabilir. Yoksa, robot kodunuzda herhangi bir değişiklik yapmadan kontrol etmenin bir yolu vardır. Gösterge Panosunun Değişkenler sekmesinde, değişkenler robotla senkronize olmadıklarında siyah bir elmas şekli ile gösterilir. Gösterge Tablosu robota bağlandığında ve bu değişkenler senkronize edildiğinde elmas şekli kaybolur.

source: Troubleshooting LabVIEW Dashboard Connectivity
es_mx: Solucionar problemas de conexion de la Dashboard de LabVIEW
fr_ca: Résolution des problèmes liés à la connectivité de Dashboard de LabVIEW
tr_tr: LabVIEW Dashboard Bağlantısıyla İlgili Sorunları Giderme

source: If the Dashboard does not connect to the Robot (after the Driver Station has connected to the robot) the recommended troubleshooting steps are:
es_mx: Si la Dashboard no se conecta al robot (después de que la Driver Station se haya conectado al robot) los pasos recomendados para resolver este problema son:
fr_ca: Si Dashboard ne se connecte pas au robot (une fois que Driver Station s’est connecté au robot), les étapes de dépannage recommandées sont les suivantes :
tr_tr: Dashboard Robota bağlanmazsa (Driver Station robota bağlandıktan sonra) önerilen sorun giderme adımları şunlardır:

source: Close the Driver Station and Dashboard, then re-open the Driver Station (which should launch the Dashboard).
es_mx: Cierre la Driver Station y la Dashboard, luego vuelva a abrir la Driver Station (que debe iniciar la Dashboard).
fr_ca: Fermez Driver Station et Dashboard, puis ré-ouvrez Driver Station (lequel devrait lui-même lancer Dashboard).
tr_tr: Driver Station ve Dashboard'u kapatın, ardından Driver Station'ı yeniden açın (Dashboard'u başlatması gerekir).

source: If that doesn't work, restart the Robot Code using the Restart Robot Code button on the Diagnostics tab of the Driver Station
es_mx: Si eso no funciona, reinicie el código del robot con el botón Restart Robot Code en la pestaña de Diagnostics de la Driver Station.
fr_ca: Si cela ne fonctionne pas, redémarrez le programme Robot à l’aide du bouton Restart Robot Code sur l’onglet Diagnostics de Driver Station
tr_tr: Bu işe yaramazsa, Driver Station'ın Diagnostics sekmesindeki Robot Kodunu Yeniden Başlat düğmesini kullanarak Robot Kodunu yeniden başlatın.

source: SmartDashboard
fr_ca: Le SmartDashboard

source: This section discusses connectivity between the robot and Java SmartDashboard
es_mx: En esta sección se describe la conexión entre el robot y la SmartDashboard de Java.
fr_ca: Cette section traite de la connectivité entre le robot et SmartDashboard Java
tr_tr: Bu bölümde robot ve Java SmartDashboard arasındaki bağlantı anlatılmaktadır

source: Recognizing SmartDashboard Connectivity
es_mx: Identificar la conexión de la SmartDashboard
fr_ca: Reconnaître la connectivité de SmartDashboard
tr_tr: SmartDashboard Bağlantısını Tanıma

source: The typical way to recognize connectivity with the Java SmartDashboard is to add a Connection Indicator widget and to make sure your code is writing at least one key during initialization or disabled to trigger the connection indicator. The connection indicator can be moved or re-sized if the Editable checkbox is checked.
es_mx: La manera común de identificar la conexión con la Java SmartDashboard es agregar un widget indicador de conexión y asegurarse de que el código está escribiendo al menos una clave durante la inicialización o desactivada para activar el indicador de conexión. El indicador de conexión se puede mover o cambiar su tamaño si la casilla Editable está marcada.
fr_ca: Avec SmartDashboard Java, la façon typique de reconnaître la connectivité consiste à ajouter un widget Indicateur de connexion et de s’assurer que votre code écrit au moins une clé lors de l’initialisation ou désactivé pour déclencher l’indicateur de connexion. L’indicateur de connexion peut être déplacé ou redimensionné si la case à cocher Editable est cochée.
tr_tr: Java SmartDashboard ile bağlantıyı tanımanın tipik yolu, bir Bağlantı Göstergesi widget'ı eklemek ve kodunuzun başlatma sırasında en az bir anahtar yazdığından veya bağlantı göstergesini tetiklemek için devre dışı bırakıldığından emin olmaktır.

source: Troubleshooting SmartDashboard Connectivity
es_mx: Solucionar problemas de conexión de la SmartDashboard
fr_ca: Résolution des problèmes liés à la connectivité de SmartDashboard
tr_tr: SmartDashboard Bağlantısında Sorun Giderme

source: Restart the SmartDashboard (there is no need to restart the Driver Station software for the Java SmartDashboard)
es_mx: Reinicie la SmartDashboard (no es necesario reiniciar el software de la Driver Station para el SmartDashboard de Java).
fr_ca: Redémarrez SmartDashboard (avec SmartDashboard Java, il n’est pas nécessaire de redémarrer Driver Station)
tr_tr: SmartDashboard'u yeniden başlatın (Java SmartDashboard için Driver Station yazılımını yeniden başlatmaya gerek yoktur)

source: If it still doesn't connect, verify that the Team Number is set properly in the Dashboard and that your Robot Code writes a SmartDashboard value during initialization or disabled
es_mx: Si aún no se conecta, verifique que el número de equipo esté configurado correctamente en la Dashboard y que su código de robot escriba un valor de SmartDashboard durante la inicialización o deshabilitado.
fr_ca: S’il ne se connecte toujours pas, vérifiez que le numéro d’équipe est défini correctement dans Dashboard et que votre code robot écrit une valeur au SmartDashboard pendant l’initialisation ou est désactivé
tr_tr: Hala bağlanmazsa, Takım Numarasının Kontrol Panelinde doğru şekilde ayarlandığını ve Robot Kodunuzun başlatma sırasında veya devre dışı bırakıldığında bir SmartDashboard değeri yazdığını kontrol edip doğrulayın.
