Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/using-the-labview-dashboard-with-c++-java-code.po
Languages: es_mx, fr_ca, tr_tr

source: Using the LabVIEW Dashboard with C++/Java Code
es_mx: Utilizar la Dashboard de LabVIEW con código C++/Java
fr_ca: Utilisation du Dashboard de LabVIEW avec du code C++/Java
tr_tr: C++/Java Kodunu LabVIEW Gösterge Paneli ile Kullanma

source: The default LabVIEW Dashboard utilizes Network Tables to pass values and is therefore compatible with C++ and Java robot programs. This article covers the keys and value ranges to use to work with the Dashboard.
es_mx: La Dashboard de LabVIEW utiliza Network Tables por defecto para pasar valores y por lo tanto es compatible con los programas de robots en C++ y Java. Este artículo cubre las claves y los rangos de valor a utilizar para trabajar con la Dashboard.
fr_ca: Le Dashboard de LabVIEW utilise par défaut des Network Table pour transmettre des valeurs et est donc compatible avec les programmes de robot en C++ et Java. Cet article couvre les clés et les plages de valeurs à utiliser pour travailler avec le Dashboard.
tr_tr: Varsayılan LabVIEW Gösterge Paneli, değerleri geçirmek için Ağ Tablolarını kullanır ve bundan dolayı C++ ve Java robot programları ile uyumludur. Bu makale, Gösterge Paneli ile birlikte çalışmakta kullanılacak anahtarları ve değer aralıklarını kapsar.

source: Drive Tab
es_mx: Pestaña Drive
fr_ca: Onglet Drive
tr_tr: Sürüş Sekmesi

source: Most of the indicators on the Drive tab utilize arrays.
es_mx: La mayoría de los indicadores en la pestaña Drive utilizan arreglos.
fr_ca: La plupart des indicateurs de l’onglet Drive utilisent des tableaux.
tr_tr: Sürüş sekmesindeki göstergelerin çoğu dizinleri kullanır.

source: Basic Tab
es_mx: Pestaña Basic
fr_ca: Onglet Basic
tr_tr: Temel Sekme

source: The Basic tab uses a number of keys in the a "DB" sub-table to send/receive Dashboard data. The LED's are output only, the other fields are all bi-directional (send or receive).
es_mx: La pestaña Basic utiliza un número de teclas en la sub-tabla "DB" para enviar/recibir datos de la Dashboard. Los LED´s son sólo de salida, los otros campos son todos bidireccionales (enviar o recibir).
fr_ca: L’onglet Basic utilise un certain nombre de clés dans la sous-table "DB" pour envoyer/recevoir des données du Dashboard. Les DEL sont des sorties uniquement, les autres champs sont tous bidirectionnels (envoyer ou recevoir).
tr_tr: Temel sekme, Gösterge Paneli verilerini göndermek/almak için "DB" alt tablosundaki bir dizi anahtarı kullanır. LED'ler yalnızca çıkış verir, diğer alanların hepsi çift yönlüdür (gönderme veya alma).

source: Labels
es_mx: Etiquetas
fr_ca: Étiquettes
tr_tr: Etiketler

source: The labels are currently sent as an array. C++ and Java SmartDashboard classes do not currently support sending arrays.
es_mx: Las etiquetas se envían actualmente como un arreglo. Las clases de la SmartDashboard en C++ y Java no soportan actualmente el envío de arreglos.
fr_ca: Les étiquettes sont actuellement envoyées sous forme de tableau. Les classes SmartDashboard en C++ et en Java ne supportent pas l'envoi de tableaux actuellement.
tr_tr: Etiketler şu anda dizin olarak gönderilmektedir. C++ ve Java Akıllı Gösterge Paneli sınıfları şu anda dizini göstermeyi desteklemiyor.

source: Strings
fr_ca: Chaînes de caractères
tr_tr: Karakter Dizisi

source: The strings are labeled top-to-bottom, left-to-right from "DB/String 0" to "DB/String 9". Each String field can display at least 21 characters (exact number depends on what characters). To write to these strings:
es_mx: Los strings están etiquetadas de arriba a abajo, de izquierda a derecha de "DB/String 0" a "DB/String 9". Cada campo de un string puede mostrar al menos 21 caracteres (el número exacto depende de qué caracteres). Para escribir a estas cadenas:
fr_ca: Les chaînes de caractères sont étiquetées de haut en bas, de gauche à droite, de "DB/String 0" à "DB/String 9". Chaque champ peut afficher au moins 21 caractères (le nombre exact dépend des caractères). Pour écrire ces chaînes :
tr_tr: Karakter dizileri, "DB / String 0" dan "DB / String 9" a, soldan sağa, yukarıdan aşağıya olacak şekilde etiketlenir. Her karakter dizisi alanı en az 21 karakter görüntüleyebilir (tam sayı hangi karakter olduğuna bağlıdır). Bu karakter dizilerine yazmak için:

source: To read string data entered on the Dashboard:
es_mx: Para leer los datos tipo string intgresados en el panel de control:
fr_ca: Pour lire les données de type chaîne de caractères entrées au Dashbaord :
tr_tr: Gösterge Paneline girilen karakter dizisi verilerini okumak için:

source: Buttons and LEDs
es_mx: Botones y LEDs
fr_ca: Boutons et DEL
tr_tr: Butonlar ve LED'ler

source: The Buttons and LEDs are boolean values and are labeled top-to-bottom from "DB/Button 0" to "DB/Button 3" and "DB/LED 0" to "DB/LED 3". The Buttons are bi-directional, the LEDs are only able to be written from the Robot and read on the Dashboard. To write to the Buttons or LEDs:
es_mx: Los botones y LEDs son valores booleanos y están etiquetados de arriba a abajo de "DB/Button 0" a "DB/Button 3" y "DB/LED 0" a "DB/LED 3". Los botones son bidireccionales, los LEDs sólo son capaces de ser escritos desde el robot y leidos en la Dashboard. Para escribir a los botones o LEDs:
fr_ca: Les boutons et les DEL sont des valeurs booléennes et sont étiquetés de haut en bas de "DB/Button 0" à "DB/Button 3" et "DB/LED 0" à "DB/LED 3". Les boutons sont bidirectionnels, les DEL ne peuvent être écrites qu'à partir du robot et lues que du Dashboard. Pour écrire sur les boutons ou les DEL :
tr_tr: Butonlar ve LED'ler, içerisinde doğru veya yanlış değerlerini tutabilen değişken değerlerdir ve "DB / Düğme 0" dan "DB / Düğme 3" e ve "DB / LED 0" dan "DB / LED 3" e yukarıdan aşağı etiketlenmiştir. Butonlar çift yönlüdür, LED'ler yalnızca robottan yazılabilir ve Gösterge Panelinde okunabilir. Butonlara veya LED'lere yazmak için:

source: To read from the Buttons: (default value is false)
es_mx: Para leer desde los botones: (el valor predeterminado es false)
fr_ca: Pour lire ces boutons : (la valeur par défaut est fausse)
tr_tr: Butonlardan okumak için: (varsayılan değer yanlıştır)

source: Sliders
fr_ca: Curseurs
tr_tr: Kaydırıcılar

source: The Sliders are bi-directional analog (double) controls/indicators with a range from 0 to 5. To write to these indicators:
es_mx: Los sliders o controles deslizantes son controles/indicadores analógicos bidireccionales (dobles) con un rango de 0 a 5. Para escribir a estos indicadores:
fr_ca: Les curseurs sont des contrôles/indicateurs analogiques (double) bidirectionnels avec une plage de 0 à 5. Pour écrire à ces indicateurs :
tr_tr: Kaydırıcılar, 0-5 aralığında iki yönlü analog (çift) kontroller/göstergelerdir. bu gösergelere yazmak için:

source: To read values from the Dashboard into the robot program: (default value of 0.0)
es_mx: Para leer valores de una Dashboard dentro del robot: (default value of 0.0)
fr_ca: Pour lire les valeurs à partir de Dashboard dans le programme du robot : (valeur par défaut de 0.0)
tr_tr: Gösterge Panelindeki değerleri robot programına okutmak için: (varsayılan değer 0,0)
