Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/support/support-resources.po
Languages: es_mx, tr_tr, zh_cn

source: Support Resources
es_mx: Recursos de Apoyo
tr_tr: Destek Kaynakları
zh_cn: 支持资源

source: In addition to the documentation here, there are a variety of other resources available to FRC\ |reg| teams to help understand the Control System and software.
es_mx: Además de esta documentación, existe una gran variedad de recursos disponibles para apoyar a los equipos FRC\ |reg| a entender el Sistema de Control y software.
tr_tr: Buradaki belgelere ek olarak, FRC \ | reg | Kontrol Sistemini ve yazılımı anlamaya yardımcı olacak ekipler.
zh_cn: 除了此处的文档之外，” FRC \reg “ 还提供了多种其他资源。帮助团队了解控制系统和软件。

source: Other Documentation
es_mx: Otros Recursos
tr_tr: Diğer Belgeler
zh_cn: 其他文档

source: In addition to this site there are a few other places teams may check for documentation:
es_mx: Además de este sitio, existen algunos otros sitios a los que los equipos pueden recurrir para más documentación:
tr_tr: Bu siteye ek olarak ekiplerin dokümantasyonu kontrol edebileceği birkaç yer daha var:
zh_cn: 除了这个网站，还有其他几个地方可以供团队查阅文档：

source: `NI FRC Community Documents Section <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=documents>`__
es_mx: `Documentos para la comunidad NI FRC <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=documents>`__
tr_tr: `NI FRC Topluluk Belgeleri Bölümü <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=documents>` __

source: `FIRST Inspires Technical Resources Page <https://www.firstinspires.org/resource-library?flagged=All&combine=&field_content_type_value%5B0%5D=first_robotics_competition&field_resource_library_tags_tid=171&sort_by=created_1>`__
es_mx: `Página con recursos técnicos de FIRST Inspires <https://www.firstinspires.org/resource-library?flagged=All&combine=&field_content_type_value%5B0%5D=first_robotics_competition&field_resource_library_tags_tid=171&sort_by=created_1>`__
tr_tr: `FIRST Inspires Teknik Kaynaklar Sayfası <https://www.firstinspires.org/resource-library?flagged=All&combine=&field_content_type_value%5B0%5D=first_robotics_competition&field_resource_library_tags_tid=171&sort_by=created_1>`__

source: `CTRE Product Pages <https://www.ctr-electronics.com/control-system.html>`__
es_mx: `Páginas con productos CTRE <https://www.ctr-electronics.com/control-system.html>`__

source: Forums
es_mx: Foros
tr_tr: Forumlar
zh_cn: 论坛

source: Stuck? Have a question not answered by the documentation? Official Support is provided on these forums:
es_mx: ¿Tiene dudas? ¿Tiene una pregunta que no ha podido responder con la documentación? En los siguientes foro puede encontrar Apoyo Oficial:
tr_tr: Sıkışmış mı? Belgelerde yanıtlanmayan bir sorunuz mu var? Resmi Destek şu forumlarda sağlanır:
zh_cn: 还是有疑问？有问题无法被文档内的内容解答？一下论坛将为你提供专业的官方解读：

source: `NI FRC Community Discussion Section <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=discussions>`__ (roboRIO, LabVIEW and Driver Station software questions)
es_mx: `Sección de discusión para la comunidad NI FRC <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=discussions>`__ (preguntas sobre el software de roboRIO, LabVIEW y Driver Station)
tr_tr: `NI FRC Topluluğu Tartışma Bölümü <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=discussions>`__ (roboRIO, LabVIEW ve Driver Station yazılım soruları )
zh_cn: "<NI FRC Community Discussion Section <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=discussions>" (roboRIO, LabVIEW, 和 Driver Station 相关的软件问题)

source: `FIRST Inspires Control System Forum <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/control-system?f=1338>`__ (wiring, hardware and Driver Station questions)
es_mx: `Foro del control de sistema de FIRST Inspires <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/control-system?f=1338>`__ (preguntas sobre cableado, hardware y Driver Station)
tr_tr: `FIRST Inspires Control System Forum <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/control-system?f=1338>` __ (kablolama, donanım ve Sürücü İstasyonu soruları)
zh_cn: "<FIRST Inspires Control System Forum <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/control-system?f=1338>" (走线，硬件和Driver Station相关的问题)

source: `FIRST Inspires Programming Forum <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/programming-aa>`__ (programming questions for C++, Java, or LabVIEW)
es_mx: `Foro de programación de FIRST Inspires <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/programming-aa>`__ (preguntas de programación de C++, Java, o LabVIEW)
tr_tr: `FIRST Inspires Programming Forum <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/programming-aa>`__ (C ++, Java için programlama soruları, veya LabVIEW)
zh_cn: "<FIRST Inspires Programming Forum <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/programming-aa>" (与C++， Java，或LabVIEW相关的程序问题)

source: NI Phone Support
es_mx: Apoyo vía telefónica NI

source: Have a LabVIEW, roboRIO, or Driver Station question? NI provides phone support for FRC teams during the build season at `+1 (866) 511-6285 <tel:+1-866-511-6285>`__ 1:00-7:00 PM CST Monday - Friday.
es_mx: ¿Tiene preguntas a LabView, roboRIO o la Driver Station? NI otorga apoyo vía telefónica a los equipos FRC durante la temporada de construcción a través del número `+1 (866) 511-6285 <tel:+1-866-511-6285>`__ de 1:00pm -7:00pm horario central de lunes a viernes.

source: CTRE Support
es_mx: Apoyo de CTRE
tr_tr: CTRE Destek
zh_cn: CTRE资源

source: Support for Cross The Road Electronics components (Pneumatics Control Module, Power Distribution Panel, Talon SRX, and Voltage Regulator Module) is provided via the e-mail address support@crosstheroadelectronics.com
es_mx: Puede conseguir apoyo relacionado a sus componentes Cross The Road Electronics (módulo de control neumático, panel de distribución de energía, Talon SRX, y módulo regulador de voltaje) a través del correo electrónico support@crosstheroadelectronics.com.

source: Bug Reporting
es_mx: Reporte de errores
tr_tr: Hata Raporlama
zh_cn: 错误报告

source: Found a bug? Let us know by reporting it in the Issues section of the appropriate WPILibSuite project on Github: https://github.com/wpilibsuite
es_mx: ¿Ha encontrado un error? Repórtelo en la sección de Problemas en el proyecto de WPILibSuite apropiado en Github: https://github.com/wpilibsuite
tr_tr: Bir hata mı buldunuz? Github'daki uygun WPILibSuite projesinin Sorunlar bölümünde bildirerek bize bildirin: https://github.com/wpilibsuite

source: `NI FRC Support Forum <https://forums.ni.com/t5/Support/ct-p/Support>`__
zh_cn: `NI FRC 技术支持论坛 <https://forums.ni.com/t5/Support/ct-p/Support>`__

source: REV Robotics Support
zh_cn: REV 机器人技术支持
