Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-intro.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: With WPILib, the LQR class takes a vector of desired maximum state excursions and control efforts and converts them internally to full Q and R matrices with Bryson's rule. We often use lowercase :math:`\mathbf{q}` and :math:`\mathbf{r}` to refer to these vectors, and :math:`\mathbf{Q}` and :math:`\mathbf{R}` to refer to the matrices.
es_mx: Con WPILib, las clases de LQR toman el vector de las excursiones de estado máximo deseado y esfuerzos de control y los convierte internamente a unas matrices completas Q y R con la regla de Bryson. Usualmente usamos el caso menor de :math:`\mathbf{q}` y :math:`\mathbf{r}` para referirse a esos vectores, y :math:`\mathbf{Q}` and :math:`\mathbf{R}` para referirse a las matrices.
fr_ca: Avec WPILib, la classe LQR prend un vecteur d'excursions d'état maximum souhaitées et d'efforts de contrôle et les convertit en interne en matrices Q et R complètes avec la règle de Bryson. Nous utilisons souvent des minuscules :math:`\mathbf{q}` et :math:`\mathbf{r}` pour faire référence à ces vecteurs, et :math:`\mathbf{Q}` et :math:`\mathbf{R}` pour faire référence aux matrices.
tr_tr: WPILib ile LQR sınıfı, istenen maksimum durum sapmalarını ve kontrol çabalarının bir vektörünü alır ve bunları dahili olarak Bryson kuralıyla tam Q ve R matrislerine dönüştürür. Bu vektörlere atıfta bulunmak için genellikle küçük harf :math:`\mathbf{q}` ve :math:`\mathbf{r}` kullanır ayrıca matrisleri belirtmek için :math:`\mathbf{Q}` ve :math:`\mathbf{R}` kullanır.
zh_cn: 使用WPILib，LQR类可以获取所需的最大状态偏移和控制量的向量，并根据布赖森规则在内部将它们转换为完整的Q和R矩阵。我们经常使用小写的:math:`\mathbf{q}` 和 :math:`\mathbf{r}`指代这些向量，使用:math:`\mathbf{Q}` 和 :math:`\mathbf{R}`指代矩阵。

source: Increasing the :math:`\mathbf{q}` elements would make the LQR less heavily weight large errors, and the resulting :term:`control law` will behave more conservatively. This has a similar effect to penalizing :term:`control effort` more heavily by decreasing :math:`\mathbf{r}`\'s elements.
fr_ca: L’augmentation des éléments :math:`\mathbf{q}` rendrait le LQR moins lourd poids les erreurs élevées, et la :term:`loi de commande` résultaante se comportera de manière plus conservatrice. Cela a un effet similaire à la pénalisation de :term:`l’effort de commande` plus fortement en diminuant les éléments :math:`\mathbf{r}`.

source: Similarly, decreasing the :math:`\mathbf{q}` elements would make the LQR penalize large errors more heavily, and the resulting :term:`control law` will behave more aggressively. This has a similar effect to penalizing :term:`control effort` less heavily by increasing :math:`\mathbf{r}` elements.
fr_ca: De même, la diminution des éléments :math:`\mathbf{q}` ferait que le LQR pénalise plus lourdement les erreurs élevées, et la :term:` loi de commande` qui en résulterait se comporterait de manière plus agressive. Cela a un effet similaire à pénaliser moins lourdement :term:`l’effort de commande` en augmentant les éléments :math:`\mathbf{r}`.

source: For example, we might use the following Q and R for an elevator system with position and velocity states.
es_mx: Por ejemplo, podríamos usar el siguiente Q y R para un sistema de elevador con estados de posición y velocidad.
fr_ca: Par exemple, nous pourrions utiliser les Q et R suivants pour un système d'élévateur avec des états de position et de vitesse.
tr_tr: Örneğin, konum ve hız durumlarına sahip bir asansör sistemi için aşağıdaki Q ve R'yi kullanabiliriz.
zh_cn: 例如，对于具有位置和速度状态的抬升系统，我们可以使用以下Q和R。

source: LQR: example application
es_mx: LQR: ejemplo de aplicación
fr_ca: LQR: exemple d'application
tr_tr: LQR: örnek uygulama
zh_cn: LQR：示例应用

source: Let's apply a Linear-Quadratic Regulator to a real-world example. Say we have a flywheel velocity system determined through system identification to have :math:`kV = 1 \frac{\text{volts}}{\text{radian per second}}` and :math:`kA = 1.5 \frac{\text{volts}}{\text{radian per second squared}}`. Using the flywheel example above, we have the following linear :term:`system`:
es_mx: Apliquemos un Regulador Lineal Cuadrático a un ejemplo de la vida real. Digamos que tenemos un sistema de velocidad del volante mediante un sistema de identificación para tener :math:`kV = 1 \frac{\text{volts}}{\text{radianes por segundo}}` y :math:`kA = 1.5 \frac{\text{volts}}{\text{radianes por segundo cuadrado}}`. Usando el ejemplo del volante de arriba, tenemos el siguiente :term:`sistema` lieal:
fr_ca: Appliquons un régulateur linéaire-quadratique à un exemple du monde réel. Supposons que nous ayons un système de vitesse du volant d'inertie déterminé par la technique d'identification du système pour avoir :math:`kV = 1 \frac{\text{volts}}{\text{radian per second}}` et :math:`kA = 1.5 \frac{\text{volts}}{\text{radian per second squared}}`. En utilisant l'exemple de volant d'inertie ci-dessus, nous avons le :term:`système` linéaire suivant:
tr_tr: Gerçek dünya örneğine bir Linear-Quadratic Regulator uygulayalım. :math:`kV = 1 \frac{\text{volts}}{\text{radian per second}}` ve :math:`kA = 1.5 \frac{\text{volts}}{\text{radian per second squared}}` sahip olmak için sistem tanımlaması yoluyla belirlenen bir volan hız sistemimiz olduğunu varsayalım. Yukarıdaki volan örneğini kullanarak, aşağıdaki doğrusal :term:`system` elde ederiz:
zh_cn: 让我们将线性二次稳压器应用于实际示例。假设我们有一个通过系统标识确定为:math:`kV = 1 \frac{\text{volts}}{\text{radian per second}}`和:math:`kA = 1.5 \frac{\text{volts}}{\text{radian per second squared}}`的飞轮速度系统 。使用上面的飞轮示例，我们具有以下线性:term:`system`:

source: We arbitrarily choose a desired state excursion (maximum error) of :math:`q = [0.1\ \text{rad/sec}]`, and an :math:`\mathbf{r}` of :math:`[12\ \text{volts}]`. After discretization with a timestep of 20ms, we find a :term:`gain` of :math:`\mathbf{K} = ~81`. This K :term:`gain` acts as the proportional component of a PID loop on flywheel's velocity.
es_mx: Arbitrariamente escogemos la excursión del estado deseado (error máximo) de :math:`q = [0.1\ \text{rad/seg}]`, y un :math:`\mathbf{r}` de :math:`[12\ \text{volts}]`. Después de la discretización con paso de 20ms, encontramos una :term:`ganancia` de :math:`\mathbf{K} = ~81`. Esta :term:`ganancia` K actúa como el componente proporcional del bucle PID en la velocidad del volante.
fr_ca: Nous choisissons arbitrairement une excursion d'état désirée (erreur maximale) de :math:`q = [0.1\ \text{rad/sec}]`, et un :math:`\mathbf{r}` de :math:`[12\ \text{volts}]`. Après discrétisation avec un pas de temps de 20ms, on trouve un :term:`gain` de :math:`\mathbf{K} = ~81`. Ce :term:`gain` K agit comme la composante proportionnelle d'une boucle PID sur la vitesse du volant d'inertie.
tr_tr: :math:`[12\ \text{volts}]` nın :math:`q = [0.1\ \text{rad/sec}]`, ve :math:`\mathbf{r}` si ile İstenilen bir durum sapmasını (maksimum hata) keyfi olarak seçeriz. 20 ms'lik bir zaman adımı ile ayrıklaştırmadan sonra, :math:`\mathbf{K} = ~81` nın bir :term:`gain` kazancını buluruz. Bu K :term:`gain` volanın hızı üzerindeki bir PID döngüsünün orantılı bileşeni olarak işlev görür.
zh_cn: 我们任意选择所需的状态偏移(最大误差):math:`q = [0.1\ \text{rad/sec}]`， :math:`[12\ \text{volts}]`的 :math:`\mathbf{r}` 。在20ms的时间步长下离散化后，我们得到的:term:`gain`为 :math:`\mathbf{K} = ~81`。这个:term:`gain` K作为PID回路对飞轮速度的比例分量。

source: Let's adjust :math:`\mathbf{q}` and :math:`\mathbf{r}`. We know that increasing the q elements or decreasing the :math:`\mathbf{r}` elements we use to create :math:`\mathbf{Q}` and :math:`\mathbf{R}` would make our controller more heavily penalize :term:`control effort`, analogous to trying to driving a car more conservatively to improve fuel economy. In fact, if we increase our :term:`error` tolerance q from 0.1 to 1.0, our :term:`gain` matrix :math:`\mathbf{K}` drops from ~81 to ~11. Similarly, decreasing our maximum voltage :math:`r` to 1.2 from 12.0 produces the same resultant :math:`\mathbf{K}`.
es_mx: Ajustemos :math:`\mathbf{q}` y :math:`\mathbf{r}`. Sabemos que incrementando los elementos q o decrementando los elementos :math:`\mathbf{r}` que usamos para crear :math:`\mathbf{Q}` y :math:`\mathbf{R}` hará penalizar nuestro controlador más fuertemente el :term:`esfuerzo de control`, análogo para intentar manejar un automóvil más conservativamente para mejorar ahorro de combustible. De hecho, si incrementamos nuestro :term:`error` de tolerancia q desde 0.1 a 1.0, nuestra matriz de :term:`ganancia` :math:`\mathbf{K}` cae desde ~81 to ~11. Similarmente, decrementando nuestro voltaje máximo :math:`r` a 1.2 desde 12.0 produce el mismo resultado :math:`\mathbf{K}`.
fr_ca: Ajustons :math:`\mathbf{q}` et :math:`\mathbf{r}`. Nous savons que l'augmentation des éléments q ou la diminution des éléments :math:`\mathbf{r}` que nous utilisons pour créer :math:`\mathbf{Q}` et :math:`\mathbf{R}` ferait en sorte que notre contrôleur serait pénalisé plus lourdement au niveau de :term:`l’effort de contrôle`. Ceci est similaire à essayer de conduire une voiture de manière plus conservatrice pour améliorer l'économie de carburant. En fait, si nous augmentons notre :term:`erreur` de tolérance q de 0.1 à 1.0, notre matrice de :term:`gain` :math:`\mathbf{K}` passe de ~ 81 à ~ 11. De même, en diminuant notre tension maximale :math:`r` à 1.2 à partir de 12.0, on obtient le même résultat :math:`\mathbf{K}`.
tr_tr: Haydi :math:`\mathbf{q}` ve :math:`\mathbf{r}` yi ayarlayalım. :math:`\mathbf{Q}` and :math:`\mathbf{R}` oluşturmak için kullandığımız q öğelerini artırmanın veya :math:`\mathbf{r}` öğelerini azaltmanın denetleyicimizin :term:`control effort` unu ağır bir şekilde cezalandıracağınız biliyoruz, bu yakıt ekonomisini iyileştirmek için bir arabayı daha sakin bir şekilde sürmeye benzer. Aslında, eğer :term:`error` toleransımız q yu 0,1'den 1,0'a yükseltirsek, bizim :term:`gain` matrix :math:`\mathbf{K}` ~81'den ~11'e düşer. Benzer şekilde, maksimum voltajımızı :math:`r` yi 12,0'dan 1,2'ye düşürmek de :math:`\mathbf{K}` de aynı sonucu verir .
zh_cn: 让我们调整 :math:`\mathbf{q}`和 :math:`\mathbf{r}`。我们知道，增加用于创建:math:`\mathbf{Q}` 和 :math:`\mathbf{R}` 的增加q元素或减少 :math:`\mathbf{r}`元素将使控制器更严重地不利于:term:`control effort`，类似于尝试驾驶一辆汽车更保守地提高燃油经济性。事实上，如果我们把 :term:`error`容忍度q从0.1增加到1.0，:term:`gain`矩阵:math:`\mathbf{K}` 从~81下降到~11。同样地，将最大电压 :math:`r` 从12.0降低到1.2也会产生相同的合成:math:`\mathbf{K}`。

source: The following graph shows the flywheel's angular velocity and applied voltage over time with two different :term:`gain`\s. We can see how a higher :term:`gain` will make the system reach the reference more quickly (at t = 0.8 seconds), while keeping our motor saturated at 12V for longer. This is exactly the same as increasing the P gain of a PID controller by a factor of ~8x.
es_mx: La siguiente gráfica muestra la velocidad angular del volante y el voltaje aplicado en el tiempo con dos diferentes :term:`ganancia`\s. Podemos ver como una :term:`ganancia` más alta puede hacer que el sistema alcance la referencia más rápido (a t = 0.8 segundos), mientras dejamos nuestro motor saturado a 12V por más tiempo. Es igual a incrementar la ganancia P de un controlador PID por un factor de ~8x.
fr_ca: Le graphique suivant montre la vitesse angulaire du volant d'inertie et la tension appliquée au fil du temps avec deux :term:`gain`\s. Nous pouvons voir comment un :term:`gain` plus élevé permettra au système d'atteindre la référence plus rapidement (à t = 0.8 seconde), tout en maintenant notre moteur saturé à 12V plus longtemps. C'est exactement la même chose que d'augmenter le gain P d'un régulateur PID d'un facteur ~ 8x.
tr_tr: Aşağıdaki grafik, volanın açısal hızını ve zaman içinde uygulanan voltajı iki farklı :term:`gain`\ ile gösterir. Daha yüksek bir :term:`gain` ın sistemin referansa daha hızlı (t = 0,8 saniyede) ulaşmasını sağlarken, motorumuzu daha uzun süre 12V'de doygun tutacağını görebiliriz. Bu, bir PID kontrol cihazının P kazancını ~8x faktörü ile artırmakla tamamen aynıdır.
zh_cn: 下图显示了飞轮的角速度和施加的电压随时间的变化，具有两个不同的 :term:`gain`。我们可以看到更高的 :term:`gain`将如何使系统更快地到达参考点（t = 0.8秒时），同时使我们的电机在12V时保持更长时间的饱和状态。这与将PID控制器的P增益增加约8倍完全相同。

source: Flywheel velocity and voltage over time.
fr_ca: Vitesse et tension du volant d’inertie au fil du temps.

source: LQR and Measurement Latency Compensation
es_mx: LQR y Medición de Compensación de Latencia
fr_ca: LQR et compensation de latence de mesure
tr_tr: LQR ve Ölçüm Gecikme Telafisi
zh_cn: LQR和测量延迟补偿

source: Oftentimes, our sensors have a delay associated with their measurements. For example the SPARK MAX motor controller over CAN can have up to 30ms of delay associated with velocity measurements.
es_mx: La mayoría del tiempo, nuestros sensores tienen un retraso asociado con sus medidas. Por ejemplo el controlador de motor SPARK MAX sobre CAN puede tener 30ms de retraso asociado con las mediciones de velocidad.
fr_ca: Souvent, nos capteurs ont un retard associé à leurs mesures. Par exemple, le contrôleur de moteur SPARK MAX sur CAN peut avoir jusqu'à 30 ms de retard associé aux mesures de vitesse.
tr_tr: Çoğu zaman, sensörlerimizin ölçümleriyle ilişkili bir gecikmeye sahiptir. Örneğin CAN üzerinden SPARK MAX motor kontrolörü, hız ölçümleriyle ilişkili 30 ms'ye kadar gecikmeye sahip olabilir.
zh_cn: 通常，我们的传感器会因测量而延迟。例如，通过CAN的SPARK MAX电动机控制器可能具有与速度测量相关的长达30ms的延迟。

source: This lag means that our feedback controller will be generating voltage commands based on state estimates from the past. This often has the effect of introducing instability and oscillations into our system, as shown in the graph below.
es_mx: Este retraso significa que nuestro controlador de retroalimentación va a estar generando comandos de voltaje basados en estimaciones de estado del pasado. Regularmente tiene el efecto de introducir inestabilidad y oscilaciones en el sistema, como se muestra en la gráfica de abajo.
fr_ca: Ce décalage signifie que notre contrôleur de rétroaction générera des commandes de tension basées sur des estimations d'état du passé. Cela a souvent pour effet d'introduire de l'instabilité et des oscillations dans notre système, comme le montre le graphique ci-dessous.
tr_tr: Bu gecikme, geri bildirim denetleyicimizin geçmişteki durum tahminlerine göre voltaj komutları oluşturacağı anlamına gelir. Bu, genellikle aşağıdaki grafikte gösterildiği gibi sistemimize kararsızlık ve salınımlar getirme etkisine sahiptir.
zh_cn: 这种滞后现象意味着我们的反馈控制器将基于过去的状态估计来生成电压命令。如下图所示，这通常会给我们的系统带来不稳定性和振荡。

source: However, we can model our controller to control where the system's :term:`state` is delayed into the future. This will reduce the LQR's :term:`gain` matrix :math:`\mathbf{K}`, trading off controller performance for stability. The below formula, which adjusts the :term:`gain` matrix to account for delay, is also used in system identification.
fr_ca: Cependant, nous pouvons modéliser notre contrôleur pour contrôler où le :term:`state` du système est retardé dans le futur. Cela réduira la matrice :term:`gain` du LQR :math:`\mathbf{K}`, échangeant les performances du contrôleur contre la stabilité. La formule ci-dessous, qui ajuste la matrice :term:`gain` pour tenir compte du retard, est également utilisée dans l'identification du système.

source: Multiplying :math:`\mathbf{K}` by :math:`\mathbf{A} - \mathbf{BK}` essentially advances the gains by one timestep. In this case, we multiply by :math:`\left(\mathbf{A} - \mathbf{BK}\right)^{\text{delay} / dt}` to advance the gains by measurement's delay.
es_mx: Multiplicando :math:`\mathbf{K}` por :math:`\mathbf{A} - \mathbf{BK}` esencialmente avanza las ganancias por un paso de tiempo. En este caso, multiplicamos por :math:`\left(\mathbf{A} - \mathbf{BK}\right)^{\text{delay} / dt}` para avanzar las ganancias por el retraso de las mediciones.
fr_ca: Multiplier :math:`\mathbf{K}` par :math:`\mathbf{A} - \mathbf{BK}` avance essentiellement les gains d'un pas de temps. Dans ce cas, on multiplie par :math:`\left(\mathbf{A} - \mathbf{BK}\right)^{\text{delay} / dt}` pour avancer les gains par le retard de la mesure.
tr_tr: :math:`\mathbf{A} - \mathbf{BK}` ile :math:`\mathbf{K}` çarpmak temelde kazançları bir zaman adımı ilerletir. Bu durumda, kazançları ölçüm gecikmesiyle ilerletmek için :math:`\left(\mathbf{A} - \mathbf{BK}\right)^{\text{delay} / dt}` ile çarpıyoruz.
zh_cn: :math:`\mathbf{K}` 与:math:`\mathbf{A} - \mathbf{BK}`的乘积实质上使增益提高了一个时间步长。 在这种情况下，我们将乘以 :math:`\left(\mathbf{A} - \mathbf{BK}\right)^{\text{delay} / dt}`来提高测量延时的增益。

source: Flywheel velocity and voltage with dt=5.0ms and a 10.0ms delay.
fr_ca: Vitesse et tension du volant d’inertie avec dt = 5,0ms et un retard de 10,0ms.

source: This can have the effect of reducing :math:`\mathbf{K}` to zero, effectively disabling feedback control.
es_mx: Esto puede tener efecto de reducir :math:`\mathbf{K}` a cero, de manera efectiva inhabilitando el control de retroalimentación.
fr_ca: Cela peut avoir pour effet de réduire :math:`\mathbf{K}` à zéro, désactivant ainsi la commande de rétroaction.
tr_tr: Bu, :math:`\mathbf{K}` 'yi sıfıra düşürerek geribildirim kontrolünü etkin bir şekilde devre dışı bırakma etkisine sahip olabilir.
zh_cn: 这样可以将:math:`\mathbf{K}`减小为零，从而有效地禁用反馈控制。

source: The SPARK MAX motor controller uses a 40-tap FIR filter with a delay of 19.5ms, and status frames are by default sent every 20ms.
es_mx: El controlador de motor SPARK MAX utiliza un filtro FIR de 40 tomas con un retraso de 19,5 ms, y los marcos de estado se envían por defecto cada 20 ms.
fr_ca: Le contrôleur de moteur SPARK MAX utilise un filtre à réponse impulsionnelle finie ou RIF à 40 prises avec un retard de 19.5 ms, et les trames d’état sont envoyées par défaut tous les 20ms.
zh_cn: SPARK Max电机控制器使用40抽头FIR滤波器，其延迟为19.5ms，默认情况下每20ms发送一次状态帧。

source: The code below shows how to adjust the LQR controller's K gain for sensor input delays:
es_mx: El siguiente código muestra cómo ajustar la ganancia K del controlador LQR para los retardos de entrada del sensor:
fr_ca: Le code ci-dessous montre comment régler le gain K du contrôleur LQR pour les délais d'entrée du capteur:
zh_cn: 以下代码显示了如何针对传感器输入延迟来调整LQR控制器的K增益：

source: Linearization
es_mx: Linealización
fr_ca: Linéarisation
tr_tr: Doğrusallaştırma
zh_cn: 线性化

source: Linearization is a tool used to approximate nonlinear functions and state-space systems using linear ones. In two-dimensional space, linear functions are straight lines while nonlinear functions curve. A common example of a nonlinear function and its corresponding linear approximation is :math:`y=\sin{x}`. This function can be approximated by :math:`y=x` near zero. This approximation is accurate while near :math:`x=0`, but looses accuracy as we stray further from the linearization point. For example, the approximation :math:`\sin{x} \approx x` is accurate to within 0.02 within 0.5 radians of :math:`y = 0`, but quickly loses accuracy past that. In the following picture, we see :math:`y =\sin{x}`, :math:`y=x` and the difference between the approximation and the true value of :math:`\sin{x}` at :math:`x`.
es_mx: La linealización es una herramienta usada para aproximar las funciones no lineales y el sistema de estado-espacio usando las lineales. En el espacio bidimensional, las funciones lineales son líneas derechas mientras las funciones no lineales son curvas. Un ejemplo común de la función no lineal y correspondiente aproximación lineal es :math:`y=\sin{x}`. Esta función puede estar aproximada por :math:`y=x` cercano a cero. Esta aproximación es precisa mientras esté cerca de :math:`x=0`, pero pierde la precisión mientras más nos alejamos del punto de linealización. Por ejemplo, la aproximación :math:`\sin{x} \approx x` es precisa a 0.02 - 0.5 radianes de :math:`y = 0`, pero rápidamente pierde la precisión después de eso. La siguiente imagen, podemos ver:math:`y =\sin{x}`, :math:`y=x` y la diferencia entre la aproximación y el valor real de :math:`\sin{x}` en :math:`x`.
fr_ca: La linéarisation est un outil utilisé pour approximer les fonctions non linéaires et les systèmes d'espace d'états en faisant usage de systèmes linéaires. Dans l'espace bidimensionnel, les fonctions linéaires sont des lignes droites tandis que les fonctions non linéaires sont courbes. Un exemple courant de fonction non linéaire et de son approximation linéaire correspondante est: :math:`y=\sin{x}`. Cette fonction peut être approximée par :math:`y=x` près de zéro. Cette approximation est précise lorsqu'elle est proche de :math:`x=0`, mais perd de la précision lorsque nous nous éloignons du point de linéarisation. Par exemple, l'approximation :math:`\sin{x} \approx x` est précise à 0.02 près de 0.5 radians de :math:`y = 0`, mais perd rapidement sa précision au-delà. Dans l'image suivante, nous voyons :math:`y =\sin{x}`, :math:`y=x` et la différence entre l'approximation et la vraie valeur de :math:`\sin{x}` à :math:`x`.
tr_tr: Doğrusallaştırma, doğrusal olmayan fonksiyonları ve durum uzay sistemlerini doğrusal olanları kullanarak kestirmek için kullanılan bir araçtır. İki boyutlu uzayda doğrusal fonksiyonlar düz çizgilerdir, doğrusal olmayan fonksiyonlar ise eğri olur. Doğrusal olmayan bir fonksiyonun yaygın bir örneği ve buna karşılık gelen doğrusal yaklaşımı şöyledir :math:`y=\sin{x}`. Bu fonksiyon şu şekilde yaklaştırılabilir :math:`y = x` sıfıra yakın. Bu yaklaşım, :math:`x=0` a yakın iken doğrudur, ancak doğrusallaştırma noktasından uzaklaştıkça doğruluğu kaybeder. Örneğin, :math:`\sin{x} \approx x` yaklaşımı :math:`y = 0` 0,5 radyan içinde 0,02 aralığında doğrudur, ancak bundan sonra doğruluğu hızla kaybeder. Aşağıdaki resimde şunu görüyoruz :math:`y =\sin{x}`, :math:`y=x` ve yaklaşık ile gerçek değeri arasındaki fark :math:`\sin{x}` at :math:`x`.
zh_cn: 线性化是一种工具，用于近似非线性函数和状态空间系统的线性处理。在二维空间中，线性函数是直线，而非线性函数是曲线。一个常见的非线性函数及其对应的线性近似例子是 :math:`y=\sin{x}`， :math:`y=x` 在0附近时，可以近似使用这个函数。当接近 :math:`x=0`时，这个近似是准确的，但随着我们离线性化点越来越远，该精度会降低。例如，在:math:`y = 0的0.5弧度内，近似值 :math:`\sin{x} \approx x`精确到0.02以内，但是很快就失去了精度。在下面的图中，我们看到:math:`y =\sin{x}`, :math:`y=x`以及 :math:`x`处 :math:`\sin{x}`的近似值和真实值之间的差值。

source: Three plots showing sin(x), x, and sin(x) - x.
fr_ca: Trois tracés montrant sin(x), x et sin(x) - x.

source: We can also linearize state-space systems with nonlinear :term:`dynamics`. We do this by picking a point :math:`\mathbf{x}` in state-space and using this as the input to our nonlinear functions. Like in the above example, this works well for states near the point about which the system was linearized, but can quickly diverge further from that state.
es_mx: Podemos también linealizar el sistema estado-espacio con :term:`dinámicas` no lineales. Hacemos esto eligiendo un punto :math:`\mathbf{x}` en el estado-espacio y usando esto como entrada para nuestras funciones no lineales. Como el ejemplo de arriba, esto funciona bien para los estados cerca del punto sobre el cual se linealiza el sistema, pero podemos divergir rápidamente lejos de ese estado.
fr_ca: Nous pouvons également linéariser des systèmes d'espace d'états en faisant appel à une :term:`dynamique` non-linéaire. Pour ce faire, choisissons un point :math:`\mathbf{x}` dans l'espace d'états et en utilisons-le comme entrée de nos fonctions non linéaires. Comme dans l'exemple ci-dessus, cela fonctionne bien pour les états proches du point sur lequel le système a été linéarisé, mais peut rapidement diverger davantage de cet état.
tr_tr: Doğrusal olmayan :term:`dynamics" ile durum uzay sistemlerini de doğrusallaştırabiliriz. Bunu durum uzayında bir nokta :math:`\mathbf{x}` seçerek ve bunu doğrusal olmayan fonksiyonlarımızın girdisi olarak kullanarak yapıyoruz. Yukarıdaki örnekte olduğu gibi, bu, sistemin doğrusallaştırıldığı noktaya yakın durumlar için iyi çalışır, ancak bu durumdan hızla uzaklaşabilir.
zh_cn: 我们还可以使用非线性 :term:`dynamics`将状态空间系统线性化。为此，我们在状态空间中选择一个点 :math:`\mathbf{x}` 并将其用作非线性函数的输入。像上面的示例一样，这对于系统线性化的点附近的状态效果很好，但是可以迅速偏离该状态。
