Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-observers.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: As we project the model forward, :math:`\mathbf{P}` increases as our certainty about the system's true state decreases.
es_mx: A medida que proyectamos el modelo hacia adelante, :math:\mathbf{P}` aumenta a medida que disminuye nuestra certeza sobre el verdadero estado del sistema.
fr_ca: Au fur et à mesure que nous projetons le modèle vers l'avant, :math:`\mathbf{P}` augmente à mesure que notre certitude sur l'état réel du système diminue.
tr_tr: Modeli ileriye doğru yansıtırken, sistemin gerçek durumu hakkındaki kesinliğimiz azaldıkça :math:`\mathbf{P}` artar.
zh_cn: 当我们向前预测模型时，:math:`\mathbf{P}` 会随着我们对系统真实状态的确定性降低而增加。

source: Predict step
es_mx: Predecir paso
fr_ca: L'étape de prédiction
tr_tr: Tahmin adımı
zh_cn: 预测步骤

source: In prediction, our state estimate is updated according to the linear system dynamics :math:`\mathbf{\dot{x} = Ax + Bu}`. Furthermore, our error covariance :math:`\mathbf{P}` increases by the process noise covariance matrix :math:`\mathbf{Q}`. Larger values of :math:`\mathbf{Q}` will make our error covariance :math:`\mathbf{P}` grow more quickly. This :math:`\mathbf{P}` is used in the correction step to weight the model and measurements.
es_mx: En la predicción, nuestra estimación de estado se actualiza de acuerdo con la dinámica del sistema lineal :math:`\mathbf{\dot{x} = Ax + Bu}`. Además, nuestra covarianza de error :math:`\mathbf{P}` aumenta por la matriz de covarianza de ruido del proceso :math:`\mathbf{Q}`. Los valores más grandes de :math:`\mathbf{Q}` harán que nuestra covarianza de error :math:`\mathbf{P}` crezca más rápidamente. Esto :math:`\mathbf{P}` se usa en el paso de corrección para ponderar el modelo y las medidas.
fr_ca: En prédiction, notre estimation d'état est mise à jour selon la dynamique du système linéaire :math:`\mathbf{\dot{x} = Ax + Bu}`. De plus, notre covariance d'erreur :math:`\mathbf{P}` augmente selon la matrice de covariance du bruit de processus :math:`\mathbf{Q}`. Des valeurs plus grandes de:math:`\mathbf{Q}` feront croître notre covariance d'erreur :math:`\mathbf{P}` plus rapidement. Ceci :math:`\mathbf{P}` est utilisé dans l'étape de correction pour pondérer le modèle et les mesures.
tr_tr: Tahminde, durum tahminimiz doğrusal sistem dinamiklerine göre güncellenir :math:`\mathbf{\dot{x} = Ax + Bu}`. Ayrıca, hata kovaryansımız :math:`\mathbf{P}`, işlem gürültü kovaryans matrisi :math:`\mathbf{Q}` ile artar. Daha büyük :math:`\mathbf{Q}` değerleri, hata kovaryansımızın :math:`\mathbf{P}` daha hızlı büyümesini sağlayacaktır. Bu :math:`\mathbf{P}`, modeli ve ölçümleri ağırlıklandırmak için düzeltme adımında kullanılır.
zh_cn: 在预测中，我们的状态估计是根据线性系统动力学:math:`\mathbf{\dot{x} = Ax + Bu}`更新的。此外，我们的误差协方差:math:`\mathbf{P}` 随着过程噪声协方差矩阵:math:`\mathbf{Q}`的增大而增大，:math:`\mathbf{Q}`的值越大，我们的误差协方差 :math:`\mathbf{P}` 增长得越快。这个 :math:`\mathbf{P}` 用于校正步骤，以权重模型和测量。

source: Correct step
es_mx: Paso correcto
fr_ca: L'étape correcte
tr_tr: Doğru adım
zh_cn: 校正步骤

source: In the correct step, our state estimate is updated to include new measurement information. This new information is weighted against the state estimate :math:`\mathbf{\hat{x}}` by the Kalman gain :math:`\mathbf{K}`. Large values of :math:`\mathbf{K}` more highly weight incoming measurements, while smaller values of :math:`\mathbf{K}` more highly weight our state prediction. Because :math:`\mathbf{K}` is related to :math:`\mathbf{P}`, larger values of :math:`\mathbf{P}` will increase :math:`\mathbf{K}` and more heavily weight measurements. If, for example, a filter is predicted for a long duration, the large :math:`\mathbf{P}` would heavily weight the new information.
es_mx: En el paso correcto, nuestra estimación de estado se actualiza para incluir nueva información de medición. Esta nueva información se pondera contra la estimación del estado :math:`\mathbf{\hat{x}}` por la ganancia de Kalman :math:`\mathbf{K}`. Los valores grandes de :math:`\mathbf{K}` ponderan más las medidas entrantes, mientras que los valores más pequeños de :math:`\mathbf{K}` ponderan más nuestra predicción de estado. Porque :math:`\mathbf{K}` está relacionado con :math:`\mathbf{P}`, los valores más grandes de :math:`\mathbf{P}` aumentarán :math:`\mathbf{K}` y medidas más pesadas. Si, por ejemplo, se predice un filtro para una duración prolongada, el grande :math:`\mathbf{P}` ponderaría mucho la nueva información.
fr_ca: À l'étape correcte, notre estimation d'état est mise à jour pour inclure de nouvelles informations de mesure. Cette nouvelle information est pondérée par rapport à l'estimation d'état :math:`\mathbf{\hat{x}}` par le gain de Kalman :math:`\mathbf{K}`. Les grandes valeurs de :math:`\mathbf{K}` influencent plus fortement les mesures entrantes, tandis que les valeurs plus petites de :math:`\mathbf{K}` influencent plus fortement notre prédiction d'état. Parce que :math:`\mathbf{K}` est lié à :math:`\mathbf{P}`, des valeurs plus grandes de :math:`\mathbf{P}` augmenteront :math:`\mathbf{K}` et influencer encore plus les mesures. Si, par exemple, un filtre est utilisé pour une longue période, une valeur élevée de :math:`\mathbf{P}` pondérerait fortement les nouvelles informations.
tr_tr: Doğru adımda, durum tahminimiz yeni ölçüm bilgilerini içerecek şekilde güncellenir. Bu yeni bilgi, Kalman kazancı :math:`\mathbf{K}` tarafından :math:`\ mathbf{\hat {x}}` 'durum tahminine göre ağırlıklandırılır. :math:`\mathbf{K}` 'nın büyük değerleri gelen ölçümleri daha fazla ağırlıklandırırken, :math:`\mathbf{K}` 'nın daha küçük değerleri durum tahminimize daha fazla ağırlık verir. Çünkü :math:`\mathbf{K}`, :math:`\mathbf{P}` ile ilgilidir, :math:`\mathbf{P}` 'nin daha büyük değerleri :math:`\mathbf{K}' 'yı arttıracaktır ve ölçümleri daha ağırlıklandıracaktır. Örneğin, uzun bir süre için bir filtre tahmin edilirse, büyük :math:`\mathbf{P}`, yeni bilgileri büyük ölçüde ağırlaştıracaktır.
zh_cn: 在校正步骤中，我们的状态估计值将更新为包含新的测量信息。这个新信息通过卡尔曼增益 :math:`\mathbf{K}`与状态估计值:math:`\mathbf{\hat{x}}`进行加权，较大的 :math:`\mathbf{K}`.值对进入测量值的权重更高，较小的 :math:`\mathbf{K}` 值对我们的状态预测的权重更高。因为 :math:`\mathbf{K}`与 :math:`\mathbf{P}`相关， :math:`\mathbf{P}`值越大， :math:`\mathbf{K}`就越高，重量测量也越重。例如，如果一个过滤器预测了很长一段时间，那么大的:math:`\mathbf{P}`将会赋予新信息很大的权重。

source: Finally, the error covariance :math:`\mathbf{P}` decreases to increase our confidence in the state estimate.
es_mx: Finalmente, la covarianza de error :math:`\mathbf{P}` disminuye para aumentar nuestra confianza en la estimación del estado.
fr_ca: Enfin, la covariance d'erreur :math:`\mathbf{P}` diminue pour augmenter notre confiance dans l'estimation de l'état.
tr_tr: Son olarak, hata kovaryansı :math:`\mathbf{P}` durum tahminine olan güvenimizi artırmak için azalır.
zh_cn: 最后，误差协方差 :math:`\mathbf{P}` 减少，以增加我们对状态估计的信心。

source: Tuning Kalman Filters
es_mx: Ajuste de los filtros de Kalman
fr_ca: Le réglage des filtres Kalman
tr_tr: Kalman Filtrelerini Ayarlama
zh_cn: 调整卡尔曼过滤器

source: WPILib's Kalman Filter classes' constructors take a linear system, a vector of process noise standard deviations and measurement noise standard deviations. These are converted to :math:`\mathbf{Q}` and :math:`\mathbf{R}` matrices by filling the diagonals with the square of the standard deviations, or variances, of each state or measurement. By decreasing a state's standard deviation (and therefore its corresponding entry in :math:`\mathbf{Q}`), the filter will distrust incoming measurements more. Similarly, increasing a state's standard deviation will trust incoming measurements more. The same holds for the measurement standard deviations -- decreasing an entry will make the filter more highly trust the incoming measurement for the corresponding state, while increasing it will decrease trust in the measurement.
es_mx: Los constructores de las clases de filtros Kalman de WPILib toman un sistema lineal, un vector de desviaciones estándar de ruido de proceso y desviaciones estándar de ruido de medición. Éstos se convierten en matrices :math:`\mathbf{Q}` y :math:`\mathbf{R}` llenando las diagonales con el cuadrado de las desviaciones estándar, o varianzas, de cada estado o medida. Al disminuir la desviación estándar de un estado (y por lo tanto su entrada correspondiente en :math:`\mathbf{Q}`), el filtro desconfiará más de las mediciones entrantes. De manera similar, aumentar la desviación estándar de un estado confiará más en las mediciones entrantes. Lo mismo se aplica a las desviaciones estándar de la medición: disminuir una entrada hará que el filtro confíe más en la medición entrante para el estado correspondiente, mientras que aumentarla disminuirá la confianza en la medición.
fr_ca: Les constructeurs des classes de filtre Kalman de WPILib utilisent un système linéaire, un vecteur des écarts-types de bruit de processus et des écarts-types de bruit de mesure. Ceux-ci sont convertis en matrices :math:`\mathbf{Q}` et :math:`\mathbf{R}` en remplissant les diagonales avec le carré des écarts-types, ou variances, de chaque état ou mesure. En diminuant l'écart type d'un état (et donc son entrée correspondante dans :math:`\mathbf{Q}`), le filtre se fera moins confiance aux mesures entrantes. De même, l'augmentation de l'écart type d'un état fera davantage confiance aux mesures entrantes. Il en va de même pour les écarts-types de mesure - la diminution d'une entrée augmentra la confiance du filtre par rapport à la mesure entrante pour l'état correspondant, tandis que son augmentation diminuera la confiance dans la mesure.
tr_tr: WPILib'in Kalman Filtresi sınıflarının constructorları, doğrusal bir sistemi, işlem gürültüsü standart sapmalarının bir vektörünü ve ölçüm gürültüsü standart sapmalarını alır. Bunlar, köşegenleri her durum veya ölçümün standart sapmalarının veya varyanslarının karesiyle doldurarak :math:`\mathbf{Q}` ve :math:`\mathbf{R}` matrislerine dönüştürülür. Bir durumun standart sapmasını (ve dolayısıyla, :math:`\mathbf{Q}` içindeki karşılık gelen girdisini) azaltarak, filtre gelen ölçümlere daha fazla güvenmeyecektir. Benzer şekilde, bir durumun standart sapmasını artırmak, gelen ölçümlere daha çok güvenecektir. Aynısı, ölçüm standart sapmaları için de geçerlidir - bir girişi azaltmak, filtrenin ilgili durum için gelen ölçüme daha fazla güvenmesini sağlarken, artması ölçüme olan güveni azaltacaktır.
zh_cn: WPILib的卡尔曼滤波类的构造器采用线性系统、过程噪声标准差和测量噪声标准差向量。通过用每个状态或测量的标准差或方差的平方填充对角线，这些矩阵转换为:math:`\mathbf{Q}` 和 :math:`\mathbf{R}`矩阵。通过减少一个状态的标准偏差(以及:math:`\mathbf{Q}`中相应的条目)，过滤器将更加不信任传入的度量。类似地，增加一个州的标准偏差将更信任传入的测量结果。对于测量标准偏差也是如此——减少一个条目将使过滤器更加信任输入的测量值对应的状态，而增加它将降低对测量值的信任。
