Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-observers.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: State Observers and Kalman Filters
es_mx: Observadores de estado y filtros de Kalman
fr_ca: Observateurs d'état et filtres de Kalman
tr_tr: Durum denetleyicisi ve Kalman Filtreleri
zh_cn: 状态观察者和卡尔曼滤波器

source: State observers combine information about a system's behavior and external measurements to estimate the true :term:`state` of the system. A common observer used for linear systems is the Kalman Filter. Kalman filters are advantageous over other :ref:`filters <docs/software/advanced-controls/filters/index:Filters>` as they fuse measurements from one or more sensors with a state-space model of the system to optimally estimate a system's state.
es_mx: Los observadores de estados combinan información sobre el comportamiento de un sistema y mediciones externas para estimar el verdadero :term:`estado` del sistema. Un observador común utilizado para sistemas lineales es el filtro de Kalman. Los filtros de Kalman son ventajosos sobre otros :ref:`filtros <docs/software/advanced-controls/filters/index:Filters>` ya que fusionan las mediciones de uno o más sensores con un modelo de espacio de estado del sistema para estimar de manera óptima el estado de un sistema.
fr_ca: Les observateurs d'état combinent des informations sur le comportement d'un système et des mesures externes pour estimer :term:`l’état` du système. Un observateur commun utilisé pour les systèmes linéaires est le filtre de Kalman. Les filtres de Kalman sont avantageux par rapport aux autres :ref:`filtres <docs/software/advanced-controls/filters/index:Filters>` car ils fusionnent les mesures d'un ou plusieurs capteurs avec un modèle d'espace d'état du système pour estimer de manière optimale l'état d'un système.
tr_tr: Durum gözlemcileri, sistemin doğru :term:`state` nu tahmin etmek için bir sistemin davranışı ve harici ölçümler hakkındaki bilgileri birleştirir. Doğrusal sistemler için kullanılan yaygın bir gözlemci Kalman Filtresidir. Kalman filtreleri diğerlerine göre avantajlıdır :ref:`filters <docs/software/advanced-controls/filters/index:Filters>`, bir sistemin durumunu en iyi şekilde tahmin etmek için sistemin durum-uzay modeliyle bir veya daha fazla sensörden alınan ölçümleri birleştirir.
zh_cn: 状态观察者将关于系统行为的信息和外部度量结合起来，以估计系统的真实状态。线性系统常用的观测器是卡尔曼滤波器。卡尔曼滤波器比其他 :ref:`filters <docs/software/advanced-controls/filters/index:Filters>`更有优势，因为它们将来自一个或多个传感器的测量结果与系统的状态空间模型相融合，以最佳估计系统的状态。

source: This image shows flywheel velocity measurements over time, run through a variety of different filters. Note that a well-tuned Kalman filter shows no measurement lag during flywheel spinup while still rejecting noisy data and reacting quickly to disturbances as balls pass through it. More on filters can be found in the :ref:`filters section <docs/software/advanced-controls/filters/index:Filters>`\.
es_mx: Esta imagen muestra las mediciones de la velocidad del volante a lo largo del tiempo, ejecutadas a través de una variedad de filtros diferentes. Tenga en cuenta que un filtro de Kalman bien ajustado no muestra ningún retraso de medición durante el giro del volante, mientras que sigue rechazando datos ruidosos y reacciona rápidamente a las perturbaciones cuando las bolas pasan a través de él. Puede encontrar más información sobre filtros en :ref:`sección de filtros <docs/software/advanced-controls/filters/index:Filters>` \.
fr_ca: Cette image montre les mesures de vitesse d'un volant d'inertie au fil du temps, exécutées à travers une variété de filtres différents. Notez qu'un filtre de Kalman bien réglé ne montre aucun décalage de mesure pendant la rotation du volant tout en rejetant les données bruyantes et en réagissant rapidement aux perturbations lorsque les billes le traversent. Vous trouverez plus d'informations sur les filtres dans la :ref:` section filtres <docs/software/advanced-controls/filters/index:Filters>`\.
tr_tr: Bu görüntü, çeşitli farklı filtrelerden geçen zaman içindeki dönenteker hızı ölçümlerini gösterir. İyi ayarlanmış bir Kalman filtresinin dönerteker dönüşü sırasında hiçbir ölçüm gecikmesi göstermediğini ve gürültülü verileri hala reddederken ve toplar içinden geçerken rahatsızlıklara hızlı tepki verdiğini unutmayın. Filtrelerle ilgili daha fazla bilgi :ref:`filters section <docs/software/advanced-controls/filters/index:Filters>`\ bulunabilir.
zh_cn: 这张图片显示了飞轮速度随时间的测量，通过各种不同的过滤器运行。注意，一个调谐良好的卡尔曼滤波器在飞轮旋转时没有显示测量滞后，同时仍然拒绝噪声数据，并对球通过时的干扰做出快速反应。更多关于过滤器的信息可以在:ref:`filters section <docs/software/advanced-controls/filters/index:Filters>`\找到。

source: Filter comparison between: Kalman, Median, and IIR.
fr_ca: Comparaison de filtres entre: Kalman, Median et RII.

source: Gaussian Functions
es_mx: Funciones gaussianas
fr_ca: Les fonctions gaussiennes
tr_tr: Gauss Fonksiyonları
zh_cn: 高斯函数

source: Kalman filters utilize `Gaussian distributions <https://en.wikipedia.org/wiki/Gaussian_function>`__ (or bell curves) to model the noise in a process. The graph of a Gaussian function is a "bell curve" shape. This function is described by its mean (the location of the "peak" of the bell curve) and variance (a measure of how "spread out" the bell curve is). In the case of a Kalman filter, the estimated :term:`state` of the system is the mean, while the variance is a measure of how certain (or uncertain) the filter is about the true :term:`state`.
es_mx: Los filtros Kalman utilizan `Distribuciones gaussianas <https://en.wikipedia.org/wiki/Gaussian_function>`__ (o curvas de campana) para imitar el ruido en un proceso. La gráfica de una función gaussiana tiene una figura de "curva de campana". Esta función es descrita por su nombre (la ubicación del "pico" de la curva de campana) y varianza (una medida de que tan "extendida" esta la curva). En el caso de un filtro Kalman, el estimado :term:`estado` de sistema es el medio, mientras la varianza es la medida de que tan cierto (o incierto) el filtro es sobre su verdadero :term:`estado`.
fr_ca: Les filtres de Kalman utilisent des `distributions gaussiennes <https://en.wikipedia.org/wiki/Gaussian_function>`__ (ou courbes en cloche) pour modéliser le bruit dans un processus. Le graphique d'une fonction gaussienne est une forme de "courbe en cloche". Cette fonction est décrite par sa moyenne (l'emplacement du «pic» de la courbe en cloche) et sa variance (une mesure de «l'étalement» de la courbe en cloche). Dans le cas d'un filtre de Kalman, l'estimation de :term:`l’état` du système est la moyenne, tandis que la variance est une mesure du degré de certitude (ou d'incertitude) du filtre par rapport à :term:`l’état` réel.
tr_tr: Kalman filtreleri, bir süreçteki gürültüyü modellemek için `Gauss dağılımlarını <https://en.wikipedia.org/wiki/Gaussian_function>`__ (veya çan eğrilerini) kullanır. Bir Gauss fonksiyonunun grafiği bir "çan eğrisi" şeklidir. Bu fonksiyon, ortalaması (çan eğrisinin "tepe noktasının-peak" konumu) ve varyansı (çan eğrisinin nasıl "yayıldığının" bir ölçüsü) ile tanımlanır. Kalman filtresi durumunda, sistemin tahmini :term:`state` ortalamadır, varyans ise filtrenin gerçek :term:`state-durum` hakkında ne kadar kesin (veya belirsiz) olduğunun bir ölçüsüdür.
zh_cn: 卡尔曼滤波器利用`Gaussian distributions <https://en.wikipedia.org/wiki/Gaussian_function>`(或钟形曲线)来建模过程中的噪声。高斯函数的图形是“钟形曲线”形状。这个函数通过它的平均值(钟形曲线“峰值”的位置)和方差(钟形曲线如何“扩散”的度量)来描述。在卡尔曼滤波器的情况下，系统的估计 :term:`state`是平均值，而方差是对滤波器对真实 :term:`state`确定(或不确定)程度的度量。

source: The idea of variance and covariance is central to the function of a Kalman filter. Covariance is a measurement of how two random variables are correlated. In a system with a single state, the covariance matrix is simply :math:`\mathbf{\text{cov}(x_1, x_1)}`, or a matrix containing the variance :math:`\mathbf{\text{var}(x_1)}` of the state :math:`x_1`. The magnitude of this variance is the square of the standard deviation of the Gaussian function describing the current state estimate. Relatively large values for covariance might indicate noisy data, while small covariances might indicate that the filter is more confident about it's estimate. Remember that "large" and "small" values for variance or covariance are relative to the base unit being used -- for example, if :math:`\mathbf{x_1}` was measured in meters, :math:`\mathbf{\text{cov}(x_1, x_1)}` would be in meters squared.
es_mx: La idea de varianza y covarianza es fundamental para la función de un filtro de Kalman. La covarianza es una medida de cómo se correlacionan dos variables aleatorias. En un sistema con un solo estado, la matriz de covarianza es simplemente :math:`\ mathbf {\ text {cov} (x_1, x_1)}`, o una matriz que contiene la varianza:math:`\ mathbf {\ text {var } (x_1)} `del estado: matemáticas:` x_1`. La magnitud de esta varianza es el cuadrado de la desviación estándar de la función gaussiana que describe la estimación del estado actual. Los valores relativamente grandes de covarianza pueden indicar datos ruidosos, mientras que las pequeñas covarianzas pueden indicar que el filtro tiene más confianza en su estimación. Recuerde que los valores "grandes" y "pequeños" para la varianza o covarianza son relativos a la unidad base que se está utilizando, por ejemplo, si :math:`\ mathbf{x_1}` se midió en metros, :math:`\mathbf{\text{cov}(x_1, x_1)}` estaría en metros al cuadrado.
fr_ca: L'idée de variance et de covariance est au cœur de la fonction d'un filtre de Kalman. La covariance est une mesure de la manière dont deux variables aléatoires sont corrélées. Dans un système à un seul état, la matrice de covariance est simplement :math:`\mathbf{\text{cov}(x_1, x_1)}`, ou une matrice contenant la variance :math:`\mathbf{\text{var}(x_1)}` de l'état :math:`x_1`. L'amplitude de cette variance est le carré de l'écart type de la fonction gaussienne décrivant l'estimation de l'état actuel. Des valeurs relativement élevées de covariance peuvent indiquer des données bruyantes, tandis que de petites covariances peuvent indiquer que le filtre est plus sûr de son estimation. Rappelez-vous que les valeurs "grandes" et "petites" de la variance ou de la covariance sont relatives à l'unité de base utilisée - par exemple, si :math:`\mathbf{x_1}` a été mesurée en mètres, :math:`\mathbf{\text{cov}(x_1, x_1)}` serait en mètres carrés.
tr_tr: Varyans ve kovaryans fikri, bir Kalman filtresinin işlevinin merkezinde yer alır. Kovaryans, iki rastgele değişkenin nasıl ilişkilendirildiğinin bir ölçüsüdür. Tek durumlu bir sistemde kovaryans matrisi basitçe :math:`\mathbf{\text{var}(x_1)}` veya varyansı içeren bir matristir :math:`\mathbf{\text{var}(x_1)}` durum :math:`x_1`. Bu varyansın büyüklüğü, mevcut durum tahminini açıklayan Gauss fonksiyonunun standart sapmasının karesidir. Kovaryans için nispeten büyük değerler gürültülü verileri gösterebilirken, küçük kovaryanslar filtrenin tahmini konusunda daha emin olduğunu gösterebilir. Varyans veya kovaryans için "büyük" ve "küçük" değerlerin kullanılan temel birime göre olduğunu unutmayın - örneğin, eğer :math:`\mathbf{x_1}` metre cinsinden ölçüldüyse, :math:`\mathbf{\text{cov}(x_1, x_1)}` metre kare cinsinden olacaktır.
zh_cn: 方差和协方差的概念是卡尔曼滤波器功能的核心。协方差是对两个随机变量相关程度的度量。在一个只有一个状态的系统中，协方差矩阵就是简单的:math:`\mathbf{\text{cov}(x_1, x_1)}`，或者是一个包含状态 :math:`x_1`的方差:math:`\mathbf{\text{var}(x_1)}` 的矩阵。该方差的大小是描述当前状态估计的高斯函数的标准差的平方。协方差相对较大的值可能表示有噪声的数据，而较小的协方差可能表示过滤器对它的估计更有信心。记住，方差或协方差的“大”值和“小”值与所使用的基本单位有关——例如，如果:math:`\mathbf{x_1}`是以米计量，:math:`\mathbf{\text{cov}(x_1, x_1)}` 将以米的平方计量。

source: Covariance matrices are written in the following form:
es_mx: Las matrices de covarianza se escriben de la siguiente forma:
fr_ca: Les matrices de covariance sont écrites sous la forme suivante:
tr_tr: Kovaryans matrisleri aşağıdaki biçimde yazılır:
zh_cn: 协方差矩阵可写成如下形式:

source: Kalman Filters
es_mx: Filtros de Kalman
fr_ca: Les filtres de Kalman
tr_tr: Kalman Filtreleri
zh_cn: 卡尔曼滤波器

source: It is important to develop an intuition for what a Kalman filter is actually doing. The book `Kalman and Bayesian Filters in Python by Roger Labbe <https://github.com/rlabbe/Kalman-and-Bayesian-Filters-in-Python>`__ provides a great visual and interactive introduction to Bayesian filters. The Kalman filters in WPILib use linear algebra to gentrify the math, but the ideas are similar to the single-dimensional case. We suggest reading through Chapter 4 to gain an intuition for what these filters are doing.
es_mx: Es importante desarrollar una intuición de lo que realmente hace un filtro de Kalman. El libro `Kalman and Bayesian Filters in Python de Roger Labbe <https://github.com/rlabbe/Kalman-and-Bayesian-Filters-in-Python>` __ proporciona una excelente introducción visual e interactiva a los filtros bayesianos. Los filtros de Kalman en WPILib usan álgebra lineal para gentrificar las matemáticas, pero las ideas son similares al caso unidimensional. Sugerimos leer el Capítulo 4 para hacerse una idea de lo que hacen estos filtros.
fr_ca: Il est important de développer une intuition de ce que fait réellement un filtre de Kalman. Le livre `Kalman and Bayesian Filters in Python par Roger Labbe <https://github.com/rlabbe/Kalman-and-Bayesian-Filters-in-Python>`__ fournit une excellente introduction visuelle et intéractive aux filtres bayésiens. Les filtres de Kalman de la WPILib utilisent l'algèbre linéaire pour rendre plus accessible les mathématiques, mais les idées sont similaires au cas unidimensionnel. Nous vous suggérons de lire le chapitre 4 pour avoir une idée de ce que font ces filtres.
tr_tr: Bir Kalman filtresinin gerçekte ne yaptığına dair bir sezgi geliştirmek önemlidir. `Kalman and Bayesian Filters in Python by Roger Labbe <https://github.com/rlabbe/Kalman-and-Bayesian-Filters-in-Python>`__ tarafından kitap Bayes filtrelerine harika bir görsel ve etkileşimli giriş sağlar. WPILib'deki Kalman filtreleri matematiği kolay hale getirmek için doğrusal cebir kullanır, ancak fikirler tek boyutlu duruma benzer. Bu filtrelerin ne yaptığına dair bir fikir edinmek için Bölüm 4'ü okumanızı öneririz.
zh_cn: 对卡尔曼滤波器的实际作用有一个直观的认识是很重要的。`Kalman and Bayesian Filters in Python by Roger Labbe <https://github.com/rlabbe/Kalman-and-Bayesian-Filters-in-Python>`一书提供了贝叶斯滤波器极佳的可视化和互动性介绍。WPILib中的卡尔曼滤波器使用线性代数来美化数学，但其思想与一维情况相似。我们建议通读第4章，直观了解这些过滤器在做什么

source: To summarize, Kalman filters (and all Bayesian filters) have two parts: prediction and correction. Prediction projects our state estimate forward in time according to our system's dynamics, and correct steers the estimated state towards the measured state. While filters often preform both in the same timestep, it's not strictly necessary -- For example, WPILib's pose estimators call predict frequently, and correct only when new measurement data is available (for example, from a low-framerate vision system).
es_mx: En resumen, los filtros de Kalman (y todos los filtros bayesianos) tienen dos partes: predicción y corrección. La predicción proyecta nuestra estimación de estado hacia adelante en el tiempo de acuerdo con la dinámica de nuestro sistema, y la corrección dirige el estado estimado hacia el estado medido. Si bien los filtros a menudo se preforman ambos en el mismo paso de tiempo, no es estrictamente necesario; por ejemplo, los estimadores de pose de WPILib llaman a predecir con frecuencia y corrigen solo cuando hay nuevos datos de medición disponibles (por ejemplo, de un sistema de visión de baja frecuencia de cuadros).
fr_ca: Pour résumer, les filtres de Kalman (et tous les filtres bayésiens) comportent deux parties: la prédiction et la correction. La prédiction projette notre estimation d'état vers l'avant dans le temps en fonction de la dynamique de notre système, et correcte oriente l'état estimé vers l'état mesuré. Bien que les filtres préforment souvent les deux dans le même pas de temps, ce n'est pas strictement nécessaire - Par exemple, les estimateurs de pose de WPILib appellent souvent prédire et ne corrigent que lorsque de nouvelles données de mesure sont disponibles (par exemple, à partir d'un système de vision à faible fréquence d'images).
tr_tr: Özetlemek gerekirse, Kalman filtreleri (ve tüm Bayes filtreleri) iki bölümden oluşur: tahmin ve düzeltme. Tahmin, sistemimizin dinamiklerine göre zaman içinde durumumuzun tahminini ileriye doğru yansıtır ve tahmini durumu ölçülen duruma doğru yönlendirir. Filtreler genellikle aynı zaman diliminde önceden oluşturulurken, bu kesinlikle gerekli değildir - Örneğin, WPILib'in poz tahmincileri sık sık tahmin çağırır ve yalnızca yeni ölçüm verileri mevcut olduğunda (örneğin, düşük frame oranlı bir görme sisteminden) düzelir.
zh_cn: 总的来说，卡尔曼滤波器(以及所有贝叶斯滤波器)包括两个部分:预测和修正。预测根据系统的动态特性将状态估计值及时前馈，并将估计值引导到被测状态。虽然过滤器通常在相同的时间步长中预形成，但它并不是严格必需的——例如，WPILib的姿态估计器频繁调用预测，并且只有在新的测量数据可用时(例如，来自低帧率视觉系统)才进行校正。

source: The following shows the equations of a discrete-time Kalman filter:
es_mx: A continuación se muestran las ecuaciones de un filtro de Kalman de tiempo discreto:
fr_ca: Ce qui suit montre les équations d'un filtre de Kalman à temps discret:
tr_tr: Aşağıda, ayrık zamanlı bir Kalman filtresinin denklemleri gösterilmektedir:
zh_cn: 下面给出了离散时间卡尔曼滤波器的方程:

source: The state estimate :math:`\mathbf{x}`, together with :math:`\mathbf{P}`, describe the mean and covariance of the Gaussian function that describes our filter's estimate of the system's true state.
es_mx: La estimación del estado :math:`\mathbf {x}`, junto con :math:`\mathbf{P}`, describe la media y la covarianza de la función gaussiana que describe la estimación de nuestro filtro del estado verdadero del sistema.
fr_ca: L'estimation d'état :math:`\mathbf{x}`, avec :math:`\mathbf{P}`, décrivent la moyenne et la covariance de la fonction gaussienne qui décrit l'estimation par notre filtre de l'état réel du système.
tr_tr: Durum tahmini :math:`\mathbf{x}`, ile birlikte :math:`\mathbf{P}`, filtremizin sistemin gerçek durumuna ilişkin tahminini tanımlayan Gauss işlevinin ortalamasını ve kovaryansını açıklar.
zh_cn: 状态估计 :math:`\mathbf{x}`和 :math:`\mathbf{P}`'描述高斯函数的均值和协方差，高斯函数描述了我们的滤波器对系统真实状态的估计。

source: Process and Measurement Noise Covariance Matrices
es_mx: Matrices de covarianza de proceso y medición de ruido
fr_ca: Les matrices de covariance du bruit de processus et de mesure
tr_tr: Gürültü Kovaryans Matrislerinin İşlenmesi ve Ölçümü
zh_cn: 处理和测量噪声协方差矩阵

source: The process and measurement noise covariance matrices :math:`\mathbf{Q}` and :math:`\mathbf{R}` describe the variance of each of our states and measurements. Remember that for a Gaussian function, variance is the square of the function's standard deviation. In a WPILib, Q and R are diagonal matrices whose diagonals contain their respective variances. For example, a Kalman filter with states :math:`\begin{bmatrix}\text{position} \\ \text{velocity} \end{bmatrix}` and measurements :math:`\begin{bmatrix}\text{position} \end{bmatrix}` with state standard deviations :math:`\begin{bmatrix}0.1 \\ 1.0\end{bmatrix}` and measurement standard deviation :math:`\begin{bmatrix}0.01\end{bmatrix}` would have the following :math:`\mathbf{Q}` and :math:`\mathbf{R}` matrices:
es_mx: Las matrices de covarianza de ruido de proceso y medición :math:`\mathbf{Q}` y :math:`\mathbf{R}` describen la varianza de cada uno de nuestros estados y medidas. Recuerde que para una función gaussiana, la varianza es el cuadrado de la desviación estándar de la función. En un WPILib, Q y R son matrices diagonales cuyas diagonales contienen sus respectivas varianzas. Por ejemplo, un filtro de Kalman con estados: matemáticas `\begin{bmatrix}\text{position} \\ \text{velocity} \end{bmatrix}` y medidas :math:`\begin{bmatrix}\text{position} \end{bmatrix}` con desviaciones de estado estándar :math:`\begin{bmatrix}0.1 \\ 1.0\end{bmatrix}` y desviación estándar de medición :math:`\begin{bmatrix}0.01\end{bmatrix}` tendría las siguientes :math:`\mathbf{Q}` y :math:`\mathbf{R}` matrices:
fr_ca: Les matrices de covariance du bruit de processus et de mesure :math:`\mathbf{Q}` et :math:`\mathbf{R}` décrivent la variance de chacun de nos états et mesures. N'oubliez pas que pour une fonction gaussienne, la variance est le carré de l'écart type de la fonction. Dans un WPILib, Q et R sont des matrices diagonales dont les diagonales contiennent leurs variances respectives. Par exemple, un filtre de Kalman avec les états :math:`\begin{bmatrix}\text{position} \\ \text{velocity} \end{bmatrix}` et les mesures :math:`\begin{bmatrix}\text{position} \end{bmatrix}` avec les écarts-types d'état :math:`\begin{bmatrix}0.1 \\ 1.0\end{bmatrix}`et l'écart-type de mesure :math:`\begin{bmatrix}0.01\end{bmatrix}` aurait les matrices suivantes :math:`\mathbf{Q}` et :math:`\mathbf{R}` :
tr_tr: Süreç ve ölçüm gürültüsü kovaryans matrisleri :math:`\mathbf{Q}` ve:math:`\mathbf{R}` durumlarımızın ve ölçümlerimizin her birinin varyansını tanımlar. Bir Gauss fonksiyonu için varyansın, fonksiyonun standart sapmasının karesi olduğunu unutmayın. Bir WPILib'de Q ve R, köşegenleri ilgili varyanslarını içeren köşegen matrisleridir. Örneğin, :math:`\begin{bmatrix}\text{position} \\ \text{velocity} \end{bmatrix}` ve ölçümler :math:`\begin{bmatrix}\text{position} \end{bmatrix}` durum standart sapmalarıyla:math:`\begin{bmatrix}0.1 \\ 1.0\end{bmatrix}` ve ölçüm standart sapması :math:`\begin{bmatrix}0.01\end{bmatrix}` şunlara sahip olacaktır :math:`\mathbf{Q}` and :math:`\mathbf{R}` matrisler:
zh_cn: 过程和测量噪声协方差矩阵:math:`\mathbf{Q}` 和 :math:`\mathbf{R}` 描述了我们的每个状态和测量的方差。记住，对于高斯函数，方差是函数标准差的平方。在WPILib中，Q和R是对角矩阵，它们的对角线包含各自的方差。例如,卡尔曼滤波状态 :math:`\begin{bmatrix}\text{position} \\ \text{velocity} \end{bmatrix}` 和具有状态标准差 :math:`\begin{bmatrix}0.1 \\ 1.0\end{bmatrix}` 和测量标准差 :math:`\begin{bmatrix}0.01\end{bmatrix}` 的测量 :math:`\begin{bmatrix}\text{position} \end{bmatrix}` 将具有下面的:math:`\mathbf{Q}` 和 :math:`\mathbf{R}` 矩阵:

source: Error Covariance Matrix
es_mx: Matriz de covarianza de errores
fr_ca: Matrice de covariance d'erreur
tr_tr: Error Covariance Matrix-Hata Kovaryans Matrisi
zh_cn: 误差协方差矩阵

source: The error covariance matrix :math:`\mathbf{P}` describes the covariance of the state estimate :math:`\mathbf{\hat{x}}`. Informally, :math:`\mathbf{P}` describes our certainty about the estimated :term:`state`. If :math:`\mathbf{P}` is large, our uncertainty about the true state is large. Conversely, a :math:`\mathbf{P}` with smaller elements would imply less uncertainty about our true state.
es_mx: La matriz de covarianza de error :math:`\mathbf{P}` describe la covarianza de la estimación del estado :math:`\mathbf{\hat{x}}`. De manera informal, :math:`\mathbf{P}` describe nuestra certeza sobre el :term:`estado` estimado. Si :math:`\mathbf{P}` es grande, nuestra incertidumbre sobre el estado real es grande. A la inversa, a :math:`\mathbf{P}` con elementos más pequeños implicaría menos incertidumbre sobre nuestro verdadero estado.
fr_ca: La matrice de covariance d'erreur :math:`\mathbf{P}` décrit la covariance de l'estimation d'état :math:`\mathbf{\hat{x}}`. De manière informelle, :math:`\mathbf{P}` décrit notre certitude quant à :term:`l’état` estimé. Si :math:`\mathbf{P}` est grand, notre incertitude sur l'état vrai est grande. Inversement, un :math:`\mathbf{P}` avec des éléments plus petits impliquerait moins d'incertitude sur notre véritable état.
tr_tr: Hata kovaryans matrisi :math:`\mathbf{P}`, durum tahmininin kovaryansını açıklar :math:`\mathbf{\hat{x}}`. Gayri resmi olarak, :math:`\mathbf{P}`, tahmin edilen :term:`state` hakkındaki kesinliğimizi tanımlar. Eğer :math:`\mathbf{P}` büyükse, gerçek durum hakkındaki belirsizliğimiz büyüktür. Tersine, daha küçük elemanlara sahip :math:`\mathbf{P}`, gerçek durumumuz hakkında daha az belirsizlik anlamına gelir.
zh_cn: 误差协方差矩阵 :math:`\mathbf{P}`描述了状态估计的协方差:math:`\mathbf{\hat{x}}`。非正式地，:math:`\mathbf{P}` 描述了我们对估计 :term:`state`的确定性。如果 :math:`\mathbf{P}`很大，真实状态的不确定性就很大。相反，元素更小的:math:`\mathbf{P}`意味着我们真实状态的不确定性更小。
