Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-intro.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: The following two sets of equations are the standard form of continuous-time and discrete-time state-space notation:
es_mx: Los siguientes dos conjuntos de ecuaciones son la forma estándar de la notación estado-espacio del tiempo continuo y tiempo discreto:
fr_ca: Les deux ensembles d’équations suivantes constituent la forme standard de notation espace-état en temps continu et en temps discret :
tr_tr: Aşağıdaki iki denklem seti, sürekli zaman ve ayrık zaman durum uzayı gösteriminin standart biçimidir:
zh_cn: 以下两组方程式是连续时间和离散时间状态空间符号的标准形式：

source: A continuous-time state-space system can be converted into a discrete-time system through a process called discretization.
es_mx: Un sistema de estado-espacio con tiempo continuo puede ser convertido en un sistema de tiempo discreto mediante un proceso llamado discretización.
fr_ca: Un système d'espace d'état à temps continu peut être converti en un système à temps discret grâce à un processus appelé discrétisation.
tr_tr: Sürekli zaman durum uzay sistemi, ayrıklaştırma adı verilen bir süreçle ayrık zamanlı bir sisteme dönüştürülebilir.
zh_cn: 连续时间状态空间系统可以通过称为离散化的过程转换为离散时间系统。

source: In the discrete-time form, the system's state is held constant between updates. This means that we can only react to disturbances as quickly as our state estimate is updated. Updating our estimate more quickly can help improve performance, up to a point. WPILib's ``Notifier`` class can be used if updates faster than the main robot loop are desired.
es_mx: En la forma de tiempo discreto, el estado del sistema es mantenido constantemente mediante actualizaciones. Esto significa que solo podemos reaccionar a los disturbios tan rápido como nuestra estimación de estado sea actualizada. Actualizando nuestra estimación más rápido puede ayudar a mejorar la actuación, hasta un punto. La clase ``Notifier`` de WPILib se puede utilizar si se desean actualizaciones más rápidas que el bucle principal del robot.
fr_ca: Dans la forme à temps discret, l'état du système est maintenu constant entre les mises à jour. Cela signifie que nous ne pouvons réagir aux perturbations aussi rapidement que notre estimation d'état est mise à jour. Mettre à jour notre estimation plus rapidement peut aider à améliorer les performances, jusqu'à un certain point. La classe ``Notifier`` de WPILib peut être utilisée si des mises à jour plus rapides que la boucle principale du robot sont souhaitées.
tr_tr: Ayrık zamanlı formda, sistemin durumu güncellemeler arasında sabit tutulur. Bu, rahatsızlıklara yalnızca durum tahminimiz güncellendiğinde tepki verebileceğimiz anlamına gelir. Tahminimizi daha hızlı güncellemek, performansın bir noktaya kadar iyileştirilmesine yardımcı olabilir. WPILib'in ``Notifier`` sınıfı, ana robot döngüsünden daha hızlı güncellemeler isteniyorsa kullanılabilir.
zh_cn: 在离散时间形式中，系统状态在两次更新之间保持不变。这意味着我们只能在状态估计值更新后尽快对干扰做出反应。更快地更新我们的估计值可以在一定程度上帮助改善性能。如果需要比机械手主循环更快的更新速度，则可以使用WPILib的“ Notifier”类。

source: While a system's continuous-time and discrete-time matrices A, B, C, and D have the same names, they are not equivalent. The continuous-time matrices describes the rate of change of the state, :math:`\mathbf{x}`, while the discrete-time matrices describe the system's state at the next timestep as a function of the current state and input.
es_mx: Mientras que las matrices A, B, C y D de tiempo continuo y discreto de un sistema tengan los mismos nombres, no son equivalentes. Las matrices de tiempo continuo describen la tasa de cambio del estado, :math:`\mathbf{x}`, mientras que las matrices de tiempo discreto describen el estado del sistema en el siguiente paso de tiempo como una función del estado actual y la entrada.
fr_ca: Bien que les matrices en temps continu et en temps discret A, B, C et D d'un système portent les mêmes noms, elles ne sont pas équivalentes. Les matrices à temps continu décrivent le taux de changement de l'état, :math:`\mathbf{x}`, tandis que les matrices à temps discret décrivent l'état du système au prochain intervalle de temps en fonction de l'état actuel et de l'entrée.
tr_tr: Bir sistemin sürekli zaman ve ayrık zaman matrisleri A, B, C ve D aynı adlara sahipken, bunlar eşdeğer değildir. Sürekli zaman matrisleri, durum değişim oranını açıklarken:math:`\mathbf{x}` , ayrık zaman matrisleri ise sistemin durumunu bir sonraki zaman adımında mevcut durum ve girdinin bir fonksiyonu olarak tanımlar.
zh_cn: 虽然系统的连续时间矩阵和离散时间矩阵A，B，C和D具有相同的名称，但它们并不等效。连续时间矩阵描述状态的变化率:math:`\mathbf{x}`，而离散时间矩阵描述系统在下一时间步的状态是当前状态和输入的函数。

source: WPILib's LinearSystem takes continuous-time system matrices, and converts them internally to the discrete-time form where necessary.
es_mx: El Sistema lineal de WPILib toma las matrices del sistema de tiempo continuo, y las convierte internamente al tiempo discreto donde sea necesario.
fr_ca: LinearSystem de WPILib prend des matrices système en temps continu et les convertit en interne en forme de temps discret si nécessaire.
tr_tr: WPILib'in LinearSystem'i, sürekli zaman sistem matrislerini alır ve bunları gerektiğinde dahili olarak ayrık zaman biçimine dönüştürür.
zh_cn: WPILib的LinearSystem采用连续时间系统矩阵，并在必要时将其内部转换为离散时间形式。

source: State-space Notation Example: Flywheel from kV and kA
es_mx: Ejemplo de notación de estado-espacio: Volante desde kV y kA
fr_ca: Exemple de notation d'espace d'état: volant d'inertie à partir de kV et kA
tr_tr: Durum Uzayı Gösterimi Örneği: kV ve kA'dan volan
zh_cn: 状态空间符号示例：飞轮从kV和kA

source: :ref:`Recall <docs/software/advanced-controls/controllers/feedforward:SimpleMotorFeedforward>` that we can model the motion of a flywheel connected to a brushed DC motor with the equation :math:`V = kV \cdot v + kA \cdot a`, where V is voltage output, v is the flywheel's angular velocity and a is its angular acceleration. This equation can be rewritten as :math:`a = \frac{V - kV \cdot v}{kA}`, or :math:`a = \frac{-kV}{kA} \cdot v + \frac{1}{kA} \cdot V`. Notice anything familiar? This equation relates the angular acceleration of the flywheel to its angular velocity and the voltage applied.
es_mx: :ref:`Recuerde <docs/software/advanced-controls/controllers/feedforward:SimpleMotorFeedforward>` que podemos modelar el movimiento de un volante conectado a un motor de corriente continua con la ecuación :math:`V = kV \cdot v + kA \cdot a`, donde V es la salida del voltaje, v es la velocidad angular del volate y a es la aceleración angular. Esta ecuación puede reescribirse como:math:`a = \frac{V - kV \cdot v}{kA}`, o :math:`a = \frac{-kV}{kA} \cdot v + \frac{1}{kA} \cdot V`. ¿Ve algo familiar? Esta ecuación relata la aceleración angular del volante a su velocidad angular y el voltaje aplicado.
fr_ca: :ref:`Rappelez vous que <docs/software/advanced-controls/controllers/feedforward:SimpleMotorFeedforward>` nous pouvons modéliser le mouvement d'un volant d'inertie connecté à un moteur à courant continu à balais avec l'équation :math:`V = kV \cdot v + kA \cdot a`, où V est la tension de sortie, v est la vitesse angulaire du volant et a est son accélération angulaire. Cette équation peut être réécrite comme suit :math:`a = \frac{V - kV \cdot v}{kA}`, ou :math:`a = \frac{-kV}{kA} \cdot v + \frac{1}{kA} \cdot V`. Avez-vous remarqué quelque chose de familier? Cette équation relie l'accélération angulaire du volant d'inertie à sa vitesse angulaire et à la tension appliquée.
tr_tr: :ref:`Recall <docs/software/advanced-controls/controllers/feedforward:SimpleMotorFeedforward>` 'ı, fırçalanmış bir DC motora bağlı bir volanın hareketini şu denklemle modelleyebileceğimizi hatırlayın:math:`V = kV \cdot v + kA \cdot a``, burada V, voltaj çıkışıdır, v çarkın açısal hızı ve a açısal ivmesidir. Bu denklem şu şekilde yeniden yazılabilir :math:`a = \frac{V - kV \cdot v}{kA}` veya :math:`a = \frac{-kV}{kA} \cdot v + \frac{1}{kA} \cdot V`. Tanıdık bir şey fark ettiniz mi? Bu denklem, volanın açısal ivmesini, açısal hızı ve uygulanan voltaj ile ilişkilendirir.
zh_cn: :ref:`Recall <docs/software/advanced-controls/controllers/feedforward:SimpleMotorFeedforward>`，我们可以用这个方程来模拟与有刷直流电动机相连的飞轮的运动 :math:`V = kV \cdot v + kA \cdot a`, 其中V是电压输出，v是飞轮的角速度，a是其角加速度。该等式可以重写为 :math:`a = \frac{V - kV \cdot v}{kA}`, 或者:math:`a = \frac{-kV}{kA} \cdot v + \frac{1}{kA} \cdot V`。发现它是不是很熟悉?这个方程将飞轮的角加速度与飞轮的角速度和施加的电压联系起来。

source: We can convert this equation to state-space notation. We can create a system with one state (velocity), one :term:`input` (voltage), and one :term:`output` (velocity). Recalling that the first derivative of velocity is acceleration, we can write our equation as follows, replacing velocity with :math:`\mathbf{x}`, acceleration with :math:`\mathbf{\dot{x}}`, and voltage :math:`\mathbf{V}` with :math:`\mathbf{u}`:
es_mx: Podemos convertir esta ecuación a notación estado-espacio. Podemos crear un sistema con un estado (velocidad), una :term:`entrada` (voltaje), y una :term:`salida` (velocidad). Recuerde que la primera derivada de la velocidad es la aceleración, podemos escribir nuestra ecuación como sigue, reemplazando velocidad con :math:`\mathbf{x}`, aceleración con :math:`\mathbf{\dot{x}}`, y voltaje :math:`\mathbf{V}` con :math:`\mathbf{u}`:
fr_ca: Nous pouvons convertir cette équation en notation d'espace d'états. Nous pouvons créer un système avec un état (vitesse), une :term:`entrée` (tension), et une :term:`sortie` (vitesse). En rappelant que la première dérivée de la vitesse est l'accélération, nous pouvons écrire notre équation comme suit, en remplaçant la vitesse par :math:`\mathbf{x}`, l'accélération par :math:`\mathbf{\dot{x}}`, et la tension :math:`\mathbf{V}` par :math:`\mathbf{u}`:
tr_tr: Bu denklemi durum uzayı gösterimine dönüştürebiliriz. Bir durum (hız), bir :term:`input` (voltage) ve bir :term:`output` (velocity) olan bir sistem oluşturabiliriz. Hızın ilk türevinin ivme olduğunu hatırlayarak, denklemimizi aşağıdaki gibi yazabiliriz, hızı şu ile değiştirebiliriz: :math:`\mathbf{x}`, acceleration with :math:`\mathbf{\dot{x}}` ve voltaj:math:`\mathbf{V}` ile : math:`\mathbf {u}`:
zh_cn: 我们可以将该方程转换为状态空间符号。我们可以创建一个具有一个状态（速度），一个 :term:`input` （电压）和 :term:`output`（速度）的系统。回想一下速度的一阶导数是加速度，我们可以编写如下公式，用 :math:`\mathbf{x}`代替速度，用 :math:`\mathbf{\dot{x}}`代替加速度，并且用 :math:`\mathbf{u}`代替电压:math:`\mathbf{V}` :

source: That's it! That's the state-space model of a system for which we have the kV and kA constants. This same math is use in system identification to model flywheels and drivetrain velocity systems.
fr_ca: C'est ça! C'est le modèle d'espace d'état d'un système pour lequel nous avons les constantes kV et kA. Ce même calcul est utilisé dans l'identification du système pour modéliser les volants d'inertie et les systèmes de vitesse de transmission.

source: Visualizing State-Space Responses: Phase Portrait
es_mx: Visualizando las Respuestas del Estado-Espacio: Retrato de Fase
fr_ca: Visualisation des réponses de l'espace d'état: portrait de phase
tr_tr: Durum Uzayı Yanıtlarını Görselleştirme: Faz Portresi
zh_cn: 可视化状态空间响应:相位图

source: A `phase portrait <https://en.wikipedia.org/wiki/Phase_portrait>`__ can help give a visual intuition for the response of a system in state-space. The vectors on the graph have their roots at some point :math:`\mathbf{x}` in state-space, and point in the direction of :math:`\mathbf{\dot{x}}`, the direction that the system will evolve over time. This example shows a model of a pendulum with the states of angle and angular velocity.
es_mx: Un `retrato de fase <https://en.wikipedia.org/wiki/Phase_portrait>`__ puede ayudar a dar intuición visual para la respuesta de un sistema en estado-espacio. Estos vectores en el gráfico tienen sus raíces en algún punto :math:`\mathbf{x}` en el estado-espacio, y apunta en la dirección de :math:`\mathbf{\dot{x}}`, la dirección que el sistema evolucionará pasando el tiempo. Este ejemplo muestra un modelo de un péndulo con los estados del ángulo y velocidad angular.
fr_ca: Un `portrait de phase <https://en.wikipedia.org/wiki/Phase_portrait>`__ peut aider à donner une intuition visuelle pour la réponse d'un système dans l'espace d'états. Les vecteurs sur le graphe ont leurs racines à un moment donné :math:`\mathbf{x}` dans l'espace d'états, et pointent dans la direction de :math:`\mathbf{\dot{x}}`, la direction qui le système évoluera avec le temps. Cet exemple montre un modèle de pendule avec les états d'angle et de vitesse angulaire.
tr_tr: Bir`phase portrait <https://en.wikipedia.org/wiki/Phase_portrait>`__ , durum uzayındaki bir sistemin tepkisi için görsel bir sezgi sağlamaya yardımcı olabilir. Grafikteki vektörlerin kökleri bir noktada vardır: durum uzayında :math:`\mathbf{x}` ve :math:`\mathbf{\dot{x}}`,yönünü, yani sistem zamanla gelişecektir. Bu örnek, açı ve açısal hız durumlarıyla bir sarkaç modelini göstermektedir.
zh_cn: 一个 `phase portrait <https://en.wikipedia.org/wiki/Phase_portrait>`可以帮助直观地了解状态空间中系统的响应。图上的向量的根源在状态空间的某个位置 :math:`\mathbf{x}` ，并指向：:math:`\mathbf{\dot{x}}`的方向，即该系统将随着时间的推移而发展。此示例显示了具有角和角速度状态的摆的模型。

source: To trace a potential trajectory that a system could take through state-space, choose a point to start at and follow the arrows around. In this example, we might start at :math:`[-2, 0]`. From there, the velocity increases as we swing through vertical and starts to decrease until we reach the opposite extreme of the swing. This cycle of spinning about the origin repeats indefinitely.
es_mx: Para trazar una trayectoria potencial que un sistema puede tomar por el estado-espacio, escoja un punto para empezar y siga las flechas alrededor. En éste ejemplo, empezaremos en :math:`[-2, 0]`. Desde aquí, la velocidad aumenta como se balancea verticalmente y empieza a reducir hasta que alcanza el extremo opuesto del columpio. Este ciclo de giro sobre el origen se repite indefinidamente.
fr_ca: Pour tracer une trajectoire potentielle qu'un système pourrait emprunter à travers l'espace d'états, choisissez un point de départ et suivez les flèches. Dans cet exemple, nous pourrions commencer par :math:`[-2, 0]`. À partir de là, la vitesse augmente à mesure que nous nous balançons verticalement et commence à diminuer jusqu'à ce que nous atteignions l'extrême opposé du balancement. Ce cycle de rotation autour de l'origine se répète indéfiniment.
tr_tr: Bir sistemin durum uzayında alabileceği potansiyel bir yörüngeyi izlemek için, başlamak üzere bir nokta seçin ve etrafındaki okları takip edin. Bu örnekte, :math:`[-2, 0]` ile başlayabiliriz. Oradan, biz dikeyde döndükçe hız artar ve salınımın zıt ucuna ulaşana kadar azalmaya başlar. Kökenle ilgili bu dönme döngüsü sonsuza kadar tekrar eder.
zh_cn: 要追踪系统可能会穿越状态空间的潜在轨迹，请选择一个起点并遵循周围的箭头。在此示例中，我们可能从:math:`[-2, 0]`开始。从那里开始，速度随着我们垂直摆动而增加，并开始降低，直到达到相反的极端。围绕原点旋转的循环无限期地重复。

source: Pendulum Phase Plot with arrows all around going roughly in a circle.
fr_ca: Diagramme de phase pendulaire avec des flèches tout autour allant à peu près dans un cercle.

source: Note that near the edges of the phase portrait, the X axis wraps around as a rotation of :math:`\pi` radians counter clockwise and a rotation of :math:`\pi` radians clockwise will end at the same point.
es_mx: Note que cerca de los bordes del retrato de fase, el eje X se envuelve como una rotación de :math:`\pi` radianes en sentido de las manecillas del reloj y una rotación de :math:`\pi` radianes en sentido de las manecillas del reloj terminará con el mismo punto.
fr_ca: Notez que près des bords du portrait de phase, l'axe X s'enroule comme une rotation de :math:`\pi` radians dans le sens antihoraire et une rotation de :math:`\pi` radians dans le sens horaire se terminera au même point.
tr_tr: Faz portresinin kenarlarının yakınında, X ekseninin saat yönünün tersine: math: `\pi` radyan dönüşü olarak sarıldığına ve :math:`\pi` radyanının saat yönünde bir dönüşünün aynı noktada sona ereceğine dikkat edin.
zh_cn: 注意，在相像的边缘附近，X轴绕着:math:`\pi` 弧度逆时针旋转，并且:math:`\pi` 弧度顺时针旋转将在同一点结束。

source: For more on differential equations and phase portraits, see `3Blue1Brown's Differential Equations video <https://www.youtube.com/watch?v=p_di4Zn4wz4>`__ -- they do a great job of animating the pendulum phase space at around 15:30.
es_mx: Para más en ecuaciones diferenciales y retratos de fase, vea `el video de 3Blue1Brown Ecuaciones Diferenciales <https://www.youtube.com/watch?v=p_di4Zn4wz4>`__ -- hacen un gran trabajo de animación de la fase del péndulo alrededor del 15:30.
fr_ca: Pour en savoir plus sur les équations différentielles et les portraits de phase, voir `la vidéo sur les équations différentielles de 3Blue1Brown <https://www.youtube.com/watch?v=p_di4Zn4wz4>`__ -- ils font un excellent travail d'animation de l'espace de phase du pendule vers 15:30 minutes après le début du vidéo.
tr_tr: Diferansiyel denklemler ve faz portreleri hakkında daha fazla bilgi için, bkz.`3Blue1Brown Diferansiyel Denklemler videosu <https://www.youtube.com/watch?v=p_di4Zn4wz4>`__ - saat 15: 30'da sarkaç faz uzayını canlandırmak için harika bir iş çıkarırlar.
zh_cn: 有关微分方程和相画像的更多信息，请参见`3Blue1Brown's Differential Equations video <https://www.youtube.com/watch?v=p_di4Zn4wz4>`，它们在15:30左右为摆相空间设置动画效果非常出色。

source: Visualizing Feedforward
es_mx: Visualizando Feedfoward
fr_ca: Visualiser le Feedforward
tr_tr: Feedforward'ı Görselleştirme
zh_cn: 可视化前馈

source: This phase portrait shows the "open loop" responses of the system -- that is, how it will react if we were to let the state evolve naturally. If we want to, say, balance the pendulum horizontal (at :math:`(\frac{\pi}{2}, 0)` in state space), we would need to somehow apply a control :term:`input` to counteract the open loop tendency of the pendulum to swing downward. This is what feedforward is trying to do -- make it so that our phase portrait will have an equilibrium at the :term:`reference` position (or setpoint) in state-space.
es_mx: Este retrato de fase muestra las respuestas de "bucle abierto" del sistema, es decir, cómo reaccionará si dejamos que el estado evolucione naturalmente. Si queremos, digamos, equilibrar el péndulo horizontal (en :math:`(\frac{\pi}{2}, 0)` en el espacio de estados), necesitaríamos aplicar de alguna manera un control :term:`input` para contrarrestar la tendencia de bucle abierto del péndulo a oscilar hacia abajo. Esto es lo que el feedforward está tratando de hacer: hacerlo de manera que nuestro retrato de fase tenga un equilibrio en la posición de :term:`reference` (o punto de ajuste) en el espacio de estado.
fr_ca: Ce portrait de phase montre les réponses "en boucle ouverte" du système - c'est-à-dire comment il réagira si nous laissons l'état évoluer naturellement. Si nous voulons, par exemple, équilibrer le pendule horizontal (à :math:`(\frac{\pi}{2}, 0)` dans l'espace d'états), nous aurions besoin d'appliquer une commande :term:`d’entrée` pour contrer la tendance en boucle ouverte du pendule à basculer vers le bas. C'est ce que la commande prédictive essaie de faire - faire en sorte que notre portrait de phase ait un équilibre à la position de :term:`référence` (ou point de consigne) dans l'espace d'états.
tr_tr: Bu aşama portresi, sistemin"open loop" tepkilerini, yani devletin doğal olarak gelişmesine izin verirsek nasıl tepki vereceğini gösterir. Sarkacı yatay olarak dengelemek istiyorsak (at :math:`(\frac{\pi}{2}, 0)` in state space), bir şekilde bir kontrol uygulamamız gerekir: term: `input` Sarkacın açık döngü eğiliminin aşağı doğru sallanma eğilimine karşı koymak için. Feedforward'ın yapmaya çalıştığı budur - bunu, faz portremizin durum uzayındaT :term:`reference` AMkonumunda (veya ayar noktasında) bir dengeye sahip olmasını sağlayın.
zh_cn: 这个阶段描述显示了系统的“开环”响应——也就是说，如果我们让状态自然发展，它将如何反应。例如，如果要平衡水平摆（在状态空间中的:math:`(\frac{\pi}{2}, 0)`处），我们将需要以某种方式应用控制:term:`input` 以抵消摆向下摆动的开环趋势。这就是前馈正在尝试做的——以使我们的相位图在状态空间中的 :term:`reference` 位置（或设定点）处具有平衡。

source: Looking at our phase portrait from before, we can see that at :math:`(\frac{\pi}{2}, 0)` in state space, gravity is pulling the pendulum down with some torque T, and producing some downward angular acceleration with magnitude :math:`\frac{\tau}{I}`, where I is angular :term:`moment of inertia` of the pendulum. If we want to create an equilibrium at our :term:`reference` of :math:`(\frac{\pi}{2}, 0)`, we would need to apply an :term:`input` can counteract the system's natural tendency to swing downward. The goal here is to solve the equation :math:`\mathbf{0 = Ax + Bu}` for :math:`\mathbf{u}`. Below is shown a phase portrait where we apply a constant :term:`input` that opposes the force of gravity at :math:`(\frac{\pi}{2}, 0)`:
es_mx: Observando nuestro retrato de fase de antes, podemos ver que en :math:`(\frac{\pi}{2}, 0)` en el estado espacio, la gravedad está empujando el péndulo abajo con torque T, y produciendo aceleración angular hacia abajo con magnitud :math:`\frac{\tau}{I}`, donde I es el :term:`momento de inercia` angular del péndulo. Si queremos crear un equilibrio en nuestra :term:`referencia` de :math:`(\frac{\pi}{2}, 0)`, necesitaremos aplicar una :term:`salida` que pueda contrarrestar la tendencia natural el sistema a balancear hacia abajo. La meta aquí es resolver la ecuación :math:`\mathbf{0 = Ax + Bu}` para :math:`\mathbf{u}`. Abajo se muestra un retrato de fase donde aplicamos una constante :term:`salida` que se opone a la fuerza de gravedad en :math:`(\frac{\pi}{2}, 0)`:
fr_ca: En examinant notre portrait de phase d'avant, nous pouvons voir qu'à :math:`(\frac{\pi}{2}, 0)` dans l'espace d'états, la gravité tire le pendule vers le bas avec un certain couple T, et produit vers le bas une accélération angulaire d'amplitude :math:`\frac{\tau}{I}`, où I est le :term:`moment d'inertie` angulaire du pendule. Si nous voulons créer un équilibre à notre :term:`référence` de :math:`(\frac{\pi}{2}, 0)`, nous aurons besoin d'appliquer une :term:`entrée` pour compenser la tendance naturelle du système à basculer vers le bas. Le but ici est de résoudre l'équation :math:`\mathbf{0 = Ax + Bu}` pour :math:`\mathbf{u}`. Ci-dessous est montré un portrait de phase où nous appliquons une :term:`entrée` constante qui s'oppose à la force de gravité à :math:`(\frac{\pi}{2}, 0)`:
tr_tr: Faz portremize daha önce baktığımızda şunu görebiliriz :math:`(\frac{\pi}{2}, 0)` durum uzayında, yerçekimi bir miktar T torku ile sarkacı aşağı çekiyor ve biraz aşağı doğru üretiyor sarkacın büyüklük : math:`\frac{\tau}{I}` ile açısal ivmesi, burada açısal: terim: `eylemsizlik momenti`. Matematik :`(\frac{\ pi} {2}, 0)`: terim: `referansımız 'da bir denge oluşturmak istiyorsak, bir: terim uygulamamız gerekir :`input`, sistemin doğal olarak aşağı doğru sallanma eğilimi. Buradaki amaç math:`\mathbf{0 = Ax+Bu}` denklemini :math:`\mathbf{u}` için çözmektir. Aşağıda, sabit :term:`input` uyguladığımız bir faz portresi gösterilmektedir :math:`(\frac{\pi}{2}, 0)`:
zh_cn: 从之前的相位图中可以看到，在状态空间中的 :math:`(\frac{\pi}{2}, 0)` 处，重力以一定的扭矩T将摆锤向下拉，并向下方产生一些摆锤。角加速度，大小为 :math:`\frac{\tau}{I}`，其中，I为角速度:term:`moment of inertia`。如果我们想在:math:`(\frac{\pi}{2}, 0)`的:term:`reference`处创建一个平衡，则需要应用 :term:`input`来抵消系统自然会向下摆动。这里的目标是解决:math:`\mathbf{u}`的等式 :math:`\mathbf{0 = Ax + Bu}` 。下面显示了一个相位图，其中我们应用了常量 :term:`input`，它在:math:`(\frac{\pi}{2}, 0)`处与重力相反：

source: Pendulum phase plot with equilibrium at (pi/2, 0).
fr_ca: Diagramme de phase pendulaire avec équilibre à (pi/2, 0).

source: Feedback Control
es_mx: Control de Retroalimentación
fr_ca: Commande de rétroaction
tr_tr: Geri bildirim kontrolü
zh_cn: 反馈控制
