Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-intro.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: If you've used WPILib's feedforward classes for ``SimpleMotorFeedforward`` or its sister classes, or used FRC-Characterization to pick PID :term:`gains <gain>` for you, you're already familiar with model-based control! The ``kv`` and ``ka`` :term:`gains <gain>` can be used to describe how a motor (or arm, or drivetrain) will react to voltage. We can put these constants into standard state-space notation using WPILib's ``LinearSystem``, something we will do in a later article.
tr_tr: WPILib'in ``SimpleMotorFeedforward`` veya onun kardeş sınıfları için ileri besleme sınıflarını kullandıysanız veya PID'yi seçmek için FRC Karakterizasyonu kullandıysanız: terim: sizin için <gain> kazanır ', model tabanlı kontrole zaten aşinasınız! ``kv``ve ``ka`` :term:` `kazançlar <gain> ', bir motorun (veya kolun veya aktarma organlarının) voltaja nasıl tepki vereceğini açıklamak için kullanılabilir. Bu sabitleri, WPILib'in ``LinearSystem`` ini kullanarak standart durum-uzay gösterimine koyabiliriz, bunu daha sonraki bir makalede yapacağız.
zh_cn: 如果您为SimpleMotorFeedforward或它的姐妹类使用过WPILib的前馈类，或者使用frc特性为您选择PID:term:`gains 1` ，那么您已经熟悉基于模型的控制了。 kv和ka :term:`gains 2`可用于描述电机(或手臂，或传动系统)对电压的反应。我们可以使用WPILib的线性系统将这些常数放入标准状态空间符号中，我们将在后面的文章中做一些事情。

source: That's it! That's the state-space model of a system for which we have the kV and kA constants. This same math is use in FRC-Characterization to model flywheels and drivetrain velocity systems.
tr_tr: Bu kadar! Bu, kV ve kA sabitlerine sahip olduğumuz bir sistemin durum uzayı modelidir. Aynı matematik, FRC Karakterizasyonunda volanları ve aktarma organı hız sistemlerini modellemek için kullanılır.
zh_cn: 就是这样！那就是我们具有kV和kA常数的系统的状态空间模型。在FRC特征化中使用相同的数学模型对飞轮和传动系统速度系统进行建模。

source: Increasing the :math:`\mathbf{q}` elements would make the LQR less heavily weight large errors, and the resulting :term:`control law` will behave more conservatively. This has a similar effect to penalizing :term:`control effort` more heavily by decreasing :math:`\mathbf{q}`\'s elements.
tr_tr: :math:`\mathbf{q}` öğelerini artırmak, LQR'yi daha az ağır ağırlıklı büyük hatalar yapacaktır ve sonuçta ortaya çıkan :term:`kontrol yasası` daha tutucu davranacaktır. Bu, :math:`\mathbf{q}`\ 'nin öğelerini azaltarak :terim:`kontrol çabası` yı daha ağır cezalandırmaya benzer bir etkiye sahiptir .
zh_cn: 增加:math:`\mathbf{q}` 元素将使LQR的权重较大，误差较小，并且由此产生的 :term:`control law` 将表现得更加保守。这与通过减少:math:`\mathbf{q}`元素来更严厉地惩罚:term:`control effort` 具有相似的效果。

source: Similarly, decreasing the :math:`\mathbf{q}` elements would make the LQR penalize large errors more heavily, and the resulting :term:`control law` will behave more aggressively. This has a similar effect to penalizing :term:`control effort` less heavily by increasing :math:`\mathbf{q}` elements.
tr_tr: Benzer şekilde :math:`\mathbf{q}` öğelerini azaltmak, LQR'nin büyük hataları daha ağır cezalandırmasına neden olur ve sonuçta ortaya çıkan :term:`kontrol yasası` daha agresif davranır. Bu, :math:`\mathbf{q}` öğelerini artırarak cezalandırmaya benzer bir etkiye sahiptir.
zh_cn: 同样，减少 :math:`\mathbf{q}` 元素会使LQR对较大误差的不利影响更大，所得到的:term:`control law` 也会表现得更激进。这与通过增加:math:`\mathbf{q}`元素来减轻:term:`control effort` 有相似的效果。

source: However, we can model our controller to control where the system's :term:`state` is delayed into the future. This will reduce the LQR's :term:`gain` matrix :math:`\mathbf{K}`, trading off controller performance for stability. The below formula, which adjusts the :term:`gain` matrix to account for delay, is also used in frc-characterization.
tr_tr: Ancak, denetleyicimizi sistemin :term:`state` nin gelecekte sapacağı yeri kontrol edecek şekilde modelleyebiliriz. Bu, LQR'nin :term:`gain` matrix :math:`\mathbf{K}` 'yi azaltarak, kararlılık için denetleyici performansını değiştirecektir. Gecikmeyi hesaba katmak için :term:`gain` matrisini ayarlayan aşağıdaki formül, frc karakterizasyonunda da kullanılır.
zh_cn: 但是，我们可以对控制器进行建模，以控制 :term:`state`延迟到未来的时间。 这将减少LQR的 :term:`gain`矩阵:math:`\mathbf{K}`，以牺牲控制器性能为代价。下面的公式用于调整 :term:`gain矩阵以解决延迟问题，该公式也用于frc表征。

source: This article is from `Controls Engineering in FRC\ |reg| <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__ by Tyler Veness with permission.
tr_tr: Bu makale Tyler Veness izniyle yayınlanmaktadır: `FRC'de Kontrol Mühendisliği \ | reg | <https://file.tavsys.net/control/controls-engineering-in-frc.pdf> `_

source: For the background vocabulary that will be used throughout this article, see the :ref:`Glossary <docs/software/advanced-controls/state-space/state-space-glossary:State-Space Glossary>`.
tr_tr: Bu makale boyunca kullanılacak arka plan sözlüğü için bkz: :ref:`Glossary <docs/software/advanced-controls/state-space/state-space-glossary:State-Space Glossary>`.
