Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-intro.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Introduction to State-Space Control
es_mx: Introducción al Control del Estado-Espacio
fr_ca: Introduction au Contrôle de l'Espace-État
tr_tr: Durum Uzayı - State-space Kontrolüne Giriş
zh_cn: 空间状态控制简介

source: This article is from `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__ by Tyler Veness with permission.
es_mx: Este artículo es de `Ingeniería de Controles en FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__ por Tyler Veness con permiso.
fr_ca: Cet article est tiré de `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__ par Tyler Veness avec permission.
zh_cn: 本文来自于`Controls Engineering in FRC\ |reg| <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`，已获得作者Tyler Veness的许可。

source: From PID to Model-Based Control
es_mx: De PID a Control Basado en Modelo
fr_ca: Du PID au Contrôle à base d'un modèle
tr_tr: PID'den Model Tabanlı-Model-Based Kontrol
zh_cn: 从PID到基于模型的控制

source: When tuning PID controllers, we focus on fiddling with controller parameters relating to the current, past, and future :term:`error` (P, I and D terms) rather than the underlying system states. While this approach works in a lot of situations, it is an incomplete view of the world.
es_mx: Al ajustar los controladores PID, nos centramos en jugar con los parámetros del controlador relacionados con el presente, el pasado y el futuro :term:`error` (términos P, I y D) en lugar de los estados subyacentes del sistema. Si bien este enfoque funciona en muchas situaciones, es una visión incompleta del mundo.
fr_ca: Quand nous réglons les contrôleurs PID, nous nous concentrons le réglage des paramètres du contrôleur liés à :term:`l'erreur` actuel, du passé et du futur. (termes P, I et D) au lieu de nous concentrer aux états du système sous-jacent. Bien que cette approche fonctionne dans beaucoup de situations, c'est une vue incomplète de la réalité du système étudié.
tr_tr: PID denetleyicileri ayarlarken, mevcut, geçmiş ve gelecekle ilgili denetleyici parametreleriyle uğraşmaya odaklanıyoruz: temel sistem durumlarından ziyade :term:`error` (P, I ve D terimleri). Bu yaklaşım pek çok durumda işe yarasa da, eksik bir dünya görüşüdür.
zh_cn: 当调优PID控制器时，我们关注于摆弄与当前、过去和未来 :term:`error` (P、I和D项)相关的控制器参数，而不是底层系统状态。虽然这种方法在很多情况下都有效，但它是一种不完整的世界观。

source: Model-based control focuses on developing an accurate model of the :term:`system` (mechanism) we are trying to control. These models help inform :term:`gains <gain>` picked for feedback controllers based on the physical responses of the system, rather than an arbitrary proportional :term:`gain` derived through testing. This allows us not only to predict ahead of time how a system will react, but also test our controllers without a physical robot and save time debugging simple bugs.
es_mx: El control basado en modelos se enfoca en desarrollar un modelo preciso de el :term:`system` (mecanismo) que estamos tratando de controlar. Estos modelos ayudan a informar :term:`gains <gain>` tomadas de controladores basados en respuestas físicas del sistema, en vez de un arbitrario :term:`gain` proporcional derivado mediante pruebas. Esto nos permite no solo predecir a futuro como reaccionará el sistema, y también probará nuestros controladores sin un robot que esté físicamente y ahorrar tiempo depurando errores simples.
fr_ca: Le contrôle à partir d'un modèle se concentre sur le développement d'un modèle précis du :term:`système` (mécanisme) que nous essayons de contrôler. Ces modèles aident à affiner les :term:`gains <gain>` choisis pour les commandes de rétroaction basées sur les réponses phyiques du système, au lieu d'avoir un :term:`gain` proportionnel arbitraire dérivé de tests. Cela nous permet non seulement de prédire comment un système va réagir, mais aussi de tester nos contrôleurs sans avoir un robot physique en notre possession et gagner du temps pendant le débogage des simples bogues .
tr_tr: Model tabanlı kontrol, kontrol etmeye çalıştığımız :term:`system` (mechanism) için doğru bir model geliştirmeye odaklanır. Bu modeller keyfi bir orantılı :term:`gains <gain>` yerine sistemin fiziksel yanıtlarına dayalı olarak geribildirim denetleyicileri tarafından seçilen testler yoluyla elde edilen :term:`gains <gain>` bilgilendirmeye yardımcı olur. Bu, sadece bir sistemin nasıl tepki vereceğini önceden tahmin etmemize değil, aynı zamanda kontrolörlerimizi fiziksel bir robot olmadan test etmemize ve basit hataların ayıklanmasında zamandan tasarruf etmemize olanak tanır.
zh_cn: 基于模型的控制重点在于开发我们试图控制的 :term:`system` (机制)的精确模型。这些模型帮助反馈控制器根据系统的物理响应选择 :term:`gains 1`，而不是通过测试得到的任意比例 :term:`gain`。这使我们不仅能够提前预测系统的反应，而且可以在没有物理机器人的情况下测试控制器，节省调试简单bug的时间。

source: State-space control makes extensive use of linear algebra. More on linear algebra in modern control theory, including an introduction to linear algebra and resources, can be found in Chapter 4 of `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__.
es_mx: El control de estado-espacio hace un uso extensivo de algebra lineal. Más en algebra lineal en teoría del control moderna, incluyendo una introducción a algebra lineal y recursos, puede ser encontrada en el Capítulo 4 de `Ingeniería de Controles en FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__.
fr_ca: Le contrôle de l'espace-état utilise abondamment l'algèbre linéaire. Des informations plus approfondies sur l'algèbre linéare dans la théorie de la commande moderne, comprenant une introduction à l'algèbre linéaire ainsi que des ressources, peuvent être trouvées au Chapitre 4 du livre `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__.
tr_tr: Durum uzayı kontrolü, doğrusal cebirden kapsamlı bir şekilde yararlanır. Doğrusal cebire ve kaynaklara giriş de dahil olmak üzere modern kontrol teorisinde doğrusal cebir hakkında daha fazla bilgi, Tyler Veness'in izniyle, `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__ 'deki 4.bölümde bulunabilir.
zh_cn: 状态空间控制广泛使用线性代数。更多关于现代控制理论中的线性代数，包括线性代数的介绍和资源，可以在`Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`的第4章中找到。

source: If you've used WPILib's feedforward classes for ``SimpleMotorFeedforward`` or its sister classes, or used SysId to pick PID :term:`gains <gain>` for you, you're already familiar with model-based control! The ``kv`` and ``ka`` :term:`gains <gain>` can be used to describe how a motor (or arm, or drivetrain) will react to voltage. We can put these constants into standard state-space notation using WPILib's ``LinearSystem``, something we will do in a later article.
fr_ca: Si vous avez utilisé les classes feedforward de WPILib pour ``SimpleMotorFeedforward`` ou ses classes sœurs, ou utilisé SysId pour choisir PID :term:`gains `<gain> pour vous, vous êtes déjà familiarisé avec le contrôle basé sur un modèle ! Les ``kv`` et ``ka`` :term:`gains `<gain> peuvent être utilisés pour décrire comment un moteur (ou un bras, ou une transmission) réagira à la tension. Nous pouvons mettre ces constantes dans la notation d'espace d'état standard en utilisant le ``LinearSystem`` de WPILib, ce que nous ferons dans un article ultérieur.

source: Vocabulary
es_mx: Vocabulario
fr_ca: Vocabulaire
tr_tr: Kelime bilgisi
zh_cn: 词汇表

source: For the background vocabulary that will be used throughout this article, see the :ref:`Glossary <docs/software/advanced-controls/controls-glossary:Controls Glossary>`.
es_mx: Para el vocabulario de fondo que se utilizará a lo largo de este artículo, consulte el :ref:`Glosario <docs/software/advanced-controls/controls-glossary:Controls Glossary>`.
fr_ca: Pour le vocabulaire de base qui sera utilisé tout au long de cet article, consultez le :ref:`Glossaire <docs/software/advanced-controls/controls-glossary:Controls Glossary>`.
zh_cn: 对于本文中使用的背景词汇，清参阅:ref:`Glossary <docs/software/advanced-controls/controls-glossary:Controls Glossary>`.

source: Introduction to Linear Algebra
es_mx: Introducción a Algebra Lineal
fr_ca: Introduction à l'algèbre linéaire
tr_tr: Doğrusal Cebire Giriş
zh_cn: 线性代数导论

source: For a short and intuitive introduction to the core concepts of Linear Algebra, we recommend chapters 1 through 4 of `3Blue1Brown's Essence of linear algebra series <https://www.youtube.com/watch?v=fNk_zzaMoSs&list=PLZHQObOWTQDPD3MizzM2xVFitgF8hE_ab>`__ (Vectors, what even are they?, Linear combinations, span, and basis vectors, Linear transformations and matrices, and Matrix multiplication as composition).
es_mx: Para una introducción corta e intuitiva a los conceptos básicos de Álgebra Lineal, recomendamos los capítulos 1 al 4 de `Series 3Blue1Brown Esencia del algebra lineal <https://www.youtube.com/watch?v=fNk_zzaMoSs&list=PLZHQObOWTQDPD3MizzM2xVFitgF8hE_ab>`__ (Vectores, ¿qué son esos?, Combinaciones lineales, lapso, y vectores base, Transformaciones lineales y matrices, y Multiplicación de matrices como composición).
fr_ca: Pour une courte et intuitive introduction aux concepts de base de l'algèbre linéaire, nous vous recommandons les chapitres 1 à 4 de la `série Essence of Linear Algebra par 3Blue1Brown <https://www.youtube.com/watch?v=fNk_zzaMoSs&list=PLZHQObOWTQDPD3MizzM2xVFitgF8hE_ab>`__ (Vecteurs, qu’est-ce même?, Combinaisons linéaires, couverture, vecteurs de base, transformations linéaires et matrices, et multiplication de matrices comme composition).
tr_tr: Lineer Cebirin temel kavramlarına kısa ve sezgisel bir giriş için, `3Blue1Brown's Essence of linear algebra series <https://www.youtube.com/watch?v=fNk_zzaMoSs&list=PLZHQObOWTQDPD3MizzM2xVFitgF8hE_ab>`__ in 1'den 4'e kadar olan bölümlerini öneriyoruz (Vektörler, bunlar ne bile ?, Doğrusal kombinasyonlar, aralık ve taban vektörleri, Doğrusal dönüşümler ve matrisler ve kompozisyon olarak Matris çarpımı).
zh_cn: 为了简短，直观地介绍线性代数的核心概念，我们建议`3Blue1Brown线性代数系列<https://www.youtube.com/watch?v=fNk_zzaMoSs&list=PLZHQObOWTQDPD3MizzM2xVFitgF8hE_ab>`__的第1章至第4章（向量，它们甚至是什么？，线性组合，跨度和基向量，线性变换和矩阵，以及矩阵乘法作为组合）。

source: What is State-Space?
es_mx: ¿Qué es Estado-Espacio?
fr_ca: Qu'est-ce que c'est que l'espace-état?
tr_tr: Durum Uzayı nedir?
zh_cn: 什么是状态空间？

source: Recall that 2D space has two axes: x and y. We represent locations within this space as a pair of numbers packaged in a vector, and each coordinate is a measure of how far to move along the corresponding axis. State-space is a `Cartesian coordinate system <https://en.wikipedia.org/wiki/Cartesian_coordinate_system>`__ with an axis for each state variable, and we represent locations within it the same way we do for 2D space: with a list of numbers in a vector. Each element in the vector corresponds to a state of the system. This example shows two example state vectors in the state-space of an elevator model with the states :math:`[\text{position}, \text{velocity}]`:
es_mx: Recuerde que el espacio 2D tiene dos ejes: x y y. Nosotros representamos las localidades en éste espacio como un par de números empacados en un vector, y cada coordenada es una medida de que tan lejos moverse por su eje correspondiente. El estado--espacio es un `Sistema cartesiano coordinado <https://en.wikipedia.org/wiki/Cartesian_coordinate_system>`__ con un eje por cada estado de variable, y representamos localidades con el mismo modo que el espacio 2D: con una lista de números en el vector. Cada elemento en el vector corresponde a un estado del sistema. Este ejemplo nos muestra dos ejemplos de vectores de estado en el estado-espacio de un modelo de elevador con los estados :math:`[\text{position}, \text{velocity}]`:
fr_ca: Rappelons que l'espace 2D comprend 2 axes: x et y. Nous représentons des localisations dans cet espace comme une paire de nombres rassemblés pour former un vecteur, et chaque coordonnée est une mesure de la distance à parcourir le long de l’axe correspondant. L'espace-état est un `Système de Coordonnées Cartésiennes <https://fr.wikipedia.org/wiki/Coordonn%C3%A9es_cart%C3%A9siennes>`__ avec un axe pour chaque variable d'état, et nous représentons les localisations dans cet espace de la même façon qu'on le fait pour l'espace 2D: avec une liste de nombres rassemblés dans un vecteur. Chaque composante du vecteur correspond à un état du système. Cet exemple présente deux exemples de vecteurs d'état dans l'espace-état d'un modèle d'élévateur avec les états :math:`[\text{position}, \text{vélocité}]`:
tr_tr: 2D uzayın iki ekseni olduğunu hatırlayın: x ve y. Bu alandaki konumları, bir vektörde paketlenmiş bir çift sayı olarak temsil ederiz ve her koordinat, karşılık gelen eksen boyunca ne kadar hareket edileceğinin bir ölçüsüdür. Durum uzayı, her bir durum değişkeni için bir eksene sahip bir kartezyen koordinat sistemidir <https://en.wikipedia.org/wiki/Cartesian_coordinate_system>`__ve içindeki konumları, 2D uzay için yaptığımız gibi temsil ediyoruz: vektördeki sayıların bir listesiyle. Vektördeki her eleman, sistemin bir durumuna karşılık gelir. Bu örnek, bir asansör modelinin durum uzayında şu durumlara sahip iki örnek durum vektörünü gösterir::math:`[\text{position}, \text{velocity}]`:
zh_cn: 回想一下2D空间有两个轴：x和y。我们将此空间内的位置表示为包装在矢量中的一对数字，每个坐标是沿相应轴移动多远的度量。状态空间是一个“笛卡尔坐标系<https://en.wikipedia.org/wiki/Cartesian_coordinate_system>” __，每个状态变量都有一个轴，我们在其中表示位置的方式与二维空间相同：在向量中带有数字列表。向量中的每个元素都对应于系统的状态。此示例显示了电梯模型的状态空间中状态为[math：`[\ text {position}，\ text {velocity}]`的两个示例状态向量：

source: Two vectors in state space with their corresponding arrows.
fr_ca: Deux vecteurs dans l’espace d’état avec leurs flèches correspondantes.

source: In this image, the vectors representing states in state-space are arrows. From now on these vectors will be represented simply by a point at the vector's tip, but remember that the rest of the vector is still there.
es_mx: En ésta imagen, los vectores representando estados en estado-espacio son flechas. Desde ahora en éstos vectores serán representados simplemente por un punto en la punta del vector, pero recuerde que el resto del vector seguirá ahi.
fr_ca: Dans cette image, les vecteurs qui représentent les états dans l'espace-état sont des flèches. À partir de maintenant ces vecteurs seront représentés simplement par un point à la pointe du vecteur, mais souvenez-vous que le reste du vecteur est toujours là.
tr_tr: Bu görüntüde, durum uzayındaki durumları temsil eden vektörler oklardır. Şu andan itibaren bu vektörler, vektörün ucundaki bir nokta ile temsil edilecek, ancak vektörün geri kalanının hala orada olduğunu unutmayın.
zh_cn: 在此图像中，表示状态空间中状态的向量是箭头。从现在开始，这些向量将仅由向量尖端处的一个点表示，但请记住，向量的其余部分仍然存在。

source: In addition to the :term:`state`, :term:`inputs <input>` and :term:`outputs <output>` are represented as vectors. Since the mapping from the current states and inputs to the change in state is a system of equations, it’s natural to write it in matrix form. This matrix equation can be written in state-space notation.
es_mx: Añadiendo al :term:`estado`, :term:`entradas <input>` y :term:`salidas <output>` son representados como vectores. Dado que el mapeo de los estados actuales y las entradas al cambio de estado es un sistema de ecuaciones, es natural escribirlo en forma de matriz. Esta ecuación matricial se puede escribir en notación de estado-espacio.
fr_ca: En plus de :term:`l'état`, les :term:`entrées <input>` et :term:`sorties <output>` sont representées aussi comme des vecteurs. Puisque la correspondance des états actuels et les entrées au changement de l'état est un système d'équations, c'est naturel d'écrire cette relation sous forme de matrice. Cette équation matricielle peut être écrite dans notation d'espace-état.
tr_tr: :term:`state`, :term:`girişleri <input> :term:`outputs <output>çıkışlarına ek olarak vektörler olarak temsil edilir. Mevcut durumlardan ve girdilerden durumdaki değişime haritalama bir denklemler sistemi olduğundan, bunu matris biçiminde yazmak doğaldır. Bu matris denklemi durum uzayı gösteriminde yazılabilir.
zh_cn: 除了 :term:`state`之外，:term:`inputs 1` and :term:`outputs 2`也被表示为向量。由于从当前状态和输入到状态变化的映射是一个方程式系统，因此很自然地以矩阵形式编写它。该矩阵方程式可以用状态空间符号表示。

source: What is State-Space Notation?
es_mx: ¿Qué es la Notación de Estado-Espacio?
fr_ca: Qu'est-ce que c'est que la notation espace-état?
tr_tr: Durum Uzayı Gösterimi nedir?
zh_cn: 什么是状态空间符号？

source: State-space notation is a set of matrix equations which describe how a system will evolve over time. These equations relate the change in state :math:`\dot{\mathbf{x}}`, and the :term:`output` :math:`\mathbf{y}`, to linear combinations of the current state vector :math:`\mathbf{x}` and :term:`input` vector :math:`\mathbf{u}`.
es_mx: La notación de estado-espacio es un conjunto de ecuaciones matriciales que describen como el sistema evoluciona en el tiempo. Estas ecuaciones muestran el cambio en el estado :math:`\dot{\mathbf{x}}`, y el :term:`output` :math:`\mathbf{y}`, para combinaciones lineales del estado actual del vector :math:`\mathbf{x}` y :term:`input` vector :math:`\mathbf{u}`.
fr_ca: La notation espace-état est un ensemble d'équations matricielles qui décrit comment un système évoluera dans le temps. Ces équations relient le changement de l'état :math:`\dot{\mathbf{x}}`, et la :term:`sortie` :math:`\mathbf{y}`, à des combinaisons linéaires du vecteur d'état actuel :math:`\mathbf{x}` et le vecteur :term:`d’entrée` :math:`\mathbf{u}`.
tr_tr: Durum uzayı gösterimi, bir sistemin zaman içinde nasıl gelişeceğini açıklayan bir dizi matris denklemidir. Bu denklemler, :math:`\dot{\mathbf{x}}`, and the :term:`output` :math:`\mathbf{y}`, değişikliklerini mevcut durum vektörünün doğrusal kombinasyonlarıyla ilişkilendirir :math:`\mathbf{x}` and :term:`input` vector :math:`\mathbf{u}`.
zh_cn: 状态空间符号是一组矩阵方程，描述了系统随着时间的变化。这些方程将状态 :math:`\dot{\mathbf{x}}`和:term:`output` :math:`\mathbf{y}`的变化与当前状态向量的线性组合相关联：:math:`\mathbf{x}` and :term:`input` vector :math:`\mathbf{u}`。

source: State-space control can deal with continuous-time and discrete-time systems. In the continuous-time case, the rate of change of the system's state :math:`\mathbf{\dot{x}}` is expressed as a linear combination of the current state :math:`\mathbf{x}` and input :math:`\mathbf{u}`.
es_mx: El control del estado-espacio puede soportar sistemas de tiempo continuo y discreto. En el caso de tiempo continuo, la tasa de cambio del estado del sistema :math:`\mathbf{\dot{x}}` es expresado como una combinación lineal el estado actual :math:`\mathbf{x}` y entrada :math:`\mathbf{u}`.
fr_ca: Le contrôle de l'espace-état peut traiter des systèmes en temps continu ou en temps discret. Dans le cas du temps continu, le taux de variation de l'état du système :math:`\mathbf{\dot{x}}` est exprimé comme une combinaison linéaire de l'état courant :math:`\mathbf{x}` et de l'entrée :math:`\mathbf{u}`.
tr_tr: Durum alanı kontrolü, sürekli zamanlı ve ayrık zamanlı sistemlerle başa çıkabilir. Sürekli zaman durumunda, sistemin durumunun değişim oranı: :math:`\mathbf{\dot{x}}` , geçerli durumun doğrusal bir kombinasyonu olarak ifade edilir: :math:`\mathbf{x}` and input :math:`\mathbf{u}`.
zh_cn: 状态空间控制可以处理连续时间和离散时间系统。在连续时间情况下，系统状态:math:`\mathbf{\dot{x}}`的变化率表示为当前状态 :math:`\mathbf{x}` 和输入:math:`\mathbf{u}`的线性组合。

source: In contrast, discrete-time systems expresses the state of the system at our next timestep :math:`\mathbf{x}_{k+1}` based on the current state :math:`\mathbf{x}_k` and input :math:`\mathbf{u}_k`, where :math:`k` is the current timestep and :math:`k+1` is the next timestep.
es_mx: En contraste, los sistemas de tiempo discreto expresan el estado del sistema en nuestro siguiente paso del tiempo :math:`\mathbf{x}_{k+1}` basado en el estado actual :math:`\mathbf{x}_k` y la entrada :math:`\mathbf{u}_k`, donde :math:`k` es el paso de tiempo actual y :math:`k+1` es el siguiente paso de tiempo.
fr_ca: En revanche, les systèmes à temps discret expriment l'état du système à notre prochain pas de temps :math:`\mathbf{x}_{k+1}` basé sur l'état actuel :math:`\mathbf{x}_k` et l'entrée :math:`\mathbf{u}_k`, où :math:`k` est le pas de temps actuel et :math:`k+1` est le prochain pas de temps.
tr_tr: Buna karşılık, ayrık zamanlı sistemler, bir sonraki zaman adımımızda sistemin durumunu şu anki duruma göre ifade eder. :math:`\mathbf{x}_{k+1}` ve mevcut duruma göre :math: `\ mathbf {x} _k` ve girdi: math: `\ mathbf {u} _k`, burada :math:`k` geçerli zaman adımıdır ve :math:`k+1` sonraki zaman adımıdır.
zh_cn: 相反，离散时间系统基于当前状态 :math:`\mathbf{x}_k`和下一个时间步表示系统状态:math:`\mathbf{x}_{k+1}`和输入:math:`\mathbf{u}_k`，其中 :math:`k`是当前时间步，而:math:`k+1` 是下一个时间步。

source: In both the continuous- and discrete-time forms, the :term:`output` vector :math:`\mathbf{y}` is expressed as a linear combination of the current :term:`state` and :term:`input`. In many cases, the output is a subset of the system's state, and has no contribution from the current input.
es_mx: Tanto en la forma de tiempo continuo como en la discreta, el vector :term:`salida` :math:`\mathbf{y}` se expresa como una combinación lineal del :term:`estado` y :term:`entrada` actual. En muchos casos, la salida es un subconjunto de estados del sistema, y no tiene contribución de la entrada actual.
fr_ca: Dans les deux formes de temps continu et discret, le vecteur de :term:`sortie` :math:`\mathbf{y}` est exprimé comme une combinaison linéaire de :term:`l’état` actuel et de :term:`l’entrée`. Dans de nombreux cas, la sortie est un sous-ensemble de l'état du système et n'a aucune contribution de l'entrée actuelle.
tr_tr: Hem sürekli hem de ayrık zaman formlarında,`output` vector :math:`\mathbf{y}`, current: term: "state" ve:term:`input` ifadelerinin doğrusal bir kombinasyonu olarak ifade edilir . Çoğu durumda, çıktı, sistem durumunun bir alt kümesidir ve akım girişinden hiçbir katkısı yoktur.
zh_cn: 无论是连续时间形式还是离散时间形式， :term:`output` 向量:math:`\mathbf{y}` 都表示为当前:term:`state` 和 :term:`input`的线性组合。在许多情况下，输出是系统状态的子集，没有来自当前输入的贡献。

source: When modeling systems, we first derive the continuous-time representation because the equations of motion are naturally written as the rate of change of a system's state as a linear combination of its current state and inputs. We convert this representation to discrete-time on the robot because we update the system in discrete timesteps there instead of continuously.
es_mx: Cuando modelamos el sistema, primero derivamos la representación del tiempo continuo poruqe las ecuaciones de movimiento son naturalmente escritas como la tasa de cambio de un estado del sistema como una combinación lineal del actual estado y las entradas. Convertimos la representación a tiempo discreto en el robot porque actualizamos el sistema en pasos de tiempo discretos ahí en vez de continuamente.
fr_ca: Lors de la modélisation de systèmes, nous dérivons d'abord la représentation en temps continu parce que les équations de mouvement sont naturellement écrites comme le taux de changement de l'état d'un système comme une combinaison linéaire de son état actuel et des entrées. Nous convertissons cette représentation en temps discret sur le robot parce que nous mettons à jour le système par intervalles de temps discrets au lieu de le faire en continu.
tr_tr: Sistemleri modellerken, ilk olarak sürekli zaman gösterimini türetiyoruz çünkü hareket denklemleri doğal olarak bir sistemin durumunun değişim hızı olarak mevcut durumu ve girdilerinin doğrusal bir kombinasyonu olarak yazılır. Bu gösterimi robot üzerinde ayrık zamana dönüştürüyoruz çünkü sistemi sürekli yerine orada ayrı zaman adımlarında güncelliyoruz.
zh_cn: 在对系统进行建模时，我们首先导出连续时间表示形式，因为运动方程很自然地写为系统状态的变化率，即系统当前状态和输入的线性组合。我们将这种表示形式转换为机器人上的离散时间，因为我们在此以离散时间步长而不是连续地更新系统。
