Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-flywheel-walkthrough.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Because Kalman filters use our state-space model in the :ref:`docs/software/advanced-controls/state-space/state-space-observers:Predict step`, it is important that our model is as accurate as possible. One way to verify this is to record a flywheel's input voltage and velocity over time, and replay this data by calling only ``predict`` on the Kalman filter. Then, the kV and kA gains (or moment of inertia and other constants) can be adjusted until the model closely matches the recorded data.
es_mx: Porque los filtros Kalman usan nuestros modelos de estado-espacio en el :ref:`docs/software/advanced-controls/state-space/state-space-observers:Predict step`, es importante que nuestro modelo es tan preciso como es posible. Una manera de verificar esto es registrar el voltaje de entrada del volante y la velocidad en el tiempo, y vuelve a reproducir esta información llamando solo ``predict`` en el filtro Kalman. Después, las ganancias de kV y kA (o el momento de inercia y otras constantes) pueden ser justadas hasta que el modelo se acerque a igualar los datos registrados.
fr_ca: Étant donné que les filtres de Kalman utilisent notre modèle espace-état dans :ref:`docs/software/advanced-controls/state-space/state-space-observers:Predict step`, il est important que notre modèle soit aussi précis que possible. Une façon de vérifier cela est d’enregistrer la tension d’entrée et la vitesse d’entrée d’un volant d'inertie au fil du temps, et de rejouer ces données en appelant uniquement ``predict`` sur le filtre de Kalman. Ensuite, les gains kV et kA (ou moment d’inertie et autres constantes) peuvent être ajustés jusqu’à ce que le modèle corresponde étroitement aux données enregistrées.
tr_tr: Kalman filtreleri : ref: `docs / software / advanced-controls / state-space / state-space-observers: Predict step`'de durum uzayı modelimizi kullandığından, modelimizin mümkün olduğu kadar doğru olması önemlidir. Bunu doğrulamanın bir yolu, bir volanın giriş voltajını ve zaman içindeki hızını kaydetmek ve bu verileri Kalman filtresinde yalnızca ``predict-tahmin`` olarak adlandırarak yeniden yürütmektir. Daha sonra, kV ve kA kazançları (veya eylemsizlik momenti ve diğer sabitler), model kaydedilen verilerle yakından eşleşene kadar ayarlanabilir.
zh_cn: 由于卡尔曼滤波器在 :ref:`docs/software/advanced-controls/state-space/state-space-observers:Predict step`步骤中使用我们的状态空间模型，因此我们的模型尽可能准确是很重要的。验证这一点的一种方法是记录飞轮随时间变化的输入电压和速度，然后通过仅调用Kalman滤波器上的预测来重放此数据。然后，可以调节kV和kA增益（或惯性矩和其他常数），直到模型与记录的数据紧密匹配为止。

source: Todo
es_mx: QuéHacer
fr_ca: À faire
tr_tr: Yapmak
zh_cn: 要做的事

source: do we need to elaborate on this^ more?
es_mx: ¿necesitamos hablar de esto^ más?
fr_ca: avons-nous besoin d’élaborer ceci d'avantage?
tr_tr: Bu ^ daha fazla ayrıntıya ihtiyacımız var mı?
zh_cn: 我们还需要详细说明吗？

source: Linear-Quadratic Regulators and Plant Inversion Feedforward
es_mx: Reguladores Lineales Cuadráticos y Feedforward de Inversión de Planta
fr_ca: Régulateurs linéaires-quadratiques et commande prédictive inverse de procédé
tr_tr: Doğrusal-Kuadratik Düzenleyiciler ve Plant Inversion Feedforward-İleri Besleme
zh_cn: 线性二次调节器和设备反转前馈

source: :ref:`docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator` finds a feedback controller to drive our flywheel :term:`system` to its :term:`reference`. Because our flywheel has just one state, the control law picked by our LQR will be in the form :math:`\mathbf{u = K (r - x)}` where :math:`\mathbf{K}` is a 1x1 matrix; in other words, the control law picked by LQR is simply a proportional controller, or a PID controller with only a P gain. This gain is chosen by our LQR based on the state excursion and control efforts we pass it. More on tuning LQR controllers can be found in the :ref:`LQR application example <docs/software/advanced-controls/state-space/state-space-intro:LQR: example application>`.
es_mx: :ref:`docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator` encuentra un controlador de retroalimentación para manejar nuestro :term:`sistema` de volante a su :term:`referencia`. Porque nuestro volante solo tiene un estado, la ley de control tomada por nuestro LQR va a estar en la forma :math:`\mathbf{u = K (r - x)}` donde :math:`\mathbf{K}` es una matriz de 1x1; en otras palabras, la ley de control tomada por el LQR es simplemente un controlador proporcional, o un controlador PID con solo ganancia P. Esta ganancia es elegida por nuestro LQR en función de la excursión de estado y los esfuerzos de control que la pasamos. Más de la afinación de controladores LQR puede encontrarse en :ref:`ejemplo de aplicación de LQR <docs/software/advanced-controls/state-space/state-space-intro:LQR: example application>`.
fr_ca: :ref:`docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator` trouve un contrôleur de rétroaction pour amener notre :term:`système` volant d'inertie à sa :term:`référence`. Parce que notre volant n’a qu’un seul état, la loi de commande choisie par notre LQR sera sous la forme :math:`\mathbf{u = K (r - x)}` où :math:`\mathbf{K}` est une matrice 1x1; en d’autres termes, la loi de commande choisie par notre LQR est simplement un contrôleur proportionnel, ou un contrôleur PID avec seulement un gain P. Ce gain est choisi par notre LQR en fonction de l’excursion d'état et des efforts de contrôle que nous lui transmettons. En savoir plus sur le réglage des contrôleurs LQR, consultez :ref:`LQR application example <docs/software/advanced-controls/state-space/state-space-intro:LQR: example application>`.
tr_tr: :ref:`docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator`, volanımızı :term:`system` i :term:`reference` a sürmek için bir geri bildirim denetleyicisi bulur . Volanımızın sadece bir durumu olduğu için, LQR'miz tarafından seçilen kontrol yasası şu biçimde olacaktır :math:`\mathbf{u = K (r - x)}` burada :math:`\mathbf{K}`, bir 1x1 matrisdir; başka bir deyişle, LQR tarafından seçilen kontrol kuralı basitçe orantılı bir kontrolör veya sadece bir P kazancı olan bir PID kontrolörüdür. Bu kazanç, LQR'miz tarafından, geçtiğimiz durum gezi ve kontrol çabalarına göre seçilir. LQR denetleyicilerinin ayarlanması hakkında daha fazla bilgi şu adreste bulunabilir :ref:`LQR uygulama örneği <docs/software/advanced-controls/state-space/state-space-intro:LQR: example application>`.
zh_cn: :ref:`docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator` 找到了一个反馈控制器来将我们的飞轮 :term:`system` 驱动到:term:`reference`。因为我们的飞轮只有一个状态，所以我们的LQR选择的控制律将采用:math:`\mathbf{u = K (r - x)}` 的形式，其中:math:`\mathbf{K}`是一个1x1矩阵；换句话说，由LQR选择的控制律只是比例控制器，或仅具有P增益的PID控制器。该增益由我们的LQR根据我们通过它的状态偏移和控制努力来选择。更多有关LQR控制器调优的信息可在 :ref:`LQR application example <docs/software/advanced-controls/state-space/state-space-intro:LQR: example application>`.中找到。

source: Much like ``SimpleMotorFeedforward`` can be used to generate feedforward voltage inputs given kS, kV, and kA constants, the Plant Inversion Feedforward class generate :ref:`feedforward <docs/software/advanced-controls/state-space/state-space-intro:Visualizing Feedforward>` voltage inputs given a state-space system. The voltage commands generated by the ``LinearSystemLoop`` class are the sum of the feedforward and feedback inputs.
es_mx: Mucho como ``SimpleMotorFeedforward`` puede ser usado para generar la entrada de voltaje del feedfoward dadas las constantes kS, kV, kA, la clase Feedforward de Inversión de Planta genera entradas de voltaje de :ref:`feedforward <docs/software/advanced-controls/state-space/state-space-intro:Visualizing Feedforward>` dado un sistema de estado-espacio. Los comandos de voltaje generados por la clase ``LinearSystemLoop`` son la suma de las entradas de feedfoward y de retroaliemntación.
fr_ca: Tout comme le ``SimpleMotorFeedforward`` peut être utilisé pour générer des tensions d'entrée de la commande prédictive étant donnés les constantes kS, kV, et kA, la classe ``Plant Inversion Feedforward`` génère :ref:`feedforward <docs/software/advanced-controls/state-space/state-space-intro:Visualizing Feedforward>` les tensions d'entrée étant donné le système espace-état. Les commandes de tension générées par la classe ``LinearSystemLoop`` sont la somme des entrées des commandes prédictive et de rétroaction.
tr_tr: ``SimpleMotorFeedforward`` gibi, kS, kV ve kA sabitleri verilen ileri besleme voltaj girişleri oluşturmak için kullanılabilir, Plant Inversion Feedforward sınıfı, bir durum uzay sistemi verilen :ref:`feedforward <docs/software/advanced-controls/state-space/state-space-intro:Visualizing Feedforward>` voltaj girişlerini üretir. `` LinearSystemLoop`` sınıfı tarafından üretilen gerilim komutları ileri besleme ve geri besleme girişlerinin toplamıdır.
zh_cn: 在给定kS，kV和kA常数的情况下，类似于SimpleMotorFeedforward可以用来生成:ref:`feedforward <docs/software/advanced-controls/state-space/state-space-intro:Visualizing Feedforward>` 电压输入，而在状态空间系统下，Plant Inversion前馈类可以生成前馈电压输入。由LinearSystemLoop类生成的电压命令是前馈和反馈输入的总和。

source: Bringing it All Together: LinearSystemLoop
es_mx: Trayendo todo Junto: LinearSystemLoop
fr_ca: En rassemblant le tout: LinearSystemLoop
tr_tr: Hepsini Bir Araya Getirin : LinearSystemLoop
zh_cn: 整合在一起：LinearSystemLoop

source: LinearSystemLoop combines our system, controller, and observer that we created earlier. The constructor shown will also instantiate a ``PlantInversionFeedforward``.
es_mx: LinearSystemLoop combina nuestro sistema, controlador, y observador que creamos antes. El constructor que se muestra también crea una instancia ``PlantInversionFeedforward``.
fr_ca: LinearSystemLoop combine notre système, notre contrôleur et notre observateur que nous avons créés plus tôt. Le constructeur montré instancie également un ``PlantInversionFeedforward``.
tr_tr: LinearSystemLoop, daha önce oluşturduğumuz sistemimizi, denetleyicimizi ve gözlemcimizi birleştirir. Gösterilen kurucu ayrıca bir ``PlantInversionFeedforward`` başlatacaktır.
zh_cn: LinearSystemLoop结合了我们先前创建的系统，控制器和观察器。所示的构造函数还将实例化``PlantInversionFeedforward''。

source: Once we have our ``LinearSystemLoop``, the only thing left to do is actually run it. To do that, we'll periodically update our Kalman filter with our new encoder velocity measurements and apply new voltage commands to it. To do that, we first set the :term:`reference`, then ``correct`` with the current flywheel speed, ``predict`` the Kalman filter into the next timestep, and apply the inputs generated using ``getU``.
es_mx: Una vez que tenemos nuestro ``LinearSystemLoop``, lo único que queda por hacer es ejecutarlo. Para hacer eso, actualizaremos periódicamente nuestro filtro Kalman con nuestras nuevas medidas de velocidad del codificador y le aplicaremos nuevos comandos de voltaje. Para hacer eso, primero establecemos el :term:`referencia`, luego ``corregir`` con la velocidad actual del volante, ``predecir`` el filtro de Kalman en el siguiente paso de tiempo y aplicar las entradas generadas usando ``getU``.
fr_ca: Une fois que nous avons obtenu notre ``LinearSystemLoop``, la dernière chose à faire est de l’exécuter. Pour ce faire, nous mettrons périodiquement à jour notre filtre de Kalman avec nos nouvelles mesures de vitesse d’encodeur et lui appliquerons de nouvelles commandes de tension. Dans cette optique, nous avons d’abord défini la :term:`référence`, puis ``corrigé`` avec la vitesse actuelle du volant d'inertie, ``prédit`` le filtre de Kalman dans le prochain pas de temps, et appliqué les entrées générées à l’aide de ``getU``.
tr_tr: ``LinearSystemLoop`` umuza sahip olduğumuzda, geriye kalan tek şey onu çalıştırmaktır. Bunu yapmak için, Kalman filtremizi yeni enkoder hız ölçümlerimizle periyodik olarak güncelleyeceğiz ve ona yeni voltaj komutları uygulayacağız. Bunu yapmak için, önce :term:`reference` yi, ardından mevcut volan hızıyla `correct``, bir sonraki zaman adımına Kalman filtresini ``predict`` ve ``getU`` kullanılarak oluşturulan girdileri uyguluyoruz. .
zh_cn: 一旦我们有了``LinearSystemLoop''，剩下的唯一要做的就是实际运行它。为此，我们将使用新的编码器速度测量值定期更新我们的卡尔曼滤波器，并对其应用新的电压命令。为此，我们首先设置 :term:`reference`，然后使用当前飞轮速度进行“校正”，将卡尔曼滤波器“预测”到下一个时间步，然后应用使用“ getU”生成的输入`。

source: The full example is available in the state-space flywheel (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel/Robot.java>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel/cpp/Robot.cpp>`__) and state-space flywheel system identification (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheelsysid/Robot.java>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheelSysId/cpp/Robot.cpp>`__) example projects.
fr_ca: L’exemple complet est disponible dans l'espace-état du volant d'inertie (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel/Robot.java>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel/cpp/Robot.cpp>`__) et dans les projets exemples d'identification système dans l'espace-état du volant d'inertie (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheelsysid/Robot.java>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheelSysId/cpp/Robot.cpp>`__) .
tr_tr: Tam örnek, durum uzayı volanında (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel/Robot.java>` __ / `C ++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel/cpp/Robot.cpp>` __) ve durum uzayı volan sistemi tanımlamasında (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheelsysid/Robot.java>` __ / `C ++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheelSysId/cpp/Robot.cpp>` __) mevcuttur.
zh_cn: 完整的示例在状态空间飞轮（Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel/Robot.java> __ /`C ++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel/cpp/Robot.cpp>`__）和状态空间飞轮系统标识（Java Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheelsysid/Robot.java>`__ /`C ++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheelSysId/cpp/Robot.cpp>`__）中可用。

source: Let's use this system of equations to model our flywheel in two different ways. We'll first model it using :term:`system identification` using the SysId toolsuite, and then model it based on the motor and flywheel's :term:`moment of inertia`.
fr_ca: Utilisons ce système d'équations pour modéliser notre volant d'inertie de deux manières différentes. Nous allons d'abord le modéliser en utilisant :term:`identification du système` à l'aide de la suite d'outils SysId, puis le modéliser en fonction du :term:`moment d'inertie` du moteur et du volant.

source: Next, we identify the :term:`inputs <input>` to our system. Inputs can be thought of as things we can put "into" our system to change its state. In the case of the flywheel (and many other single-jointed mechanisms in FRC\ |reg|), we have just one input: voltage applied to the motor. By choosing voltage as our input (over something like motor duty cycle), we can compensate for battery voltage sag as battery load increases.
fr_ca: Ensuite, nous identifions les :term:`entrées <input>` dans notre système. Les entréss peuvent être considérées comme des paramètres que nous pouvons mettre "dans" notre système pour en changer l'état. Dans le cas du volant d'inertie (et de nombreux autres mécanismes à simple articulation en FRC\ |reg|), nous n’avons qu’une seule entrée : la tension appliquée sur le moteur. En choisissant la tension comme entrée (plutôt qu'un paramètre comme le cycle de travail du moteur), nous pouvons compenser la réduction de la tension de la batterie à mesure que la charge de la batterie augmente.
tr_tr: Daha sonra, : terimini tanımlıyoruz: `sistemimize <input> girişleri. Girdiler, durumunu değiştirmek için sistemimize "into-içine" koyabileceğimiz şeyler olarak düşünülebilir. Volan (ve FRC \ |reg| 'deki diğer birçok tek eklemli mekanizma) durumunda, sadece bir girişimiz var: motora uygulanan voltaj. Girişimiz olarak voltajı seçerek (motor görev döngüsü gibi bir şey üzerinde), akü yükü arttıkça akü voltajındaki düşüşü telafi edebiliriz.
zh_cn: 接下来，我们识别系统的 :term:`inputs 1`。可以将输入视为可以放入系统以更改其状态的事物。对于飞轮（以及FRC \ | reg |中的许多其他单联机构），我们只有一个输入:施加到电机的电压。通过选择电压作为我们的输入(而不是像电机占空比这样的东西)，我们可以补偿电池电压下降，电池负载增加。

source: The effect of a Kalman, median, and IIR filters on some flywheel data.
fr_ca: L’effet d’un filtre Kalman, médian et RII sur certaines données du volant d’inertie.

source: Because the feedback controller computes error using the :term:`x-hat` estimated by the Kalman filter, the controller will react to disturbances only as quickly the filter's state estimate changes. In the above chart, the upper left plot (with a state standard deviation of 3.0 and measurement standard deviation of 0.2) produced a filter that reacted quickly to disturbances while rejecting noise, while the upper right plot shows a filter that was barely affected by the velocity dips.
fr_ca: Comme le contrôleur de rétroaction calcule l’erreur à l’aide du paramètre :term:`x-chapeau` estimé par le filtre de Kalman, le contrôleur ne réagira aux perturbations qu'aussi rapidement que l’estimation d’état du filtre change. Dans le graphique ci-dessus, la courbe située en haut et à gauche (avec un écart type d’état de 3.0 et un écart type de mesure de 0.2) a produit un filtre qui réagit rapidement aux perturbations tout en rejetant le bruit, tandis que la courbe située en haut et à droite montre un filtre qui a été à peine affecté par les baisses de vitesse.
zh_cn: 由于反馈控制器使用卡尔曼滤波器估计的 :term:`x-hat` 来计算误差，因此控制器只会对滤波器的状态估计值变化迅速做出反应。在上图中，橙色曲线（状态标准偏差为3.0，测量标准偏差为0.2）产生了一个过滤器，该过滤器对干扰快速反应，同时抑制了噪声，而品红色过滤器几乎不受速度下降的影响。
