Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-intro.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: In the case of a DC motor, with just a mathematical model and knowledge of all current states of the system (i.e., angular velocity), we can predict all future states given the future voltage inputs. But if the system is disturbed in any way that isn’t modeled by our equations, like a load or unexpected friction, the angular velocity of the motor will deviate from the model over time. To combat this, we can give the motor corrective commands using a feedback controller.
es_mx: En el caso de los motores de control directo, con solo un modelo matemático y conocimiento de todos los estados actuales del sistema (ej. velocidad angular), podemos predecir todos los futuros estados dados en las entradas de futuros voltajes. Pero si el sistema es cambiado en alguna manera que no esté modelada por nuestras ecuaciones, como una carga o fricción inesperada, la velocidad angular del motor va a derivar del modelo por el tiempo. Para combatir esto, podemos dar al motor comandos correctivos usando el controlador de retroalimentación.
fr_ca: Dans le cas d'un moteur à courant continu, avec juste un modèle mathématique et une connaissance de tous les états actuels du système (c'est-à-dire la vitesse angulaire), nous pouvons prédire tous les états futurs compte tenu des futures entrées de tension. Mais si le système est perturbé d'une manière qui n'est pas modélisée par nos équations, comme une charge ou un frottement inattendu, la vitesse angulaire du moteur s'écartera du modèle au fil du temps. Pour lutter contre cela, nous pouvons donner au moteur des commandes correctives à l'aide d'un contrôleur de rétroaction.
tr_tr: Bir DC motor söz konusu olduğunda, sadece matematiksel bir modelle ve sistemin tüm mevcut durumlarının bilgisiyle (örneğin, açısal hız), gelecekteki voltaj girişleri verildiğinde gelecekteki tüm durumları tahmin edebiliriz. Ancak sistem, bir yük veya beklenmedik sürtünme gibi denklemlerimiz tarafından modellenmeyen herhangi bir şekilde bozulursa, motorun açısal hızı zamanla modelden sapacaktır. Bununla mücadele etmek için, motora bir geri besleme kontrolörü kullanarak düzeltici komutlar verebiliriz.
zh_cn: 在直流电动机的情况下，只需要一个数学模型和系统的所有当前状态(即角速度)的知识，我们就可以根据未来的电压输入预测所有未来的状态。但是，如果系统受到我们的方程所没有模拟的任何干扰，比如负载或意外摩擦，电机的角速度会随着时间的推移偏离模型。为了解决这个问题，我们可以使用反馈控制器给电机校正命令。

source: A PID controller is a form of feedback control. State-space control often uses the following :term:`control law`, where :math:`\mathbf{K}` is some controller :term:`gain` matrix, :math:`\mathbf{r}` is the :term:`reference` state, and :math:`\mathbf{x}` is the current state in state-space. The difference between these two vectors, :math:`\mathbf{r-x}`, is the :term:`error`.
es_mx: Un controlador de PID es una forma de control de retroalimentación. El control del estado-espacio usa la siguiente :term:`ley de control`, donde :math:`\mathbf{K}` es algún controlador de matriz de :term:`ganancia`, :math:`\mathbf{r}` es un estado de :term:`referencia`, y :math:`\mathbf{x}` es el estado actual en estado-espacio. La diferencia entre estos dos vectores, :math:`\mathbf{r-x}`, es el :term:`error`.
fr_ca: Un contrôleur PID est une forme de commande de rétroaction. Le contrôle de l'espace d'états utilise souvent la :term:`loi de commande` suivante, où :math:`\mathbf{K}` est la matrice de :term:`gain` d'une commande, :math:`\mathbf{r}` est l'état de :term:`référence`, et :math:`\mathbf{x}` est l'état actuel dans l'espace d'états. La différence entre ces deux vecteurs, :math:`\mathbf{r-x}`, correspond à :term:`l’erreur`.
tr_tr: PID kontrolörü, bir geri besleme kontrolü biçimidir. Durum uzayı kontrolü genellikle şunları kullanır :term:`control law`, burada :math:`\mathbf{K}` bazı kontrolcü :term:`gain` matrisi, :math:`\mathbf{r}` :term:`reference` durumu ve :matematik:`\mathbf{x}` durum uzayındaki mevcut durumdur. Bu iki vektör arasındaki fark :math:`\mathbf{r-x}`, :term:`error`dır.
zh_cn: PID控制器是反馈控制的一种形式。状态空间控制通常使用以下控制法则，其中 :math:`\mathbf{K}` 是一些控制器：term：`gain`矩阵，:math:`\mathbf{r}` 是 :term:`reference` 状态，而 :math:`\mathbf{x}` 是状态空间中的当前状态。这两个向量的差 :math:`\mathbf{r-x}`，是:term:`error`。

source: This :term:`control law` is a proportional controller for each state of our system. Proportional controllers create software-defined springs that pull our system's state toward our reference state in state-space. In the case that the system being controlled has position and velocity states, the :term:`control law` above will behave as a PD controller, which also tries to drive position and velocity error to zero.
es_mx: Esta :term:`ley de control` es un controlador proporcional para cada estado del sistema. Controladores proporcionales crean resortes definidos por el software que empujan nuestro estado del sistema hacia nuestro estado de referencia en el estado-espacio. En el caso de que el sistema siendo controlado tenga estados de posición y velocidad, la :term:`ley de control` de arriba como un controlador PD, que también intenta llevar al error de posición y velocidad a cero.
fr_ca: Cette :term:`loi de commande` correspond à un contrôleur proportionnel pour chaque état de notre système. Les contrôleurs proportionnels créent des "ressorts" définis par logiciel qui tirent l'état de notre système vers notre état de référence dans l'espace d'états. Dans le cas où le système commandé a des états de position et de vitesse, la :term:`loi de commande` ci-dessus se comportera comme un contrôleur PD, qui essaie également de ramener l'erreur de position et de vitesse à zéro.
tr_tr: Bu :term:`control law`, sistemimizin her durumu için oransal bir denetleyicidir. Oransal denetleyiciler, sistemimizin durumunu durum uzayındaki referans durumuna çeken yazılım tanımlı yaylar oluşturur. Kontrol edilen sistemin konum ve hız durumlarına sahip olması durumunda, yukarıdaki :terim:`control law`, aynı zamanda konumu ve hız hatasını sıfıra çekmeye çalışan bir PD kontrolörü gibi davranacaktır.
zh_cn: :term:`control law`是系统每个状态的比例控制器。比例控制器创建软件定义的弹簧，该弹簧将我们的系统状态拉到状态空间中的参考状态。在被控制的系统具有位置和速度状态的情况下，上述 :term:`control law`将充当PD控制器，PD控制器还将试图将位置和速度误差驱动为零。

source: Let's show an example of this control law in action. We'll use the pendulum system from above, where the swinging pendulum circled the origin in state-space. The case where :math:`\mathbf{K}` is the zero matrix (a matrix with all zeros) would be like picking P and D gains of zero -- no control :term:`input` would be applied, and the phase portrait would look identical to the one above.
es_mx: Veamos un ejemplo de esta ley de control en acción. Usaremos un sistema de péndulo desde abajo. donde el péndulo balanceante rodea al origen en estado-espacio. El caso donde :math:`\mathbf{K}` es la matriz cero (una matriz con todos cero) escogería las ganancias P y D de cero -- no se aplicaría :term:`entrada` de control, y el retrato de fase va a verse idéntico al de arriba.
fr_ca: Montrons un exemple de cette loi de commande en action. Nous utiliserons le système de pendule décrit plus haut, où le pendule oscillant encercle l'origine dans l'espace d'états. Le cas où :math:`\mathbf {K}` est la matrice nulle (une matrice dont tous les éléments sont des zéros) équivaut à choisir des gains P et D nuls - aucune :term:`entrée` de commande serait appliquée, et le diagramme de phase serait identique à celui présenté ci-dessus.
tr_tr: Bu kontrol yasasının uygulamada bir örneğini gösterelim. Sarkaç sistemini yukarıdan kullanacağız, burada sallanan sarkaç durum uzayında orijini daire içine aldı. :math:`\mathbf{K}` sıfır matrisinin (tümü sıfır olan bir matris), sıfırın P ve D kazançlarını toplama gibi olacağı durum -- kontrol yok :term:`girdi` uygulanabilir ve aşama portresi yukarıdakiyle aynı görünecektir.
zh_cn: 让我们举例说明这种控制律的实际作用。我们将从上方使用钟摆系统，其中摆动的钟摆环绕状态空间中的原点。:math:`\mathbf{K}`是零矩阵（一个全为零的矩阵）的情况就像选择P和D增益为零-没有控制输入将被应用，并且相画像看起来与上面的相同。

source: To add some feedback, we arbitrarily pick a :math:`\mathbf{K}` of [2, 2], where our :term:`input` to the pendulum is angular acceleration. This K would mean that for every radian of position :term:`error`, the angular acceleration would be 2 radians per second squared; similarly, we accelerate by 2 radians per second squared for every radian per second of :term:`error`. Try following an arrow from somewhere in state-space inwards -- no matter the initial conditions, the state will settle at the :term:`reference` rather than circle endlessly with pure feedforward.
es_mx: Para añadir algo de retroalimentación, arbitrariamente escogemos :math:`\mathbf{K}` of [2, 2], donde nuestra :term:`entrada` al péndulo es la aceleración angular. Esta K significará que por cada radian de posición :term:`error`, la aceleración angular será 2 radianes por segundo cuadrado; similarmente, aceleramos por 2 radianes por segundo cuadrado por cada radian por segundo de :term:`error`. Intente seguir una flecha desde algún punto en el estado-espacio hacia adentro -- no importa las condiciones iniciales, el estado sentará en la :term:`referencia` en vez de rodear sin fin con feedforward pura.
fr_ca: Pour ajouter une rétroaction, nous choisissons arbitrairement un :math:`\mathbf {K}` de [2, 2], où notre :term:`entrée` du pendule est une accélération angulaire. Ce K signifie que pour chaque :term:`erreur` de position de 1 radian, l'accélération angulaire serait de 2 radians par seconde au carré; en d'autres mots, nous accélérons de 2 radians par seconde au carré pour chaque radian par seconde term:`d’erreur`. Essayez de suivre une flèche en provenance de quelque part dans l'espace d'états vers l'intérieur - quelles que soient les conditions initiales, l'état convergera vers la :term:`référence` plutôt que de tourner sans fin comme ce serait le cas avec une commande avec rétroaction pure.
tr_tr: Geri bildirim eklemek için, rasgele olarak bir :math:`\mathbf{K}` of [2, 2] seçiyoruz; burada sarkaç için bizim :term:`input` açısal ivmedir. Bu K, her bir konumun radyan :term:`hata` için, açısal ivmenin saniyede 2 radyan kare olacağı anlamına gelir; benzer şekilde, :terim:`hata` nın her saniyesinde her radyan için saniyede 2 radyan kare hızlanırız. Durum uzayında bir yerden içeriye doğru bir oku takip etmeyi deneyin - başlangıçtaki koşullar ne olursa olsun, durum, saf ileri beslemeyle sonsuza kadar daire çizmek yerine :term:`referans` a yerleşecektir.
zh_cn: 要添加一些反馈，我们可以任意选择 :math:`\mathbf{K}` [2, 2]，其中摆的:term:`input` 是角加速度。这个K意味着对于每一个位置 :term:`error`弧度，角加速度是为2弧度每二次方秒；类似地，我们以2弧度每二次方秒的加速度对于每弧度每二次方秒的 :term:`error`。尝试从状态空间中的某个地方向内跟随箭头-无论初始条件如何，状态将稳定在:term:`reference`，而不是用纯粹的前馈无休止地循环。

source: Closed loop pendulum phase plot with reference at (pi/2, 0).
fr_ca: Diagramme de phase pendulaire en boucle fermée avec référence à (pi/2, 0).

source: But how can we choose an optimal :term:`gain` matrix K for our system? While we can manually choose :term:`gains <gain>` and simulate the system response or tune it on-robot like a PID controller, modern control theory has a better answer: the Linear-Quadratic Regulator (LQR).
es_mx: ¿Pero cómo podemos elegir una matriz K optima de :term:`ganancia` para nuestro sistema? Mientras podemos manualmente elegir las :term:`ganancias <gain>` y simular la respuesta del sistema o sintonizarlo en el robot como controlador PID, la teoría de control moderna tiene mejor respuesta: el Regulador Lineal Cuadrático (LQR, en inglés)
fr_ca: Mais comment choisir une matrice de :term:`gain` K optimale pour notre système? Alors que nous pouvons choisir manuellement les :term:`gains <gain>` et simuler la réponse du système ou l'ajuster sur le robot comme un contrôleur PID, la théorie de commande moderne a une meilleure réponse: le régulateur linéaire-quadratique (LQR).
tr_tr: Ancak, sistemimiz için bir optimal :terim:`kazanç` matrisi K'yi nasıl seçebiliriz? Manuel olarak şu seçimi yapabilsek de :terim:`<gain> kazanır` ve sistem yanıtını simüle edebilir veya bir PID kontrolörü gibi robot üzerinde ayarlayabilirken, modern kontrol teorisinin daha iyi bir cevabı var :Linear-Quadratic Regulator (LQR).
zh_cn: 但是我们如何为我们的系统选择一个最优的:term:`gain`矩阵K？虽然我们可以手动选择： :term:`gains 1` 并模拟系统响应或像PID控制器一样在机器人上对其进行调整，但现代控制理论有一个更好的答案：线性二次调节器（LQR）。

source: The Linear-Quadratic Regulator
es_mx: El Regulador Lineal Cuadrático
fr_ca: Le régulateur linéaire-quadratique
tr_tr: Linear-Quadratic Regulator / Doğrusal-Kuadratik Düzenleyici
zh_cn: 线性二次调节器

source: Because model-based control means that we can predict the future states of a system given an initial condition and future control inputs, we can pick a mathematically optimal :term:`gain` matrix :math:`\mathbf{K}`. To do this, we first have to define what a "good" or "bad" :math:`\mathbf{K}` would look like. We do this by summing the square of error and control input over time, which gives us a number representing how "bad" our control law will be. If we minimize this sum, we will have arrived at the optimal control law.
es_mx: Ya que el control basado en modelo significa que podemos predecir los futuros estados del sistema dada la condición inicial y las entradas de control futuras, podemos tomar una matriz matemática óptima de :term:`ganancia` :math:`\mathbf{K}`. Para hacer esto, primero tenemos que definir que tan "bien" o "mal" :math:`\mathbf{K}` se vería. Hacemos esto sumando el cuadrado del error y entrada de control con el paso del tiempo, que nos da un número representado que tan "mal" será nuestra ley de control. Si minimizamos la suma, llegaremos a la ley de control óptima.
fr_ca: Comme la commande basée sur un modèle signifie que nous pouvons prédire les états futurs d'un système étant données une condition initiale et des entrées de commande futures, nous pouvons choisir une matrice de :term:`gain` math:`\mathbf {K}` mathématiquement optimale. À cette fin, nous devons d'abord définir à quoi correspondrait une "bonne" ou "mauvaise" matrice :math:`\mathbf{K}`. Pour ce faire, nous additionnons dans le temps le carré de l'erreur et de l'entrée de commande, ceci nous donne un nombre représentant à quel point notre loi de contrôle sera "mauvaise". Si nous minimisons cette somme, nous arrivons à la loi de commande optimale recherchée.
tr_tr: Model tabanlı kontrol, bir başlangıç koşulu ve gelecekteki kontrol girdileri verilen bir sistemin gelecekteki durumlarını tahmin edebileceğimiz anlamına geldiğinden, matematiksel olarak en uygun olanı seçebiliriz :term:`gain` matrix :math:`\mathbf{K}`. Bunu yapmak için, önce "iyi" veya "kötü" nün neye benzeyeceğini tanımlamalıyız :math:`\mathbf{K}` . Bunu, hata karesini ve zaman içindeki kontrol girdisini toplayarak yaparız, bu da bize kontrol yasamızın ne kadar "kötü" olacağını gösteren bir sayı verir. Bu miktarı en aza indirirsek, optimal kontrol yasasına ulaşmış olacağız.
zh_cn: 因为基于模型的控制意味着我们可以在给定初始条件和未来控制输入的情况下预测系统的未来状态，所以我们可以选择数学上最优的:term:`gain` 矩阵:math:`\mathbf{K}`。要做到这一点，我们首先必须定义“好”或“坏”的:math:`\mathbf{K}` 会是什么样子。我们通过将误差平方和控制输入随时间的变化相加来做到这一点，这将给我们一个数字，表示我们的控制律有多“糟糕”。如果我们使这个和最小化，我们就得到了最优控制律。

source: LQR: Definition
es_mx: LQR: Definición
fr_ca: LQR: Définition
tr_tr: LQR: Tanım
zh_cn: LQR：定义

source: Linear-Quadratic Regulators work by finding a :term:`control law` that minimizes the following cost function, which weights the sum of :term:`error` and :term:`control effort` over time, subject to the linear :term:`system` dynamics :math:`\mathbf{\dot{x} = Ax + Bu}`.
es_mx: Los REguladores Lineales Cuadráticos funcionan encontrando la :term:`ley de control` que minimiza el siguiente función de costo , que pesa la suma del :term:`error` y :term:`esfuerzo de control` con el paso del tiempo, sujeta a la dinámica lineal del :term:`sistema` :math:`\mathbf{\dot{x} = Ax + Bu}`.
fr_ca: Les régulateurs linéaires-quadratiques fonctionnent en trouvant une :term:`loi de commande` qui minimise la fonction de coût suivante, qui pondère la somme de :term:`l’error` et de :term:`l’effort de commande` au fil du temps, soumis à la dynamique du :term:`système` linéaire :math:`\mathbf{\dot{x} = Ax + Bu}`.
tr_tr: Doğrusal Karesel Düzenleyiciler, aşağıdaki maliyet fonksiyonunu en aza indiren bir :term:``control-law / kontrol yasası`` bularak çalışır; bu, doğrusal :term:`system` dynamics :math:`\mathbf{\dot{x} = Ax + Bu}`a konu olan :term:`errors` ve :term:`control effort` nın toplamına ağırlık verir.
zh_cn: 线性二次型调节器的工作原理是找到一种 :term:`control law`，使下列成本函数最小，该函数随时间加权求:term:`error` 和 :term:`control effort` 的总和，服从线性系统:math:`\mathbf{\dot{x} = Ax + Bu}`。

source: The :term:`control law` that minimizes :math:`\mathbf{J}` can be written as :math:`\mathbf{u = K(r - x)}`, where :math:`r-x` is the :term:`error`.
es_mx: La :term:`ley de control` que minimiza :math:`\mathbf{J}` puede ser escrita como :math:`\mathbf{u = K(r - x)}`, donde :math:`r-x` es el :term:`error`.
fr_ca: La :term:`loi de commande` qui minimise :math:`\mathbf{J}` peut être écrite comme suit: :math:`\mathbf{u = K(r - x)}`, où :math:`r-x` est :term:`l’erreur`.
tr_tr: :math:`\mathbf{J}` yi en aza indiren :term:`kontrol yasası` şöyle yazılabilir :math:`\mathbf{u = K(r - x)}`, burada :math:`r-x`; :term:`error`dır.
zh_cn: 最小化 :math:`\mathbf{J}` 的:term:`control law` 可以写成 :math:`\mathbf{u = K(r - x)}`, 其中 :math:`r-x` 是 :term:`error`。

source: LQR design's :math:`\mathbf{Q}` and :math:`\mathbf{R}` matrices don't need discretization, but the :math:`\mathbf{K}` calculated for continuous-time and discrete time :term:`systems <system>` will be different.
es_mx: Las matrices de diseño :math:`\mathbf{Q}` y :math:`\mathbf{R}` de LQR no necesitan discretización, pero :math:`\mathbf{K}` calcula por tiempo continuo y discreto :term:`systems <system>` será diferente.
fr_ca: Les matrices :math:`\mathbf{Q}` et :math:`\mathbf{R}` d'un modèle n'ont pas besoin de discrétisation, mais les matrices :math:`\mathbf{K}` calculées pour les :term:`systèmes<system>` en temps continu et en temps discret seront différentes.
tr_tr: LQR tasarımının :math:`\mathbf{Q}` ve :math:`\mathbf{R}` matrisleri ayrıklaştırmaya ihtiyaç duymaz, ancak :math:`\mathbf{K}` sürekli zaman ve ayrık zaman için hesaplanır :term:`systems <sisemleri>` farklı olacaktır.
zh_cn: LQR设计的 :math:`\mathbf{Q}` 和 :math:`\mathbf{R}` 矩阵不需要离散化，但是为连续时间和离散时间:term:`systems 1` 计算的 :math:`\mathbf{K}` 将有所不同。

source: LQR: tuning
es_mx: LQR: Afinación
fr_ca: LQR: réglage
tr_tr: LQR: ayarlama
zh_cn: LQR: 调试

source: Like PID controllers can be tuned by adjusting their gains, we also want to change how our control law balances our error and input. For example, a spaceship might want to minimize the fuel it expends to reach a given reference, while a high-speed robotic arm might need to react quickly to disturbances.
es_mx: Como los controladores PID pueden ser afinados ajustando sus ganancias, también queremos cambiar como la ley de control balancea el error y la entrada. Por ejemplo, la nave puede querer minimizar el combustible que expande para alcanzar una referencia dada, mientras que un brazo robótico a alta velocidad puede necesitar reaccionar rápidamente a las alteraciones.
fr_ca: Tout comme les contrôleurs PID peuvent être réglés en ajustant leurs gains, nous voulons également changer la façon dont notre loi de commande équilibre notre erreur et notre entrée. Par exemple, un vaisseau spatial peut vouloir minimiser le carburant qu'il dépense pour atteindre une référence donnée, tandis qu'un bras robotique à grande vitesse peut avoir besoin de réagir rapidement aux perturbations.
tr_tr: PID kontrolörlerinin kazançlarını değiştirilerek ayarlanabildiği gibi, kontrol yasamızın hatamızı ve girdimizi nasıl dengelediğini de değiştirmek istiyoruz. Örneğin, bir uzay gemisi belirli bir referansa ulaşmak için harcadığı yakıtı en aza indirmek isteyebilirken, yüksek hızlı bir robotik kolun bozulmalara hızlı tepki vermesi gerekebilir.
zh_cn: 就像可以通过调节PID增益来调整PID控制器一样，我们也想改变控制律平衡误差和输入的方式。例如，一艘太空船可能希望将其消耗的燃料减至最小，以达到给定的参考值，而高速机械臂可能需要对干扰做出快速反应。

source: We can weight error and control effort in our LQR with :math:`\mathbf{Q}` and :math:`\mathbf{R}` matrices. In our cost function (which describes how "bad" our control law will perform), :math:`\mathbf{Q}` and :math:`\mathbf{R}` weight our error and control input relative to each other. In the spaceship example from above, we might use a :math:`\mathbf{Q}` with relatively small numbers to show that we don't want to highly penalize error, while our :math:`\mathbf{R}` might be large to show that expending fuel is undesirable.
es_mx: Podemos pesar el esfuerzo del error y control de nuestro LQR con las matrices :math:`\mathbf{Q}` y :math:`\mathbf{R}`. En nuestra función de costo (que describe que tan "mal" nuestra ley de control actuará), :math:`\mathbf{Q}` y :math:`\mathbf{R}` pesa nuestro error y entrada de control relativo a cada uno. En nuestro ejemplo del cohete de arriba, podemos usar :math:`\mathbf{Q}` con números relativamente pequeños para mostrar que no queremos penalizar altamente el error, mientras
fr_ca: Nous pouvons pondérer l'erreur et contrôler l'effort dans notre modèle LQR avec les matrices :math:`\mathbf{Q}` et :math:`\mathbf{R}`. Dans notre fonction de coût (qui décrit la "mauvaise" performance de notre loi de commande), :math:`\mathbf{Q}` et :math:`\mathbf{R}` pondèrent notre erreur et les entrées de commande l'une par rapport à l'autre. Dans l'exemple de vaisseau spatial ci-dessus, nous pourrions utiliser une matrice :math:`\mathbf{Q}` avec des valeurs relativement faibles pour montrer que nous ne voulons pas pénaliser fortement l'erreur, tandis que notre :math:`\mathbf{R}` pourrait être élevée pour montrer que dépenser du carburant n'est pas souhaitable.
tr_tr: LQR'mizdeki hata ve kontrol çabasını :math:`\mathbf{Q}` ve :math:`\mathbf{R}` matrisleriyle ağırlıklandırabiliriz. Maliyet fonksiyonumuzda (kontrol yasamızın ne kadar "kötü" performans göstereceğini açıklar), :math:`\mathbf{Q}` ve :math:`\mathbf{R}`, hatamızı ve kontrol girdimizi birbirine göre ağırlıklandırır. Yukarıdaki uzay gemisi örneğinde, hatayı çok fazla cezalandırmak istemediğimizi göstermek için nispeten küçük sayılarla :math:`\ mathbf{Q}` kullanabiliriz, oysa :math:`\mathbf{R}` yakıt harcamanın istenmeyen olduğunu göstermek için büyük olabilir.
zh_cn: 我们可以使用 :math:`\mathbf{Q}` 和 :math:`\mathbf{R}` 矩阵在LQR中加权错误并控制工作量。在我们的成本函数（描述了控制律将如何“糟糕”地执行）中， :math:`\mathbf{Q}` 和 :math:`\mathbf{R}` 分别权衡我们的误差和控制输入。在上面的飞船示例中，我们可以使用带有相对较小数字的:math:`\mathbf{Q}` 来表明我们不想过度影响误差，而我们的 :math:`\mathbf{R}`可能很大，表明燃料消耗是不可取的。
