Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-flywheel-walkthrough.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: State-Space Controller Walkthrough
es_mx: Tutorial de Controlador de Estado-Espacio
fr_ca: Description de l'espace-état d'un controleur
tr_tr: State-Space Kontrolörü Çözüm Yolu
zh_cn: 状态空间控制器演练

source: Before following this tutorial, readers are recommended to have read an :ref:`docs/software/advanced-controls/state-space/state-space-intro:Introduction to state-space control`.
es_mx: Antes de seguir este tutorial, se recomienda que los lectores hayan leído :ref:`docs/software/advanced-controls/state-space/state-space-intro:Introduction to state-space control`.
fr_ca: Avant de poursuivre la lecture de ce didacticiel, il est recommandé aux lecteurs d’avoir pris connaissance du document :ref:`docs/software/advanced-controls/state-space/state-space-intro:Introduction to state-space control`.
tr_tr: Bu öğreticiyi izlemeden önce, okuyucuların bir durum-uzay kontrolüne girişi okumaları önerilir :ref:`docs/software/advanced-controls/state-space/state-space-intro:Introduction to state-space control`
zh_cn: 建议您在阅读本教程之前阅读:ref:`docs/software/advanced-controls/state-space/state-space-intro:Introduction to state-space control`。

source: The goal of this tutorial is to provide "end-to-end" instructions on implementing a state-space controller for a flywheel. By following this tutorial, readers will learn how to:
es_mx: La meta de este tutorial es proveer "de principio a fin" instrucciones para implementar el controlador de estado-espacio para un volante. Siguiendo este tutorial, los lectores podrán aprender a hacer:
fr_ca: L’objectif de ce didacticiel est de fournir des instructions de "bout à bout" sur la mise en œuvre dans l'espace d'état d’un contrôleur pour un volant d'inertie. En parcourant ce didacticiel, les lecteurs apprendront à:
tr_tr: Bu öğreticinin amacı, bir volan için bir durum-uzay kontrolörünün uygulanmasına ilişkin "uçtan uca" talimatlar sağlamaktır. Bu öğreticiyi takip ederek okuyucular şunları öğreneceklerdir:
zh_cn: 本教程的目的是提供有关为飞轮实现状态空间控制器的“端到端”指令。遵循本教程，读者将学习如何：

source: Create an accurate state-space model of a flywheel using :term:`system identification` or CAD software.
es_mx: Crear un modelo de estado-espacio preciso de un volante usando :term:`system identification` o software CAD.
fr_ca: Créer un modèle espace-état précis d’un volant d'inertie à l'aide de :term:`l’identification de système` ou d'un logiciel CAO.
tr_tr: :term:`system identification` kullanarak veya CAD yazılımı kullanarak bir çakın doğru durum-uzay modelini oluşturun.
zh_cn: 使用:term:`system identification`或CAD软件创建飞轮的准确状态空间模型。

source: Implement a Kalman Filter to filter encoder velocity measurements without lag.
es_mx: Implementar un Filtro Kalman para filtrar las mediciones de velocidad del encoder sin retraso.
fr_ca: Implémenter un filtre de Kalman pour filtrer les mesures de vitesse de l’encodeur sans décalage.
tr_tr: Enkoder hızı ölçümlerini gecikmeden filtrelemek için bir Kalman Filtresi uygulayın.
zh_cn: 实现卡尔曼滤波器以无延迟地过滤编码器速度测量值。

source: Implement a :ref:`LQR <docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator>` feedback controller which, when combined with model-based feedforward, will generate voltage :term:`inputs <input>` to drive the flywheel to a :term:`reference`.
es_mx: Implementar un controlador de retroalimentación :ref:`LQR <docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator>` que, cuando lo combinamos con uno de feedforward basado en modelo, generará :term:`inputs 1<input>` de voltaje para manejar el volante a una :term:`reference`.
fr_ca: implémenter une commande :ref:`LQR <docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator>` de rétroaction qui, lorsqu’elle est combinée avec le modèle de commande prédictive, générera les tensions :term:`d’entrée <input>` afin de conduire le volant d'inertie à la :term:`référence`.
tr_tr: Bir :ref:`LQR <docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator>` geri besleme denetleyicisi uygulayın; bu, model tabanlı ileri besleme ile birleştirildiğinde, çarkı a :term:`reference` "referans" a sürmek için voltaj :term:`inputs <input>` oluşturur.
zh_cn: 实现一个 :ref:`LQR <docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator>`反馈控制器，该反馈控制器与基于模型的前馈结合时将产生电压 :term:`inputs 1`，来驱动飞轮到:term:`reference`。

source: This tutorial is intended to be approachable for teams without a great deal of programming expertise. While the WPILib library offers significant flexibility in the manner in which its state-space control features are implemented, closely following the implementation outlined in this tutorial should provide teams with a basic structure which can be reused for a variety of state-space systems.
es_mx: Este tutorial tiene el propósito de ser alcanzable para los equipos sin experiencia en programación o buen manejo de ella. Mientras que la librería de WPILib ofrece cierta flexibilidad en el modo que las características del control de estado-espacio son implementadas, siguen de cerca la implementación descrita en este tutorial debe dar a los equipos una estructura base que pueda ser reusada para sistemas variados de estado-espacio.
fr_ca: Ce tutoriel se veut être simple pour faciliter la tâche aux équipes n'ayant pas beaucoup d’expertise en programmation. Bien que la bibliothèque WPILib offre une flexibilité significative dans la manière dont ses fonctionnalités de contrôle dans l’espace d’état sont implémentées, parcourir attentivement l'implémentation décrite dans ce didacticiel devrait fournir aux équipes une structure de base qui peut être réutilisée pour une variété de systèmes espace-état.
tr_tr: Bu öğretici, çok fazla programlama uzmanlığı olmayan ekipler için ulaşılabilir olması amaçlanmıştır. WPILib kitaplığı, durum-uzay kontrol özelliklerinin uygulanma biçiminde önemli bir esneklik sunarken, bu eğitimde ana hatları verilen uygulamayı yakından takip etmek, ekiplere çeşitli durum-uzay sistemleri için yeniden kullanılabilecek temel bir yapı sağlamalıdır.
zh_cn: 本教程适用于没有大量编程专业知识的团队。虽然WPILib库在实现其状态空间控制功能的方式上提供了显着的灵活性，但是紧跟本教程中概述的实现方式，应该为团队提供可以在各种状态空间系统中重用的基本结构。

source: The full example is available in the state-space flywheel (`Java <https://github.com/wpilibsuite/allwpilib/blob/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel/Robot.java>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/master/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel/cpp/Robot.cpp>`__) and state-space flywheel system identification (`Java <https://github.com/wpilibsuite/allwpilib/blob/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheelsysid/Robot.java>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/master/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheelSysId/cpp/Robot.cpp>`__) example projects.
es_mx: Los ejemplos completos están disponibles en el flywheel de estado-espacio (`Java <https://github.com/wpilibsuite/allwpilib/blob/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel/Robot.java>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/master/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel/cpp/Robot.cpp>`__) y de identificación del sistema del volante de estado-espacio (`Java <https://github.com/wpilibsuite/allwpilib/blob/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheelsysid/Robot.java>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/master/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheelSysId/cpp/Robot.cpp>`__) proyectos de ejemplo.

source: Why Use State-Space Control?
es_mx: ¿Por qué usar Control de Estado-Espacio?
fr_ca: Pourquoi utiliser le contrôle espace-état ?
tr_tr: State-Space Control-Durum Uzayı Kontrolü Neden Kullanılır?
zh_cn: 为什么要使用状态空间控制？

source: Because state-space control focuses on creating an accurate model of our system, we can accurately predict how our :term:`model` will respond to control :term:`inputs <input>`. This allows us to simulate our mechanisms without access to a physical robot, as well as easily choose :term:`gains <gain>` that we know will work well. Having a model also allows us to create lagless filters, such as Kalman Filters, to optimally filter sensor readings.
es_mx: Porque el control de estado-espacio se enfoca en crear un modelo preciso de nuestro sistema, podemos predecir de manera certera como el :term:`modelo` responderá para controlar :term:`entradas <input>`. Esto nos permite simular nuestros mecanismos sin acceso al robot físico, como bien escoger fácilmente las :term:`ganancias <gain>` que sabemos que trabajarán bien. Teniendo un modelo también nos permite crear filtros sin retrasos, como los Filtros Kalman, para filtrar óptimamente las lecturas del sensor.
fr_ca: Étant donné que la commande de l’espace-état se concentre sur la création d’un modèle précis de notre système, nous pouvons adéquatement prédire comment notre :term:`modèle` va répondre aux :term:`entrées <input>` des commandes. Cela nous permet de simuler nos mécanismes sans accès à un robot physique, ainsi que de choisir facilement les :term:`gains <gain>` que nous savons parfaitement fonctionnels. Avoir un modèle nous permet également de créer des filtres sans retard, comme les filtres de Kalman, pour filtrer de manière optimale les signaux obtenus à partir des capteurs.
tr_tr: State-Space Control-Durum-uzay kontrolü, sistemimizin doğru bir modelini oluşturmaya odaklandığından, :term:`model` will respond to control :term:`inputs 1` e nasıl tepki vereceğini doğru bir şekilde tahmin edebiliriz. Bu, mekanizmalarımızı fiziksel bir robota erişim olmadan simüle etmemize ve aynı zamanda kolayca seçim yapmamıza olanak tanır :term:`gains <gain>` iyi çalışacağını bildiğimiz kazançlardır. Bir modele sahip olmak, sensör okumalarını en iyi şekilde filtrelemek için Kalman Filtreleri gibi gecikmesiz filtreler oluşturmamıza da olanak tanır.
zh_cn: 因为状态空间控制关注于创建系统的精确模型，所以我们可以准确地预测:term:`model` 将如何响应控制 :term:`inputs 1`。这允许我们在不接触物理机器人的情况下模拟我们的机制，以及轻松地选择我们知道将有效的 :term:`gains 2`。拥有模型还可以使我们创建无滞后的滤波器，例如卡尔曼滤波器，以最佳地过滤传感器读数。

source: Modeling Our Flywheel
es_mx: Modelando Nuestro Flywheel
fr_ca: Modélisation de notre volant d'inertie
tr_tr: Flywheel-Volanımızın Modellenmesi
zh_cn: 飞轮建模

source: :ref:`Recall <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` that continuous state-space systems are modeled using the following system of equations:
es_mx: :ref:`Recuerde <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` que el sistema continuo de estado-espacio son modelados usando el siguiente sistema de ecuaciones:
fr_ca: :ref:`Rappelons <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` que les systèmes continus espace-état sont modélisés à l’aide du système d’équations suivant:
tr_tr: :ref: `Recall <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` sürekli durum uzay sistemlerinin aşağıdaki denklem sistemi kullanılarak modellendiğini hatırlayın:
zh_cn: :ref:`Recall <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` 连续状态空间系统是使用以下方程组建模的：

source: Where :term:`x-dot` is the rate of change of the :term:`system`'s :term:`state`, :math:`\mathbf{x}` is the system's current state, :math:`\mathbf{u}` is the :term:`input` to the system, and :math:`\mathbf{y}` is the sytem's :term:`output`.
es_mx: Donde el :term:`punto-x` es la velocidad de cambio del :term:`estado` del :term:`sistema`, :math:`\mathbf{x}` es el estado actual del sistema, :math:`\mathbf{u}` es la :term:`entrada` al sistema, y :math:`\mathbf{y}` es la :term:`salida` del sistema.
tr_tr: Nerede :term:`x-dot` , :term:`system`' nin değişim oranıdır :term:`state`, :math:`\mathbf{x}` sistemin mevcut durumu, :math:`\mathbf{u}` , sisteme :term:`input` ve :math:`\mathbf{y}`, sistemin :term:`output`. dır.

source: Let's use this system of equations to model our flywheel in two different ways. We'll first model it using :term:`system identification` using the frc-characterization toolsuite, and then model it based on the motor and flywheel's :term:`moment of inertia`.
es_mx: Vamos a usar este sistema de ecuaciones para modelar nuestro volante en dos maneras diferentes. Primero lo modelaremos usando una :term:`identificación de sistema` usando la frc-characterization toolsuite, y después lo modelamos basándonos en el :term:`momento de inercia` del motor y el volante.
tr_tr: Volanımızı iki farklı şekilde modellemek için bu denklem sistemini kullanalım. Önce frc-karakterizasyon araç takımını kullanarak :term:`system identification` kullanarak modelleyeceğiz ve ardından bunu motor ve volanın :term:`moment of inertia`, temelinde modelleyeceğiz.

source: The first step of building up our state-space system is picking our system's states. We can pick anything we want as a state -- we could pick completely unrelated states if we wanted -- but it helps to pick states that are important. We can include :term:`hidden states <hidden state>` in our state (such as elevator velocity if we were only able to measure its position) and let our Kalman Filter estimate their values. Remember that the states we choose will be driven towards their respective :term:`references <reference>` by the feedback controller (typically the :ref:`Linear-Quadratic Regulator <docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator>` since it's optimal).
es_mx: El primer paso para construir nuestro sistema estado-espacio es elegir nuestros estados del sistema. Podemos elegir cualquiera que queramos como estado -- podemos elegir estados completamente diferentes si queremos -- pero ayudará si elegimos estados que son importantes. Podemos incluir :term:`estados ocultos <hidden state>` en nuestro estado (como la velocidad del elevador si solo podemos medir su posición) y dejar al Filtro Kalman estimar sus valores. Recuerda que los estados que elegimos serán conducidos hacia sus respectivas :term:`referencias <reference>` por el controlador de retroalimentación (normalmente el :ref:`Regulador Lineal Cuadrático <docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator>` ya que es el óptimo).
fr_ca: La première étape de la construction de notre système espace-état est de choisir les états de notre système. Nous pouvons choisir tout ce que nous voulons comme état -- nous pourrions choisir des états complètement indépendants si nous le voulions -- mais il est préférable de choisir les états qui sont importants. Nous pouvons inclure les :term:`états cachés <hidden state>` dans notre état (comme la vitesse d’un élevateur si nous n’étions pas en mesure d'en mesurer la position) et laisser à notre filtre de Kalman le soin d'estimer leurs valeurs. N’oublions pas que les états que nous choisissons seront ramenés à leurs :term:`références <reference>` respectives à l'aide d'un contrôleur rétroactif (typiquement le :ref:`Régulateur Linéaire-Quadratique <docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator>` car il est optimal).
tr_tr: Durum uzayı sistemimizi oluşturmanın ilk adımı, sistemimizin durumlarını seçmektir. Devlet olarak istediğimiz her şeyi seçebiliriz - istersek tamamen ilgisiz durumları seçebiliriz - ama önemli olan durumları seçmeye yardımcı olur. Bizim durumumuzdaki :term:`hidden states <hidden state>` ifadesini dahil edebiliriz (sadece konumunu ölçebilseydik asansör hızı gibi) ve Kalman Filtremizin değerlerini tahmin etmesine izin verebiliriz. Seçtiğimiz durumların, geribildirim denetleyicisi tarafından ilgili :term:`references <reference>` e doğru yönlendirileceğini unutmayın (tipik olarak : ref:` Doğrusal Karesel Düzenleyici <docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator>`, çünkü optimaldir).
zh_cn: 建立状态空间系统的第一步是选择系统的状态。我们可以选择任何想要的状态——如果需要，我们可以选择完全不相关的状态——但是选择重要的状态是有帮助的。我们可以在我们的状态中包含 :term:`hidden states 1` (比如电梯速度，如果我们只能测量它的位置)，并让卡尔曼滤波器估计它们的值。记住，我们选择的状态将被反馈控制器(通常是:ref:`Linear-Quadratic Regulator <docs/software/advanced-controls/state-space/state-space-intro:The Linear-Quadratic Regulator>`，因为它是最优的) 驱动到它们各自的 :term:`references 2`。

source: For our flywheel, we care only about one state: its velocity. While we could chose to also model its acceleration, the inclusion of this state isn't necessary for our system.
es_mx: Para nuestro volante, solo nos importa un estado: su velocidad. Mientras que podamos elegir también modelar su aceleración, incluir este estado no es necesario para nuestro sistema.
fr_ca: Pour notre volant d'inertie, nous ne nous soucions que d’un seul état: sa vitesse. Alors que nous pourrions également choisir de modéliser son accélération, la prise en charge de cet état n’est pas nécessaire pour notre système.
tr_tr: Volanımız için yalnızca tek bir durumu önemsiyoruz : hızı. İvmesini de modellemeyi seçebilirken, bu durumun dahil edilmesi sistemimiz için gerekli değildir.
zh_cn: 对于飞轮，我们只关心一种状态：它的速度。尽管我们可以选择对其加速进行建模，但是对于我们的系统而言，不需要包含此状态。

source: Next, we identify the :term:`inputs <input>` to our system. Inputs can be thought of as things we can put "into" our system to change its state. In the case of the flywheel (and many other single-jointed mechanisms in FRC), we have just one input: voltage applied to the motor. By choosing voltage as our input (over something like motor duty cycle), we can compensate for battery voltage sag as battery load increases.
es_mx: Después, identificamos las :term:`entradas <input>` a nuestro sistema. Las entradas pueden ser pensadas como cosas que podemos poner "en" nuestro sistema para cambiar su estado. En el caso del volante (y muchos otros mecanismos de una articulación en FRC), tenemos solo una entrada: voltaje aplicado al motor. Escogiendo el voltaje como nuestra entrada (sobre algo como el ciclo de trabajo del motor), podemos compensar por la caída del voltaje de la batería como aumentar la carga de la batería.

source: A continuous-time state-space system writes :term:`x-dot`, or the instantaneous rate of change of the system's :term:`system`\'s state, as proportional to the current :term:`state` and :term:`inputs <input>`. Because our state is angular velocity, :math:`\mathbf{\dot{x}}` will be the flywheel's angular acceleration.
es_mx: Un sistema de tiempo continuo de estado-espacio escribe :term:`x-dot`, o la velocidad instantánea de cambio del :term:`sistema`\ estado del sistema, proporcional al :term:`estado` actual y las :term:`entradas <input>`. Porque nuestro estado es velocidad angular, :math:`\mathbf{\dot{x}}` va a ser la aceleración angular del volante.
fr_ca: Un système espace-état en temps continu écrit :term:`x-point`, ou le taux de variation instantané de l'état du :term:`système`, comme proportionnel à :term:`l’état` actuel et ses :term:`entrées<input>`. Puisque notre état est la vitesse angulaire, :math:`\mathbf{\dot{x}}` sera l’accélération angulaire du volant d'inertie.
tr_tr: Sürekli zaman durum-uzay sistemi şunu yazar :term:`x-dot` veya sistemin :term:`system`\' durumunun anlık değişim oranı, şu anki :term:`state` ile orantılı olarak ve :term:`inputs<input>'. Durumumuz açısal hız olduğundan, :math:`\mathbf{\dot{x}}` volanın açısal ivmesi olacaktır.
zh_cn: 连续时间状态空间系统将 :term:`x-dot`或:term:`system`\'s状态的瞬时变化率，与:term:`state` 和 :term:`inputs 1` 成正比。因为我们的状态是角速度，:math:`\mathbf{\dot{x}}` 将是飞轮的角加速度。

source: Next, we will model our flywheel as a continuous-time state-space system. WPILib's ``LinearSystem`` will convert this to discrete-time internally. Review :ref:`state-space notation <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` for more on continuous-time and discrete-time systems.
es_mx: Después, modelaremos nuestro volante como un sistema de tiempo continuo de estado-espacio. ``LinearSystem`` de WPILib convertirá este tiempo discreto internamente. Repase :ref:`notación de estado-espacio <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` para más sistemas de tiempo continuo y discreto.
fr_ca: Ensuite, nous allons modéliser notre volant d'inertie comme un système espace-état en temps continu. Le ``LinearSystem`` de WPILib convertira ce système en temps discret selon un mécanisme interne. Relisez :ref:`la notation espace-état <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` pour en savoir d'avantage sur les systèmes en temps continu et en temps discret.
tr_tr: Daha sonra, çarkımızı sürekli zaman durum-uzay sistemi olarak modelleyeceğiz. WPILib'in ``LinearSystem``' sistemi bunu dahili olarak ayrık zamana dönüştürecektir. Gözden geçirme : ref: "durum uzayı gösterimi <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>``, sürekli zamanlı ve ayrık zamanlı sistemler hakkında daha fazla bilgi için.
zh_cn: 接下来，我们将把飞轮建模为一个连续时间状态空间系统。WPILib的线性系统将在内部将其转换为离散时间。回顾更多关于连续时间和离散时间系统的:ref:`state-space notation <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` 。

source: Modeling with System Identification
es_mx: Modelando con Identificación de Sistema
fr_ca: Modélisation par identification du système
tr_tr: Sistem Tanımlama ile Modelleme
zh_cn: 使用系统识别建模

source: To rewrite this in state-space notation using :term:`system identification`, we recall from the flywheel :ref:`state-space notation example <docs/software/advanced-controls/state-space/state-space-intro:State-space Notation Example: Flywheel from kV and kA>`, where we rewrote the following equation in terms of :math:`\mathbf{a}`.
es_mx: Para reescriir en notación de estado-espacio usando :term:`identificación de sistema`, nosotros volvemos a llamar desde el volante :ref:`ejemplo de notación de estado-espacio <docs/software/advanced-controls/state-space/state-space-intro:State-space Notation Example: Flywheel from kV and kA>`, donde reescribiremos la siguiente ecuación en terminos de :math:`\mathbf{a}`.
fr_ca: Pour reformuler ceci dans la notation espace-état en faisant usage de :term:`l’idenfication de système`, en nous rappelant du volant d'inertie :ref:`exemple de notation espace-état <docs/software/advanced-controls/state-space/state-space-intro:State-space Notation Example: Flywheel from kV and kA>`, où nous re-écrivons l'équation suivante en fonction de :math:`\mathbf{a}`.
tr_tr: Bunu durum uzayı gösteriminde :term:`system identification` kullanarak yeniden yazmak için , :ref:`state-space notation example <docs/software/advanced-controls/state-space/state-space-intro:State-space Notation Example: Flywheel from kV and kA>` volan örneğini tekrar hatırlıyoruz, burada aşağıdaki denklemi şu terimlerle yeniden yazdık :math:`\mathbf{a}`
zh_cn: 为了使用系统标识将其重写为状态空间符号，我们从 :ref:`state-space notation example <docs/software/advanced-controls/state-space/state-space-intro:State-space Notation Example: Flywheel from kV and kA>`示例中进行回顾，其中我们用 :math:`\mathbf{a}`重写了以下等式。
