Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-flywheel-walkthrough.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Where :math:`\mathbf{v}` is flywheel velocity, :math:`\mathbf{a}` and :math:`\mathbf{\dot{v}}` are flywheel acceleration, and :math:`V` is voltage. Rewriting this with the standard convention of :math:`\mathbf{x}` for the state vector and :math:`\mathbf{u}` for the input vector, we find:
es_mx: Donde :math:`\mathbf{v}` es la velocidad del volante, :math:`\mathbf{a}` y :math:`\mathbf{\dot{v}}` son la aceleración del volante, y :math:`V` es el voltaje. Reescribiendo esto como la convención estándar de :math:`\mathbf{x}` para el vector del estado y :math:`\mathbf{u}` para el vector de entrada, encontramos:
fr_ca: Où :math:`\mathbf{v}` est la vitesse du volant d'inertie, :math:`\mathbf{a}` et :math:`\mathbf{\dot{v}}` sont l'accélération de la roue d'inertie, et :math:`V` est la tension. En reformulant ce qui précède selon la représentation conventionnelle :math:`\mathbf{x}` pour le vecteur d'état et :math:`\mathbf{u}` pour le vecteur d'entrée, nous trouvons:
tr_tr: Burada:math:`\mathbf{v}` , volan hızıdır,:math:`\mathbf{a}` ve:math:`\mathbf{\dot{v}}`, volan ivmesidir ve :math:`V` voltajdır. Bunu, durum vektörü için standart :math:`\mathbf{x}` ve giriş vektörü için : math:`\ mathbf {u}` standart kuralıyla yeniden yazarak şunu buluruz:
zh_cn: 其中:math:`\mathbf{v}` 为飞轮速度，:math:`\mathbf{a}`和:math:`\mathbf{\dot{v}}` 为飞轮加速度， :math:`V` 为电压。用 :math:`\mathbf{x}` 的标准约定重写此状态向量，用:math:`\mathbf{u}`的标准约定重写输入向量，我们发现:

source: The second part of state-space notation relates the system's current :term:`state` and :term:`inputs <input>` to the :term:`output`. In the case of a flywheel, our output vector :math:`\mathbf{y}` (or things that our sensors can measure) is our flywheel's velocity, which also happens to be an element of our :term:`state` vector :math:`\mathbf{x}`. Therefore, our output matrix is :math:`\mathbf{C} = \begin{bmatrix}1 \end{bmatrix}`, and our system feedthrough matrix is :math:`\mathbf{D} = \begin{bmatrix}0 \end{bmatrix}`. Writing this out in continuous-time state-space notation yields the following.
es_mx: La segunda parte de la notación de estado-espacio relata que el :term:`estado` actual del sistema y :term:`entradas <input>` a la :term:`salida`. En caso de un volante, nuestro vector de salida :math:`\mathbf{y}` (o cosas que pueda medir un sensor) es la velocidad de nuestro volante, que también resulta ser un elemento de nuestro vector de :term:`estado` :math:`\mathbf{x}`. Por lo tanto, nuestra matriz de salida es :math:`\mathbf{C} = \begin{bmatrix}1 \end{bmatrix}`, y nuestra matriz de sistema de alimentación es :math:`\mathbf{D} = \begin{bmatrix}0 \end{bmatrix}`. Escribiendo esto en notación de estado-espacio con tiempo continuo produce lo siguiente.
fr_ca: La deuxième partie de la notation espace-état relie les termes actuels du système :term:`état` et :term:`entrées<input>` à la :term:`sortie`. Dans le cas d’un volant d'inertie, notre vecteur de sortie :math:`\mathbf{y}` (ou toute autre grandeur que nos capteurs peuvent mesurer) est la vitesse de notre volant d'inertie, qui se trouve également être un élément de notre vecteur :term:`d’état` :math:`\mathbf{x}`. Par conséquent, notre matrice de sortie est :math:`\mathbf{C} = \begin{bmatrix}1 \end{bmatrix}`, et notre matrice du système de la traversée est :math:`\mathbf{D} = \begin{bmatrix}0 \end{bmatrix}`. En reformulant ce qui précède selon la notation espace-état en temps continu conduit au résultat suivant.
tr_tr: Durum uzayı notasyonunun ikinci bölümü, sistemin o anki :term:``state`` ve :term:`girdileri <input>` ile :term:`output` ile ilişkilidir. Bir volan durumunda, çıktı vektörümüz :math:`\mathbf{y}` (veya sensörlerimizin ölçebildiği şeyler) volanımızın hızıdır ve bu da bizim :term:`state` :math:`\mathbf{x}` vektörümüzün bir unsuru olur . Bu nedenle, çıktı matrisimiz :math:`\mathbf{C} = \begin{bmatrix}1 \end{bmatrix}` ve sistem besleme matrisimiz :math:`\mathbf{D} = \begin{bmatrix}0 \end{bmatrix}` olur. Bunu sürekli zaman durum uzayı gösteriminde yazmak aşağıdakileri verir.
zh_cn: 状态空间符号的第二部分将系统的当前 :term:`state`和:term:`inputs 1` 与 :term:`output`联系起来。对于飞轮，我们的输出向量:math:`\mathbf{y}`(或者传感器可以测量的东西)是飞轮的速度，它也是 :term:`state`向量:math:`\mathbf{x}`的一个元素，因此，我们的输出矩阵是 :math:`\mathbf{C} = \begin{bmatrix}1 \end{bmatrix}`，系统馈通矩阵是:math:`\mathbf{D} = \begin{bmatrix}0 \end{bmatrix}`。用连续时间状态空间符号写出这个结果。

source: The ``LinearSystem`` class contains methods for easily creating state-space systems identified using :term:`system identification`. This example shows a flywheel model with a kV of 0.023 and a kA of 0.001:
es_mx: La clase ``LinearSystem`` contiene métodos para crear fácilmente sistemas de estado-espacio identificados usando :term:`system identification`. Este ejemplo muestra un modelo de volante con un kV de 0.023 y un kA de 0.001:
fr_ca: La classe ``LinearSystem`` contient des méthodes permettant de créer facilement des systèmes espace-état identifiés à l’aide de la méthode :term:`d’identification de système`. Cet exemple montre un modèle volant d'inertie avec un kV de 0.023 et un kA de 0.001 :
tr_tr: ``LinearSystem`` sınıfı, şu şekilde tanımlanmış durum uzayı sistemlerini kolayca oluşturmak için yöntemler içerir :term:`system identification`. Bu örnek, kV değeri 0,023 ve kA değeri 0,001 olan bir volan modelini göstermektedir:
zh_cn: “线性系统”类包含容易创建使用 :term:`system identification`的状态空间系统的方法。这个例子展示了一个kV为0.023 kA为0.001的飞轮模型:

source: Modeling Using Flywheel Moment of Inertia and Gearing
es_mx: Modelando Usando el Volante con Momento de Inercia y Engranaje
fr_ca: Modélisation à l’aide du moment d'inertie du volant d'inertie et de l'engrenage.
tr_tr: Volan Atalet Momenti ve Dişli Kullanarak Modelleme
zh_cn: 利用飞轮的惯性矩和齿轮传动进行建模

source: A flywheel can also be modeled without access to a physical robot, using information about the motors, gearing and flywheel's :term:`moment of inertia`. A full derivation of this model is presented in Section 8.2.1 of `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__.
es_mx: Un volante también puede ser modelado sin el acceso a un robot físico, usando información sobre los motores, engranes y el :term:`momento de inercia` del volante. Una derivación completa de este modelo se presenta en la Sección 8.2.1 de `Controles de Ingeniería en FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__.
fr_ca: Un volant d'inertie peut également être modélisé sans avoir accès à un robot physique, en utilisant des informations sur les moteurs, l’engrenage et le volant d'inertie :term:`moment d'inertie`. Une dérivation complète de ce modèle est présentée dans la Section 8.2.1 du document `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__.
tr_tr: Bir volan ayrıca, motorlar, dişliler ve volan hakkındaki bilgiler kullanılarak fiziksel bir robota erişim olmaksızın modellenebilir :term:`moment of inertia`. Bu modelin tam bir türevi, `Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`__. 'de Kontrol Mühendisliği Bölüm 8.2.1'de sunulmuştur.
zh_cn: 利用电机、传动装置和飞轮 :term:`moment of inertia`的信息，飞轮也可以在不接触实体机器人的情况下进行建模。在`Controls Engineering in FRC <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`8.2.1节中给出了该模型的完整推导。

source: The ``LinearSystem`` class contains methods to easily create a model of a flywheel from the flywheel's motors, gearing and :term:`moment of inertia`. The moment of inertia can be calculated using CAD software or using physics. The examples used here are detailed in the flywheel example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/3b283ab9aaf9d23d7870b9c3723d03760a0bd378/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/3b283ab9aaf9d23d7870b9c3723d03760a0bd378/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel/cpp/Robot.cpp>`__).
es_mx: La clase ``LinearSystem`` contiene métodos para crear fácilmente un modelo de un volante desde los motores, engranes y :term:`momento de inercia` del volante. El momento de inercia puede ser calculado usado el software CAD o usando física. Los ejemplos utilizados aquí están detallados en el proyecto de ejemplo del volante (`Java <https://github.com/wpilibsuite/allwpilib/tree/3b283ab9aaf9d23d7870b9c3723d03760a0bd378/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/3b283ab9aaf9d23d7870b9c3723d03760a0bd378/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel/cpp/Robot.cpp>`__).
fr_ca: La classe ``LinearSystem`` contient des méthodes pour créer facilement un modèle de volant d'inertie à partir de ses moteurs, de l’engrenage et du :term:`moment d'inertie`. Le moment d’inertie peut être calculé à l’aide d’un logiciel CAO ou en utilisant la physique du système. Les exemples utilisés ici sont détaillés dans le projet d’exemple du volant d'inertie (`Java <https://github.com/wpilibsuite/allwpilib/tree/3b283ab9aaf9d23d7870b9c3723d03760a0bd378/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/3b283ab9aaf9d23d7870b9c3723d03760a0bd378/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel/cpp/Robot.cpp>`__).
tr_tr: ``LinearSystem`` sınıfı, volanın motorlarından, dişlilerinden ve :term:``atalet momenti-moment of inertia`` nden kolayca bir volan modeli oluşturmak için yöntemler içerir. Eylemsizlik momenti, CAD yazılımı veya fizik kullanılarak hesaplanabilir. Burada kullanılan örnekler, volan örnek projesinde (`Java <https://github.com/wpilibsuite/allwpilib/tree/3b283ab9aaf9d23d7870b9c3723d03760a0bd378/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/3b283ab9aaf9d23d7870b9c3723d03760a0bd378/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel/cpp/Robot.cpp>`__) detaylandırılmıştır.
zh_cn: “线性系统”类包含了一些方法，可以很容易地从飞轮的马达、齿轮传动装置和 :term:`moment of inertia`创建飞轮的模型。转动惯量可以用CAD软件计算，也可以用物理计算。这里使用的示例在飞轮示例项目(`Java <https://github.com/wpilibsuite/allwpilib/tree/3b283ab9aaf9d23d7870b9c3723d03760a0bd378/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/statespaceflywheel>`__/`C++ <https://github.com/wpilibsuite/allwpilib/blob/3b283ab9aaf9d23d7870b9c3723d03760a0bd378/wpilibcExamples/src/main/cpp/examples/StateSpaceFlywheel/cpp/Robot.cpp>`__)中有详细说明。

source: For WPILib's state-space classes, gearing is written as output over input -- that is, if the flywheel spins slower than the motors, this number should be greater than one.
es_mx: Para las clases de estado-espacio de WIPLib, los engranes son escritos como salida en vez de entrada -- es esto, si el volante gira más lento que los motores, este número debe ser mayor que uno.
fr_ca: Pour les classes espace-état de la WPILib, l’engrenage est modélisé par une fonction de sortie sur entrée -- c’est-à-dire que si le volant d'inertie tourne plus lentement que les moteurs, ce nombre devrait être supérieur à un.
tr_tr: WPILib'in durum uzayı sınıfları için dişli, giriş üzerinden çıkış olarak yazılır - yani, volan motorlardan daha yavaş dönüyorsa, bu sayı birden büyük olmalıdır.
zh_cn: 对于WPILib的状态空间类，齿轮传动被写为输入的输出-也就是说，如果飞轮的旋转速度慢于电动机的旋转速度，则该数字应大于1。

source: The C++ LinearSystem class uses :ref:`the C++ Units Library <docs/software/basic-programming/cpp-units:The C++ Units Library>` to prevent unit mixups and assert dimensionality.
es_mx: La clase LinearSystem de C++ usa :ref:`la Libreria de Unidades de C++ <docs/software/basic-programming/cpp-units:The C++ Units Library>` para prevenir mezla de unidades y afirmar dimensionalmente.
fr_ca: La classe C++ LinearSystem utilise :ref:`librairie d’unités C++ <docs/software/basic-programming/cpp-units:The C++ Units Library>` pour prévenir les mélanges des unités et se conformer à l'analyse dimensionnelle.
tr_tr: C ++ LinearSystem sınıfı, birim karışıklıklarını önlemek ve boyutluluğu ileri sürmek için :ref:`the C++ Units Library <docs/software/basic-programming/cpp-units:The C++ Units Library>` kullanır.
zh_cn: 线性系统类使用 :ref:`the C++ Units Library <docs/software/basic-programming/cpp-units:The C++ Units Library>`来防止单元混淆和断言维数。

source: Kalman Filters: Observing Flywheel State
es_mx: Filtros Kalman: Observando el Estado del Flywheel
fr_ca: Filtres de Kalman : Observation de l’état du volant d'inertie
tr_tr: Kalman Filtreleri: Volan Durumunu Gözlemleme
zh_cn: 卡尔曼滤波器:观察飞轮状态

source: Kalman filters are used to filter our velocity measurements using our state-space model to generate a state estimate :math:`\mathbf{\hat{x}}`. As our flywheel model is linear, we can use a Kalman filter to estimate the flywheel's velocity. WPILib's Kalman filter takes a ``LinearSystem`` (which we found above), along with standard deviations of model and sensor measurements. We can adjust how "smooth" our state estimate is by adjusting these weights. Larger state standard deviations will cause the filter to "distrust" our state estimate and favor new measurements more highly, while larger measurement standard deviations will do the opposite.
es_mx: Los filtros Kalman son usados para filtrar nuestras mediciones de velocidad usando nuestro modelo de estado-espacio para generar un estado estimado :math:`\mathbf{\hat{x}}`. Como nuestro modelo de volante es lineal, podemos usar un filtro Kalman para estimar la velocidad del volante. EL filtro Kalman de WPILib toma un ``LinearSystem`` (que encontramos arriba), a lo largo con derivaciones estándar de mediciones de modelo y sensores. Podemos ajustar que tan "fluido" es nuestra estimación de estado es por ajustar estas cargas. Las desviaciones estándar de estado más grandes harán que el filtro "desconfíe" de nuestra estimación estatal y favorezca más las nuevas mediciones, mientras que las desviaciones estándar de las mediciones más grandes harán lo contrario.
fr_ca: Les filtres de Kalman sont utilisés pour filtrer nos mesures de vitesse à l’aide de notre modèle espace-état pour générer une estimation de l’état :math:`\mathbf{\hat{x}}`. Comme notre modèle de volant est linéaire, nous pouvons utiliser un filtre de Kalman pour estimer la vitesse du volant. Le filtre de Kalman fournie par la WPILib prend un ``système linéaire`` ou ``LinearSystem`` (que nous avons trouvé ci-dessus), ainsi que des écarts-types des mesures du modèle et des capteurs. Nous pouvons ajuster le "lissage" de notre de l'état estimé en ajustant ces poids. Les déviations standard plus importants de l’état feront en sorte que le filtre "se conforme moins" à notre estimation de l’état et favorisera plus fortement les nouvelles mesures, tandis que des valeurs plus grandes de déviations standard auront un effet contraire.
tr_tr: Kalman filtreleri, bir durum tahmini oluşturmak için durum uzayı modelimizi kullanarak hız ölçümlerimizi filtrelemek için kullanılır : math:`\ mathbf {\ hat {x}}`. Volan modelimiz doğrusal olduğundan, volanın hızını tahmin etmek için bir Kalman filtresi kullanabiliriz. WPILib'in Kalman filtresi, model ve sensör ölçümlerinin standart sapmalarıyla birlikte bir ``LinearSystem`` (yukarıda bulduğumuz) alır. Bu ağırlıkları ayarlayarak durum tahminimizin ne kadar "smooth-düzgün" olduğunu ayarlayabiliriz. Daha büyük durum standart sapmaları, filtrenin durumumuza "distrust-güvenmemesine" ve yeni ölçümleri daha fazla tercih etmesine neden olurken, daha büyük ölçüm standart sapmaları bunun tersini yapacaktır.
zh_cn: 卡尔曼滤波器用于过滤我们的速度测量使用我们的状态空间模型，以产生一个状态估计:math:`\mathbf{\hat{x}}`。由于我们的飞轮模型是线性的，我们可以使用卡尔曼滤波估计飞轮的速度。WPILib的卡尔曼滤波器采用线性系统(我们在上面发现的)，以及模型和传感器测量值的标准差。我们可以通过调整这些权重来调整我们的状态估计的“平滑度”。较大的状态标准差会导致过滤器“不信任”我们的状态估计值，更倾向于新的测量值，而较大的测量标准差则相反。

source: In the case of a flywheel we start with a state standard deviation of 3 rad/s and a measurement standard deviation of 0.01 rad/s. These values are up to the user to choose -- these weights produced a filter that was tolerant to some noise but whose state estimate quickly reacted to external disturbances for *a* flywheel -- and should be tuned to create a filter that behaves well for your specific flywheel. Graphing states, measurements, inputs, references, and outputs over time is a great visual way to tune Kalman filters.
es_mx: En el caso de un volante comenzamos con una desviación estándar de estado de 3 rad/s y una desviación estándar de medición de 0.01 rad/s. Estos valores son a elección del usuario -- estos pesos produjeron un filtro que era tolerante a algo de ruido pero cuya estimación de estado reaccionó rápidamente a perturbaciones externas para *un* volante de inercia -- y deben ajustarse para crear un filtro que se comporte bien para su volante específico. Graficar estados, medidas, entradas, referencias y salidas a lo largo del tiempo es una excelente forma visual de ajustar los filtros de Kalman.
fr_ca: Dans le cas d’un volant d'inertie, nous commençons par un écart type d’état de 3 rad/s et un écart type de mesure de 0.01 rad/s. Le choix de ces valeurs est à la discrétion de l’utilisateur - ces poids ont produit un filtre qui était tolérant à certains bruits, mais dont l’estimation de l’état a rapidement réagi aux perturbations externes pour *un* volant d'inertie - et doivent être réglés pour créer un filtre qui soit conforme à votre volant spécifique. Les tracés des états, des mesures, des entrées, des références et des sorties au fil du temps sont un excellent moyen visuel de régler les filtres de Kalman.
tr_tr: Bir volan durumunda, 3 rad / s'lik bir durum standart sapması ve 0.01 rad / s'lik bir ölçüm standardı sapması ile başlarız. Bu değerler kullanıcının seçmesine bağlıdır - bu ağırlıklar bir miktar gürültüye toleranslı olan ancak durum tahmini *a* volan için dış parazitlere hızlı bir şekilde tepki veren bir filtre üretti ve aşağıdakiler için iyi davranan bir filtre oluşturmak için ayarlanmalıdır. özel volanınız. Zaman içindeki durumları, ölçümleri, girdileri, referansları ve çıktıları grafiklemek, Kalman filtrelerini ayarlamak için harika bir görsel yoldur.
zh_cn: 对于飞轮，我们的状态标准偏差为3 rad/s，测量标准偏差为0.01 rad/s。这些值由用户来选择——这些权重产生了一个过滤器，它可以容忍一些噪音，但是它的状态估计可以快速地对*a*飞轮的外部干扰做出反应——应该进行调整，以创建一个适合特定飞轮的过滤器。将状态、测量值、输入、引用和输出随时间变化的图形化是调整卡尔曼滤波器的一种很好的可视化方法。

source: The above graph shows two differently tuned Kalman filters, as well as a :ref:`single-pole IIR filter <docs/software/advanced-controls/filters/linear-filter:Linear Filters>` and a :ref:`docs/software/advanced-controls/filters/median-filter:Median Filter`. This data was collected with a shooter over ~5 seconds, and four balls were run through the shooter (as seen in the four dips in velocity). While there are no hard rules on choosing good state and measurement standard deviations, they should in general be tuned to trust the model enough to reject noise while reacting quickly to external disturbances.
es_mx: La gráfica de arriba muestra 2 diferentes ajustes del filtro Kalman, así como :ref:`filtro IIR con un polo <docs/software/advanced-controls/filters/linear-filter:Linear Filters>` y un :ref:`docs/software/advanced-controls/filters/median-filter:Median Filter`. Estos datos fueron recolectados con un lanzador arriba de ~5 segundos, y cuatro bolas pasaron a través del lanzador (como se ve en las cuatro caídas de velocidad). Si bien no existen reglas estrictas para elegir un buen estado y medir las desviaciones estándar, en general deben ajustarse para confiar en el modelo lo suficiente como para rechazar el ruido y reaccionar rápidamente a las perturbaciones externas.
fr_ca: Le graphique ci-dessus montre deux filtres de Kalman réglés différemment, ainsi qu’un :ref:`filtre IIR simple-pôle <docs/software/advanced-controls/filters/linear-filter:Linear Filters>` et un :ref:`docs/software/advanced-controls/filters/median-filter:Median Filter`. Ces données ont été recueillies avec un tireur sur ~5 secondes, et quatre balles ont été lancées à travers le tireur (comme on le voit dans les quatre creux de vitesse). Bien qu’il n’y ait pas de règles strictes sur le choix du bon état et des écarts-types des mesures, ils devraient en général être réglés pour se rapprocher suffisamment du modèle pour éliminer le bruit tout en réagissant rapidement aux perturbations externes.
tr_tr: Yukarıdaki grafik, iki farklı şekilde ayarlanmış Kalman filtresinin yanı sıra bir::ref:`single-pole IIR filter <docs/software/advanced-controls/filters/linear-filter:Linear Filters>` ve :ref:`docs/software/advanced-controls/filters/median-filter:Median Filter` gösterir. Bu veriler, bir atıcı ile ~ 5 saniyede toplandı ve dört top, atıcıdan geçirildi (hızdaki dört düşüşte görüldüğü gibi). İyi durum ve ölçüm standardı sapmalarını seçme konusunda katı kurallar olmamakla birlikte, bunlar genel olarak, harici rahatsızlıklara hızlı tepki verirken gürültüyü reddedecek kadar modele güvenecek şekilde ayarlanmalıdır.
zh_cn: 上图显示了两个不同调谐的卡尔曼滤波器，以及一个:ref:`single-pole IIR filter <docs/software/advanced-controls/filters/linear-filter:Linear Filters>` 和 一个:ref:`docs/software/advanced-controls/filters/median-filter:Median Filter`。用射手在约5秒钟内收集了此数据，并且有四个球穿过射手（从四个速度下降中可以看出）。尽管没有关于选择良好状态和测量标准偏差的硬性规则，但通常应该对其进行调整以使模型具有足够的信任度，从而在对外部干扰做出快速反应的同时抑制噪声。

source: Because the feedback controller computes error using the :term:`x-hat` estimated by the Kalman filter, the controller will react to disturbances only as quickly the filter's state estimate changes. In the above chart, the orange plot (with a state standard deviation of 3.0 and measurement standard deviation of 0.2) produced a filter that reacted quickly to disturbances while rejecting noise, while the magenta filter was barely affected by the velocity dips.
es_mx: Por que el controlador de retroalimentación calcula errores usando :term:`x-hat` estimado por el filtro Kalman, el controlador reaccionará a disturbios tan rápido como cambia el estado del filtro estimado. En el gráfico de arriba, la trama naranja (con desviación estándar de estado de 3.0 y desviación estándar de medición de 0.2) produjo un filtro que reacciona rápidamente a disturbios mientras rechazan ruidos, mientras el filtro magenta fue apenas afectado por caídas de velocidad.
