Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-debugging.po
Languages: es_mx, fr_ca, zh_cn

source: Debugging State-Space Models and Controllers
es_mx: Depuración de controladores y modelos de espacio de estado
fr_ca: Débogage des modèles et contrôleurs d'espace d'état
zh_cn: 调试状态空间模型和控制器

source: Checking Signs
es_mx: Comprobación de señales
fr_ca: Vérification des signes
zh_cn: 检查标志

source: One of the most common causes of bugs with state-space controllers is signs being flipped. For example, models included in WPILib expect positive voltage to result in a positive acceleration, and vice versa. If applying a positive voltage does not make the mechanism accelerate forwards, or if moving "forwards" makes encoder (or other sensor readings) decrease, they should be inverted so that positive voltage input results in a positive encoder reading. For example, if I apply an :term:`input` of :math:`[12, 12]^T` (full forwards for the left and right motors) to my differential drivetrain, my wheels should propel my robot "forwards" (along the +X axis locally), and for my encoders to read a positive velocity.
es_mx: Una de las causas más comunes de errores con los controladores de espacio de estado son los letreros que se invierten. Por ejemplo, los modelos incluidos en WPILib esperan que el voltaje positivo dé como resultado una aceleración positiva y viceversa. Si la aplicación de un voltaje positivo no hace que el mecanismo se acelere hacia adelante, o si el movimiento hacia "adelante" hace que el encoder (u otras lecturas del sensor) disminuyan, deben invertirse para que la entrada de voltaje positivo dé como resultado una lectura del codificador positivo. Por ejemplo, si aplico una term:`entrada` de :math:`[12, 12]^T` (hacia adelante completo para los motores izquierdo y derecho) a mi transmisión diferencial, mis ruedas deberían impulsar mi robot hacia "adelante " (a lo largo del eje + X localmente), y para que mis codificadores lean una velocidad positiva.
fr_ca: L'une des causes les plus courantes de bogues avec les contrôleurs d'espace d'état est le mauvais agencement des signes (+ ou -). Par exemple, les modèles inclus dans WPILib s'attendent à ce qu'une tension positive entraîne une accélération positive, et vice versa. Si l'application d'une tension positive ne fait pas accélérer le mécanisme vers l'avant, ou si le déplacement «vers l'avant» fait diminuer le codeur (ou d'autres lectures de capteur), ils doivent être inversés de sorte qu'une entrée de tension positive entraîne une lecture de codeur positive. Par exemple, si j'applique une :term:`entrée` de :math:`[12, 12]^T` (vitesse maximale vers l'avant pour les moteurs gauche et droit) à ma base pilotable de type différentielle, mes roues devraient propulser mon robot "vers l'avant " (le long de l'axe + X), et pour mes encodeurs de lire une vitesse positive.
zh_cn: 状态空间控制器错误的最常见原因之一是信号被翻转。例如，WPILib中包含的模型期望正电压会导致正加速度，反之亦然。如果施加正电压不能使该机构向前加速，或者如果“向前”移动会使编码器（或其他传感器读数）减小，则应将其反转，以使正电压输入导致编码器读数为正。例如，如果我对差速器传动系统应用：math：`[12，12] ^ T`（左右电动机的全速前进）的：term：`input`，则我的车轮应将机器人“向前”推进（沿+ X轴局部），并使我的编码器读取正速度。

source: The WPILib DifferentialDrive by default inverts the right motors. This behavior can be changed by calling ``setRightSideInverted(false)``/``SetRightSideInverted(false)`` (Java/C++) on the DifferentialDrive object.
es_mx: El WPILib DifferentialDrive por defecto invierte los motores correctos. Este comportamiento se puede cambiar llamando a ``setRightSideInverted(false)``/``SetRightSideInverted(false)`` (Java / C ++) en el objeto DifferentialDrive.
zh_cn: WPILib DifferentialDrive默认情况下会反转正确的电动机。可以通过在DifferentialDrive对象上调用``setRightSideInverted(false)``/``SetRightSideInverted(false)``（Java / C ++）来更改此行为。

source: The Importance of Graphs
es_mx: La importancia de los gráficos
fr_ca: L'importance des graphiques
zh_cn: 图的重要性

source: Reliable data of the :term:`system's <system>` :term:`state`\s, :term:`input`\s and :term:`output`\s over time is important when debugging state-space controllers and observers. One common approach is to send this data over NetworkTables and use tools such as :ref:`Shuffleboard <docs/software/wpilib-tools/shuffleboard/index:Shuffleboard>`, which allow us to both graph the data in real-time as well as save it to a CSV file for plotting later with tools such as Google Sheets, Excel or Python.
es_mx: Los datos confiables de :term:`estado`\s del :term:`sistema <system>` , :term:`entrada`\s y :term:`salida`\s en el tiempo son importantes cuando se depuran controladores y observadores del espacio de estado. Un enfoque común es enviar estos datos a través de NetworkTables y usar herramientas como :ref:`Shuffleboard <docs/software/wpilib-tools/shuffleboard/index:Shuffleboard>`, que nos permite graficar los datos en tiempo real y guardarlos en un archivo CSV para trazarlos más tarde con herramientas como como Hojas de cálculo de Google, Excel o Python.
zh_cn: 在调试状态空间控制器和观察者时， :term:`system's 1` :term:`state`\s, :term:`input`\s 和 :term:`output`\s的数据可靠很重要。一种常见的方法是通过NetworkTables发送此数据，并使用诸如 :ref:`Shuffleboard <docs/software/wpilib-tools/shuffleboard/index:Shuffleboard>`之类的工具，该工具使我们既可以实时绘制数据图形，也可以将其保存到CSV文件中，以便以后使用诸如作为Google表格，Excel或Python。

source: By default, NetworkTables is limited to a 10hz update rate. For testing, this can be bypassed with the following code snippet to submit data at up to 100hz. This code should be run periodically to forcibly publish new data.
es_mx: De forma predeterminada, NetworkTables está limitado a una tasa de actualización de 10 Hz. Para las pruebas, esto se puede omitir con el siguiente fragmento de código para enviar datos a una velocidad de hasta 100 hz. Este código debe ejecutarse periódicamente para publicar nuevos datos a la fuerza.
fr_ca: Par défaut, les NetworkTables sont limités à un taux de rafraîchissement de 10 hz. Pour les tests, cette limitation peut être contournée avec l’extrait de code suivant pour soumettre des données jusqu’à 100hz. Ce code doit être exécuté périodiquement pour forcer la publication de nouvelles données.
zh_cn: 默认情况下，NetworkTables的更新速率限制为10hz。为了进行测试，可以使用以下代码段绕过它，以最高100hz的速度提交数据。该代码应定期运行以强制发布新数据。

source: This will send extra data (at up to 100hz) over NetworkTables, which can cause lag with both user code and robot dashboards. This will also increase network utilization. It is often a good idea to disable this during competitions.
es_mx: Esto enviará datos adicionales (hasta 100 hz) a través de NetworkTables, lo que puede causar retrasos tanto con el código de usuario como con los paneles de control del robot. Esto también aumentará la utilización de la red. Suele ser una buena idea desactivarlo durante las competencias.
fr_ca: Cette opération enverra des données supplémentaires (jusqu’à 100hz) sur NetworkTables, pouvant ainsi causer des retards avec le code utilisateur et les dashboards des robots. Ce qui augmentera également l’utilisation du réseau. C’est souvent une bonne idée de désactiver cette fonctionnalité pendant les compétitions.
zh_cn: 这将通过NetworkTables发送额外的数据（最高100hz），这可能导致用户代码和机械手仪表板的滞后。这也将提高网络利用率。在比赛中禁用此功能通常是个好主意。

source: Compensating for Input Lag
es_mx: Compensación por retraso de entrada
fr_ca: Compensation du retard d'entrée
zh_cn: 补偿输入滞后

source: Often times, some sensor input data (i.e. velocity readings) may be delayed due to onboard filtering that smart motor controllers tend to perform. By default, LQR's K gain assumes no input delay, so introducing significant delay on the order of tens of milliseconds can cause instability. To combat this, the LQR's K gain can be reduced, trading off performance for stability. A code example for how to compensate for this latency in a mathematically rigorous manner is available :ref:`here <docs/software/advanced-controls/state-space/state-space-intro:LQR and Measurement Latency Compensation>`.
es_mx: Con frecuencia, algunos datos de entrada del sensor (es decir, lecturas de velocidad) pueden retrasarse debido al filtrado integrado que los controladores de motor inteligentes tienden a realizar. De forma predeterminada, la ganancia K de LQR asume que no hay retardo de entrada, por lo que introducir un retardo significativo del orden de decenas de milisegundos puede provocar inestabilidad. Para combatir esto, se puede reducir la ganancia K del LQR, intercambiando rendimiento por estabilidad. Está disponible un ejemplo de código sobre cómo compensar esta latencia de una manera matemáticamente rigurosa :ref:`aquí <docs/software/advanced-controls/state-space/state-space-intro:LQR and Measurement Latency Compensation>`.
fr_ca: Souvent, certaines données d'entrée du capteur (c'est-à-dire les lectures de vitesse) peuvent être retardées en raison du filtrage intégré que les contrôleurs de moteur intelligents ont tendance à effectuer. Par défaut, le gain K du LQR ne suppose aucun retard d'entrée, donc l'introduction d'un retard significatif de l'ordre de dizaines de millisecondes peut provoquer une instabilité. Pour lutter contre cela, le gain K du LQR peut être réduit, échangeant les performances contre la stabilité. Un exemple de code permettant de compenser cette latence de manière mathématiquement rigoureuse est disponible :ref: `ici <docs / software / advanced-controls / state-space / state-space-intro: LQR and Measurement Latency Compensation>`.
zh_cn: 通常，某些传感器输入数据（即速度读数）可能会由于智能电机控制器倾向于执行的车载过滤而被延迟。默认情况下，LQR的K增益不假定输入延迟，因此引入数十毫秒量级的显着延迟可能会导致不稳定。为了解决这个问题，可以降低LQR的K增益，以牺牲性能为代价。有关如何以数学上严格的方式补偿此延迟的代码示例，请参见 :ref:`here <docs/software/advanced-controls/state-space/state-space-intro:LQR and Measurement Latency Compensation>`。

source: The WPILib ``DifferentialDrive``, by default, does not invert any motors. You may need to call the ``setInverted(true)`` method on the motor controller object to invert so that positive input creates forward motion.
fr_ca: Le WPILib ``DifferentialDrive``, par défaut, n'inverse aucun moteur. Vous devrez peut-être appeler la méthode ``setInverted(true)`` sur l'objet contrôleur de moteur pour inverser afin que l'entrée positive crée un mouvement vers l'avant.

source: Reliable data of the :term:`system's <system>` :term:`state`\s, :term:`input`\s and :term:`output`\s over time is important when debugging state-space controllers and observers. One common approach is to send this data over NetworkTables and use tools such as :ref:`Shuffleboard <docs/software/dashboards/shuffleboard/index:Shuffleboard>`, which allow us to both graph the data in real-time as well as save it to a CSV file for plotting later with tools such as Google Sheets, Excel or Python.
fr_ca: Des données fiables de :term:`l’état` du :term:`système<system>`, :term:`entrée`\s et :term:`sortie`\s en fonction du temps sont importantes lors du débogage des contrôleurs et des observateurs d'espace-état. Une approche courante consiste à envoyer ces données sur les NetworkTables et à utiliser des outils tels que le :ref:`Shuffleboard <docs/software/dashboards/shuffleboard/index:Shuffleboard>`, qui nous permettent à la fois de représenter graphiquement les données en temps réel et aussi bien que les enregistrer dans un fichier CSV pour un traçage ultérieur avec des outils tels que Google Sheets, Excel ou Python.
