Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-2/frc-game-tools.po
Languages: es_mx, fr_ca, he_il, ja, tr_tr

source: Installing the FRC Game Tools
es_mx: Instalando FRC Game Tools
fr_ca: Installer les Outils de Jeu FRC
he_il: התקנת ה-FRC Game Tools
ja: FRC Game Tools をインストールする
tr_tr: FRC Game Tools Araçlarını Yükleme

source: The FRC\ |reg| Game Tools contains the following software components:
es_mx: El FRC\ |reg| Game Tools contiene los siguientes componentes de software:
fr_ca: Les outils de jeu FRC\ |reg| Game Tools contiennent les composants logiciels suivants:
he_il: ה-FRC\ |reg| Game Tools מכיל את רכיבי התוכנה הבאים:
ja: FRC\ |reg| Game Tools は以下のソフトウエアコンポーネントを含んでいます：
tr_tr: FRC \ |reg| Game Tools aşağıdaki yazılım bileşenlerini içerir:

source: LabVIEW Update
es_mx: Actualización de LabVIEW
fr_ca: Mise à jour LabVIEW
he_il: עדכון LabVIEW
ja: LabView アップデート
tr_tr: LabVIEW Güncellemesi

source: FRC Driver Station
fr_ca: Driver Station FRC
ja: FRC ドライバーステーション
tr_tr: FRC Sürücü İstasyonu

source: FRC roboRIO Imaging Tool and Images
fr_ca: Outil d'imagerie et images FRC roboRIO
ja: FRC roboRIOのイメージ書き込みツールとイメージファイル

source: The LabVIEW runtime components required for the Driver Station and Imaging Tool are included in this package.
fr_ca: Les composants d'exécution LabVIEW requis pour la station de pilotage et l'outil d'imagerie sont inclus dans ce package.
ja: ドライバーステーションとイメージツールに必要なLabVIEWランタイムコンポーネントはこのパッケージに含まれています。

source: No components from the LabVIEW Software for FRC package are required for running either the Driver Station or Imaging Tool.
fr_ca: Aucun composant du package LabVIEW Software for FRC n'est requis pour exécuter la Driver Station ou l'outil d'imagerie.
ja: 「LabVIEW Software for FRC」というパッケージに含まれるコンポーネントは、ドライバーステーションまたはイメージツールのいずれを実行する際にも必要ありません。

source: Requirements
es_mx: Requerimientos:
fr_ca: Exigences
he_il: דרישות
ja: 要件
tr_tr: Gereksinimler

source: Windows 10 or higher (Windows 10, 11). Windows 11 is not officially supported by NI, but has been tested to work.
fr_ca: Windows 10 ou supérieur (Windows 10, 11). Windows 11 n'est pas officiellement pris en charge par NI, mais s'est avéré fonctionnel lorsque testé.

source: Download the `FRC Game Tools <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__ from NI.
fr_ca: Télécharger les outils de jeu `FRC Game Tools <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__ à partir du site web de NI.
he_il: הורדת ה-`FRC Game Tools <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__ מ-NI.
tr_tr: NI'den `FRC Game Tools <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__ dosyasını indirin.

source: The Download button for the NI installer with the offline installer link below it.
fr_ca: Le bouton Download pour le programme d’installation de NI avec le lien du programme d’installation hors ligne en dessous.
ja: NIインストーラのダウンロードボタンと、その下にあるオフラインインストーラのリンク。

source: If you wish to install on other machines offline, click :guilabel:`Individual Offline Installers` before clicking :guilabel:`Download` to download the full installer.
es_mx: Si desea instalarlo en otros aparatos de manera offline, haga click en :guilabel:`Individual Offline Installers` antes de pulsar :guilabel:`Download` para descargar el instalador completo.
fr_ca: Si vous souhaitez installer sur d’autres machines hors ligne, cliquez d'abord sur :guilabel:`Individual Offline Installers` avant de cliquer ensuite sur :guilabel:`Download` pour télécharger l’installateur complet.
he_il: אם ברצונכם להתקין במחשבים אחרים במצב לא מקוון, לחצו על :guilabel:`Individual Offline Installers` לפני לפני הלחיצה על :guilabel:`Download` כדי להוריד את המתקין המלא.
ja: 他のコンピューターにオフラインでインストールしたい場合は、 :guilabel:`Download` をクリックして完全なインストーラーをダウンロードする前に､ :guilabel:`Individual Offline Installers` をクリックしてください。
tr_tr: Çevrimdışı başka makinelere kurmak isterseniz, tam yükleyiciyi indirmek için :guilabel:`Download` e tıklamadan önce :guilabel:`Individual Offline Installers` seçeneğini tıklayın.

source: Uninstall Old Versions (Recommended)
es_mx: Desinstalar Versiones Anteriores (Recomendado)
fr_ca: Désinstaller les anciennes versions (Conseillé)
he_il: הסרת גרסאות ישנות (מומלץ)
ja: 前バージョンをアンインストールする（推奨）
tr_tr: Eski Sürümleri Kaldırma (Önerilir)

source: LabVIEW teams have already completed this step, do not repeat it. LabVIEW teams should skip to the :ref:`docs/zero-to-robot/step-2/frc-game-tools:installation` section.
es_mx: Los equipos LabVIEW ya han completado este paso, no lo repitan. Los equipos LabVIEW deben saltar a la sección :ref:`docs/zero-to-robot/step-2/frc-game-tools:installation`.
fr_ca: Les équipes programmant en LabVIEW ont déjà complété cette étape, ne la répétez pas. Elles doivent donc passer à la section :ref:`docs/zero-to-robot/step-2/frc-game-tools:installation`.
he_il: קבוצות LabVIEW כבר השלימו שלב זה, אל תחזרו עליו. קבוצות LabVIEW צריכות לדלג לקטע :ref:`docs/zero-to-robot/step-2/frc-game-tools:installation`.
ja: LabVIEWを使用するチームは、すでにこのステップを完了しているので、繰り返さないでください｡ :ref:`docs/zero-to-robot/step-2/frc-game-tools:installation` というステップに進むべきです。
tr_tr: LabVIEW ekipleri bu adımı zaten tamamladı, tekrar etmeyin. LabVIEW ekipleri :ref:`docs/zero-to-robot/step-2/frc-game-tools:installation` bölümüne atlamalıdır.

source: It is only necessary to uninstall previous versions when installing a new year's tools. For example, uninstall the 2021 tools before installing the 2022 tools. It is not necessary to uninstall before upgrading to a new update of the 2022 game tools.
fr_ca: Il est seulement nécessaire de prodéder à la désinstallation les versions précédentes lors de l’installation des outils d’une nouvelle année. Par exemple, précédez à la désinstallation des outils 2021 avant d’installer les outils 2022. Par contre, pour procéder à l'installation d'une mise à jour plus récente des Outils de jeu 2022, il n’est pas nécessaire de désinstaller la version courante des outils de jeu 2022.
ja: 新年のツールをインストールする場合のみ、旧バージョンをアンインストールする必要があります。例えば、2022のツールをインストールする前に、2021のツールをアンインストールすべきです。2022ゲームツールの新しいアップデートにアップグレードする前に、アンインストールする必要はありません。

source: Add or Remove -> NI Software
fr_ca: Ajouter (Add) ou supprimer (Remove) -> logiciel NI
ja: 追加・削除 → NI Software

source: Select Components to Uninstall
es_mx: Seleccionar Componentes para Desinstalar
fr_ca: Sélection des Composants à Désinstaller
he_il: בחר רכיבים להסרה
ja: アンインストールするコンポーネントを選択
tr_tr: Kaldırılacak Bileşenleri Seçin

source: In the dialog box that appears, select all entries. The easiest way to do this is to de-select the :guilabel:`Products Only` check-box and select the check-box to the left of "Name". Click :guilabel:`Remove`. Wait for the uninstaller to complete and reboot if prompted.
es_mx: En la caja de dialogo que aparece, seleccione todas las entradas. La manera más fácil de hacer esto es de-seleccionar la opción de :guilabel:`Products Only` y seleccione la opción a la izquierda de "Name". De click en :guilabel:`Remove`. Espere a que el desinstalador complete y reinicie si así se desea.
fr_ca: Dans la boîte de dialogue qui s’affiche, sélectionnez toutes les entrées. La façon la plus simple de le faire est de dé-sélectionner d'abord la case à cocher :guilabel:`Products Only` et de sélectionner ensuite la case à cocher à gauche de "Name". Cliquez finalement sur :guilabel:`Remove`. Attendez que le désinstallateur se termine et redémarrez si vous y êtes invité.
ja: 表示されたダイアログボックスに、全てのアイテムを選択します。これを行うに最も簡単な方法は､ :guilabel:`Products Only` の選択を解除し、「Name」の左にあるチェックボックスを選択することです｡ :guilabel:`Remove` をクリックします。アンインストーラーが完了するまで待ち、プロンプトが表示されたら再起動します。
tr_tr: Görünen iletişim kutusunda tüm girişleri seçin. Bunu yapmanın en kolay yolu :guilabel:`Products Only` onay kutusunun seçimini kaldırmak ve "Name-Ad" ın solundaki onay kutusunu seçmektir. Tıklayın :guilabel:`Remove`. İstenirse kaldırıcının tamamlanmasını ve yeniden başlamasını bekleyin.

source: Using the checkbox in the upper left to select all.
fr_ca: Utilisez la case à cocher en haut à gauche pour tout sélectionner.
ja: 左上のチェックボックスですべてを選択する。

source: The Game Tools installer may prompt that .NET Framework 4.6.2 needs to be updated or installed. Follow prompts on-screen to complete the installation, including rebooting if requested. Then resume the installation of the FRC Game Tools, restarting the installer if necessary.
es_mx: El Game Tools installer puede solicitar que .NET Framework 4.6.2 deba actualizarse o instalarse. Siga las instrucciones en pantalla para completar la instalación, incluido el reinicio si se requiere. Luego, reanude la instalación de FRC Game Tools, reinicie el instalador si es necesario.
fr_ca: Le programme d'installation des Outils de Jeu peut indiquer que le .NET Framework 4.6.2 dois être mis à jour ou installé. Suivez les instructions à l'écran pour finaliser l'installation, y compris un redémarrage si demandé. Après, continuer l'installation des Outils de Jeu FRC, redémarrez l'installateur si nécessaire.
ja: Game Toolsのインストーラーでは、「.NET Framework 4.6.2」をインストールする必要があるプロンプトが出てくる可能性があります。プロンプトに従って、要求があれば再起動を含め、インストールしを完了してください。その後、必要に応じてインストーラーを再起動して、FRC Game Toolsのインストールを再開し、完了させてください。
tr_tr: Game Tools yükleyicisi, .NET Framework 4.6.2'nin güncellenmesi veya yüklenmesi gerektiğini sorabilir. Kurulumu tamamlamak için, istenirse yeniden başlatma da dahil olmak üzere ekrandaki komut istemlerini izleyin. Ardından, gerekirse yükleyiciyi yeniden başlatarak FRC Game Tools kurulumuna devam edin.

source: Online
fr_ca: En ligne
ja: オンライン

source: Run the downloaded executable file to start the install process. Click :guilabel:`Yes` if a Windows Security prompt appears.
es_mx: Ejecute el archivo ejecutable que descargó para empezar el proceso de instalación. Haga click en :guilabel:`Yes` si una ventana de Windows Security aparece.
fr_ca: Exécutez le fichier exécutable téléchargé pour démarrer le processus d’installation. Cliquez sur :guilabel:`Yes` si une invite de sécurité Windows s’affiche.
ja: インストールを開始するため、ダウンロードされた実行可能なファイルを実行してください。もし Windows セキュリティプロンプトが表示されたら、 :guilabel:`Yes` をクリックしてください。
tr_tr: Yükleme işlemini başlatmak için indirilen yürütülebilir dosyayı çalıştırın. Bir Windows Güvenlik istemi görünürse :guilabel:`Yes` e tıklayın.

source: Offline (Windows 10+)
fr_ca: Hors ligne (Windows 10+)
ja: オフライン （Windows 10+）

source: Right click on the downloaded iso file and select :guilabel:`mount`. Run ``install.exe`` from the mounted iso. Click :guilabel:`Yes` if a Windows Security prompt appears.
es_mx: Haga clic derecho en el archivo iso descargado y seleccione :guilabel:`mount`. Ejecute ``install.exe`` desde el iso montado. Haga clic en :guilabel:`Yes` si una ventada de Windows Security aparece.
fr_ca: Cliquez avec le bouton droit sur le fichier iso téléchargé et sélectionnez :guilabel:`mount`. Exécutez le fichier ``install.exe`` à partir de l’iso monté. Cliquez sur :guilabel:`Yes` si une invite de sécurité Windows s’affiche.
ja: ダウンロードされたisoを右クリックして :guilabel:`mount` を選択してください。マウントされたisoで、 ``install.exe`` を実行します。Windowsセキュリティープロンプトが表示されたら、 :guilabel:`Yes` をクリックしてください。
tr_tr: İndirilen iso dosyasına sağ tıklayın ve şunu seçin :guilabel:`mount` . Takılı iso'dan ``install.exe`` dosyasını çalıştırın. Bir Windows Güvenlik istemi görünürse :guilabel:`Yes` e tıklayın.

source: The menu after right clicking on an .iso file to choose "Mount".
fr_ca: Le menu après un clic droit sur un fichier .iso pour choisir "Mount".
ja: 「.iso」を右クリックしてから「Mount」を選択するために表示されるメニュー。

source: Other installed programs may associate with iso files and the :guilabel:`mount` option may not appear. If that software does not give the option to mount or extract the iso file, then install 7-Zip and use that to extract the iso.
fr_ca: D'autres programmes installés peuvent s'associer aux fichiers iso et l'option :guilabel:`mount` peut ne pas apparaître. Si ce logiciel ne donne pas la possibilité de monter ou d'extraire le fichier iso, installez 7-Zip et utilisez-le pour extraire l'iso.
ja: :guilabel:`mount` オプションは、インストールされている他のプログラムがisoファイルに関係付けられている場合があるため、表示されていない場合があります。そのソフトはマウントまたは解凍出来ない場合、7ｰZipをインストールし、それを使ってisoを解凍してください。

source: NI Package Manager License
es_mx: Licencia de NI Package Manager
fr_ca: License de Gestionnaire de Packages NI (NI Package Manager License)
he_il: רישיון NI Package Manager
ja: NI Package Managerのライセンス
tr_tr: NI Package Manager Lisansı

source: Accepting the License Agreement for NI Package Manager.
fr_ca: Acceptation du contrat de licence de NI Package Manager.
ja: NI Package Managerのライセンス契約に同意します。

source: If you see this screen, click :guilabel:`Next`. This screen confirms that you agree to NI Package Manager License agreement.
es_mx: Si ve esto en su pantalla, haga clic en :guilabel:`Next`. Esta pantalla confirma que está de acuerdo con la licencia del NI Package Manager.
fr_ca: Si vous voyez cet écran, cliquez sur :guilabel:`Next`. Cet écran confirme que vous acceptez le contrat de licence NI Package Manager.
he_il: במידה ואתם רואים מסך זה, לחץ על :guilabel:`Next`. מסך זה מאשר שאתה מסכים להסכם הרישיון של NI Package Manager.
ja: もしこの画面が表示されたら、 :guilabel:`Next` をクリックしてください。NI Package Managerのライセンス契約に同意するためです。
tr_tr: Bu ekranı görürseniz, tıklayın :guilabel:`Next`. Bu ekran, NI Paket Yöneticisi Lisans sözleşmesini kabul ettiğinizi onaylar.

source: Disable Windows Fast Startup
es_mx: Desactivar el inicio Rápido de Windows
fr_ca: Désactiver le démarrage rapide de Windows
he_il: ביטול ההפעלה המהירה של Windows
ja: Windowsの高速スタートアップを無効にする
tr_tr: Windows Fast Startup - Hızlı Başlangıç özelliğini kapatın.

source: Screen for disabling Windows fast startup.
fr_ca: Écran pour désactiver le démarrage rapide de Windows
ja: Windowsの高速スタートアップを無効にするための画面。

source: It is recommended to leave this screen as-is, as Windows Fast Startup can cause issues with the NI drivers required to image the roboRIO. Go ahead and click :guilabel:`Next`.
es_mx: Es recomendable dejar la pantalla tal como está, ya que Windows Fast Startup puedae causar problemas con los drivers de NI necesarios para la transcripción de la roboRIO. Siga y de clic a :guilabel:`Next`.
fr_ca: Il est recommandé de laisser cet écran tel qu’il est, car Windows Fast Startup peut causer des problèmes avec les pilotes NI requis pour l’image du roboRIO. Procédez et cliquez sur :guilabel:`Next`.
he_il: מומלץ להשאיר מסך זה כמו שהוא, ההפעלה המהירה של Windows עלולה לגרום לבעיות במנהלי ההתקן של NI הנדרשים לצריבת ה-roboRIO. לחצו :guilabel:`Next`.
ja: Windowsの高速スタートアップは、roboRIOのイメージ化に必要なNIドライバーの問題を引き起こす可能性があるため、この画面はそのままにしておくことをお勧めします。 :guilabel:`Next` をクリックしてください。
tr_tr: Windows Hızlı Başlatma roboRIO'yu görüntülemek için gereken NI sürücülerinde sorunlara neden olabileceğinden, bu ekranı olduğu gibi bırakmanız önerilir. Devam edin ve tıklayın :guilabel:`Next`.

source: NI Package Manager Review
es_mx: Revisión de NI Package Manager
fr_ca: Revue du gestionnaire de packages NI
tr_tr: NI Package Manager İncelemesi

source: Review screen that shows what is about to be installed.
fr_ca: Écran de révision qui montre ce qui est sur le point d’être installé.
ja: これからインストールされるものを確認するための画面。

source: If you see this screen, click :guilabel:`Next`.
es_mx: Si ve esta pantalla, de clic en :guilabel:`Next`.
fr_ca: Si vous voyez cet écran, cliquez sur :guilabel:`Next`.
he_il: במידה ואתם רואים מסך זה, לחצו :guilabel:`Next`.
ja: もしこの画面が表示されたら、 :guilabel:`Next` をクリックしてください。
tr_tr: Bu ekranı görürseniz, tıklayın :guilabel:`Next`.

source: NI Package Manager Installation
es_mx: Instalación de NI Package Manager
fr_ca: L'installation du gestionnaire de packages NI
ja: NI Package Managerのインストール
tr_tr: NI Package Manager Kurulumu

source: Screen with progress bars indicating the amount of completion.
fr_ca: Écran avec des barres de progression indiquant la quantité complétée de l'installation.
ja: 完成度を示すプログレスバーが表示された画面。

source: Installation progress of the NI Package Manager will be tracked in this window.
es_mx: El proceso de instalación del NI Package Manager será rastreado a través de esta ventana.
fr_ca: La progression de l'installation du gestionnaire NI Package Manager sera suivie de cette fenêtre.
ja: NI Package Managerのインストールの進行状況は、このウィンドウで確認できます。
tr_tr: NI Paket Yöneticisinin kurulum ilerlemesi bu pencerede izlenecektir.

source: Additional Software
es_mx: Software Adicional
fr_ca: Logiciel Supplémentaire
he_il: תוכנה נוספת
ja: 追加ソフトウェア
tr_tr: Ek Yazılım

source: Leave all of the additional packages selected.
fr_ca: Laissez tous les packages supplémentaires sélectionnés.
ja: 全て選択されたままにしておくことをお勧めします。

source: License Agreements
es_mx: Acuerdos de Licencia
fr_ca: Accords de License
he_il: הסכמי רישיון
ja: ライセンス契約
tr_tr: Lisans Sözleşmeleri

source: Accept the NI software license agreement.
fr_ca: Acceptez le contrat de licence du logiciel NI.
ja: NI Softwareのライセンス契約に同意します。

source: Select :guilabel:`I accept…` then click :guilabel:`Next`
es_mx: Seleccione :guilabel:`I accept…` y de clic en :guilabel:`Next`
fr_ca: Sélectionnez :guilabel:`I accept…` puis cliquez sur :guilabel:`Next`
he_il: בחרו :guilabel:`I accept…` ולחצו :guilabel:`Next`
ja: :guilabel:`I accept…` を選択してから :guilabel:`Next` をクリックしてください。
tr_tr: Seçin :guilabel:`I accept…` ve ardından tıklayın :guilabel:`Next`.

source: Accept the Silverlight license agreements.
fr_ca: Acceptez les contrats de licence Silverlight.

source: Go ahead and press :guilabel:`I accept…` then click :guilabel:`Next`, confirming that you agree to the NI License agreement.
es_mx: Siga y presione :guilabel:`I accept…` y después de clic en :guilabel:`Next`, confirmando que está de acuerdo con el tratado de Licencia de NI.
fr_ca: Procédez et appuyez sur :guilabel:`I accept…` puis cliquez sur :guilabel:`Next`, confirmant que vous acceptez le contrat de licence NI.
tr_tr: Devam edin ve basın :guilabel:`I accept…` ardından tıklayın :guilabel:`Next`, NI Lisans sözleşmesini kabul ettiğinizi onaylayın.

source: Review Summary
es_mx: Resumen de la Revisión
fr_ca: Résumé des commentaires
ja: レビューの概要
tr_tr: Değerlendirme Özeti

source: Click :guilabel:`Next`.
es_mx: Clic :guilabel:`Next`.
fr_ca: Cliquez sur :guilabel:`Next`.
he_il: לחצו :guilabel:`Next`.
ja: :guilabel:`Next` をクリックします。
tr_tr: Tıklayın :guilabel:`Next`.

source: Detail Progress
es_mx: Progreso Detallado
fr_ca: Progrès de Détail
he_il: פרטי ההתקדמות
ja: 詳細な進捗状況
tr_tr: İlerleme Detayları

source: This screen showcases the installation process, go ahead and press :guilabel:`Next` when it's finished.
es_mx: Esta pantalla muestra el proceso de instalación, continué y presione :guilabel:`Next` cuando esté terminado.
fr_ca: Cet écran présente le processus d’installation, procédez et appuyez sur :guilabel:`Next` quand il est terminé.
ja: この画面はインストール過程が表示され、完了したら :guilabel:`Next` をクリックしてください。
tr_tr: Bu ekran kurulum sürecini gösterir, devam edin ve bittiğinde :guilabel:`Next` ye basın.

source: NI Activation Wizard
es_mx: Asistente de activación de NI
fr_ca: Assistant d'Activation NI
tr_tr: NI Aktivasyon Sihirbazı

source: The NI user login screen.
fr_ca: Écran de connexion de l’utilisateur NI.

source: Log into your `ni.com <https://ni.com>`__ account. If you don’t have an account, select :guilabel:`Create account` to create a free account.
es_mx: Inicie sesión en su cuenta de `ni.com <https://ni.com>`__. Si no tiene una cuenta, seleccione :guilabel:`Create account` para crear una cuenta gratis.
fr_ca: Connectez-vous à votre compte `ni.com <https://ni.com>`__ . Si vous n’avez pas de compte, sélectionnez :guilabel:`Create account` pour créer un compte gratuit.
he_il: התחברו לחשבון ה-`ni.com <https://ni.com>`__ שלכם. במידה ואין לכם עדיין חשבון, בחרו :guilabel:`Create account` כדי ליצור חשבון חדש בחינם.
tr_tr: `ni.com <https://ni.com>`__ hesabınızda oturum açın. Bir hesabınız yoksa, ücretsiz bir hesap oluşturmak için seçin :guilabel:`Create account`.

source: Screen for entering your product key.
fr_ca: Écran pour entrer votre clé de produit.

source: Enter the serial number. Click :guilabel:`Activate`.
es_mx: Ingrese el numero serial. Clic en :guilabel:`Activate`.
fr_ca: Saisissez le numéro de série. Cliquez sur :guilabel:`Activate`.
he_il: הזינו את המספר הסידורי. לחצו :guilabel:`Activate`.
tr_tr: Seri numarasını girin. Tıklayın :guilabel:`Activate`.

source: If this is the first time activating this year's software on this account, you will see the message shown above about a valid license not being found. You can ignore this.
es_mx: Si es la primera vez que activa el software de este año en esta cuenta, verá un mensaje mostrado encima acerca de que una licencia valida no fue encontrada. Puede ignorar esto.
fr_ca: Si c’est la première fois que vous activez le logiciel de cette année sur ce compte, vous verrez le message ci-dessus au sujet d’une licence valide qui n’est pas trouvée. Vous pouvez l'ignorer.
tr_tr: Bu yılki yazılımı bu hesapta ilk kez etkinleştiriyorsanız, geçerli bir lisansın bulunamadığına dair yukarıda gösterilen mesajı göreceksiniz. Bunu görmezden gelebilirsin.

source: Screen details the activation success of each package.
fr_ca: L’écran détaillant la réussite de l’activation de chaque package.

source: If your products activate successfully, an :guilabel:`Activation Successful` message will appear. If the serial number was incorrect, it will give you a text box and you can re-enter the number and select :guilabel:`Try Again`. If everything activated successfully, click :guilabel:`Next`.
es_mx: Si sus productos se activan de manera exitosa, un mensaje de :guilabel:`Activation Successful` aparecerá. Si el numero serial fue incorrecto, se mostrará una caja de texto donde puede re-ingresar el numero y seleccione :guilabel:`Try Again`. Si todo se activa de manera correcta, de clic en :guilabel:`Next`.
fr_ca: Si vos produits s’activent correctement, le message :guilabel:`Activation Successful` s’affichera. Si le numéro de série était incorrect, il vous donnera une zone de texte et vous pouvez saisir à nouveau le numéro et sélectionner :guilabel:`Try Again`. Si tout s’est activé avec succès, cliquez sur :guilabel:`Next`.
tr_tr: Ürünleriniz başarıyla etkinleştirilirse, bir :guilabel:`Activation Successful` mesajı görünecektir. Seri numarası yanlışsa, size bir metin kutusu verecektir ve numarayı yeniden girip şunu seçebilirsiniz :guilabel:`Try Again`. Her şey başarıyla etkinleştirildiyse, tıklayın :guilabel:`Next`.

source: Close through this screen asking you to register.
fr_ca: Fermez cette fenêtre vous demandant de vous inscrire.

source: Click :guilabel:`Close`.
es_mx: Seleccione :guilabel:`Close`.
fr_ca: Cliquer sur :guilabel:`Close`.
he_il: לחצו :guilabel:`Close`.
tr_tr: Tıklayın :guilabel:`Close`.

source: NI Update Service
es_mx: Servicio de Actualización de NI
fr_ca: Service de Mise à Jour NI
tr_tr: NI Update Hizmeti

source: The update service is not needed.
fr_ca: Le service de mise à jour n’est pas nécessaire.

source: You will be prompted whether to enable the NI update service. You can choose to not enable the update service.
es_mx: Se le preguntará si desea habilitar el servicio de actualización de NI. Puede elegir no habilitar el servicio de actualización.
fr_ca: Vous serez invité à activer le service de mise à jour NI. Vous pouvez chosir de ne pas l'activer, si vous le désirez.
tr_tr: NI güncelleme servisini etkinleştirmeyi isteyip istemediğiniz sorulacaktır. Güncelleme hizmetini etkinleştirmemeyi seçebilirsiniz.
