Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-2/frc-game-tools.po
Languages: es_mx, fr_ca, he_il, ja, tr_tr

source: It is not recommended to install these updates unless directed by FRC through our usual communication channels (FRC Blog, Team Updates or E-mail Blasts).
es_mx: No se recomienda instalar estas actualizaciones a menos que sean dirigidas por FRC a través de nuestros canales de comunicación habituales (FRC Blog, Team Updates o E-mail Blasts).
fr_ca: Il n’est pas recommandé d’installer ces mises à jour à moins d’être indiquées par FRC par l’intermédiaire de nos canaux de communication habituels (FRC Blog, mises à jour pour les équipes ou des publipostages).
tr_tr: Her zamanki iletişim kanallarımız (FRC Blog, Takım Güncellemeleri veya E-posta Patlamaları) aracılığıyla FRC tarafından yönlendirilmedikçe bu güncellemelerin yüklenmesi önerilmez.

source: Reboot to Complete Installation
es_mx: Reiniciar para Completar la Instalación
fr_ca: Faire un redémarrage, pour compléter l'Installation.
he_il: אתחל מחדש להתקנה מלאה
ja: インストールを完了するために再起動
tr_tr: Kurulumu Tamamlamak için Yeniden Başlatın

source: Choose reboot to complete the installation.
fr_ca: Choisissez de faire un redémarrage pour compléter l'installation.
ja: インストールを完成するために、再起動を行います。

source: If prompted, select :guilabel:`Reboot Now` after closing any open programs.
es_mx: Si así se incita, seleccione :guilabel:`Reboot Now` después de cerrar cualquier programa abierto
fr_ca: Si vous y êtes invité, sélectionnez :guilabel:`Reboot Now`, après avoir fermé tous les programmes ouverts.
ja: プロンプトが表示されたら、開いているプログラムをすべて終了し、 :guilabel:`Reboot Now` を選択してください。
tr_tr: İstenirse, açık programları kapattıktan sonra :guilabel:`Reboot Now` seçeneğini seçin.

source: Windows 10 or higher (Windows 10, 11).
ja: Windows 10以上（Windows 10, 11)。

source: Before installing the new version of the FRC Game Tools it is recommended to remove any old versions. The new version will likely co-exist with the old version (note that the DS will overwrite old versions), but all testing has been done with FRC 2022 only. Then click Start >> Add or Remove Programs. Locate the entry labeled "NI Software", and select :guilabel:`Uninstall`.
ja: FRC Game Toolsの新バージョンをインストールする前に、古いバージョンを削除することをお勧めします。新バージョンは旧バージョンと共存する可能性が高いが（DSは旧バージョンを上書きすることに注意）、すべてのテストはFRC 2022のみで行われました。スタートメニューから「プログラムの追加と削除」を開きます。「NI Software」の項目を探し､ :guilabel:`アンインストール` を選択してください。

source: Installation
es_mx: Instalación
he_il: התקנה
ja: インストール
tr_tr: Kurulum

source: Extraction
es_mx: Extracción
he_il: חילוץ
ja: 解凍
tr_tr: Extraction-Çıkarma

source: FRC Utilities
he_il: כלי העזר של FRC
tr_tr: FRC Yardımcı Programları

source: The LabVIEW runtime components required for the Driver Station and Utilities are included in this package.
es_mx: Los componentes del tiempo de ejecución de LabVIEW requeridos para la Driver Station y las utilidades vienen incluidas en este paquete.
he_il: רכיבי זמן הריצה של LabVIEW הנדרשים ל-Driver Station וכלי העזר כלולים בחבילה זו.
tr_tr: Driver Station ve Utilities için gerekli LabVIEW çalışma zamanı bileşenleri bu pakete dahildir.

source: No components from the LabVIEW Software for FRC package are required for running either the Driver Station or Utilities.
es_mx: Ningún componente del paquete de software de LabVIEW para FRC son requeridos para ejecutar ya sea la Driver Station o las utilidades.
he_il: אין צורך ברכיבים מחבילת LabVIEW Software for FRC להפעלת ה-Driver Station או כלי עזר.
tr_tr: Driver Station veya Utilities'i çalıştırmak için LabVIEW Software for FRC paketinden hiçbir bileşen gerekmez.

source: Before installing the new version of the FRC Game Tools it is recommended to remove any old versions. The new version will likely co-exist with the old version (note that the DS will overwrite old versions), but all testing has been done with FRC 2021 only. Then click Start >> Add or Remove Programs. Locate the entry labeled "National Instruments Software", and select :guilabel:`Uninstall`.
es_mx: Antes de instalar la nueva versión de FRC Game Tools se recomienda eliminar las versiones antiguas. La nueva versión probablemente coexistirá con la antigua (tenga en cuenta que la DS sobrescribirá las versiones antiguas), pero todas las pruebas se han hecho sólo con FRC 2021. Entonces haga clic en Inicio >> Agregar o quitar programas. Localice la entrada denominada "National Instruments Software", y seleccione :guilabel:`Uninstall`.
he_il: לפני התקנת הגרסה החדשה של FRC Game Tools, מומלץ להסיר את כל הגרסאות הישנות. הגרסה החדשה ככל הנראה תסתדר יחד עם הגרסה הישנה (שימו לב שה-DS דורס גרסאות ישנות), אך כל הבדיקות נעשו רק עם FRC 2021. לחצו על Start >> Add or Remove Programs. אתרו את הרשומה שכותרתו "National Instruments Software" ולחצו :guilabel:`Uninstall`.
tr_tr: FRC Oyun Araçlarının yeni sürümünü kurmadan önce eski sürümleri kaldırmanız önerilir. Yeni sürüm büyük olasılıkla eski sürümle birlikte var olacaktır (DS'nin eski sürümlerin üzerine yazacağını unutmayın), ancak tüm testler yalnızca FRC 2021 ile yapılmıştır. Ardından Başlat >> Program Ekle veya Kaldır'ı tıklayın. "National Instruments Software" etiketli girişi bulun ve seçin :guilabel:`Uninstall`.

source: It is only necessary to uninstall previous versions when installing a new year's tools. For example, uninstall the 2020 tools before installing the 2021 tools. It is not necessary to uninstall before upgrading to a new update of the 2021 game tools.
es_mx: Sólo es necesario desinstalar las versiones anteriores cuando se instalan las herramientas de un nuevo año. Por ejemplo, desinstale las herramientas de 2020 antes de instalar las herramientas de 2021. No es necesario desinstalar antes de actualizar a una nueva actualización de las herramientas del juego 2021.
tr_tr: Yeni yıl araçlarını kurarken yalnızca önceki sürümleri kaldırmak gerekir. Örneğin, 2021 araçlarını yüklemeden önce 2020 araçlarını kaldırın. 2021 oyun araçlarının yeni bir güncellemesine yükseltmeden önce kaldırmaya gerek yoktur.

source: Other installed programs may associate with iso files and the :guilabel:`mount` option may not appear. If that software does not give the option to mount or extract the iso file, then follow the directions in the "Offline Installer (Windows 7, 8, & 8.1)" tab.
es_mx: Otros programas instalados pueden asociar archivos iso y la opción :guilabel:`mount` puede que no aparezca. Si ese software no da la opción para montar o extraer el archivo iso, siga las direcciones en la pestaña de "Offline Installer (Windows 7, 8, & 8.1)".
tr_tr: Diğer yüklü programlar iso dosyalarıyla ilişkilendirilebilir ve :guilabel: `mount` seçeneği görünmeyebilir. Bu yazılım iso dosyasını bağlama veya çıkarma seçeneği sunmuyorsa, "Çevrimdışı Yükleyici (Windows 7, 8 ve 8.1)" sekmesindeki talimatları izleyin.

source: Install 7-Zip (download `here <https://www.7-zip.org>`__). As of the writing of this document, the current released version is 19.00 (2019-02-21). Right click on the downloaded iso file and select :guilabel:`Extract to`.
es_mx: Instale 7-Zip (descarguese `aquí <https://www.7-zip.org>`__). Al momento de escritura de este documento, la versión más reciente lanzada es la 19.00 (2019-02-21). Haga clic derecho en el archivo iso descargado y seleccione :guilabel:`Extract to`.
tr_tr: 7-Zip'i kurun (`buradan <https://www.7-zip.org>` __ indirin). Bu belgenin yazıldığı tarih itibariyle, mevcut yayınlanmış sürüm 19.00 (2019-02-21). İndirilen iso dosyasına sağ tıklayın ve şunu seçin :guilabel: `Extract to`.

source: Run ``install.exe`` from the extracted folder. Click :guilabel:`Yes` if a Windows Security prompt appears.
es_mx: Ejecute ``install.exe`` desde el folder extraído. Haga clic en :guilabel:`Yes` si una ventana de Windows Security aparece.
tr_tr: Çıkarılan klasörden ``install.exe`` dosyasını çalıştırın. Bir Windows Güvenlik istemi görünürse :guilabel:`Yes` e tıklayın.

source: Windows 7 or higher (Windows 7, 8, 8.1, 10). Windows 10 is the recommended OS.
es_mx: Windows 7 o más reciente (Windows 7, 8, 8.1, 10). Windows 10 es el sistema operativo recomendado.

source: Download the FRC Game Tools from `NI <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__.
es_mx: Descargue FRC Game Tools desde`NI <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__.
