Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-2/labview-setup.po
Languages: es_mx, fr_ca, tr_tr

source: Installing LabVIEW for FRC (LabVIEW only)
es_mx: Instalación LabVIEW para FRC (únicamente LabVIEW)
fr_ca: Installation de LabVIEW pour FRC (LabVIEW uniquement)
tr_tr: FRC için LabVIEW'i yükleme (yalnızca LabVIEW)

source: This installation is for teams programming in LabVIEW or using NI Vision Assistant only. C++ and Java teams not using these features do not need to install LabVIEW and should proceed to :doc:`Installing the FRC Game Tools </docs/zero-to-robot/step-2/frc-game-tools>`.
es_mx: Esta instalación es solo para equipos que programan en LabVIEW o usan NI Vision Assistant. Los equipos C++ y Java que no usan estas características no necesitan instalar LabVIEW y deben proceder a :doc:`Installing the FRC Game Tools </docs/zero-to-robot/step-2/frc-game-tools>`.
fr_ca: Cette installation s’adresse aux équipes qui programment en LabVIEW ou qui utilisent NI Vision Assistant uniquement. Les équipes C++ et Java qui n’utilisent pas ces fonctionnalités n’ont pas besoin d’installer LabVIEW et doivent passer à la section :doc:`Installation des outils de jeux FRC</docs/zero-to-robot/step-2/frc-game-tools>`.
tr_tr: Bu kurulum, LabVIEW'de programlama yapan veya yalnızca NI Vision Assistant kullanan ekipler içindir. Bu özellikleri kullanmayan C ++ ve Java ekiplerinin LabVIEW'i yüklemesine gerek yoktur ve şu şekilde devam etmelidir :doc:`Installing the FRC Game Tools </docs/zero-to-robot/step-2/frc-game-tools>`.

source: Download and installation times will vary widely with computer and internet connection specifications, however note that this process involves a large file download and installation and will likely take at least an hour to complete.
es_mx: Los tiempos de descarga e instalación variarán ampliamente según las especificaciones de conexión a Internet y computadora, sin embargo, tenga en cuenta que este proceso implica una descarga e instalación de archivos de gran tamaño y probablemente tardará al menos una hora en completarse.
fr_ca: Les temps de téléchargement et d’installation varient considérablement selon en fonction des spécifications de l'ordinateur et de la connexion Internet, prenez note cependant que ce processus implique un téléchargement et une installation de fichiers volumineux et prendra probablement au moins une heure.
tr_tr: İndirme ve yükleme süreleri, bilgisayar ve internet bağlantı özelliklerine göre büyük ölçüde değişecektir, ancak bu işlemin büyük bir dosya indirme ve yükleme içerdiğini ve muhtemelen tamamlanmasının en az bir saat alacağını unutmayın.

source: Requirements
fr_ca: Exigences

source: Windows 10 or higher (Windows 10, 11). Windows 11 is not officially supported by NI, but has been tested to work.
fr_ca: Windows 10 ou supérieur (Windows 10, 11). Windows 11 n'est pas officiellement pris en charge par NI, mais s'est avéré fonctionnel lorsque testé.

source: Uninstall Old Versions (Recommended)
es_mx: Desinstalar Versiones Anteriores (recomendado)
fr_ca: Désinstaller les anciennes versions (recommandé)
tr_tr: Eski Sürümleri Kaldırma (Önerilir)

source: If you wish to keep programming cRIOs you will need to maintain an install of LabVIEW for FRC\ |reg| 2014. The LabVIEW for FRC 2014 license has been extended. While these versions should be able to co-exist on a single computer, this is not a configuration that has been extensively tested.
es_mx: Si usted desea seguir programando cRIOs necesitará mantener una instalación de LabVIEW para FRC\ |reg| 2014. La licencia de LabVIEW para FRC 2014 se ha extendido. Mientras estas versiones deberían poder co-existir en una sola computadora, esta no es configuración que ha sido extensivamente probada.
fr_ca: Si vous souhaitez continuer avec la programmation de vos cRIOs, vous devrez maintenir une installation de LabVIEW pour FRC\ |reg| 2014. La licence LabVIEW pour FRC 2014 a été prolongée. Bien que ces versions devraient être en mesure de coexister sur un seul ordinateur, ce n’est pas une configuration qui a été largement testée.
tr_tr: Eğer cRIO'ları programlamaya devam etmek istiyorsanız, FRC \ | reg | için LabVIEW kurulumunu sürdürmeniz gerekecektir. 2014. LabVIEW for FRC 2014 lisansı uzatıldı. Bu sürümlerin tek bir bilgisayarda bir arada bulunabilmesi gerekirken, bu kapsamlı bir şekilde test edilmiş bir yapılandırma değildir.

source: Add or Remove -> NI Software
fr_ca: Ajouter (Add) ou supprimer (Remove) -> logiciel NI

source: Select Components to Uninstall
es_mx: Seleccionar Componentes para Desinstalar
fr_ca: Sélectionner les composants à désinstaller
tr_tr: Kaldırılacak Bileşenleri Seçin

source: In the dialog box that appears, select all entries. The easiest way to do this is to de-select the "Products Only" check-box and select the check-box to the left of "Name". Click Remove. Wait for the uninstaller to complete and reboot if prompted.
es_mx: En la caja de diálogo que aparece, seleccione todas las entradas. La forma más sencilla de hacer esto es desmarcar la viñeta de verificación “Solo productos” y seleccionar la viñeta a la izquierda llamada “Nombre”. Haga clic en remover. Espere a que la desinstalación se complete y reinicie si se le solicita.
fr_ca: Dans la boîte de dialogue qui s’affiche, sélectionnez toutes les entrées. La façon la plus simple de le faire est de dé-sélectionner la case à cocher "Products Only" et de sélectionner la case à cocher à gauche de "Name". Cliquez sur Supprimer. Attendez que le désinstallateur complète son travail et redémarrez si vous y êtes invité.
tr_tr: Görünen iletişim kutusunda tüm girişleri seçin. Bunu yapmanın en kolay yolu, "Products Only" onay kutusunun seçimini kaldırmak ve "Name" in solundaki onay kutusunu seçmektir. Remova'a tıklayın. Kaldırıcının tamamlanmasını ve sorduğunda yeniden başlamasını bekleyin.

source: These instructions assume that no other NI software is installed. If you have other NI software installed, it is necessary to uncheck the software that should not be uninstalled.
es_mx: Estas instrucciones asumen que ningún otro software National Instruments está instalado. Si tiene otro software National Instruments instalado, es necesario desmarcar el software que no debe desinstalarse.
fr_ca: Ces instructions supposent qu’aucun autre logiciel NI n’est installé. Si vous avez d’autres logiciels NI installés, il est nécessaire de décocher le logiciel qui ne doit pas être désinstallé.
tr_tr: Bu talimatlar, başka hiçbir NI yazılımının kurulu olmadığını varsayar. Yüklü başka NI yazılımınız varsa, kaldırılmaması gereken yazılımın işaretini kaldırmanız gerekir.

source: Using the checkbox in the upper left to select all.
fr_ca: Utilisez la case à cocher en haut à gauche pour tout sélectionner.

source: Getting LabVIEW installer
es_mx: Obtención del Instalador LabVIEW
fr_ca: Obtenir l’installateur LabVIEW
tr_tr: LabVIEW yükleyicisini edinme

source: Either locate and insert the LabVIEW USB Drive or download the `LabVIEW for FRC 2020 installer <https://www.ni.com/en-us/support/downloads/software-products/download.labview-software-for-frc.html>`__ from NI. Be sure to select the correct version from the drop-down.
es_mx: Localice e inserte la unidad USB de LabVIEW o descargue el `instalador de LabVIEW para FRC 2020 <https://www.ni.com/en-us/support/downloads/software-products/download.labview-software-for-frc.html>`__ de NI. Asegúrese de seleccionar la versión correcta en el menú desplegable.
fr_ca: Localiser et insérer la clé USB LabVIEW ou bien télécharger l'installateur `LabVIEW for FRC 2020 installer <https://www.ni.com/en-us/support/downloads/software-products/download.labview-software-for-frc.html>`__ à partir du site web de NI. Assurez-vous de sélectionner la version adéquate à partir de la liste déroulante.

source: The Download button for the NI installer with the offline installer link below it.
fr_ca: Le bouton Download (Télécharger) pour le programme d’installation de NI avec le lien du programme d’installation hors ligne en dessous.

source: If you wish to install on other machines offline, do not click the Download button, click **Individual Offline Installers** and then click Download, to download the full installer.
es_mx: Si desea instalarlo en otro ordenador sin conexión, no haga clic en el botón descargar, haga clic en **Instaladores Individuales Fuera de Línea** y después haga clic en descargar, para descargar el instalador completo.
fr_ca: Si vous souhaitez installer sur d’autres machines hors connexion, ne cliquez pas sur le bouton Télécharger, cliquez sur **Individual Offline Installers** puis cliquez sur **Download**, pour télécharger l’installateur complet.
tr_tr: Çevrimdışı diğer makinelere yüklemek isterseniz, İndir düğmesine tıklamayın, **Individual Offline Installers-Bireysel Çevrimdışı Yükleyiciler ** 'e tıklayın ve ardından tam yükleyiciyi indirmek için İndir'e tıklayın.

source: This is a large download (~8GB). It is recommended to use a fast internet connection and to use the NI Downloader to allow the download to resume if interrupted.
es_mx: Es una descarga pesada (~8GB). Se recomienda usar una conexión rápida de internet y utilice National Instruments Downloader para permitir que la descarga se reanude si se interrumpe.
fr_ca: Il s’agit d’un téléchargement volumineux (~8 Go). Il est recommandé d’utiliser une connexion Internet rapide et d’utiliser le downloader NI pour permettre au téléchargement de reprendre en cas d’interruption.
tr_tr: Bu büyük bir indirmedir (~8GB). Hızlı bir internet bağlantısı kullanmanız ve kesintiye uğrarsa indirmenin devam etmesine izin vermek için NI Downloader'ı kullanmanız önerilir.

source: Installing LabVIEW
es_mx: Instalando LabVIEW
fr_ca: Installation de LabVIEW
tr_tr: LabVIEW Kurulumu

source: NI LabVIEW requires a license. Each season’s license is active until January 31st of the following year (e.g. the license for the 2020 season expires on January 31, 2021)
es_mx: National Instruments LabVIEW requiere una licencia. La licencia de cada temporada permanece activa hasta el 31 de enero del siguiente año (por ejemplo, la licencia de la temporada 2020 expira el 31 de enero del 2021)
fr_ca: NI LabVIEW nécessite une licence. La licence de chaque saison est active jusqu’au 31 janvier de l’année suivante (p. ex. la licence pour la saison 2020 expire le 31 janvier 2021)
tr_tr: NI LabVIEW bir lisans gerektirir. Her sezonun lisansı, bir sonraki yılın 31 Ocak tarihine kadar geçerlidir (ör. 2020 sezonu lisansının süresi 31 Ocak 2021'de sona erer)

source: Teams are permitted to install the software on as many team computers as needed, subject to the restrictions and license terms that accompany the applicable software, and provided that only team members or mentors use the software, and solely for FRC. Rights to use LabVIEW are governed solely by the terms of the license agreements that are shown during the installation of the applicable software.
es_mx: Los equipos tienen permitido instalar el software en todos las computadoras que el equipo necesite, sujeto a las restricciones y términos de licencia que acompañan al software aplicable, y siempre y cuando sólo los miembros del equipo o mentores utilicen el software, y únicamente para FRC. Los derechos para usar LabVIEW se rigen únicamente por los términos de los acuerdos de licencia que se muestran durante la instalación del software aplicable.
fr_ca: Les équipes sont autorisées à installer le logiciel sur autant d’ordinateurs d’équipe que nécessaire, sous réserve des restrictions et des conditions de licence qui accompagnent le logiciel applicable, et à condition que seuls les membres de l’équipe ou les mentors utilisent le logiciel, et uniquement pour FRC. Les droits d’utilisation de LabVIEW sont régis uniquement par les termes des contrats de licence qui sont affichés lors de l’installation du logiciel applicable.
tr_tr: Takımların, ilgili yazılıma eşlik eden kısıtlamalara ve lisans koşullarına tabi olarak ve yazılımı yalnızca takım üyelerinin veya danışmanların yalnızca FRC için kullanması koşuluyla, yazılımı gerektiği kadar takım bilgisayarına kurmalarına izin verilir. LabVIEW'i kullanma hakları, yalnızca ilgili yazılımın kurulumu sırasında gösterilen lisans sözleşmelerinin hükümlerine tabidir.

source: Starting Install
es_mx: Iniciando Instalación
fr_ca: Démarrage de l’installation
tr_tr: Yüklemeyi Başlatma

source: Online Installer
es_mx: Instalador en línea
fr_ca: Installateur en ligne
tr_tr: Online - Çevrimiçi Yükleyici

source: Run the downloaded exe file to start the install process. Click :guilabel:`Yes` if a Windows Security prompt
es_mx: Ejecute el archivo exe descargado para iniciar la instalacion. Haga clic en :guilabel:`Si` si aparece un mensaje de seguridad de windows
fr_ca: Exécutez le fichier exe téléchargé pour démarrer le processus d’installation. Cliquez sur :guilabel:`Yes` si une invite de sécurité Windows apparaît.
tr_tr: Yükleme işlemini başlatmak için indirilen exe dosyasını çalıştırın. :guilabel:`Yes` Bir Windows Güvenlik istemi ise `Yes-Evet` e tıklayın.

source: Offline Installer (Windows 10+)
fr_ca: Installer hors ligne (Windows 10+)

source: Right click on the downloaded iso file and select mount. Run install.exe from the mounted iso. Click "Yes" if a Windows Security prompt
fr_ca: Cliquez avec le bouton droit sur le fichier iso téléchargé et sélectionnez montage. Exécutez install.exe à partir de l’iso monté. Cliquez sur "Yes" si une invite de sécurité Windows apparait.

source: other installed programs may associate with iso files and the mount option may not appear. If that software does not give the option to mount or extract the iso file, then install 7-Zip and use that to extract the iso.
fr_ca: d'autres programmes installés peuvent s'associer aux fichiers iso et l'option de montage peut ne pas apparaître. Si ce logiciel ne donne pas la possibilité de monter ou d'extraire le fichier iso, installez 7-Zip et utilisez-le pour extraire l'iso.

source: The menu after right clicking on an .iso file to choose "Mount".
fr_ca: Le menu après un clic droit sur un fichier .iso pour choisir "Mount".

source: NI Package Manager License
es_mx: Licencia de Administrador de Paquetes de National Instruments
fr_ca: Gestionnaire de packages de licences NI
tr_tr: NI Package Manager Lisansı

source: Accepting the License Agreement for NI Package Manager.
fr_ca: Acceptation du contrat de licence de NI Package Manager.

source: If you see this screen, click :guilabel:`Next`
es_mx: Si ve esta pantalla, haga clic en :guilabel:`Siguiente`
fr_ca: Si vous voyez cet écran, cliquez sur :guilabel:`Next`
tr_tr: Bu ekranı görürseniz, tıklayın :guilabel:`Next`

source: Disable Windows Fast Startup
es_mx: Deshabilitar el Inicio Rápido de Windows
fr_ca: Désactiver Windows Fast Startup
tr_tr: Windows Hızlı Başlangıç'ı devre dışı bırakın

source: Screen for disabling Windows fast startup.
fr_ca: Écran pour désactiver le démarrage rapide de Windows

source: NI Package Manager Review
es_mx: Revisión de Administrador de Paquetes de National Instruments
fr_ca: Revue du gestionnaire de packages NI
tr_tr: NI Package Manager İncelemesi

source: Review screen that shows what is about to be installed.
fr_ca: Écran de révision qui montre ce qui est sur le point d’être installé.

source: NI Package Manager Installation
es_mx: Instalación de Administrador de Paquetes de National Instruments
fr_ca: Installation du gestionnaire de packages NI
tr_tr: NI Package Manager Kurulumu

source: Screen with progress bars indicating the amount of completion.
fr_ca: Fenêtre avec des barres de progression indiquant la quantité complétée de l'installation.

source: Installation progress of the NI Package Manager will be tracked in this window
es_mx: El proceso de instalación de Administrador de Paquetes de National Instruments se rastreará en esta ventana.
fr_ca: La progression de l’installation du Gestionnaire de packages NI sera suivie dans cette fenêtre
tr_tr: NI Paket Yöneticisinin yükleme ilerlemesi bu pencerede izlenecektir

source: Product List
es_mx: Lista de Productos
fr_ca: Liste des produits
tr_tr: Ürün listesi

source: Select all of the products from the list.
fr_ca: Sélectionnez tous les produits dans la liste.

source: Click :guilabel:`Next`
es_mx: Haga clic en :guilabel:`Siguiente`
fr_ca: Cliquez sur :guilabel:`Next`
tr_tr: Tıklayın :guilabel:`Next`

source: Additional Packages
es_mx: Paquetes Adicionales
fr_ca: Packages supplémentaires
tr_tr: Ek Paketler

source: Leave all of the additional packages selected.
fr_ca: Laissez tous les packages supplémentaires sélectionnés.

source: License agreements
es_mx: Acuerdos de Licencia
fr_ca: Accords de Licence
tr_tr: Lisans anlaşmaları

source: Accept the NI software license agreement.
fr_ca: Acceptez le contrat de licence du logiciel NI.

source: Check "I accept..." then Click :guilabel:`Next`
es_mx: Marque “Acepto…” y después haga clic en :guilabel:`Siguiente`
fr_ca: Cochez :guilabel:`I accept...` cliquez ensuite sur :guilabel:`Next`
tr_tr: "I accept..." öğesini işaretleyin ve ardından :guilabel:`Next` tıklayın.

source: Accept the Silverlight license agreements.
fr_ca: Acceptez les contrats de licence Silverlight.

source: Product Information
es_mx: Información del Producto
fr_ca: Informations sur les produits
tr_tr: Ürün Bilgisi

source: Next through this page showing what will be installed.
fr_ca: Ensuite à travers cette page montrant ce qui sera installé.

source: Start Installation
es_mx: Comienzo de Instalación
fr_ca: Démarrer l’installation
tr_tr: Yüklemeyi başlat

source: Line item review of what will be installed.
fr_ca: Ligne passant en revue ce qui sera installé.

source: Overall Progress
es_mx: Progreso General
fr_ca: Progression globale
tr_tr: Genel ilerleme

source: Overall installation progress will be tracked in this window
es_mx: El progreso general de la instalación se realizará en esta ventana.
fr_ca: La progression de l'installation globale sera suivie dans cette fenêtre
tr_tr: Genel yükleme ilerlemesi bu pencerede izlenecektir

source: NI Update Service
es_mx: Servicio de Actualización National Instruments
fr_ca: Service de mises à jour NI
tr_tr: NI Update Hizmeti

source: The update service is not needed.
fr_ca: Le service de mise à jour n’est pas nécessaire.

source: You will be prompted whether to enable the NI update service. You can choose to not enable the update service.
es_mx: Se le preguntará si desea habilitar el servicio de actualización de National Instruments. Puede optar por no habilitar el servicio de actualización.
fr_ca: Vous serez invité à activer ou non le service de mises à jour NI. Vous pouvez choisir de ne pas activer le service de mises à jour.
tr_tr: NI güncelleme servisini etkinleştirip etkinleştirmemeniz sorulacaktır. Güncelleme hizmetini etkinleştirmemeyi seçebilirsiniz.

source: It is not recommended to install these updates unless directed by FRC through our usual communication channels (FRC Blog, Team Updates or E-mail Blasts).
es_mx: No es recomendado instalar estas actualizaciones a menos que FRC lo indique a través de nuestros canales de comunicación habituales (Blog de FRC, Actualizaciones de Equipo o Explosiones de Correo Electrónico).
fr_ca: Il n’est pas recommandé d’installer ces mises à jour sauf sur recommandation de FRC à travers nos canaux de communication habituels (FRC Blog, Team Updates ou E-mail Blasts).
tr_tr: Genel iletişim kanallarımız (FRC Blog, Takım Güncellemeleri veya E-posta duyurularu) aracılığıyla FRC tarafından yönlendirilmedikçe bu güncellemelerin yüklenmesi önerilmez.

source: NI Activation Wizard
es_mx: Asistente de Activación de National Instruments
fr_ca: Assistant Activation NI
tr_tr: NI Aktivasyon Sihirbazı

source: The NI Activation Wizard
fr_ca: L'assistant Activation NI

source: Click the :guilabel:`Log in to Activate` button.
fr_ca: Cliquez sur le bouton :guilabel:`Log in to Activate`.

source: The NI user login screen.
fr_ca: Fenêtre de connexion de l’utilisateur NI.

source: Log into your ni.com account. If you don't have an account, select :guilabel:`Create account` to create a free account.
es_mx: Ingrese en su cuenta ni.com. Si no tiene cuenta, seleccione :guilabel:`Crear cuenta` para crear una cuenta gratis.
fr_ca: Connectez-vous au compte ni.com. Si vous n’avez pas de compte, sélectionnez :guilabel:`Create account` pour créer un compte gratuit.
tr_tr: ni.com hesabınıza giriş yapın. Bir hesabınız yoksa, ücretsiz bir hesap oluşturmak için seçin :guilabel:`Create account` .

source: Screen so select how to activate LabVIEW.
fr_ca: Écran afin de sélectionner comment activer LabVIEW.

source: From the drop-down, select enter a serial number
fr_ca: Dans la liste déroulante, sélectionnez entrer un numéro de série

source: Screen for entering your product key.
fr_ca: Fenêtre pour saisir la clé de votre produit.

source: Enter the serial number in all the boxes. Click :guilabel:`Activate`.
fr_ca: Entrez le numéro de série dans toutes les cases. Cliquez sur :guilabel:`Activate`.

source: Screen details the activation success of each package.
fr_ca: Fenêtre détaillant l’activation réussie de chaque package.

source: If your products activate successfully, an "Activation Successful" message will appear. If the serial number was incorrect, it will give you a text box and you can re-enter the number and select :guilabel:`Try Again`. The items shown above are not expected to activate. If everything activated successfully, click :guilabel:`Finish`.
fr_ca: Si vos produits s'activent avec succès, un message "Activation Successful" apparaîtra. Si le numéro de série était incorrect, une zone de texte s'affichera et vous pourrez ressaisir le numéro et sélectionner :guilabel:`Try Again`. Les éléments affichés ci-dessus ne devraient pas s'activer. Si tout est activé avec succès, cliquez sur :guilabel:`Finish`.

source: Restart
es_mx: Reiniciar
fr_ca: Redémarrer

source: Choose reboot to complete the installation.
fr_ca: Choisissez l'option de redémarrage pour compléter l'installation.

source: Select :guilabel:`Reboot Now` after closing any open programs.
es_mx: Seleccione :guilabel:`Reinicie ahora` después de cerrar cualquier programa abierto.
fr_ca: Sélectionnez :guilabel:`Reboot Now` après la fermeture de tous les programmes ouverts.
tr_tr: Açık programları kapattıktan sonra :guilabel:`Reboot Now` seçin.

source: The version of LabVIEW used for the 2021 season is the same as the version used for the 2020 season. If you already have LabVIEW installed, it does not need to be re-installed. Instead see :ref:`docs/yearly-overview/relicensing-labview:Re-licensing LabVIEW for 2021 Season` for info on re-licensing your software.
es_mx: La versión de LabVIEW utilizada para la temporada 2021 es la misma que la utilizada para la temporada 2020. Si ya tiene LabVIEW instalado, no es necesario volver a instalarlo. En su lugar, consulte :ref:`docs/yearly-overview/relicensing-labview:Re-licensing LabVIEW for 2021 Season` para obtener información sobre la relicencia de su software.
