Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-2/labview-setup.po
Languages: es_mx, fr_ca, tr_tr

source: Before installing the new version of LabVIEW it is recommended to remove any old versions. The new version will likely co-exist with the old version, but all testing has been done with FRC 2020 only. Make sure to back up any team code located in the "User\\LabVIEW Data" directory before un-installing. Then click Start >> Add or Remove Programs. Locate the entry labeled "National Instruments Software", and select Uninstall.
es_mx: Antes de instalar la nueva versión de LabVIEW es recomendado remover cualquier versión anterior. La nueva versión probablemente es capaz de coexistir con la versión anterior, pero todas las pruebas se han realizado únicamente con FRC 2020. Asegúrese de hacer una copia de seguridad de cualquier código del equipo ubicado en el directorio “Usuario\\Datos de LabVIEW” antes de desinstalar. Después haga clic en Inicio >> Agregar o quitar programas. Localice la entrada denominada "Software de National Instruments" y seleccione desinstalar.
tr_tr: Yeni LabVIEW sürümünü yüklemeden önce eski sürümleri kaldırmanız önerilir. Yeni sürüm büyük olasılıkla eski sürümle birlikte var olabilecektir, ancak tüm testler yalnızca FRC 2020 ile yapılmıştır. Yüklemeyi kaldırmadan önce "User\\LabVIEW Data" dizininde bulunan takım kodlarını yedeklediğinizden emin olun. Ardından Başlat >> Program Ekle veya Kaldır'ı tıklayın. "National Instruments Software" etiketli girişi bulun ve Kaldır'ı seçin.

source: Offline Installer (Windows 10)
es_mx: Instalador Sin Conexión (Windows 10)
tr_tr: Çevrimdışı Yükleyici (Windows 10)

source: Right click on the downloaded iso file and select mount. Run install.exe from the mounted iso. Click “Yes” if a Windows Security prompt
es_mx: Haga clic derecho en el archivo iso descargado y seleccione la montura. Ejecute install.exe desde el iso montado. Haga clic en “Sí” si aparece un mensaje de seguridad de Windows.
tr_tr: İndirilen iso dosyasına sağ tıklayın ve mount seçin. Mount edilmiş iso'dan install.exe'yi çalıştırın. Windows Güvenlik istemi varsa "Evet" i tıklayın

source: other installed programs may associate with iso files and the mount option may not appear. If that software does not give the option to mount or extract the iso file, then follow the directions in the "Offline Installer (Windows 7, 8, & 8.1)" tab.
es_mx: Otros programas instalados podrían asociarse con archivos iso y la opción de montaje puede no aparecer. Si ese software no le da la opción de montaje o de extraer el archivo iso, después siga las direcciones en la pestaña “Instalador Sin Conexión (Windows 7, 8, & 8.1)”.
tr_tr: diğer yüklü programlar iso dosyalarıyla ilişkilendirilebilir ve bağlama seçeneği görünmeyebilir. Bu yazılım iso dosyasını bağlama veya çıkarma seçeneği sunmuyorsa, "Offline Installer-Çevrimdışı Yükleyici (Windows 7, 8 ve 8.1)" sekmesindeki talimatları izleyin.

source: Offline Installer (Windows 7, 8, & 8.1)
es_mx: Instalador Sin Conexión (Windows 7, 8, & 8.1)
tr_tr: Çevrimdışı Yükleyici (Windows 7, 8 ve 8.1)

source: Install 7-Zip (download `here <https://www.7-zip.org>`__). As of the writing of this document, the current released version is 19.00 (2019-02-21). Right click on the downloaded iso file and select Extract to.
es_mx: Instale 7-zip (descargue `aquí <https://www.7-zip.org>`__). A partir de la redacción de este documento, la versión actual es 19.00 (2019-02-21). Haga clic derecho en el archivo iso descargado y seleccione “Extraer a”.
tr_tr: 7-Zip'i kurun (`here <https://www.7-zip.org>`__ indirin). Bu belgenin yazıldığı tarih itibariyle, mevcut yayınlanmış sürüm 19.00 (2019-02-21). İndirilen iso dosyasına sağ tıklayın ve Çıkar öğesini seçin.

source: Run install.exe from the extracted folder. Click :guilabel:`Yes` if a Windows Security prompt appears.
es_mx: Ejecute install.exe desde la carpeta extraída. Haga clic en :guilabel:`Si` si aparece un mensaje de seguridad de Windows.
tr_tr: Çıkarılan klasörden install.exe dosyasını çalıştırın. Windows Güvenlik istemi görünürse: guilabel: `Evet'e tıklayın.

source: The serial number you entered at the "User Information" screen should appear in all of the text boxes, if it doesn't, enter it now. Click "Activate".
es_mx: El número de serie que ingresó en la pantalla “Información del Usuario” debería aparecer en todos los cuadros de texto, si no es así, ingréselo ahora. Haga clic en “Activar”.
tr_tr: "User Information" kısmında girdiğiniz seri numarası, tüm metin kutularında görünmelidir. Eğer seri numarası görünmüyorsa, şimdi girin ve "Activate"e tıklayın

source: If this is the first time activating the 2020 software on this account, you will see the message shown above about a valid license not being found. You can ignore this.
es_mx: Si esta es la primera vez activando el software del 2020 en esta cuenta, verá el mensaje anterior sobre que no se encuentra una licencia válida. Puede ignorar esto.
tr_tr: Eğer 2020 programını bu hesabınızda ilk defa aktif ediyorsanız, geçerli bir lisansınızın olmadığına dair uyarı mesajı göreceksiniz. Bu uyarıyı göz ardı edebilirsiniz.

source: If your products activate successfully, an “Activation Successful” message will appear. If the serial number was incorrect, it will give you a text box and you can re-enter the number and select :guilabel:`Try Again`. The items shown above are not expected to activate. If everything activated successfully, click :guilabel:`Next`.
es_mx: Si sus productos se activan correctamente, aparecerá un mensaje de “Activación Exitosa”. Si el número de serie era incorrecto, aparecerá un cuadro de texto y podrá volver a introducir el número y seleccionar :guilabel:`Intente de nuevo`. No se espera que se activen los elementos mostrados anteriormente. Si todo se activó correctamente, haga clic en :guilabel:`Siguiente`.
tr_tr: Ürünleriniz başarıyla etkinleştirilirse, "Activation Successful-Etkinleştirme Başarılı" mesajı görünecektir. Seri numarası yanlışsa, size bir metin kutusu verecektir ve numarayı yeniden girip şunu seçebilirsiniz :guilabel:`Try Again`. Yukarıda gösterilen öğelerin etkinleştirilmesi beklenmemektedir. Her şey başarıyla etkinleştirildiyse, tıklayın :guilabel:`Next`.

source: Click "Close".
es_mx: Haga clic en "Cerrar".
tr_tr: "Close-Kapat" ı tıklayın.

source: Either locate and insert the LabVIEW USB Drive or download the LabVIEW for FRC 2020 installer from `NI <https://www.ni.com/en-us/support/downloads/software-products/download.labview-software-for-frc.html>`__. Be sure to select the correct version from the drop-down.
tr_tr: Ya LabVIEW USB Sürücüsünü bulun ve takın ya da LabVIEW for FRC 2020 yükleyicisini `NI <https://www.ni.com/en-us/support/downloads/software-products/download.labview-software-for-frc.html>`__ adresinden indirin. Açılır menüden doğru sürümü seçtiğinizden emin olun.
