Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-2/offline-installation-preparations.po
Languages: ja, tr_tr

source: Offline Installation Preparation
ja: オフラインインストールの準備
tr_tr: Çevrimdışı Kurulum Hazırlığı

source: This article contains instructions/links to components you will want to gather if you need to do offline installation of the FRC\ |reg| Control System software.
ja: この記事には、FRC\ |reg| の制御システム・ソフトウェアをオフラインでインストールする際に必要なコンポーネントの説明とリンクを紹介します。
tr_tr: Bu makale, FRC\ |reg| Control System software'in çevrimdışı kurulumunu yapmanız gerektiğinde toplamak isteyeceğiniz bileşenlere yönelik yönergeler/bağlantılar içerir.

source: This document compiles all the download links from the following documents to make it easier to install on offline computers or on multiple computers. If you are you installing on a single computer that is connected to the internet, you can skip this page.
ja: このドキュメントでは、オフラインのコンピュータや複数のコンピュータに簡単にインストールできるように、以下のドキュメントからのダウンロードリンクをすべてまとめています。インターネットに接続された1台のコンピュータにインストールする場合は、このページをスキップできます。
tr_tr: Bu belge, çevrimdışı bilgisayarlara veya birden çok bilgisayara yüklemeyi kolaylaştırmak için aşağıdaki belgelerdeki tüm indirme bağlantılarını derler. İnternete bağlı tek bir bilgisayara kurulum yapıyorsanız, bu sayfayı atlayabilirsiniz.

source: The order in which these tools are installed does not matter for Java and C++ teams. LabVIEW should be installed before the FRC Game Tools or 3rd Party Libraries.
ja: これらのツールをインストールする順番は、JavaとC++チームには関係ありません。 LabVIEWはFRC Game Toolsや3rd Party Librariesの前にインストールする必要があります。
tr_tr: Bu araçların yüklenme sırası Java ve C ++ ekipleri için önemli değildir. LabVIEW, FRC Oyun Araçları veya 3. Taraf kütüphanelerinden önce kurulmalıdır.

source: Documentation
ja: ドキュメンテーション
tr_tr: Dökümantasyon

source: This documentation can be downloaded for offline viewing. The link to download the PDF can be found `here <https://buildmedia.readthedocs.org/media/pdf/frc-docs/stable/frc-docs.pdf>`__.
ja: このドキュメントはダウンロードしてオフラインで閲覧することができます。PDFをダウンロードするためのリンクは `こちら <https://buildmedia.readthedocs.org/media/pdf/frc-docs/stable/frc-docs.pdf>`__ です。

source: Installers
ja: インストーラー
tr_tr: Yükleyiciler

source: All Teams
ja: 全チーム
tr_tr: Tüm takımlar

source: `2023 FRC Game Tools <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html#479842>`__ (Note: Click on link for "Individual Offline Installers")
ja: `2023 FRC Game Tools <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html#479842>`__ （備考：「Individual Offline Installers」のリンクをクリックしてください。）

source: `2023 FRC Radio Configuration Utility <https://firstfrc.blob.core.windows.net/frc2023/Radio/FRC_Radio_Configuration_23_0_2.zip>`__ or `2023 FRC Radio Configuration Utility Israel Version <https://firstfrc.blob.core.windows.net/frc2023/Radio/FRC_Radio_Configuration_23_0_2_IL.zip>`__
ja: `2023 FRC 無線設定ユーティリティ <https://firstfrc.blob.core.windows.net/frc2023/Radio/FRC_Radio_Configuration_23_0_2.zip>`__ 、または `2023 FRC 無線設定ユーティリティ：イスラエルバージョン <https://firstfrc.blob.core.windows.net/frc2023/Radio/FRC_Radio_Configuration_23_0_2_IL.zip>`__

source: (Optional - Veterans Only!) `Classmate/Acer PC Image <https://frc-events.firstinspires.org/services/DSImages/>`__
ja: (オプション ｰ ベテラン向け！) `Classmate/Acer PCのイメージファイル <https://frc-events.firstinspires.org/services/DSImages/>`__
tr_tr: (İsteğe Bağlı - Yalnızca Veteran takımlar!) `Classmate/Acer PC Image <https://frc-events.firstinspires.org/services/DSImages/>`__

source: LabVIEW Teams
ja: LabVIEWを使うチーム
tr_tr: LabVIEW Takımları

source: LabVIEW USB (from *FIRST*\ |reg| Choice) or `Download <https://www.ni.com/en-us/support/downloads/drivers/download.labview-software-for-frc.html>`__ (Note: Click on link for "Individual Offline Installers")
ja: LabVIEW USB (*FIRST*\ |reg| Choiceから) または `ダウンロード <https://www.ni.com/en-us/support/downloads/drivers/download.labview-software-for-frc.html>`__ （備考：「Individual Offline Installers」のリンクをクリックしてください。）
tr_tr: LabVIEW USB (from *FIRST*\ |reg| Choice) veya `İndir <https://www.ni.com/en-us/support/downloads/drivers/download.labview-software-for-frc.html>`__ (Not: "Bireysel Çevrimdışı Yükleyiciler" bağlantısını tıklayın)

source: Java/C++ Teams
ja: Java/C++を使うチーム
tr_tr: Java/C++ Takımları

source: `Java/C++ WPILib Installer <https://github.com/wpilibsuite/allwpilib/releases/latest>`__
ja: `Java/C++ WPILib インストーラー <https://github.com/wpilibsuite/allwpilib/releases/latest>`__

source: Once on the GitHub releases page, scroll to the assets section at the bottom of the page.
ja: GitHubのリリースページで、ページ下部のassetsセクションまでスクロールしてください。

source: Latest WPILib release page on GitHub
ja: GitHubのWPILib最新リリースページ

source: Then click on the correct binary for your OS and architecture to begin the download.
ja: 次に、お使いのOSとアーキテクチャに適したバイナリをクリックしてダウンロードを開始します。

source: Assets at bottom of latest WPILib release page on GitHub
ja: GitHubの最新WPILibリリースページの下部にあるアセット

source: After downloading the Java/C++ WPILib installer, run it once while connected to the internet and select :guilabel:`Install for this User` then :guilabel:`Create VS Code zip to share with other computers/OSes for offline install` and save the downloaded VS Code zip file for future offline installations.
ja: Java/C++ WPILibインストーラーをダウンロードした後、インターネットに接続し、一度実行し、 :guilabel:`Install for this User` を選択し、次に :guilabel:`Create VS Code zip to share with other computers/OSes for offline install` を選択します。ダウンロードされたVS Codeのzipファイルを将来のインストールを行うために保存します。

source: 3rd Party Libraries/Software
ja: サードパーティライブラリ/ソフトウェア
tr_tr: 3. Taraf Kitaplıkları/Yazılımları

source: A directory of available 3rd party software that plugs in to WPILib can be found on :ref:`docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries`.
ja: WPILibにプラグイン可能なサードパーティソフトウェアのディレクトリは :ref:`docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries` にあります。
tr_tr: WPILib'e bağlanan mevcut 3. taraf yazılımların bir dizini şu adreste bulunabilir: :ref:`docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries`.

source: This documentation can be downloaded for offline viewing. The link to download the PDF can be found `here <https://buildmedia.readthedocs.org/media/pdf/frc-docs/latest/frc-docs.pdf>`__.
tr_tr: Bu belgeler çevrimdışı görüntüleme için indirilebilir. PDF'yi indirmek için bağlantı burada <https://buildmedia.readthedocs.org/media/pdf/frc-docs/latest/frc-docs.pdf>`__.

source: `2021 FRC Game Tools <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__ (Note: Click on link for "Individual Offline Installers")
tr_tr: `2021 FRC Oyun Araçları <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>` __ (Not: "Bireysel Çevrimdışı Yükleyiciler" için bağlantıya tıklayın)

source: There are no changes to the radio tool for the 2021 season so the 20.0.0 version remains the latest available.
tr_tr: 2021 sezonu için radyo aracında herhangi bir değişiklik olmadığından 20.0.0 sürümü mevcut en son sürüm olarak kalacaktır.

source: The dropdown on this page will say 2020 because the 2021 base LabVIEW version is identical to what was used in 2020. If you already have the 2020 version installed see :ref:`docs/yearly-overview/relicensing-labview:Re-licensing LabVIEW for 2021 Season` for info on re-licensing your installation.
tr_tr: Bu sayfadaki açılır menü 2020 yazacaktır çünkü 2021 temel LabVIEW sürümü 2020'de kullanılanla aynıdır. 2020 sürümünü zaten yüklediyseniz bkz :ref:`docs/yearly-overview/relicensing-labview:Re-licensing LabVIEW for 2021 Season` için kurulumunuzun yeniden lisanslanması hakkında bilgi için.

source: `Java/C++ WPILib Installer <https://github.com/wpilibsuite/allwpilib/releases>`__
tr_tr: `Java/C++ WPILib Yükleyici <https://github.com/wpilibsuite/allwpilib/releases>`__

source: After downloading the Java/C++ WPILib installer, run it once while connected to the internet and download VS Code for all platforms and save the downloaded VS Code zip file for future offline installations.
tr_tr: Java / C ++ WPILib yükleyicisini indirdikten sonra, internete bağlıyken bir kez çalıştırın ve tüm platformlar için VS Code'u indirin ve indirilen VS Code zip dosyasını gelecekteki çevrimdışı kurulumlar için kaydedin.
