Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-2/step-2-next-steps.po
Languages: fr_ca, zh_cn

source: Next Steps
fr_ca: Étapes suivantes
zh_cn: 下一步

source: Congratulations! You have completed step 2 and should now have a working software development environment! Step 3 of this tutorial covers updating the hardware so that you can program it, while Step 4 showcases programming a robot in the VS Code Integrated Development Environment (IDE). For further information you can read through the :ref:`VS Code section <docs/software/vscode-overview/index:VS Code Overview>` to familiarize yourself with the IDE.
fr_ca: Toutes nos félicitations! Vous avez terminé l'étape 2 et vous devriez maintenant disposer d'un environnement de développement logiciel fonctionnel! L'étape 3 de ce didacticiel couvre la mise à jour du matériel afin que vous puissiez le programmer, tandis que l'étape 4 présente la programmation d'un robot dans l'environnement de développement intégré (IDE) VS Code. Pour plus d'informations, vous pouvez consulter :ref:`la section VS Code <docs/software/vscode-overview/index:VS Code Overview>` pour vous familiariser avec l'EDI.
zh_cn: 恭喜你！您已经完成了第2步，现在应该已经可以使用软件开发环境！本教程的第3步介绍如何更新硬件，以便对其进行编程，而第4步则展示了在VS Code集成开发环境（IDE）中对机器人进行编程。有关更多信息，您可以通读:ref:`VS Code section <docs/software/vscode-overview/index:VS Code Overview>`以熟悉IDE。

source: Specific articles that are advised to be read are:
fr_ca: Les articles spécifiques que nous conseillons de lire sont:
zh_cn: 建议阅读的特定文章是：

source: :ref:`Visual Studio Code Basics <docs/software/vscode-overview/vscode-basics:Visual Studio Code Basics and the WPILib Extension>`
fr_ca: :ref:`Les bases de Visual Studio Code <docs/software/vscode-overview/vscode-basics:Visual Studio Code Basics and the WPILib Extension>`
zh_cn: :ref:`Visual Studio Code 基础 <docs/software/vscode-overview/vscode-basics:Visual Studio Code Basics and the WPILib Extension>`

source: :ref:`WPILib Commands in Visual Studio Code <docs/software/vscode-overview/wpilib-commands-vscode:WPILib Commands in Visual Studio Code>`
fr_ca: :ref:`Commandes WPILib sous Visual Studio Code <docs/software/vscode-overview/wpilib-commands-vscode:WPILib Commands in Visual Studio Code>`
zh_cn: :ref:`Visual Studio Code 中的 WPILib命令<docs/software/vscode-overview/wpilib-commands-vscode:WPILib Commands in Visual Studio Code>`

source: :ref:`Creating a Robot Program <docs/software/vscode-overview/creating-robot-program:Creating a Robot Program>`
fr_ca: :ref:`Créer le programme du robot <docs/software/vscode-overview/creating-robot-program:Creating a Robot Program>`
zh_cn: :ref:`创建机器人程序 <docs/software/vscode-overview/creating-robot-program:Creating a Robot Program>`

source: :ref:`Building and Deploying Robot Code <docs/software/vscode-overview/deploying-robot-code:Building and Deploying Robot Code>`
fr_ca: :ref:`Compiler et télécharger le code du robot <docs/software/vscode-overview/deploying-robot-code:Building and Deploying Robot Code>`
zh_cn: :ref:`构建和部署机器人代码 <docs/software/vscode-overview/deploying-robot-code:Building and Deploying Robot Code>`

source: :ref:`Installing 3rd Party Libraries <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>`
fr_ca: :ref:`Librairies tierces <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>`
zh_cn: :ref:`安装第三方库 <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>`

source: Additionally, you may need to do extra configuration that is applicable to your team's robot. Please utilize the search feature to find necessary documentation.
fr_ca: De plus, vous devrez peut-être effectuer une configuration supplémentaire applicable au robot de votre équipe. Veuillez utiliser la fonction de recherche pour trouver la documentation nécessaire.
zh_cn: 此外，您可能需要进行适用于队伍机器人的额外配置。请利用搜索功能查找必要的文档。

source: It's important that teams using 3rd-party CAN motor controllers look at the :ref:`Installing 3rd Party Libraries <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>` article as extra steps are required to code for these devices.
fr_ca: Il est important que les équipes utilisant les contrôleurs de moteur CAN fournis par des fournisseurs indépendants consultent l’article :ref:`Installation des librairies des fournisseurs <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>` car des étapes supplémentaires sont nécessaires pour programmer ces composants.
zh_cn: 使用第三方CAN电机控制器的团队请务必阅读:ref:`安装第三方库 <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>` 一文，因为为这些设备编写代码需要额外的步骤。
