Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-2/wpilib-setup.po
Languages: es_mx, fr_ca, he_il, ja

source: After installation, the installer opens the WPILib VS Code folder. Drag the VS Code application to the dock. Eject WPILibInstaller image from the desktop.
es_mx: Después de la instalación, el instalador abre la carpeta WPILib VS Code. Arrastre la aplicación VS Code al dock. Expulsar la imagen de WPILibInstaller del escritorio.
fr_ca: Après l’installation, l’installateur ouvre le dossier WPILib VS Code. Faites glisser l’application VS Code sur le dock. Éjectez l'image WPILibInstaller du bureau.
he_il: לאחר ההתקנה, המתקין פותח את תיקיית ה-WPILib VS Code. גרור את היישום VS Code ל-Dock. הוצא את דמות הכונן WPILibInstaller משולחן העבודה.
ja: インストール後、インストーラはWPILib VS Codeフォルダを開きます。VS Codeアプリケーションをドックにドラッグします。デスクトップからWPILibInstallerイメージを取り除きます。

source: Some versions of Linux (e.g. Ubuntu 22.04 and later) require you to give the desktop shortcut the ability to launch. Right click on the desktop icon and select Allow Launching.
fr_ca: Certaines versions de Linux (par exemple Ubuntu 22.04 et ultérieures) vous obligent à donner au raccourci de bureau la possibilité de démarrer. Cliquez à droite sur l’icône de bureau et sélectionnez Allow Launching.

source: Menu that pops up after right click the desktop icon in Linux.
fr_ca: Menu qui apparaît après avoir cliqué sur le bouton droit de la souris sur l’icône du bureau sous Linux.
ja: Linuxでデスクトップアイコンを右クリックすると出てくるメニュー。

source: Ubuntu 23.10 and later `disable the kernel user namespaces feature for unknown applications <https://ubuntu.com/blog/ubuntu-23-10-restricted-unprivileged-user-namespaces>`__. This means that the `sandboxing feature <https://code.visualstudio.com/blogs/2022/11/28/vscode-sandbox>`__ won't work on the WPILib VS Code. To enable sandboxing for the WPILib applications, AppArmor profiles are provided, and can be installed using the command below.
fr_ca: Pour Ubuntu 23.10 et ultérieur `désactiver les namespaces utilisateur du noyau pour des applications inconnues <https://ubuntu.com/blog/ubuntu-23-10-restricted-unprivileged-user-namespaces>`__. Cela signifie que la `fonctionnalité de bac-à-sable <https://code.visualstudio.com/blogs/2022/11/28/vscode-sandbox>`__ ne fonctionnera pas sur le VS Code WPILib. Pour activer les fonctionnalités de bac-à-sable pour les applications WPILib, des profils AppArmor sont fournis et peuvent êtres installés avec la commande ci-dessous.

source: Installing desktop tools and rebooting will create a folder on the desktop called ``YYYY WPILib Tools``, where ``YYYY`` is the current year. Desktop tool shortcuts are not available on Linux and macOS.
fr_ca: L’installation des outils de bureau et le redémarrage créeront un dossier sur le bureau appelé ``YYYY WPILib Tools``, où ``YYYY`` est l’année en cours. Les raccourcis des outils de bureau ne sont pas disponibles sous Linux et MacOS.
ja: デスクトップツールをインストールして再起動すると、デスクトップ上に ``YYYY WPILib Tools`` というフォルダが作成されます（ ``YYYY`` は現在の年）。デスクトップツールのショートカットはLinuxとmacOSでは利用できません。

source: Additional C++ Installation for Simulation
fr_ca: Installation C++ supplémentaire pour la simulation
ja: シミュレーション用C++の追加インストール

source: C++ robot simulation requires that a native compiler to be installed. For Windows, this would be `Visual Studio 2022 version 17.9 or later <https://visualstudio.microsoft.com/vs/>`__ (**not** VS Code), macOS requires `Xcode 14 or later <https://apps.apple.com/us/app/xcode/id497799835>`__, and Linux (Ubuntu) requires the ``build-essential`` package.
fr_ca: La simulation de robot C++ nécessite l'installation d'un compilateur natif. Pour Windows, ce serait `Visual Studio 2022 version 17.9 ou ultérieur <https://visualstudio.microsoft.com/vs/>`__ (**pas** VS Code), macOS requiert `Xcode 14 ou ultérieur <https://apps.apple.com/us/app/xcode/id497799835>`__, et Linux (Ubuntu) nécessite le package ``build-essential``.

source: Ensure the :guilabel:`Desktop Development with C++` option is checked in the Visual Studio installer for simulation support.
fr_ca: Assurez-vous que l'option :guilabel:`Desktop Development with C++` est cochée dans le programme d'installation de Visual Studio pour la prise en charge de la simulation.
ja: シミュレーションをサポートするVisual Studioのインストーラで、 :guilabel:`Desktop Development with C++` オプションがチェックされていることを確認してください。

source: Screenshot of the Visual Studio build tools option
fr_ca: Capture d’écran de l’option outils de compilation de Visual Studio
ja: Visual Studioのビルドツールオプションのスクリーンショット

source: What is Installed?
es_mx: ¿Qué se instaló?
fr_ca: Qu’est-ce qui a été installé?
he_il: מה הותקן?
ja: 何がインストールされているのか？

source: The Offline Installer installs the following components:
es_mx: El instalador sin conexión instala los siguientes componentes:
fr_ca: Le programme d'installation hors ligne installe les composants suivants:
he_il: המתקין הלא מקוון מתקין את הרכיבים הבאים:
ja: オフラインインストーラは、以下のコンポーネントをインストールします：

source: **Visual Studio Code** - The supported IDE for 2019 and later robot code development. The offline installer sets up a separate copy of VS Code for WPILib development, even if you already have VS Code on your machine. This is done because some of the settings that make the WPILib setup work may break existing workflows if you use VS Code for other projects.
es_mx: **Visual Studio Code** - El IDE compatible para 2019 y el desarrollo de código de robot posterior. El instalador fuera de línea configura una copia separada de VS Code para el desarrollo de WPILib, incluso si ya tiene VS Code en su máquina. Esto se hace porque algunas de las configuraciones que hacen que la configuración de WPILib funcione pueden romper los flujos de trabajo existentes si usa VS Code para otros proyectos.
fr_ca: **Visual Studio Code** - L’IDE pris en charge à partir de 2019 et en montant pour le développement du code robot. L’installateur hors ligne définit une copie distincte de VS Code pour le développement WPILib, même si vous avez déjà VS Code sur votre ordinateur. Cela est possible car certains des paramètres pour la configuration et le bon fonctionnement de la WPILib peuvent briser les flux de travail existants si vous utilisez VS Code pour d’autres projets.
he_il: **Visual Studio Code** - ה-IDE הנתמך לפיתוח קוד לרובוטים החל מ-2019. המתקין הלא מקוון מגדיר עותק נפרד של VS Code לפיתוח WPILib, גם אם כבר יש לכם VS Code מותקן. זה נעשה מכיוון שחלק מההגדרות הנדרשות ל-WPILib עשויות לשבור את תהליכי העבודה הקיימים אם אתם משתמשים ב-VS Code לפרויקטים אחרים.
ja: **Visual Studio Code** - 2019年以降のロボットコード開発に対応したIDEです。オフラインインストーラは、お使いのマシンにすでにVS Codeがある場合でも、WPILib開発用にVS Codeの別コピーをセットアップします。これは、WPILibのセットアップを機能させる設定の一部が、他のプロジェクトにVS Codeを使用している場合、既存のワークフローを壊す可能性があるためです。

source: **C++ Compiler** - The toolchains for building C++ code for the roboRIO
es_mx: **C++ Compiler** - Las cadenas de herramientas para construir código de C++ para la roboRIO
fr_ca: **C++ Compiler** - Les chaînes de compilation pour la création du code C++ pour le roboRIO
he_il: **C++ Compiler** - הכלי לבניית קוד C++ עבור ה-roboRIO
ja: **C++コンパイラ** - roboRIO用のC++コードをビルドするためのツールチェーン。

source: **Gradle** - The specific version of Gradle used for building/deploying C++ or Java robot code
es_mx: **Gradle** - La versión específica de Gradle usada para construir/desplegar código de robot C++ o Java
fr_ca: **Gradle** - La version spécifique de Gradle utilisée pour la création/déploiement du code robot C++ ou Java
he_il: **Gradle** - גרסת ה-Gradle עבור בנייה/הורדת קוד רובוט ב-C++ או Java
ja: **Gradle** - C++またはJavaロボットコードのビルド/デプロイに使用されるGradleの特定のバージョン

source: **Java JDK/JRE** - A specific version of the Java JDK/JRE that is used to build Java robot code and to run any of the Java based Tools (Dashboards, etc.). This exists side by side with any existing JDK installs and does not overwrite the JAVA_HOME variable
es_mx: **Java JDK/JRE** - Una versión específica de Java JDK/JRE que se utiliza para crear código de robot Java y para ejecutar cualquiera de las herramientas basadas en Java (Dashboards, etc.). Esto existe al lado de cualquier instalación de JDK existente y no sobrescribe la variable JAVA_HOME
fr_ca: **Java JDK/JRE** - Une version spécifique de Java JDK/JRE qui est utilisée pour construire le code robot Java et pour exécuter l’un des outils basés sur Java (Dashboard, etc.). Celle-ci cohabite avec les installations JDK déjà existantes et n'écrase pas la variable JAVA_HOME
he_il: **Java JDK/JRE** - גרסה ספציפית של Java JDK/JRE המשמשת לבניית קוד Java לרובוט ולהפעלת כל אחד מהכלים מבוססי Java (לוחות מחוונים וכו׳). זה מתקיים יחד עם כל התקנות ה-JDK הקיימות ואינו מחליף את המשתנה JAVA_HOME.
ja: **Java JDK/JRE** - Javaロボット・コードを構築し、Javaベースのツール（ダッシュボードなど）を実行するために使用されるJava JDK/JREの特定のバージョン。これは、既存のJDKインストールと並んで存在し、JAVA_HOME変数を上書きしません。

source: **WPILib Tools** - SmartDashboard, Shuffleboard, RobotBuilder, OutlineViewer, PathWeaver, Glass, SysId, Data Log Tool, roboRIO Team Number Setter, AdvantageScope
fr_ca: **Outils WPILib** - SmartDashboard, Shuffleboard, RobotBuilder, Outline Viewer, Pathweaver, Glass, SysID, Data Log Tool, roboRIO Team Number Setter, AdvantageScope

source: **VS Code Extensions** - WPILib and Java/C++/Python extensions for robot code development in VS Code
fr_ca: **VS Code Extensions** - Extensions WPILib et Java/C++/Python pour le développement du code robot sous VS Code

source: **Documentation** - Offline copies of this frc-docs documentation and Java/C++/Python APIs
fr_ca: **Documentation** - Copies hors-ligne de la documentation frc-docs et les API Java/C++/Python

source: Uninstalling
es_mx: Desinstalando
fr_ca: Désinstallation
he_il: הסרת ההתקנה
ja: アンインストール

source: WPILib is designed to install to different folders for different years, so that it is not necessary to uninstall a previous version before installing this year's WPILib. However, the following instructions can be used to uninstall WPILib if desired.
es_mx: WPILib está diseñado para poderse instalar en diferentes carpetas durante diferentes años, así que no es necesario desinstalar una versión previa antes de instalar WPILib de este año. No obstante, las siguientes instrucciones pueden usarse para desinstalar WPILib si es que se desea.
fr_ca: WPILib est conçu pour être installé dans différents dossiers pendant différentes années, de sorte qu'il n'est pas nécessaire de désinstaller une version précédente avant d'installer le WPILib de cette année courante. Cependant, les instructions suivantes peuvent être utilisées pour désinstaller WPILib si vous le souhaitez.
he_il: WPILib מעוצב כך שיהיה אפשר להתקין שנים שונות בתיקיות נפרדות, כך שלא צריך להסיר גרסא ישנה בשביל להתקין את WPILib של השנה. למרות זאת, אם רוצים, ניתן לעקוב אחר ההוראות הבאות כדי להסיר את WPILib.
ja: WPILibは年ごとに異なるフォルダにインストールされるように設計されているため、今年のWPILibをインストールする前に以前のバージョンをアンインストールする必要はありません。WPILibのアンインストールは以下の手順で行うことができます。

source: Windows
fr_ca: Pour Windows

source: Delete the desktop icons at ``C:\Users\Public\Public Desktop``
es_mx: Elimine los iconos del escritorio en ``C:\Users\Public\Public Desktop``
fr_ca: Supprimez les icônes du bureau dans ``C:\Users\Public\Public Desktop``
he_il: מחקו את האיקונים ב-``C:\Users\Public\Public Desktop``
ja: ``C:\Users\Public\Public Desktop`` にあるデスクトップアイコンを削除する

source: Troubleshooting
es_mx: Solución de problemas
fr_ca: Dépannage
he_il: פתרון בעיות
ja: トラブルシューティング

source: This guide is intended for Java and C++ teams. LabVIEW teams can skip to :doc:`labview-setup`. Additionally, the below tutorial shows Windows 10, but the steps are identical for all operating systems. Notes differentiating operating systems will be shown.
es_mx: Esta guía está destinada a equipos que usan Java y C ++. Los equipos que usan LabVIEW pueden saltarse a: :doc:`labview-setup`. Además, el siguiente tutorial muestra Windows 10, pero los pasos son idénticos para todos los sistemas operativos. Se mostrarán notas que diferencian los sistemas operativos.
ja: このガイドはJavaとC++のチームを対象としています。LabVIEWチームは :doc:`labview-setup` まで読み飛ばしてください。さらに、以下のチュートリアルはWindows 10を示していますが、手順はすべてのオペレーティングシステムで同じです。オペレーティングシステムを区別する注記が表示されます。

source: Ubuntu 22.04, 64 bit. Other Linux distributions with glibc >= 2.34 may work, but are unsupported
ja: Ubuntu 22.04、64ビット。glibc >= 2.34の他のLinuxディストリビューションでも動作する可能性がありますが、サポートされていません。

source: macOS 11 or higher, both Intel and Arm for Java. C++ requires macOS 12 or higher with Xcode 14.
ja: macOS 11以上、JavaはIntelとArmの両方。C++はmacOS 12以上あるいはXcode 14が必要です。

source: The following OSes are no longer supported: macOS 10.15, Ubuntu 18.04 & 20.04, Windows 7, Windows 8.1, and any 32-bit Windows.
ja: 次のOSはサポートが終了しています：macOS 10.15、Ubuntu 18.04 & 20.04、Windows 7、Windows 8.1、およびすべての32ビットWindows。

source: Windows 10+
ja: Windows 10以上

source: :guilabel:`Tools Only` installs just the WPILib tools (Pathweaver, Shuffleboard, RobotBuilder, SysID, Glass, and OutlineViewer) and JDK.
ja: :guilabel:`Tools Only` はWPILibツール（Pathweaver、Shuffleboard、RobotBuilder、SysID、Glass、OutlineViewer）とJDKだけをインストールします。

source: Some versions of Linux (e.g. Ubuntu 20.04) require you to give the desktop shortcut the ability to launch. Right click on the desktop icon and select Allow Launching.
es_mx: Algunas versiones de Linux (por ejemplo, Ubuntu 20.04) requieren que le des al acceso directo del escritorio la capacidad de iniciarse. Haga clic derecho en el icono del escritorio y seleccione Permitir lanzamiento.
he_il: הפצות מסוימות של לינוקס (למשל Ubuntu 20.04) דורשות ממך לתת לקיצור הדרך לשולחן העבודה את הרשאה לרוץ. לחצו לחיצה ימנית על סמל שולחן העבודה ובחרו Allow Launching.
ja: Linuxのバージョンによっては（Ubuntu 20.04など）、デスクトップ・ショートカットに起動機能を与える必要があります。デスクトップアイコンを右クリックし、起動を許可する、を選択します。

source: C++ robot simulation requires that a native compiler to be installed. For Windows, this would be `Visual Studio 2022 <https://visualstudio.microsoft.com/vs/>`__ (**not** VS Code), macOS requires `Xcode 14 or later <https://apps.apple.com/us/app/xcode/id497799835>`__, and Linux (Ubuntu) requires the ``build-essential`` package.
ja: C++ロボット・シミュレーションでは、ネイティブ・コンパイラをインストールする必要があります。Windowsでは `Visual Studio 2022 <https://visualstudio.microsoft.com/vs/>`__ (VS Code **ではありません** )、macOSでは `Xcode 14以降 <https://apps.apple.com/us/app/xcode/id497799835>`__ 、Linux (Ubuntu)では ``build-essential`` パッケージが必要です。

source: **WPILib Tools** - SmartDashboard, Shuffleboard, RobotBuilder, Outline Viewer, Pathweaver, Glass, SysID
ja: **WPILibツール** - SmartDashboard、Shuffleboard、RobotBuilder、Outline Viewer、Pathweaver、Glass、SysID

source: **WPILib Dependencies** - OpenCV, etc.
he_il: **WPILib Dependencies** - כמו OpenCV, וכו׳.
ja: **WPILibの依存関係** - OpenCVなど

source: **VS Code Extensions** - WPILib extensions for robot code development in VS Code
es_mx: **VS Code Extensions** - Las extensiones de WPILib para desarrollo de código de robot en VS Code
he_il: **הרחבות VS Code** - הרחבות WPILib לבניית קוד לרובוט ב-VS Code
ja: **VS Code Extensions** - VS Codeでのロボットコード開発のためのWPILib拡張機能

source: Delete the appropriate wpilib folder (``c:\Users\Public\wpilib\YYYY`` where ``YYYY`` is the year to uninstall)
ja: 適したwpilibフォルダ（ ``c:\Users\Public\wpilib\YYYY`` 、``YYYY`` はアンインストールする年）を削除する

source: Delete the appropriate wpilib folder (``~/wpilib/YYYY`` where ``YYYY`` is the year to uninstall)
ja: 適した wpilib フォルダを削除する ( ``~/wpilib/YYYY`` 、``YYYY`` はアンインストールする年)

source: Delete the appropriate wpilib folder (``~/wpilib/YYYY`` where ``YYYY`` is the year to uninstall). eg ``rm -rf ~/wpilib/YYYY``
ja: 適した wpilib フォルダを削除する ( ``~/wpilib/YYYY`` 、``YYYY`` はアンインストールする年)。例： ``rm -rf ~/wpilib/YYYY``

source: In case the installer fails, please open an issue on the installer repository. A link is available `here <https://github.com/wpilibsuite/wpilibinstaller-avalonia>`__. The installer should give a message on the cause of the error, please include this in the description of your issue.
es_mx: En caso de que el instalador falle, abra un problema en el repositorio del instalador. Un enlace está disponible `aquí <https://github.com/wpilibsuite/wpilibinstaller-avalonia>` __. El instalador debe dar un mensaje sobre la causa del error, por favor inclúyalo en la descripción de su problema.
he_il: במקרה שההתקנה נכשלה, פתחו בעיה ב-Repository של המתקין. קישור נמצא `כאן <https://github.com/wpilibsuite/wpilibinstaller-avalonia>`__. המתקין מציין הודעה על סיבת השגיאה, אנא כללו אותה בתיאור הבעיה.
ja: インストーラが失敗した場合は、インストーラリポジトリで issue を開いてください。リンクは `こちら <https://github.com/wpilibsuite/wpilibinstaller-avalonia>`__ にあります。インストーラはエラーの原因に関するメッセージを表示するはずです。これを問題の説明に含めてください。

source: You can download the latest release of the installer from `GitHub <https://github.com/wpilibsuite/allwpilib/releases/latest/>`__. Ensure that you download the correct binary for your OS and architecture.
es_mx: Puede descargar la última versión lanzada del instalador de `GitHub <https://github.com/wpilibsuite/allwpilib/releases/latest/>`__. Asegúrese de descargar el binario correcto para su sistema operativo y arquitectura.
he_il: ניתן להוריד את הגרסה האחרונה של המתקין מ-`GitHub <https://github.com/wpilibsuite/allwpilib/releases/latest/>`__. הקפדו להוריד את הבינארי הנכון עבור מערכת ההפעלה שלכם.

source: Windows 7 users must have an updated system with `this <https://support.microsoft.com/en-us/help/2999226/update-for-universal-c-runtime-in-windows>`__ update installed.
es_mx: Los usuarios de Windows 7 deben de tener un sistema actualizado con `esta <https://support.microsoft.com/en-us/help/2999226/update-for-universal-c-runtime-in-windows>`__ actualización instalada.
he_il: למשתמשי Windows 7 חייבת להיות מערכת הפעלה מעודכנת עם `עדכון זה <https://support.microsoft.com/en-us/help/2999226/update-for-universal-c-runtime-in-windows>`__ מותקן.

source: The minimum supported macOS version is Mojave (10.14.x).
es_mx: La versión mínima de macOS compatible es Mojave (10.14.x).

source: Windows 10 users can right click on the downloaded disk image and select :guilabel:`Mount` to open it. Then launch ``WPILibInstaller.exe``.
es_mx: Los usuarios de Windows 10 pueden dar clic derecho en la imagen de disco de descarga y seleccionar :guilabel:`Mount` para abrirlo. Después abra ``WPILibInstaller.exe``.
he_il: משתמשי Windows 10 יכולים ללחוץ לחיצה ימנית על תמונת הדיסק שהורדתם ולבחור :guilabel:`Mount` כדי לפתוח אותה. ואז הפעילו את ``WPILibInstaller.exe``.

source: Other installed programs may associate with iso files and the :guilabel:`mount` option may not appear. If that software does not give the option to mount or extract the iso file, then follow the directions in the "Windows 7" tab.
es_mx: Otros programas instalados pueden asociarse con archivos iso y es posible que la opción: :guilabel:`mount` no aparezca. Si ese software no ofrece la opción de montar o extraer el archivo iso, siga las instrucciones en la pestaña "Windows 7".

source: You can use `7-zip <https://www.7-zip.org/>`__ to extract the disk image by right-clicking, selecting :guilabel:`7-Zip` and selecting :guilabel:`Extract to...`. Then launch ``WPILibInstaller.exe``
es_mx: Puede usar `7-zip <https://www.7-zip.org/>`__ para extraer la imagen de disco dando clic derecho, seleccionando :guilabel:`7-Zip` y :guilabel:`Extract to...`. Después ``WPILibInstaller.exe``
he_il: ניתן להשתמש ב-`7-zip <https://www.7-zip.org/>`__ כדי לחלץ את תמונת הדיסק על ידי לחיצה ימנית, בחירת :guilabel:`7-Zip` ולחיצה על :guilabel:`Extract to...`. לאחר מכן הפעילו את ``WPILibInstaller.exe``.

source: Download VS Code for Single Install
es_mx: Descargue VS Code para Instalación Única

source: Skip installing VS Code
es_mx: Salte instalación de VS Code

source: Use Downloaded Offline Installer
es_mx: Usar Instalador Descargado Fuera de Linea

source: Download VS Code for Offline Install
es_mx: Descargar VS Code para Instalación Fuera de Linea

source: Go ahead and select :guilabel:`Download VS Code for Single Install`. This will begin the download process and can take a bit depending on internet connectivity (it's ~60MB). Once the download is done, select :guilabel:`Next`. You should be presented with a screen that looks similar to the one below.
es_mx: Continúe y seleccione :guilabel:`Download VS Code for Single Install`. Esto comenzará el proceso de descarga y puede demorar un poco dependiendo de la conectividad a Internet (~60MB). Una vez realizada la descarga, seleccione :guilabel:`Next`. Debería aparecer una pantalla similar a la siguiente.
he_il: לחצו על :guilabel:`Download VS Code for Single Install`. זה יתחיל בתהליך ההורדה ויכול להימשך מעט, בהתאם לקישוריות לאינטרנט שלכם (זה בערך 60MB). לאחר שההורדה הסתיימה, לחצו :guilabel:`Next`. אתם אמורים לראות כעת מסך שנראה דומה לזה שלמטה.

source: This showcases a list of options included with the WPILib installation. It's advised to just leave the default options selected.
es_mx: Esto muestra una lista de opciones incluidas con la instalación de WPILib. Se recomienda dejar seleccionadas las opciones predeterminadas.
he_il: זה מציג רשימת אפשרויות הכלולות בהתקנת WPILib. מומלץ פשוט להשאיר את אפשרויות ברירת המחדל שנבחרו.

source: WPILib installs a separate version of VS Code than into an already existing installation. Each year has it's own copy of the tools appended with the year. IE: ``WPILib VS Code 2021``. Please launch the WPILib VS Code and not a system installed copy!
es_mx: WPILib instala una versión separada de VS Code que en una instalación ya existente. Cada año tiene su propia copia de las herramientas anexadas con el año. Ej: ``WPILib VS Code 2021``. Por favor, ejecute el WPILib VS Code y no una copia instalada en el sistema.

source: Installing desktop tools and rebooting will create a folder on the desktop called ``YYYY WPILib Tools``, where ``YYYY`` is the current year. Desktop tool shortcuts are not available on Linux and MacOS.
es_mx: La instalación de las herramientas del escritorio y el reinicio creará una carpeta en el escritorio llamada ``YYYY WPILib Tools``, donde ``YYYY`` es el año actual. Los accesos directos a herramientas de escritorio no están disponibles en Linux y MacOS.
he_il: התקנת כלי שולחן העבודה והפעלה מחדש תיצור תיקייה בשולחן העבודה בשם `YYYY WPILib Tools``, כאשר ``YYYY`` היא השנה הנוכחית. קיצורי דרך לכלי שולחן עבודה אינם זמינים בלינוקס וב-macOS.

source: Delete the appropriate wpilib folder (2019: ``c:\Users\Public\frc2019``, 2020 and later: ``c:\Users\Public\wpilib\YYYY`` where ``YYYY`` is the year to uninstall)
es_mx: Elimine la carpeta correcta de wpilib (2019: ``c:\Users\Public\frc2019``, 2020 y después: ``c:\Users\Public\wpilib\YYYY`` donde ``YYYY`` es el año en que se desinstala)
he_il: מחקו את תיקיית wpilib הרלוונטית (2019: ``c:\Users\Public\frc2019``, החל מ-2020: ``c:\Users\Public\wpilib\YYYY`` כך ש``YYYY`` היא השנה להסרת ההתקנה)

source: Delete the path environment variables.
es_mx: Elimine las variables de entorno de ruta de acceso.
he_il: מחקו את הנתיב ממשתני הסביבה.

source: In the start menu, type environment and select "edit the system environment variables"
es_mx: En el menú de inicio, escriba entorno y seleccione "Editar las variables de entorno del sistema"
he_il: בתפריט ההתחל, הקלידו environment ובחרו "edit the system environment variables"

source: Click on the environment variables button (1).
es_mx: Haga clic en el botón de variables de entorno (1).
he_il: לחצו על כפתור ה-Environment Variables (תמונה 1)

source: In the user variables, select path (2) and then click on edit (3).
es_mx: En las variables de usuario, seleccione la ruta (2) y luego haga clic en editar (3).
he_il: ב-User Variables, בחרו ב-Path (תמונה 2) ולחצו Edit (תמונה 3)

source: Select the path with ``roborio\bin`` (4) and click on delete (5).
es_mx: Seleccione la ruta con de ``roborio\bin`` (4) y haga clic en eliminar (5).
he_il: בחרו בנתיב עם ``roborio\bin`` (תמונה 4) ולחצו Delete (תמונה 5).

source: Select the path with ``frccode`` and click on delete (5).
es_mx: Seleccione la ruta con ``frccode`` y haga clic en eliminar (5).
he_il: בחרו בנתיב עם ``frccode`` ולחצו Delete (תמונה 5).
