Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-2/wpilib-setup.po
Languages: es_mx, fr_ca, he_il, ja

source: WPILib Installation Guide
es_mx: Guía de Instalación WPILib
fr_ca: Guide d'installation WPILib
he_il: מדריך התקנת WPILib
ja: WPILibインストールガイド

source: This guide is intended for Java and C++ teams. LabVIEW teams can skip to :doc:`labview-setup`. Python teams can skip to :doc:`python-setup`. Additionally, the below tutorial shows Windows 10, but the steps are identical for all operating systems. Notes differentiating operating systems will be shown.
fr_ca: Ce guide est destiné aux équipes programmant en Java et C++. Les équipes LabVIEW peuvent passer à la section :doc:`Installation de LabVIEW pour FRC`. Les équipes Python peuvent passer à la section :doc:`python-setup`. De plus, Windows 10 est utilisé dans le tutoriel ci-dessous, mais les étapes sont identiques pour tous les systèmes d'exploitation. Des notes sur les différences entre les systèmes d'exploitation seront montrées.

source: Prerequisites
es_mx: Prerrequisitos
fr_ca: Prérequis
he_il: דרישות מקדימות
ja: 前提条件

source: Supported Operating Systems and Architectures:
fr_ca: Système d'exploitation et Architectures supportés:
ja: 対応オペレーティング・システムとアーキテクチャ：

source: Windows 10 & 11, 64 bit only. 32 bit and Arm are not supported
fr_ca: Windows 10 & 11, 64 bit seulement. 32 bit et Arm ne sont pas supportés.
ja: Windows 10および11、64ビット版のみ。32ビットおよびArmはサポートされていません。

source: Ubuntu 22.04 & 24.04, 64 bit. Other Linux distributions with glibc >= 2.34 may work, but are unsupported
fr_ca: Ubuntu 22.04 et 24.04, 64 bits. D'autres distributions Linux avec glibc >= 2.34 peuvent fonctionner, mais ne sont pas supportées

source: `Windows 10 support from Microsoft will end in October 2025 <https://www.microsoft.com/en-us/windows/end-of-support>`__. We intend to continue supporting Windows 10 through the 2026 season, but may have to drop support in 2027. Teams should start planning their upgrade path to Windows 11.
fr_ca: Le support de Microsoft pour Windows 10 se terminera en Octobre 2025 <https://www.microsoft.com/en-us/windows/end-of-support>`__. Nous avons l'intention de continuer à supporter Windows 10 au courant de la saison 2026, mais devrons peut-être terminer le support en 2027. Les équipes devraient planifier leur chemin de mise à jour vers Windows 11.

source: WPILib is designed to install to different folders for different years, so that it is not necessary to uninstall a previous version before installing this year's WPILib.
fr_ca: WPILib est conçu pour s’installer dans différents dossiers correspondant à différentes années, de sorte qu’il n’est pas nécessaire de désinstaller une version précédente avant d’installer la version WPILib de l'année en cours.
ja: WPILibは年ごとに異なるフォルダにインストールされるように設計されているため、今年のWPILibをインストールする前に以前のバージョンをアンインストールする必要はありません。

source: Downloading
fr_ca: Téléchargement
ja: ダウンロード

source: WPILib Installer
fr_ca: Installeur WPILib
ja: WPILibインストーラ

source: WPILib 2024.3.2 Release - March 14, 2024
fr_ca: WPILib 2024.3.2 Mis à jour - 14 mars 2024

source: Downloads
fr_ca: Téléchargements
ja: ダウンロード

source: `Downloads for other platforms <https://github.com/wpilibsuite/allwpilib/releases/tag/v2024.3.2>`_
fr_ca: Téléchargements pour d'autres plateformes <https://github.com/wpilibsuite/allwpilib/releases/tag/v2024.3.2>`_

source: Release Notes
fr_ca: Notes de mise à jour
ja: リリースノート

source: `You can download the latest release of the installer from GitHub <https://github.com/wpilibsuite/allwpilib/releases/latest/>`__.
fr_ca: Vous pouvez télécharger la dernière version de l'installeur depuis GitHub <https://github.com/wpilibsuite/allwpilib/releases/latest/>`__.
ja: `インストーラの最新リリースはGitHubからダウンロードできます。 <https://github.com/wpilibsuite/allwpilib/releases/latest/>`__

source: Once on the GitHub releases page, scroll to the Downloads section.
fr_ca: Une fois sur la page des versions de GitHub, faites défiler jusqu'à la section des téléchargements.
ja: GitHubのリリースページで、ダウンロードセクションまでスクロールします。

source: Latest WPILib release page on GitHub
fr_ca: Page de la plus récente version de WPILib sur GitHub
ja: GitHubのWPILib最新リリースページ

source: Then click on the correct binary for your OS and architecture to begin the download.
fr_ca: Cliquez ensuite sur le fichier binaire correspondant à votre système d'exploitation et à votre architecture pour commencer le téléchargement.
ja: 次に、お使いのOSとアーキテクチャに適したバイナリをクリックしてダウンロードを開始します。

source: Extracting the Installer
es_mx: Extrayendo el Instalador
fr_ca: Extraction de l’installateur
he_il: חילוץ המתקין
ja: インストーラの展開

source: When you download the WPILib installer, it is distributed as a disk image file ``.iso`` for Windows, ``.tar.gz`` for Linux, and distributed as a ``DMG`` for MacOS.
es_mx: Cuando descarga el instalador de WPILib, este está distribuido como un archivo de imagen de disco ``.iso`` para Windows, ``.tar.gz`` para Linux, y distribuido como ``DMG`` para MacOS.
fr_ca: Lorsque vous téléchargez l’installateur WPILib, celui-ci est distribué sous la forme d’un fichier d’image de disque ``.iso`` pour Windows, ``.tar.gz`` pour Linux, et distribué sous la forme de ``DMG`` pour MacOS.
he_il: כאשר אתם מוריד את מתקין ה-WPILib, הוא מופץ כקובץ תמונת דיסק ``.iso`` עבור Windows, קובץ ``.tar.gz`` עבור לינוקס, או ``DMG`` עבור macOS.
ja: WPILibインストーラをダウンロードすると、Windowsではディスクイメージファイル ``.iso``、Linuxでは ``.tar.gz``、MacOSでは ``DMG`` として配布されます。

source: Windows 10+ users can right click on the downloaded disk image and select :guilabel:`Mount` to open it. Then launch ``WPILibInstaller.exe``.
fr_ca: Les utilisateurs de Windows 10+ peuvent cliquer avec le bouton droit sur l’image du disque téléchargé et sélectionner :guilabel:`Mount` pour l’ouvrir. Ensuite, démarrez ``WPILibInstaller.exe``.
ja: Windows 10以上のユーザーはダウンロードしたディスクイメージを右クリックし、 :guilabel:`マウント` を選択して開きます。次に ``WPILibInstaller.exe`` を起動します。

source: The menu after right clicking on an .iso file to choose "Mount".
fr_ca: Le menu après un clic droit sur un fichier .iso pour choisir "Mount".
ja: 「.iso」をクリックしてから「マウント」を選択した後、表示されるメニュー。

source: Other installed programs may associate with iso files and the :guilabel:`mount` option may not appear. If that software does not give the option to mount or extract the iso file, then follow the directions below.
fr_ca: D’autres programmes installés peuvent s’associer à des fichiers iso et l’option :guilabel:`mount` peut ne pas apparaître. Si ce logiciel n'offre pas la possibilité de monter ou d’extraire le fichier iso, dans cas, suivez les instructions ci-dessous.
ja: インストールされている他のプログラムがisoファイルと関連付け、 :guilabel:`マウント` オプションが表示されない場合があります。そのソフトウェアがisoファイルをマウントしたり解凍したりするオプションを与えない場合は、以下の指示に従ってください。

source: You can use `7-zip <https://www.7-zip.org/>`__ to extract the disk image by right-clicking, selecting :guilabel:`7-Zip` and selecting :guilabel:`Extract to...`. Windows 11 users may need to select :guilabel:`Show more options` at the bottom of the context menu.
fr_ca: Vous pouvez utiliser `7-zip <https://www.7-zip.org/>`__ pour extraire l'image disque en faisant un clic droit, en sélectionnant :guilabel:`7-Zip` et en sélectionnant:guilabel:`Extract to...`. Les utilisateurs Windows 11 devront peut-être sélectionner :guilabel:`Show more options` au bas du menu contextuel.
ja: `7-zip <https://www.7-zip.org/>`__ を使ってディスクイメージを展開するには、右クリックして :guilabel:`7-Zip` を選択し、 :guilabel:`Extract to...` を選択します。Windows 11のユーザーはコンテキストメニューの一番下にある :guilabel:`その他のオプションを表示` を選択する必要があるかもしれません。

source: After right clicking on the .iso file go to "7-Zip" then "Extract to....".
fr_ca: Après avoir cliqué sur le bouton droit de la souris sur le fichier .iso allez dans "7-Zip" puis "Extract to....".
ja: .isoファイルを右クリックし、「7-Zip」から「Extract to...」に進みます。

source: After opening the ``.iso`` file, launch the installer by opening ``WPILibInstaller.exe``.
fr_ca: Après avoir ouvert le fichier ``.iso``, lancez l'installeur en ouvrant ``WPILibInstaller.exe``.
ja: ``.iso`` ファイルを開いた後、 ``WPILibInstaller.exe`` を開いてインストーラを起動します。

source: After launching the installer, Windows may display a window titled "Windows protected your PC". Click :guilabel:`More info`, then select :guilabel:`Run anyway` to run the installer.
fr_ca: Après avoir lancé l'installeur, Windows peut montrer une fenêtre intitulée "Windows a protégé votre PC". Cliquez sur :guilabel:`More info`, puis sélectionnez :guilabel:`Run anyway` pour exécuter l'installeur.
ja: インストーラを起動すると、Windowsに「WindowsによってPCが保護されました」というウィンドウが表示される場合があります。 :guilabel:`詳細情報` をクリックし、 :guilabel:`実行` を選択してインストーラを実行してください。

source: For this release, macOS users will need to have the Xcode Command Line Tools installed before running the installer; we are working on removing this requirement in a future release. This can be done by running ``xcode-select --install`` in the Terminal.
fr_ca: Pour cette version, les utilisateurs macOS devront avoir les outils de ligne de commande Xcode avant d'exécuter l'installeur; nous travaillons à enlever ce requis dans une prochaine version. Cela peut se faire en exécutant ``xcode-select --install`` dans le Terminal.
ja: このリリースでは、macOSユーザーはインストーラを実行する前にXcodeコマンドラインツールをインストールする必要があります。これは、ターミナルで ``xcode-select --install`` を実行することで行うことができます。

source: macOS users can double click on the downloaded ``DMG`` and then select ``WPILibInstaller`` to launch the application.
es_mx: Los usuarios de macOS pueden dar doble clic en el ``DMG`` descargado y seleccionar ``WPILibInstaller`` para abrir la aplicación.
fr_ca: Les utilisateurs du système macOS peuvent cliquer deux fois sur le ``DMG`` téléchargé, puis sélectionnez ``WPILibInstaller`` pour lancer l’application.
he_il: משתמשי macOS יכולים ללחוץ לחיצה כפולה על ה-"DMG" שהורדתם ואז לבחור "WPILibInstaller" להפעלת היישום.
ja: macOSユーザーはダウンロードした ``DMG`` をダブルクリックし、``WPILibInstaller`` を選択してアプリケーションを起動することができます。

source: Show the macOS screen after double clicking the DMG file.
fr_ca: Affichez l’écran macOS après avoir double-cliqué sur le fichier DMG.
ja: DMGファイルをダブルクリックして、macOSの画面を表示します。

source: Linux
fr_ca: Pour Linux
he_il: לינוקס

source: Linux users should extract the downloaded ``.tar.gz`` and then launch ``WPILibInstaller``. Ubuntu treats executables in the file explorer as shared libraries, so double-clicking won't run them. Run the following commands in a terminal instead with ``<version>`` replaced with the version you're installing.
es_mx: Los usuarios de Linux deben extraer el archivo ``.tar.gz`` descargado y luego ejecutar ``WPILibInstaller``. Ubuntu trata los ejecutables en el explorador de archivos como bibliotecas compartidas, por lo que hacer doble clic no los ejecutará. Ejecute los siguientes comandos en una terminal en lugar de ``<version>`` reemplazado por la versión que está instalando.
fr_ca: Les utilisateurs de Linux devraient extraire le ``.tar.gz`` téléchargé, puis lancer ``WPILibInstaller``. Ubuntu traite les fichiers exécutables dans l’explorateur de fichiers comme des libairies partagées, de sorte qu'en les double-cliquant, on ne les exécutera pas. À la place, exécutez les commandes suivantes dans un terminal avec ``<version>`` remplacé par la version que vous êtes en train d'installer.
ja: Linuxユーザーは、ダウンロードした ``.tar.gz`` を解凍してから ``WPILibInstaller`` を起動してください。Ubuntuはファイルエクスプローラー内の実行ファイルを共有ライブラリとして扱うため、ダブルクリックしても実行されません。代わりにターミナルで、``<version>`` をインストールするバージョンに置き換えて、以下のコマンドを実行してください。

source: Running the Installer
es_mx: Corriendo el Instalador
fr_ca: Exécution de l’installateur
he_il: הרצת המתקין
ja: インストーラの実行

source: Upon opening the installer, you'll be presented with the below screen. Go ahead and press :guilabel:`Start`.
es_mx: Al abrir el instalador, se le presentará la siguiente pantalla. Presione :guilabel:`Start`.
fr_ca: Lors de l’ouverture de l’installateur, l’écran ci-dessous vous sera présenté. Procédez et appuyez sur :guilabel:`Start`.
he_il: כאשר תפתחו את המתקין, תראו מסך דומה למסך שלמטה. לחצו על :guilabel:`Start`.
ja: インストーラを開くと、以下の画面が表示されます。 :guilabel:`Start` を押してください。

source: Start of Installer
fr_ca: Démarrage du programme d’installation
ja: インストーラの開始

source: An overview of the installer options
fr_ca: Survol des options d’installation
ja: インストーラオプションの概要

source: This showcases a list of options included with the WPILib installation.
fr_ca: Cela présente une liste d’options incluses avec l’installation de WPILib.
ja: これはWPILibのインストールに利用可能な選択肢のリストです。

source: :guilabel:`Tools Only` installs just the WPILib tools (Pathweaver, Shuffleboard, RobotBuilder, SysId, Glass, and OutlineViewer) and JDK.
fr_ca: :guilabel:`Tools Only` n'installe que les outils WPILib (Pathweaver, Shuffleboard, RobotBuilder, SysId, Glass, et OutlineViewer) ainsi que JDK.

source: :guilabel:`Everything` installs the full development environment (VS Code, extensions, all dependencies), WPILib tools, and JDK.
fr_ca: :guilabel:`Everything` installe l’environnement de développement complet (VS Code, extensions, toutes les dépendances), les outils WPILib et le JDK.
ja: :guilabel:`Everything` は完全な開発環境（VS Code、拡張機能、すべての依存関係）、WPILibツール、JDKをインストールします。

source: You will notice two buttons, :guilabel:`Install for this User` and :guilabel:`Install for all Users`. :guilabel:`Install for this User` only installs it on the current user account, and does not require administrator privileges. However, :guilabel:`Install for all Users` installs the tools for all system accounts and *will* require administrator access. :guilabel:`Install for all Users` is not an option for macOS and Linux.
es_mx: Notará dos botones, :guilabel:`Install for this User` y :guilabel:`Install for all Users`. :guilabel:`Install for this User` solo se instala en la cuenta de usuario actual, y no requiere privilegios de administrador. Sin embargo, :guilabel:`Install for all Users` instala las herramientas para todas las cuentas del sistema y *requerirá* acceso de administrador. :guilabel:`Install for all Users` no es una opción para macOS y Linux.
fr_ca: Vous remarquerez deux boutons, :guilabel:`Install for this User` et :guilabel:`Install for all Users`. :guilabel:`Install for this User` ne l'installe que sur le compte utilisateur actuel et ne nécessite pas de privilèges d'administrateur. Cependant, :guilabel:`Install for all Users` installe les outils pour tous les comptes système et *nécessitera* un accès administrateur. :guilabel:`Install for all Users` n'est pas une option pour macOS et Linux.
he_il: אתם תבחינו בשני כפתורים, :guilabel:`Install for this User` ו-:guilabel:`Install for all Users`. ה-:guilabel:`Install for this User` יתקין רק במשתמש הנוכחי ואינו דורש הרשאות מנהל מערכת. עם זאת, :guilabel:`Install for all Users` מתקין את הכלים לכל משתמשי המערכת *ודורש* הרשאת מנהל. :guilabel:`Install for all Users` אינה אפשרית עבור macOS ולינוקס.
ja: :guilabel:`Install for this User` と :guilabel:`Install for all Users` という２つのボタンがあります。 :guilabel:`Install for this User` は現在のユーザーアカウントにのみインストールし、管理者権限を必要としません。しかし、 :guilabel:`Install for all Users` は全てのシステムアカウントにツールをインストールし、管理者権限を必要とします。 :guilabel:`Install for all Users` は macOS と Linux では選択肢にありません。

source: If you select Install for all Users, Windows will prompt for administrator access through UAC during installation.
fr_ca: Si vous sélectionnez *Install for all Users*, Windows vous demandera un accès administrateur via le contrôle de compte d’utilisateur pendant l’installation.
ja: 「Install for all Users」を選択した場合、Windowsはインストール中にユーザーアカウント制御を介して管理者アクセスを要求します。

source: Select the option that is appropriate for you, and you'll presented with the following installation screen.
es_mx: Seleccione la opción que sea adecuada para usted y se le presentará la siguiente pantalla de instalación.
fr_ca: Sélectionnez l’option qui vous convient et l’écran d’installation suivant vous sera présenté.
he_il: בחרו באפשרות המתאימה לכם, ולאחר מכן יוצג בפניכם מסך ההתקנה הבא.
ja: あなたに適したオプションを選択すると、以下のインストール画面が表示されます。

source: This next screen involves downloading VS Code. Unfortunately, due to licensing reasons, VS Code can not be bundled with the installer.
es_mx: La siguiente pantalla implica la descarga de VS Code. Desafortunadamente, debido a razones de licencia, VS Code no se puede incluir con el instalador.
fr_ca: Cet écran suivant concerne le téléchargement de VS Code. Malheureusement, pour des raisons de licence, VS Code ne peut pas être intégré dans l’installateur.
he_il: המסך הבא קשור להורדה של VS Code. מטעמי רישיון, VS Code לא יכול להיכלל במתקין.
ja: 次の画面では、VS Codeをダウンロードします。残念ながら、ライセンスの関係でVS Codeはインストーラにバンドルされていません。

source: Overview of VS Code download options
fr_ca: Vue d’ensemble des options de téléchargement de VS Code
ja: VS Codeのダウンロードオプションの概要

source: Download for this computer only
fr_ca: Télécharger pour cet ordinateur uniquement

source: This downloads VS Code only for the current platform, which is also the smallest download.
es_mx: Esto descarga VS Code solo para la plataforma actual, que es también la descarga más pequeña.
fr_ca: Cette option télécharge VS Code uniquement pour la plate-forme actuelle, ce qui correspond également au plus petit téléchargement.
he_il: זה מוריד את VS Code רק עבור הפלטפורמה הנוכחית, שזוהי גם ההתקנה הקטנה ביותר.
ja: これは現在のプラットフォーム用のVS Codeのみをダウンロードするもので、ダウンロード量も最小となります。

source: Skip and don't use VS Code
fr_ca: Ignorer et ne pas utiliser VS Code

source: Skips installing VS Code. Useful for advanced installations or configurations. Generally not recommended.
es_mx: Omitir la instalación de VS Code. Útil para instalaciones o configuraciones avanzadas. Generalmente no es recomendado.
fr_ca: Ignore l’installation de VS Code. Cette option est utile pour les installations ou les configurations avancées. Généralement pas recommandé.
he_il: מדלג על התקנת VS Code. שימושי להתקנות או קונפיגורציות מתקדמות. בדרך כלל לא מומלץ.
ja: VS Codeのインストールをスキップします。高度なインストールや設定に便利です。一般的にはお勧めしません。

source: Select existing VS Code archive for offline install on this computer
fr_ca: Sélectionnez l'archive VS Code existante pour une installation hors connexion sur cet ordinateur

source: Selecting this option will bring up a prompt allowing you to select a pre-existing zip file of VS Code that has been downloaded by the installer previously. This option does **not** let you select an already installed copy of VS Code on your machine.
es_mx: Al seleccionar esta opción, aparecerá un mensaje que le permitirá seleccionar un archivo zip preexistente de VS Code que ha sido descargado previamente por el instalador. Esta opción **no** le permite seleccionar una copia ya instalada de VS Code en su máquina.
fr_ca: La sélection de cette option fera apparaître une invitation vous permettant de sélectionner un fichier zip préexistant de VS Code qui a été téléchargé précédemment par le programme d'installation. Cette option ne vous permet **pas** de sélectionner une copie déjà installée de VS Code sur votre machine.
he_il: בחירה באפשרות זו תאפשר לכם לבחור מיקום קובץ קיים של VS Code שהורד בעבר על ידי המתקין. אפשרות זו **לא** מאפשרת לכם לבחור עותק של VS Code שכבר מותקן במחשב שלכם.
ja: このオプションを選択すると、インストーラによってダウンロードされたVS Codeの既存のzipファイルを選択するプロンプトが表示されます。このオプションでは、マシンにインストール済みのVS Codeを選択することは **できません** 。

source: Create VS Code archives to share with other computers/OSes for offline install
fr_ca: Créer les archives VS Code à partager avec les autres ordinateurs/systèmes d'exploitation pour une installation hors-ligne

source: This option downloads and saves a copy of VS Code for all platforms, which is useful for sharing the copy of the installer.
es_mx: Esta opción descarga y guarda una copia de VS Code para todas las plataformas, que es útil para compartir la copia del instalador.
fr_ca: Cette option télécharge et enregistre une copie de VS Code pour toutes les plates-formes, ce qui est utile pour partager la copie du programme d'installation.
he_il: אפשרות זו מורידה ושומרת עותק של VS Code לכל הפלטפורמות, דבר זה שימושי עבור שיתוף העותק של המתקין.
ja: このオプションは、全プラットフォーム用のVS Codeのコピーをダウンロードして保存するもので、インストーラのコピーを共有するのに便利です。

source: Go ahead and select :guilabel:`Download for this computer only`. This will begin the download process and can take a bit depending on internet connectivity (it's ~100MB). Once the download is done, select :guilabel:`Next`. You should be presented with a screen that looks similar to the one below.
fr_ca: Allez-y et sélectionnez :guilabel:`Download for this computer only`. Cela commencera le processus de téléchargement et peut prendre un peu de temps en fonction de la connectivité Internet (typiquement ~ 100 Mo). Une fois le téléchargement terminé, sélectionnez :guilabel:`Next`. Vous devriez être présenté avec un écran qui ressemble à celui ci-dessous.
ja: 先に進み、 :guilabel:`Download for this computer only` を選択してください。これでダウンロードが始まりますが、インターネットの接続状況によっては少し時間がかかるかもしれません（約100MBです）。ダウンロードが完了したら、 :guilabel:`Next` を選択してください。以下のような画面が表示されます。

source: Installer progress bar
fr_ca: Barre de progression du programme d’installation
ja: インストーラのプログレスバー

source: After installation is complete, you will be presented with the finished screen.
es_mx: Una vez completada la instalación, se le presentará la pantalla finalizada.
fr_ca: Une fois l'installation terminée, l'écran de fin d'installation vous sera présenté.
he_il: לאחר השלמת ההתקנה, יוצג בפניכם מסך הסיום.
ja: インストールが完了すると、完了画面が表示されます。

source: Installer finished screen.
fr_ca: Écran de fin d'activité de l'installeur.
ja: インストーラ終了画面。

source: WPILib installs a separate version of VS Code. It does not use an already existing installation. Each year has it's own copy of the tools appended with the year. IE: ``WPILib VS Code 2022``. Please launch the WPILib VS Code and not a system installed copy!
fr_ca: WPILib installe une version distincte de VS Code. Il n’utilise pas une installation déjà existante. Chaque année a sa propre copie des outils ajoutés avec l’année. IE: ``WPILib VS Code 2022``. Veuillez lancer le VS Code WPILib non une copie installée du système!
ja: WPILibは別バージョンのVS Codeをインストールします。既存のインストールは使用しません。各年には、年号が付加された独自のツールのコピーがあります。例： ``WPILib VS Code 2022`` 。システムにインストールされたコピーではなく、WPILib VS Codeを起動してください！

source: Congratulations, the WPILib development environment and tooling is now installed on your computer! Press Finish to exit the installer.
es_mx: ¡Felicitaciones, el entorno de desarrollo y las herramientas de WPILib ya están instalados en su computadora! Presione Finalizar para salir del instalador.
fr_ca: Félicitations, l'environnement de développement et les outils WPILib sont maintenant installés sur votre ordinateur! Appuyez sur Terminer pour quitter le programme d'installation.
he_il: מזל טוב, סביבת הפיתוח והכלים של WPILib מותקנים כעת במחשב שלכם! לחצו על סיום כדי לצאת מהמתקין.
ja: これでWPILib開発環境とツールがコンピューターにインストールされました！「Finish」を押してインストーラを終了してください。

source: Post-Installation
es_mx: Post-Instalación
fr_ca: Après l'installation
he_il: לאחר ההתקנה
ja: 設置後

source: Some operating systems require some final action to complete installation.
es_mx: Algunos sistemas operativos requieren acciones finales para completar la instalación.
fr_ca: Certains systèmes d’exploitation nécessitent une dernière action pour terminer l’installation.
he_il: מערכות הפעלה מסוימות דורשות פעולה סופית כלשהי להשלמת ההתקנה.
ja: オペレーティングシステムによっては、インストールを完了するために、最終的な操作が必要な場合があります。
