Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-2/wpilib-setup.po
Languages: es_mx, fr_ca, he_il, ja

source: Repeat steps 3-6 in the Systems Variable pane.
es_mx: Repita los pasos de 3-6 veces en el panel variable de sistemas.
he_il: חזרו על שלבים 3-6 בחלון ה-Systems Variable.

source: Delete the appropriate wpilib folder (2019: ``~/frc2019``, 2020 and later: ``~/wpilib/YYYY`` where ``YYYY`` is the year to uninstall)
es_mx: Elimine la carpeta correcta de WPILib (2019: ``~/frc2019``, 2020 y después: ``~/wpilib/YYYY`` donde ``YYYY`` es el año en el que se desinstala)
he_il: מחקו את תיקיית ה-wpilib המתאימה (2019: ``~/frc2019``, החל מ-2020: ``~/wpilib/YYYY`` כאשר ``YYYY`` היא השנה להסרה)

source: Delete the appropriate wpilib folder (2019: ``~/frc2019``, 2020 and later: ``~/wpilib/YYYY`` where ``YYYY`` is the year to uninstall). eg ``rm -rf ~/wpilib/YYYY``
es_mx: Elimine la carpeta wpilib apropiada (2019: ``~/frc2019``, 2020 y después: ``~/wpilib/YYYY`` donde ``YYYY`` es el año a desinstalar). por ejemplo ``rm -rf ~/wpilib/YYYY``
he_il: מחקו את תיקיית ה-wpilib המתאימה (2019: ``~/frc2019``, החל מ-2020: ``~/wpilib/YYYY`` כאשר ``YYYY`` היא השנה להסרה). לדוגמא ``rm -rf ~/wpilib/YYYY``

source: This guide is intended for Java and C++ teams. LabVIEW teams can skip to :doc:`labview-setup`. Additionally, the below tutorial shows Windows 10, but the steps are identical for all operating systems. Notes differentating operating systems will be shown.
he_il: מדריך זה מיועד לקבוצות Java ו-C++. קבוצות LabVIEW יכולים לדלג אל :doc:`labview-setup`. בנוסף, המדריך הבא מציג את Windows 10, אך השלבים זהים לכל מערכות ההפעלה. יוצגו הערות המבדלות בין מערכות הפעלה.

source: Linux users should extract the downloaded ``.tar.gz`` and then launch ``WPILibInstaller``.
he_il: משתמשי לינוקס צריכים לחלץ את ה-``.tar.gz`` שהורדתם, ואז להריץ את את ``WPILibInstaller``.

source: **WPILib Tools** - SmartDashboard, Shuffleboard, Robot Builder, Outline Viewer, Pathweaver
he_il: **WPILib Tools** - הכלים SmartDashboard, Shuffleboard, RobotBuilder, OutlineViewer, PathWeaver
