Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/custom-widgets/builtin-plugins.po
Languages: es_mx, fr_ca, tr_tr

source: Built-in Plugins
fr_ca: Plugins intégrés
tr_tr: Yerleşik Eklentiler

source: Shuffleboard provides a number of built-in plugins that handle common tasks for FRC use, such as camera streams, all widgets, and NetworkTables connections.
fr_ca: Shuffleboard fournit un certain nombre de plugins intégrés qui gèrent les tâches courantes pour l'utilisation de FRC, telles que les flux de caméra, tous les widgets et les connexions NetworkTables.

source: Base Plugin
fr_ca: Plugin de base
tr_tr: Temel Eklenti

source: The base plugin defines all the data types, widgets, and layouts necessary for FRC use. It does *not* define any of the source types, or any special data types or widgets for those source types. Those are handled by the `NetworkTables Plugin`_ and the `CameraServer Plugin`_. This separation of concerns makes it easier for teams to create plugins for custom source types or protocols (eg HTTP, ZeroMQ) for the FRC data types without needing a NetworkTables client.
es_mx: La base plugin define todos los tipos de datos, widgets y diseños necesarios para el uso de FRC. *No* define ninguno de los tipos de fuente, ni ningún tipo de datos o widgets especiales para esos tipos de fuente. Estos son manejados por el `NetworkTables Plugin`_ y el `CameraServer Plugin`_. Esta separación de preocupaciones facilita a los equipos la creación de plugins para tipos de fuentes o protocolos personalizados (por ejemplo, HTTP, ZeroMQ) para los tipos de datos FRC sin necesidad de un cliente NetworkTables.
fr_ca: Le plugin de base définit tous les types de données, widgets et mises en page nécessaires à l'utilisation de FRC. Il ne définit *pas* aucun des types de source, ni aucun type de données ou widget spécial pour ces types de source. Ceux-ci sont gérés par le `NetworkTables Plugin`_ et le `CameraServer Plugin`_. Cette séparation des préoccupations permet aux équipes de créer plus facilement des plugins pour les types de sources ou protocoles personnalisés (par exemple HTTP, ZeroMQ) pour les types de données FRC sans avoir besoin d'un client NetworkTables.
tr_tr: Temel eklenti, FRC kullanımı için gerekli tüm veri türlerini, widget'ları ve layout'ları tanımlar. Kaynak türlerinden herhangi birini veya bu kaynak türleri için özel veri türlerini veya pencere öğelerini *tanımlamaz*. Bunlar `NetworkTables Plugin`_ ve `CameraServer Plugin`_ tarafından yönetilir. Bu alanların ayrılması, ekiplerin bir NetworkTables istemcisine ihtiyaç duymadan FRC veri türleri için özel kaynak türleri veya protokoller (örn. HTTP, ZeroMQ) için eklentiler oluşturmasını kolaylaştırır.

source: CameraServer Plugin
fr_ca: Plug-in CameraServer
tr_tr: CameraServer Eklentisi

source: The camera server plugin provides sources and widgets for viewing camerastreams from the ``CameraServer`` WPILib class.
es_mx: El plugin del servidor de la cámara proporciona fuentes y widgets para ver las transmisiones de la cámara de la clase WPILib ``CameraServer``.
fr_ca: Le plugin de serveur de caméra fournit des sources et des widgets pour visualiser les flux de caméras de la classe WPILib ``CameraServer``.
tr_tr: Kamera sunucusu eklentisi, ``CameraServer`` WPILib sınıfından kamera yayınlarını görüntülemek için kaynaklar ve widget'lar sağlar.

source: This plugin depends on the `NetworkTables Plugin`_ in order to discover the available camera streams.
es_mx: Este plugin depende del `NetworkTables Plugin`_ para descubrir las transmisiones de cámara disponibles.
fr_ca: Ce plugin dépend du `NetworkTables Plugin`_ afin de découvrir les flux de caméras disponibles.
tr_tr: Bu eklenti, mevcut kamera akışlarını keşfetmek için `NetworkTables Plugin`_e bağlıdır.

source: Stream discovery
es_mx: Detección de transmisiones
fr_ca: Découverte de flux

source: CameraServer sources are automatically discovered by looking at the ``/CameraPublisher`` NetworkTable.
es_mx: Las fuentes de CameraServer se descubren automáticamente mirando la NetworkTable ``/CameraPublisher``.
fr_ca: Les sources CameraServer sont automatiquement découvertes en consultant le NetworkTable ``/CameraPublisher``.
tr_tr: CameraServer kaynakları, ``/CameraPublisher`` NetworkTable'a bakılarak otomatik olarak keşfedilir.

source: For example, a camera named “Camera” with a server at ``roborio-0000-frc.local`` would have this table layout:
fr_ca: Par exemple, une caméra nommée “Camera” avec un serveur à ``roborio-0000-frc.local`` aurait cette disposition de table:
tr_tr: Örneğin, ``roborio-0000-frc.local`` adresinde bir sunucuya sahip “Camera” adlı bir kamera şu layout'a sahip olacaktır:

source: This setup will automatically discover all camera streams hosted on a roboRIO by the CameraServer class in WPILib. Any non-WPILib projects that want to have camera streams appear in shuffleboard will have to set the streams entry for the camera server.
es_mx: Esta configuración detectará automáticamente todas las transmisiones de cámara alojadas en un roboRIO por la clase CameraServer en WPILib. Cualquier proyecto que no sea WPILib que quiera que aparezcan transmisiones de cámara en shuffleboard tendrá que configurar la entrada de transmisiones para el servidor de la cámara.
fr_ca: Cette configuration découvrira automatiquement tous les flux de caméra hébergés sur un roboRIO par la classe CameraServer dans WPILib. Tous les projets non-WPILib qui souhaitent que les flux de caméra apparaissent dans le shuffleboard devront définir l'entrée de flux pour le serveur de caméra.
tr_tr: Bu kurulum, WPILib'deki CameraServer sınıfı tarafından bir roboRIO'da barındırılan tüm kamera akışlarını otomatik olarak keşfedecektir. Kamera akışlarının shuffleboard'da görünmesini isteyen WPILib dışı projeler, kamera sunucusu için stream-akış girişini ayarlamalıdır.

source: NetworkTables Plugin
fr_ca: Plug-in NetworkTables
tr_tr: NetworkTables Eklentisi

source: The NetworkTables plugin provides data sources backed by ntcore. Since the ``LiveWindow`` and ``SmartDashboard`` classes in WPILib use NetworkTables to send the data to the driver station, this plugin will need to be loaded in order to use those classes.
es_mx: El plugin NetworkTables proporciona fuentes de datos respaldadas por ntcore. Desde que las clases ``LiveWindow`` y ``SmartDashboard``en WPILib utilizan NetworkTables para enviar los datos a la driver station, este plugin deberá cargarse para poder utilizar esas clases.
fr_ca: Le plugin NetworkTables fournit des sources de données soutenues par ntcore. Étant donné que les classes ``LiveWindow`` et ``SmartDashboard`` dans WPILib utilisent NetworkTables pour envoyer les données à la station de pilote, ce plugin devra être chargé afin d'utiliser ces classes.
tr_tr: NetworkTables eklentisi, ntcore tarafından desteklenen veri kaynakları sağlar. WPILib'deki ``LiveWindow`` ve ``SmartDashboard`` sınıfları, verileri driver station'a göndermek için NetworkTables kullandığından, bu sınıfları kullanmak için bu eklentinin yüklenmesi gerekecektir.

source: This plugin handles the connection and reconnection to NetworkTables automatically, users of shuffleboard and writers of custom plugins will not have to worry about the intricacies of the NT protocol.
es_mx: Este plugin maneja la conexión y reconexión a NetworkTables automáticamente, los usuarios de shuffleboard y los escritores de plugins personalizados no tendrán que preocuparse por las complejidades del protocolo NT.
fr_ca: Ce plugin gère automatiquement la connexion et la reconnexion à NetworkTables, les utilisateurs de shuffleboard et les auteurs de plugins personnalisés n'auront pas à se soucier des subtilités du protocole NT.
tr_tr: Bu eklenti, NetworkTables'a bağlantıyı ve yeniden bağlanmayı otomatik olarak yönetir, shuffleboard kullanıcıları ve özel eklenti yazarları, NT protokolünün karmaşıklıkları hakkında endişelenmek zorunda kalmaz.

source: Shuffleboard provides a number of built-in plugins that handle common tasks for FRC\ |reg| use, such as camera streams, all widgets, and NetworkTables connections.
es_mx: Shuffleboard provee un número de plugins incorporados que manejan tareas comunes para el uso de FRC\ |reg|, tales como flujos de cámaras, todos los widgets y conexiones de Tablas de red.

source: For example, a camera named "Camera" with a server at ``roborio-0000-frc.local`` would have this table layout:
es_mx: Por ejemplo, una cámara llamada "Camera" con un servidor en ``roborio-0000-frc.local`` tendría este diseño de tabla:
