Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/custom-widgets/creating-a-new-widget.po
Languages: es_mx, fr_ca, tr_tr

source: Creating A Widget
es_mx: Crear un widget
fr_ca: Création d'un widget
tr_tr: Bir Widget Oluşturma

source: Widgets allow us to view, change, and interact with data published through different data sources. The CameraServer, NetworkTables, and Base plugins provide the widgets to control basic data types (including FRC-specific data types). However, custom widgets allow us to control our custom data types we made in the previous sections or Java Objects.
es_mx: Los widget permiten visualizar, cambiar e interactuar con la información publicada a través de distintas fuentes de información. Los plugin CameraServer, NetworkTables y Base proveen de widgets para controlar tipos de datos básicos (incluidos tipos de datos específicos de FRC). Sin embargo, los widgets personalizados permiten controlar sus tipos de datos personalizados creados en las secciones anteriores u Objetos de Java.
fr_ca: Les widgets nous permettent de visualiser, de modifier et d'interagir avec les données publiées via différentes sources de données. Les plug-ins CameraServer, NetworkTables et Base fournissent les widgets pour contrôler les types de données de base (y compris les types de données spécifiques à FRC). Cependant, les widgets personnalisés nous permettent de contrôler nos types de données personnalisés que nous avons créés dans les sections précédentes ou les objets Java.
tr_tr: Widget'lar, farklı veri kaynakları aracılığıyla yayınlanan verileri görüntülememize, değiştirmemize ve bunlarla etkileşim kurmamıza olanak tanır. CameraServer, NetworkTables ve Base eklentileri, temel veri türlerini (FRC'ye özgü veri türleri dahil) kontrol etmek için pencere öğeleri sağlar. Bununla birlikte, özel widget'lar, önceki bölümlerde veya Java Nesnelerinde yaptığımız özel veri türlerimizi kontrol etmemize izin verir.

source: The basic ``Widget`` interface inherits from the ``Component`` and ``Sourced`` interfaces. ``Component`` is the most basic building block of components that be displayed in Shuffleboard. ``Sourced`` is an interface for things that can handle and interface with data sources to display or modify data. Widgets that don't support data bindings but simply have child nodes would not use the ``Sourced`` interface but simply the ``Component`` interface. Both are basic building blocks towards making widgets and allows us to modify and display data.
es_mx: La interface básica ``Widget`` es hereda de las interfaces ``Component`` y ``Sourced``. ``Component`` es el bloque de construcción más básico disponible en Shuffleboard. ``Sourced`` es una interface para objetos que puedan manejar e interactuar con fuentes de datos para mostrar o visualizar datos. Los widgets que no admiten enlaces de datos, pero tienen nodos hijos no utilizarían la interfaz ``Sourced``, sino únicamente la interfaz ``Component``. Ambas son bloques de construcción básicos para crear widgets y permiten visualizar y modificar datos.
fr_ca: L'interface de base ``Widget`` hérite des interfaces ``Component`` et ``Sourced`` . ``Component`` est le bloc de construction le plus élémentaire des composants à afficher dans Shuffleboard. ``Sourced`` est une interface pour les choses qui peuvent gérer et interagir avec des sources de données pour afficher ou modifier des données. Les widgets qui ne prennent pas en charge les liaisons de données mais qui ont simplement des nœuds-enfants n'utiliseraient pas l'interface "Sourced" mais simplement l'interface ``Component`` . Les deux sont des éléments de base pour créer des widgets et nous permettent de modifier et d'afficher des données.
tr_tr: Temel ``Widget`` arayüzü, ``Bileşen`` ve ``Kaynaklı`` arayüzlerden miras alır. ``Bileşen``, Shuffleboard'da görüntülenebilecek bileşenlerin en temel yapı taşıdır. ``Kaynaklı``, verileri görüntülemek veya değiştirmek için veri kaynaklarını işleyebilen ve bunlarla arayüz oluşturabilen şeyler için bir arayüzdür. Veri bağlamalarını desteklemeyen ancak sadece alt düğümlere sahip olan widget'lar ``Kaynaklı`` arayüzü değil, sadece ``Bileşen`` arayüzünü kullanır. Her ikisi de widget oluşturmaya yönelik temel yapı taşlarıdır ve verileri değiştirmemizi ve görüntülememizi sağlar.

source: A good widget allows the end-user to customize the widget to suit their needs. An example could be to allow the user to control the range of the number slider, that is, its maximum and minimum or the orientation of the slider itself. The view of the widget or how it looks is defined using FXML. ``FXML`` is an XML based language that is useful for defining the static layout of the widget (Panes, Labels and Controls).
es_mx: Un buen widget permite al usuario final personalizar al widget de la forma que más le convenga. Un ejemplo podría ser permitir al usuario controlar el rango de un intensificador numérico, esto es, su mínimo y máximo o la orientación del mismo intensificador. La vista del widget o el cómo se ve se define utilizando FXML. ``FXML`` es un lenguaje basado en XML muy útil para definir layouts estáticos para los widgets ("Panes", Etiquetas y Controles).
fr_ca: Un bon widget permet à l'utilisateur de personnaliser le widget en fonction de ses besoins. Un exemple pourrait être de permettre à l'utilisateur de contrôler la plage d'un curseur numérique, c'est-à-dire son maximum et son minimum ou l'orientation du curseur lui-même. La vue du widget ou son apparence est définie à l'aide de FXML. FXML est un langage basé sur XML qui est utile pour définir la disposition statique du widget (volets, étiquettes et contrôles).
tr_tr: İyi bir pencere öğesi, son kullanıcının pencere öğesini ihtiyaçlarına göre özelleştirmesine olanak tanır. Bir örnek, kullanıcının sayı kaydırıcısının aralığını, yani maksimum ve minimumunu veya kaydırıcının kendisinin yönünü kontrol etmesine izin vermek olabilir. Widget'ın görünümü veya nasıl göründüğü FXML kullanılarak tanımlanır. ``FXML``, widget'ın (Bölmeler, Etiketler ve Kontroller) statik düzenini tanımlamak için yararlı olan XML tabanlı bir dildir.

source: More about FXML can be found `here <https://openjfx.io/javadoc/11/javafx.fxml/javafx/fxml/doc-files/introduction_to_fxml.html>`_.
es_mx: Más información sobre FMXL puede encontrarse `aquí <https://openjfx.io/javadoc/11/javafx.fxml/javafx/fxml/doc-files/introduction_to_fxml.html>`_.
fr_ca: Plus d'informations sur FXML peuvent être trouvées `ici <https://openjfx.io/javadoc/11/javafx.fxml/javafx/fxml/doc-files/introduction_to_fxml.html>`_.
tr_tr: FXML hakkında daha fazla bilgi `burada <https://openjfx.io/javadoc/11/javafx.fxml/javafx/fxml/doc-files/introduction_to_fxml.html>` _ bulunabilir.

source: Defining a Widget's FXML
es_mx: Definir el XML de un widget
fr_ca: Définition du FXML d'un widget
tr_tr: Bir Widget'ın FXML'sini Tanımlama

source: In this example, we will create two sliders to help us control the X and Y coordinates of our Point2D data type we created in previous sections. It is helpful to place the FXML file in the same package as the Java class.
es_mx: En este ejemplo, creará dos intensificadores para ayudarle a controlar las coordenadas X,Y del objeto Point2D creado en secciones anteriores. Es útil colocar el archivo FXML en el mismo paquete que la clase Java.
fr_ca: Dans cet exemple, nous allons créer deux curseurs pour nous aider à contrôler les coordonnées X et Y de notre type de données Point2D que nous avons créé dans les sections précédentes. Il est utile de placer le fichier FXML dans le même package que la classe Java.
tr_tr: Bu örnekte, önceki bölümlerde oluşturduğumuz Point2D veri tipimizin X ve Y koordinatlarını kontrol etmemize yardımcı olmak için iki kaydırıcı oluşturacağız. FXML dosyasını Java sınıfıyla aynı pakete yerleştirmek faydalıdır.

source: In order to create an empty, blank window for our widget, we need to create a ``Pane``. A Pane is a parent node that contains other child nodes, in this case, 2 sliders. There are many different types of Pane, they are as noted:
es_mx: Para crear una ventana vacía para el widget, es necesario crear un ``Pane``. Un Pane es un nodo padre que contiene otros nodos hijos, en este caso, 2 intensificadores. Existen muchos tipos de Pane, como se muestra:
fr_ca: Afin de créer une fenêtre vide et initiale pour notre widget, nous devons créer un volet, ou ``Pane``. Un volet est un nœud-parent qui contient d'autres nœuds-enfants, dans ce cas, 2 curseurs. Il existe de nombreux types de volets différents, comme indiqué:
tr_tr: Widget'ımız için boş, boş bir pencere oluşturmak için bir ``Bölme`` oluşturmamız gerekiyor. Bölme, diğer alt düğümleri, bu durumda 2 kaydırıcıyı içeren bir ana düğümdür. Birçok farklı Bölme türü vardır, bunlar belirtildiği gibidir:

source: Stack Pane
fr_ca: Volet de pile -Stack-
tr_tr: Stack Pane-Yığın Bölmesi

source: Stack Panes allow elements to be overlaid. Also, StackPanes by default center child nodes.
es_mx: Permiten sobreponer elementos. Además, StackPanes centran, de forma predeterminada, a los nodos hijos.
fr_ca: Les panneaux de pile permettent de superposer des éléments. En outre, StackPanes par défaut des nœuds enfants centraux.
tr_tr: Stack Pane-Yığın Bölmeleri, öğelerin üst üste bindirilmesine izin verir. Ayrıca, StackPanes varsayılan merkez alt düğümleri olarak.

source: Grid Pane
fr_ca: Volet de grille
tr_tr: Grid Pane-Izgara Bölmesi

source: Grid Panes are extremely useful defining child elements using a coordinate system by creating a flexible grid of rows and columns on the pane.
es_mx: Son extremadamente útiles para definir elementos hijos al utilizar un sistema coordinado al crear una cuadrícula flexible de filas y columnas en el plano.
fr_ca: Les volets de grille sont extrêmement utiles pour définir des éléments- enfants à l'aide d'un système de coordonnées en créant une grille flexible de lignes et de colonnes sur le volet.
tr_tr: Izgara Bölmeleri, bölmede esnek bir satır ve sütun ızgarası oluşturarak bir koordinat sistemi kullanarak alt öğeleri tanımlamak için son derece yararlıdır.

source: Flow Pane
fr_ca: Volet de flux
tr_tr: Flow Pane-Akış Bölmesi

source: Flow Panes wrap all child nodes at a boundary set. Child nodes can flow vertically (wrapped at the height boundary for the pane) or horizontally (wrapped at the width boundary of the pane).
es_mx: Envuelven a todos los nodos hijos en el conjunto de límites. Los nodos hijos pueden fluir verticalmente (contenidos en el límite de altura del panel) u horizontalmente (contenidos por el límite de anchura del panel).
fr_ca: Les volets de flux enveloppent tous les nœuds enfants-dans un ensemble de limites. Les nœuds-enfants peuvent circuler verticalement (enveloppés à la limite de hauteur du volet) ou horizontalement (enveloppés à la limite de largeur du volet).
tr_tr: Flow Pane-Akış Bölmeleri, tüm alt düğümleri bir sınır kümesinde sarar. Alt düğümler dikey (bölmenin yükseklik sınırına sarılmış) veya yatay (bölmenin genişlik sınırına sarılmış) olarak akabilir.

source: Anchor Pane
fr_ca: Volet d'ancrage
tr_tr: Anchor Pane-Bağlantı Bölmesi

source: Anchor Panes allow child elements to be placed in the top, bottom, left side, right side, or center of the pane.
es_mx: Permiten a los elementos hijos ser posicionados encima, debajo, a la izquierda o derecha, o al centro del panel.
fr_ca: Les volets d'ancrage permettent de placer des éléments-enfants en haut, en bas, à gauche, à droite ou au centre du volet.
tr_tr: Anchor Pane-Bağlantı Bölmeleri, alt öğelerin bölmenin üstüne, altına, sol tarafına, sağ tarafına veya ortasına yerleştirilmesine izin verir.

source: Layout panes are also extremely useful for placing child nodes in one horizontal row using a `HBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/HBox.html>`_ or one vertical column using a `VBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/VBox.html>`_.
es_mx: Los layout panes son extremadamente útiles para colocar nodos hijos en una fila horizontal al utilizar `HBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/HBox.html>`_ o en una columa vertical usando `VBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/VBox.html>`_.
fr_ca: Les volets de disposition sont extrêmement utiles pour placer des nœuds- enfants sur une ligne horizontale à l'aide d'un `HBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/HBox.html>`_ ou d'une verticale à l'aide d'une colonne `VBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/VBox.html>`_.
tr_tr: Düzen bölmeleri, alt düğümleri bir `HBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/HBox.html>` _ kullanarak tek bir yatay satıra veya bir `VBox <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/layout/VBox.html>`_ kullanarak bir dikey sütuna yerleştirmek için de son derece kullanışlıdır.

source: The basic syntax for defining a Pane using FXML would be as the following:
es_mx: La sintaxis básica para definir un Pane usando FXML sería la siguiente:
fr_ca: La syntaxe de base pour définir un volet à l'aide de FXML serait la suivante:
tr_tr: FXML kullanarak bir Bölmeyi tanımlamak için temel sözdizimi aşağıdaki gibi olacaktır:

source: The ``fx:controller`` attribute contains the name of the widget class. An instance of this class is created when the FXML file is loaded. For this to work, the controller class must have a no-argument constructor.
es_mx: El atributo ``fx:controller`` contiene el nombre de la clase del widget. Una instancia de esta clase se crea cuando se carga un archivo FXML. Para este trabajo, la clase del controlador debe tener un constructor vacío.
fr_ca: L'attribut ``fx:controller`` contient le nom de la classe de widget. Une instance de cette classe est créée lors du chargement du fichier FXML. Pour que cela fonctionne, la classe de contrôleur doit avoir un constructeur sans argument.
tr_tr: ``fx: controller`` özniteliği, widget sınıfının adını içerir. FXML dosyası yüklendiğinde bu sınıfın bir örneği oluşturulur. Bunun çalışması için, denetleyici sınıfının bağımsız değişken olmayan bir kurucuya sahip olması gerekir.

source: Creating A Widget Class
es_mx: Crear una clase widget
fr_ca: Création d'une classe de widgets
tr_tr: Bir Widget Sınıfı Oluşturma

source: Now that we have a Pane, we can now add child elements to that pane. In this example, we can add two slider objects. Remember to add an ``fx:id`` to each element so they can be referenced in our Java class we will make later on. We will use a ``VBox`` to position our slider on top of each other.
es_mx: Ahora que tiene el Pane, puede añadir elementos hijos al panel. Por ejemplo, puede agregar dos objetos intensificadores. Recuerde añadir ``fx:id`` a cada elemento para que puedan ser referenciados en la clase Java que hará más adelante. Utilizará `VBox`` para colocar su intensificador uno encima de otro.
fr_ca: Maintenant que nous avons un volet, nous pouvons maintenant ajouter des éléments-enfants à ce volet. Dans cet exemple, nous pouvons ajouter deux objets curseur. N'oubliez pas d'ajouter un ``fx:id`` à chaque élément afin qu'ils puissent être référencés dans notre classe Java que nous ferons plus tard. Nous utiliserons une ``VBox`` pour positionner notre curseur l'un sur l'autre.
tr_tr: Artık bir Bölmeye sahip olduğumuza göre, artık bu bölmeye alt öğeler ekleyebiliriz. Bu örnekte, iki kaydırıcı nesnesi ekleyebiliriz. Her öğeye bir ``fx: id '' eklemeyi unutmayın, böylece daha sonra yapacağımız Java sınıfımızda referans alınabilirler. Kaydırıcımızı üst üste konumlandırmak için bir ``VBox`` kullanacağız.

source: Now that we have finished creating our FXML file, we can now create a widget class. The widget class should include a ``@Description`` annotation that states the supported data types of the widget and the name of the widget. If a ``@Description`` annotation is not present, the plugin class must implement the ``get()`` method to return its widgets.
es_mx: Ahora que ha terminado de crear el archivo FXML, puede crear la clase del widget. La clase del widget debe incluir la anotación ``@Description`` que establece que los tipos de datos permitidos por el widget y el nombre del widget. Si la anotación`` @Description`` no está presente, la clase plugin debe implementar el método ``get()`` para regresar sus widgets.
fr_ca: Maintenant que nous avons fini de créer notre fichier FXML, nous pouvons maintenant créer une classe de widget. La classe de widget doit inclure une annotation ``@Description`` qui indique les types de données pris en charge du widget et le nom du widget. Si une annotation ``@Description`` n'est pas présente, la classe du plugin doit implémenter la méthode ``get()`` pour retourner ses widgets.
tr_tr: FXML dosyamızı oluşturmayı bitirdiğimize göre, artık bir widget sınıfı oluşturabiliriz. Parçacık sınıfı, parçacığın desteklenen veri türlerini ve parçacığın adını belirten bir ``@ Açıklama`` ek açıklaması içermelidir. Bir ``@ Description`` ek açıklaması yoksa, eklenti sınıfı, widget'larını döndürmek için ``get ()`` yöntemini uygulamalıdır.

source: It also must include a ``@ParametrizedController`` annotation that points to the FXML file containing the layout of the widget. If the class that only supports one data source it must extend the ``SimpleAnnotatedWidget`` class. If the class supports multiple data sources, it must extend the ``ComplexAnnotatedWidget`` class. For more information, see :doc:`widget-types`.
es_mx: También debe incluir una anotación ``@ParametrizedController`` que apunte al archivo FXML que contiene el diseño del widget. Si la clase que solo admite una fuente de datos, debe extender la clase ``SimpleAnnotatedWidget``. Si la clase admite múltiples fuentes de datos, debe extender la clase ``ComplexAnnotatedWidget``. Para obtener más información, consulte :doc:`widget-types`.
fr_ca: Elle doit également inclure une annotation ``@ParametrizedController`` qui pointe vers le fichier FXML contenant la mise en page du widget. Si la classe qui ne prend en charge qu'une seule source de données, elle doit étendre la classe ``SimpleAnnotatedWidget``. Si la classe prend en charge plusieurs sources de données, elle doit étendre la classe ``ComplexAnnotatedWidget``. Pour plus d'informations, voir :doc:`widget-types`.
tr_tr: Ayrıca, pencere aracının düzenini içeren FXML dosyasına işaret eden bir ``@ ParametrizedController`` ek açıklaması içermelidir. Yalnızca bir veri kaynağını destekleyen sınıf, ``SimpleAnnotatedWidget`` sınıfını genişletmelidir. Sınıf birden çok veri kaynağını destekliyorsa, ``ComplexAnnotatedWidget``sınıfını genişletmelidir. Daha fazla bilgi için, bakınız : :doc:`widget-types`.

source: If you are not using a custom data type, you can reference any Java data type (ie. ``Double.class``), or if the widget does not need data binding you can pass ``NoneType.class``.
es_mx: Si no está utilizando un tipo de dato personalizado, puede referenciar a cualquier tipo de dato Java (como ``Double.class``) o si el widget no necesita enlaces de datos, puede pasar ``NoneType.class``.
fr_ca: Si vous n'utilisez pas de type de données personnalisées, vous pouvez référencer n'importe quel type de données Java (par exemple, ``Double.class``), ou si le widget n'a pas besoin de liaison de données, vous pouvez passer ``NoneType.class``.
tr_tr: Özel bir veri türü kullanmıyorsanız, herhangi bir Java veri türüne (yani `Double.class``) başvurabilirsiniz veya widget veri bağlamaya ihtiyaç duymuyorsa, ``NoneType.class`` öğesini iletebilirsiniz.

source: Now that we have created our class we can create fields for the widgets we declared in our FXML file using the ``@FXML`` annotation. For our two sliders, an example would be:
es_mx: Ahora que ha creado la clase, puede crear campos para los widgets declarados en el archivo FXML usando la anotación ``@FXML``. Para los dos intensificadores, un ejemplo sería:
fr_ca: Maintenant que nous avons créé notre classe, nous pouvons créer des champs pour les widgets que nous avons déclarés dans notre fichier FXML en utilisant l'annotation ``@FXML``. Pour nos deux curseurs, un exemple serait:
tr_tr: Artık sınıfımızı oluşturduğumuza göre, ``@ FXML`` notunu kullanarak FXML dosyamızda beyan ettiğimiz widget'lar için alanlar oluşturabiliriz. İki kaydırıcımız için bir örnek şöyle olabilir:

source: In order to display our pane on our custom widget we need to override the ``getView()`` method and return our ``StackPane``.
es_mx: Para visualizar el panel en el widget personalizado es necesario sobreescribir el método ``getView()`` y regresar el ``StackPane``.
fr_ca: Afin d'afficher notre volet sur notre widget personnalisé, nous devons remplacer la méthode ``getView()`` et renvoyer notre ``StackPane``.
tr_tr: Bölmemizi özel widget'ımızda görüntülemek için ``getView()`` yöntemini geçersiz kılmamız ve ``StackPane`` i döndürmemiz gerekir.

source: Binding Elements and Adding Listeners
es_mx: Enlazar Elementos y añadir Escuchadores
fr_ca: Lier des éléments et ajouter des écouteurs
tr_tr: Bağlama Öğeleri ve Dinleyiciler Ekleme

source: Binding is a mechanism that allows JavaFX widgets to express direct relationships with the data source. For example, changing a widget will change its related NetworkTableEntry and vise versa.
es_mx: Enlazar es un mecanismo que permita a widgets JavaFX expresar relaciones directas con la fuente de datos. Por ejemplo, cambiar un widget cambiará la NetworkTableEntry relacionada y viceversa.
fr_ca: La liaison est un mécanisme qui permet aux widgets JavaFX d'exprimer des relations directes avec la source de données. Par exemple, la modification d'un widget modifiera son NetworkTableEntry associé et vice versa.
tr_tr: Bağlama, JavaFX widget'larının veri kaynağıyla doğrudan ilişkileri ifade etmesine izin veren bir mekanizmadır. Örneğin, bir pencere aracını değiştirmek, ilgili NetworkTableEntry değerini değiştirir ve bunun tersi de geçerlidir.

source: An example, in this case, would be changing the X and Y coordinate of our 2D point by changing the values of xSlider and ySlider respectively.
es_mx: Un ejemplo, en este caso, sería cambiar las coordenadas X,Y del objeto 2DPoint al cambiar los valores de xSlider y ySlider, respectivamente.
fr_ca: Un exemple, dans ce cas, serait de changer les coordonnées X et Y de notre point 2D en changeant les valeurs de xSlider et ySlider respectivement.
tr_tr: Bu durumda bir örnek, sırasıyla xSlider ve ySlider değerlerini değiştirerek 2B noktamızın X ve Y koordinatlarını değiştirmek olabilir.

source: A good practice is to set bindings in the ``initialize()`` method tagged with the ``@FXML`` annotation which is required to call the method from FXML if the method is not ``public``.
es_mx: Una buena práctica es enlazar en el método ``initialize()`` con la etiqueta ``@FXML`` que requiere llamar al método de FXML si el método no es ``público``.
fr_ca: Une bonne pratique consiste à définir des liaisons dans la méthode ``initialize()`` étiquetée avec l'annotation ``@FXML`` qui est nécessaire pour appeler la méthode depuis FXML si la méthode n'est pas déclarée ``public``.
tr_tr: Method ``public`` değilse, yöntemi FXML'den çağırmak için gerekli olan ``@ FXML`` ek açıklaması ile etiketlenmiş ``initialize()`` yönteminde bağlamaları ayarlamak iyi bir uygulamadır.
