Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/custom-widgets/creating-plugins.po
Languages: es_mx, fr_ca, tr_tr

source: Creating a Plugin
es_mx: Crear un Plugin
fr_ca: Création d'un plugin
tr_tr: Bir Eklenti Oluşturmak

source: Overview
es_mx: Resumen
fr_ca: Aperçu
tr_tr: Genel Bakış

source: Plugins provide the ability to create custom widgets, layouts, data sources/types, and custom themes. Shuffleboard provides the following :ref:`built-in plugins <docs/software/wpilib-tools/shuffleboard/custom-widgets/builtin-plugins:Built-in Plugins>`.
es_mx: Los complementos brindan la capacidad de crear widgets personalizados, diseños, fuentes / tipos de datos y temas personalizados. Shuffleboard proporciona los siguientes :ref:`complementos <docs/software/wpilib-tools/shuffleboard/custom-widgets/builtin-plugins:Built-in Plugins>`.
fr_ca: Les plugins offrent la possibilité de créer des widgets personnalisés, des mises en page, des sources / types de données et des thèmes personnalisés. Shuffleboard fournit les éléments suivants :ref:`comme plugins <docs/software/wpilib-tools/shuffleboard/custom-widgets/builtin-plugins:Built-in Plugins>`.
tr_tr: Eklentiler, özel pencere öğeleri, düzenler, veri kaynakları / türleri ve özel temalar oluşturma yeteneği sağlar. Shuffleboard şunları sağlar :ref:`built-in plugins <docs/software/wpilib-tools/shuffleboard/custom-widgets/builtin-plugins:Built-in Plugins>`.

source: NetworkTables Plugin: To connect to data published over NetworkTables
es_mx: NetworkTables Plugin: conecta los datos publicados en NetworkTables
fr_ca: Plugin NetworkTables: pour se connecter aux données publiées sur NetworkTables
tr_tr: NetworkTables Eklentisi: NetworkTables üzerinden yayınlanan verilere bağlanmak için

source: Base Plugin: To display custom FRC\ |reg| data types in custom widgets
es_mx: Base Plugin: Muestra tipos personalizados de datos FRC\ |reg| en widgets personalizados
fr_ca: Base Plugin: Pour afficher des types de données FRC\ |reg| personnalisés dans des gadgets personnalisés
tr_tr: Base Plugin-Temel Eklenti: Özel FRC\|reg| özel widget'larda veri türleri

source: CameraServer Plugin: To view streams from the CameraServer
es_mx: CameraServer Plugin: Muestra transmisiones desde la CamaraServer.
fr_ca: Plugin CameraServer: pour afficher les flux du CameraServer
tr_tr: CameraServer Eklentisi: CameraServer'dan akışları görüntülemek için

source: An example custom Shuffleboard plugin which creates a custom data type and a simple widget for displaying it can be found `here <https://github.com/wpilibsuite/shuffleboard/tree/main/example-plugins/custom-data-and-widget>`__.
es_mx: Puede encontrar un ejemplo de complemento de Shuffleboard personalizado que crea un tipo de datos personalizado y un widget simple para mostrarlo `aquí <https://github.com/wpilibsuite/shuffleboard/tree/main/example-plugins/custom-data-and-widget>`__.
fr_ca: Un exemple de plugin Shuffleboard personnalisé qui crée un type de données personnalisé et un widget simple pour l'afficher peut être trouvé `ici <https://github.com/wpilibsuite/shuffleboard/tree/main/example-plugins/custom-data-and-widget>`__.
tr_tr: Özel bir veri türü ve bunu görüntülemek için basit bir pencere öğesi oluşturan örnek bir özel Shuffleboard eklentisi `here <https://github.com/wpilibsuite/shuffleboard/tree/main/example-plugins/custom-data-and-widget>`__. bulunabilir.

source: Create a Custom Plugin
es_mx: Crear un Plugin Personalizado
fr_ca: Créer un plugin personnalisé
tr_tr: Özel Bir Eklenti Oluşturun

source: In order to define a plugin, the plugin class must be a subclass of `edu.wpi.first.shuffleboard.api.Plugin <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/plugin/Plugin.java>`_ or one of its subclasses. An example of a plugin class would be as following.
es_mx: Para definir un complemento, la clase de complemento debe ser una subclase de `edu.wpi.first.shuffleboard.api.Plugin <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/plugin/Plugin.java>`_ o una de sus subclases. Un ejemplo de una clase de complemento sería el siguiente.
fr_ca: Afin de définir un plugin, la classe de plugin doit être une sous-classe de `edu.wpi.first.shuffleboard.api.Plugin <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/plugin/Plugin.java>`_ ou l'une de ses sous-classes. Un exemple de classe plugin serait le suivant.
tr_tr: Bir eklenti tanımlamak için eklenti sınıfı, `edu.wpi.first.shuffleboard.api.Plugin <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/plugin/Plugin.java>` _ alt sınıfı veya alt sınıflarından biri olmalıdır. Eklenti sınıfına bir örnek aşağıdaki gibidir.

source: Additional explanations on how these attributes are used, including version numbers can be found `here <https://semver.org/>`_.
es_mx: Explicaciones adicionales sobre cómo utilizar estos atributos, incluyendo versiones numéricas pueden encontrarse `aquí <https://semver.org/>`_.
fr_ca: Des explications supplémentaires sur la façon dont ces attributs sont utilisés, y compris les numéros de version, peuvent être trouvées `ici <https://semver.org/>`_.
tr_tr: Sürüm numaraları dahil olmak üzere bu özniteliklerin nasıl kullanıldığına ilişkin ek açıklamalar `here <https://semver.org/>`_ bulunabilir.

source: Note the ``@Description`` annotation is needed to tell the plugin loader the properties of the custom plugin class. Plugin classes are permitted to have a default constructor but it cannot take any arguments.
es_mx: Note que la anotación ``@Description`` es necesaria para notificar al cargador de plugin sobre las propiedades de la clase plugin personalizada. Las clases plugin pueden tener un constructor predeterminado, pero no pueden tener ningún argumento.
fr_ca: Notez que l'annotation ``@Description`` est nécessaire pour indiquer au chargeur de plug-in les propriétés de la classe de plug-in personnalisée. Les classes de plugins sont autorisées à avoir un constructeur par défaut mais il ne peut accepter aucun argument.
tr_tr: Eklenti yükleyiciye özel eklenti sınıfının özelliklerini söylemek için ``@Description`` ek açıklamasının gerekli olduğuna dikkat edin. Eklenti sınıflarının varsayılan bir kurucuya sahip olmasına izin verilir, ancak herhangi bir argüman alamaz.

source: Building plugin
es_mx: Construir un Plugin
fr_ca: Construction d'un plugin
tr_tr: Eklenti oluşturma

source: Plugins require the usage of the `Shuffleboard API Library <https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/shuffleboard/api/>`_. These dependencies can be resolved in the ``build.gradle`` file or using maven. The dependencies would be as follows:
es_mx: Los plugin requieren del uso de la `Biblioteca Shuffleboard API <https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/shuffleboard/api/>`_. Estas dependencias pueden resolverse en el archivo ``build.gradle`` o utilizando maven. Las dependencias serían como se muestra a continuación:
fr_ca: Les plug-ins nécessitent l'utilisation de la librairie `Shuffleboard API Library <https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/shuffleboard/api/>`_. Ces dépendances peuvent être résolues dans le fichier ``build.gradle`` ou en utilisant Apache Maven-un outil d’automatisation de construction utilisé principalement pour les projets Java. Les dépendances seraient les suivantes:
tr_tr: Eklentiler, `Shuffleboard API Library <https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/shuffleboard/api/>`_ kullanımını gerektirir. Bu bağımlılıklar ```build.gradle`` dosyasında veya maven kullanılarak çözülebilir. Bağımlılıklar aşağıdaki gibi olacaktır:

source: For Gradle:
es_mx: Para Gradle:
fr_ca: Pour Gradle:
tr_tr: Gradle için:

source: Plugins are allowed to have dependencies on other plugins and libraries, however, they must be included correctly in the maven or gradle build file. When a plugin depends on other plugins, it is good practice to define those dependencies so the plugin does not load when the dependencies do not load as well. This can be done using the ``@Requires`` annotation as shown below:
es_mx: Los plugin pueden tener dependencias con otros plugin y bibliotecas, sin embargo, deben estar incluidos correctamente en el maven o en el archivo gradle build. Cuando un plugin depende de otro es una buena práctica definir esas dependencias para que el plugin no cargue cuando las dependencias no lo hagan. Esto puede realizarse utilizando la anotación ``@Requires`` como se muestra a continuación:
fr_ca: Les plugins sont autorisés à avoir des dépendances avec d'autres plugins et librairies, cependant, ils doivent être inclus correctement dans le fichier de construction Maven ou Gradle. Lorsqu'un plugin dépend d'autres plugins, il est recommandé de définir ces dépendances afin que le plugin ne se charge pas lorsque les dépendances ne se chargent pas également. Cela peut être fait en utilisant l'annotation ``@Requires`` comme indiqué ci-dessous:
tr_tr: Eklentilerin diğer eklentilere ve kitaplıklara bağımlı olmasına izin verilir, ancak bunların maven veya gradle derleme dosyasına doğru şekilde dahil edilmesi gerekir. Bir eklenti diğer eklentilere bağlı olduğunda, bağımlılıklar yüklenmediğinde eklentinin yüklenmemesi için bu bağımlılıkları tanımlamak iyi bir uygulamadır. Bu, aşağıda gösterildiği gibi ``@Requires`` ek açıklaması kullanılarak yapılabilir:

source: The ``minVersion`` specifies the minimum allowable version of the plugin that can be loaded. For example, if the ``minVersion`` is 1.4.5, and the plugin with the version 1.4.7 is loaded, it will be allowed to do so. However, if the plugin with the version 1.2.4 is loaded, it will not be allowed to since it is less than the ``minVersion``.
es_mx: La ``minVersion`` especifica la versión mínima permitida del plugin que puede cargarse. Por ejemplo, si la ``minVersion`` es 1.4.5 y el plugin con la versión 1.4.7 se carga, se permitirá hacerlo. Sin embargo, si la versión fuese 1.2.4, entonces no se permitirá desde que es menos que la ``minVersion``.
fr_ca: La ``minVersion`` spécifie la version minimale autorisée du plugin qui peut être chargée. Par exemple, si la ``minVersion`` est 1.4.5 et que le plugin avec la version 1.4.7 est chargé, il sera autorisé à le faire. Cependant, si le plugin avec la version 1.2.4 est chargé, il ne sera pas autorisé à le faire car il est inférieur à la ``minVersion``.
tr_tr: ``minVersion``, yüklenebilecek eklentinin izin verilen minimum sürümünü belirtir. Örneğin, ``minVersion`` 1.4.5 ise ve 1.4.7 sürümüne sahip eklenti yüklüyse, bunu yapmasına izin verilecektir. Bununla birlikte, 1.2.4 sürümüne sahip eklenti yüklenirse, ``minVersion`` dan küçük olduğu için eklentiye izin verilmeyecektir.

source: Deploying Plugin To Shuffleboard
es_mx: Desplegar un Plugin a Shuffleboard
fr_ca: Déploiement du plugin au Shuffleboard
tr_tr: Eklentiyi Shuffleboard'a Yerleştirme

source: In order to load a plugin in Shuffleboard, you will need to generate a jar file of the plugin and put it in the ``~/Shuffleboard/plugins`` folder. This can be done automatically from gradle as noted:
es_mx: Para cargar un plugin a Shuffleboard necesitará generar un archivo jar del plugin y ponerlo en la carpeta ``~/Shuffleboard/plugins``. Esto puede realizarse de manera automática en el gradle como se muestra:
fr_ca: Afin de charger un plugin dans le Shuffleboard, vous devrez générer un fichier .jar du plugin et le placer dans le dossier ``~/Shuffleboard/plugins``. Cela peut être fait automatiquement à partir de Gradle, comme indiqué:
tr_tr: Shuffleboard'da bir eklenti yüklemek için, eklentinin bir jar dosyasını oluşturmanız ve onu ``~/Shuffleboard/plugins`` klasörüne koymanız gerekir. Bu, not edildiği gibi otomatik olarak yapılabilir:

source: The path to your Shuffleboard plugin folder will most likely be ``~/Shuffleboard/plugins``.
es_mx: La dirección a su carpeta del plugin Shuffleboard probablemente sea ``~/Shuffleboard/plugins``.
fr_ca: Le chemin vers votre dossier de plugins Shuffleboard sera probablement ``~/Shuffleboard/plugins``.
tr_tr: Shuffleboard eklenti klasörünüzün yolu büyük olasılıkla ``~/Shuffleboard/plugins`` olacaktır.

source: The ``deployPlugin`` task takes four parameters, the ``type: Copy`` parameter makes the task implement the `CopySpec <https://docs.gradle.org/current/javadoc/org/gradle/api/file/CopySpec.html>`_ interface specifying what to copy. The group and description parameters to specify what the Group ID of the plugin is and a short descriptive description to what the Plugin does.
es_mx: La tarea ``deployPlugin`` acepta cuatro parámetros, el parámetro ``type: Copy`` hace que la tarea implemente la interface `CopySpec <https://docs.gradle.org/current/javadoc/org/gradle/api/file/CopySpec.html>`_ especificando qué se copia. Los parámetros de grupo y descripción son para especificar el ID de grupo del plugin y una descripción corta para incluir qué hace el plugin.
fr_ca: La tâche ``deployPlugin`` prend quatre paramètres, le paramètre ``type: Copy`` fait que la tâche implémente l'interface `CopySpec <https://docs.gradle.org/current/javadoc/org/gradle/api/file/CopySpec.html>`_ spécifiant quoi copier. Les paramètres de groupe et de description spécifient l'ID de groupe du plugin et une brève description de ce que fait le plugin.
tr_tr: ``deployPlugin`` görevi dört parametre alır, ``type: Copy`` parametresi, görevin neyin kopyalanacağını belirterek `CopySpec <https://docs.gradle.org/current/javadoc/org/gradle/api/file/CopySpec.html>` arayüzünü uygulamasını sağlar. Eklentinin Grup Kimliğinin ne olduğunu belirten grup ve açıklama parametreleri ve Eklentinin ne yaptığına ilişkin kısa bir açıklayıcı açıklama.

source: In the body, the ``from`` field specifies from where the file is to be copied from, followed by the ``into`` field specifying the destination to where the file needs to be copied to. Finally, the ``include`` field ensures all files with the ``.jar`` extension is also copied.
es_mx: En el cuerpo, el campo ``from`` especifica de dónde se ha copiado el archivo, seguido del campo ``into`` que especifica el destino de los archivos copiados. Finalmente, el campo ``include`` asegura que todos los archivos con la extensión ``.jar`` también sean copiados.
fr_ca: Dans le corps, le champ ``from`` spécifie d'où le fichier doit être copié, suivi du champ ``into`` spécifiant la destination vers laquelle le fichier doit être copié. Enfin, le champ ``include`` garantit que tous les fichiers avec l'extension ``.jar`` sont également copiés.
tr_tr: Gövdede, ``from-kimden`` alanı dosyanın nereden kopyalanacağını belirtir, ardından dosyanın kopyalanması gereken hedefi belirten ``into-içine`` alanı gelir. Son olarak, ``include-dahil et`` alanı, ``.jar`` uzantılı tüm dosyaların da kopyalanmasını sağlar.

source: After deploying, Shuffleboard will cache the path of the plugin so it can be automatically loaded the next time Shuffleboard loads. It may be necessary to click on ``Clear Cache`` under the plugins menu to remove a plugin or reload a plugin into Shuffleboard.
es_mx: Después de desplegar, Shuffleboard almacenará la dirección del plugin para que cargue automáticamente la siguiente vez que se cargue Shuffleboard. Tal vez sea necesario seleccionar ``Clear Cache`` en el menú de plugin para remover o volver a cargar un plugin en Shuffleboard.
fr_ca: Après le déploiement, le Shuffleboard mettra en cache le chemin du plugin afin qu'il puisse être automatiquement chargé lors du prochain chargement du Shuffleboard. Il peut être nécessaire de cliquer sur ``Clear Cache`` dans le menu des plugins pour supprimer un plugin ou recharger un plugin dans le Shuffleboard.
tr_tr: Kod dağıtımdan sonra Shuffleboard, eklentinin yolunu önbelleğe alır, böylece Shuffleboard bir sonraki sefer yüklendiğinde otomatik olarak yüklenebilir. Bir eklentiyi kaldırmak veya bir eklentiyi Shuffleboard'a yeniden yüklemek için eklentiler menüsünün altındaki ``Clear Cache`` seçeneğine tıklamak gerekebilir.

source: By running ``gradle deployPlugin`` from the command line, the jar file will automatically placed into the Shuffleboard plugin folder.
es_mx: Al ejecutar ``gradle deployPlugin`` de la línea de comando, el archivo jar automáticamente agregará el archivo jar a la carpeta del plugin Shuffleboard.
fr_ca: En exécutant ``gradle deployPlugin`` à partir de la ligne de commande, le fichier .jar sera automatiquement placé dans le dossier du plugin Shuffleboard.
tr_tr: Komut satırından ``gradle deployPlugin``çalıştırıldığında, jar dosyası otomatik olarak Shuffleboard eklenti klasörüne yerleştirilecektir.

source: Manually Adding Plugin
es_mx: Agregar Manualmente un Plugin
fr_ca: Ajout manuel d'un Plugin
tr_tr: Eklentiyi Manuel Olarak Ekleme

source: The other way to add a plugin to Shuffleboard is to compile it to a jar file and add it from Shuffleboard. First, compile your plugin into a ``.jar`` file using Maven or Gradle. Then, open Shuffleboard, click on the file tab in the top left, and choose Plugins from the drop down menu.
es_mx: La otra forma de agregar un plugin a Shuffleboard es compilarlo en un archivo jar y agregarlo desde Shuffleboard. Primero, compile su plugin en un archivo `` .jar '' utilizando Maven o Gradle. Luego, abra Shuffleboard, haga clic en la pestaña del archivo en la parte superior izquierda y elija Plugins en el menú desplegable.
fr_ca: L’autre façon d’ajouter un plugin au Shuffleboard est de le compiler dans un fichier jar et de l’ajouter à partir du Shuffleboard. Tout d’abord, compilez votre plugin dans un fichier ``.jar`` à l’aide de Maven ou Gradle. Ensuite, ouvrez le Shuffleboard, cliquez sur l’onglet File en haut à gauche, puis choisissez Plugins dans le menu déroulant.
tr_tr: Shuffleboard'a bir eklenti eklemenin diğer yolu, onu bir jar dosyasına derlemek ve Shuffleboard'dan eklemektir. Öncelikle, eklentinizi Maven veya Gradle kullanarak bir ``.jar`` dosyası halinde derleyin. Ardından Shuffleboard'u açın, sol üstteki dosya sekmesine tıklayın ve açılır menüden Eklentiler'i seçin.

source: From the plugins window, choose the "Load plugin" button in the bottom right, and select your jar file.
es_mx: Desde la ventana de plugin, escoja el botón “Cargar plugin” en la esquina inferior derecha, y seleccione su archivo jar.
fr_ca: Dans la fenêtre des plugins, choisissez le bouton "Load plugin" en bas à droite et sélectionnez votre fichier .jar.
tr_tr: Eklentiler penceresinden, sağ alttaki "Load plugin-Eklentiyi yükle" düğmesini seçin ve jar dosyanızı seçin.
