Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/custom-widgets/creating-a-new-widget.po
Languages: es_mx, fr_ca, tr_tr

source: The above ``initialize`` method binds the slider's value property to the ``MyPoint2D`` data class' corresponding X and Y value. Meaning, changing the slider will change the coordinate and vise versa. The ``dataOrDefault.map()`` method will get the data source's value, or, if no source is present, will return the default value.
es_mx: El método ``initialize`` de arriba enlaza la propiedad del valor del deslizador a la clase de datos ``MyPoint2D`` que corresponde a los valores X y Y. Es decir, cambiar el deslizador va a cambiar la coordenada y viceversa. El método ``dataOrDefault.map()`` va a tener el valor de la fuente de datos o si no se presenta una fuente, se mostrará el valor de defecto.
fr_ca: La méthode ``initialize`` ci-dessus lie la propriété value du curseur à la valeur X et Y correspondante de la classe de données ``MyPoint2D``. Cela signifie que changer le curseur changera les coordonnées et vice versa. La méthode ``dataOrDefault.map()`` obtiendra la valeur de la source de données, ou, si aucune source n'est présente, retournera la valeur par défaut.
tr_tr: Yukarıdaki `` nitialize`` yöntemi, kaydırıcının value özelliğini X ve Y değerine karşılık gelen ``MyPoint2D`` veri sınıfına bağlar. Yani, kaydırıcıyı değiştirmek koordinatı değiştirir ve bunun tersi de geçerlidir. ``DataOrDefault.map()`` yöntemi, veri kaynağının değerini alır veya kaynak yoksa varsayılan değeri döndürür.

source: Using a listener is another way to change values when the slider or data source has changed. For example a listener for our slider would be:
es_mx: Usar un escuchador es otra manera de cambiar los valores cuando el deslizador o la fuente de datos cambia. Un ejemplo de un escuchador para nuestro deslizador puede ser:
fr_ca: L'utilisation d'un écouteur est une autre façon de modifier les valeurs lorsque le curseur ou la source de données a changé. Par exemple, un écouteur pour notre curseur serait:
tr_tr: Dinleyici kullanmak, kaydırıcı veya veri kaynağı değiştiğinde değerleri değiştirmenin başka bir yoludur. Örneğin kaydırıcımız için bir dinleyici şöyle olacaktır:

source: In this case, the ``setData()`` method sets the value in the data source of the widget to the ``newValue``.
es_mx: En este caso, el método ``setData()`` establece el valor en la fuente de datos del widget al ``newValue``.
fr_ca: Dans ce cas, la méthode ``setData()`` définit la valeur de la source de données du widget sur la ``newValue``.
tr_tr: Bu durumda, ``setData()``yöntemi, widget'ın veri kaynağındaki değeri ``newValue`` olarak ayarlar.

source: Exploring Custom Components
es_mx: Explorar componentes personalizados
fr_ca: Explorer les composants personnalisés
tr_tr: Özel Bileşenleri Keşfetme

source: Widgets are not automatically discovered when loading plugins; the defining plugin must explicitly export it for it to be usable. This approach is taken to allow multiple plugins to be defined in the same JAR.
es_mx: Los widgets no se descubren automáticamente cuando se cargan plugins, el plugin se debe exportar explícitamente para poder ser utilizado. Este acercamiento permite que múltiples plugins sean definidos en el mismo JAR.
fr_ca: Les widgets ne sont pas automatiquement trouvés lors du chargement des plugins; le plugin de définition doit l'exporter explicitement pour qu'il soit utilisable. Cette approche est adoptée pour permettre à plusieurs plugins d'être définis dans le même JAR.
tr_tr: Eklentiler yüklenirken widget'lar otomatik olarak keşfedilmez; tanımlayıcı eklentinin kullanılabilir olması için onu açıkça dışa aktarması gerekir. Bu yaklaşım, aynı JAR'da birden fazla eklentinin tanımlanmasına izin vermek için kullanılır.

source: Set Default Widget For Data type
es_mx: Configurar un widget predeterminado para tipos de datos
fr_ca: Définir le widget par défaut pour le type de données
tr_tr: Veri türü için Varsayılan Widget'ı Ayarla

source: In order to set your widget as default for your custom data type, you can override the ``getDefaultComponents()`` in your plugin class that stores a Map for all default widgets as noted below:
es_mx: Para configurar su widget como la predeterminada para su tipo de dato personalizado, puede sobreescribir el método ``getDefaultComponents()`` en la clase de su plugin que almacena un Mapa para todos los widgets predeterminados, como se muestra a continuación:
fr_ca: Afin de définir votre widget par défaut pour votre type de données personnalisé, vous pouvez remplacer le ``getDefaultComponents()`` dans votre classe de plugin qui stocke une carte pour tous les widgets par défaut comme indiqué ci-dessous:
tr_tr: Widget'ınızı özel veri türünüz için varsayılan olarak ayarlamak için, aşağıda belirtildiği gibi tüm varsayılan widget'lar için bir Harita depolayan eklenti sınıfınızdaki ``getDefaultComponents ()`` öğesini geçersiz kılabilirsiniz:
