Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/custom-widgets/creating-custom-data-types.po
Languages: es_mx, fr_ca, tr_tr

source: Creating Custom Data Types
es_mx: Crear tipos de datos personalizados
fr_ca: Création de types de données personnalisés
tr_tr: Özel Veri Türleri Oluşturma

source: Widgets allow us to control and visualize different types of data. This data could be integers and doubles or even Java Objects. In order to display these types of data using widgets, it is helpful to create a container class for them. It is not necessary to create your own Data Class if the widget will handle single fielded data types such as doubles, arrays, or strings.
es_mx: Los widgets le permiten controlar y visualizar diferentes tipos de datos. Estos datos podrían ser integers o doubles o incluso Objetos de Java. Para visualizar estos tipos de datos utilizando widgets es útil crear una clase contenedora para estos. No es necesario crear su propia clase de Datos si el widget manejará tipos de datos con un solo campo, tales como doubles, arrays o strings.
fr_ca: Les widgets nous permettent de contrôler et de visualiser différents types de données. Ces données peuvent être des nombres entiers, doubles ou même des objets Java. Afin d'afficher ces types de données à l'aide de widgets, il est utile de créer une classe conteneur pour eux. Il n'est pas nécessaire de créer votre propre classe de données si le widget gère des types de données en champ unique tels que des doubles, des tableaux ou des chaînes de caractères..
tr_tr: Widget'lar, farklı veri türlerini kontrol etmemizi ve görselleştirmemizi sağlar. Bu veriler tamsayılar ve çiftler veya hatta Java Nesneleri olabilir. Bu tür verileri widget kullanarak görüntülemek için, bunlar için bir konteyner sınıfı oluşturmak yararlıdır. Widget doubles, arrays veya string gibi tekli alanlı veri türlerini işleyecekse kendi Data Class'ınızı oluşturmanız gerekmez.

source: Creating The Data Class
es_mx: Crear Clase de Datos
fr_ca: Création de la classe de données
tr_tr: Veri Sınıfının Oluşturulması

source: In this example, we will create a custom data type for a 2D Point and its x and y coordinates. In order to create a custom data type class, it must extend the abstract class `ComplexData <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/data/ComplexData.java>`_. Your custom data class must also implement the ``asMap()`` method that returns the represented data as a simple map as noted below with the ``@Override`` annotation:
es_mx: En este ejemplo, crearemos un tipo de datos personalizado para un punto 2D y sus coordenadas x e y. Para crear una clase de tipo de datos personalizada, debe extender la clase abstracta `ComplexData <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/data/ComplexData.java>`_. Su clase de datos personalizados también debe implementar el método ``asMap()`` que devuelve los datos representados como un mapa simple como se indica a continuación con la anotación ``@Override``:
fr_ca: Dans cet exemple, nous allons créer un type de données personnalisé pour un point 2D et ses coordonnées x et y. Pour créer une classe de type de données personnalisée, elle doit étendre la classe abstraite `ComplexData <https://github.com/wpilibsuite/shuffleboard/blob/main/api/src/main/java/edu/wpi/first/shuffleboard/api/data/ComplexData.java>`_. Votre classe de données personnalisée doit également implémenter la méthode ``asMap()`` qui renvoie les données représentées sous la forme d'une carte simple, comme indiqué ci-dessous avec l'annotation ``@Override`` :

source: It is also good practice to override the default ``equals`` and ``hashcode`` methods to ensure that different objects are considered equivalent when their fields are the same. The ``asMap()`` method should return the data represented in a simple Map object as it will be mapped to the NetworkTable entry it corresponds to. In this case, we can represent the point as its X and Y coordinates and return a ``Map`` containing them.
es_mx: Es una buena práctica sobreescribir los métodos predeterminados de ``equals`` y ``hashcode`` para asegurar que los diferentes objetos sean considerados equivalentes cuando sus campos sean los mismos. El método ``asMap()`` debería regresar los datos representados en un objeto Map simple ya que será mapeado a la entrada NetworkTable correspondiente. En este caso, puede representar el punto como sus coordenadas X,Y y regresar un Mapa que los contenga.
tr_tr: Farklı nesnelerin alanları aynı olduğunda eşdeğer kabul edilmesini sağlamak için varsayılan ``equals-eşittir`` ve ``hashcode-karma kod '' yöntemlerini geçersiz kılmak da iyi bir uygulamadır. ``asMap()`` methodu, karşılık gelen NetworkTable girişine eşleneceği için basit bir Map nesnesinde temsil edilen verileri döndürmelidir. Bu durumda, noktayı X ve Y koordinatları olarak temsil edebilir ve bunları içeren bir ``Map-Harita`` '' döndürebiliriz.

source: Other methods can be added to retrieve or edit fields and instance variables, however, it is good practice to make these classes immutable to prevent changing the source data objects. Instead, you can make a new copy object instead of manipulating the existing object. For example, if we wanted to change the y coordinate of our point, we can define the following method:
es_mx: Otros métodos pueden añadirse para recuperar o editar campos y variables de la instancia, sin embargo, es buena práctica hacer estas clases inmutables para prevenir cambios en la fuente de datos. En cambio, puede realizar una copia del objeto en lugar de manipular el objeto existente. Por ejemplo, si quisiera cambiar la coordenada y de su punto, podría definir el siguiente método:
fr_ca: D'autres méthodes peuvent être ajoutées pour récupérer ou modifier des champs et des variables d'instance, mais il est recommandé de rendre ces classes immuables pour éviter de changer les objets de données source. Au lieu de cela, vous pouvez créer une copie du nouvel objet au lieu de manipuler l'objet existant. Par exemple, si nous voulions changer la coordonnée y de notre point, nous pourions définir la méthode suivante:
tr_tr: Alanları ve örnek değişkenlerini almak veya düzenlemek için başka yöntemler eklenebilir, ancak, kaynak veri nesnelerinin değiştirilmesini önlemek için bu sınıfları değişmez yapmak iyi bir uygulamadır. Bunun yerine, mevcut nesneyi değiştirmek yerine yeni bir kopya nesnesi oluşturabilirsiniz. Örneğin, noktamızın y koordinatını değiştirmek istersek, aşağıdaki yöntemi tanımlayabiliriz:

source: This creates a new ``MyPoint2D`` object and returns it with the new y-coordinate. Same can be done for changing the x coordinate.
es_mx: Esto crea un nuevo objeto ``MyPoint2D`` y lo regresa con una nueva coordenada Y. Puede hacerse lo mismo para la coordenada X.
fr_ca: Cela crée un nouvel objet ``MyPoint2D`` et le renvoie avec la nouvelle coordonnée y. La même chose peut être faite pour changer la coordonnée x.
tr_tr: Bu, yeni bir ``MyPoint2D`` nesnesi oluşturur ve onu yeni y koordinatı ile döndürür. Aynı şey x koordinatını değiştirmek için de yapılabilir.

source: Creating a Data Type
es_mx: Crear un Tipo de Dato
fr_ca: Création d'un type de données
tr_tr: Veri Türü Oluşturma

source: There are two different data types that can be made: Simple data types that have only one field (ie. a single number or string), and Complex data types that have multiple data fields (ie. multiple strings, multiple numbers).
es_mx: Se pueden crear dos tipos de datos: Tipos de datos simples que solo contienen un campo (por ejemplo, un solo número o un string) y tipos de datos complejos que contienen varios campos (por ejemplo, múltiples strings o números).
fr_ca: Il existe deux types de données différents: les types de données simples qui n'ont qu'un seul champ (c'est-à-dire un seul nombre ou chaîne de caractères) et les types de données complexes, qui ont plusieurs champs de données (c'est-à-dire plusieurs chaînes, plusieurs nombres).
tr_tr: Yapılabilecek iki farklı veri türü vardır: Yalnızca bir alana (yani, tek bir sayı veya dizge) sahip basit veri türleri ve birden çok veri alanına sahip karmaşık veri türleri (yani, birden çok dizgi, birden çok sayı).

source: In order to define a simple data type, the class must extend the ``SimpleDataType<DataType>`` class with the data type needed and implement the ``getDefaultValue()`` method. In this example, we will use a double as our simple data type.
es_mx: Para definir un tipo de dato simple, la clase debe extender la clase ``SimpleDataType<DataType>`` con el tipo de dato necesario e implementar el método ``getDefaultValue()``. En este ejemplo, usaremos un double como su tipo de dato simple.
fr_ca: Afin de définir un type de données simple, la classe doit étendre la classe ``SimpleDataType<DataType>`` avec le type de données requis et implémenter la méthode ``getDefaultValue()``. Dans cet exemple, nous utiliserons un double comme type de données simple.
tr_tr: Basit bir veri türü tanımlamak için, sınıfın gerekli veri türü ile ``SimpleDataType <DataType>`` sınıfını genişletmesi ve ``getDefaultValue()`` yöntemini uygulaması gerekir. Bu örnekte, basit veri tipimiz olarak bir double kullanacağız.

source: The class constructor is set to private to ensure that only a single instance of the data type will exist.
es_mx: El constructor de la clase es privado para asegurar que una sola instancia del tipo de dato exista
fr_ca: Le constructeur de classe est défini comme private pour garantir qu'une seule instance du type de données existera.
tr_tr: Sınıf yapıcısı, veri türünün yalnızca tek bir örneğinin var olmasını sağlamak için özel olarak ayarlanır.

source: In order to define a complex data type, the class must extend the ``ComplexDataType`` class and override the ``fromMap()`` and ``getDefaultValue()`` methods. We will use our MyPoint2D class as an example to see what a complex data type class would look like.
es_mx: Para definir un tipo de dato complejo, la clase debe extender la clase ``ComplexDataType`` y sobrescribir los métodos ``fromMap()`` y ``getDefaultValue()``. Se continuará usando como ejemplo la clase MyPoint2D para demostrar cómo se ve una clase de tipos de datos complejos.
fr_ca: Afin de définir un type de données complexe, la classe doit étendre la classe ``ComplexDataType`` et remplacer les méthodes ``fromMap()`` et ``getDefaultValue()``. Nous utiliserons notre classe MyPoint2D comme exemple pour voir à quoi ressemblerait une classe de type de données complexe.
tr_tr: Karmaşık bir veri türü tanımlamak için, sınıfın ``ComplexDataType`` sınıfını genişletmesi ve ``fromMap()`` ve ``getDefaultValue()`` yöntemlerini geçersiz kılması gerekir. Karmaşık bir veri türü sınıfının nasıl görüneceğini görmek için MyPoint2D sınıfımızı örnek olarak kullanacağız.

source: The following code above works as noted:
es_mx: El código de arriba funciona de la siguiente forma:
fr_ca: Le code suivant ci-dessus fonctionne comme indiqué:
tr_tr: Yukarıdaki kod, belirtildiği gibi çalışır:

source: The ``fromMap()`` method creates a new MyPoint2D using the values in the NetworkTable entry it is bound to. The ``getOrDefault`` method will return 0.0 if it cannot get the entry values. The ``getDefaultValue`` will return a new ``MyPoint2D`` object if no source is present.
es_mx: El método ``fromMap()`` crea un nuevo objeto MyPoint2D usando los valores de la entrada NetworkTable. El método ``getOrDefault`` regresará 0.0 si no obtiene los valores de entrada. El ``getDefaultValue`` regresará un nuevo objeto ``MyPoint2D`` si la fuente no se encuentra presente.
tr_tr: ``FromMap()`` yöntemi, bağlı olduğu NetworkTable girişindeki değerleri kullanarak yeni bir MyPoint2D oluşturur. ``GetOrDefault`` yöntemi, giriş değerlerini alamazsa 0.0 döndürür. ``GetDefaultValue`` , kaynak yoksa yeni bir ``MyPoint2D`` nesnesi döndürecektir.

source: Exporting Data Type To Plugin
es_mx: Exportar un tipo de dato al plugin
fr_ca: Exportation du type de données vers le plugin
tr_tr: Veri Türünü Eklentiye Aktarma

source: In order to have the data type be recognized by Shuffleboard, the plugin must export them by overriding the ``getDataTypes`` method. For example,
es_mx: Para que Shuffleboard reconozca el tipo de dato, el plugin debe exportarlos al sobrescribir el método ``getDataTypes``. Por ejemplo,
fr_ca: Afin que le type de données soit reconnu par le Shuffleboard, le plugin doit les exporter en remplaçant la méthode ``getDataTypes``. Par exemple,
tr_tr: Veri türünün Shuffleboard tarafından tanınması için, eklentinin ``getDataTypes`` yöntemini geçersiz kılarak bunları dışa aktarması gerekir. Örneğin,

source: It is also good practice to override the default ``equals`` and ``hashcode`` methods to ensure that different objects are considered equivalent when their fields are the same. The ``asMap()`` method should return the data represented in a simple Map object as it will be mapped to the NetworkTables entry it corresponds to. In this case, we can represent the point as its X and Y coordinates and return a ``Map`` containing them.
fr_ca: Il est également recommandé de remplacer les méthodes par défaut ``equals`` et ``hashcode`` pour garantir que différents objets sont considérés comme équivalents lorsque leurs champs sont identiques. La méthode ``asMap()`` doit renvoyer les données représentées dans un simple objet Map car il sera mappé à l'entrée NetworkTables à laquelle il correspond. Dans ce cas, nous pouvons représenter le point comme ses coordonnées X et Y et renvoyer une ``Map`` les contenant.

source: The ``fromMap()`` method creates a new MyPoint2D using the values in the NetworkTables entry it is bound to. The ``getOrDefault`` method will return 0.0 if it cannot get the entry values. The ``getDefaultValue`` will return a new ``MyPoint2D`` object if no source is present.
fr_ca: La méthode ``fromMap()`` crée un nouveau MyPoint2D en utilisant les valeurs de l'entrée NetworkTables à laquelle il est lié. La méthode ``getOrDefault`` renverra 0.0 si elle ne peut pas obtenir les valeurs d'entrée. Le ``getDefaultValue`` renverra un nouvel objet ``MyPoint2D`` si aucune source n'est présente.

source: In this example, we will create a custom data type for a 2D Point and its x and y coordinates. In order to create a custom data type class, it must extend the abstract class `ComplexData <https://github.com/wpilibsuite/shuffleboard/blob/master/api/src/main/java/edu/wpi/first/shuffleboard/api/data/ComplexData.java>`_. Your custom data class must also implement the ``asMap()`` method that returns the represented data as a simple map as noted below with the ``@Override`` annotation:
tr_tr: Bu örnekte, bir 2B Nokta ve onun x ve y koordinatları için özel bir veri türü oluşturacağız. Özel bir veri türü sınıfı oluşturmak için,`ComplexData <https://github.com/wpilibsuite/shuffleboard/blob/master/api/src/main/java/edu/wpi/first/shuffleboard/api/data/ComplexData.java>`_ soyut sınıfını genişletmesi gerekir. Özel veri sınıfınız, aşağıda ``@ Override`` ek açıklamasıyla belirtildiği gibi temsil edilen verileri basit bir harita olarak döndüren ``asMap()`` methodu de uygulamalıdır:
