Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/custom-widgets/custom-themes.po
Languages: tr_tr

source: Custom Themes
tr_tr: Özel Temalar

source: Since shuffleboard is a JavaFX application, it has support for custom themes via Cascading Stylesheets (**CSS** for short). These are commonly used on webpages for making HTML look nice, but JavaFX also has ,support, albeit for a different language subset (see `here <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/doc-files/cssref.html>`_ for documentation on how to use it).
tr_tr: Shuffleboard bir JavaFX uygulaması olduğundan, Basamaklı Stil Sayfaları (kısaca ** CSS **) aracılığıyla özel temaları destekler. Bunlar, HTML'nin güzel görünmesini sağlamak için web sayfalarında yaygın olarak kullanılır, ancak JavaFX, farklı bir dil alt kümesini de desteklemektedir (nasıl kullanılacağına ilişkin belgeler için `burada <https://openjfx.io/javadoc/11/javafx.graphics/javafx/scene/doc-files/cssref.html>`_ bakın).

source: Shuffleboard comes with three themes by default: Material Light, Material Dark, and Midnight. These are color variations on the same material design stylesheet. In addition, they inherit from a ``base.css`` stylesheet that defines styles for the custom components ,defined in shuffleboard or libraries that it uses; the base material design stylesheet only applies to the UI components built into JavaFX.
tr_tr: Shuffleboard varsayılan olarak üç temayla gelir : Material Light, Material Dark ve Midnight. Bunlar, aynı malzeme tasarım stil sayfasındaki renk varyasyonlarıdır. Ayrıca, shuffleboard veya kullandıkları kitaplıklarda tanımlanan özel bileşenler için stilleri tanımlayan bir ``base.css`` stil sayfasından miras alırlar; temel malzeme tasarım stil sayfası yalnızca JavaFX'te yerleşik olan UI bileşenleri için geçerlidir.

source: All the stylesheets in the directory will be treated as part of the theme.
tr_tr: Dizindeki tüm stil sayfaları temanın bir parçası olarak ele alınacaktır.

source: Loading Themes via Plugins
tr_tr: Eklentiler aracılığıyla Tema Yükleme

source: Custom themes can also be defined by plugins. This makes them easier to share and bundle with custom widgets, but are slightly more difficult to define. The theme object will need a reference to a class defined in the plugin so that the plugin loader can determine where the stylesheets are located. If a class is passed that is *not* present in the JAR that the plugin is in, the theme will not be able to be used.
tr_tr: Özel temalar, eklentiler tarafından da tanımlanabilir. Bu, özel widget'larla paylaşılmasını ve paketlenmesini kolaylaştırır, ancak tanımlamaları biraz daha zordur. Eklenti yükleyicinin stil sayfalarının nerede bulunduğunu belirleyebilmesi için tema nesnesinin, eklentide tanımlanan bir sınıfa referans olması gerekir. Eklentinin içinde bulunduğu JAR'da * olmayan * bir sınıf geçirilirse, tema kullanılamayacaktır.

source: Modifying or Extending Shuffleboard’s Default Themes
tr_tr: Shuffleboard’un Varsayılan Temalarını Değiştirme veya Genişletme

source: Shuffleboard’s Material Light and Material Dark themes provide a lot of the framework for light and dark themes, respectively, as well as many styles specific to shuffleboard, ControlsFX, and Medusa UI components to fit with the material-style design.
tr_tr: Shuffleboard’un Material Light ve Material Dark temaları, sırasıyla açık ve koyu temalar için çok sayıda çerçeve ve malzeme tarzı tasarıma uyacak şekilde disk iteleme panosu, ControlsFX ve Medusa UI bileşenlerine özgü birçok stil sağlar.

source: Themes that want to modify these themes need to add ``import`` statements for these stylesheets:
tr_tr: Bu temaları değiştirmek isteyen temaların, şu stil sayfaları için ``import-içe aktarma`` ifadeleri eklemesi gerekir:

source: Note that ``base.css`` internally imports ``material.css``, and ``light.css``, ``dark.css``, and ``midnight.css`` all import ``base.css``, so importing ``light.css`` will implicitly import both ``base.css`` and ``material.css`` as well.
tr_tr: ``base.css`` nin dahili olarak ``material.css`` ve ``light.css``, ``dark.css`` ve ``midnight.css``dosyalarını içe aktardığına dikkat edin , yani ``light.css``dosyasını içe aktarmak, hem ``base.css`` hem de ``material.css`` yi dolaylı olarak içe aktaracaktır.

source: Source Code for the CSS Files
tr_tr: CSS Dosyaları için Kaynak Kodu

source: Material Design Color Swatches
tr_tr: Materyal Tasarımı Renk Örnekleri

source: The material design CSS uses color swatch variables for almost everything. These variables can be set from custom CSS files, reducing the amount of custom code needed.
tr_tr: Materyal tasarım CSS'si neredeyse her şey için renk örneği değişkenlerini kullanır. Bu değişkenler, ihtiyaç duyulan özel kod miktarını azaltacak şekilde özel CSS dosyalarından ayarlanabilir.

source: The ``-swatch-<100|200|300|400|500>`` variables define progressively darker shades of the same primary color. The light theme uses the default shades of blue set in ``material.css``, but the dark theme overrides these with shades of red. ``-swatch-<|light|dark>-gray`` defines three levels of gray to use for various background or text colors.
tr_tr: "-swatch- <100|200|300|400|500>`` değişkenleri, aynı ana rengin giderek daha koyu tonlarını tanımlar. Açık tema, ``material.css`` içindeki varsayılan mavi tonlarını kullanır, ancak koyu tema bunları kırmızı tonlarıyla geçersiz kılar. ``-swatch- <|light|dark> -gray``, çeşitli arka plan veya metin renkleri için kullanılacak üç gri düzeyini tanımlar.

source: Overriding the Swatch Colors
tr_tr: Renk Örneği Renklerini Geçersiz Kılma

source: Replacing blue with red (light)
tr_tr: Mavinin kırmızı ile değiştirilmesi (light-hafif)

source: Replacing red with blue (dark)
tr_tr: Kırmızıyı maviyle (dark-koyu) değiştirme
