Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/custom-widgets/widget-types.po
Languages: es_mx, tr_tr

source: Widget Types
es_mx: Tipos de Widget
tr_tr: Widget Türleri

source: While ``Widget`` is pretty straightforward as far as the interface is concerned, there are several intermediate implementations to make it easier to define the widget.
es_mx: Mientras ``Widget`` es bastante sencillo en lo que respecta a la interfaz, hay varias implementaciones intermedias para facilitar definir el widget.
tr_tr: Arayüz söz konusu olduğunda ``Widget`` oldukça basit olsa da, widget'ı tanımlamayı kolaylaştırmak için birkaç ara uygulama vardır.

source: Class
es_mx: Clase
tr_tr: Sınıf

source: Description
es_mx: Descripción
tr_tr: Açıklama

source: Implements ``getProperties()``, ``getSources()``, and ``titleProperty()``
es_mx: Implementos ``getProperties()``, ``getSources()``, y ``titleProperty()``
tr_tr: ``getProperties()``, ``getSources()`` ve ``titleProperty()`` uygulamaları

source: Adds properties for widgets that only support a single data type
es_mx: Agrega propiedades para widgets que solo admiten un único tipo de datos
tr_tr: Yalnızca tek bir veri türünü destekleyen widget'lar için özellikler ekler.

source: Adds default implementations for ``getName()`` and ``getDataTypes()`` for widgets with a ``@Description`` annotation
es_mx: Agrega implementaciones predeterminadas para ``getName()`` y ``getDataTypes()`` para widgets con una anotación ``@Description``
tr_tr: ``@Description`` ek açıklamasına sahip widget'lar için ``getName()`` ve ``getDataTypes()`` için varsayılan uygulamaları ekler.

source: For widgets with only a single source (by default, widgets support multiple sources)
es_mx: Para widgets con una sola fuente (de forma predeterminada, los widgets admiten múltiples fuentes)
tr_tr: Yalnızca tek bir kaynağı olan widget'lar için (varsayılan olarak, widget'lar birden çok kaynağı destekler)

source: Combines ``SingleTypeWidget<T>``, ``AnnotatedWidget``, and ``SingleSourceWidget``
es_mx: Combina ``SingleTypeWidget<T>``, ``AnnotatedWidget``, y ``SingleSourceWidget``
tr_tr: ``SingleTypeWidget1``, ``AnnotatedWidget``, ve ``SingleSourceWidget`` i birleştirir

source: There are also two annotations to help define widgets:
es_mx: También hay dos anotaciones para ayudar a definir los widgets:
tr_tr: Widget'ları tanımlamaya yardımcı olacak iki ek açıklama da vardır:

source: Name
es_mx: Nombre
tr_tr: İsim

source: Allows widgets to be FXML controllers for JavaFX views defined via FXML
es_mx: Permite que los widgets sean controladores FXML para vistas JavaFX definidas a través de FXML
tr_tr: Widget'ların FXML ile tanımlanan JavaFX görünümleri için FXML denetleyicileri olmasına izin verir.

source: Lets the name and supported data types be defined in a single line
es_mx: Permite definir el nombre y los tipos de datos admitidos en una sola línea.
tr_tr: Adın ve desteklenen veri türlerinin tek bir satırda tanımlanmasını sağlar.

source: This class implements ``getProperties()``, ``getSources()``, ``addSource()``, and ``titleProperty()``. It also defines a method ``exportProperties(Property<?>...)`` method so subclasses can easy add custom widget properties, or properties for the JavaFX components in the widget. Most of the `widgets in the base plugin <https://github.com/wpilibsuite/shuffleboard/tree/main/plugins/base/src/main/java/edu/wpi/first/shuffleboard/plugin/base/widget>`_ use this.
es_mx: Esta clase implementa ``getProperties()``, ``getSources()``, ``addSource()``, y ``titleProperty()``. También define un método ``exportProperties(Property<?>...)`` para que las subclases puedan añadir fácilmente propiedades personalizadas al widget, o propiedades para los componentes JavaFX en el widget. La mayoría de los `widgets en la base plugin <https://github.com/wpilibsuite/shuffleboard/tree/main/plugins/base/src/main/java/edu/wpi/first/shuffleboard/plugin/base/widget>`_ usan esto.
tr_tr: Bu sınıf, ``getProperties()``, ``getSources()``, ``addSource()``, ve ``titleProperty()`` uygular. Ayrıca, alt sınıfların özel pencere öğesi özelliklerini veya pencere aracındaki JavaFX bileşenleri için özellikleri kolayca ekleyebilmesi için ``exportProperties (Özellik <?> ...)``metodunu da tanımlar. Temel eklenti `<https://github.com/wpilibsuite/shuffleboard/tree/main/plugins/base/src/main/java/edu/wpi/first/shuffleboard/plugin/base/widget>'daki widget'ların çoğu bunu kullanıyor.

source: A type of widget that only supports a single data type. This interface is parametrized and has methods for setting or getting the data, as well as a method for getting the (single) data type of the widget.
es_mx: Un tipo de widget que solo admite un tipo de datos. Esta interfaz está parametrizada y tiene métodos para configurar u obtener los datos, así como un método para obtener el tipo de datos (único) del widget.
tr_tr: Yalnızca tek bir veri türünü destekleyen bir tür widget. Bu arayüz parametreleştirilmiştir ve verileri ayarlamak veya almak için sahip olduğu yöntemlerin yanı sıra, widget'ın (tek) veri türünü almak için de bir yönteme sahiptir.

source: This interface implements ``getDataTypes()`` and ``getName()`` by looking at the the ``@Description`` annotation on the implementing class. This *requires* the annotation to be present, or the widget will not be able to be loaded and used.
es_mx: Esta interfaz implementa ``getDataTypes()`` y ``getName()`` al ver la anotación ``@Description`` en la clase de implementación. Esto *requiere* que la anotación esté presente, o el widget no podrá cargarse ni utilizarse.
tr_tr: Bu arayüz, uygulama sınıfındaki ``@Description`` ek açıklamasına bakarak ``getDataTypes()`` ve ``getName()`` uygular. Bu, ek açıklamanın mevcut olmasını *gerektirir*, aksi takdirde widget yüklenemez ve kullanılamaz.

source: A type of widget that only uses a single source.
es_mx: Un tipo de widget que solo utiliza una fuente.
tr_tr: Yalnızca tek bir kaynak kullanan bir tür widget.

source: A combination of ``SingleTypeWidget<T>``, ``AnnotatedWidget``, and ``SingleSourceWidget``. Most widgets in the base plugin extend from this class. This also has a ``protected`` field called ``dataOrDefault`` that lets subclasses use a default data value if the widget doesn’t have a source, or if the source is providing ``null``.
es_mx: Una combinación de `` SingleTypeWidget <T>``, `` AnnotatedWidget '' y `` SingleSourceWidget ''. La mayoría de los widgets del complemento base se extienden desde esta clase. Esto también tiene un campo ``protegido'' llamado ``dataOrDefault`` que permite que las subclases usen un valor de datos predeterminado si el widget no tiene una fuente, o si la fuente proporciona ``nulo``.
tr_tr: ``SingleTypeWidget1``, ``AnnotatedWidget``, ve ``SingleSourceWidget`` kombinasyonu. Temel eklentideki çoğu widget bu sınıftan ortaya çıkar. Bu ayrıca, widget'ın bir kaynağı yoksa veya kaynak ``null`` sağlıyorsa, alt sınıfların varsayılan bir veri değeri kullanmasına izin veren ``dataOrDefault`` adlı bir ``protected -korumalı`` alana sahiptir.

source: This annotation can be placed on a widget class to let shuffleboard know that it’s an FXML controller for a JavaFX view defined via FXML. The annotation takes a single parameter that defines where the FXML file *in relation to the class on which it is placed*. For example, a widget in the directory ``src/main/java/com/acme`` that is an FXML controller for a FXML file in ``src/main/resources/com/acme`` can use the annotation as either
es_mx: Esta anotación se puede colocar en una clase de widget para que permita a shuffleboard saber que es un controlador FXML para una vista JavaFX definida a través de FXML. La anotación toma un único parámetro que define dónde se encuentra el archivo FXML *en relación con la clase en la que se coloca*. Por ejemplo, un widget en el directorio ``src/main/java/com/acme`` que es un controlador FXML para un archivo FXML en ``src/main/resources/com/acme`` puede usar la anotación como
tr_tr: Bu açıklama, shuffleboard'un FXML aracılığıyla tanımlanan bir JavaFX görünümü için, bir FXML denetleyicisi olduğunu bilmesini sağlamak için bir widget sınıfına yerleştirilebilir. Açıklama, FXML dosyasının *yerleştirildiği sınıfa göre* nerede olduğunu tanımlayan tek bir parametre alır. Örneğin, ``src/main/java/com/acme`` dizinindeki, ``src/main/resources/com/acme`` içindeki bir FXML dosyası için bir FXML denetleyicisi olan bir widget, ek açıklamayı şu şekilde kullanabilir

source: or as
es_mx: o como
tr_tr: veya

source: This allows widgets to have their name and supported data types defined by a single annotation, when used alongside `AnnotatedWidget`_.
es_mx: Esto permite que los widgets tengan su nombre y los tipos de datos admitidos definidos por una sola anotación, cuando se utilizan junto con `AnnotatedWidget`_.
tr_tr: Bu, widget'ların adlarının ve desteklenen veri türlerinin, `AnnotatedWidget`_ ile birlikte kullanıldığında tek bir ek açıklama ile tanımlanmasını sağlar.
