Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/dashboards/elastic.po
Languages: es_mx

source: Elastic is a simple and modern dashboard made by Team 353. It is meant to be used behind the glass as a competition driver dashboard, but it can also be used for testing. It was built with the goal of being a drag & drop dashboard with an easy setup and elegant UI designed for a high pressure competition environment.
es_mx: Elastic es una dashboard simple y moderna, creada por el equipo 353. Esta pensado para ser utilizado como una dashboard para la competición, pero también se puede utilizar para pruebas. Se construyo con el objetivo de ser una dashboard de arrastrar y soltar, con una configuración sencilla y una interfaz de usuario elegante, diseñada para un entorno de competencia de alta presión.

source: In Visual Studio Code, press :kbd:`Ctrl+Shift+P` and type ``WPILib`` or click the WPILib logo in the top right to launch the WPILib Command Palette. Select :guilabel:`Start Tool`, then select :guilabel:`Elastic`.
es_mx: En Visual Studio Code, presione :kbd:`Ctrl+Shift+P` y escriba ``WPILib``o haga clic en el logotipo de WPILib en la parte superior derecha para iniciar la paleta de comandos de WPILib. Seleccione :guilabel:`Start Tool`, luego seleccione :guilabel:`Elastic`.

source: Detailed documentation for Elastic can be found `here <https://frc-elastic.gitbook.io/docs>`__.
es_mx: Documentación detallada para Elastic puede ser encontrada `aquí <https://frc-elastic.gitbook.io/docs>`__.

source: The capabilities of Elastic include:
es_mx: Las capacidades de Elastic incluyen:

source: Viewing data from different NT4 topics and widgets
es_mx: Ver datos de diferentes NT4 topics y widgets

source: Draggable and resizable card widgets
es_mx: Widgets de tarjetas arrastrables y redimensionadles

source: Customizable color scheme with over 20 variants
es_mx: Esquema de colores personalizable con más de 20 variantes

source: Optimized camera streams which automatically deactivate when not in use
es_mx: Stream de cámara optimizado que se desactiva automáticamente cuando no se este utilizando

source: Automatic IP retrieval from the FRC Driver Station
es_mx: Obtención automática de la dirección IP desde la Driver Station de FRC

source: Screenshot of an Elastic showing field trajectory, match time, and several other widgets
es_mx: Foto de Elastic mostrando una trayectoria de la cancha, tiempo del match, y muchos otros widgets
