Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/sensors/accelerometers-software.po
Languages: es_mx, tr_tr, zh_cn

source: Accelerometers - Software
es_mx: Acelerómetros-Software
tr_tr: İvmeölçerler-Accelerometers - Yazılım
zh_cn: 加速度计-软件

source: This section covers accelerometers in software. For a hardware guide to accelerometers, see :ref:`docs/hardware/sensors/accelerometers-hardware:Accelerometers - Hardware`.
es_mx: Esta sección cubre los acelerómetros en el software. Para obtener una guía de hardware para acelerómetros, consulte :ref:`docs/hardware/sensors/accelerometers-hardware:Accelerometers - Hardware`.
tr_tr: Bu bölüm yazılımdaki ivmeölçerleri kapsar. İvmeölçerlerle ilgili bir donanım kılavuzu için bkz :ref:`docs/hardware/sensors/accelerometers-hardware:Accelerometers - Hardware`.
zh_cn: 本节涵盖软件中的加速度计。有关加速度计的硬件指南，请参阅：:ref:`docs/hardware/sensors/accelerometers-hardware:Accelerometers - Hardware`.

source: An accelerometer is a device that measures acceleration.
es_mx: Un acelerómetro es un dispositivo que mide la aceleración.
tr_tr: İvme ölçer, ivmeyi ölçen bir cihazdır.
zh_cn: 加速度计是一种测量加速度的设备。

source: Accelerometers generally come in two types: single-axis and 3-axis. A single-axis accelerometer measures acceleration along one spatial dimension; a 3-axis accelerometer measures acceleration along all three spatial dimensions at once.
es_mx: Los acelerómetros generalmente vienen en dos tipos: eje único y eje 3. Un acelerómetro de un solo eje mide la aceleración a lo largo de una dimensión espacial; un acelerómetro de 3 ejes mide aceleración a lo largo de las tres dimensiones espaciales a la vez.
tr_tr: İvmeölçerler genellikle iki tiptedir: tek eksenli ve 3 eksenli. Tek eksenli ivmeölçer, tek bir uzaysal boyut boyunca ivmeyi ölçer; 3 eksenli ivmeölçer, aynı anda üç uzamsal boyut boyunca ivmeyi ölçer.
zh_cn: 加速度计通常分为两种：单轴和三轴。单轴加速度计可测量一个空间维度上的加速度； 3轴加速度计可一次测量沿所有三个空间维度的加速度。

source: WPILib supports single-axis accelerometers through the `AnalogAccelerometer`_ class.
es_mx: WPILib admite acelerómetros de eje único a través de la clase `AnalogAccelerometer`_.
tr_tr: WPILib, `AnalogAccelerometer` sınıfı aracılığıyla tek eksenli ivmeölçerleri destekler.
zh_cn: WPILib通过`AnalogAccelerometer`_类支持单轴加速度计。

source: Three-axis accelerometers often require more complicated communications protocols (such as SPI or I2C) in order to send multi-dimensional data. WPILib has native support for the following 3-axis accelerometers:
es_mx: Los acelerómetros de tres ejes a menudo requieren protocolos de comunicación más complicados (como SPI o I2C) para enviar datos multidimensionales. WPILib tiene soporte nativo para los siguientes acelerómetros de 3 ejes:
tr_tr: Üç eksenli ivmeölçerler, çok boyutlu verileri göndermek için genellikle daha karmaşık iletişim protokolleri (SPI veya I2C gibi) gerektirir. WPILib, aşağıdaki 3 eksenli ivmeölçerler için yerel desteğe sahiptir:
zh_cn: 3轴加速度计通常需要更复杂的通信协议（例如SPI或I2C）才能发送多维数据。 WPILib对以下3轴加速度计具有本机支持：

source: `BuiltInAccelerometer`_
zh_cn: `内置加速度计`_

source: AnalogAccelerometer
zh_cn: 模拟加速度计

source: The :code:`AnalogAccelerometer` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogAccelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogAccelerometer.html>`__) allows users to read values from a single-axis accelerometer that is connected to one of the roboRIO's analog inputs.
es_mx: La clase :code:`AnalogAccelerometer` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogAccelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogAccelerometer.html>`__) permite a los usuarios leer los valores de un acelerómetro de un eje que está conectado a una de las entradas analógicas del roboRIO.
tr_tr: :code:`AnalogAccelerometer` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogAccelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogAccelerometer.html>`__), kullanıcıların roboRIO'nun analog girişlerinden birine bağlı tek eksenli bir ivmeölçerden değerleri okumasına olanak tanır.
zh_cn: AnalogAccelerometer类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogAccelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogAccelerometer.html>`__）允许用户从连接到roboRIO的模拟输入端的单轴加速度计读取值。

source: If users have a 3-axis analog accelerometer, they can use three instances of this class, one for each axis.
es_mx: Si los usuarios cuentan cuentan con un acelerómetro de 3 ejes, se pueden usar tres instancias de esta clase, una para cada eje.
tr_tr: Kullanıcıların 3 eksenli bir analog ivmeölçeri varsa, her eksen için bir tane olmak üzere bu sınıfın üç örneğini kullanabilirler.
zh_cn: 如果用户使用3轴模拟加速度计，则可以使用三个此类的实例，每个实例一个读取一个轴。

source: The Accelerometer interface
es_mx: Interfaz del acelerómetro
tr_tr: Accelerometer Arayüzü
zh_cn: 加速度计接口

source: All 3-axis accelerometers in WPILib implement the :code:`Accelerometer` interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/interfaces/Accelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Accelerometer.html>`__). This interface defines functionality and settings common to all supported 3-axis accelerometers.
es_mx: Todos los acelerómetros de 3 ejes en WPILib implementan la interfaz :code:`Accelerometer` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/interfaces/Accelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Accelerometer.html>`__). Esta interfaz define la funcionalidad y la configuración común a todos los acelerómetros de 3 ejes soportados.
tr_tr: Tüm 3-axis ivmeölçerler WPILib implement the :code:`Accelerometer` interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/interfaces/Accelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Accelerometer.html>`__). uygular. Bu arayüz, desteklenen tüm 3-axis ivmeölçerler için ortak olan işlevselliği ve ayarları tanımlar.
zh_cn: WPILib中的所有3轴加速度计均实现Accelerometer接口（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/interfaces/Accelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Accelerometer.html>`__）。该接口定义了所有受支持的三轴加速度计常用的功能和设置。

source: The :code:`Accelerometer` interface contains getters for the acceleration along each cardinal direction (x, y, and z), as well as a setter for the range of accelerations the accelerometer will measure.
es_mx: La interfaz :code:`Accelerometer` contiene captadores para la aceleración a lo largo de cada dirección cardinal (x, y, y z), así como un setter para el rango de aceleraciones que medirá el acelerómetro.
tr_tr: :code:`Accelerometer` arayüzü, her bir ana yön (x, y ve z) boyunca hızlanma için alıcılar ve ivmeölçerin ölçeceği hızlanma aralığı için bir ayarlayıcı içerir.
zh_cn: Accelerometer接口可以用于获取沿每个基本方向（x，y和z）的加速度，以及设定加速度计的测量范围。

source: Not all accelerometers are capable of measuring all ranges.
es_mx: No todos los acelerómetros son capaces de medir todos los rangos.
tr_tr: Tüm ivmeölçerler tüm aralıkları ölçemez.
zh_cn: 并非所有的加速度计都能测量全部范围。

source: The :code:`ADXL345_I2C` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL345_I2C.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL345__I2C.html>`__) provides support for the ADXL345 accelerometer over the I2C communications bus.
es_mx: La clase :code:`ADXL345_I2C` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL345_I2C.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL345__I2C.html>`__) proporciona soporte para el acelerómetro ADXL345 sobre el bus de comunicaciones I2C.
tr_tr: :code:`ADXL345_I2C` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL345_I2C.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL345__I2C.html>`__), I2C iletişim veri yolu üzerinden ADXL345 ivmeölçer için destek sağlar.
zh_cn: ADXL345_I2C类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL345_I2C.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL345__I2C.html>`__）提供了ADXL345加速度计接入I2C通信总线的支持。

source: The :code:`ADXL345_SPI` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL345_SPI.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL345__SPI.html>`__) provides support for the ADXL345 accelerometer over the SPI communications bus.
es_mx: La clase :code:`ADXL345_SPI` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL345_SPI.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL345__SPI.html>`__) proporciona soporte para el acelerómetro ADXL345 sobre el bus de comunicaciones SPI.
tr_tr: :code:`ADXL345_SPI` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL345_SPI.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL345__SPI.html>`__), SPI iletişim veri yolu üzerinden ADXL345 ivmeölçer için destek sağlar.
zh_cn: ADXL345_SPI类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL345_SPI.html>`__，C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL345__SPI.html>`__）通过SPI通信总线为ADXL345加速度计提供支持。

source: The :code:`ADXL362` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL362.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL362.html>`__) provides support for the ADXL362 accelerometer over the SPI communications bus.
es_mx: La clase :code:`ADXL362` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL362.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL362.html>`__) proporciona soporte para el acelerómetro ADXL362 sobre el bus de comunicaciones SPI.
tr_tr: :code:`ADXL362` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL362.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL362.html>`__), SPI iletişim veri yolu üzerinden ADXL362 ivmeölçer için destek sağlar.
zh_cn: ADXL362类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXL362.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXL362.html>`__）提供了ADXL362加速度计接入SPI通信总线的支持。

source: BuiltInAccelerometer
zh_cn: 内置加速度计

source: The :code:`BuiltInAccelerometer` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/BuiltInAccelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1BuiltInAccelerometer.html>`__) provides access to the roboRIO's own built-in accelerometer:
es_mx: La clase :code:`BuiltInAccelerometer` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/BuiltInAccelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1BuiltInAccelerometer.html>`__) proporciona acceso al acelerómetro propio del roboRIO:
tr_tr: :code:`BuiltInAccelerometer` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/BuiltInAccelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1BuiltInAccelerometer.html>`__) roboRIO'nun kendi dahili ivmeölçerine erişim sağlar:
zh_cn: 该BuiltInAccelerometer类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/BuiltInAccelerometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1BuiltInAccelerometer.html>`__），可以访问roboRIO自身内置的加速度计：

source: Third-party accelerometers
es_mx: Acelerómetros de terceros
tr_tr: Üçüncü-parti accelerometers
zh_cn: 第三方加速度计

source: While WPILib provides native support for a number of accelerometers that are available in the kit of parts or through FIRST Choice, there are a few popular AHRS (Attitude and Heading Reference System) devices commonly used in FRC that include accelerometers. These are generally controlled through vendor libraries, though if they have a simple analog output they can be used with the `AnalogAccelerometer`_ class.
es_mx: Así como WPILib provee soporte nativo para un numero de acelerómetros disponibles en el kit of parts o por medio de FIRST Choice, hay también dispositivos menos populares AHRS (Attitude and Heading Reference System) los cuales son comúnmente usados en FRC e incluyen acelerómetros. Estos son controlados generalmente mediante un vendor de libraries, aunque si tienen una entrada análoga sencilla, se pueden usar con la clase `AnalogAccelerometer`_.
tr_tr: WPILib, parça setinde veya FIRST Choice aracılığıyla bulunan bir dizi ivmeölçer için yerel destek sağlarken, FRC'de yaygın olarak kullanılan ve ivmeölçerler içeren birkaç popüler AHRS (Davranış-Attitude ve Heading-Yön Referans Sistemi) cihazı vardır. Bunlar genellikle üretici kitaplıkları aracılığıyla kontrol edilir, ancak basit bir analog çıkışa sahiplerse `AnalogAccelerometer`_ sınıfıyla kullanılabilirler.
zh_cn: 虽然WPILib为零件套件中或通过FIRST Choice提供的许多加速度计提供了本地支持，但FRC中普遍使用了一些流行的AHRS（姿态航向参考系统）设备，其中包括加速度计。他们通常通过供应商库进行控制，如果它们具有简单的模拟输出，则可以与AnalogAccelerometer类一起使用。

source: Using accelerometers in code
es_mx: Usar acelerómetros en código
tr_tr: İvmeölçeri kodda kullanma
zh_cn: 在代码中使用加速度计

source: Accelerometers, as their name suggests, measure acceleration. Precise accelerometers can be used to determine position through double-integration (since acceleration is the second derivative of position), much in the way that gyroscopes are used to determine heading. However, the accelerometers available for use in FRC are not nearly high-enough quality to be used this way.
es_mx: Los acelerómetros, como su nombre lo dice, miden la aceleración. Acelerómetros precisos pueden ser útiles para determinar posiciones a través de la doble integración (desde que la aceleración es la segunda derivada de la posición), de manera similar que los giroscopios son usados para determinar la dirección. Sin embargo, los acelerómetros disponibles para usar en FRC no son de la calidad suficiente para usarse de este modo.
tr_tr: İvmeölçerler, adından da anlaşılacağı gibi ivmeyi ölçer. Hassas ivmeölçerler, yönü belirlemek için jiroskopların kullanıldığı gibi, çift entegrasyon yoluyla (ivme konumun ikinci türevi olduğundan) konumu belirlemek için kullanılabilir. Ancak, FRC'de kullanım için mevcut olan ivmeölçerler, bu şekilde kullanılmak için neredeyse yeterince yüksek kalitede değildir.
zh_cn: 加速度计，顾名思义，可以测量加速度。精确的加速度计可用于通过两次积分确定位置（因为加速度是位置的二阶导数），这在很大程度上是使用陀螺仪确定航向的方式。但是，可用于FRC的加速度计并不支持这种方式。

source: It is recommended to use accelerometers in FRC\ |reg| for any application which needs a rough measurement of the current acceleration. This can include detecting collisions with other robots or field elements, so that vulnerable mechanisms can be automatically retracted. They may also be used to determine when the robot is passing over rough terrain for an autonomous routine (such as traversing the defenses in FIRST Stronghold).
es_mx: Se recomienda utilizar acelerómetros en FRC\ |reg| para cualquier aplicación que necesite una medición aproximada de la aceleración actual. Esto puede incluir la detección de colisiones con otros robots o elementos de campo, de modo que los mecanismos vulnerables se puedan retraer automáticamente. También se pueden usar para determinar cuándo el robot pasa por un terreno accidentado para una rutina autónoma (como atravesar las defensas en FIRST Stronghold).
tr_tr: FRC \ |reg| içinde ivmeölçer kullanılması önerilir. Akım ivmesinin kabaca ölçülmesini gerektiren herhangi bir uygulama için. Bu, diğer robotlar veya alan unsurları ile çarpışmaların tespit edilmesini içerebilir, böylece savunmasız mekanizmalar otomatik olarak geri çekilebilir. Ayrıca, robotun otonom bir rutin için engebeli araziden ne zaman geçtiğini belirlemek için de kullanılabilir (FIRST Stronghold'deki savunmaları geçmek gibi).
zh_cn: 建议在FRC中使用加速度计，来应对需要粗略测量当前加速度的任何情况。这可以包括检测与其他机器人或现场物体的碰撞，以便可以自动收回脆弱的机械装置。它们还可用于确定机器人何时在自动阶段中越过崎岖的地形（例如穿过FIRST Stronghold中的防御）。

source: For detecting collisions, it is often more robust to measure the jerk than the acceleration. The jerk is the derivative (or rate of change) of acceleration, and indicates how rapidly the forces on the robot are changing - the sudden impulse from a collision causes a sharp spike in the jerk. Jerk can be determined by simply taking the difference of subsequent acceleration measurements, and dividing by the time between them:
es_mx: Para detectar colisiones, a menudo es más robusto medir la sobreaceleración que la aceleración. La sobreaceleración es la derivada (o la tasa de cambio) de la aceleración e indica la rapidez con la que cambian las fuerzas sobre el robot: el impulso repentino de una colisión provoca un pico agudo en la sacudida. La sobreaceleración se puede determinar simplemente tomando la diferencia de las mediciones de aceleración posteriores y dividiéndolas por el tiempo entre ellas:
tr_tr: Çarpışmaları tespit etmek için, sarsıntıyı ölçmek genellikle hızlanmadan daha sağlamdır. Sarsıntı, hızlanmanın türevidir (veya değişim oranıdır) ve robot üzerindeki kuvvetlerin ne kadar hızlı değiştiğini gösterir - çarpışmadan kaynaklanan ani itme, sarsıntıda keskin bir artışa neden olur. Sarsıntı, sadece sonraki ivme ölçümlerinin farkını alarak ve bunlar arasındaki zamana bölerek belirlenebilir:
zh_cn: 为了检测碰撞，测量加加速度比检测加速度通常要更可靠。加加速度是加速度的导数（或变化率），它表示机器人上的力变化的速度有多快-碰撞的突然冲击会导致加加速度的急剧变化。可以通过简单地获取后续加速度测量值的差，然后除以它们之间的时间来确定加加速度：

source: Most accelerometers legal for FRC use are quite noisy, and it is often a good idea to combine them with the :code:`LinearFilter` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/filters/LinearDigitalFilter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1LinearDigitalFilter.html>`__) to reduce the noise:
es_mx: La mayoría de los acelerómetros legales para el uso de FRC son bastante ruidosos, y a menudo es una buena idea combinarlos con la clase :code:`LinearFilter` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/filters/LinearDigitalFilter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1LinearDigitalFilter.html>`__) para reducir el ruido:
tr_tr: FRC kullanımı için yasal olan çoğu ivmeölçer oldukça gürültülüdür ve gürültüyü azaltmak için bunları aşağıdaki kodla birleştirmek genellikle iyi bir fikirdir :code:`LinearFilter` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/filters/LinearDigitalFilter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1LinearDigitalFilter.html>`__):
zh_cn: 大多数适用于FRC的合法加速度计都会产生很多噪声数据，将它们与LinearFilter类(`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/filters/LinearDigitalFilter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1LinearDigitalFilter.html>`__) 组合以减少噪声通常是一个好主意：
