Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/sensors/analog-potentiometers-software.po
Languages: tr_tr, zh_cn

source: Analog Potentiometers - Software
tr_tr: Analog Potentiometers - Yazılım
zh_cn: 模拟电位器-软件

source: This section covers analog potentiometers in software. For a hardware guide to analog potentiometers, see :ref:`docs/hardware/sensors/analog-potentiometers-hardware:Analog Potentiometers - Hardware`.
tr_tr: Bu bölüm, yazılımdaki analog potansiyometreleri kapsar. Analog potansiyometreler için bir donanım kılavuzu için bkz :ref:`docs/hardware/sensors/analog-potentiometers-hardware:Analog Potentiometers - Hardware`.
zh_cn: 本节涵盖软件中的模拟电位计。有关模拟电位器的硬件指南，请参阅:ref:`docs/hardware/sensors/analog-potentiometers-hardware:Analog Potentiometers - Hardware`。

source: Potentiometers are variable resistors that allow information about position to be converted into an analog voltage signal. This signal can be read by the roboRIO to control whatever device is attached to the potentiometer.
tr_tr: Potansiyometreler, konum hakkındaki bilgilerin analog voltaj sinyaline dönüştürülmesini sağlayan değişken dirençlerdir. Bu sinyal, potansiyometreye bağlı olan cihazı kontrol etmek için roboRIO tarafından okunabilir.
zh_cn: 电位计是可变电阻器，可将有关位置的信息转换为模拟电压信号。roboRIO可以读取此信号，以控制电位计上连接的任何设备。

source: While it is possible to read information from a potentiometer directly with an :doc:`analog-inputs-software`, WPILib provides an :code:`AnalogPotentiometer` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogPotentiometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogPotentiometer.html>`__) that handles re-scaling the values into meaningful units for the user. It is strongly encouraged to use this class.
tr_tr: Bir potansiyometreden bilgileri doğrudan bir :doc:`analog-inputs-software` ile okumak mümkün olsa da, WPILib bir :code:`AnalogPotentiometer` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogPotentiometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogPotentiometer.html>`__) Değerlerin kullanıcı için anlamlı birimlere yeniden ölçeklendirilmesini sağlayan bu sınıfı kullanmanız şiddetle tavsiye edilir.
zh_cn: 虽然可以使用模拟输入软件直接从电位计读取信息，但是WPILib提供了一个AnalogPotentiometer类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogPotentiometer.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogPotentiometer.html>`__），该类可以将值重新缩放为对用户有意义的单位。强烈建议您使用此类。

source: In fact, the :code:`AnalogPotentiometer` name is something of a misnomer - this class should be used for the vast majority of sensors that return their signal as a simple, linearly-scaled analog voltage.
tr_tr: Aslında :code:`AnalogPotentiometer` adı yanlış bir isimdir - bu sınıf, sinyallerini basit, doğrusal ölçeklendirilmiş bir analog voltaj olarak döndüren sensörlerin büyük çoğunluğu için kullanılmalıdır.
zh_cn: 实际上，这个AnalogPotentiometer名称用词不当-这类传感器应用于绝大多数以简单的线性比例模拟电压返回信号的传感器。

source: The AnalogPotentiometer class
tr_tr: AnalogPotentiometer class-sınıfı
zh_cn: AnalogPotentiometer 类

source: The "full range" or "scale" parameters in the :code:`AnalogPotentiometer` constructor are scale factors from a range of 0-1 to the actual range, *not* from 0-5. That is, they represent a native fractional scale, rather than a voltage scale.
tr_tr: :code:`AnalogPotentiometer` yapıcısındaki "full range" veya "scale" parametreleri, 0-5 arası *değil*, 0-1 aralığından gerçek aralığa kadar ölçek faktörleridir. Yani, bir voltaj ölçeği yerine yerel bir kesirli ölçeği temsil ederler.
zh_cn: AnalogPotentiometer构造函数中的“全范围”或“范围”参数是从0-1的比例因子而不是从0-5的。也就是说，它们代表一个自然的小数位数，而不是电压等级。

source: An AnalogPotentiometer can be initialized as follows:
tr_tr: Bir Analog Potansiyometre aşağıdaki şekilde başlatılabilir:
zh_cn: 可以通过以下方式初始化AnalogPotentiometer：

source: Customizing the underlying AnalogInput
tr_tr: Temeldeki AnalogInput'u özelleştirme
zh_cn: 自定义底层模拟输入

source: If the user changes the scaling of the :code:`AnalogInput` with oversampling, this must be reflected in the scale setting passed to the :code:`AnalogPotentiometer`.
tr_tr: Kullanıcı: code:`AnalogInput" 'un ölçeklendirmesini yüksek hızda örnekleme ile değiştirirse, bu,: code:`AnalogPotentiometer" e iletilen ölçek ayarına yansıtılmalıdır.
zh_cn: 如果用户更改AnalogInput过采样的比例，则必须在传递给AnalogPotentiometer的比例设置中反映出来。

source: If the user would like to apply custom settings to the underlying :code:`AnalogInput` used by the :code:`AnalogPotentiometer`, an alternative constructor may be used in which the :code:`AnalogInput` is injected:
tr_tr: Kullanıcı, :code:`AnalogPotentiometer` tarafından kullanılan temel :code:`AnalogInput` öğesine özel ayarlar uygulamak isterse, içinde :code:`AnalogInput` öğesinin enjekte edildiği alternatif bir constrtuctor kullanılabilir:
zh_cn: 如果用户希望将自定义设置应用于AnalogInput所使用的基础AnalogPotentiometer，则可以使用AnalogInput注入的替代构造函数：

source: Reading values from the AnalogPotentiometer
tr_tr: AnalogPotentiometer den değerleri okuma
zh_cn: 从模拟电位计读取值

source: The scaled value can be read by simply calling the :code:`get` method:
tr_tr: Ölçeklenmiş değer, basitçe: code: `get` yöntemi çağrılarak okunabilir:
zh_cn: 只需调用以下get方法即可读取缩放值：

source: Using AnalogPotentiometers in code
zh_cn: 在代码中使用模拟电位计

source: Analog sensors can be used in code much in the way other sensors that measure the same thing can be. If the analog sensor is a potentiometer measuring an arm angle, it can be used similarly to an :doc:`encoder <encoders-software>`. If it is an ultrasonic sensor, it can be used similarly to other :doc:`ultrasonics <ultrasonics-software>`.
tr_tr: Analog sensörler, aynı şeyi ölçen diğer sensörlerin olabileceği şekilde kodda kullanılabilir. Analog sensör bir kol açısını ölçen bir potansiyometre ise, bir :doc:`encoder <encoders-software>`'e benzer şekilde kullanılabilir. Ultrasonik bir sensör ise, diğerine benzer şekilde kullanılabilir :doc:`ultrasonics <ultrasonics-software>`.
zh_cn: 模拟传感器可以像其他测量同一物体的传感器那样大量地用于代码中。如果模拟传感器是测量臂角的电位计，则可以类似于编码器使用。如果是超声波传感器，则可以与其他超声波类似地使用。

source: It is very important to keep in mind that actual, physical potentiometers generally have a limited range of motion. Safeguards should be present in both the physical mechanism and the code to ensure that the mechanism does not break the sensor by traveling past its maximum throw.
tr_tr: Gerçek, fiziksel potansiyometrelerin genellikle sınırlı bir hareket aralığına sahip olduğunu akılda tutmak çok önemlidir. Korumalar, mekanizmanın maksimum atışını geçerek sensörü kırmamasını sağlamak için hem fiziksel mekanizmada hem de kodda mevcut olmalıdır.
zh_cn: 重要的是要记住，实际的物理电位器通常具有有限的运动范围。物理机构和代码中均应有防护措施，以确保该机构不会超过传感器的最大行程而损坏传感器。
