Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/sensors/analog-inputs-software.po
Languages: es_mx, tr_tr, zh_cn

source: Analog Inputs - Software
es_mx: Entradas análogas - Software
tr_tr: Analog Inputs - Yazılım
zh_cn: 模拟输入-软件

source: This section covers analog inputs in software. For a hardware guide to analog inputs, see :ref:`docs/hardware/sensors/analog-inputs-hardware:Analog Inputs - Hardware`.
es_mx: Esta sección cubre las entradas análogas en software. Para una guía de entradas análogas en Hardware, lea :ref:`docs/hardware/sensors/analog-inputs-hardware:Analog Inputs - Hardware`.
tr_tr: Bu bölüm yazılımdaki analog girişleri kapsar. Analog girişlere yönelik bir donanım kılavuzu için bkz :ref:`docs/hardware/sensors/analog-inputs-hardware:Analog Inputs - Hardware`.
zh_cn: 本节介绍软件中的模拟输入。有关模拟输入的硬件指南，请参见:ref:`docs/hardware/sensors/analog-inputs-hardware:Analog Inputs - Hardware`。

source: The roboRIO's FPGA supports up to 8 analog input channels that can be used to read the value of an analog voltage from a sensor. Analog inputs may be used for any sensor that outputs a simple voltage.
es_mx: El FPGA de roboRIO admite hasta 8 canales de entrada analógica que se pueden usar para leer el valor de un voltaje analógico de un sensor. Las entradas analógicas se pueden usar para cualquier sensor que emite un voltaje simple.
tr_tr: RoboRIO'nun FPGA'sı, bir sensörden bir analog voltajın değerini okumak için kullanılabilen 8'e kadar analog giriş kanalını destekler. Basit bir voltaj veren herhangi bir sensör için analog girişler kullanılabilir.
zh_cn: roboRIO的FPGA支持多达8个模拟输入通道，可用于从传感器读取模拟电压值。模拟输入可用于任何输出简单电压的传感器。

source: Analog inputs from the FPGA by default return a 12-bit integer proportional to the voltage, from 0 to 5 volts.
es_mx: Las entradas analógicas del FPGA por defecto devuelven un número entero de 12 bits proporcional al voltaje, de 0 a 5 voltios.
tr_tr: FPGA'dan gelen analog girişler varsayılan olarak voltajla orantılı olarak 0 ila 5 volt arasında 12 bitlik bir tam sayı döndürür.
zh_cn: 默认情况下，来自FPGA的模拟输入返回一个与电压成正比的12bit整数，范围为0至5伏。

source: The AnalogInput class
es_mx: Clase AnalogInput
zh_cn: AnalogInput类

source: It is often more convenient to use the :doc:`Analog Potentiometers <analog-potentiometers-software>` wrapper class than to use :code:`AnalogInput` directly, as it supports scaling to meaningful units.
es_mx: Normalmente es más conveniente usar la clase `Analog Potentiometers<analog-potentiometers-software>` que usar la `AnalogInput` directamente, ya que permite escalar a unidades más significativas.
tr_tr: Anlamlı birimlere ölçeklendirmeyi desteklediği için :doc:`Analog Potentiometers <analog-potentiometers-software>` wrapper sınıfını kullanmak, doğrudan :code:`AnalogInput` kullanmaktan daha uygundur.
zh_cn: 与直接使用AnalogInput相比，使用Analog Potentiometers 包装器类通常更方便，因为它支持缩放至有意义的单位。

source: Support for reading the voltages on the FPGA analog inputs is provided through the :code:`AnalogInput` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogInput.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogInput.html>`__).
es_mx: El soporte para la lectura de los voltajes en las entradas analógicas de la FPGA se proporciona a través de la clase :code:`AnalogInput` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogInput.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogInput.html>`__).
tr_tr: FPGA analog girişlerindeki voltajları okuma desteği şu şekilde sağlanır :code:`AnalogInput` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogInput.html>`__, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogInput.html>`__).
zh_cn: 通过AnalogInput类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogInput.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogInput.html>`__）提供了读取FPGA模拟输入上的电压的支持。

source: Initializing an AnalogInput
es_mx: Inicializando una AnalogInput
tr_tr: Bir AnalogInput'u Başlatma
zh_cn: 初始化模拟输入

source: An :code:`AnalogInput` may be initialized as follows:
es_mx: Una AnalogInput tiene que inicializarse de esta forma:
tr_tr: Bir :code:`AnalogInput` aşağıdaki gibi başlatılabilir:
zh_cn: AnalogInput可如下初始化：

source: Oversampling and Averaging
es_mx: Sobremuestreo y Promedio
tr_tr: Yüksek Hızla Örnekleme ve Ortalama Alma
zh_cn: 过采样和平均

source: The FPGA's analog input modules supports both oversampling and averaging. These behaviors are highly similar, but differ in a few important ways. Both may be used at the same time.
es_mx: Los módulos de entrada analógica de FPGA admiten sobremuestreo y promedio. Estos comportamientos son muy similares, pero difieren en algunas formas importantes. Ambos pueden usarse al mismo tiempo.
tr_tr: FPGA'nın analog giriş modülleri, hem yüksek hızda örneklemeyi hem de ortalamayı destekler. Bu davranışlar oldukça benzerdir, ancak birkaç önemli yönden farklılık gösterir. Her ikisi de aynı anda kullanılabilir.
zh_cn: FPGA的模拟输入模块支持过采样和平均。两者非常相似，但在一些重要方面有所不同。两者可以同时使用。

source: Oversampling
es_mx: Sobremuestreo
tr_tr: Yüksek hızda örnekleme-Oversampling
zh_cn: 过采样

source: When oversampling is enabled, the FPGA will add multiple consecutive samples together, and return the accumulated value. Users may specify the number of *bits* of oversampling - for :math:`n` bits of oversampling, the number of samples added together is :math:`2~{n}`:
es_mx: Cuando se habilita el sobremuestreo, el FPGA agregará varias muestras consecutivas y devolverá el valor acumulado. Los usuarios pueden especificar el número de *bits* de sobremuestreo: para `n` bits de sobremuestreo, el número de muestras sumadas es `2~{n}`:
tr_tr: Yüksek hızda örnekleme etkinleştirildiğinde, FPGA birden çok ardışık örneği birlikte ekler ve birikmiş değeri döndürür. Kullanıcılar, yüksek hızda örneklemenin *bitlerinin* sayısını belirtebilir - için :math:`n` yüksek hızda örnekleme, bir araya getirilen örneklerin sayısı :math:`2~{n}`:
zh_cn: 使能过采样后，FPGA将把多个连续采样加在一起，并返回累加值。用户可以指定过采样的*位数量-对于过采样的n位，相加的采样数量为2〜{n}`：

source: Averaging
es_mx: Promedio
tr_tr: Averaging - Ortalama
zh_cn: 平均

source: Averaging behaves much like oversampling, except the accumulated values are divided by the number of samples so that the scaling of the returned values does not change. This is often more-convenient, but occasionally the additional roundoff error introduced by the rounding is undesirable.
es_mx: El promedio se comporta como un sobremuestreo, excepto que los valores acumulados se dividen por el número de muestras para que la escala de los valores devueltos no cambie. Esto suele ser más-conveniente, pero ocasionalmente el error de redondeo adicional introducido por el redondeo es indeseable.
tr_tr: Ortalama alma, yüksek hızda örnekleme gibi davranır, ancak toplanan değerlerin örnek sayısına bölünmesi, böylece döndürülen değerlerin ölçeklendirilmesi değişmez. Bu genellikle daha kullanışlıdır, ancak bazen yuvarlamanın neden olduğu ek yuvarlama hatası istenmeyen bir durumdur.
zh_cn: 平均的行为与过采样非常相似，不同之处在于，将累积值除以样本数，以使返回值的缩放比例不变。这通常更方便，但是有时舍入所导致的附加舍入误差是不希望看到的。

source: When oversampling and averaging are used at the same time, the oversampling is applied *first,* and then the oversampled values are averaged. Thus, 2-bit oversampling and 2-bit averaging used at the same time will increase the scale of the returned values by approximately a factor of 2, and decrease the update rate by approximately a factor of 4.
es_mx: Cuando se utilizan sobremuestreo y promedio al mismo tiempo, primero se aplica el sobremuestreo y luego se promedian los valores sobremuestreados. Por lo tanto, el sobremuestreo de 2 bits y el promedio de 2 bits utilizados al mismo tiempo aumentará la escala de los valores devueltos en aproximadamente un factor de 2 y disminuirá la velocidad de actualización en aproximadamente un factor de 4.
tr_tr: Yüksek hızda örnekleme ve ortalama aynı anda kullanıldığında, yüksek hızda örnekleme *ilk* uygulanır ve ardından yüksek hızda örneklenen değerlerin ortalaması alınır. Bu nedenle, aynı anda kullanılan 2 bit yüksek hızda örnekleme ve 2 bit ortalama alma, döndürülen değerlerin ölçeğini yaklaşık 2 kat artıracak ve güncelleme hızını yaklaşık 4 kat azaltacaktır.
zh_cn: 当同时使用过采样和平均时，将首先应用过采样，然后对过采样的值进行平均。因此，同时使用2位过采样和2位平均将使返回值的小数位数增加大约2倍，而更新率降低大约4倍。

source: Reading values from an AnalogInput
es_mx: Leyendo valores de la clase AnalogInput
tr_tr: AnalogInput den değerleri okuma
zh_cn: 从AnalogInput读取值

source: Values can be read from an AnalogInput with one of four different methods:
es_mx: Los valores se pueden leer desde AnalogInput con uno de cuatro métodos diferentes:
tr_tr: Değerler bir AnalogInput 'tan dört farklı yöntemden biriyle okunabilir:
zh_cn: 可以使用以下四种方法之一从AnalogInput读取值：

source: The :code:`getValue` method returns the raw instantaneous measured value from the analog input, without applying any calibration and ignoring oversampling and averaging settings. The returned value is an integer.
es_mx: El método getValue devuelve el valor bruto instantáneo medido de la entrada analógica, sin aplicar ninguna calibración e ignorar las configuraciones de sobremuestreo y promedio. El valor devuelto es un entero.
tr_tr: :code:`getValue` yöntemi, herhangi bir kalibrasyon uygulamadan ve yüksek hızda örnekleme ve ortalama alma ayarlarını göz ardı etmeden, analog girişten ham anlık ölçülen değeri döndürür. Döndürülen değer bir integer dır.
zh_cn: 该getValue方法从模拟输入返回原始瞬时测量值，而无需进行任何校准，也无需忽略过采样

source: The :code:`getVoltage` method returns the instantaneous measured voltage from the analog input. Oversampling and averaging settings are ignored, but the value is rescaled to represent a voltage. The returned value is a double.
es_mx: El método getVoltage devuelve el voltaje medido instantáneo desde la entrada analógica. Las configuraciones de sobremuestreo y promedio se ignoran, pero el valor se vuelve a escalar para representar un voltaje. El valor devuelto es un doble.
tr_tr: :code:`getVoltage` yöntemi, analog girişten anlık ölçülen gerilimi döndürür. Yüksek hızda örnekleme ve ortalama alma ayarları göz ardı edilir, ancak değer bir voltajı temsil edecek şekilde yeniden ölçeklendirilir. Döndürülen değer double dır.
zh_cn: 该getVoltage方法从模拟输入返回瞬时测量电压。过采样和平均设置将被忽略，但该值将重新缩放以代表电压。返回值是双精度浮点数。

source: The :code:`getAverageValue` method returns the averaged value from the analog input. The value is not rescaled, but oversampling and averaging are both applied. The returned value is an integer.
es_mx: El método getAverageValue devuelve el valor promedio de la entrada analógica. El valor no se vuelve a escalar, pero se aplican sobremuestreo y promedio. El valor devuelto es un entero.
tr_tr: :code:`getAverageValue` yöntemi, analog girdiden ortalama değeri döndürür. Değer yeniden ölçeklendirilmez, ancak yüksek hızda örnekleme ve ortalama alma uygulanır. Döndürülen değer bir tamsayıdır-integer.
zh_cn: 该getAverageValue方法从模拟输入返回平均值。该值不会重新定标，但是会同时应用过采样和平均。返回值是一个整数。

source: The :code:`getAverageVoltage` method returns the averaged voltage from the analog input. Rescaling, oversampling, and averaging are all applied. The returned value is a double.
es_mx: El método getAverageVoltage devuelve el voltaje promedio de la entrada analógica. El reescalado, el sobremuestreo y el promedio se aplican. El valor devuelto es un doble.
tr_tr: :code:`getAverageVoltage` yöntemi, analog girişten ortalama voltajı döndürür. Yeniden ölçekleme, yüksek hızda örnekleme ve ortalama uygulanıyor. Döndürülen değer double dır.
zh_cn: 该getAverageVoltage方法从模拟输入返回平均电压。重新缩放，过采样和平均均适用。返回值是双精度浮点数。

source: Accumulator
es_mx: Acumulador
tr_tr: Accumulator - Akümülatör
zh_cn: 累加器

source: The accumulator methods do not currently support returning a value in units of volts - the returned value will always be an integer (specifically, a :code:`long`).
es_mx: Los métodos de acumulación no admiten actualmente la devolución de un valor en unidades de voltios; el valor devuelto siempre será un entero (específicamente, uno largo).
tr_tr: Akümülatör yöntemleri şu anda volt birimlerinde bir değer döndürmeyi desteklemiyor - döndürülen değer her zaman bir integer olacaktır (özellikle, :code:`long`).
zh_cn: 累加器方法当前不支持以伏特为单位返回值-返回的值将始终是整数（特殊时是 long）。

source: Analog input channels 0 and 1 additionally support an accumulator, which integrates (adds up) the signal indefinitely, so that the returned value is the sum of all past measured values. Oversampling and averaging are applied prior to accumulation.
es_mx: Los canales de entrada analógica 0 y 1 soportan adicionalmente un acumulador, que integra (suma) la señal indefinidamente, de modo que el valor devuelto es la suma de todos los valores medidos pasados. El sobremuestreo y el promedio se aplican antes de la acumulación.
tr_tr: 0 ve 1 nolu Analog giriş kanalları ek olarak, sinyali süresiz olarak entegre eden (toplayan) bir toplayıcıyı-accumulator destekler, böylece döndürülen değer, tüm geçmiş ölçülen değerlerin toplamı olur. Yüksek hızda örnekleme ve ortalama, biriktirmeden önce uygulanır.
zh_cn: 模拟输入通道0和1额外支持一个累加器，该累加器可无限期地积分（累加）信号，因此返回值是所有过去测量值的总和。在累加之前进行过采样和平均。

source: Obtaining synchronized count and value
es_mx: Obtención de recuento y valor sincronizados
tr_tr: Senkronize sayım ve değer elde etme
zh_cn: 获得同步的计数和值

source: Sometimes, it is necessarily to obtain matched measurements of the count and the value. This can be done using the :code:`getAccumulatorOutput` method:
es_mx: A veces, es necesario obtener medidas coincidentes de la cuenta y el valor. Esto se puede hacer usando el método getAccumulatorOutput:
tr_tr: Bazen, sayım ve değerin eşleşen ölçümlerini elde etmek gerekir. Bu, :code:`getAccumulatorOutput` yöntemi kullanılarak yapılabilir:
zh_cn: 有时，必须获得匹配的计数和值。可以使用以下getAccumulatorOutput方法完成此操作：

source: Using analog inputs in code
es_mx: Usar entradas analógicas en código
tr_tr: Kodda analog girişlerin kullanılması
zh_cn: 在代码中使用模拟输入

source: The :code:`AnalogInput` class can be used to write code for a wide variety of sensors (including potentiometers, accelerometers, gyroscopes, ultrasonics, and more) that return their data as an analog voltage. However, if possible it is almost always more convenient to use one of the other existing WPILib classes that handles the lower-level code (reading the analog voltages and converting them to meaningful units) for you. Users should only directly use :code:`AnalogInput` as a "last resort."
es_mx: La clase AnalogInput se puede usar para escribir código para una amplia variedad de sensores (incluidos potenciómetros, acelerómetros, giroscopios, ultrasonidos y más) que devuelven sus datos como un voltaje analógico. Sin embargo, si es posible, casi siempre es más conveniente utilizar una de las otras clases WPILib existentes que manejan el código de nivel inferior (leer los voltajes analógicos y convertirlos en unidades significativas) para usted. Los usuarios solo deben usar AnalogInput directamente como "último recurso".
tr_tr: :code:`AnalogInput` sınıfı, verilerini analog voltaj olarak döndüren çok çeşitli sensörler (potansiyometreler, ivmeölçerler, jiroskoplar, ultrasonikler ve daha fazlası dahil) için kod yazmak için kullanılabilir. Bununla birlikte, mümkünse, sizin için daha düşük seviyeli kodu işleyen (analog voltajları okumak ve bunları anlamlı birimlere dönüştürmek) mevcut diğer WPILib sınıflarından birini kullanmak neredeyse her zaman daha uygundur. Kullanıcılar yalnızca "son çare" olarak doğrudan :code:`AnalogInput` kullanmalıdır.
zh_cn: AnalogInput类可用给各种传感器（包括电位计，加速度计，陀螺仪，超声波，等等）返回它们的模拟电压数据。但是，如果可能的话，使用其他现有的WPILib类中的一个总是更方便，该类可为您处理较低级别的代码（读取模拟电压并将其转换为有意义的单位）。用户应将直接使用AnalogInput用作“最后的手段”。

source: Accordingly, for examples of how to effectively use analog sensors in code, users should refer to the other pages of this chapter that deal with more-specific classes.
es_mx: En consecuencia, para obtener ejemplos de cómo usar efectivamente sensores analógicos en el código, los usuarios deben consultar las otras páginas de este capítulo que tratan sobre clases más específicas.
tr_tr: Buna göre, analog sensörlerin kodda nasıl etkili bir şekilde kullanılacağına dair örnekler için, kullanıcılar bu bölümün daha spesifik sınıflarla ilgili diğer sayfalarına başvurmalıdır.
zh_cn: 因此，有关如何有效地在代码中使用模拟传感器的示例，用户应参考本章的其他页面，这些页面涉及更具体的类。
