Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/sensors/counters.po
Languages: es_mx, zh_cn

source: Counters
zh_cn: 计数器

source: The :code:`Counter` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Counter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Counter.html>`__) is a versatile class that allows the counting of pulse edges on a digital input. :code:`Counter` is used as a component in several more-complicated WPILib classes (such as :ref:`Encoder <docs/software/sensors/encoders-software:Encoders - Software>` and :ref:`Ultrasonic <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`), but is also quite useful on its own.
es_mx: La clase :code:`Counter` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Counter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Counter.html>`__) es una clase versátil que permite contar los flancos de los pulsos en una entrada digital. :code:`Counter` se utiliza como componente de varias clases WPILib más complicadas (como :ref:`Encoder <docs/software/sensors/encoders-software:Encoders - Software>` y :ref:`Ultrasonic <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`), pero también es bastante útil por sí sola.
zh_cn: Counter类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Counter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Counter.html>`__）是一种多功能的类，允许对数字输入的脉冲边界进行计数。 Counter在多个更复杂的WPILib类（例如Encoder和Ultrasonic）中用作组件，但它本身也非常有用。

source: There are a total of 8 counter units in the roboRIO FPGA, meaning no more than 8 :code:`Counter` objects may be instantiated at any one time, including those contained as resources in other WPILib objects. For detailed information on when a :code:`Counter` may be used by another object, refer to the official API documentation.
es_mx: Hay un total de 8 unidades de contador en la FPGA roboRIO, lo que significa que no más de 8 objetos :code:`Counter` pueden instanciar en cualquier momento, incluidos aquellos contenidos como recursos en otros objetos WPILib. Para obtener información detallada sobre cuándo un :code:`Counter` puede ser utilizado por otro objeto, consulte la documentación oficial de la API.
zh_cn: roboRIO FPGA中总共有8个计数器单元，这意味着Counter在同时最多可以实例化8个对象，包括那些作为其他WPILib对象中资源的对象。有关Counter何时可能被其他对象使用的详细信息，请参阅官方API文档。

source: Configuring a counter
es_mx: Configurar un counter
zh_cn: 配置计数器

source: The :code:`Counter` class can be configured in a number of ways to provide differing functionalities.
es_mx: La clase :code:`Counter` se puede configurar de varias formas para proporcionar diferentes funcionalidades.
zh_cn: Counter类可以以多种方式配置来提供不同的功能。

source: Counter Modes
es_mx: Modos del counter
zh_cn: 计数器模式

source: The :code:`Counter` object may be configured to operate in one of four different modes:
es_mx: El objeto :code:`Counter` puede configurarse para operar en uno de cuatro modos diferentes:
zh_cn: Counter对象可以被配置成四个不同模式中的一种：

source: `Two-pulse mode`_: Counts up and down based on the edges of two different channels.
es_mx: `Two-pulse mode`_: cuenta hacia arriba y hacia abajo según los bordes de dos canales diferentes.
zh_cn: 双脉冲模式：根据两个不同通道的边界上下计数。

source: `Semi-period mode`_: Measures the duration of a pulse on a single channel.
es_mx: `Semi-period mode`_:Mide la duración de un pulso en un solo canal.
zh_cn: 半周期模式：测量单个通道上的脉冲持续时间。

source: `Pulse-length mode`_: Counts up and down based on the edges of one channel, with the direction determined by the duration of the pulse on that channel.
es_mx: `Pulse-length mode`_: cuenta hacia arriba y hacia abajo según los bordes de un canal, con la dirección determinada por la duración del pulso en ese canal.
zh_cn: 脉冲长度模式：根据一个通道的边界上下计数，其方向由该通道上的脉冲持续时间确定。

source: `External direction mode`_: Counts up and down based on the edges of one channel, with a separate channel specifying the direction.
es_mx: `External direction mode`_: cuenta hacia arriba y hacia abajo según los bordes de un canal, con un canal separado que especifica la dirección.
zh_cn: 外部方向模式：根据一个通道的边界进行上下计数，并使用单独的通道指定方向。

source: In all modes except semi-period mode, the counter can be configured to increment either once per edge (2X decoding), or once per pulse (1X decoding). By default, counters are set to two-pulse mode, if only one channel is specified, the counter will only count up.
es_mx: En todos los modos, excepto en el modo de semiperíodo, el contador se puede configurar para incrementar una vez por borde (decodificación 2X) o una vez por pulso (decodificación 1X). De forma predeterminada, los contadores están configurados en modo de dos pulsos, si solo se especifica un canal, el contador solo contará hacia arriba.
zh_cn: 在除半周期模式以外的所有模式下，均可将计数器配置为每个边界增加一次（2X解码），或者每个脉冲增加一次（1X解码）。默认情况下，计数器设置为双脉冲模式，如果仅指定一个通道，则计数器只会为向上计数。

source: Two-pulse mode
es_mx: Modo de dos pulsos
zh_cn: 双脉冲模式

source: In two-pulse mode, the :code:`Counter` will count up for every edge/pulse on the specified "up channel," and down for every edge/pulse on the specified "down channel." A counter can be initialized in two-pulse with the following code:
es_mx: En el modo de dos pulsos, el :code:`Counter` contará hacia arriba por cada flanco / pulso en el "canal ascendente" especificado, y hacia abajo por cada flanco / pulso en el "canal descendente" especificado. Un contador se puede inicializar en dos pulsos con el siguiente código:
zh_cn: 在双脉冲模式下，Counter对于指定的“上行通道”上的每个边界/脉冲，将递增计数，对于指定的“下行通道”上的每个边界/脉冲将递减计数。可以使用以下代码在两个脉冲中初始化计数器：

source: Semi-period mode
es_mx: Modo de semiperíodo
zh_cn: 半周期模式

source: In semi-period mode, the :code:`Counter` will count the duration of the pulses on a channel, either from a rising edge to the next falling edge, or from a falling edge to the next rising edge. A counter can be initialized in semi-period mode with the following code:
es_mx: En el modo de semiperíodo, el :code:`Counter` contará la duración de los pulsos en un canal, ya sea desde un borde ascendente hasta el siguiente borde descendente, o desde un borde descendente hasta el siguiente borde ascendente. Un contador se puede inicializar en modo semiperíodo con el siguiente código:
zh_cn: 在半周期模式下，Counter将对通道上脉冲的持续时间进行计数，从上升沿到下一个下降沿，或者从下降沿到下一个上升沿。可以使用以下代码在半周期模式下初始化计数器：

source: To get the pulse width, call the :code:`getPeriod()` method:
es_mx: Para obtener el ancho de pulso, llame al método :code:`getPeriod()`.
zh_cn: 要获取脉冲宽度，请调用getPeriod()方法：

source: Pulse-length mode
es_mx: Modo de duración de pulso
zh_cn: 脉冲长度模式

source: In pulse-length mode, the counter will count either up or down depending on the length of the pulse. A pulse below the specified threshold time will be interpreted as a forward count and a pulse above the threshold is a reverse count. This is useful for some gear tooth sensors which encode direction in this manner. A counter can be initialized in this mode as follows:
es_mx: En el modo de longitud de pulso, el contador contará hacia arriba o hacia abajo según la longitud del pulso. Un pulso por debajo del umbral de tiempo especificado se interpretará como un conteo hacia adelante y un pulso por encima del umbral es un conteo hacia atrás. Esto es útil para algunos sensores de dientes de engranajes que codifican la dirección de esta manera. Un contador se puede inicializar en este modo de la siguiente manera:
zh_cn: 在脉冲长度模式下，计数器将根据脉冲长度递增或递减计数。低于指定阈值时间的脉冲将被解释为正向计数，而高于阈值的脉冲将被解释为反向计数。这对于某些以这种方式编码方向的齿轮传感器很有用。如下所示在此模式下初始化计数器：

source: External direction mode
es_mx: Modo de dirección externa
zh_cn: 外部方向模式

source: In external direction mode, the counter counts either up or down depending on the level on the second channel. If the direction source is low, the counter will increase, if the direction source is high, the counter will decrease (to reverse this, see the next section). A counter can be initialized in this mode as follows:
es_mx: En el modo de dirección externa, el contador cuenta hacia arriba o hacia abajo según el nivel en el segundo canal. Si la fuente de dirección es baja, el contador aumentará, si la fuente de dirección es alta, el contador disminuirá (para invertir esto, consulte la siguiente sección). Un contador se puede inicializar en este modo de la siguiente manera:
zh_cn: 在外部方向模式下，计数器根据第二个通道的电平递增或递减计数。如果方向源为低电平，则计数器将增加；如果方向源为高电平，则计数器将减小（要反转，请参见下一节）。如下所示在此模式下初始化计数器：

source: Configuring counter parameters
es_mx: Configurar los parámetros del contador
zh_cn: 配置计数器参数

source: The :code:`Counter` class does not make any assumptions about units of distance; it will return values in whatever units were used to calculate the distance-per-pulse value. Users thus have complete control over the distance units used. However, units of time are *always* in seconds.
es_mx: La clase :code:`Counter` no hace ninguna suposición sobre las unidades de distancia; devolverá valores en las unidades que se hayan utilizado para calcular el valor de distancia por pulso. De este modo, los usuarios tienen un control completo sobre las unidades de distancia utilizadas. Sin embargo, las unidades de tiempo son *siempre* en segundos.
zh_cn: Counter类不对距离单位做任何假设；它将以用于计算每脉冲距离值的任何单位返回值。因此，用户可以决定所使用的距离单位。但是，时间单位始终以秒为单位。

source: The number of pulses used in the distance-per-pulse calculation does *not* depend on the decoding type - each "pulse" should always be considered to be a full cycle (rising and falling).
es_mx: El número de pulsos utilizados en el cálculo de la distancia por pulso *no* depende del tipo de decodificación; cada "pulso" siempre debe considerarse como un ciclo completo (ascendente y descendente).
zh_cn: 计算每个脉冲的距离时使用的脉冲的数量不依赖于解码类型-每个“脉冲”应始终被认为是一个完整的周期（上升和下降）。

source: Apart from the mode-specific configurations, the :code:`Counter` class offers a number of additional configuration methods:
es_mx: Aparte de las configuraciones específicas del modo, la clase :code:`Counter` ofrece varios métodos de configuración adicionales:
zh_cn: 除了特定于模式的配置外，Counter该类还提供了许多其他配置方法：

source: Reading information from counters
es_mx: Leer información de contadores
zh_cn: 从计数器读取信息

source: Regardless of mode, there is some information that the :code:`Counter` class always exposes to users:
es_mx: Independientemente del modo, hay cierta información que la clase :code:`Counter` siempre expone a los usuarios:
zh_cn: 无论采用哪种模式，Counter类始终会向用户公开一些信息：

source: Count
zh_cn: 计数

source: Users can obtain the current count with the :code:`get()` method:
es_mx: Los usuarios pueden obtener el recuento actual con el método :code:`get()`.
zh_cn: 用户可以使用以下get()方法获取当前计数：

source: Distance
es_mx: Distancia
zh_cn: 距离

source: Counters measure *relative* distance, not absolute; the distance value returned will depend on the position of the encoder when the robot was turned on or the encoder value was last :ref:`reset <docs/software/sensors/counters:Resetting a Counter>`.
es_mx: Los contadores miden la distancia *relativa*, no absoluta; el valor de distancia devuelto dependerá de la posición del codificador cuando se encendió el robot o el último valor del codificador :ref:`reset <docs/software/sensors/counters:Resetting a Counter>`.
zh_cn: 计数器测量相对距离，而不是绝对距离；返回的距离值取决于打开机器人电源或上次:ref:`重置 <docs/software/sensors/counters:Resetting a Counter>`编码器值时编码器的位置。

source: If the :ref:`distance per pulse <docs/software/sensors/counters:Configuring counter parameters>` has been configured, users can obtain the total distance traveled by the counted sensor with the :code:`getDistance()` method:
es_mx: Si se ha configurado la :ref:`distancia por pulso <docs/software/sensors/counters:Configuring counter parameters>`, los usuarios pueden obtener la distancia total recorrida por el sensor contado con el método :code:`getDistance()`:
zh_cn: 如果已配置 :ref:`每个脉冲的距离 <docs/software/sensors/counters:Configuring counter parameters>`，则用户可以使用以下getDistance()方法获得计数传感器的总移动距离：

source: Rate
es_mx: Velocidad
zh_cn: 速率

source: Units of time for the :code:`Counter` class are *always* in seconds.
es_mx: Las unidades de tiempo para la clase :code:`Counter` son *siempre* en segundos.
zh_cn: 计数器类的时间单位总是秒。

source: Users can obtain the current rate of change of the counter with the :code:`getRate()` method:
es_mx: Los usuarios pueden obtener la tasa de cambio actual del contador con el método :code:`getRate()`:
zh_cn: 用户可以通过以下方法获取计数器的当前变化率getRate()：

source: Stopped
es_mx: Detenido
zh_cn: 是否停止

source: Users can obtain whether the counter is stationary with the :code:`getStopped()` method:
es_mx: Los usuarios pueden obtener si el contador está parado con el método: code:`getStopped()`:
zh_cn: 用户可以通过以下getStopped()方法获取计数器是否停止：

source: Direction
es_mx: Dirección
zh_cn: 方向

source: Users can obtain the direction in which the counter last moved with the :code:`getDirection()` method:
es_mx: Los usuarios pueden obtener la dirección en la que el contador se movió por última vez con el método :code:`getDirection()` :
zh_cn: 用户可以使用以下getDirection()方法获取计数器最后移动的方向：

source: Period
es_mx: Período
zh_cn: 周期

source: In :ref:`semi-period mode <docs/software/sensors/counters:Semi-period mode>`, this method returns the duration of the pulse, not of the period.
es_mx: En :ref:`semi-period mode <docs/software/sensors/counters:Semi-period mode>`, este método devuelve la duración del pulso, no del período.
zh_cn: 在:ref:`半周期模式 <docs/software/sensors/counters:Semi-period mode>`下，此方法返回脉冲的持续时间，而不是周期的持续时间。

source: Users can obtain the duration (in seconds) of the most-recent period with the :code:`getPeriod()` method:
es_mx: Los usuarios pueden obtener la duración (en segundos) del período más reciente con el método :code:`getPeriod()` :
zh_cn: 用户可以使用以下方法获取最近周期的持续时间（以秒为单位）getPeriod()：

source: Resetting a counter
es_mx: Reiniciar un counter
zh_cn: 重置计数器

source: To reset a counter to a distance reading of zero, call the :code:`reset()` method. This is useful for ensuring that the measured distance corresponds to the actual desired physical measurement.
es_mx: Para restablecer un contador a una lectura de distancia de cero, llame al método :code:`reset()`. Esto es útil para asegurar que la distancia medida corresponde a la medida física deseada real.
zh_cn: 要将计数器重置为零距离读数，请调用reset()方法。这可以确保测量的距离与实际距离相对应。

source: Using counters in code
es_mx: Usando conters en código
zh_cn: 在代码中使用计数器

source: Counters are useful for a wide variety of robot applications - but since the :code:`Counter` class is so varied, it is difficult to provide a good summary of them here. Many of these applications overlap with the :code:`Encoder` class - a simple counter is often a cheaper alternative to a quadrature encoder. For a summary of potential uses for encoders in code, see :ref:`docs/software/sensors/encoders-software:Encoders - Software`.
es_mx: Los counters son útiles para una amplia variedad de aplicaciones de robots, pero dado que la clase :code:`Counter` es tan variada, es difícil proporcionar un buen resumen de ellos aquí. Muchas de estas aplicaciones se superponen con la clase :code:`Encoder`: un counter simple suele ser una alternativa más económica que un codificador en cuadratura. Para obtener un resumen de los usos potenciales de los codificadores en código, consulte :ref:`docs/software/sensors/encoders-software:Encoders - Software`.
zh_cn: 计数器对各种各样的机器人程序很有用-但是由于Counter类的种类繁多，因此很难在此处提供它们的完整摘要。这些应用中有许多与Encoder类重叠-简单的计数器通常是正交编码器的廉价替代品。有关代码中编码器潜在用途的摘要，请参见:ref:`docs/software/sensors/encoders-software:Encoders - Software`。
