Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/sensors/digital-inputs-software.po
Languages: tr_tr, zh_cn

source: Digital Inputs - Software
zh_cn: 数字输入-软件

source: This section covers digital inputs in software. For a hardware guide to digital inputs, see :ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`.
tr_tr: Bu bölüm yazılımdaki dijital girişleri kapsar. Dijital girişlere yönelik bir donanım kılavuzu için bkz :ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`.
zh_cn: 本节介绍软件中的数字输入。有关数字输入的硬件指南，请参阅:ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`。

source: The roboRIO's FPGA supports up to 26 digital inputs. 10 of these are made available through the built-in DIO ports on the RIO itself, while the other 16 are available through the MXP breakout port.
tr_tr: RoboRIO'nun FPGA'sı 26'ya kadar dijital girişi destekler. Bunlardan 10 tanesi RIO üzerindeki yerleşik DIO portları aracılığıyla sağlanırken, diğer 16 tanesi MXP breakout portu üzerinden kullanılabilir.
zh_cn: roboRIO的FPGA支持多达26个数字输入。其中的10个可通过RIO本身的内置DIO端口使用，而其他16个可通过MXP分支端口使用。

source: Digital inputs read one of two states - "high" or "low." By default, the built-in ports on the RIO will read "high" due to internal pull-up resistors (for more information, see :ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware`). Accordingly, digital inputs are most-commonly used with switches of some sort. Support for this usage is provided through the :code:`DigitalInput` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/DigitalInput.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1DigitalInput.html>`__).
tr_tr: Dijital girişler iki durumdan birini okur - "high" veya "low." Varsayılan olarak, RIO üzerindeki yerleşik bağlantı noktaları, dahili kaldırma dirençleri nedeniyle "high" olarak okuyacaktır (daha fazla bilgi için bkz:ref:`docs/hardware/sensors/digital-inputs-hardware:Digital Inputs - Hardware` ). Buna göre, dijital girişler en yaygın olarak bir tür anahtarlarla kullanılır. Bu kullanım için destek, kod :code:`DigitalInput` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/DigitalInput.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1DigitalInput.html>`__) aracılığıyla sağlanır.
zh_cn: 数字输入读取两种状态之一-“高”或“低”。默认情况下，由于内部上拉电阻，RIO上的内置端口将显示为“高”（有关更多信息，请参见“数字输入-硬件”）。因此，数字输入最常与某种开关一起使用。通过DigitalInput类(`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/DigitalInput.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1DigitalInput.html>`__)提供对此用法的支持。

source: The DigitalInput class
tr_tr: The DigitalInput sınıfı
zh_cn: DigitalInput类

source: A :code:`DigitalInput` can be initialized as follows:
tr_tr: A: code:`DigitalInput` aşağıdaki gibi başlatılabilir:
zh_cn: DigitalInput可如下初始化：

source: Reading the value of the DigitalInput
tr_tr: DigitalInput değerinin okunması
zh_cn: 读取DigitalInput的值

source: The state of the :code:`DigitalInput` can be polled with the :code:`get` method:
tr_tr: :code:`DigitalInput` durumu:code:`get` yöntemiyle sorgulanabilir:
zh_cn: DigitalInput可以使用以下get方法轮询状态：

source: Creating a DigitalInput from an AnalogInput
tr_tr: Analog Girişten Dijital Giriş Oluşturma
zh_cn: 从AnalogInput创建DigitalInput

source: An :code:`AnalogTrigger` constructed with a port number argument can share that analog port with a separate :code:`AnalogInput`, but two `AnalogInput` objects may not share the same port.
tr_tr: Bir bağlantı noktası numarası bağımsız değişkeni ile oluşturulan bir :code:`AnalogTrigger`, bu analog bağlantı noktasını ayrı bir :code:`AnalogInput` ile paylaşabilir, ancak iki `AnalogInput` nesnesi aynı bağlantı noktasını paylaşmayabilir.
zh_cn: 一个AnalogTrigger与端口号的参数构造可以与一个单独的共享模拟端口AnalogInput，但有两个AnalogInput对象可以不共用相同的端口。

source: Sometimes, it is desirable to use an analog input as a digital input. This can be easily achieved using the :code:`AnalogTrigger` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogTrigger.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogTrigger.html>`__).
tr_tr: Bazen bir analog girişin dijital giriş olarak kullanılması arzu edilir. Bu, :code:`AnalogTrigger` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogTrigger.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogTrigger.html>`__). kullanılarak kolayca elde edilebilir.
zh_cn: 有时，希望使用模拟输入作为数字输入。使用AnalogTrigger类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogTrigger.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogTrigger.html>`__）可以轻松实现这一点。

source: An :code:`AnalogTrigger` may be initialized as follows. As with :code:`AnalogPotentiometer`, an :code:`AnalogInput` may be passed explicitly if the user wishes to customize the sampling settings:
tr_tr: Bir: kod:`AnalogTrigger` aşağıdaki gibi başlatılabilir. :code:`AnalogPotentiometer` ile olduğu gibi, kullanıcı örnekleme ayarlarını özelleştirmek isterse, bir :code:`AnalogInput` açıkça geçirilebilir:
zh_cn: 一个AnalogTrigger可以如下初始化。与一样AnalogPotentiometer，AnalogInput如果用户希望自定义采样设置，则可以显式传递：

source: Setting the trigger points
tr_tr: Tetikleme noktalarının ayarlanması
zh_cn: 设定触发点

source: For details on the scaling of "raw" :code:`AnalogInput` values, see :doc:`analog-inputs-software`.
tr_tr: "raw-ham" :code:`AnalogInput` değerlerinin ölçeklendirilmesiyle ilgili ayrıntılar için, bakınız :doc:`analog-inputs-software`.
zh_cn: 有关缩放“原始”AnalogInput值的详细信息，请参见“模拟输入-软件”。

source: To convert the analog signal to a digital one, it is necessary to specify at what values the trigger will enable and disable. These values may be different to avoid "dithering" around the transition point:
tr_tr: Analog sinyali dijitale dönüştürmek için, tetikleyicinin hangi değerlerde etkinleştirip devre dışı bırakacağını belirtmek gerekir. Geçiş noktası çevresinde "dithering-titremeyi" önlemek için bu değerler farklı olabilir:
zh_cn: 要将模拟信号转换为数字信号，必须指定触发器将启用和禁用的值。这些值可能会有所不同，以避免在过渡点附近“抖动”：

source: Using DigitalInputs in code
tr_tr: DigitalInputs'u kodda kullanma
zh_cn: 在代码中使用DigitalInputs

source: As almost all switches on the robot will be used through a :code:`DigitalInput`, this class is extremely important for effective robot control.
tr_tr: Robot üzerindeki hemen hemen tüm anahtarlar a: code: `DigitalInput` aracılığıyla kullanılacağından, bu sınıf etkili robot kontrolü için son derece önemlidir.
zh_cn: 由于几乎所有的机器人开关都将通过DigitalInput来使用，因此该类对于有效的机器人控制非常重要。

source: Limiting the motion of a mechanism
tr_tr: Bir mekanizmanın hareketini sınırlamak
zh_cn: 限制机制的运动

source: Nearly all motorized mechanisms (such as arms and elevators) in FRC\ |reg| should be given some form of "limit switch" to prevent them from damaging themselves at the end of their range of motions. A short example is given below:
tr_tr: FRC\ |reg| içindeki neredeyse tüm motorlu mekanizmalar (kollar ve kaldırıcılar gibi) hareket aralıklarının sonunda kendilerine zarar vermelerini önlemek için bir tür "limit switch-limit anahtarı" verilmelidir. Aşağıda kısa bir örnek verilmiştir:
zh_cn: FRC中几乎所有的电动机构（例如臂架和电梯）都应使用某种形式的“限位开关”，以防止它们在其运动范围结束时损坏自身。下面是一个简短的示例：

source: Homing a mechanism
tr_tr: Bir mekanizmaya yön verme
zh_cn: 归位编码机制

source: Limit switches are very important for being able to "home" a mechanism with a encoder. For an example of this, see :ref:`docs/software/sensors/encoders-software:Homing a mechanism`.
tr_tr: Limit anahtarları, bir kodlayıcıya sahip bir mekanizmayı "barındırabilmek" için çok önemlidir. Bunun bir örneği için, bakınız :ref:`docs/software/sensors/encoders-software:Homing a mechanism`.
zh_cn: 限位开关对于能够使编码机构“归位”非常重要。有关此示例，请参阅“设置编码机制”。
