Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/sensors/encoders-software.po
Languages: es_mx, tr_tr, zh_cn

source: Encoders - Software
es_mx: Codificadores - Software
tr_tr: Encoders - Software, Kodlayıcılar - Yazılım
zh_cn: 编码器-软件

source: This section covers encoders in software. For a hardware guide to encoders, see :ref:`docs/hardware/sensors/encoders-hardware:Encoders - Hardware`.
es_mx: Esta sección cubre codificadores en software. Para obtener una guía de hardware para codificadores, consulte :ref:`docs/hardware/sensors/encoders-hardware:Encoders - Hardware`.
tr_tr: Bu bölüm yazılımdaki kodlayıcıları kapsar. Kodlayıcılarla ilgili bir donanım kılavuzu için bkz .:ref:`docs / hardware / sensor / encoders-hardware: Encoders - Hardware`.
zh_cn: 本节介绍软件中的编码器。有关编码器的硬件指南，请参阅:ref:`docs/hardware/sensors/encoders-hardware:Encoders - Hardware`

source: Encoders are devices used to measure motion (usually, the rotation of a shaft). The encoders used in FRC\ |reg| are known as "quadrature encoders." These encoders produce square-wave signals on two channels that are a quarter-period out-of-phase (hence the term, "quadrature"). The pulses are used to measure the rotation, and the direction of motion can be determined from which channel "leads" the other.
es_mx: Los codificadores son dispositivos que se utilizan para medir el movimiento (normalmente, la rotación de un eje). Los codificadores utilizados en FRC\ |reg| se conocen como "codificadores de cuadratura". Estos codificadores producen señales de onda cuadrada en dos canales que están desfasados un cuarto de período (de ahí el término "cuadratura"). Los pulsos se utilizan para medir la rotación y la dirección del movimiento se puede determinar desde qué canal "conduce" al otro.
tr_tr: Kodlayıcılar, hareketi (genellikle bir şaftın dönüşünü) ölçmek için kullanılan cihazlardır. FRC \ | reg | 'de kullanılan kodlayıcılar "karesel kodlayıcılar" olarak bilinir. Bu kodlayıcılar, çeyrek dönem faz dışı olan iki kanalda kare dalga sinyalleri üretir (bu nedenle "kareleme" terimi). Darbeler dönüşü ölçmek için kullanılır ve hareketin yönü hangi kanalın diğerine "yönlendirdiği" belirlenebilir.
zh_cn: 编码器是用于测量运动（通常是轴的旋转）的设备。FRC中使用的编码器称为“正交编码器”。这些编码器在两个相位相差四分之一周期（因此称为“正交”）的通道上产生方波信号。脉冲用于测量旋转，可以从其中一个通道“引导”另一个通道时来确定运动方向。

source: The FPGA handles encoders either through a counter module or an encoder module, depending on the :ref:`decoding type <docs/software/sensors/encoders-software:Decoding type>` - the choice is handled automatically by WPILib. The FPGA contains 8 encoder modules.
es_mx: La FPGA maneja codificadores a través de un módulo contador o un módulo codificador, dependiendo del :ref:`tipo de decodificador<docs/software/sensors/encoders-software:Decoding type>` - la elección la maneja automáticamente WPILib. La FPGA contiene 8 módulos codificadores.
tr_tr: FPGA, şunlara bağlı olarak bir sayaç modülü veya bir kodlayıcı modülü aracılığıyla kodlayıcıları işler :ref:`decoding type <docs/software/sensors/encoders-software:Decoding type>` seçim WPILib tarafından otomatik olarak yapılır. FPGA, 8 kodlayıcı modülü içerir.
zh_cn: FPGA通过计数器模块或编码器模块处理编码器，具体取决于解码类型-该选择由WPILib自动处理。FPGA包含8个编码器模块。

source: The Encoder class
es_mx: La clase Encoder
tr_tr: Encoder sınıfı
zh_cn: Encoder类

source: WPILib provides support for encoders through the :code:`Encoder` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Encoder.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Encoder.html>`__). This class provides a simple API for configuring and reading data from encoders.
es_mx: WPILib proporciona soporte para codificadores a través de la clase :code:`Encoder` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Encoder.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Encoder.html>`__). Esta clase proporciona una API sencilla para configurar y leer datos de los codificadores.
tr_tr: WPILib kodlayıcılar için :code:`Encoder` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Encoder.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Encoder.html>`__) aracılığıyla destek sağlar. Bu sınıf, kodlayıcılardan verileri yapılandırmak ve okumak için basit bir API sağlar.
zh_cn: WPILib通过Encoder类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Encoder.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Encoder.html>`__）为编码器提供支持。此类提供了用于配置和读取编码器数据的简单API。

source: The ``Encoder`` class is only used for encoders that are plugged directly into the roboRIO! Please reference the appropriate vendors' documentation for using encoders plugged into motor controllers.
es_mx: ¡La clase ``Encoder`` solo se utiliza para codificadores que se conectan directamente al roboRIO! Consulte la documentación de los proveedores correspondientes para utilizar codificadores conectados a controladores de motor.
zh_cn: ``Encoder''类仅用于直接插入roboRIO的编码器！请参阅适当的供应商文档，以了解如何使用插入电动机控制器的编码器。

source: Initializing an encoder
es_mx: Inicializando un codificador
tr_tr: Bir encoder-kodlayıcıyı başlatma
zh_cn: 初始化编码器

source: An encoder can be instantiated as follows:
es_mx: Se puede crear una instancia de un codificador de la siguiente manera:
tr_tr: Bir kodlayıcı aşağıdaki gibi başlatılabilir:
zh_cn: 编码器可以实例化如下：

source: Decoding type
es_mx: Tipo de decodificación
tr_tr: Decoding type- Kod çözme türü
zh_cn: 解码类型

source: The WPILib :code:`Encoder` class can decode encoder signals in three different modes:
es_mx: La clase WPILib :code:`Encoder` puede decodificar señales de codificador en tres modos diferentes:
tr_tr: WPILib: code:`Encoder` sınıfı, kodlayıcı sinyallerinin kodunu üç farklı modda çözebilir:
zh_cn: WPILib Encoder类可以以三种不同的模式解码编码器信号：

source: **1X Decoding**: Increments the distance for every complete period of the encoder signal (once per four edges).
es_mx: **Decodificación 1X**: aumenta la distancia por cada período completo de la señal del codificador (una vez cada cuatro bordes).
tr_tr: ** 1X Decoding **: Enkoder sinyalinin her tam periyodu için mesafeyi artırır (dört kenarda bir).
zh_cn: 1X解码：在编码器信号的每个完​​整周期（每四个边沿一次）增加距离。

source: **2X Decoding**: Increments the distance for every half-period of the encoder signal (once per two edges).
es_mx: **Decodificación 2X**: Incrementa la distancia por cada medio período de la señal del codificador (una vez por dos bordes).
tr_tr: ** 2X Decoding **: Enkoder sinyalinin her yarım dönemi için mesafeyi artırır (iki kenarda bir kez).
zh_cn: 2X解码：每增加一半的编码器信号距离（每两个边沿增加一次）。

source: **4X Decoding**: Increments the distance for every edge of the encoder signal (four times per period).
es_mx: **Decodificación 4X**: aumenta la distancia para cada borde de la señal del codificador (cuatro veces por período).
tr_tr: ** 4X Decoding **: Kodlayıcı sinyalinin her kenarı için mesafeyi artırır (periyot başına dört kez).
zh_cn: 4X解码：增加编码器信号每个边缘的距离（每个周期四次）。

source: 4X decoding offers the greatest precision, but at the potential cost of increased "jitter" in rate measurements. To use a different decoding type, use the following constructor:
es_mx: La decodificación 4X ofrece la mayor precisión, pero a costa de un aumento de la "fluctuación" en las mediciones de velocidad. Para usar un tipo de decodificación diferente, use el siguiente constructor:
tr_tr: 4X Decoding-kod çözme, en yüksek hassasiyeti sunar, ancak hız ölçümlerinde artan "jitter-seğirme" potansiyel maliyetiyle. Farklı bir kod çözme türü kullanmak için aşağıdaki yapıcıyı kullanın:
zh_cn: 4X解码可提供最高的精度，但可能会增加速率测量中的“抖动”。要使用其他解码类型，请使用以下构造函数：

source: Configuring encoder parameters
es_mx: Configurar los parámetros del codificador
tr_tr: Enkoder parametrelerini yapılandırma
zh_cn: 配置编码器参数

source: The :code:`Encoder` class does not make any assumptions about units of distance; it will return values in whatever units were used to calculate the distance-per-pulse value. Users thus have complete control over the distance units used. However, units of time are *always* in seconds.
es_mx: La clase :code:`Encoder` no hace ninguna suposición sobre las unidades de distancia; devolverá valores en las unidades que se hayan utilizado para calcular el valor de distancia por pulso. De este modo, los usuarios tienen un control completo sobre las unidades de distancia utilizadas. Sin embargo, las unidades de tiempo son *siempre* en segundos.
tr_tr: :code:`Encoder` sınıfı, mesafe birimleri hakkında herhangi bir varsayımda bulunmaz; darbe başına mesafe değerini hesaplamak için kullanılan birimlerdeki değerleri döndürür. Kullanıcılar böylece kullanılan mesafe birimleri üzerinde tam kontrole sahip olur. Ancak, zaman birimleri *always-her zaman * saniye cinsindendir.
zh_cn: 该Encoder类不对距离单位做任何假设；它将以用于计算每脉冲距离值的任何单位返回值。因此，用户可以决定所使用的距离单位。但是，时间始终以秒为单位。

source: The number of pulses used in the distance-per-pulse calculation does *not* depend on the :ref:`decoding type <docs/software/sensors/encoders-software:Decoding type>` - each "pulse" should always be considered to be a full cycle (four edges).
es_mx: El número de pulsos utilizados en el cálculo de distancia por pulso *no* depende del :ref:`tipo de decodificador <docs/software/sensors/encoders-software:Decoding type>` - cada "pulso" siempre debe considerarse como un ciclo completo (cuatro flancos).
tr_tr: Darbe başına mesafe hesaplamasında kullanılan darbe sayısı şuna * bağlı değildir * :ref:`decoding type <docs/software/sensors/encoders-software:Decoding type>` her "pulse-darbe" her zaman dikkate alınmalıdır tam bir döngü (dört kenar).
zh_cn: 计算每个脉冲的距离时使用的脉冲的数量不依赖于解码类型-每个“脉冲”应始终被认为是一个完整的周期（4条边）。

source: The :code:`Encoder` class offers a number of configuration methods:
es_mx: La clase :code:`Encoder` ofrece varios métodos de configuración:
tr_tr: :code:`Encoder` sınıfı bir dizi yapılandırma yöntemi sunar:
zh_cn: Encoder类提供了许多配置方法：

source: Reading information from encoders
es_mx: Leer información de codificadores
tr_tr: Kodlayıcılardan bilgi okuma
zh_cn: 从编码器读取信息

source: The :code:`Encoder` class provides a wealth of information to the user about the motion of the encoder.
es_mx: La clase :code:`Encoder` proporciona una gran cantidad de información al usuario sobre el movimiento del codificador.
tr_tr: :code:`Encoder` sınıfı, kullanıcıya kodlayıcının hareketi hakkında zengin bilgi sağlar.
zh_cn: Encoder类提供了丰富的编码器的运动信息给用户。

source: Distance
es_mx: Distancia
tr_tr: Distance-Mesafe
zh_cn: 距离

source: Quadrature encoders measure *relative* distance, not absolute; the distance value returned will depend on the position of the encoder when the robot was turned on or the encoder value was last :ref:`reset <docs/software/sensors/encoders-software:Resetting an encoder>`.
es_mx: Los codificadores de cuadratura miden la distancia *relativa*, no absoluta; el valor de distancia devuelto dependerá de la posición del codificador cuando se encendió el robot o el valor del codificador la última vez :ref:`reset <docs/software/sensors/encoders-software:Resetting an encoder>`.
tr_tr: Quadrature kodlayıcılar *relative- göreli* mesafeyi ölçer, mutlak değil; döndürülen mesafe değeri, robot açıldığında veya kodlayıcı değeri en son olduğunda kodlayıcının konumuna bağlı olacaktır :ref:`reset <docs/software/sensors/encoders-software:Resetting an encoder>`.
zh_cn: 正交编码器测量相对距离，而不是绝对距离；返回的距离值取决于打开机器人电源或上次重置编码器值时编码器的位置。

source: Users can obtain the total distance traveled by the encoder with the :code:`getDistance()` method:
es_mx: Los usuarios pueden obtener la distancia total recorrida por el codificador con el método :code:`getDistance()`:
tr_tr: Kullanıcılar, kodlayıcının kat ettiği toplam mesafeyi : code: `getDistance ()' yöntemiyle elde edebilir:
zh_cn: 用户可以使用以下getDistance()方法获得编码器行进的总距离：

source: Rate
es_mx: Velocidad
tr_tr: Rate-Oran
zh_cn: 速率

source: Units of time for the :code:`Encoder` class are *always* in seconds.
es_mx: Las unidades de tiempo para la clase :code:`Encoder` son *siempre* en segundos.
tr_tr: :code:`Encoder` sınıfı için zaman birimleri saniye cinsinden *always-her zaman* şeklindedir.
zh_cn: Encoder类的时间总是以秒为单位。

source: Users can obtain the current rate of change of the encoder with the :code:`getRate()` method:
es_mx: Los usuarios pueden obtener la tasa actual de cambio del codificador con el método :code:`getRate()`:
tr_tr: Kullanıcılar, kodlayıcının geçerli değişim oranını : code: `getRate ()` yöntemiyle elde edebilir:
zh_cn: 用户可以通过以下getRate()方法获得编码器的当前变化率：

source: Stopped
es_mx: Detenido
tr_tr: Stopped-Durduruldu
zh_cn: 是否停止

source: Users can obtain whether the encoder is stationary with the :code:`getStopped()` method:
es_mx: Los usuarios pueden obtener si el codificador está estacionario con el método :code:`getStopped()`:
tr_tr: Kullanıcılar, kodlayıcının sabit olup olmadığını şu yöntemle öğrenebilir : code: `getStopped ()` yöntemi:
zh_cn: 用户可以通过以下getStopped()方法获取编码器是否停止：

source: Direction
es_mx: Dirección
tr_tr: Direction-Yön
zh_cn: 方向

source: Users can obtain the direction in which the encoder last moved with the :code:`getDirection()` method:
es_mx: Los usuarios pueden obtener la dirección en la que el codificador se movió por última vez con el método :code:`getDirection()`:
tr_tr: Kullanıcılar, kodlayıcının en son hareket ettiği yönü: code: `getDirection ()` yöntemiyle elde edebilir:
zh_cn: 用户可以使用以下getDirection()方法获取编码器最后移动的方向：

source: Period
es_mx: Período
zh_cn: 周期

source: Users can obtain the period of the encoder pulses (in seconds) with the :code:`getPeriod()` method:
es_mx: Los usuarios pueden obtener el período de los pulsos del codificador (en segundos) con el método :code:`getPeriod()`:
tr_tr: Kullanıcılar, kodlayıcı darbelerinin süresini (saniye cinsinden): code : `getPeriod ()` yöntemiyle elde edebilir:
zh_cn: 用户可以使用以下getPeriod()方法获得编码器脉冲的周期（以秒为单位）：

source: Resetting an encoder
es_mx: Restablecimiento de un codificador
tr_tr: Resetting an encoder-Bir kodlayıcının sıfırlanması
zh_cn: 重置编码器

source: To reset an encoder to a distance reading of zero, call the :code:`reset()` method. This is useful for ensuring that the measured distance corresponds to the actual desired physical measurement, and is often called during a :ref:`homing <docs/software/sensors/encoders-software:Homing a mechanism>` routine:
es_mx: Para restablecer un codificador a una lectura de distancia de cero, llame al método :code:`reset()`. Esto es útil para asegurar que la distancia medida corresponde a la medida física deseada real, y a menudo se llama durante una rutina :ref:`homing <docs/software/sensors/encoders-software:Homing a mechanism>`:
tr_tr: Bir kodlayıcıyı sıfır mesafeli okumaya sıfırlamak için : code: `reset ()` yöntemini çağırın. Bu, ölçülen mesafenin istenen gerçek fiziksel ölçüme karşılık gelmesini sağlamak için kullanışlıdır ve genellikle : ref: `homing <docs/software/sensors/encoders-software:Homing a mechanism>` rutini sırasında çağrılır:
zh_cn: 要将编码器距离读数重置为零，请调用该reset()方法。这对于确保测得的距离与实际距离相对应很有用，并且经常在归位例程中调用该方法：

source: Using encoders in code
es_mx: Usando codificadores en código
tr_tr: Using encoders in code-Kodlayıcıları kodda kullanma
zh_cn: 在代码中使用编码器

source: Encoders are some of the most useful sensors in FRC; they are very nearly a requirement to make a robot capable of nontrivially-automated actuations and movement. The potential applications of encoders in robot code are too numerous to summarize fully here, but a few basic examples are provided below:
es_mx: Los codificadores son algunos de los sensores más útiles en FRC; son casi un requisito para hacer que un robot sea capaz de acciones y movimientos no trivialmente automatizados. Las posibles aplicaciones de los codificadores en código de robot son demasiado numerosas para resumirlas completamente aquí, pero a continuación se proporcionan algunos ejemplos básicos:
tr_tr: Kodlayıcılar, FRC'deki en kullanışlı sensörlerden bazılarıdır; bunlar, otomatik olmayan çalıştırma ve hareket kabiliyetine sahip bir robot yapmak için neredeyse bir gerekliliktir. Kodlayıcıların robot kodundaki potansiyel uygulamaları burada tam olarak özetlenemeyecek kadar çoktur, ancak aşağıda birkaç temel örnek verilmiştir:
zh_cn: 编码器是FRC中最有用的传感器。他们能使机器人具有非凡的运动能力。编码器在机器人代码中的潜在应用太多，因此无法在此处进行全面总结，但下面提供了一些基本示例：

source: Driving to a distance
es_mx: Conducir a una distancia
tr_tr: Driving to a distance-Bir mesafeye sürüş
zh_cn: 行驶一段距离

source: Encoders can be used on a robot drive to create a simple "drive to distance" routine. This is very useful for robot autonomy:
es_mx: Los codificadores se pueden utilizar en una unidad de robot para crear una rutina simple de "unidad a distancia". Esto es muy útil para la autonomía del robot:
tr_tr: Kodlayıcılar, basit bir ""drive to distance-uzaklığa sür" rutini oluşturmak için bir robot sürücüsünde kullanılabilir. Bu, robot özerkliği için çok kullanışlıdır:
zh_cn: 编码器可用于机器人底盘上，以创建简单的“行驶一段距离”例程。这对于机器人自动化非常有用：

source: Stabilizing heading
es_mx: Estabilizando el encabezado
tr_tr: Stabilizing heading-Yönü sabitllemek
zh_cn: 稳定航向

source: Like with all control loops, users should be careful to ensure that the sensor direction and the turning direction are consistent. If they are not, the loop will be unstable and the robot will turn wildly.
es_mx: Al igual que con todos los bucles de control, los usuarios deben tener cuidado de asegurarse de que la dirección del sensor y la dirección de giro sean consistentes. Si no lo están, el bucle será inestable y el robot se volverá loco.
tr_tr: Tüm kontrol döngülerinde olduğu gibi, kullanıcılar sensör yönünün ve dönüş yönünün tutarlı olmasını sağlamak için dikkatli olmalıdır. Aksi takdirde, döngü dengesiz olacak ve robot çılgınca dönecektir.
zh_cn: 与所有控制回路一样，用户应注意确保传感器方向和旋转方向一致。如果不是这样，则回路将变得不稳定，并且机器人将疯狂旋转。

source: Encoders can be used to ensure that a robot drives straight in a manner quite similar to :ref:`how it is done with a gyroscope <docs/software/sensors/gyros-software:Stabilizing heading while driving>`. A simple implementation with a P loop is given below:
es_mx: Los codificadores se pueden usar para garantizar que un robot conduzca directamente de una manera bastante similar a :ref:`como si fuera hecho con un giroscopio <docs/software/sensors/gyros-software:Stabilizing heading while driving>`. A continuación, se muestra una implementación simple con un bucle P:
tr_tr: Kodlayıcılar, bir robotun aşağıdakine oldukça benzer bir şekilde düz hareket etmesini sağlamak için kullanılabilir <docs/software/sensors/gyros-software:Stabilizing heading while driving>`. P döngüsü ile basit bir uygulama aşağıda verilmiştir:
zh_cn: 编码器可以用与陀螺仪十分类似的方式确保机器人直线行驶。下面给出一个带有P回路的简单实现：

source: More-advanced implementations can use more-complicated control loops. Closing a control loop on the encoder difference is roughly analogous to closing it on the heading error, and so PD loops are particularly effective.
es_mx: Implementaciones más avanzadas pueden usar bucles de control más complejos. Cerrar un bucle de control en la diferencia del codificador es difícilmente análogo a cerrarlo en el error de rumbo, y por esto los bucles PD son particularmente efectivos.
tr_tr: Daha gelişmiş uygulamalar, daha karmaşık kontrol döngüleri kullanabilir. Kodlayıcı farkında bir kontrol döngüsünün kapatılması, başlık hatasında kapatılmasına kabaca benzer ve bu nedenle PD döngüleri özellikle etkilidir.
zh_cn: 更高级的实现可以使用更复杂的控制回路。在编码器差异上闭合控制回路大致类似于在航向误差上闭合控制环路，因此PD回路特别有效。

source: PID Control
es_mx: Control PID
tr_tr: PID Kontrol
zh_cn: PID控制

source: Encoders are particularly useful as inputs to PID controllers (the heading stabilization example above is a simple P loop).
es_mx: Los codificadores son particularmente útiles como entradas para los controladores PID (el ejemplo de estabilización de rumbo anterior es un simple bucle P).
tr_tr: Enkoderler özellikle PID denetleyicilerine girdi olarak kullanışlıdır (yukarıdaki başlık sabitleme örneği basit bir P döngüsüdür).
zh_cn: 编码器作为PID控制器的输入特别有用（上面的航向稳定示例是一个简单的P回路）。

source: Homing a mechanism
es_mx: Dirigiendo un mecanismo
tr_tr: Bir mekanizmaya yön verme
zh_cn: 归位编码机制

source: Since encoders measure *relative* distance, it is often important to ensure that their "zero-point" is in the right place. A typical way to do this is a "homing routine," in which a mechanism is moved until it hits a known position (usually accomplished with a limit switch), or "home," and then the encoder is reset. The following code provides a basic example:
es_mx: Gracias a que los encoders pueden medir la distancia relativa, es importante asegurarse que el “punto cero” esta ubicado en el lugar correcto. Una forma típica de hacer esto es con una "rutina de referencia", en la cual se mueve un mecanismo hasta que alcanza una posición conocida (generalmente realizada con un interruptor de límite), o "inicio", y luego se reinicia el codificador. El siguiente código proporciona un ejemplo básico:
tr_tr: Kodlayıcılar * relative-göreli * mesafeyi ölçtüğünden, "zero-point-sıfır noktalarının" doğru yerde olmasını sağlamak genellikle önemlidir. Bunu yapmanın tipik bir yolu, bir mekanizmanın bilinen bir konuma (genellikle bir limit anahtarı ile gerçekleştirilir) veya "ana konuma" ulaşana kadar hareket ettirildiği ve ardından kodlayıcının sıfırlandığı bir "hedef arama rutini" dir. Aşağıdaki kod, temel bir örnek sağlar:
zh_cn: 由于编码器会测量相对距离，因此确保其“零点”在正确的位置通常很重要。一种典型的实现方法是“归位例程”，在该过程中，将机械装置移动到到达已知位置（通常由限位开关完成）或“原点”，然后重置编码器。以下代码提供了一个基本示例：
