Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/sensors/gyros-software.po
Languages: tr_tr, zh_cn

source: Gyroscopes - Software
tr_tr: Gyroscopes - Yazılım
zh_cn: 陀螺仪-软件

source: This section covers gyros in software. For a hardware guide to gyros, see :ref:`docs/hardware/sensors/gyros-hardware:Gyroscopes - Hardware`.
tr_tr: Bu bölüm yazılımdaki jiroskopları kapsar. Jiroskoplarla ilgili bir donanım kılavuzu için bkz . :ref:`docs/hardware/sensors/gyros-hardware:Gyroscopes - Hardware`.
zh_cn: 本节介绍软件中的陀螺仪。有关陀螺仪的硬件指南，请参见:ref:`docs/hardware/sensors/gyros-hardware:Gyroscopes - Hardware`。

source: A gyroscope, or "gyro," is an angular rate sensor typically used in robotics to measure and/or stabilize robot headings. WPILib natively provides specific support for the ADXRS450 gyro available in the kit of parts, as well as more general support for a wider variety of analog gyros through the `AnalogGyro`_ class.
tr_tr: Bir jiroskop veya "gyro", genellikle robotikte robot yönlerini ölçmek ve/veya stabilize etmek için kullanılan bir açısal oran sensörüdür. WPILib, parça kitinde bulunan ADXRS450 jiroskopu için doğal olarak özel destek ve `AnalogGyro`_ sınıfı aracılığıyla daha geniş çeşitlilikteki analog jiroskoplar için daha genel destek sağlar.
zh_cn: 陀螺仪或“陀螺仪”是通常在机器人技术中用于测量和/或稳定机器人航向的角速度传感器。WPILib本身就为零件套件中提供的ADXRS450陀螺仪提供了特定的支持，并通过AnalogGyro类为更广泛的模拟输入陀螺仪提供了更普遍的支持。

source: The Gyro interface
tr_tr: The Gyro interface-Arayüzü
zh_cn: Gyro接口

source: All natively-supported gyro objects in WPILib implement the :code:`Gyro` interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/interfaces/Gyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Gyro.html>`__). This interface provides methods for getting the current angular rate and heading, zeroing the current heading, and calibrating the gyro.
tr_tr: WPILib'de yerel olarak desteklenen tüm gyro nesneleri :code:`Gyro` interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/interfaces/Gyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Gyro.html>`__) uygular. Bu arayüz, mevcut açısal hızı ve istikameti elde etmek, mevcut istikameti sıfırlamak ve jiroskopu kalibre etmek için yöntemler sağlar.
zh_cn: WPILib中所有本地支持的陀螺对象都实现了该Gyro接口（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/interfaces/Gyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Gyro.html>`__）。该接口提供了获取当前角速度和航向，将当前航向归零以及校准陀螺仪的方法。

source: It is crucial that the robot remain stationary while calibrating a gyro.
tr_tr: Bir jiroskopu kalibre ederken robotun sabit kalması çok önemlidir.
zh_cn: 在校准陀螺仪时，让机器人保持静止至关重要。

source: The :code:`ADXRS450_Gyro` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXRS450_Gyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXRS450__Gyro.html>`__) provides support for the Analog Devices ADXRS450 gyro available in the kit of parts, which connects over the SPI bus.
tr_tr: :code:`ADXRS450_Gyro` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXRS450_Gyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXRS450__Gyro.html>`__) SPI veriyolu üzerinden bağlanan parça setinde bulunan Analog Devices ADXRS450 gyro için destek sağlar.
zh_cn: ADXRS450_Gyro类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/ADXRS450_Gyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1ADXRS450__Gyro.html>`__）为连接到SPI总线的ADXRS450提供支持。

source: ADXRS450 Gyro accumulation is handled through special circuitry in the FPGA; accordingly only a single instance of :code:`ADXRS450_Gyro` may be used.
tr_tr: ADXRS450 Gyro birikimi, FPGA'daki özel devre sistemi aracılığıyla gerçekleştirilir; buna göre :code:`ADXRS450_Gyro` nun yalnızca tek bir örneği kullanılabilir.
zh_cn: ADXRS450陀螺仪的累加通过FPGA中的特殊电路处理；因此，只能使用一个ADXRS450_Gyro实例。

source: AnalogGyro
zh_cn: 模拟陀螺仪

source: The :code:`AnalogGyro` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogGyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogGyro.html>`__) provides support for any single-axis gyro with an analog output.
tr_tr: :code:`AnalogGyro` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogGyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogGyro.html>`__), analog çıkışlı herhangi bir tek eksenli gyro için destek sağlar.
zh_cn: AnalogGyro类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/AnalogGyro.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1AnalogGyro.html>`__）提供了用于任何具有模拟输出的单轴陀螺仪的支持。

source: Gyro accumulation is handled through special circuitry in the FPGA; accordingly, :code:`AnalogGyro`\`s may only be used on analog ports 0 and 1.
tr_tr: Gyro birikimi, FPGA'daki özel devreler aracılığıyla gerçekleştirilir; buna göre, :code:`AnalogGyro`\`lar yalnızca 0 ve 1 analog bağlantı noktalarında kullanılabilir.
zh_cn: 陀螺仪的积累是通过FPGA中的特殊电路来处理的。因此，AnalogGyro只能在模拟端口0和1上使用。

source: Third-party gyros
tr_tr: Üçüncü-parti gyros
zh_cn: 第三方陀螺仪

source: While WPILib provides native support for a the ADXRS450 gyro available in the kit of parts and for any analog gyro, there are a few popular AHRS (Attitude and Heading Reference System) devices commonly used in FRC\ |reg| that include accelerometers and require more complicated communications. These are generally controlled through vendor libraries.
tr_tr: WPILib, parça kitinde ve herhangi bir analog gyro için mevcut bir ADXRS450 gyro için yerel destek sağlarken, FRC \ |reg| 'da yaygın olarak kullanılan birkaç popüler AHRS (Attitude and Heading Reference System-Tutum ve Yön Referans Sistemi) cihazı vardır. ivmeölçerler içeren ve daha karmaşık iletişim gerektiren. Bunlar genellikle satıcı kitaplıkları aracılığıyla kontrol edilir.
zh_cn: 尽管WPILib为零件套件中提供的ADXRS450陀螺仪以及任何模拟陀螺仪提供了本地支持，但FRC中普遍使用了一些流行的AHRS（姿态航向参考系统）设备，其中包括加速度计，并且需要更复杂的通信。这些通常通过供应商库进行控制。

source: Using gyros in code
zh_cn: 在代码中使用陀螺仪

source: As gyros measure rate rather than position, position is inferred by integrating (adding up) the rate signal to get the total change in angle. Thus, gyro angle measurements are always relative to some arbitrary zero angle (determined by the angle of the gyro when either the robot was turned on or a zeroing method was called), and are also subject to accumulated errors (called "drift") that increase in magnitude the longer the gyro is used. The amount of drift varies with the type of gyro.
tr_tr: Jiroskoplar konumdan ziyade hızı ölçtüğü için konum, açıdaki toplam değişikliği elde etmek için hız sinyalini entegre ederek (toplayarak) hesaplar. Bu nedenle, jiroskop açısı ölçümleri her zaman bazı gelişigüzel sıfır açılar ile ilişkilidir (robot açıldığında veya bir sıfırlama yöntemi çağrıldığında jiroskopun açısıyla belirlenir) ve aynı zamanda birikmiş hatalara ("kayma-drift" denir) tabidir. Cayro ne kadar uzun kullanılırsa büyüklükte artış olur. Sürüklenme miktarı jiroskopun türüne göre değişir.
zh_cn: 当陀螺仪测量速率而不是位置时，通过积分（累加）速率信号以获得总角度变化来推断位置。因此，陀螺仪角度测量始终相对于某个任意零角度（由打开机器人或调用调零方法时的陀螺仪角度确定），并且还会受到累积误差（称为“漂移”）的影响，陀螺仪使用的时间越长，幅度增加。漂移量随陀螺仪的类型而变化。

source: Gyros are extremely useful in FRC for both measuring and controlling robot heading. Since FRC matches are generally short, total gyro drift over the course of an FRC match tends to be manageably small (on the order of a couple of degrees for a good-quality gyro). Moreover, not all useful gyro applications require the absolute heading measurement to remain accurate over the course of the entire match.
tr_tr: Jiroskoplar, FRC'de robot yönünü hem ölçmek hem de kontrol etmek için son derece kullanışlıdır. FRC maçları genellikle kısa olduğundan, bir FRC maçı boyunca toplam jiroskop kayması idare edilebilir derecede küçük olma eğilimindedir (kaliteli bir jiroskop için birkaç derece düzeyinde). Dahası, tüm yararlı jiroskop uygulamaları, mutlak baş yönü ölçümünün tüm maç boyunca doğru kalmasını gerektirmez.
zh_cn: 陀螺仪在FRC中对于测量和控制机器人航向极为有用。由于FRC比赛通常很短，因此在FRC比赛过程中总的陀螺仪漂移较小（对于高质量的陀螺仪，大约为几度）。此外，并非所有有用的陀螺仪应用都需要绝对航向测量值才能在整个比赛过程中保持准确。

source: Displaying the robot heading on the dashboard
tr_tr: Kontrol panelinde robot yönünün görüntülenmesi
zh_cn: 在dashboard上显示机器人标题

source: :ref:`Shuffleboard <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>` includes a widget for displaying heading data from a :code:`Gyro` in the form of a compass. This can be helpful for viewing the robot heading when sight lines to the robot are obscured:
tr_tr: :ref:`Shuffleboard <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>`, a :code:`Gyro` dan yön verilerini pusula biçiminde görüntülemek için bir widget içerir . Bu, robota yönelik görüş çizgileri gizlendiğinde robotun yönünü görüntülemek için yararlı olabilir:
zh_cn: :ref:`Shuffleboard <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>`包含一个小部件，用于以指南针的形式显示来自Gyro的航向数据。当遮挡机器人的视线时，这有助于查看机器人的前进方向：

source: Stabilizing heading while driving
tr_tr: Sürerken yönü sabitlemek - kararlı hale getirmek
zh_cn: 驾驶时稳定航向

source: A very common use for a gyro is to stabilize robot heading while driving, so that the robot drives straight. This is especially important for holonomic drives such as mecanum and swerve, but is extremely useful for tank drives as well.
tr_tr: Bir jiroskop için çok yaygın bir kullanım, robotun düz hareket etmesi için sürüş sırasında robotun yönünü stabilize etmektir. Bu, özellikle mecanum ve swerve gibi holonomik sürücüler için önemlidir, ancak tank sürücüleri için de son derece kullanışlıdır.
zh_cn: 陀螺仪的一个非常普遍的用途是在行驶时稳定机器人的前进方向，以使机器人直行。这对于完整的底盘（例如麦克纳姆和swerve）特别重要，但对于坦克型底盘也非常有用。

source: This is typically achieved by closing a PID controller on either the turn rate or the heading, and piping the output of the loop to one's turning control (for a tank drive, this would be a speed differential between the two sides of the drive).
tr_tr: Bu, tipik olarak, dönüş hızı veya yön üzerindeki bir PID kontrol cihazının kapatılması ve döngünün çıkışının bir kişinin dönüş kontrolüne aktarılmasıyla elde edilir (bir tank sürücüsü için, sürücünün iki tarafı arasında bir hız farkı olacaktır).
zh_cn: 通常可以通过关闭转率或航向上的PID控制器，然后传递转向控制回路的输出来实现（对于坦克底盘，这是驱动器两侧之间的速度差）。

source: Like with all control loops, users should be careful to ensure that the sensor direction and the turning direction are consistent. If they are not, the loop will be unstable and the robot will turn wildly.
tr_tr: Tüm kontrol döngülerinde olduğu gibi, kullanıcılar sensör yönünün ve dönüş yönünün tutarlı olmasını sağlamak için dikkatli olmalıdır. Aksi takdirde, döngü dengesiz olacak ve robot çılgınca dönecektir.
zh_cn: 与所有控制回路一样，用户应注意确保传感器方向和旋转方向一致。如果不是这样，则回路将变得不稳定，并且机器人将疯狂旋转。

source: Example: Tank drive stabilization using turn rate
tr_tr: Örnek: Dönüş oranı kullanarak tank sürüşü stabilizasyonu
zh_cn: 示例：使用转弯率稳定坦克底盘

source: The following example shows how to stabilize heading using a simple P loop closed on the turn rate. Since a robot that is not turning should have a turn rate of zero, the setpoint for the loop is implicitly zero, making this method very simple.
tr_tr: Aşağıdaki örnek, dönüş hızında kapatılan basit bir P döngüsü kullanılarak istikametin nasıl dengeleneceğini gösterir. Dönmeyen bir robotun dönüş oranının sıfır olması gerektiğinden, döngü için ayar noktası örtük olarak sıfırdır, bu da bu yöntemi çok basit hale getirir.
zh_cn: 以下示例展示了如何使用转弯速率的简单P环来稳定航向。由于不转弯的机器人的转弯速率应为零，因此回路的设定点为零，这使得此方法非常简单。

source: More-advanced implementations can use a more-complicated control loop. When closing the loop on the turn rate for heading stabilization, PI loops are particularly effective.
tr_tr: Daha gelişmiş uygulamalar, daha karmaşık bir kontrol döngüsü kullanabilir. Yön sabitlemesi için dönüş hızında döngüyü kapatırken, PI döngüleri özellikle etkilidir.
zh_cn: 更高级的实现可以使用更复杂的控制回路。当关闭转向角的回路以稳定航向时，PI环路特别有效。

source: Example: Tank drive stabilization using heading
tr_tr: Örnek: Yön kullanarak tank sürüşü stabilizasyonu
zh_cn: 示例：使用航向稳定坦克底盘

source: The following example shows how to stabilize heading using a simple P loop closed on the heading. Unlike in the turn rate example, we will need to set the setpoint to the current heading before starting motion, making this method slightly more-complicated.
tr_tr: Aşağıdaki örnek, pruva yönü kapalı basit bir P döngüsü kullanılarak istikameti nasıl stabilize edeceğinizi gösterir. Dönüş oranı örneğinden farklı olarak, harekete başlamadan önce ayar noktasını mevcut rotaya ayarlamamız gerekecek ve bu da bu yöntemi biraz daha karmaşık hale getirecektir.
zh_cn: 下面的示例显示如何使用在标题上闭合的简单P循环来稳定航向。与转弯速率示例不同，我们将需要在开始运动之前将设定点设置为当前航向，这会使此方法更加复杂。

source: More-advanced implementations can use a more-complicated control loop. When closing the loop on the heading for heading stabilization, PD loops are particularly effective.
tr_tr: Daha gelişmiş uygulamalar, daha karmaşık bir kontrol döngüsü kullanabilir. Yön stabilizasyonu başlığındaki döngüyü kapatırken, PD döngüleri özellikle etkilidir.
zh_cn: 更高级的实现可以使用更复杂的控制循环。当关闭航向上的回路以稳定航向时，PD回路特别有效。

source: Turning to a set heading
tr_tr: Belirli bir yöne dönmek
zh_cn: 转到设定的方向

source: Another common and highly-useful application for a gyro is turning a robot to face a specified direction. This can be a component of an autonomous driving routine, or can be used during teleoperated control to help align a robot with field elements.
tr_tr: Bir jiroskop için diğer yaygın ve oldukça kullanışlı bir uygulama, bir robotu belirli bir yöne bakacak şekilde döndürmektir. Bu, otonom bir sürüş rutininin bir bileşeni olabilir veya bir robotu saha öğeleriyle hizalamaya yardımcı olmak için uzaktan kumanda sırasında kullanılabilir.
zh_cn: 陀螺仪的另一个常见且有用的使用是使机器人面向特定方向旋转。这可以是自动阶段驾驶例程的组成部分，也可以在遥控操作过程中使用，以帮助将机器人与现场物体对准。

source: Much like with heading stabilization, this is often accomplished with a PID loop - unlike with stabilization, however, the loop can only be closed on the heading. The following example code will turn the robot to face 90 degrees with a simple P loop:
tr_tr: Yön stabilizasyonunda olduğu gibi, bu genellikle bir PID döngüsü ile gerçekleştirilir - ancak stabilizasyonun aksine, döngü yalnızca yön üzerinde dönebilir. Aşağıdaki örnek kod, robotu basit bir P döngüsü ile 90 dereceye bakacak şekilde döndürecektir:
zh_cn: 与航向稳定非常相似，这通常是通过PID回路实现的-与稳定不同，但是，该回路只能在航向上闭合。以下示例代码将通过一个简单的P环将机器人面向90度：

source: As before, more-advanced implementations can use more-complicated control loops.
tr_tr: Daha önce olduğu gibi, daha gelişmiş uygulamalar daha karmaşık kontrol döngüleri kullanabilir.
zh_cn: 和以前一样，更高级的实现可以使用更复杂的控制循环。

source: Turn-to-angle loops can be tricky to tune correctly due to static friction in the drivetrain, especially if a simple P loop is used. There are a number of ways to account for this; one of the most common/effective is to add a "minimum output" to the output of the control loop. Another effective strategy is to cascade to well-tuned velocity controllers on each side of the drive.
tr_tr: Özellikle basit bir P döngüsü kullanılıyorsa, güç aktarma sistemindeki statik sürtünme nedeniyle açıya dönüş döngülerinin doğru şekilde ayarlanması zor olabilir. Bunu açıklamanın birkaç yolu vardır; en yaygın/etkili olanlardan biri, kontrol döngüsünün çıkışına bir "minimum çıktı" eklemektir. Diğer bir etkili strateji, sürücünün her iki tarafında iyi ayarlanmış hız kontrolörlerine kademeli olarak yerleştirmektir.
zh_cn: 由于传动系统中的静摩擦，转向角度的回路可能很难正确调整，尤其是在使用简单的P环路的情况下。有很多方法可以解决这个问题。最常见/最有效的方法之一是在控制回路的输出上添加“最小输出”。另一种有效的方法是在驱动器的每一侧连接调优的速度控制器。
