Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/sensors/sensor-overview-software.po
Languages: es_mx, fr_ca, zh_cn

source: Sensor Overview - Software
es_mx: Descripción general del sensor- software
fr_ca: Un bref aperçu du logiciel associé aux capteurs
zh_cn: 传感器概述-软件

source: This section covers using sensors in software. For a guide to sensor hardware, see :ref:`docs/hardware/sensors/sensor-overview-hardware:Sensor Overview - Hardware`.
es_mx: Esta sección cubre el uso de sensores en el software. Para obtener una guía sobre el hardware del sensor, vea :ref:`docs/hardware/sensors/sensor-overview-hardware:Sensor Overview - Hardware`.
fr_ca: Cette section couvre l'usage des capteurs dans le logiciel. Pour un guide sur le branchement électrique des capteurs, voir :ref:`docs/hardware/sensors/sensor-overview-hardware:Sensor Overview - Hardware`.
zh_cn: 本节介绍如何在软件中使用传感器。有关传感器硬件的指南，请参阅:ref:`docs/hardware/sensors/sensor-overview-hardware:Sensor Overview - Hardware`。

source: While cameras may definitely be considered "sensors", vision processing is a sufficiently-complicated subject that it is covered in :ref:`its own section <docs/software/vision-processing/introduction/strategies-for-vision-programming:Strategies for Vision Programming>`, rather than here.
es_mx: Si bien las cámaras definitivamente pueden considerarse "sensores", el procesamiento de la visión es un tema suficientemente complicado que está cubierto :ref:`en su propia sección <docs/software/vision-processing/introduction/strategies-for-vision-programming:Strategies for Vision Programming>`, en vez de aquí.
fr_ca: Alors que les caméras peuvent certainement être considérées comme des "capteurs", le traitement de la vision est un sujet suffisamment compliqué pour être traité dans :ref:`sa propre section <docs/software/vision-processing/introduction/strategies-for-vision-programming:Strategies for Vision Programming>`, plutôt qu'ici.
zh_cn: 虽然相机可以被视为“传感器”，但视觉处理是一个非常复杂的问题，所以它将在单独的版块中介绍。

source: In order to be effective, it is often vital for robots to be able to gather information about their surroundings. Devices that provide feedback to the robot on the state of its environment are called "sensors." WPILib innately supports a large variety of sensors through classes included in the library. This section will provide a guide to both using common sensor types through WPILib, as well as writing code for sensors without official support.
es_mx: Para ser efectivo, a menudo es vital que los robots puedan recopilar información sobre sus alrededores. Los dispositivos que proporcionan información al robot sobre el estado de su entorno son llamados "sensores". WPILib admite de forma innata una gran variedad de sensores a través de clases incluidas en la biblioteca. Esta sección proporcionará una guía para usar ambos tipos de sensores comunes a través de WPILib, así como escribir código para sensores sin soporte oficial.
fr_ca: Pour être efficace, il est souvent vital pour les robots de pouvoir obtenir des informations sur leur environnement. Les dispositifs qui fournissent au robot des informations sur l'état de son environnement sont appelés «capteurs». WPILib prend en charge de manière innée une grande variété de capteurs via des classes incluses dans ses librairies. Cette section fournira un guide à la fois sur l'utilisation des types de capteurs courants via WPILib, ainsi que sur l'écriture de code pour les capteurs sans support officiel.
zh_cn: 为了完成目标，机器人通常必须要收集周围环境的信息。向机器人提供有关环境状态的反馈的设备称为“传感器”。WPILib通过库中包含的各个类支持各种传感器。本节将提供通过WPILib使用常见的传感器，以及为没有官方支持的传感器编写代码的指南。

source: What sensors does WPILIB support?
es_mx: ¿Qué sensores admite WPILIB?
fr_ca: Quels capteurs WPILIB prend-il en charge?
zh_cn: WPILIB支持哪些传感器？

source: The roboRIO includes a `FPGA <https://en.wikipedia.org/wiki/Field-programmable_gate_array>`__ which allows accurate real-time measuring of a variety of sensor input. WPILib, in turn, provides a number of classes for accessing this functionality.
es_mx: La roboRIO incluye un `FPGA <https://en.wikipedia.org/wiki/Field-programmable_gate_array>`__ que permite la medición precisa en tiempo real de una variedad de sensores de entrada. WPILib, a su vez, proporciona una serie de clases para acceder a esta funcionalidad.
fr_ca: Le roboRIO comprend un `FPGA <https://en.wikipedia.org/wiki/Field-programmable_gate_array>`__ qui permet une mesure précise en temps réel d'une variété d'entrées de capteurs. WPILib, à son tour, fournit un certain nombre de classes pour accéder à cette fonctionnalité.
zh_cn: roboRIO包含`FPGA <https://en.wikipedia.org/wiki/Field-programmable_gate_array>`__ ，可以实时精确测量各种传感器的输入。WPILib提供了许多用于访问此功能的类。

source: WPILib provides native support for:
es_mx: WPILib proporciona soporte nativo para:
fr_ca: WPILib fournit un support intégré pour les capteurs suivants:
zh_cn: WPILib为以下传感器提供本地支持：

source: :ref:`Accelerometers <docs/software/sensors/accelerometers-software:Accelerometers - Software>`
es_mx: :ref:`Acelerometros <docs/software/sensors/accelerometers-software:Accelerometers - Software>`
fr_ca: :ref:`Accéléromètres <docs/software/sensors/accelerometers-software:Accelerometers - Software>`
zh_cn: :ref:`加速度计 <docs/software/sensors/accelerometers-software:Accelerometers - Software>`

source: :ref:`Gyroscopes <docs/software/sensors/gyros-software:Gyroscopes - Software>`
es_mx: :ref:`Giroscopios <docs/software/sensors/gyros-software:Gyroscopes - Software>`
zh_cn: :ref:`陀螺仪 <docs/software/sensors/gyros-software:Gyroscopes - Software>`

source: :ref:`Ultrasonic rangefinders <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`
es_mx: :ref:`Telémetros ultrasónicos <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`
fr_ca: :ref:`Télémètres à ultrasons <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`
zh_cn: :ref:`超声波测距仪 <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`

source: :ref:`Potentiometers <docs/software/sensors/analog-potentiometers-software:Analog Potentiometers - Software>`
es_mx: :ref:`Potenciómetros <docs/software/sensors/analog-potentiometers-software:Analog Potentiometers - Software>`
fr_ca: :ref:`Potentiomètres <docs/software/sensors/analog-potentiometers-software:Analog Potentiometers - Software>`
zh_cn: :ref:`电位计 <docs/software/sensors/analog-potentiometers-software:Analog Potentiometers - Software>`

source: :ref:`Counters <docs/software/sensors/counters:Counters>`
es_mx: :ref:`Contadores <docs/software/sensors/counters:Counters>`
fr_ca: :ref:`Compteurs <docs/software/sensors/counters:Counters>`
zh_cn: :ref:`计数器 <docs/software/sensors/counters:Counters>`

source: :ref:`Quadrature encoders <docs/software/sensors/encoders-software:Encoders - Software>`
es_mx: :ref:`Codificadores de cuadratura <docs/software/sensors/encoders-software:Encoders - Software>`
fr_ca: :ref:`Codeurs en quadrature <docs/software/sensors/encoders-software:Encoders - Software>`
zh_cn: :ref:`正交编码器 <docs/software/sensors/encoders-software:Encoders - Software>`

source: :ref:`Limit switches <docs/software/sensors/digital-inputs-software:Digital Inputs - Software>`
fr_ca: :ref:`Interrupteurs de fin de course <docs/software/sensors/digital-inputs-software:Digital Inputs - Software>`
zh_cn: :ref:`限制开关 <docs/software/sensors/digital-inputs-software:Digital Inputs - Software>`

source: Additionally, WPILib includes lower-level classes for interfacing directly with the FPGA's digital and analog inputs and outputs.
es_mx: Además, WPILib incluye clases de nivel inferior para interactuar directamente con las entradas y salidas digitales y analógicas de FPGA.
fr_ca: De plus, WPILib comprend des classes de niveau inférieur pour une interface directe avec les entrées et sorties numériques et analogiques du FPGA.
zh_cn: 此外，WPILib包含直接连接FPGA的数字和模拟输入输出的低级类。
