Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/sensors/ultrasonics-software.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Ultrasonics - Software
es_mx: Ultrasónicos - Software
fr_ca: Ultrasons - Partie logicielle
tr_tr: Ultrasonics - Yazılım
zh_cn: 超声波测距仪-软件

source: This section covers ultrasonics in software. For a hardware guide to ultrasonics, see :ref:`docs/hardware/sensors/ultrasonics-hardware:Ultrasonics - Hardware`.
es_mx: Esta sección cubre los ultrasónicos en software. Para obtener una guía de hardware para ultrasónicos, consulte :ref:`docs/hardware/sensors/ultrasonics-hardware:Ultrasonics - Hardware`.
fr_ca: Cette section couvre le logiciel relatif aux capteurs ultrasoniques. Pour un guide sur le branchement électrique des capteurs à ultrasons, voir :ref:`docs/hardware/sensors/ultrasonics-hardware:Ultrasonics - Hardware`.
tr_tr: Bu bölüm, yazılımdaki ultrasonikleri kapsar. Ultrasonik donanım kılavuzu için bkz :ref:`docs/hardware/sensors/ultrasonics-hardware:Ultrasonics - Hardware`.
zh_cn: 本节介绍软件中的超声波测距仪。有关超声波测距仪的硬件指南，请参见:ref:`docs/hardware/sensors/ultrasonics-hardware:Ultrasonics - Hardware`。

source: An ultrasonic sensor is commonly used to measure distance to an object using high-frequency sound. Generally, ultrasonics measure the distance to the closest object within their "field of view."
es_mx: Un sensor ultrasónico se usa comúnmente para medir la distancia a un objeto usando sonido de alta frecuencia. Generalmente, los ultrasónicos miden la distancia al objeto más cercano dentro de su "campo de visión".
fr_ca: Un capteur à ultrasons est couramment utilisé pour mesurer la distance à un objet à l'aide d'un son haute fréquence. En règle générale, les capteurs à ultrasons mesurent la distance de l'objet le plus rapproché dans leur «champ de vision».
tr_tr: Yüksek frekanslı ses kullanarak bir nesneye olan mesafeyi ölçmek için genellikle ultrasonik bir sensör kullanılır. Genel olarak, ultrasonik "field of view-görüş alanı" içinde en yakın nesneye olan mesafeyi ölçer.
zh_cn: 超声波传感器通常用于使用高频声音测量到物体的距离。通常，超声波测量在其“视场”内到最近物体的距离。

source: There are two primary types of ultrasonics supported natively by WPILib:
es_mx: Hay dos tipos principales de ultrasónicos compatibles de forma nativa con WPILib:
fr_ca: Il existe deux principaux types d'ultrasons pris en charge nativement par WPILib:
tr_tr: WPILib tarafından yerel olarak desteklenen iki ana ultrasonik türü vardır:
zh_cn: WPILib本地支持两种主要的超声波类型：

source: `Ping-response ultrasonics`_
fr_ca: `Capteurs à ultrasons à réponse Ping`_
zh_cn: `响应式超声波测距仪`_

source: `Analog ultrasonics`_
fr_ca: `Capteurs à ultrasons analogiques`_
zh_cn: `模拟超声波测距仪`_

source: Ping-response ultrasonics
es_mx: Ultrasónicos de respuesta de ping
fr_ca: Capteurs à réponse ping
tr_tr: Ping yanıtlı ultrasonik sensörler
zh_cn: 响应式超声波测距仪

source: The :code:`Ultrasonic` class (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/Ultrasonic.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1Ultrasonic.html>`__) provides support for ping-response ultrasonics. As ping-response ultrasonics (per the: name) require separate pins for both spending the ping and measuring the response, users must specify DIO pin numbers for both output and input when constructing an :code:`Ultrasonic` instance:
fr_ca: La classe :code:`Ultrasonic` class (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/Ultrasonic.html>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1Ultrasonic.html>`__) prend en charge les ultrasons à réponse ping. Comme les ultrasons à réponse ping (selon le: nom) nécessitent des broches distinctes pour émettre le ping et mesurer la réponse à celui-ci (écho), les utilisateurs doivent spécifier des numéros de broches DIO pour la sortie et l'entrée lors de la construction d'une instance :code:`Ultrasonic`:

source: It is highly recommended to use ping-response ultrasonics in "automatic mode," as this will allow WPILib to ensure that multiple sensors do not interfere with each other:
es_mx: Se recomienda encarecidamente utilizar ultrasónicos de respuesta de ping en "modo automático", ya que esto permitirá a WPILib garantizar que varios sensores no interfieran entre sí:
fr_ca: Il est fortement recommandé d'utiliser les ultrasons à réponse ping en "mode automatique", car cela permettra à WPILib de s'assurer que plusieurs capteurs n'interfèrent pas entre eux:
tr_tr: "Otomatik modda" ping yanıtı ultrasoniklerinin kullanılması şiddetle tavsiye edilir, çünkü bu, WPILib'in birden fazla sensörün birbirini engellememesini sağlamasına olanak tanır:
zh_cn: 强烈建议在“自动模式”下使用ping响应超声波，因为这将使WPILib确保多个传感器不会相互干扰：

source: Analog ultrasonics
es_mx: Ultrasónicos analógicos
fr_ca: Capteurs à ultrasons analogiques
tr_tr: Analog ultrasonik sensörler
zh_cn: 模拟超声波测距仪

source: Some ultrasonic sensors simply return an analog voltage corresponding to the measured distance. These sensors can may simply be used with the :doc:`AnalogPotentiometer <analog-potentiometers-software>` class.
es_mx: Algunos sensores ultrasónicos simplemente devuelven un voltaje analógico correspondiente a la distancia medida. Estos sensores se pueden utilizar simplemente con la clase :doc:`AnalogPotentiometer <analog-potentiometers-software>` .
fr_ca: Certains capteurs à ultrasons renvoient simplement une tension analogique correspondant à la distance mesurée. Ces capteurs peuvent être simplement utilisés avec la classe :doc:`AnalogPotentiometer <analog-potentiometers-software>`
tr_tr: Bazı ultrasonik sensörler, ölçülen mesafeye karşılık gelen bir analog voltajı döndürür. Bu sensörler basitçe şu şekilde kullanılabilir :doc:`AnalogPotentiometer <analog-potentiometers-software>` sınıfı.
zh_cn: 一些超声波传感器仅返回与测量距离相对应的模拟电压。这些传感器可以简单地与AnalogPotentiometer类一起使用。

source: Third-party ultrasonics
es_mx: Ultrasónicos de terceros
fr_ca: Capteurs ultrasoniques en provenance de tierce partie
tr_tr: Third-party ultrasonics-Üçüncü taraf ultrasonik sensörler
zh_cn: 第三方超声波测距仪

source: Other ultrasonic sensors offered by third-parties may use more complicated communications protocols (such as I2C or SPI). WPILib does not provide native support for any such ultrasonics; they will typically be controlled with vendor libraries.
es_mx: Otros sensores ultrasónicos ofrecidos por terceros pueden utilizar protocolos de comunicación más complicados (como I2C o SPI). WPILib no proporciona soporte nativo para tales ultrasónicos; normalmente se controlarán con bibliotecas de proveedores.
fr_ca: D'autres capteurs à ultrasons proposés par certains manufacturiers peuvent utiliser des protocoles de communication plus complexes (comme I2C ou SPI). WPILib ne fournit pas de support intégré pour ces capteurs à ultrasons; ils seront généralement contrôlés avec les librairies des fournisseurs.
tr_tr: Üçüncü taraflarca sunulan diğer ultrasonik sensörler, daha karmaşık iletişim protokolleri (I2C veya SPI gibi) kullanabilir. WPILib bu tür ultrasonikler için yerel destek sağlamaz; tipik olarak satıcı kitaplıkları ile kontrol edilecekler.
zh_cn: 第三方提供的其他超声传感器可能使用更复杂的通信协议（例如I2C或SPI）。WPILib不为任何此类超声波提供本地支持；它们通常将由供应商库控制。

source: Using ultrasonics in code
es_mx: Usando ultrasónicos en código
fr_ca: Utiliser les capteurs ultrasoniques dans le code
tr_tr: Ultrasonik sensör kodu kullanma
zh_cn: 在代码中使用超声波测距仪

source: Ultrasonic sensors are very useful for determining spacing during autonomous routines. For example, the following code will drive the robot forward until the ultrasonic measures a distance of 12 inches to the nearest object, and then stop:
fr_ca: Les capteurs à ultrasons sont très utiles pour déterminer la distance entre un objet et le robot lors de routines autonomes. Par exemple, le code suivant fera avancer le robot jusqu'à ce que le capteur ultrasonique mesure une distance de 12 pouces (30cm) entre lui et l'objet le plus proche, et ensuite, immobilise le robot:

source: Additionally, ping-response ultrasonics can be sent to :ref:`Shuffleboard <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>`, where they will be displayed with their own widgets:
es_mx: Además, los ultrasónicos de respuesta de ping se pueden enviar a :ref:`Shuffleboard <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>`, donde se mostrarán con sus propios widgets:
fr_ca: De plus, les ultrasons à réponse ping peuvent être envoyés à :ref:`Shuffleboard <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>`, où ils seront affichés avec leurs propres widgets:
tr_tr: Ek olarak, ping yanıtı ultrasonikleri şu adrese gönderilebilir :ref:`Shuffleboard <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>`, burada kendi widgetleri ile görüntülenecekler:
zh_cn: 此外，可以将响应式超声波测距仪发送到:ref:`Shuffleboard <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>`，将以小部件显示它们：

source: The :code:`Ultrasonic` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Ultrasonic.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Ultrasonic.html>`__) provides support for ping-response ultrasonics. As ping-response ultrasonics (per the: name) require separate pins for both spending the ping and measuring the response, users must specify DIO pin numbers for both output and input when constructing an :code:`Ultrasonic` instance:
es_mx: La clase :code:`Ultrasonic` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Ultrasonic.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Ultrasonic.html>`__) proporciona soporte para ultrasonidos de respuesta a ping. Dado que los ultrasonidos de respuesta a ping (per the: name) requieren pines separados tanto para pasar el ping como para medir la respuesta, los usuarios deben especificar los números de pines DIO tanto para la salida como para la entrada cuando construyan una instancia :code:`Ultrasonic`.
tr_tr: :code:`Ultrasonic` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Ultrasonic.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Ultrasonic.html>`__), ping yanıtı ultrasonikleri için destek sağlar. Ping yanıtı ultrasonikleri (: adına göre) hem ping'i harcamak hem de yanıtı ölçmek için ayrı pinler gerektirdiğinden, kullanıcılar bir:code:`Ultrasonic` örneği oluştururken hem çıkış hem de giriş için DIO pin numaralarını belirtmelidir:
zh_cn: Ultrasonic类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Ultrasonic.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Ultrasonic.html>`__）提供了响应式超声波测距仪的支持。由于响应式超声波测距仪（按名称）需要使用单独的引脚来发送脉冲和测量响应，因此在构造Ultrasonic实例时，用户必须为输出和输入指定DIO引脚号：

source: Ultrasonic sensors are very useful for determining spacing during autonomous routines. For example, the following code will drive the robot forward until the ultrasonic measures a distance of 12 inches (~30 cm) to the nearest object, and then stop:
es_mx: Los sensores ultrasónicos son muy útiles para determinar el espaciado durante las rutinas autónomas. Por ejemplo, el siguiente código impulsará al robot hacia adelante hasta que el ultrasónico mida una distancia de 12 pulgadas (~30 cm) hasta el objeto más cercano y luego se detenga:
tr_tr: Ultrasonik sensörler, otonom rutinler sırasında aralığı belirlemek için çok kullanışlıdır. Örneğin, aşağıdaki kod, ultrasonik en yakın nesneye 12 inç (~ 30 cm) kadar bir mesafe ölçene kadar robotu ileri götürür ve sonra durur:
zh_cn: 超声波传感器对于确定自动阶段程序中的间距非常有用。例如，以下代码将驱动机器人前进，直到超声波测量到最近的物体12英寸（〜30厘米）的距离，然后停止：
