Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-simulation/device-sim.po
Languages: es_mx, fr_ca, zh_cn

source: Device Simulation
es_mx: Simulación de Dispositivos
fr_ca: Périphérique de simulation
zh_cn: 设备仿真

source: WPILib provides a way to manage simulation device data in the form of the SimDevice API.
es_mx: WPILib proporciona una forma de gestionar los datos de los dispositivos de simulación en forma de la API SimDevice.
fr_ca: WPILib offre un moyen de gérer les données du périphérique de simulation sous la forme de l’API SimDevice
zh_cn: WPILib提供了一种以SimDevice API形式管理仿真设备数据的方法。

source: Simulating Core WPILib Device Classes
es_mx: Simulación de las clases de dispositivos del núcleo WPILib
fr_ca: Simulation des classes fondamentales de l'infrastructure WPILib
zh_cn: 模拟核心WPILib设备类

source: Core WPILib device classes (i.e ``Encoder``, ``Ultrasonic``, etc.) have simulation classes named ``EncoderSim``, ``UltrasonicSim``, and so on. These classes allow interactions with the device data that wouldn't be possible or valid outside of simulation. Constructing them outside of simulation likely won't interfere with your code, but calling their functions and the like is undefined behavior - in the best case they will do nothing, worse cases might crash your code! Place functional simulation code in simulation-only functions (such as ``simulationPeriodic()``) or wrap them with ``RobotBase.isReal()``/ ``RobotBase::IsReal()`` checks (which are ``constexpr`` in C++).
es_mx: Las clases principales de dispositivos WPILib (por ejemplo, ``Encoder``, ``Ultrasonic``, etc.) tienen clases de simulación llamadas ``EncoderSim``, ``UltrasonicSim``, etc. Estas clases permiten interacciones con los datos del dispositivo que no serían posibles o válidas fuera de la simulación. Construirlas fuera de la simulación probablemente no interferirá con tu código, pero llamar a sus funciones y similares es un comportamiento indefinido - en el mejor de los casos no harán nada, ¡en los peores casos podrían bloquear su código! Coloque el código de simulación funcional en funciones sólo de simulación (como ``simulationPeriodic()``) o envuélvalas con comprobaciones ``RobotBase.isReal()``/ ``RobotBase::IsReal()`` (que son ``constexpr`` en C++).
fr_ca: Les classes fondamentales de l'infrastructure WPILib (c.-à-d. ``Encoder``, ``Ultrasonic``, etc.) ont des classes de simulation nommées ``EncoderSim``, ``UltrasonicSim``, etc. Ces classes permettent des interactions avec les données du simulateur qui ne seraient pas possibles ou valides en dehors de la simulation. Les construire en dehors de la simulation n’interférera probablement pas avec votre code, mais appeler leurs fonctions et autres est un comportement non défini - dans le meilleur des cas, ils ne feront rien, les cas pires quant à eux pourraient planter votre code! Placez le code de simulation fonctionnelle dans des fonctions de simulation uniquement (telles que ``simulationPeriodic()``) ou enveloppez-les avec ``RobotBase.isReal()``/ ``RobotBase::IsReal()`` checks (qui sont ``constexpr`` en C++).
zh_cn: 核心WPILib设备类（即``Encoder''，``Ultrasonic''等）具有名为``EncoderSim''，``UltrasonicSim''等的仿真类。这些类允许与设备数据进行交互，而这些交互在模拟之外是不可能的或无效的。在模拟之外构造它们可能不会干扰您的代码，但是调用它们的函数等是未定义的行为-最好的情况下，它们什么都不做，更糟的情况可能会使您的代码崩溃！将功能仿真代码放在仅仿真功能中（例如simulationPeriodic（））或用RobotBase.isReal（）/ RobotBase :: IsReal（）检查将它们包装起来（即constexpr``在C ++中）。

source: This example will use the ``EncoderSim`` class as an example. Use of other simulation classes will be almost identical.
es_mx: Este ejemplo utilizará la clase "EncoderSim" como ejemplo. El uso de otras clases de simulación será casi idéntico.
fr_ca: Cet exemple utilisera la classe ``EncoderSim`` à titre d’exemple. L’utilisation d’autres classes de simulation se fera quasiment de la même manière.
zh_cn: 本示例将使用EncoderSim类作为示例。其他模拟类的使用几乎是相同的。

source: Creating Simulation Device objects
es_mx: Creación de objetos de dispositivos de simulación
fr_ca: Création d’objets pour le dispositif de simulation
zh_cn: 创建模拟设备对象

source: Simulation device object can be constructed in two ways:
es_mx: El objeto de dispositivo de simulación puede construirse de dos maneras:
fr_ca: L’objet du dispositif de simulation peut être construit de deux façons :
zh_cn: 可以通过两种方式构造仿真设备对象：

source: a constructor that accepts the regular hardware object.
es_mx: un constructor que acepta el objeto hardware normal.
fr_ca: Un constructeur qui accepte l’objet matériel ordinaire.
zh_cn: 接受常规硬件对象的构造函数。

source: a constructor or factory method that accepts the port/index/channel number that the device is connected to. These would be the same number that was used to construct the regular hardware object. This is especially useful for :doc:`unit testing <unit-testing>`.
es_mx: un constructor o método de fábrica que acepte el número de puerto/índice/canal al que está conectado el dispositivo. Este sería el mismo número que se utilizó para construir el objeto de hardware regular. Esto es especialmente útil para las :doc:` pruebas unitarias<unit-testing>`.
fr_ca: Un constructeur ou une méthode par défaut qui accepte le numéro de port/index/canal à qui l’appareil est connecté. Ce serait le même numéro qui a été utilisé pour construire l’objet matériel régulier. Ceci est particulièrement utile pour :doc:`unit testing <unit-testing>`.
zh_cn: 接受设备连接到的端口/索引/通道号的构造函数或工厂方法。这些数字将与用于构造常规硬件对象的数字相同。这对于单元测试<unit-testing>尤其有用。

source: Reading and Writing Device Data
es_mx: Lectura y escritura de datos del dispositivo
fr_ca: Lecture et écriture des données de simulation
zh_cn: 读写设备数据

source: Each simulation class has getter (``getXxx()``/``GetXxx()``) and setter (``setXxx(value)``/``SetXxx(value)``) functions for each field ``Xxx``. The getter functions will return the same as the getter of the regular device class.
es_mx: Cada clase de simulación tiene funciones getter (``getXxx()``/`GetXxx()``) y setter (``setXxx(valor)``/`SetXxx(valor)``) para cada campo ``Xxx``. Las funciones getter devolverán lo mismo que el getter de la clase de dispositivo normal.
fr_ca: Chaque classe de simulation a des fonctions getter (``getXxx()``/``GetXxx()``) et setter (``setXxx(value)``/``SetXxx(value)``) pour chaque champ ``Xxx``. Les fonctions getter retourneront la même chose que le getter de la classe régulière pour le robot réel.
zh_cn: 每个模拟类对于每个字段``Xxx''都有getter（``getXxx（）/''GetXxx（）``）和setter（``setXxx（value）``/``SetXxx（value）``）函数``。 getter函数将返回与常规设备类的getter相同的函数。

source: Registering Callbacks
es_mx: Registro de devoluciones de llamada
fr_ca: Enregistrement des Callbacks
zh_cn: 注册回调

source: In addition to the getters and setters, each field also has a ``registerXxxCallback()`` function that registers a callback to be run whenever the field value changes and returns a ``CallbackStore`` object. The callbacks accept a string parameter of the name of the field and a ``HALValue`` object containing the new value. Before retrieving values from a ``HALValue``, check the type of value contained. Possible types are ``HALValue.kBoolean``/``HAL_BOOL``, ``HALValue.kDouble``/``HAL_DOUBLE``, ``HALValue.kEnum``/``HAL_ENUM``, ``HALValue.kInt``/``HAL_INT``, ``HALValue.kLong``/``HAL_LONG``.
es_mx: Además de los getters y setters, cada campo tiene una función ``registerXxxCallback()`` que registra una llamada de retorno que se ejecutará cada vez que el valor del campo cambie y devuelve un objeto ``CallbackStore``. Las llamadas de retorno aceptan un parámetro de cadena con el nombre del campo y un objeto ``HALValue`` que contiene el nuevo valor. Antes de recuperar valores de un ``HALValue``, comprueba el tipo de valor que contiene. Los tipos posibles son ``HALValue.kBoolean``/`HAL_BOOL``, ``HALValue.kDouble``/`HAL_DOUBLE``, ``HALValue.kEnum``/`HAL_ENUM``, ``HALValue.kInt``/`HAL_INT``, ``HALValue.kLong``/`HAL_LONG``.
fr_ca: En plus des getters et des setters, chaque champ dispose également d’une fonction ``registerXxxCallback()`` qui enregistre un callback ou rappel à exécuter à chaque fois que la valeur du champ change et renvoie un objet ``CallbackStore``. Les callbacks acceptent un paramètre de type chaîne de caractère correspondant au nom du champ et un objet ``HALValue`` contenant la nouvelle valeur. Avant de récupérer les valeurs d’une ``HALValue``, vérifiez le type de valeur contenue. Les types possibles sont ``HALValue.kBoolean``/``HAL_BOOL``, ``HALValue.kDouble``/``HAL_DOUBLE``, ``HALValue.kEnum``/``HAL_ENUM``, ``HALValue.kInt``/``HAL_INT``, ``HALValue.kLong``/``HAL_LONG``.
zh_cn: 除了getter和setter之外，每个字段还具有一个registerXxxCallback（）函数，该函数注册一个回调函数，只要该字段值发生更改并返回CallbackStore对象，该回调函数便会运行。回调接受字段名称的字符串参数和包含新值的“ HALValue”对象。从``HALValue''中获取值之前，请检查包含的值的类型。可能的类型是``HALValue.kBoolean''/``HAL_BOOL''，``HALValue.kDouble''/``HAL_DOUBLE''，``HALValue.kEnum''/``HAL_ENUM''，``HALValue.kInt ``/``HAL_INT``，``HALValue.kLong`` /``HAL_LONG``。

source: In Java, call ``close()`` on the ``CallbackStore`` object to cancel the callback. Keep a reference to the object so it doesn't get garbage-collected - otherwise the callback will be canceled by GC. To provide arbitrary data to the callback, capture it in the lambda or use a method reference.
es_mx: En Java, llama a ``close()`` en el objeto ``CallbackStore`` para cancelar la llamada de retorno. Mantén una referencia al objeto para que no sea recolectado por la basura - de lo contrario la devolución de llamada será cancelada por la GC. Para proporcionar datos arbitrarios a la llamada de retorno, captúralos en la lambda o utiliza una referencia a un método.
fr_ca: En Java, appelez ``close()`` sur l’objet ``CallbackStore`` pour annuler le callback. Gardez une référence à l’objet afin qu’il ne soit pas récupéré par le garbage collector - sinon le callback sera annulé par GC. Pour fournir des données arbitraires au callback, capturez-les dans le lambda ou utilisez une référence de méthode.
zh_cn: 在Java中，对CallbackStore对象调用close（）取消回调。保留对对象的引用，以免垃圾被回收-否则回调将被GC取消。要向回调提供任意数据，请在lambda中捕获它或使用方法引用。

source: In C++, save the ``CallbackStore`` object in the right scope - the callback will be canceled when the object goes out of scope and is destroyed. Arbitrary data can be passed to the callbacks via the ``param`` parameter.
es_mx: En C++, guarda el objeto ``CallbackStore`` en el ámbito correcto - la llamada de retorno se cancelará cuando el objeto salga del ámbito y se destruya. Se pueden pasar datos arbitrarios a las llamadas de retorno a través del parámetro ``param``.
fr_ca: En C++, enregistrez l’objet ``CallbackStore`` dans la bonne portée - le callback sera annulé lorsque l’objet sort de sa portée et est détruit. Les données arbitraires peuvent être transmises aux callbacks via le paramètre ``param``.
zh_cn: 在C ++中，将“ CallbackStore”对象保存在正确的范围内-当对象超出范围并被销毁时，回调将被取消。可以通过param参数将任意数据传递给回调。

source: Attempting to retrieve a value of a type from a ``HALValue`` containing a different type is undefined behavior.
es_mx: Intentar recuperar un valor de un tipo desde un ``HALValue`` que contiene un tipo diferente es un comportamiento indefinido.
fr_ca: Tenter de récupérer une valeur d’un type à partir d’une ``HALValue`` contenant un type différent est un comportement non défini.
zh_cn: 尝试从包含其他类型的HALValue中检索类型的值是未定义的行为。

source: Simulating Other Devices - The SimDeviceSim Class
es_mx: Simulación de otros dispositivos - La clase SimDeviceSim
fr_ca: Simulation d’autres dispositifs - La classe SimDevicesim
zh_cn: 模拟其他设备-SimDeviceSim类

source: Vendors might implement their connection to the SimDevice API slightly different than described here. They might also provide a simulation class specific for their device class. See your vendor's documentation for more information as to what they support and how.
es_mx: Los proveedores pueden implementar su conexión a la API SimDevice de forma ligeramente diferente a la descrita aquí. También pueden proporcionar una clase de simulación específica para su clase de dispositivo. Consulte la documentación de su proveedor para obtener más información sobre lo que soportan y cómo.
fr_ca: Les fournisseurs peuvent implémenter leur connexion à l’API SimDevice d'une manière légèrement différente de celle décrite ici. Ils peuvent également fournir une classe de simulation spécifique pour leurs classes de composants. Consultez la documentation de votre fournisseur pour plus d’informations sur ce qu’il prend en charge et la manière de le faire.
zh_cn: 供应商可能会实现与SimDevice API的连接，与此处所述稍有不同。他们可能还会提供特定于其设备类的仿真类。有关他们支持什么以及如何获得更多信息，请参阅供应商的文档。

source: The ``SimDeviceSim`` (**not** ``SimDevice``!) class is a general device simulation object for devices that aren't core WPILib devices and therefore don't have specific simulation classes - such as vendor devices. These devices will show up in the :guilabel:`Other Devices` tab of the :ref:`SimGUI<docs/software/wpilib-tools/robot-simulation/simulation-gui:Modifying ADXRS450 Inputs>`.
fr_ca: La classe ``SimDeviceSim`` (**pas** ``SimDevice``!) est un objet de simulation de périphérique général pour les périphériques qui ne sont pas des périphériques WPILib de base et qui n’ont donc pas de classes de simulation spécifiques, telles que les périphériques des fournisseurs. Ces composants apparaîtront dans l’onglet :guilabel:`Other Devices` du document :ref:`SimGUI<docs/software/wpilib-tools/robot-simulation/simulation-gui:Modifying ADXRS450 Inputs>`.

source: The ``SimDeviceSim`` object is created using a string key identical to the key the vendor used to construct the underlying ``SimDevice`` in their device class. This key is the one that the device shows up with in the :guilabel:`Other Devices` tab, and is typically of the form ``Prefix:Device Name[index]``. If the key contains ports/index/channel numbers, they can be passed as separate arguments to the ``SimDeviceSim`` constructor. The key contains a prefix that is hidden by default in the SimGUI, it can be shown by selecting the :guilabel:`Show prefix` option. Not including this prefix in the key passed to ``SimDeviceSim`` will not match the device!
es_mx: El objeto ``SimDeviceSim`` se crea utilizando una clave de cadena idéntica a la que el proveedor utilizó para construir el ``SimDevice`` subyacente en su clase de dispositivo. Esta clave es la que muestra el dispositivo en la pestaña :guilabel:`Otros dispositivos`, y suele tener la forma ``Prefijo:Nombre del dispositivo[índice]``. Si la clave contiene números de puertos/índices/canales, pueden pasarse como argumentos separados al constructor de ``SimDeviceSim``. La clave contiene un prefijo que está oculto por defecto en la SimGUI, puede mostrarse seleccionando la opción :guilabel:`Show prefix`. Si no se incluye este prefijo en la clave que se pasa a ``SimDeviceSim``, ¡no coincidirá con el dispositivo!
fr_ca: L’objet ``SimDeviceSim`` est créé à l’aide d’une clé de chaîne identique à la clé utilisée par le fournisseur pour construire le ``SimDevice`` sous-jacent dans sa classe du composant. Cette clé est celle avec qui le composant apparaît dans l’onglet :guilabel:`Other Devices`, et est généralement de la forme ``Prefix:Device Name[index]``. Si la clé contient des ports/index/numéros de canal, ils peuvent être transmis sous forme d’arguments distincts au constructeur ``SimDeviceSim``. La clé contient un préfixe qui est caché par défaut dans le SimGUI, il peut être affiché en sélectionnant l’option :guilabel:`Show prefix`. Ne pas inclure ce préfixe dans la clé transmise à ``SimDeviceSim`` ne se reférera pas au bon composant!
zh_cn: 使用与厂商用来在其设备类中构造基础``SimDevice''的键相同的字符串键创建``SimDeviceSim''对象。该密钥是设备在``其他设备''选项卡中显示的密钥，通常为``前缀：设备名称[索引]''的形式。如果键包含端口/索引/通道号，则可以将它们作为单独的参数传递给“ SimDeviceSim”构造函数。该密钥包含一个默认情况下在SimGUI中隐藏的前缀，可以通过选择：guilabel：`Show prefix`选项来显示。在传递给``SimDeviceSim``的密钥中不包含此前缀将与设备不匹配！

source: Once we have the ``SimDeviceSim``, we can get ``SimValue`` objects representing the device's fields. Type-specific ``SimDouble``, ``SimInt``, ``SimLong``, ``SimBoolean``, and ``SimEnum`` subclasses also exist, and should be used instead of the type-unsafe ``SimValue`` class. These are constructed from the ``SimDeviceSim`` using a string key identical to the one the vendor used to define the field. This key is the one the field appears as in the SimGUI. Attempting to retrieve a ``SimValue`` object outside of simulation or when either the device or field keys are unmatched will return ``null`` - this can cause ``NullPointerException`` in Java or undefined behavior in C++.
es_mx: Una vez que tenemos el ``SimDeviceSim``, podemos obtener objetos ``SimValue`` que representan los campos del dispositivo. También existen subclases específicas de tipo ``SimDouble``, ``SimInt``, ``SimLong``, ``SimBoolean`` y ``SimEnum``, que deben utilizarse en lugar de la clase ``SimValue``, que no es segura. Se construyen a partir de ``SimDeviceSim`` utilizando una clave de cadena idéntica a la que el proveedor utilizó para definir el campo. Esta clave es la que aparece en la SimGUI. Si se intenta recuperar un objeto ``SimValue`` fuera de la simulación o cuando las claves del dispositivo o del campo no coinciden, se devolverá ``null`` - esto puede causar una ``NullPointerException`` en Java o un comportamiento indefinido en C++.
fr_ca: Une fois que nous avons le ``SimDeviceSim``, nous pouvons obtenir des objets ``SimValue`` représentant les champs du composant. Il existe également des sous-classes de type spécifique ``SimDouble``, ``SimInt``, ``SimLong``, ``SimBoolean``, et ``SimEnum`` qui devraient être utilisées au lieu de la classe non fiable ``SimValue``. Celles-ci sont construites à partir de ``SimDeviceSim`` à l’aide d’une clé identique à celle utilisée par le fournisseur pour définir le champ. Cette clé est celle inscrite dans le champ apparaissant telle que dans le SimGUI. Tenter de récupérer un objet ``SimValue`` en dehors du simulateur ou lorsque le composant ou les clés de champ n'ont pas d'objet retournera ``null`` - cela peut provoquer ``NullPointerException`` en Java ou un comportement non défini dans C++.
zh_cn: 一旦有了“ SimDeviceSim”，就可以获取代表设备字段的“ SimValue”对象。特定类型的``SimDouble''，``SimInt''，``SimLong''，``SimBoolean''和``SimEnum``子类也存在，并且应该使用它们来代替类型不安全的``SimValue ``课。这些是使用与供应商用来定义该字段的字符串相同的字符串键从“ SimDeviceSim”构造的。该键是该字段在SimGUI中显示的键。尝试在模拟之外或设备或字段键不匹配时检索“ SimValue”对象将返回“ null”-这可能会导致Java中出现“ NullPointerException”或C ++中出现未定义的行为。

source: The ``SimDeviceSim`` (**not ``SimDevice``!**) class is a general device simulation object for devices that aren't core WPILib devices and therefore don't have specific simulation classes - such as vendor devices. These devices will show up in the :guilabel:`Other Devices` tab of the :ref:`SimGUI<docs/software/wpilib-tools/robot-simulation/simulation-gui:Modifying ADXRS450 Inputs>`.
zh_cn: ``SimDeviceSim``（**不是``SimDevice''！**）类是用于非WPILib核心设备的设备的通用设备模拟对象，因此没有特定的模拟类-例如供应商设备。这些设备将显示在：ref：`SimGUI <docs/software/wpilib-tools/robot-simulation/simulation-gui:Modifying ADXRS450 Inputs>`的其他设备标签中。
