Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-simulation/introduction.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Introduction to Robot Simulation
es_mx: Introducción a la Simulación del Robot
fr_ca: Introduction au simulateur de Robot
tr_tr: Robot Simülasyonuna Giriş
zh_cn: 机器人模拟简介

source: Often a team may want to test their code without having an actual robot available. WPILib provides teams with the ability to simulate various robot features using simple gradle commands.
es_mx: A veces un equipo puede querer probar su código sin tener un robot disponible. WPILib proporciona a los equipos la capacidad de simular varias características del robot usando simples comandos gradle.
fr_ca: Le simulateur «Robot Simulation» rend possible la programmation d’un robot virtuel dans le cas où une équipe ne dispose d’un véritable robot. WPILib offre aux équipes la possibilité de simuler diverses fonctionnalités du robot virtuellement à l'aide de simples commandes Gradle.
tr_tr: Genellikle bir takım, gerçek bir robotu olmadan kodunu test etmek isteyebilir. WPILib, ekiplere basit derecelendirme komutlarını kullanarak çeşitli robot özelliklerini simüle etme yeteneği sağlar.
zh_cn: 通常，团队可能想在没有可用的实际机器人的情况下测试其代码。 WPILib使团队能够使用简单的gradle命令来模拟各种机器人功能。

source: Enabling Desktop Support
es_mx: Habilitación del Soporte de Escritorio
fr_ca: Activation de l’option *Desktop Support*
tr_tr: Masaüstü Desteğini Etkinleştirme
zh_cn: 启用桌面支持

source: Use of the Desktop Simulator requires Desktop Support to be enabled. This can be done by checking the "Enable Desktop Support Checkbox" when creating your robot project or by running "WPILib: Change Desktop Support Enabled Setting" from the Visual Studio Code command palette.
es_mx: El uso del Simulador de Escritorio requiere que el Soporte de Escritorio esté habilitado. Esto se puede hacer marcando la casilla "Enable Desktop Support Checkbox" o Activar Soporte de Escritorio al crear su proyecto del robot o ejecutando "WPILib: Change Desktop Support Enabled Setting" desde la paleta de comandos de Visual Studio Code.
fr_ca: L’utilisation du simulateur nécessite l’activation de *Desktop Support*. Cela peut se faire en cochant la case à cocher "Enable Desktop Support Checkbox" lors de la création de votre projet de robot ou en exécutant "WPILib: Change Desktop Support Enabled Setting" à partir de la palette de commandes Visual Studio Code.
tr_tr: Masaüstü Simülatörünün kullanılması Masaüstü Desteğinin etkinleştirilmesini gerektirir. Bu, robot projenizi oluştururken "Enable Desktop Support Checkbox" işaretleyerek veya Visual Studio Code komut paletinden "WPILib: Change Desktop Support Enabled Setting" i çalıştırarak yapılabilir.
zh_cn: 指令使用桌面模拟器需要启用桌面支持。这可以通过在创建机器人项目时选中“启用桌面支持复选框”或通过运行Visual Studio Code命令面板中的“ WPILib：更改启用桌面支持设置”来完成。

source: Enabling desktop support through VS Code
es_mx: Habilitar el soporte de escritorio a través de VS Code
fr_ca: Activation de la prise en charge du bureau via VS Code
zh_cn: 通过 VS Code 启用桌面支持

source: Manually enabling desktop support through VS Code command-palette
es_mx: Habilitar manualmente el soporte de escritorio a través de la paleta de comandos de VS Code
fr_ca: Activation manuelle de la prise en charge du bureau via la palette de commandes VS Code
zh_cn: 通过 VS Code 指令调色板手动启用桌面支持

source: Desktop support can also be enabled by manually editing your ``build.gradle`` file located at the root of your robot project. Simply change ``includeDesktopSupport = false`` to ``includeDesktopSupport = true``
es_mx: El soporte de escritorio también puede ser habilitado de forma manual editando su archivo ``build.gradle`` ubicado en la raíz del proyecto de su robot. Simplemente cambie ``includeDesktopSupport = false`` por ``includeDesktopSupport = true``
fr_ca: La prise en charge du bureau peut également être activée en modifiant manuellement votre fichier ``build.gradle`` situé à la racine de votre projet de robot. Il suffit de changer ``includeDesktopSupport = false`` pour ``includeDesktopSupport = true``
tr_tr: Masaüstü desteği, robot projenizin kök dizininde bulunan ``build.gradle`` dosyanızı manuel olarak düzenleyerek de etkinleştirilebilir. Basitçe ``includeDesktopSupport = false`` u ``includeDesktopSupport = true`` olarak değiştirin
zh_cn: 也可以通过手动编辑位于机器人项目根目录下的build.gradle文件来启用桌面支持。只需将``includeDesktopSupport = false''更改为``includeDesktopSupport = true''

source: It is important to note that enabling desktop/simulation support can have unintended consequences. Not all vendors will support this option, and code that uses their libraries may even crash when attempting to run simulation!
es_mx: Es importante señalar que la habilitación del soporte de escritorio/simulación puede tener consecuencias imprevistas. No todos los proveedores soportan esta opción, y el código que utiliza sus bibliotecas puede incluso bloquearse al intentar ejecutar la simulación.
fr_ca: Il est important de noter que l’activation de la prise en charge de bureau/simulation peut avoir des conséquences imprévues. Tous les fournisseurs ne prennent pas en charge cette option, et le code qui utilise leurs bibliothèques peut même se planter lors de la tentative d’exécution de la simulation!
tr_tr: Masaüstü/simülasyon desteğinin etkinleştirilmesinin istenmeyen sonuçlara yol açabileceğine dikkat etmek önemlidir. Tüm üreticiler bu seçeneği desteklemez ve kitaplıklarını kullanan kod, simülasyonu çalıştırmaya çalışırken bile çökebilir!
zh_cn: 重要的是要注意启用桌面/模拟支持会产生意想不到的后果。并非所有供应商都支持此选项，并且使用它们的库的代码甚至可能在尝试运行模拟时崩溃！

source: If at any point in time you want to disable Desktop Support, simply re-run the "WPILib: Change Desktop Support Enabled Setting" from the command palette.
es_mx: Si en algún momento usted quiere desactivar el Soporte de Escritorio, simplemente vuelve a ejecutar "WPILib: Change Desktop Support Enabled Setting" de la paleta de comandos.
fr_ca: Si, à un moment donné, vous souhaitez désactiver la prise en charge du Bureau, exécutez simplement de nouveau la commande "WPILib: Change Desktop Support Enabled Setting" de la palette de commandes.
tr_tr: Herhangi bir anda Desktop Support Desteğini devre dışı bırakmak isterseniz, komut paletinden "WPILib: Change Desktop Support Enabled Setting" i yeniden çalıştırın.
zh_cn: 如果您想在任何时候禁用桌面支持，只需从命令面板中重新运行“WPILib: Change Desktop Support Enabled Setting”即可。

source: Additional C++ Dependency
es_mx: Dependencia de C++ Adicional
fr_ca: Dépendance C++ supplémentaire
tr_tr: Ek C++ Bağımlılığı
zh_cn: 其他C ++依赖性

source: C++ robot simulation requires that a native compiler to be installed. For Windows, this would be `Visual Studio 2019 <https://visualstudio.microsoft.com/vs/>`__ (**not** VS Code), macOS requires `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`__, and Linux (Ubuntu) requires the ``build-essential`` package.
tr_tr: C++ robot simülasyonu, yerel bir derleyicinin kurulmasını gerektirir. Windows için bu, "Visual Studio 2019 <https://visualstudio.microsoft.com/vs/>`__ (VS Code **değil**), macOS için `Xcode<https://apps.apple.com/us/app/xcode/id497799835>`__, Linux (Ubuntu) ise ``build-essential`` paketini gerektirir.
zh_cn: C ++机器人模拟要求安装本地编译器。对于Windows，这是Visual Studio 2019（**不是** VS Code），macOS需要Xcode，而Linux（Ubuntu）需要`build-essential'软件包。

source: Ensure the ``Desktop Development with C++`` option is checked in the Visual Studio installer for simulation support.
tr_tr: Simülasyon desteği için Visual Studio yükleyicisinde `` C ++ ile Masaüstü Geliştirme '' seçeneğinin işaretlendiğinden emin olun.
zh_cn: 确保在Visual Studio安装程序中选中了``使用C ++进行桌面开发''选项以提供模拟支持。

source: Screenshot of the Visual Studio build tools option
es_mx: Captura de pantalla de la opción de herramientas de compilación de Visual Studio
fr_ca: Capture d’écran de l’option outils de compilation de Visual Studio
zh_cn: Visual Studio 生成工具选项的屏幕截图

source: Running Robot Simulation
es_mx: Ejecutar la Simulación del Robot
fr_ca: Exécution d'une simulation de robot
tr_tr: Robot Simülasyonunu Çalıştırma
zh_cn: 运行机器人模拟

source: Basic robot simulation can be run using VS Code. This can be done without using any commands by using VS Code's command palette.
es_mx: La simulación básica del robot puede ser ejecutada usando Visual Studio Code. Esto puede ser hecho sin usar ningún comando usando la paleta de comandos de Visual Studio Code.
fr_ca: La simulation sommaire du robot de base peut être réalisée à l’aide du code VS. Cela peut se faire sans utiliser de commandes autres que celles de la palette de commandes de VS Code.
tr_tr: Temel robot simülasyonu VS Code kullanılarak çalıştırılabilir. Bu, VS Code'un komut paleti kullanılarak herhangi bir komut kullanılmadan yapılabilir.
zh_cn: 可以使用VS Code运行基本的机器人仿真。通过使用VS Code的命令选项板，无需使用任何命令即可完成此操作。

source: Running robot simulation through VS Code
es_mx: Ejecución la simulación del robot a través de VS Code
fr_ca: Exécution de la simulation de robot via VS Code
zh_cn: 通过 VS Code 运行机器人模拟

source: Your console output in Visual Studio Code should look like the below. However, teams probably will want to actually *test* their code versus just running the simulation. This can be done using :doc:`WPILib's Simulation GUI <simulation-gui>`.
es_mx: La salida de información de la consola en Visual Studio Code debería verse como la siguiente. Sin embargo, los equipos probablemente querrán probar su código en vez de sólo ejecutar la simulación. Esto se puede hacer usando :doc:`WPILib's Simulation GUI <simulation-gui>`.
fr_ca: La sortie de votre console dans Visual Studio Code doit ressembler à ce qui apparaît ci-dessus. Cependant, les équipes voudront probablement réellement *tester* leur code au lieu de simplement éxécuter la simulation. Cela peut être fait à l’aide de :doc:`WPILib's Simulation GUI <simulation-gui>`.
tr_tr: Visual Studio Code'daki konsol çıktınız aşağıdaki gibi görünmelidir. Ancak, takımlar muhtemelen simülasyonu çalıştırmak yerine kodlarını gerçekten *test etmek* isteyeceklerdir. Bu, aşağıdakiler kullanılarak yapılabilir :doc:`WPILib'in Simülasyon GUI<simulation-gui>`.
zh_cn: Visual Studio Code中的控制台输出应如下所示。但是，团队可能想要实际*测试*他们的代码，而不是仅仅运行模拟。可以使用WPILib的Simulation GUI <simulation-gui>`来完成。

source: Simulation can also be run outside of VS Code using ``./gradlew simulateJava``. It's important to note that C++ simulation is not available through command-line at this time.
tr_tr: Simülasyon, ``./gradlew simulateJava`` kullanılarak VS Code dışında da çalıştırılabilir. C++ simülasyonunun şu anda komut satırından kullanılamadığını unutmamak önemlidir.
zh_cn: 模拟也可以`./gradlew simulateJava``在VS代码之外运行。重要的是要注意，此时C++命令无法通过命令行获得。

source: Running Robot Dashboards
es_mx: Ejecución de Dashboards del robot
fr_ca: Exécution des tableaux de bord du robot
tr_tr: Robot Gösterge Panellerini Çalıştırma
zh_cn: 运行机器人面板

source: Both Shuffleboard and SmartDashboard can be used with WPILib simulation.
es_mx: Tanto Shuffleboard como SmartDashboard se pueden usar con la simulación WPILib.
fr_ca: Le Shuffleboard et le SmartDashboard peuvent être utilisés avec la simulation WPILib.
tr_tr: Hem Shuffleboard hem de SmartDashboard, WPILib simülasyonu ile kullanılabilir.
zh_cn: Shuffleboard和SmartDashboard均可与WPILib仿真一起使用。

source: Shuffleboard is automatically configured to look for a NetworkTables instance from the robotRIO but **not from other sources**. To connect to Shuffleboard, open Shuffleboard preferences from the File menu and select ``NetworkTables`` under ``Plugins`` on the left navigation bar. In the ``Server`` field, type in the IP address or hostname of the NetworkTables host. For a standard simulation configuration, use ``localhost``.
es_mx: Shuffleboard se configura automáticamente para buscar una instancia de NetworkTables desde el robotRIO pero **no desde otras fuentes**. Para conectarse a Shuffleboard, abra las preferencias de Shuffleboard desde el menú Archivo y seleccione ``NetworkTables`` en ``Plugins`` en la barra de navegación de la izquierda. En el campo ``Servidor``, escriba la dirección IP o el nombre del host de NetworkTables. Para una configuración de simulación estándar, utilice ``localhost``.
fr_ca: Shuffleboard est automatiquement configuré pour rechercher une instance NetworkTables à partir du robotRIO mais **pas à partir d'autres sources**. Pour vous connecter à Shuffleboard, ouvrez les préférences Shuffleboard dans le menu ``File`` et sélectionnez ``NetworkTables`` sous ``Plugins`` dans la barre de navigation de gauche. Dans le champ ``Server``, saisissez l'adresse IP ou le nom d'hôte de l'hôte NetworkTables. Pour une configuration de simulation standard, utilisez ``localhost``.
zh_cn: Shuffleboard会自动配置为从robotRIO查找NetworkTables实例，但**不是从其他来源**。要连接到Shuffleboard，请从“文件”菜单打开Shuffleboard首选项，然后在左侧导航栏的“插件”下选择“ NetworkTables”。在``服务器''字段中，输入NetworkTables主机的IP地址或主机名。对于标准的模拟配置，请使用``localhost''。

source: Shuffleboard connection settings set to localhost.
es_mx: La configuración de conexión del Shuffleboard se estableció en localhost
fr_ca: Paramètres de connexion du Shuffleboard définis sur localhost.
zh_cn: Shuffleboard 连接设置被设置为本地主机。

source: SmartDashboard
zh_cn: 智能仪表板

source: SmartDashboard is automatically configured to look for a NetworkTables instance from the roboRIO, but **not from other sources**. To connect to SmartDashboard, open SmartDashboard preferences under the ``File`` menu and in the ``Team Number`` field, enter the IP address or hostname of the NetworkTables host. For a standard simulation configuration, use ``localhost``.
es_mx: SmartDashboard está configurado automáticamente para buscar una instancia de NetworkTables desde el roboRIO, pero **no desde otras fuentes**. Para conectarse a SmartDashboard, abra las preferencias de SmartDashboard en el menú ``File`` y en el campo ``Team Number``, introduzca la dirección IP o el nombre del host de NetworkTables. Para una configuración de simulación estándar, utilice ``localhost``.
fr_ca: SmartDashboard est automatiquement configuré pour rechercher une instance NetworkTables à partir du roboRIO, mais ** pas à partir d'autres sources **. Pour vous connecter à SmartDashboard, ouvrez les préférences de SmartDashboard dans le menu ``File`` et dans le champ ``Team Number``, saisissez l'adresse IP ou le nom d'hôte de l'hôte NetworkTables. Pour une configuration de simulation standard, utilisez ``localhost``.
zh_cn: SmartDashboard会自动配置为从roboRIO中查找NetworkTables实例，但不是从其他来源中查找**。要连接到SmartDashboard，请在“文件”菜单下打开SmartDashboard首选项，然后在“团队编号”字段中输入NetworkTables主机的IP地址或主机名。对于标准的模拟配置，请使用``localhost''。

source: SmartDashboard team number set to localhost.
es_mx: El número de equipo de SmartDashboard se estableció en localhost
fr_ca: Le numéro d’équipe du SmartDashboard est défini sur localhost.
zh_cn: SmartDashboard 团队编号设置为本地主机。

source: C++ robot simulation requires that a native compiler to be installed. For Windows, this would be `Visual Studio 2022 or 2019 <https://visualstudio.microsoft.com/vs/>`__ (**not** VS Code), macOS requires `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`__, and Linux (Ubuntu) requires the ``build-essential`` package.
fr_ca: La simulation de robot C++ nécessite l'installation d'un compilateur natif. Pour Windows, ce serait `Visual Studio 2022 ou 2019 <https://visualstudio.microsoft.com/vs/>`__ (**pas** VS Code), macOS requiert `Xcode <https://apps.apple .com/us/app/xcode/id497799835>`__, et Linux (Ubuntu) nécessitent le package ``build-essential``.

source: Ensure the :guilabel:`Desktop Development with C++` option is checked in the Visual Studio installer for simulation support.
fr_ca: Assurez-vous que l'option :guilabel:`Desktop Development with C++` est cochée dans le programme d'installation de Visual Studio pour la prise en charge de la simulation.

source: Simulation can also be run outside of VS Code using ``./gradlew simulateJava`` for Java or ``./gradlew simulateNative`` for C++.
fr_ca: La simulation peut également être exécutée en dehors de VS Code en utilisant ``./gradlew simulateJava`` pour Java ou ``./gradlew simulateNative`` pour C++.

source: Shuffleboard
tr_tr: Shuffleboard-Karıştırma panosu

source: Shuffleboard is automatically configured to look for a NetworkTable instance from the robotRIO but **not from other sources**. To connect to Shuffleboard, open Shuffleboard preferences from the File menu and select ``NetworkTables`` under ``Plugins`` on the left navigation bar. In the ``Server`` field, type in the IP address or hostname of the NetworkTables host. For a standard simulation configuration, use ``localhost``.
tr_tr: Shuffleboard, robotRIO'dan bir NetworkTable örneğini aramak için otomatik olarak yapılandırılır ancak ** diğer kaynaklardan değil **. Shuffleboard'a bağlanmak için Dosya menüsünden Shuffleboard tercihlerini açın ve sol gezinme çubuğundaki ``Plugins- Eklentiler`` altında ``NetworkTables`` nı seçin. ``Server-Sunucu`` alanına, NetworkTables ana bilgisayarının IP adresini veya ana bilgisayar adını yazın. Standart bir simülasyon yapılandırması için `` localhost`` kullanın.

source: SmartDashboard is automatically configured to look for a NetworkTable instance from the roboRIO, but **not from other sources**. To connect to SmartDashboard, open SmartDashboard preferences under the ``File`` menu and in the ``Team Number`` field, enter the IP address or hostname of the NetworkTables host. For a standard simulation configuration, use ``localhost``.
tr_tr: SmartDashboard, roboRIO'dan bir NetworkTable örneğini aramak üzere otomatik olarak yapılandırılır, ancak ** diğer kaynaklardan değil **. SmartDashboard'a bağlanmak için, ``File -Dosya`` menüsü altında SmartDashboard tercihlerini açın ve ``Takım Numarası``alanına NetworkTables ana bilgisayarının IP adresini veya ana bilgisayar adını girin. Standart bir simülasyon yapılandırması için ``localhost`` kullanın.
