Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-simulation/physics-sim.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Physics Simulation with WPILib
es_mx: Simulación física con WPILib
fr_ca: Simulation physique avec WPILib
tr_tr: WPILib ile Fizik Simülasyonu
zh_cn: 用WPILib进行物理模拟

source: Because :ref:`state-space notation <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` allows us to compactly represent the :term:`dynamics <dynamics>` of :term:`systems <system>`, we can leverage it to provide a backend for simulating physical systems on robots. The goal of these simulators is to simulate the motion of robot mechanisms without modifying existing non-simulation user code. The basic flow of such simulators is as follows:
es_mx: Debido a que la :ref: `notación de espacio de estado <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` nos permite representar de manera compacta el :term:`dinámica <dynamics>` de :term:`sistemas <system>`, podemos aprovecharlo para proporcionar un backend para simular sistemas físicos en robots. El objetivo de estos simuladores es simular el movimiento de los mecanismos del robot sin modificar el código de usuario existente que no sea de simulación. El flujo básico de dichos simuladores es el siguiente:
fr_ca: Parce que :ref:`la notation de l’espace d’états <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` nous permet de représenter de manière compacte la :term:`dynamique<dynamics>` d’un :term:`système<system>`, nous pouvons en tirer parti pour fournir une façon de simuler des systèmes physiques sur des robots. Le but de ces simulateurs est de simuler le mouvement des mécanismes du robot sans modifier le code utilisateur existant. L'algorithme de base de ces simulateurs est le suivant:
tr_tr: Çünkü :ref:`durum-uzay gösterimi <docs/software/advanced-controls/state-space/state-space-intro:What is State-Space Notation?>` , ::term:`systems <system>` 'in :term:`dynamics <dinamikleri>` kompakt bir şekilde temsil etmemize olanak tanır, robotlarda fiziksel sistemleri simüle etmek için onu kullanabiliriz. Bu simülatörlerin amacı, mevcut simülasyon dışı kullanıcı kodunu değiştirmeden robot mekanizmalarının hareketini simüle etmektir. Bu tür simülatörlerin temel akışı aşağıdaki gibidir:
zh_cn: 因为：ref：`状态空间表示法`允许我们紧凑地表示：术语：`系统的动力学`，我们可以利用它为模拟机器人上的物理系统提供后端。 这些模拟器的目的是在不修改现有的非仿真用户代码的情况下模拟机器人机构的运动。 这种模拟器的基本流程如下：

source: In normal user code:
es_mx: En código de usuario normal:
fr_ca: En code utilisateur normal:
tr_tr: Normal kullanıcı kodunda:
zh_cn: 在正常用户代码中：

source: PID or similar control algorithms generate voltage commands from encoder (or other sensor) readings
es_mx: PID o algoritmos de control similares generan comandos de voltaje a partir de lecturas del encoder (u otro sensor)
fr_ca: Le PID ou des algorithmes de contrôle similaires génèrent des commandes de tension à partir des lectures du codeur (ou d'un autre capteur)
tr_tr: PID veya benzer kontrol algoritmaları, kodlayıcı (veya diğer sensör) okumalarından voltaj komutları üretir
zh_cn: PID或类似的控制算法从编码器（或其他传感器）读数中生成电压命令

source: Motor outputs are set
es_mx: Los valores de salida del motor están configurados
fr_ca: Les sorties du moteur sont réglées
tr_tr: Motor çıkışları ayarlandı
zh_cn: 电机输出被设置

source: In simulation periodic code:
es_mx: En el código periódico de simulación:
fr_ca: Dans le code périodique de simulation:
tr_tr: Simülasyon periyodik kodunda:
zh_cn: 在模拟周期代码中：

source: The simulation's :term:`state` is updated using :term:`inputs <input>`, usually voltages from motors set from a PID loop
es_mx: El :term:`estado` de la simulación se actualiza usando :term:`entradas <input>`, generalmente voltajes de motores configurados desde un bucle PID
fr_ca: La simulation :term:`état` est mise à jour en utilisant les :term:`Entrées<input>`, généralement des tensions de moteurs réglés à partir d'une boucle PID
tr_tr: Simülasyonun :term:`state`i, :term:`inputs <input>` genellikle bir PID döngüsünden ayarlanmış motorlardan gelen voltajlar kullanılarak güncellenir.
zh_cn: 模拟的：术语：`状态` 使用中：术语：`输入`更新的，通常是来自PID回路设置的电机的电压

source: Simulated encoder (or other sensor) readings are set for user code to use in the next timestep
es_mx: Las lecturas del encoder (u otro sensor) se configuran para que el código de usuario las utilice en el siguiente paso de tiempo
fr_ca: Les lectures de l'encodeur simulé (ou d'un autre capteur) sont définies pour le code utilisateur à utiliser dans le prochain incrément de temps
tr_tr: Simüle edilmiş kodlayıcı (veya diğer sensör) okumaları, sonraki zaman adımında kullanıcı kodunun kullanılması için ayarlanır
zh_cn: 模拟编码器（或其他传感器）读数被设置为用户代码在下一个时间步骤中使用

source: WPILib's Simulation Classes
es_mx: Clases de simulación de WPILib
fr_ca: Classes de simulation de WPILib
tr_tr: WPILib'in Simülasyon Sınıfları
zh_cn: WPILib的模拟类

source: The following physics simulation classes are available in WPILib:
es_mx: Las siguientes clases de simulación física están disponibles en WPILib:
fr_ca: Les classes de simulation physique suivantes sont disponibles dans WPILib:
tr_tr: WPILib'de aşağıdaki fizik simülasyon sınıfları mevcuttur:
zh_cn: WPILib提供以下物理模拟类：

source: LinearSystemSim, for modeling systems with linear dynamics
es_mx: LinearSystemSim, para simular sistemas con dinámica lineal
fr_ca: LinearSystemSim, pour la modélisation de systèmes avec dynamique linéaire
tr_tr: Doğrusal dinamikli sistemleri modellemek için LinearSystemSim,
zh_cn: LinearSystemSim，用于具有线性动力学的系统建模

source: FlywheelSim
fr_ca: Volant d'inertie
tr_tr: FlywheelSim - Volan Sim

source: DifferentialDrivetrainSim
fr_ca: DifférentielDrivetrainSim
tr_tr: DiferansiyelDrivetrainSim

source: ElevatorSim, which models gravity
tr_tr: Yerçekimini modelleyen ElevatorSim
zh_cn: ElevatorSim，模拟重力

source: SingleJointedArmSim, which models gravity
tr_tr: Yerçekimini modelleyen SingleJointedArmSim
zh_cn: SingleJointedArmSim，用于模拟重力

source: BatterySim, which simply estimates battery voltage sag based on drawn currents
es_mx: BatterySim, que simplemente estima la caída de voltaje de la batería en función de las corrientes dibujadas
fr_ca: BatterySim, qui estime simplement l'affaissement de la tension de la batterie en fonction des courants tirés
tr_tr: Akü voltajı düşüşünü çekilen akımlara göre tahmin eden BatterySim
zh_cn: BatterySim，仅根据汲取的电流估算电池电压骤降

source: All simulation classes (with the exception of the differential drive simulator) inherit from the :code:`LinearSystemSim` class. By default, the dynamics are the linear system dynamics :math:`\mathbf{x}_{k+1} = \mathbf{A}\mathbf{x}_k + \mathbf{B}\mathbf{u}_k`. Subclasses override the :code:`UpdateX(x, u, dt)` method to provide custom, nonlinear dynamics, such as modeling gravity.
es_mx: Todas las clases de simulación (con la excepción del simulador de diferential drive) heredan de la clase :code:`LinearSystemSim`. Por defecto, la dinámica es la dinámica del sistema lineal :math:`\mathbf{x}_{k+1} = \mathbf{A}\mathbf{x}_k + \mathbf{B}\mathbf{u}_k`. Las subclases anulan el método :code:`UpdateX(x, u, dt)` para proporcionar dinámicas personalizadas y no lineales, como simular la gravedad.
fr_ca: Toutes les classes de simulation (à l'exception du simulateur d'entraînement différentiel) héritent de la classe :code:`LinearSystemSim`. Par défaut, la dynamique est la dynamique du système linéaire :math:`\mathbf{x}_{k+1} = \mathbf{A}\mathbf{x}_k + \mathbf{B}\mathbf{u}_k`. Les sous-classes remplacent la méthode :code:`UpdateX(x, u, dt)` pour fournir une dynamique non linéaire personnalisée, comme la modélisation de la gravité.
tr_tr: Tüm simülasyon sınıfları (diferansiyel sürücü simülatörü haricinde) :code:`LinearSystemSim` sınıfından miras alır. Varsayılan olarak, dinamikler doğrusal sistem dinamikleridir :math:`\mathbf{x}_{k+1} = \mathbf{A}\mathbf{x}_k + \mathbf{B}\mathbf{u}_k` . Alt sınıflar :code:`UpdateX(x, u, dt)` gibi methorları, yerçekimi modelleme, özel ve doğrusal olmayan dinamikler sağlamak için yöntemini geçersiz kılar.
zh_cn: 所有模拟类（差速驱动器模拟器除外）都继承自:code:`LinearSystemSim`类。默认情况下，动力学是线性系统动力学:math:`\mathbf{x}_{k+1} = \mathbf{A}\mathbf{x}_k + \mathbf{B}\mathbf{u}_k`。子类重写:code:`UpdateX(x, u, dt)` 方法，以提供自定义的非线性动力学，例如对重力建模。

source: Usage in User Code
es_mx: Uso en el código de usuario
fr_ca: Utilisation dans le code utilisateur
tr_tr: Kullanıcı Kodunda Kullanım
zh_cn: 用户代码中的用法

source: The following is available from the WPILib :code:`elevatorsimulation` `example project <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__.
tr_tr: Aşağıdakiler WPILib'den edinilebilir :code:`elevatorsimulation` `example project <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__.

source: In addition to standard objects such as motors and encoders, we instantiate our elevator simulator using known constants such as carriage mass and gearing reduction. We also instantiate an :code:`EncoderSim`, which sets the distance and rate read by our our :code:`Encoder`.
es_mx: Además de los objetos estándar como motores y encoders, instanciamos nuestro simulador de elevador utilizando constantes conocidas como la masa del carro y la reducción de engranajes. También creamos una instancia de un :code:`EncoderSim`, que establece la distancia y velocidad leídas por nuestro :code:`Encoder`.
fr_ca: En plus des objets standard tels que les moteurs et les encodeurs, nous instancions notre simulateur de mécanisme élévateur en utilisant des constantes connues telles que la masse du chariot et la réduction de la vitesse. Nous instancions également un :code:`EncoderSim`, qui définit la distance et la vélocité lues par notre :code:`Encoder`.
tr_tr: Motorlar ve kodlayıcılar gibi standart nesnelere ek olarak, asansör simülatörümüzü taşıma kütlesi ve dişli azaltma gibi bilinen sabitleri kullanarak somutlaştırıyoruz. Ayrıca: code: `Encoder` tarafından okunan mesafeyi ve oranı ayarlayan bir :code:`Encoder` oluşturuyoruz.
zh_cn: 除了像电机和编码器这样的标准对象之外，我们使用已知的常量(如运输质量和齿轮减速器)实例化我们的电梯模拟器。我们还实例化了一个：code：`EncoderSim`，它设置了我们的：code：‘Encoder’读取的距离和速率。

source: In the following example, we simulate an elevator given the mass of the moving carriage (in kilograms), the radius of the drum driving the elevator (in meters), the gearing reduction between motor and drum as output over input (so usually greater than one), the minimum and maximum height of the elevator (in meters), and some random noise to add to our position estimate.
es_mx: En el siguiente ejemplo, simulamos un elevador dada la masa del carro en movimiento (en kilogramos), el radio del tambor que impulsa el elevador (en metros), la reducción de engranajes entre el motor y el tambor como salida sobre la entrada (por lo que generalmente es mayor que uno), la altura mínima y máxima del ascensor (en metros), y algún ruido aleatorio para agregar a nuestra estimación de posición.
fr_ca: Dans l'exemple suivant, nous simulons un élévateur étant donné la masse du chariot mobile (en kilogrammes), le rayon du tambour entraînant l'élévateur (en mètres), la réduction de l'engrenage entre le moteur et le tambour en sortie sur entrée (donc généralement supérieure à one), la hauteur minimale et maximale de l'élévateur (en mètres) et du bruit aléatoire à ajouter à notre estimation de position.
tr_tr: Aşağıdaki örnekte, hareketli taşıyıcının kütlesi (kilogram cinsinden), asansörü tahrik eden tamburun yarıçapı (metre cinsinden), giriş üzerinden çıkış olarak motor ve tambur arasındaki dişli azalması (genellikle birden daha büyüktür) ile verilen bir asansörü simüle ediyoruz, asansörün minimum ve maksimum yüksekliği (metre cinsinden) ve konum tahminimize eklenecek bazı rastgele gürültü.
zh_cn: 在下面的例子中，我们模拟了一台电梯，给定了移动车厢的质量（以千克为单位）、驱动电梯的滚筒的半径（以米为单位）、电机和滚筒之间的齿轮减速作为输入输出（因此通常大于一）、电梯的最小和最大高度（以米为单位）以及要添加的一些随机噪声来估计我们的位置。

source: The elevator and arm simulators will prevent the simulated position from exceeding given minimum or maximum heights or angles. If you wish to simulate a mechanism with infinite rotation or motion, :code:`LinearSystemSim` may be a better option.
es_mx: Los simuladores de elevador y brazo evitarán que la posición simulada supere las alturas o ángulos mínimos o máximos dados. Si desea simular un mecanismo con rotación o movimiento infinito, :code:`LinearSystemSim` puede ser una mejor opción.
fr_ca: Les simulateurs d'élévateur et de bras empêcheront la position simulée de dépasser des hauteurs ou des angles minimum ou maximum donnés. Si vous souhaitez simuler un mécanisme avec une rotation ou un mouvement infini, :code:`LinearSystemSim` peut être une meilleure option.
tr_tr: Asansör ve kol simülatörleri, simüle edilmiş konumun verilen minimum veya maksimum yükseklik veya açıları aşmasını önleyecektir. Sonsuz dönme veya harekete sahip bir mekanizmayı simüle etmek istiyorsanız, :code:`LinearSystemSim` daha iyi bir seçenek olabilir.
zh_cn: 电梯和手臂模拟器将防止模拟位置超过给定的最小或最大高度或角度。如果要模拟具有无限旋转或运动的机构，：code:`LinearSystemSim`可能是更好的选择。

source: Next, :code:`teleopPeriodic`/:code:`TeleopPeriodic` (Java/C++) uses a simple PID control loop to drive our elevator to a setpoint 30 inches off the ground.
es_mx: A continuación, :code:`teleopPeriodic`/:code:`TeleopPeriodic` (Java/C++) utiliza un circuito de control PID simple para conducir nuestro elevador a un punto de ajuste de 30 pulgadas sobre el suelo.
fr_ca: Ensuite, :code:`teleopPeriodic`/:code:`TeleopPeriodic` (Java/C++) utilise une simple boucle de contrôle PID pour conduire notre elevateur à un point de consigne à 30 pouces (76 cm) du sol.
tr_tr: Daha sonra, :code:`teleopPeriodic`/:code:`TeleopPeriodic` (Java/C++), asansörümüzü yerden 30 inç yükseklikte bir ayar noktasına götürmek için basit bir PID kontrol döngüsü kullanır.
zh_cn: 下一步，代码：“遥循环”/代码：“遥循环”（java／C++）使用简单的PID控制回路来驱动我们的电梯到离地面30英寸的设置点。

source: Next, :code:`simulationPeriodic`/:code:`SimulationPeriodic` (Java/C++) uses the voltage applied to the motor to update the simulated position of the elevator. We use :code:`SimulationPeriodic` because it runs periodically only for simulated robots. This means that our simulation code will not be run on a real robot.
es_mx: A continuación, :code:`simulationPeriodic`/:code:`SimulationPeriodic` (Java/C++) utiliza el voltaje aplicado al motor para actualizar la posición simulada del elevador. Usamos :código:`SimulationPeriodic` porque se ejecuta periódicamente solo para robots simulados. Esto significa que nuestro código de simulación no se ejecutará en un robot real.
fr_ca: Puis, :code:`simulationPeriodic`/:code:`SimulationPeriodic` (Java/C++) utilise la tension appliquée au moteur pour mettre à jour la position simulée de l'élévateur. Nous utilisons :code:`SimulationPeriodic` car il s'exécute seulement que pour les robots simulés. Cela signifie que notre code de simulation ne sera pas exécuté sur un vrai robot.
tr_tr: Daha sonra, :code:`simulationPeriodic`/:code:`SimulationPeriodic` (Java/C++), asansörün simüle edilmiş konumunu güncellemek için motora uygulanan gerilimi kullanır. Sadece simüle edilmiş robotlar için periyodik olarak çalıştığı için :code:`SimulationPeriodic` kullanıyoruz. Bu, simülasyon kodumuzun gerçek bir robot üzerinde çalıştırılmayacağı anlamına gelir.
zh_cn: 其次，：code：`simulationPeriodic`/:code：`SimulationPeriodic`(JAVA/C++)利用施加在电机上的电压来更新电梯的模拟位置。我们使用的是：代码：“模拟周期”，因为它只为模拟机器人周期性地运行。这意味着我们的模拟代码不会在真正的机器人上运行。

source: Finally, the simulated encoder's distance reading is set using the simulated elevator's position, and the robot's battery voltage is set using the estimated current drawn by the elevator.
es_mx: Finalmente, la lectura de distancia del encoder se establece usando la posición del elevador simulado, y el voltaje de la batería del robot se establece usando la corriente estimada consumida por el elevador.
fr_ca: Enfin, la lecture de la distance du codeur simulé est réglée en utilisant la position simulée de l'élévateur, et la tension de la batterie du robot est réglée en utilisant le courant estimé tiré par l'ascenseur.
tr_tr: Son olarak, simüle edilmiş kodlayıcının mesafe okuması, simüle edilmiş asansörün konumu kullanılarak ayarlanır ve robotun pil voltajı, asansör tarafından çekilen tahmini akımı kullanılarak ayarlanır.
zh_cn: 最后，利用模拟电梯的位置设置模拟编码器的距离读数，利用电梯绘制的估计电流设置机器人的电池电压。

source: Swerve support for simulation is in the works, but we cannot provide an ETA. For updates on progress, please follow this `pull request <https://github.com/wpilibsuite/allwpilib/pull/3374>`__.
fr_ca: La prise en charge de la simulation par Swerve est en cours d’élaboration, mais nous ne pouvons pas fournir d’ETA. Pour des mises à jour sur les progrès, veuillez suivre ce `pull request <https://github.com/wpilibsuite/allwpilib/pull/3374>`__.

source: The following is available from the WPILib :code:`elevatorsimulation` `example project <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__.
es_mx: Lo siguiente está disponible en el WPILib :code:`elevatorsimulation` `proyecto de ejemplo <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__.
fr_ca: Ce qui suit est disponible à partir du `projet exemple <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__ de :code:`elevatorsimulation` de WPILib.
zh_cn: WPILib中的示例项目<https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/elevatorsimulation>`__提供了以下内容。
