Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-simulation/simulation-gui.po
Languages: es_mx, fr_ca, zh_cn

source: Simulation Specific User Interface Elements
es_mx: Elementos de la interfaz de usuario específicos de la simulación
fr_ca: Simulation d’éléments spécifiques de l’interface utilisateur
zh_cn: 模拟特定的用户界面元素

source: WPILib has extended robot simulation to introduce a graphical user interface (GUI) component. This allows teams to easily visualize their robot's inputs and outputs.
es_mx: WPILib ha ampliado la simulación del robot para introducir una interfaz gráfica del usuario (GUI por sus sigla en inglés: Graphical User Interface). Esto permite a los equipos visualizar fácilmente las entradas y salidas de información de sus robots.
fr_ca: WPILib a renforcé la simulation du robot en introduisant un composant d’interface utilisateur graphique (GUI). Cela permet aux équipes de visualiser facilement les entrées et les sorties de leur robot.
zh_cn: WPILib扩展了机器人仿真功能，以引入图形用户界面（GUI）组件。 这使团队可以轻松地可视化其机器人的输入和输出。

source: The Simulation GUI is very similar in many ways to :ref:`Glass <docs/software/dashboards/glass/introduction:Introduction to Glass>`. Some of the following pages will link to Glass sections that describe elements common to both GUIs.
fr_ca: L’Interface Utilisateur Graphique de simulation est très similaire à bien des égards à :ref:`Glass <docs/software/dashboards/glass/introduction:Introduction to Glass>`. Certaines des pages suivantes seront liées à des sections Glass qui décrivent des éléments communs aux deux interfaces graphiques.
zh_cn: 模拟 GUI 在许多方面与:ref:`Glass <docs/software/dashboards/glass/introduction:Introduction to Glass>` 非常相似。下面的一些页面将链接到 Glass 部分，这些部分描述了两种 GUI 的共同元素。

source: Running the GUI
es_mx: Ejecutando la GUI
fr_ca: Exécution de l’interface graphique
zh_cn: 运行GUI

source: Running simulation via VS Code
fr_ca: Exécution d’une simulation via VS Code
zh_cn: 通过 VS Code 运行模拟

source: You can simply launch the GUI via the **Run Simulation** command palette option.
es_mx: Usted puede simplemente abrir la GUI a través de la opción **Run Simulation** de la paleta de comandos.
fr_ca: Vous pouvez simplement démarrer l’interface graphique via l’option de palette de commandes **Run Simulation**.
zh_cn: 您只需通过**运行模拟**命令面板选项启动GUI。

source: Picking Sim GUI simulation extension
fr_ca: Choisir l’extension de simulation SIM GUI

source: And the ``Sim GUI`` option should popup in a new dialog and will be selected by default. Press :guilabel:`Ok`. This will now launch the Simulation GUI!
fr_ca: Et l’option ``Sim GUI`` devrait apparaître dans une nouvelle boîte de dialogue et sera sélectionnée par défaut. Appuyez sur :guilabel:`Ok`. Cette opération va à présent lancer l’interface graphique de simulation!

source: The simulation graphical user interface
fr_ca: L’interface utilisateur graphique de simulation
zh_cn: 模拟GUI

source: Using the GUI
es_mx: Usando la GUI
fr_ca: Utilisation de l’interface graphique
zh_cn: 使用GUI

source: Learning the Layout
es_mx: Aprendiendo el Layout
fr_ca: Comprendre la disposition graphique
zh_cn: 学习布局

source: Simulation graphical user interface but with labels
fr_ca: Interface utilisateur graphique de simulation mais avec des étiquettes
zh_cn: 有标签的模拟GUI

source: The following items are shown on the simulation GUI by default:
es_mx: Los siguientes elementos se muestran por defecto en la interfaz gráfica de la simulación:
fr_ca: Les éléments suivants sont affichés sur l’interface graphique de simulation par défaut:
zh_cn: 默认情况下，模拟GUI 上会显示以下项目：

source: **Robot State** - This is the robot's current state or "mode". You can click on the labels to change mode as you would on the normal Driver Station.
es_mx: **Robot State** - Este es el estado actual del robot o “mode”. Usted puede hacer clic en las etiquetas para cambiar el modo como lo harías en la Driver Station.
fr_ca: **Robot State** - Il s’agit de l’état actuel du robot ou "mode". station de pilotage (si c'est l'emplacement physique des pilotes), ou driver station (si c'est le logiciel) Vous pouvez cliquer sur les étiquettes pour changer de mode comme vous le feriez sur la Driver Station.
zh_cn: **机器人状态**-这是机器人的当前状态或“模式”。 你可以单击标签来更改模式，就像在普通Driver Station上一样。

source: **Timing** - Shows the values of the Robot's timers and allows the timing to be manipulated.
es_mx: **Temporización** - Muestra los valores de los temporizadores del Robot y permite manipular la temporización.
fr_ca: **Timing** - Affiche les valeurs des minuteurs ou timers du robot et permet de gérer le timing.
zh_cn: **计时** - 显示机器人计时器的值并允许操纵计时。

source: **System Joysticks** - This is a list of joysticks connected to your system currently.
es_mx: **System Joysticks** - Esta es una lista de los joysticks conectados actualmente a su sistema.
fr_ca: **System Joysticks** - Il s’agit de la liste des joysticks actuellement connectés à votre système.
zh_cn: **系统操纵杆**-这是当前连接到系统的操纵杆列表。

source: **FMS** - This is used for simulating many of the common FMS systems.
es_mx: **FMS** - Se utiliza para simular muchos de los sistemas comunes del sistema de gestión del campo.
fr_ca: **FMS** - Ceci est utilisé pour simuler de nombreux systèmes courants du FMS .
zh_cn: ** FMS **-用于模拟许多常见的FMS系统。

source: **NetworkTables** - This shows the data that has been published to NetworkTables.
es_mx: **NetworkTables** - Muestra los datos que se han publicado en NetworkTables.
fr_ca: **NetworkTables** - Ceci affiche les données qui ont été publiées sur les NetworkTables.
zh_cn: **NetworkTables** - 显示已发布到 NetworkTables 的数据。

source: **Joysticks** - This is joysticks that the robot code can directly pull from.
es_mx: **Joysticks** - Estos son los joysticks que el código del robot puede extraer directamente.
fr_ca: **Joysticks** - Ce sont des joysticks dont le code robot peut tirer directement des données.
zh_cn: **操纵杆**-这是可以直接从机器人代码中拉出的操纵杆。

source: **Other Devices** - This includes devices that do not fall into any of the other categories, such as the ADXRS450 gyro that is included in the Kit of Parts or third party devices that support simulation.
es_mx: **Otros dispositivos** - Esto incluye dispositivos que no entran en ninguna de las otras categorías, como el giroscopio ADXRS450 que se incluye en el kit de piezas o dispositivos de terceros que soportan la simulación.
fr_ca: **Other Devices** - Cela inclut les dispositifs qui ne font partie d’aucune des autres catégories, tel que le gyroscope ADXRS450 qui est inclus dans le kit de pièces ou les périphériques tiers qui prennent en charge la simulation.
zh_cn: **其他设备** - 这包括不属于任何其他类别的设备，例如部件套件中包含的 ADXRS450 陀螺仪或支持模拟的第三方设备。

source: The following items can be added from the Hardware menu, but are not shown by default.
es_mx: Los siguientes elementos pueden añadirse desde el menú Hardware, pero no se muestran por defecto.
fr_ca: Les éléments suivants peuvent être ajoutés à partir du menu Hardware, mais ne sont pas affichés par défaut.
zh_cn: 可以从硬件菜单添加以下项目，但默认情况下不显示。

source: **Addressable LEDs** - This shows LEDs controlled by the ``AddressableLED`` Class.
es_mx: **LEDs direccionables** - Muestra los LEDs controlados por la clase ``AddressableLED``.
fr_ca: **Addressable LEDs** - Ceci montre les LED contrôlées par la classe ``AddressableLED``
zh_cn: **Addressable LEDs** - 这显示了由“AddressableLED”类控制的 LED。

source: **Analog Inputs** - This includes any devices that would normally use the **ANALOG IN** connector on the roboRIO, such as any Analog based gyros.
es_mx: **Analog Inputs** - Esto incluye cualquier dispositivo que normalmente usaría la **ANALOG IN** o pin analógico en el roboRIO, como cualquier giroscopio analógico.
fr_ca: **Analog Inputs** - Cela inclut tous les dispositifs qui utiliseraient normalement le connecteur **ANALOG IN** sur le roboRIO, tels que n’importe quel gyros analogique.
zh_cn: **模拟输入**-包括通常使用roboRIO上的** ANALOG IN **连接器的任何设备，例如任何基于模拟的陀螺仪。

source: **DIO** - (Digital Input Output) This includes any devices that use the **DIO** connector on the roboRIO.
es_mx: **DIO** - (Digital Input Output) - Esto incluye cualquier dispositivo que utilice el conector DIO en el roboRIO.
fr_ca: **DIO** - (Digital Input Output ou Entrée Sortie Numérique) Cela inclut tous les dispositifs qui utilisent le connecteur **DIO** sur le roboRIO.
zh_cn: ** DIO **-（Digital Input Output 数字输入输出）这包括使用roboRIO上的** DIO **连接器的所有设备。

source: **Encoders** - This will show any instantiated devices that extend or use the ``Encoder`` class.
es_mx: **Encoders** - Esto mostrará cualquier dispositivo instanciado que extienda o utilice la clase ``Encoder`` .
fr_ca: **Encoders** - Cela affichera tous les dispositfs instanciés qui prolongent ou utilisent la classe ``Encoder``.
zh_cn: ** Encoders **-这将显示扩展或使用Encoder类的所有实例化设备。

source: **PDPs** - This shows the Power Distribution Panel object.
es_mx: **PDPs** - Muestra el objeto Panel de Distribución de Energía.
fr_ca: **PDPs** - Ceci montre l’objet Power Distribution Panel (Panneau de distribution de puissance)
zh_cn: **PDPs** - 显示配电面板对象。

source: **PWM Outputs** - This is a list of instantiated PWM devices. This will appear as many devices as you instantiate in robot code, as well as their outputs.
es_mx: **PWM Outputs** - Esta es una lista de dispositivos PWM instanciados. Esto aparecerá como muchos dispositivos a medida que crea instancias en el código del robot, así como sus salidas.
fr_ca: **PWM Outputs** - Il s’agit d’une liste de dispositifs qui sont des instances PWM. Il s'affichera autant de dispositifs que vous instanciez dans le code robot, ainsi que leurs sorties.
zh_cn: ** PWM输出**-这是实例化的PWM设备的列表。 这里会显示所有你在机器人代码中发动的设备以及它们的输出。

source: **Relays** - This includes any relay devices. This includes VEX Spike relays.
es_mx: **Relays** - Esto incluye cualquier dispositivo de relé. Esto incluye los relés VEX Spike.
fr_ca: **Relays** - Cela inclut tous les dispositifs de relais. Cela inclut les relais VEX Spike.
zh_cn: **继电器**-这包括任何继电器设备。 这包括VEX Spike继电器。

source: **Solenoids** - This is a list of "connected" solenoids. When you create a solenoid object and push outputs, these are shown here.
es_mx: **Solenoids** - Esta es una lista de los solenoides “connected” o conectados. Cuando usted crea un objeto solenoide y empuja las salidas de información, estas se muestran aquí.
fr_ca: **Solenoids** - Il s’agit de la liste des solénoïdes dans l'état "connected". Lorsque vous créez un objet solenoid et poussez (extend) les sorties, celles-ci sont affichées ici.
zh_cn: **螺线管**-这是“已连接”螺线管的列表。当你创建电磁对象并推动输出时，此处显示这些。

source: Adding a System Joystick to Joysticks
es_mx: Añadiendo un System Joystick a Joysticks
fr_ca: Ajout d’un joystick du système aux joysticks
zh_cn: 将系统操纵杆添加到操纵杆

source: To add a joystick from the list of system joysticks, simply click and drag a shown joystick under the "System Joysticks" menu to the "Joysticks" menu".
es_mx: Para añadir un joystick de la lista de joysticks del sistema, simplemente haga clic y arrastre un joystick mostrado en el menú "System Joysticks" al menú "Joysticks" .
fr_ca: Pour ajouter un joystick à partir de la liste des joysticks du système, il suffit de cliquer et de faire glisser un joystick affiché sous le menu "System Joysticks" au menu "Joysticks".
zh_cn: 要从系统操纵杆列表中添加操纵杆，只需在“系统操纵杆”菜单下单击并拖动显示的操纵杆到“操纵杆”菜单。

source: Dragging a joystick from System Joysticks to Joysticks
fr_ca: Faire glisser un joystick à partir du système de joysticks vers les joysticks
zh_cn: 将操纵杆从系统操纵杆拖动到操纵杆

source: The FRC\ |reg| Driver Station does special mapping to gamepads connected and the WPILib simulator does not "map" these by default. You can turn on this behavior by pressing the "Map gamepad" toggle underneath the "Joysticks" menu.
es_mx: La Driver Station de FRC\ |reg| hace un mapeo especial a los gamepads conectados y el simulador WPILib no los "mapea" por defecto. Puedes activar este comportamiento presionando la tecla "Map gamepad" debajo del menú "Joysticks".
fr_ca: L'application FRC\ |reg| Driver Station établit une correspondance spéciale pour les manettes de jeu connectées et le simulateur WPILib ne fait pas par défaut cette "correspondance". Vous pouvez activer ce comportement en appuyant sur la bascule "Map gamepad" sous le menu "Joysticks".
zh_cn: FRC \ | reg | Driver Station对连接的游戏手柄进行特殊映射，并且WPILib仿真器默认不会“映射”这些手柄。 您可以通过按“操纵杆”菜单下的“映射手柄”开关来打开此行为。

source: Using the Keyboard as a Joystick
es_mx: Utilizar el teclado como joystick
fr_ca: Utilisation du clavier comme joystick
zh_cn: 将键盘用作操纵杆

source: You add a keyboard to the list of system joysticks by clicking and dragging one of the keyboard items (e.g. Keyboard 0) just like a joystick above. To edit the settings of the keyboard go to the :guilabel:`DS` item in the menu bar then choose :guilabel:`Keyboard 0 Settings`. This allows you to control which keyboard buttons control which axis. This is a common example of how to make the keyboard similar to a split sticks arcade drive on an Xbox controller (uses axis 1 & 4):
es_mx: Se añade un teclado a la lista de joysticks del sistema haciendo clic y arrastrando uno de los elementos del teclado (por ejemplo, el Teclado 0) al igual que un joystick anterior. Para editar la configuración del teclado vaya al elemento :guilabel:`DS` en la barra de menú y luego elija :guilabel:`Keyboard 0 Settings`. Esto le permite controlar qué botones del teclado controlan cada eje. Este es un ejemplo común de cómo hacer que el teclado sea similar a un mando arcade de split sticks en un controlador de Xbox (utiliza los ejes 1 y 4):
fr_ca: Vous ajoutez un clavier à la liste des joysticks système en cliquant et en faisant glisser l’un des éléments du clavier (par exemple clavier 0) tout comme un joystick ci-dessus. Pour modifier les paramètres du clavier, rendez-vous sur l’élément :guilabel:`DS` dans la barre de menu, puis choisissez :guilabel:`Keyboard 0 Settings`. Cela vous permet de contrôler quels boutons de clavier contrôlent quel axe. Il s’agit d’un exemple courant montrant la façon de rendre le clavier semblable à un split sticks arcade drive sur une manette Xbox (utilise l’axe 1 & 4):
zh_cn: 您可以通过单击并拖动键盘项目之一（例如键盘 0）来将键盘添加到系统操纵杆列表中，就像上面的操纵杆一样。要编辑键盘设置，请转到菜单栏中的 DS 项，然后选择键盘 0 设置。这允许您控制哪个键盘按钮控制哪个轴。这是如何使键盘类似于 Xbox 控制器（使用轴 1 和 4）上的分体式街机驱动器的常见示例：

source: How to configure the keyboard so it acts similar to an Xbox controller.
fr_ca: Comment configurer le clavier pour qu’il agisse de manière similaire à une manette Xbox.
zh_cn: 如何配置键盘使其类似于 Xbox 控制器。

source: Modifying ADXRS450 Inputs
es_mx: Modificar las Entradas del Giroscopio ADXRS450.
fr_ca: Modification des entrées ADXRS450
zh_cn: 修改ADXRS450输入

source: Using the ADXRS450 object is a fantastic way to test gyro based outputs. This will show up in the "Other Devices" menu. A drop down menu is then exposed that shows various options such as "Connected", "Angle", and "Rate". All of these values are values that you can change, and that your robot code and use on-the-fly.
es_mx: Usar el objeto ADXRS450 es una forma fantástica de probar las salidas basadas en giroscopios. Esto se expondrá en el menú "Other Devices". Entonces se expone un menú desplegable que muestra varias opciones como "Connected", "Angle", y "Rate". Todos estos valores son valores que puede cambiar en el código y que su robot puede usar en la marcha.
fr_ca: L’utilisation de l’objet ADXRS450 est un excellent moyen de tester des sorties du gyroscope. Pour le voir, allez au menu "Other Devices". Un menu déroulant est ensuite exposé qui affiche différentes options telles que "Connected", "Angle", et "Rate". Toutes ces valeurs sont des valeurs que vous pouvez modifier, et que votre code robot peut utiliser à la volée.
zh_cn: 使用ADXRS450对象是测试基于陀螺仪的输出的绝佳方法。 这将显示在“其他设备”菜单中。 然后会显示一个下拉菜单，其中显示了各种选项，例如“ Connected”，“ Angle”和“ Rate”。 所有这些值都是可以更改的值，并且是你的机器人代码并可以即时使用。

source: Determining Simulation from Robot Code
es_mx: Determinando la Simulación a Partir del Código del Robot.
fr_ca: Détermination de la simulation à partir du code robot
zh_cn: 根据机器人代码确定模拟

source: In cases where vendor libraries do not compile when running the robot simulation, you can wrap their content with ``RobotBase.isReal()`` which returns a ``boolean``.
es_mx: En los casos en que las librerías de los proveedores no compilan al ejecutar la simulación del robot, usted puede envolver su contenido con ``RobotBase.isReal()`` que regresa un ``boolean``.
fr_ca: Dans les cas où les librairies de fournisseurs ne compilent pas lors de l’exécution de la simulation de robot, vous pouvez envelopper leur contenu avec ``RobotBase.isReal()`` laquelle renvoie un ``boolean``.
zh_cn: 如果在运行机器人仿真时供应商库无法编译，则可以使用“ RobotBase.isReal（）”包装它们的内容，这将返回“布尔值”。

source: Reassigning value types in C++ requires move or copy assignment; vendors classes that both do not support the SIM and lack a move or copy assignment operator cannot be worked around with conditional allocation unless a pointer is used, instead of a value type.
es_mx: Reasignar los tipos de valores en C++ requiere mover o copiar la asignación; las clases de proveedores que ambos no soportan la simulación y carecen de un operador de asignación de movimiento o copia, no puede ser trabajado con asignación condicional a menos que se use un puntero, en lugar de un tipo de valor.
fr_ca: La réaffectation des types de valeurs en C++ nécessite un déplacement ou une affectation de copie; les classes venant de fournisseurs qui ne supportent pas la carte SIM et qui n’ont pas d’opérateur d’affectation de déplacement ou d’affectation de copie ne peuvent pas être prises en charge par une allocation conditionnelle à moins qu’un pointeur ne soit utilisé, au lieu d’un type de valeur.
zh_cn: 在C ++中，重新分配值类型需要移动或复制分配。 除非使用指针而不是值类型，否则既不支持SIM又缺少移动或副本分配运算符的供应商类无法通过条件分配解决。

source: Changing View Settings
es_mx: Cambiar la configuración de la vista
fr_ca: Modification des paramètres d'affichage
zh_cn: 更改视图设置

source: The :guilabel:`View` menu item contains :guilabel:`Zoom` and :guilabel:`Style` settings that can be customized. The :guilabel:`Zoom` option dictates the size of the text in the application whereas the :guilabel:`Style` option allows you to select between the ``Classic``, ``Light``, and ``Dark`` modes.
es_mx: El elemento :guilabel:`View` del menú contiene configuraciones de :guilabel:`Zoom` y :guilabel:`Style` que se pueden personalizar. La opción de :guilabel:`Zoom` dicta el tamaño del texto en la aplicación mientras que la opción de :guilabel:`Style` le permite seleccionar entre los modos ``Clásico``, ``Claro``, y ``Oscuro``.
fr_ca: L'élément de menu :guilabel:`View` contient les réglages :guilabel:`Zoom` et :guilabel:`Style`: qui peuvent être personnalisés. L'option :guilabel:`Zoom` dicte la taille du texte dans l'application tandis que l'option :guilabel:`Style` vous permet de choisir entre les options ``Classic``, ``Light``, et ``Dark``.
zh_cn: “视图”菜单项包含可以自定义的“缩放”和“样式”设置。 “缩放”选项决定了应用程序中文本的大小，而“样式”选项则允许您在“标准”，“亮”和“暗”模式之间进行选择.

source: An example of the ``Dark`` style setting is below:
es_mx: Un ejemplo sobre la configuración en estilo ``Oscuro`` esta abajo:
fr_ca: Un exemple du paramètre de style ``Dark`` est ci-dessous:
zh_cn: 深色样式设置的例子如下：

source: Clearing Application Data
es_mx: Borrar datos de la aplicación
fr_ca: Effacement des données d'application
zh_cn: 清除申请数据

source: Application data for the Simulation GUI, including widget sizes and positions as well as other custom information for widgets is stored in a ``imgui.ini`` file. This file is stored in the root of the project directory that the simulation is run from.
es_mx: Los datos de la aplicación para la GUI de la simulación, incluyendo los tamaños y posiciones de los widgets, así como otra información personalizada para los widgets, se almacenan en un archivo ``imgui.ini``. Este archivo se almacena en la raíz del directorio del proyecto desde el que se ejecuta la simulación.
fr_ca: Les données d’application pour l’interface graphique de simulation, y compris la taille et les positions des widgets ainsi que d’autres informations personnalisées pour les widgets, sont stockées dans un fichier ``imgui.ini``. Ce fichier est situé dans la racine du dossier contenant le projet à partir duquel la simulation est lancée.
zh_cn: 模拟 GUI 的应用程序数据，包括小部件大小和位置以及小部件的其他自定义信息，都存储在“imgui.ini”文件中。该文件存储在运行模拟的项目目录的根目录中。

source: The ``imgui.ini`` configuration file can simply be deleted to restore the Simulation GUI to a "clean slate".
es_mx: El archivo de configuración ``imgui.ini`` puede ser simplemente borrado para restaurar la GUI de Simulación a una "pizarra limpia".
fr_ca: Le fichier de configuration ``imgui.ini`` peut simplement être supprimé pour restaurer l’interface graphique de simulation à un "état vierge".
zh_cn: ``imgui.ini`` 配置文件可以简单地删除以将模拟 GUI 恢复到“干净的状态”。

source: Picking halsim_gui.dll simulation extension
zh_cn: 挑选halsim_gui.dll模拟扩展

source: And the ``halsim_gui.dll`` option should popup in a new dialog (``halsim.gui.so`` on Linux and ``halsim_gui.dylib`` on macOS). Select this and press **Ok**. This will now launch the Simulation GUI!
zh_cn: ``halsim_gui.dll`` 选项应该会在一个新对话框中弹出（Linux 上的``halsim.gui.so`` 和 macOS 上的``halsim_gui.dylib``）。选择此项并按**确定**。现在将启动模拟 GUI！
