Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-simulation/unit-testing.po
Languages: es_mx, fr_ca, zh_cn

source: Unit Testing
fr_ca: Test unitaire
zh_cn: 单元测试

source: Writing Testable Code
es_mx: Escribir código para pruebas
fr_ca: Écriture de code testable
zh_cn: 编写可测试的代码

source: This example can be easily adapted to the command-based paradigm by having ``Intake`` inherit from ``SubsystemBase``.
es_mx: Este ejemplo se puede adaptar fácilmente al paradigma basado en comandos haciendo que ``Intake`` herede de ``SubsystemBase``.
fr_ca: Cet exemple peut être facilement adapté au paradigme orienté commande en dérivant (héritage) ``Intake`` de ``SubsystemBase``.
zh_cn: 通过让“Intake”从“SubsystemBase”继承，这个例子可以很容易地适应基于指令的范例。

source: Our subsystem will be an Infinite Recharge intake mechanism containing a piston and a motor: the piston deploys/retracts the intake, and the motor will pull the Power Cells inside. We don't want the motor to run if the intake mechanism isn't deployed because it won't do anything.
es_mx: Nuestro subsistema será un mecanismo Intake para Infinite Recharge que contiene un pistón y un motor: el pistón despliega/retrae la admisión y el motor arrastrará las Power Cells hacia adentro. No queremos que el motor funcione si el mecanismo de admisión no está desplegado porque no hará nada.
fr_ca: Notre sous-système sera un mécanisme Intake du défin Infinite Recharge constitué d'un piston et d'un moteur : le piston déploie/rétracte le Intake, et le moteur tirera les cellules de puissance à l’intérieur. Nous ne voulons pas que le moteur fonctionne si le mécanisme Intake n’est pas déployé parce qu’il n'aura aucun effet.
zh_cn: 我们的子系统将是一个 Infinite Recharge 进气机构，包含一个活塞和一个电机：活塞展开/收回进气口，电机将把电池拉到里面。如果未部署进气机构，我们不希望电机运行，因为它不会做任何事情。

source: To provide a "clean slate" for each test, we need to have a function to destroy the object and free all hardware allocations. In Java, this is done by implementing the ``AutoCloseable`` interface and its ``.close()`` method, destroying each member object by calling the member's ``.close()`` method - an object without a ``.close()`` method probably doesn't need to be closed. In C++, the default destructor will be called automatically when the object goes out of scope and will call destructors of member objects.
es_mx: Para proporcionar una "pizarra limpia" para cada prueba, necesitamos tener una función para destruir el objeto y liberar todas las asignaciones de hardware. En Java, esto se hace implementando la interfaz ``AutoCloseable`` y su método ``.close()``, destruyendo cada objeto de los miembros al llamar al método ``.close()`` del objeto - un objeto sin un método ``.close()`` probablemente no necesite ser cerrado. En C ++, el destructor predeterminado se llamará automáticamente cuando el objeto salga del alcance y llamará a los destructores de los objetos miembros.
fr_ca: Pour fournir un "clean slate" pour chaque test, nous avons besoin d’avoir une fonction pour détruire l’objet et libérer toutes les allocations matérielles. En Java, cela se fait en implémentant l’interface ``AutoCloseable`` et sa méthode ``.close()``, détruisant chaque objet membre en appelant la méthode membre ``.close()`` - un objet sans méthode ``.close()`` n’a probablement pas besoin d’être fermé. En C++, le destructeur par défaut sera appelé automatiquement lorsque l’objet sort de sa portée et appellera à son tour les destructeurs des objets membres.
zh_cn: 为了为每个测试提供一个“干净的石板”，我们需要有一个函数来销毁对象并释放所有硬件分配。在 Java 中，这是通过实现 AutoCloseable 接口及其 .close() 方法来完成的，通过调用成员的 .close() 方法来销毁每个成员对象 - 一个没有 ` 的对象`.close()`` 方法可能不需要关闭。在C++中，当对象超出作用域时会自动调用默认的析构函数，并调用成员对象的析构函数。

source: Vendors might not support resource closing identically to the way shown here. See your vendor's documentation for more information as to what they support and how.
es_mx: Es posible que los proveedores no admitan el cierre de recursos de la misma manera que se muestra aquí. Consulte la documentación de su proveedor para obtener más información sobre qué admiten y cómo.
fr_ca: Les fournisseurs tiers peuvent ne pas prendre en charge la fermeture des ressources de la même manière que celle indiquée ici. Consultez la documentation de votre fournisseur pour plus d’informations sur ce qu’il prend en charge et comment.
zh_cn: 供应商可能不支持与此处显示的方式相同的资源关闭。有关他们支持的内容和方式的更多信息，请参阅供应商的文档。

source: C++ (Header)
es_mx: C++ (Encabezado)
fr_ca: C++ (Header ou en-tête)

source: Writing Tests
fr_ca: Écriture des Tests
zh_cn: 编写测试

source: Tests are placed inside the ``test`` source set: ``/src/test/java/`` and ``/src/test/cpp/`` for Java and C++ tests, respectively. Files outside that source root do not have access to the test framework - this will fail compilation due to unresolved references.
es_mx: Los tests se colocan dentro del conjunto de fuentes de ``test``: ``/src/test/java/`` y ``/src/test/cpp/`` para tests de Java y C++ respectivamente. Los archivos fuera de esa raíz de origen no tienen acceso al marco de prueba; esto fallará en la compilación debido a referencias sin resolver.
fr_ca: Les tests sont placés à l’intérieur de l’ensemble source ``test`` : ``/src/test/java/`` et ``/src/test/cpp/`` pour les tests Java et C++, respectivement. Les fichiers en dehors de cette racine source n’ont pas accès au cadre de test - cela fera échouer la compilation en raison de références non résolues.
zh_cn: 测试放置在 ``test`` 源集中：``/src/test/java/`` 和 ``/src/test/cpp/`` 分别用于 Java 和 C++ 测试。该源根目录之外的文件无法访问测试框架 - 由于未解析的引用，这将导致编译失败。

source: In Java, each test class contains at least one test method marked with ``@org.junit.Test``, each method representing a test case. Additional methods for opening resources (such as our ``Intake`` object) before each test and closing them after are respectively marked with ``@org.junit.Before`` and ``@org.junit.After``. In C++, test fixture classes inheriting from ``testing::Test`` contain our subsystem and simulation hardware objects, and test methods are written using the ``TEST_F(testfixture, testname)`` macro. The ``SetUp()`` and ``TearDown()`` methods can be overridden in the test fixture class and will be run respectively before and after each test.
es_mx: En Java, cada clase de prueba contiene al menos un método de prueba marcado con ``@org.junit.Test``, cada método representa un caso de prueba. Los métodos adicionales para abrir recursos (como nuestro objeto ``Intake``) antes de cada prueba y cerrarlos después están marcados respectivamente con ``@org.junit.Before`` y ``@org.junit.After``. En C++, las clases de test fixture que heredan de ``testing::Test`` contienen nuestros objetos de subsistema y hardware de simulación, y los métodos de prueba se escriben utilizando la macro ``TEST_F(testfixture, testname)``. Los métodos ``SetUp()`` y ``TearDown()`` pueden ser sobreescritos en la clase test fixture y se ejecutarán respectivamente antes y después de cada prueba.
fr_ca: En Java, chaque classe de test contient au moins une méthode de test marquée de ``@org.junit.Test``, chaque méthode représentant un cas de test. D’autres méthodes d’ouverture des ressources (telles que notre objet ``Intake``) avant chaque test et leur fermeture après sont respectivement marquées de ``@org.junit.Before`` et ``@org.junit.After``. En C++, les classes de montage de test héritant de ``testing::Test`` contiennent nos objets matériels pour les sous-systèmes et la simulation, et les méthodes de test sont écrites à l’aide de la macro ``TEST_F(testfixture, testname)``. Les méthodes ``SetUp()`` et ``TearDown()`` peuvent être remplacées dans la classe de montage d’essai et seront exécutés respectivement avant et après chaque test.
zh_cn: 在 Java 中，每个测试类至少包含一个标记为“@org.junit.Test”的测试方法，每个方法代表一个测试用例。在每次测试之前打开资源（例如我们的 ``Intake`` 对象）和在测试之后关闭它们的附加方法分别用``@org.junit.Before`` 和 ``@org.junit.After`` 标记。在 C++ 中，从 ``testing::Test`` 继承的测试夹具类包含我们的子系统和模拟硬件对象，并且使用 ``TEST_F(testfixture, testname)`` 宏编写测试方法。 ``SetUp()`` 和 ``TearDown()`` 方法可以在测试装置类中被覆盖，并将分别在每次测试之前和之后运行。

source: Each test method should contain at least one *assertion* (``assert*()`` in Java or ``EXPECT_*()`` in C++). These assertions verify a condition at runtime and fail the test if the condition isn't met. If there is more than one assertion in a test method, the first failed assertion will crash the test - execution won't reach the later assertions.
es_mx: Cada método de prueba debe contener al menos una *aserción* (``assert*()`` en Java o ``EXPECT_*()`` en C++). Estas aserciones verifican una condición en tiempo de ejecución y fallan la prueba si la condición no se cumple. Si hay más de una aserción en un método de prueba, la primera aserción fallida bloqueará la prueba - la ejecución no llegará a las aserciones posteriores.
fr_ca: Chaque méthode de test doit contenir au moins une *assertion* (``assert*()`` en Java ou ``EXPECT_*()`` en C++). Ces assertions vérifient une condition à moment de l’exécution et échouent au test si la condition n’est pas remplie. S’il y a plus d’une assertion dans une méthode de test, la première assertion échouée plantera le test - l’exécution n’atteindra pas les assertions subséquentes.
zh_cn: 每个测试方法应至少包含一个 *assertion*（Java 中的“assert*()”或 C++ 中的“EXPECT_*()”）。这些断言在运行时验证条件，如果不满足条件，则测试失败。如果测试方法中有多个断言，第一个失败的断言将使测试崩溃 - 执行不会到达后面的断言。

source: Both JUnit and GoogleTest have multiple assertion types, but the most common is equality: ``assertEquals(expected, actual)``/``EXPECT_EQ(expected, actual)``. When comparing numbers, a third parameter - ``delta``, the acceptable error, can be given. In JUnit (Java), these assertions are static methods and can be used without qualification by adding the static star import ``import static org.junit.Asssert.*``. In Google Test (C++), assertions are macros from the ``<gtest/gtest.h>`` header.
es_mx: Tanto JUnit como GoogleTest tienen múltiples tipos de aserción, pero la más común es la de igualdad: ``assertEquals(expected, actual)``/`EXPECT_EQ(expected, actual)``. Cuando se comparan números, se puede dar un tercer parámetro: ``delta``, el error aceptable. En JUnit (Java), estas aserciones son métodos estáticos y se pueden utilizar sin calificación añadiendo la estrella estática import ``import static org.junit.Asssert.*``. En Google Test (C++), las aserciones son macros de la cabecera ``<gtest/gtest.h>``.
fr_ca: JUnit et GoogleTest ont tous deux plusieurs types d’assertions, mais la plus commune est l’égalité : ``assertEquals(valeur attendue, valeur actuelle)``/``EXPECT_EQ(valeur attendue, valeur actuelle)``. Lors de la comparaison des nombres, un troisième paramètre - ``delta``, l’erreur acceptable, peut être donné. Dans JUnit (Java), ces assertions sont des méthodes statiques et peuvent être utilisées sans qualification en ajoutant l’importation statique étoile (star) ``import static org.junit.Asssert.*``. Dans Google Test (C++), les assertions sont des macros de l’en-tête ``<gtest/gtest.h>``.
zh_cn: JUnit 和 GoogleTest 都有多种断言类型，但最常见的是相等：``assertEquals(expected, actual)``/``EXPECT_EQ(expected, actual)``。比较数字时，可以给出第三个参数 - ``delta``，可接受的误差。在 JUnit (Java) 中，这些断言是静态方法，可以通过添加 static star import ``import static org.junit.Asssert.*`` 不加限定地使用。在 Google Test (C++) 中，断言是来自 ``<gtest/gtest.h>`` 标头的宏。

source: Comparison of floating-point values isn't accurate, so comparing them should be done with an acceptable error parameter (``DELTA``).
es_mx: La comparación de valores de punto flotante no es precisa, por lo que la comparación debe hacerse con un parámetro de error aceptable (``DELTA``).
fr_ca: La comparaison des valeurs en point-flottants n’est pas exacte, de sorte que leur comparaison doit être faite avec un paramètre d’erreur acceptable (``DELTA``).
zh_cn: 浮点值的比较不准确，因此应该使用可接受的错误参数（``DELTA``）进行比较。

source: For more advanced usage of JUnit and Google Test, see the framework docs.
es_mx: Para un uso más avanzado de JUnit y Google Test, consulte la documentación del framework.
fr_ca: Pour une utilisation plus avancée de JUnit et Google Test, consultez les documents cadres.
zh_cn: 有关 JUnit 和 Google Test 的更高级用法，请参阅框架文档。

source: Running Tests
es_mx: Pruebas para correrlo
fr_ca: Exécution des tests
zh_cn: 运行测试

source: Tests will always be run in simulation on your desktop. For prerequisites and more info, see :doc:`the simulation introduction <introduction>`.
es_mx: Las pruebas se ejecutarán siempre en simulación en su escritorio. Para conocer los requisitos previos y más información, consulte el documento :doc:`introducción a la simulación<introduction>`.
fr_ca: Les tests seront toujours exécutés en simulation sur votre bureau. Pour les conditions préalables et plus d’informations, consultez :doc:`Introduction à la simulation <introduction>`.
zh_cn: 测试将始终在您的桌面上以模拟方式运行。有关先决条件和更多信息，请参阅:doc:`模拟介绍`。

source: For Java tests to run, make sure that your ``build.gradle`` file contains the following block:
es_mx: Para que las pruebas Java se ejecuten, asegúrese de que su archivo ``build.gradle`` contenga el siguiente bloque:
fr_ca: Pour que les tests Java s’exécutent, assurez-vous que votre fichier ``build.gradle`` contient le bloc suivant :
zh_cn: 要运行 Java 测试，请确保您的“build.gradle”文件包含以下块：

source: Use :guilabel:`Test Robot Code` from the Command Palette to run the tests. Results will be reported in the terminal output, each test will have a ``FAILED`` or ``PASSED``/``OK`` label next to the test name in the output. JUnit (Java only) will generate a HTML document in ``build/reports/tests/test/index.html`` with a more detailed overview of the results; if there are failied test a link to render the document in your browser will be printed in the terminal output.
es_mx: Utilice :guilabel:`Test Robot Code` de la paleta de comandos para ejecutar las pruebas. Los resultados serán reportados en la salida de la terminal, cada prueba tendrá una etiqueta ``FAILED`` o ``PASSED``/``OK`` junto al nombre de la prueba en la salida. JUnit (sólo en Java) generará un documento HTML en ``build/reports/tests/test/index.html`` con un resumen más detallado de los resultados; si hay pruebas fallidas se imprimirá en la salida de la terminal un enlace para renderizar el documento en el navegador.
fr_ca: Utilisez :guilabel:`Test Robot Code` de la palette de Commande pour exécuter les tests. Les résultats seront affichés dans le terminal de sortie, chaque test aura une étiquette ``FAILED`` ou ``PASSED``/``OK`` à côté du nom de test dans la sortie. JUnit (Java uniquement) générera un document HTML dans ``build/reports/tests/test/index.html`` avec une vue d’ensemble plus détaillée des résultats; s’il y a un test qui a échoué un lien pour rendre le document dans votre navigateur sera imprimé dans le terminal de sortie.
zh_cn: 使用指令面板中的 :guilabel:`Test Robot Code` 来运行测试。结果将在终端输出中报告，每个测试在输出中的测试名称旁边都有一个“FAILED”或“PASSED”/“OK”标签。 JUnit（仅限 Java）将在“build/reports/tests/test/index.html”中生成一个 HTML 文档，其中包含更详细的结果概述；如果测试失败，将在终端输出中打印在浏览器中呈现文档的链接。

source: By default, Gradle runs the tests whenever robot code is built, including deploys. This will increase deploy time, and failing tests will cause the build and deploy to fail. To prevent this from happening, you can use :guilabel:`Change Skip Tests On Deploy Setting` from the Command Palette to configure whether to run tests when deploying.
es_mx: Por defecto, Gradle ejecuta las pruebas cada vez que se construye el código del robot, incluyendo los despliegues. Esto aumentará el tiempo de despliegue, y las pruebas fallidas harán que la construcción y el despliegue fallen. Para evitar que esto ocurra, puedes utilizar :guilabel:`Change Skip Tests On Deploy Setting` de la paleta de comandos para configurar si se ejecutan las pruebas al desplegar.
fr_ca: Par défaut, Gradle exécute les tests chaque fois que le code robot est compilé, y compris les déploiements. Cela augmentera le temps de déploiement, et des tests défaillants et provoquera l’échec de la compilation et du déploiement. Pour éviter que cela ne se produise, vous pouvez utiliser :guilabel:`Change Skip Tests On Deploy Setting` de la palette de commande pour configurer, s’il y a lieu, l'exécution des tests lors du déploiement.
zh_cn: 默认情况下，Gradle 会在构建机器人代码（包括部署）时运行测试。这将增加部署时间，失败的测试将导致构建和部署失败。为了防止这种情况发生，您可以使用指令面板中的:guilabel:`Change Skip Tests On Deploy Setting` 来配置是否在部署时运行测试。

source: C++ (Source)
es_mx: C++ (Fuente)
