Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-characterization/analyzing-data.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Analyzing Data
es_mx: Analizando Datos
fr_ca: Analyse des données
tr_tr: Verileri Analiz Etme
zh_cn: 分析数据

source: WPILib standarizes on SI units, so its recommended that the :guilabel:`Units` option is set to **Meters**.
fr_ca: WPILib standardise les unités pour n'utiliser désormais que les unités en SI, de sorte qu’il a recommandé que l’option :guilabel:`Units` est définie à **Meters**.
zh_cn: WPILib代表SI单位，因此建议将：guilabel：`Units`选项设置为** Meters **。

source: Once we have data from a characterization run, we can analyze it. To launch the data analyzer, click on the :guilabel:`Launch Data Analyzer` button.
es_mx: Una vez que tenemos los datos de una ejecución de caracterización, podemos analizarlos. Para iniciar el analizador de datos, haga clic en el botón :guilabel:`Launch Data Analyzer`.
fr_ca: Une fois que nous avons des données d’une série de caractérisation, nous pouvons les analyser. Pour lancer l’analyseur de données, cliquez sur le bouton :guilabel:`Launch Data Analyzer`.
tr_tr: Bir karakterizasyon çalışmasından veri aldığımızda, onu analiz edebiliriz. Veri analizcisini başlatmak için : guilabel: `Launch Data AnalyzerVeri Analizörünü Başlat` düğmesine tıklayın.
zh_cn: 一旦获得了Characterization Run 的数据，就可以对其进行分析。要启动数据分析仪，请单击``启动数据分析仪''按钮。

source: Loading your Data File
es_mx: Cargando su archivo de datos
fr_ca: Chargement de votre fichier de données
tr_tr: Veri Dosyanızı Yükleme
zh_cn: 加载数据文件

source: Now it's time to load the data file we saved from the logger tool. Click on :guilabel:`Select Data File`.
es_mx: Ahora es el momento de cargar el archivo de datos que guardamos desde la herramienta de registro. Haga clic en :guilabel:`Select Data File`.
fr_ca: Maintenant, il est temps de charger le fichier de données que nous avons enregistré à partir de l’outil enregistreur de données. Cliquez sur :guilabel:`Select Data File`.
tr_tr: Şimdi kaydedici aracından kaydettiğimiz veri dosyasını yükleme zamanı. Şuna tıklayın :guilabel:`Select Data File`.
zh_cn: 现在是时候加载我们从记录器工具保存的数据文件了,点击``选择数据文件''。

source: In the resulting file dialog, select the JSON file you want to analyze. If the file appears to be malformed, an error will be shown.
es_mx: En el documento de diálogo resultante, seleccione el documento JSON que quiere analizar. Si el documento aparece como malformado, un error será mostrado.
fr_ca: Dans la boîte de dialogue de fichier résultante, sélectionnez le fichier JSON à analyser. Si le fichier semble mal formé, une erreur s’affiche.
tr_tr: Ortaya çıkan dosya iletişim kutusunda, analiz etmek istediğiniz JSON dosyasını seçin. Dosya bozuk görünüyorsa, bir hata gösterilir.
zh_cn: 在出现的文件对话框中，选择要分析的JSON文件。如果文件有缺陷，将显示错误。

source: Running Feedforward Analysis
es_mx: Ejecución de análisis de avances
fr_ca: Exécution de l’analyse prédictive
tr_tr: İleri Besleme Analizi Çalıştırma
zh_cn: 运行前馈分析

source: Once a data file has been selected, the :guilabel:`Analyze Data` button, :guilabel:`Units` entry, and :guilabel:`Units per rotation` entry become available in the :guilabel:`Feedforward Analysis` frame. We can now set the units of the analysis to match the units that our program will be using.
es_mx: Una vez que se ha seleccionado un archivo de datos, el botón de entrada :guilabel:`Analyze Data`, :guilabel:`Units` y :guilabel:`Units per rotation` están disponibles en el marco :guilabel:`Feedforward Analysis`. Ahora podemos establecer las unidades del análisis para que coincidan con las unidades que utilizará nuestro programa.
fr_ca: Une fois qu’un fichier de données a été sélectionné, le bouton :guilabel:`Analyze Data`, l'entrée :guilabel:`Units`, et l'entrée :guilabel:`Units per rotation` deviennent disponibles dans le cadre :guilabel:`Feedforward Analysis`. Nous pouvons maintenant définir les unités de l’analyse pour qu'elles correspondent aux unités que notre programme utilisera.
tr_tr: Bir veri dosyası seçildikten sonra, : guilabel:`Analyze Data-Verileri Analiz Et` düğmesi,: guilabel: `Units-Birimler` girişi ve: guilabel:`Units per rotation-Döndürme başına birimler` girişi : guilabel: `Feedforward Analysis-İlerleme Yöntemi Analizi` çerçevesinde kullanılabilir hale gelir. Artık analizin birimlerini programımızın kullanacağı birimlerle eşleşecek şekilde ayarlayabiliriz.
zh_cn: 选择数据文件后，点击``Analyze Data`` 按钮、``Units`` 条目和“单位旋转”条目在“前馈分析”框架中可用。现在，我们可以设置分析单位以匹配程序将使用的单位。

source: Now click the :guilabel:`Analyze Data` button.
es_mx: Ahora haga clic en el botón :guilabel:`Analizar datos`.
fr_ca: Cliquez maintenant sur le bouton :guilabel:`Analyze Data`.
tr_tr: Şimdi :guilabel:`Analyze Data` düğmesine tıklayın.
zh_cn: 现在，单击“分析数据”按钮。

source: If you would like to change units, you will have to press the :guilabel:`Analyze Data` and the :guilabel:`Calculate Optimal Controller Gains` (if you've pressed it) buttons.
es_mx: Si desea cambiar las unidades, tendrá que presionar los botones :guilabel:`Analizar datos` y :guilabel:`Calcular ganancias óptimas del controlador` (si lo ha presionado).
fr_ca: Si vous souhaitez changer d’unités, vous devrez appuyer sur les boutons :guilabel:`Analyze Data` et :guilabel:`Calculate Optimal Controller Gains` (si vous l’avez pressé).
tr_tr: Birimleri değiştirmek isterseniz :guilabel:`Analyze Data` ve :guilabel:`Calculate Optimal Controller Gains` (eğer bastıysanız) düğmelerine basmanız gerekir.
zh_cn: 如果您想更改单位，则必须按下“Analyze Data”和“Calculate Optimal Controller Gains”（如果已按下）按钮。

source: By default, the analysis will be run by combining all the data in the test. For a finer-grained analysis, the analysis may be limited to a specific subset of data using the subset dropdown menu.
es_mx: Por default, el análisis dará inicio combinando todos los datos en la prueba, para un análisis mas detallado, el análisis deberá ser limitado a un subconjunto de datos específicos, utilizando el menú desplegable del subconjunto menú.
fr_ca: Par défaut, l’analyse sera effectuée en combinant toutes les données du test. Pour une analyse plus fine, l’analyse peut être limitée à un sous-ensemble spécifique de données à l’aide du menu déroulant sous-ensemble.
tr_tr: Varsayılan olarak analiz, testteki tüm veriler birleştirilerek çalıştırılacaktır. Daha ince bir analiz için, analiz, alt küme - subset açılır menüsü kullanılarak belirli bir veri alt kümesiyle sınırlandırılabilir.
zh_cn: 默认情况下，\分析将通过合并测试中的所有数据来运行。对于更"Finer-grained"的分析，这个分析可能被限制数据的特定子集，用菜单下拉子集来限制

source: The computed coefficients of the mechanism characterization will then be filled in, along with a goodness-of-fit measure (r-squared).
es_mx: Los coeficientes computarizados del mecanismo de caracterización serán completados, junto con una medida de bondad de ajuste (r-cuadrada).
fr_ca: Les coefficients calculés de la caractérisation du mécanisme seront alors complétés, ainsi qu’une mesure de la qualité de l'ajustement (r-carré).
tr_tr: Daha sonra, mekanizma karakterizasyonunun hesaplanan katsayıları, bir iyi-uyum ölçüsü (r-squared) ile birlikte doldurulacaktır.
zh_cn: 然后将计算出的“Mechanism Characterization”与“ Goodness-of-fit Measure”（r平方）一起填写。
