Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-characterization/analyzing-feedback.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Feedback Analysis
es_mx: Análisis de retroalimentación
fr_ca: Analyse en boucle de rétroaction
tr_tr: Geri Bildirim Analizi
zh_cn: 反馈分析

source: These gains are, in effect, "educated guesses" - they are not guaranteed to be perfect, and should be viewed as a "starting point" for further tuning.
es_mx: Estas ganancias son, en efecto, "conjeturas educadas" - no se garantiza que sean perfectas, y debe ser visto como un "punto de inicio" para una mayor sintonía.
fr_ca: Ces gains sont, en effet, "des estimations éclairées": leur exactitude n'est pas garantie et ils devraient donc être considérés comme un "point de départ" nécessitant plus de réglage.
tr_tr: Bu kazanımlar aslında "eğitimli tahminlerdir" - mükemmel olmaları garanti edilmez ve daha fazla ayarlama için "başlangıç noktası-starting point" olarak görülmelidir.
zh_cn: 这些“Gains”实际上是“Educated Guesses”-不能保证它们是完美的，应该被视为 "Starting Point" 为了进一步优化

source: The feedback gain calculation assumes that there is no mechanical backlash, sensor noise, or phase lag in the sensor measurement. While these are reasonable assumptions in many situations, none of them are strictly true in practice. In particular, many "smart motor controllers" (such as the ``Talon SRX``, ``Talon FX``, and ``SPARK MAX``) have default settings that apply substantial :ref:`low-pass filtering <docs/software/advanced-controls/filters/introduction:Introduction to Filters>` to their encoder velocity measurements, which introduces a significant amount of phase lag. This can cause the calculated gains for velocity loops to be unstable. To rectify this, either decrease the amount of filtering through the controller's API, or reduce the magnitude of the PID gains - it has been found that shrinking gains by about a factor of 10 works well for most default filtering settings.
es_mx: La retroalimentación de la ganancia asume que no hay retroceso mecánico, el ruido en sensor, o el desfase en la medición del sensor. Aunque son suposiciones razonables en muchas situaciones, ninguna de ellas es estrictamente cierta en la práctica. En particular, muchos "controladores de motor inteligentes" (como el Talon SRX, Talon FX y SparkMax) tienen configuraciones predeterminadas que aplican un filtrado sustancial :ref: `de paso bajo docs/software/advanced-controls/filters/introduction:Introduction to Filters>` a sus mediciones de velocidad del codificador, lo que introduce una cantidad significativa de desfase. Esto puede causar que la ganancia calculada para que los bucles de velocidad sean inestables. Para rectificar esto, o bien se reduce la cantidad de filtrado a través de la API del controlador, o se reduce la magnitud de las ganancias del PID – se ha encontrado que reducir las ganancias por un factor de 10 funciona bien para la mayoría de los filtros predeterminados de configuración
fr_ca: Le calcul du gain de rétroaction suppose qu’il n’y a pas de contrecoup mécanique, de bruit de capteur ou de décalage de phase dans la mesure du capteur. Bien qu’il s’agisse d’hypothèses raisonnables dans de nombreuses situations, cependant, aucune d’entre elles n’est strictement vraie dans la pratique. En particulier, de nombreux "contrôleurs de moteurs intelligents" (tels que ``Talon SRX``, ``Talon FX``, et ``SPARK MAX``) ont des paramètres par défaut qui appliquent un :ref:`filtrage passe-bas substantiel <docs/software/advanced-controls/filters/introduction:Introduction to Filters>` à leurs mesures de vitesse d’encodeur, ce qui introduit un décalage de phase important. Cela peut rendre instables les gains calculés pour les boucles de vitesse. Pour remédier à cela, on peut soit diminuer la quantité de filtrage à travers l’API du contrôleur, ou alors réduire l’amplitude des gains PID - il a été constaté que la diminution des gains d’environ un facteur de 10 fonctionne bien pour la plupart des paramètres de filtrage par défaut.
tr_tr: Geri besleme kazancı hesaplaması, sensör ölçümünde mekanik boşluk, sensör gürültüsü veya faz gecikmesi olmadığını varsayar. Bunlar birçok durumda makul varsayımlar olsa da, hiçbiri pratikte kesinlikle doğru değildir. Özellikle, birçok "akıllı motor kontrol cihazı" (``Talon SRX``, ``Talon FX`` ve `` SPARK MAX`` gibi) önemli ölçüde geçerli olan varsayılan ayarlara sahiptir : ref: `düşük geçişli filtreleme <docs/software/advanced-controls/filters/introduction:Introduction to Filters>` önemli miktarda faz gecikmesi ortaya çıkaran kodlayıcı hız ölçümlerine. Bu, hız döngüleri için hesaplanan kazançların kararsız olmasına neden olabilir. Bunu düzeltmek için, ya denetleyicinin API'si aracılığıyla filtreleme miktarını azaltın ya da PID kazançlarının büyüklüğünü azaltın - kazançların yaklaşık 10 kat azaltılmasının çoğu varsayılan filtreleme ayarı için iyi çalıştığı bulunmuştur.
zh_cn: 反馈增益计算假定传感器测量中没有机械侧隙，传感器噪声或相位滞后。虽然这些假设在很多情况下都是合理的，但在实践中没有一个是严格正确的。特别是，许多"Smart Motor Controllers" （例如“ Talon SRX”，“ Talon FX”和“ SPARK MAX”）有应用实质性的默认设置：裁判<low-pass filtering <docs/software/advanced-controls/filters/introduction:Introduction to Filters>`编码器速度测量，这引入了大量的相位滞后.这可能会导致速度循环的计算增益不稳定。为了解决这个问题,要么减少API控制器的过滤量，要么或者降低PID增益的幅度。人们发现对滤波的设置，大约把增益缩小10倍，效果是最好的

source: Once the feedforward coefficients have been computed, the controls on the :guilabel:`Feedback Analysis` pane become available.
es_mx: Una vez que los coeficientes de feedforward han sido calculados, los controles en el panel :guilabel:`Feedback Analysis` se vuelven disponibles.
fr_ca: Une fois que les coefficients du contrôleur prédicitif ou feedforward ont été calculés, les contrôles sur le volet :guilabel:`Feedback Analysis` deviennent disponibles.
tr_tr: İleri besleme katsayıları hesaplandıktan sonra :guilabel:`Feedback Analysis` bölmesindeki kontroller kullanılabilir hale gelir.
zh_cn: 一旦计算前馈系数后，```Feedback Analysis''窗格上的控件将变为可用。

source: These can be used to calculate optimal feedback gains for a PD or P controller for your mechanism (via `LQR <https://en.wikipedia.org/wiki/Linear%E2%80%93quadratic_regulator>`__).
es_mx: Estos pueden ser usados para calcular las ganancias de retroalimentación óptimas para un controlador PD o P para su mecanismo (via `LQR <https://en.wikipedia.org/wiki/Linear%E2%80%93quadratic_regulator>`__).
fr_ca: Ceux-ci peuvent être utilisés pour calculer les gains optimaux de rétroaction pour un contrôleur PD ou P de votre mécanisme (via `LQR <https://en.wikipedia.org/wiki/Linear%E2%80%93quadratic_regulator>`__).
tr_tr: Bunlar, mekanizmanız için bir PD veya P kontrolörü için optimum geri bildirim kazanımlarını hesaplamak için kullanılabilir (`LQR <https://en.wikipedia.org/wiki/Linear%E2%80%93quadratic_regulator>`__) aracılığıyla.
zh_cn: 这些可以用来为您的机构的PD，P控制器计算最佳反馈增益（通过`LQR <https://en.wikipedia.org/wiki/Linear%E2%80%93quadratic_regulator>`__）。

source: Enter Controller Parameters
es_mx: Escribir controles de parámetro
fr_ca: Entrer les paramètres du contrôleur
tr_tr: Denetleyici Parametrelerini Girin
zh_cn: 输入控制器参数

source: The "Spark Max" preset assumes that the user has configured the controller to operate in the units of analysis with the SPARK MAX API's position/velocity scaling factor feature.
es_mx: El "Spark Max" preestablecido asume que el usuario ha configurado el controlador para operar en las unidades de análisis con la función de escala posición / velocidad.
fr_ca: Le préréglage fourni avec le "Spark Max" suppose que l’utilisateur a configuré le contrôleur pour fonctionner dans les unités d’analyse avec la fonction de facteur de mise à l’échelle de position/vitesse de l’API SPARK MAX.
tr_tr: "Spark Max" ön ayarı, kullanıcının denetleyiciyi SPARK MAX API'nin konum / hız ölçekleme faktörü özelliği ile analiz birimlerinde çalışacak şekilde yapılandırdığını varsayar.
zh_cn: “Spark Max”预设假设用户已配置控制器，使其在分析单元中使用Spark Max API的位置/速度缩放因子特征进行操作。

source: The calculated feedforward gains are *dimensioned quantities*. Unfortunately, not much attention is often paid to the units of PID gains in FRC\ |reg| controls, and so the various typical options for PID controller implementations differ in their unit conventions (which are often not made clear to the user).
es_mx: Las ganancias de feedforward calculadas son *cantidades dimensionadas*. Desafortunadamente, no se presta mucha atención a las unidades de ganancias PID en los controles de FRC\ |reg|, por lo que las diversas opciones típicas para las implementaciones de controladores PID difieren en sus convenciones de unidad (que a menudo no se hacen claro para el usuario)
fr_ca: Les gains de prédiction calculés sont des *quantités dimensionnées*. Malheureusement, on accorde souvent peu d’attention aux unités de gains PID en contrôles FRC\ |reg|, et donc les différentes options typiques pour les implémentations de contrôleur PID diffèrent dans leurs conventions d’unités (qui ne sont souvent pas clairement indiquées à l’utilisateur).
tr_tr: Hesaplanan ileri besleme kazançları *boyutlandırılmış miktarlardır*. Ne yazık ki, FRC \ |reg| kontroller ve bu nedenle PID kontrolör uygulamaları için çeşitli tipik seçenekler, kendi ünite kurallarında farklılık gösterir (bunlar genellikle kullanıcıya açıklanmaz).
zh_cn: 计算的前馈增益为 *Dimensioned Quantities*。很不幸，很少有人注意到PID的增幅单位在FRC \ | reg |控制，所以在以PID控制器中各种经典的选项，实现在它们的单元约定中有所不同(用户通常不清楚)。

source: To specify the correct settings for your PID controller, use the following options.
es_mx: Para especificar la configuración correcta para su controlador PID, utilice las siguientes opciones
fr_ca: Pour spécifier les bons réglages de votre contrôleur PID, utilisez les options suivantes.
tr_tr: PID denetleyiciniz için doğru ayarları belirlemek için aşağıdaki seçenekleri kullanın.
zh_cn: 要为PID控制器指定正确的设置，请使用以下选项。

source: **Gain Settings Preset:** This drop-down menu will auto-populate the remaining fields with likely settings for one of a number of common FRC controller setups. Note that some settings, such as post-encoder gearing, PPR, and the presence of a follower motor must still be manually specified (as the analyzer has no way of knowing these without user input), and that others may vary from the given defaults depending on user setup.
es_mx: **Ajustes de ganancia preestablecidos:** Este menú desplegable rellenará automáticamente los campos restantes con configuraciones probables para una de las configuraciones comunes de controladores FRC. Tenga en cuenta que algunos ajustes, como el engranaje post-encoder, Pulsos Por Revolución, y la presencia de un motor esclavo debe ser especificado manualmente (ya que el analizador no tiene forma de saber esto sin entrada del usuario), y que otros pueden variar de los valores predeterminados dados dependiendo de la configuración del usuario.
fr_ca: **Gain Settings Preset:** Ce menu déroulant remplira automatiquement les champs restants avec des paramètres correspondants à l’une des configurations courantes du contrôleur FRC. Notez que certains paramètres, tels que le rapport d'engrenage post-encodeur, PPR, et la présence d’un moteur suiveur doivent toujours être spécifiés manuellement (comme l’analyseur n’a aucun moyen d'y accéder si l'utilisateur ne les spécifie pas), et que d’autres peuvent différer des valeurs par défaut données en fonction de la configuration de l’utilisateur.
tr_tr: **Gain Settings Preset-Kazanç Ayarları Ön Ayarı:** Bu açılır menü, kalan alanları bir dizi genel FRC denetleyici kurulumundan biri için olası ayarlarla otomatik olarak dolduracaktır. Kodlayıcı sonrası dişli, PPR ve takipçi motor varlığı gibi bazı ayarların yine de manuel olarak belirtilmesi gerektiğini (analizörün bunları kullanıcı girişi olmadan bilmesinin bir yolu olmadığı için) ve diğerlerinin verilen varsayılanlardan farklı olabileceğini unutmayın. kullanıcı kurulumuna bağlı olarak.
zh_cn: * *增益设置预置：* *这个下拉菜单将为若干常见的FRC控制器设置中的一个自动填充剩馀的具有可能设置的字段。注意一些设置，如后编码器齿轮化、PPR以及从动电机的存在仍然必须手动指定(因为分析器在没有用户输入的情况下无法知道这些)，另外一些可能会根据用户设置而与给定的默认值不同。

source: **Controller Period:** This is the execution period of the control loop, in seconds. The default RIO loop rate is 50Hz, corresponding to a period of 0.02s. The onboard controllers on most "smart controllers" run at 1Khz, or a period of 0.001s.
es_mx: **Periodo de controlador**: Este es el período de ejecución del bucle de control, en segundos. La velocidad del bucle de la RIO por defecto es de 50Hz, lo que corresponde a un período de 0,02s. Los controladores a bordo en la mayoría de los "controladores inteligentes" funcionan a 1Khz, o un período de 0.001s.
fr_ca: **Controller Period:** Il s’agit de la période d’exécution, exprimée en secondes, de la boucle de contrôle. La fréquence par défaut de la boucle du roboRIO est de 50Hz, ce qui correspondant à une période de 0,02 s. Les contrôleurs embarqués de la plupart des "contrôleurs de moteurs intelligents" s’exécutent à 1Khz, ou une période de 0.001s.
tr_tr: **Controller Period:** Bu, kontrol döngüsünün saniye cinsinden yürütme periyodudur. Varsayılan RIO döngü hızı 50Hz'dir ve 0.02sn'lik bir süreye karşılık gelir. Çoğu "akıllı denetleyicideki" yerleşik denetleyiciler 1 Khz'de veya 0,001 saniye süreyle çalışır.
zh_cn: **Controller Perio：**这是控制循环的执行周期，以秒为单位。默认的RIO环路速率为50Hz，对应于0.02s的周期。大多数“智能控制器”上的板载控制器以1Khz或0.001s的周期运行。

source: **Max Controller Output:** This is the maximum value of the controller output, with respect to the PID calculation. Most controllers calculate outputs with a maximum value of 1, but Talon controllers have a maximum output of 1023.
es_mx: **Salida máxima del controlador**: Este es el valor máximo de la salida del controlador, con respecto al cálculo del PID. La mayoría de los controladores calculan las salidas con un valor máximo de 1, pero los controladores del Talon tienen una salida máxima de 1023.
fr_ca: **Max Controller Output:** Il s’agit de la valeur maximale de la sortie du contrôleur, en ce qui concerne le calcul du PID. La plupart des contrôleurs calculent les sorties d’une valeur maximale de 1, sauf les contrôleurs Talon qui présentent une sortie maximale de 1023.
tr_tr: **Max Controller Output:** Bu, PID hesaplamasına göre denetleyici çıkışının maksimum değeridir. Çoğu kontrolör, maksimum değeri 1 olan çıktıları hesaplar, ancak Talon kontrolörlerinin maksimum çıkışı 1023'tür.
zh_cn: **Max Controller Output:**这是控制器输出的最大值，相对于PID计算而言。大多数控制器计算的输出最大值为1，但Talon控制器的输出最大值为1023。

source: **Time-Normalized Controller:** This specifies whether the PID calculation is normalized to the period of execution, which affects the scaling of the D gain.
es_mx: **Controlador de tiempo normalizado:** Esto especifica si el cálculo del PID está normalizado al período de ejecución, lo que afecta a la escala de la ganancia de D.
fr_ca: **Time-Normalized Controller:** Ce paramètre précise si le calcul PID est normalisé à la période d’exécution, ce qui affecte la mise à l’échelle du gain D.
tr_tr: **Time-Normalized Controller:** Bu, PID hesaplamasının, D kazancının ölçeklendirmesini etkileyen yürütme süresine normalize edilip edilmeyeceğini belirtir.
zh_cn: **Time-Normalized Controller:**这指定PID计算是否标准化为执行周期，从而影响D增益的缩放。

source: **Controller Type:** This specifies whether the controller is an onboard RIO loop, or is running on a smart motor controller such as a Talon or a SPARK MAX.
es_mx: **Tipo de controlador:** Esto especifica si el controlador es un bucle RIO integrado, o esta funcionando en un controlador de motor inteligente como los Talon o Spark MAX.
fr_ca: **Controller Type:** Ce paramètre précise si le contrôleur est une boucle embarquée dans le RIO ou s’il fonctionne dans un contrôleur moteur intelligent tel qu’un Talon ou un SPARK MAX.
tr_tr: **Controller Type-Denetleyici Tipi: ** Bu, denetleyicinin yerleşik bir RIO döngüsü olup olmadığını veya Talon veya SPARK MAX gibi akıllı bir motor denetleyicisinde çalışıp çalışmadığını belirtir.
zh_cn: **控制器类型：**这指定控制器是板载RIO回路，还是在智能电机控制器上运行例如Talon或SPARK MAX。

source: **Post-Encoder Gearing:** This specifies the gearing between the encoder and the mechanism itself. This is necessary for control loops that do not allow user-specified unit scaling in their PID computations (e.g. those running on Talons). This will be disabled if not relevant.
es_mx: **Engranaje del post-encoder:** Esto especifica el engranaje entre el encoder y el propio mecanismo. Esto es necesario para los bucles de control que no permiten la unidad especificada por el usuario en sus cálculos de PID (por ejemplo, los que se ejecutan en Talons). Esto se desactivará si no es relevante.
fr_ca: **Post-Encoder Gearing:** Cela spécifie le rapport d'engrenage entre l’encodeur et le mécanisme lui-même. Ceci est nécessaire pour les boucles de contrôle qui ne permettent pas la mise à l’échelle de l’unité spécifiée par l’utilisateur dans leurs calculs PID (c'est le cas des boucles qui s’exécutent dans des Talons). Ce paramètre est désactivé dans le cas où il ne s'applique pas.
tr_tr: **Post-Encoder Gearing:** Bu, kodlayıcı ile mekanizmanın kendisi arasındaki dişlileri belirtir. Bu, PID hesaplamalarında kullanıcı tanımlı birim ölçeklendirmesine izin vermeyen kontrol döngüleri için gereklidir (örneğin, Talon'da çalışanlar). İlgili değilse bu devre dışı bırakılacaktır.
zh_cn: **Post-Encoder Gearing:** 这指定了编码器和机构本身之间的传动装置。这对于在其PID计算中不允许用户指定单元缩放的控制回路(如在Talons上运行的回路)是必要的。如果不相关，这将被禁用。

source: **Encoder EPR:** This specifies the edges-per-revolution (not cycles per revolution) of the encoder used, which is needed in the same cases as Post-Encoder Gearing.
es_mx: **EPR del Encoder**: Esto especifica los bordes por revolución (no los ciclos por revolución) del codificador utilizado, que se necesita en los mismos casos que el Engranaje Post-Encoder.
fr_ca: **Encoder EPR:** Ce paramètre précise le nombre de fronts par révolution (et non les cycles par révolution) de l’encodeur utilisé, ce qui est nécessaire dans les mêmes situations que le rapport d'engrenage post-encodeur.
tr_tr: **Enkoder EPR:** Bu, Kullanılan enkoderin, Post-Encoder Gearing ile aynı durumlarda gerekli olan, devir başına kenarlarını (devir başına döngüleri değil) belirtir.
zh_cn: **Encoder EPR:**这指定了所用编码器的每转边沿（不是每转周期），在与后期编码器齿轮传动相同的情况下需要使用。

source: **Has Follower:** Whether there is a motor controller following the controller running the control loop, if the control loop is being run on a peripheral device. This changes the effective loop period.
es_mx: **Tiene Seguidor:** Si hay un controlador de motor siguiendo al controlador que ejecuta el bucle de control, si el bucle de control se ejecuta en un dispositivo periférico. Esto cambia el período de bucle efectivo.
fr_ca: **Has Follower:** S’il y a un moteur suiveut dans le contrôleur exécutant la boucle de commande, si la boucle de commande est en cours d’exécution sur un autre périphérique. Ce paramètre modifie la période de boucle effective.
tr_tr: **Has Follower-İzleyici Var:** Kontrol döngüsü bir çevresel aygıt üzerinde çalıştırılıyorsa, kontrol döngüsünü çalıştıran denetleyiciyi takip eden bir motor denetleyicisinin olup olmadığı. Bu, etkin döngü süresini değiştirir.
zh_cn: **Has Follower:**如果在外围设备上运行控制回路，则在运行控制回路的控制器之后是否有电动机控制器，这将更改有效循环周期。

source: **Follower Update Period:** The rate at which the follower (if present) is updated. By default, this is 100Hz (every 0.01s) for the Talon SRX, Talon FX, and the SPARK MAX, but can be changed.
es_mx: **Follower Update Period:** La velocidad a la que se actualiza el seguidor (si está presente). De forma predeterminada, es 100 Hz (cada 0,01 s) para Talon SRX, Talon FX y SPARK MAX, pero se puede cambiar.
fr_ca: **Follower Update Period:** La vitesse à laquelle le suiveur (s’il est présent) est mis à jour. Par défaut, c’est 100Hz (toutes les 0.01s) pour le Talon SRX, Talon FX, et le SPARK MAX, mais peut être changé.
tr_tr: **Follower Update Period-Takipçi Güncelleme Süresi: ** Takipçinin (varsa) güncellenme oranı. Varsayılan olarak bu, Talon SRX, Talon FX ve SPARK MAX için 100 Hz'dir (her 0.01 saniyede), ancak değiştirilebilir.
zh_cn: **Follower Update Period:** 跟随者(如果当前)更新的速率。默认情况下，这是100Hz (每0.01s )的Talon SRX，Talon FX和SPARK MAX，但可以更改。

source: If you select a smart motor controller as the preset (e.g. TalonSRX, SPARK MAX, etc.) the :guilabel:`Convert Gains` checkbox will be automatically checked. This means the tool will convert your gains so that they can be used through the smart motor controller's PID methods. Therefore, if you would like to use WPILib's PID Loops, you must uncheck that box.
es_mx: Si selecciono un controlador de motor inteligente como preestablecido (ej. TalonSRX, SPARK MAX, etc.) la casilla :guilabel:`Convert Gains` se marcará automáticamente. Esto significa que la herramienta convertirá tus ganancias para que puedan ser usadas a través de los métodos de PID de un controlador de motor inteligente. Entonces, si le gustaría usar los bucles de WPILib de PID, debe de desmarcar la casilla.
fr_ca: Si vous sélectionnez un contrôleur de moteur intelligent tel que prédéfini (p. ex. TalonSRX, SPARK MAX, etc.), la case :guilabel:`Convert Gains` sera automatiquement cochée. Cela signifie que l’outil convertira vos gains afin qu’ils puissent être utilisés par les méthodes PID du contrôleur de moteur intelligent. Par conséquent, si vous souhaitez utiliser les boucles PID de WPILib, vous devez décocher cette case.
tr_tr: Ön ayar olarak bir akıllı motor kontrolörü seçerseniz (örneğin, TalonSRX, SPARK MAX, vb.) :guilabel:`Convert Gains` onay kutusu otomatik olarak işaretlenir. Bu, aracın kazançlarınızı akıllı motor denetleyicisinin PID yöntemleriyle kullanılabilecek şekilde dönüştüreceği anlamına gelir. Bu nedenle, WPILib'in PID Döngülerini kullanmak istiyorsanız, bu kutunun işaretini kaldırmalısınız.
zh_cn: 如果您选择智能电动机控制器作为预设（例如TalonSRX，SPARK MAX等），则会自动选中```Convert Gains''复选框：这意味着该工具将转换您的增益，以便可以通过智能电机控制器的PID方法使用它们。因此，如果要使用WPILib的PID循环，则必须取消选中该框。

source: Specify Optimality Criteria
es_mx: Especificar los criterios de optimización
fr_ca: Spécifier les critères d’optimalité
tr_tr: Optimallik Kriterlerini Belirtin
zh_cn: 指定最佳标准

source: Finally, the user must specify what will be considered an "optimal" controller. This takes the form of desired tolerances for the system error and control effort - note that it is *not* guaranteed that the system will obey these tolerances at all times.
es_mx: Finalmente el usuario deberá especificar lo que se considerará un controlador "óptimo". Esto toma la forma de las tolerancias deseadas para el error del sistema y el esfuerzo de control - note que no está garantizado que el sistema obedecerá estas tolerancias en todo momento.
fr_ca: Finalement, l’utilisateur doit préciser ce qui sera considéré comme un contrôleur "optimal". Ce qui se fait en spécifiant les tolérances souhaitées pour l’erreur du système et l’effort de contrôle - notez qu’il n’est *pas* garanti que le système obéira à ces tolérances en tout temps.
tr_tr: Son olarak, kullanıcı neyin "optimal" kontrolör olarak kabul edileceğini belirlemelidir. Bu, sistem hatası ve kontrol çabası için istenen tolerans formunu alır - sistemin bu toleranslara her zaman uyacağının garanti *olmadığını* unutmayın.
zh_cn: 最后，用户必须指定将被视为“optimal：最佳”控制器的位置。这采取了系统误差和控制工作所需公差的形式-请注意，不能保证系统始终遵守这些公差。
