Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-characterization/analyzing-feedback.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: As a rule, smaller values for the :guilabel:`Max Acceptable Error` and larger values for the :guilabel:`Max Acceptable Control Effort` will result in larger gains - this will result in larger control efforts, which can grant better setpoint-tracking but may cause more violent behavior and greater wear on components.
es_mx: Por regla general, los valores más pequeños para la :guilabel:`Error Máximo Aceptable` y los valores más grandes para la :guilabel:`Esfuerzo de Control Máximo Aceptable` darán lugar a mayores ganancias - esto dará lugar a mayores esfuerzos de control, lo que puede garantizar un mejor seguimiento del punto de ajuste, pero puede causar un comportamiento más violento y un mayor desgaste de los componentes.
fr_ca: En règle générale, des valeurs plus petites pour le paramètre :guilabel:`Max Acceptable Error` et des valeurs plus grandes pour le paramètre :guilabel:`Max Acceptable Control Effort` se traduiront par des gains plus importants - cela se traduira par des efforts de contrôle plus importants, ce qui peut aider à avoir un meilleur suivi des points de consigne, mais peut causer un comportement plus violent et une plus grande usure sur les composants.
tr_tr: Kural olarak, :guilabel:`Max Acceptable Error` için daha küçük değerler veguilabel:`Max Acceptable Control Effort` için daha büyük değerler daha büyük kazançlarla sonuçlanacaktır - bu daha büyük kontrol çabaları ile sonuçlanacak ve bu da daha iyi ayar noktası sağlayabilecektir. ancak daha şiddetli davranışlara ve bileşenlerde daha fazla aşınmaya neden olabilir.
zh_cn: 通常，“``Max Acceptable Error`` 的较小值和``Max Acceptable Control Effort`` 的较大值将导致较大的增益-这将导致较大的控制工作，可以提供更好的设定值跟踪，但是可能会导致更猛烈的行为和更大的组件磨损。

source: The :guilabel:`Max Acceptable Control Effort` should never exceed 12V, as that corresponds to full battery voltage, and ideally should be somewhat lower than this.
es_mx: La etiqueta :guilabel:`Esfuerzo de Control Máximo Aceptable` nunca debe exceder los 12V, ya que eso corresponde al voltaje total de la batería, e idealmente debería ser algo menor que esto.
fr_ca: La valeur du paramètre :guilabel:`Max Acceptable Control Effort` ne doit jamais dépasser 12V, car cela correspond à la tension maximale de la batterie, et idéalement cette valeur devrait être un peu plus basse que la tension maximale.
tr_tr: :guilabel:`Max Acceptable Control Effort` tam akü voltajına karşılık geldiğinden asla 12V'yi aşmamalıdır ve ideal olarak bundan biraz daha düşük olmalıdır.
zh_cn: ``Max Acceptable Control Effort`` 绝不能超过12V，因为这相当于电池的满电压，理想情况下应低于此电压。

source: Select Loop Type
es_mx: Seleccione el tipo de bucle
fr_ca: Sélectionner le type de boucle
tr_tr: Select Loop Type-Döngü Tipini Seçin
zh_cn: 选择循环类型

source: It is typical to control mechanisms with both position and velocity PIDs, depending on application. Either can be selected using the drop-down :guilabel:`Loop Type` menu.
es_mx: Es típico controlar mecanismos con PIDs de posición y de velocidad, dependiendo de la aplicación. Cualquiera de ellos puede seleccionarse mediante el menú desplegable :guilabel:`Tipo de lazo`.
fr_ca: Il est typique de contrôler les mécanismes avec des PID de position et de vitesse, selon l’application. L’un ou l’autre peut être sélectionné à l’aide du menu déroulant :guilabel:`Loop Type`.
tr_tr: Uygulamaya bağlı olarak, mekanizmaları hem konum hem de hız PID'leri ile kontrol etmek tipiktir. Aşağı açılır :guilabel:`Loop Type` menüsü kullanılarak ikisi de seçilebilir.
zh_cn: 根据应用情况，通常同时使用位置和速度PID来控制机构。可以使用下拉的``Loop Type``菜单选择任何一种。

source: Enter Known Velocity/Acceleration
es_mx: Introduzca la velocidad/aceleración conocida
fr_ca: Entrez une vitesse/accélération connue
tr_tr: Bilinen Hızı/İvmeyi Girin
zh_cn: 输入已知速度/加速度

source: Sometimes, with an exceptionally light mechanism/robot and/or exceptionally-noisy data, it is possible for the ``kA`` value to be exceedingly small (or even slightly negative). In this case, the user should set ``kA`` to zero. The computed feedback gains in this case may also be zero - this is because such a mechanism should not require feedback to accurately track the setpoint under the assumptions of LQR. These assumptions may not be perfectly accurate, and users may need to add feedback regardless - in this case, the loop must be tuned manually.
es_mx: A veces, con un mecanismo/robot excepcionalmente ligero y/o datos especialmente ruidosos es posible que el valor kA sea excesivamente pequeño (o incluso ligeramente negativo). En caso de que el usuario deba poner el kA a cero. Las ganancias de retroalimentación calculadas en este caso también pueden ser cero - esto es porque tal mecanismo no debería requerir de retroalimentación para rastrear con precisión el punto de ajuste bajo los supuestos del LQR. Estos supuestos pueden no ser perfectamente exactos, y los usuarios pueden necesitar agregar retroalimentación de todos modos - en este caso, el bucle debe ser configurado manualmente.
fr_ca: Parfois, avec un mécanisme/robot exceptionnellement léger et/ou des données exceptionnellement bruitées, il est possible la valeur de ``kA`` soit excessivement faible (ou même légèrement négative). Dans ces cas, l'utilisateur devrait mettre ``kA`` à zéro. Les gains de rétroaction calculés dans ce cas peuvent également être nuls - c’est qu’un tel mécanisme ne nécessite pas de boucle de rétroaction pour suivre avec précision le point de consigne, selon les hypothèses LQR. Cependant, ces hypothèses peuvent ne pas être parfaitement exactes, et les utilisateurs peuvent quand même avoir besoin d’ajouter des boucles de rétroaction et, dans ce cas, la boucle doit être réglée manuellement.
tr_tr: Bazen, olağanüstü hafif bir mekanizma/robot ve/veya son derece gürültülü verilerle, ``kA`` değerinin son derece küçük (veya hatta biraz negatif) olması mümkündür. Bu durumda kullanıcı ``kA`` yı sıfıra ayarlamalıdır. Bu durumda hesaplanan geri bildirim kazanımları da sıfır olabilir - bunun nedeni, böyle bir mekanizmanın LQR varsayımları altında ayar noktasını doğru bir şekilde izlemek için geri bildirime ihtiyaç duymaması gerektiğidir. Bu varsayımlar tam olarak doğru olmayabilir ve kullanıcıların ne olursa olsun geri bildirim eklemesi gerekebilir - bu durumda döngü manuel olarak ayarlanmalıdır.
zh_cn: 有时，如果使用异常轻巧的机械/机器人和/或异常嘈杂的数据，则``kA''值可能会非常小（甚至略微为负）。在这种情况下，用户应将“ kA”设置为零。在这种情况下，计算得出的反馈增益也可能为零-这是因为在LQR的假设下，这样的机制不应该要求反馈精确跟踪设定值。这些假设可能并不十分准确，并且无论如何用户都可能需要添加反馈-在这种情况下，必须手动调整循环。

source: If one wishes to use the :guilabel:`Feedback Analysis` pane without running a full analysis on a set of data, or otherwise view the effect of modifying the ``kV`` and ``kA`` values, this can be done here.
es_mx: Si se desea utilizar el panel :guilabel:`Análisis de retroalimentación` sin ejecutar un análisis completo en un conjunto de datos, o bien ver el efecto de la modificación de los valores ``kV`` y ``kA``, se puede hacer aquí.
fr_ca: Si l’on souhaite utiliser le volet :guilabel:`Feedback Analysis` sans exécuter une analyse complète sur un ensemble de données, ou afficher autrement l’effet de la modification des valeurs ``kV`` et ``kA``, cela peut être fait ici.
tr_tr: Bir veri kümesi üzerinde tam bir analiz çalıştırmadan:guilabel:`Feedback Analysis` bölmesini kullanmak veya ``kV`` ve ``kA`` değerlerini değiştirmenin etkisini başka bir şekilde görüntülemek isterseniz, bu yapılabilir. buraya.
zh_cn: 如果希望使用 ``Feedback Analysis`` 窗格而不对一组数据进行全面分析，或者希望查看修改``kV''和``kA''值的效果，可以在此处完成。

source: Calculate Gains
es_mx: Calcular las ganancias
fr_ca: Calculer les gains
tr_tr: Kazançları Hesapla
zh_cn: 计算收益

source: Finally, press the :guilabel:`Calculate Optimal Controller Gains` to determine the feedback gains.
es_mx: Por último, pulse :guilabel:`Calcular ganancias óptimas del controlador` para determinar las ganancias de retroalimentación.
fr_ca: Enfin, appuyez sur :guilabel:`Calculate Optimal Controller Gains` pour déterminer les gains de rétroaction.
tr_tr: Son olarak, geribildirim kazanımlarını belirlemek için :guilabel:`Calculate Optimal Controller Gains-Optimal Denetleyici Kazançlarını Hesapla` seçeneğine basın.
zh_cn: 最后，按 ``Calculate Optimal Controller Gains`` 以确定反馈增益。
