Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-characterization/characterization-routine.po
Languages: es_mx, fr_ca, tr_tr

source: Running the Characterization Routine
es_mx: Corriendo la rutina de caracterización
fr_ca: Exécution de la routine de caractérisation
tr_tr: Karakterizasyon Rutinini Çalıştırma

source: Once the characterization code has been deployed, we can now run the characterization routine, and record the resulting data for analysis.
es_mx: Una vez que el código de caracterización ha sido desplegado, ahora podemos iniciar la caracterización de rutina, y grabar los datos resultantes para el análisis.
fr_ca: Une fois que le code de caractérisation a été déployé, nous pouvons maintenant exécuter la routine de caractérisation et enregistrer les données résultantes à des fins d'analyse.
tr_tr: Karakterizasyon kodu yüklendikten sonra, artık karakterizasyon rutinini çalıştırabilir ve elde edilen verileri analiz için kaydedebiliriz.

source: Ensure you have sufficient space around the robot before running any characterization routine! The drive characterization requires at least 10' of space, ideally closer to 20'. The robot drive can not be accurately characterized while on blocks.
es_mx: ¡Asegúrese de tener el suficiente espacio alrededor del robot antes de iniciar cualquier caracterización de rutina! La caracterización de la unidad necesita por lo menos 10 ft. de espacio, idealmente cerca de 20 ft. La unidad del robot no se podrá caracterizar con precisión mientras esté en bloques.
fr_ca: Assurez-vous d’avoir suffisamment d’espace autour du robot avant d’exécuter toute routine de caractérisation! La caractérisation de la base pilotable nécessite au moins 10 pieds (3 m.) d’espace, idéalement plus proche de 20 pieds (6m.). La base pilotable du robot ne peut pas être caractérisée avec précision si le robot est posé sur des blocs de sécurité.
tr_tr: Herhangi bir karakterizasyon rutinini çalıştırmadan önce robotun etrafında yeterli boşluğunuz olduğundan emin olun! Sürücü karakterizasyonu, ideal olarak 20' 'ye yakın olmak üzere en az 10' alan gerektirir. Robot tahriki, bloklar üzerindeyken doğru bir şekilde karakterize edilemez.

source: Launch the Data Logger
es_mx: Inicio del registro de datos
fr_ca: Lancer l'enregistreur de données
tr_tr: Data Logger-Veri Kaydediciyi başlatın

source: To launch the data logger, press the :guilabel:`Launch Data Logger` button.
es_mx: Para iniciar el registrador de datos, presione el botón :guilabel:`Launch Data Logger` .
fr_ca: Pour lancer l’enregistreur de données, appuyez sur le bouton :guilabel:`Launch Data Logger`.
tr_tr: Veri kaydediciyi başlatmak için:guilabel:`Launch Data Logger` düğmesine basın.

source: This should open the data logger GUI.
es_mx: Esto debería abrir el registro de datos GUI.
fr_ca: Cela devrait ouvrir l’interface graphique de l'enregistreur de données.
tr_tr: Bu, veri kaydedici GUI'sini açmalıdır.

source: The logger allows you to change the previously selected test type through the :guilabel:`Test Type` dropdown. Also, the ``Angular Mode``, ``Trackwidth``, and ``Rotation Wheel`` features will do nothing unless you have selected ``Drivetrain`` as your Test Type.
es_mx: El registro le permite cambiar el tipo de pruba previamente seleccionado a través del desplegable :guilabel:`Test Type` . Además, las funciones ``Angular Mode``, ``Trackwidth``, y ``Rotation Wheel`` no harán nada a menos de que haya seleccionado el tipo de prueba ``Drivetrain``.
fr_ca: L’enregistreur vous permet de modifier le type de test précédemment sélectionné via la liste déroulante :guilabel:`Test Type`. De plus, les fonctions ``Angular Mode``, ``Trackwidth`` et ``Rotation Wheel`` n'auront aucun effet à moins d’avoir choisi ``Drivetrain`` comme type de test.
tr_tr: Kaydedici, önceden seçilen test türünü :guilabel:`Test Type` açılır menüsünden değiştirmenize olanak tanır. Ayrıca ```Angular Mode``, ``Trackwidth`` ve ``Rotation Wheel`` özellikleri, Test Türü olarak ``Drivetrain`` nı seçmediğiniz sürece hiçbir şey yapmayacaktır.

source: Connect to the Robot
es_mx: Conexión al robot
fr_ca: Connexion au robot
tr_tr: Robota Bağlanın

source: Next, we must connect to the robot. Press the :guilabel:`Connect to Robot` button. The status indicated next to the button should change to ``Connecting...`` while the tool attempts to connect to the robot's NetworkTables server.
es_mx: Ahora, debe de conectarse al robot. Presione el botón :guilabel:`Connect to Robot`. El estado indicado a un lado del botón debe cambiar a ``Connecting...`` mientras la herramienta intenta conectarse al servidor NetworkTables del robot.
fr_ca: Ensuite, nous devons nous connecter au robot. Appuyez sur le bouton guilabel:`Connect to Robot`. L’état indiqué à côté du bouton devrait passer à ``Connecting...`` tandis que l’outil tente de se connecter au serveur NetworkTables du robot.
tr_tr: Sonra robota bağlanmalıyız. :guilabel:`Connect to Robot` düğmesine basın. Araç robotun NetworkTables sunucusuna bağlanmaya çalışırken, düğmenin yanında gösterilen durum `` ``Connecting..Bağlanıyor ... ` olarak değişmelidir.

source: If the tool does not seem to be successfully connecting, try rebooting the robot. Eventually, the status should change to ``Connected``, indicating the tool is successfully communicating with the robot.
es_mx: Si la herramienta no parece conectarse correctamente, trate de reiniciar el robot. Eventualmente el estatus deberá cambiar a Conectado, indicando que la herramienta está conectándose de manera correcta con el robot.
fr_ca: Si l’outil de caractérisation ne semble pas se connecter avec succès, essayez de redémarrer le robot. Finalement, l’état devrait changer pour ``Connected``, indiquant que l’outil communique avec succès avec le robot.
tr_tr: Araç başarılı bir şekilde bağlanmıyorsa, robotu yeniden başlatmayı deneyin. Sonunda durum, aracın robotla başarılı bir şekilde iletişim kurduğunu gösterecek şekilde ``Connected`` olarak değişmelidir.

source: Running Tests
es_mx: Pruebas para correrlo
fr_ca: Exécution des tests
tr_tr: Çalışma Testleri

source: A standard motor characterization routine consists of two types of tests:
es_mx: Una caracterización estándar de rutina consiste en dos tipos de prueba:
fr_ca: Une routine standard de caractérisation des moteurs se compose de deux types d’essais :
tr_tr: Standart bir motor karakterizasyon rutini iki tür testten oluşur:

source: **Quasistatic:** In this test, the mechanism is gradually sped-up such that the voltage corresponding to acceleration is negligible (hence, "as if static").
es_mx: **Quasistatic:** En esta prueba, el mecanismo acelerará gradualmente tal que el voltaje correspondiente a la aceleración es despreciado (por lo tanto, “como si fuera estático”).
fr_ca: **Quasistatic:** Dans ce test, le mécanisme est progressivement accéléré de telle sorte que la tension correspondant à l’accélération est négligeable (par conséquent, "quasistatic").
tr_tr: **Quasistatic:** Bu testte, mekanizma, ivmeye karşılık gelen voltaj ihmal edilebilir olacak şekilde kademeli olarak hızlandırılır (bu nedenle, "sanki statik" gibi).

source: **Dynamic:** In this test, a constant 'step voltage' is given to the mechanism, so that the behavior while accelerating can be determined.
es_mx: **Dinámico:** En esta prueba, una constante de 'voltaje de paso' es brindada al mecanismo, de manera que se pueda comprobar el comportamiento mientras se acelera.
fr_ca: **Dynamic:** Dans ce test, un 'échelon' de tension constante est envoyée au mécanisme, de sorte que le comportement en accélération peut être déterminé.
tr_tr: **Dynamic:** Bu testte mekanizmaya sabit bir 'step voltage' verilir, böylece hızlanma sırasındaki davranış belirlenebilir.

source: Each test type is run both forwards and backwards, for four tests in total, corresponding to the four buttons.
es_mx: Cada tipo de prueba se ejecuta tanto como adelante como hacía atrás, para cuatro pruebas en total, correspondientes a los 4 botones.
fr_ca: Chaque type de test est exécuté à la fois en marche avant et en marche arrière, pour un total de quatre tests, correspondant aux quatre boutons.
tr_tr: Her test türü, dört düğmeye karşılık gelen toplam dört test için hem ileri hem de geri çalıştırılır.

source: The tests can be run in any order, but running a "backwards" test directly after a "forwards" test is generally advisable (as it will more or less reset the mechanism to its original position).
es_mx: La pruebas pueden ser ejecutadas en cualquier orden, pero ejecutando una prueba “hacia atrás” directamente después de una prueba “hacia adelante” es generalmente aconsejable (ya que restablecerá más o menos el mecanismo a su posición original).
fr_ca: Les tests peuvent être exécutés dans n’importe quel ordre, mais l’exécution d’un test "en arrière" immédiatement après un test "en avant" est généralement conseillé (car il réinitialisera plus ou moins le mécanisme à sa position d’origine).
tr_tr: Testler herhangi bir sırayla çalıştırılabilir, ancak "forwards" bir testin hemen ardından "backwards" bir test çalıştırmak genellikle tavsiye edilir (çünkü mekanizmayı aşağı yukarı orijinal konumuna sıfırlayacaktır).

source: Follow the instructions in the pop-up windows after pressing each test button.
es_mx: Siga las instrucciones en la ventana pop-up de Windows después de presionar cada botón de prueba.
fr_ca: Suivez les instructions dans les fenêtres contextuelles après avoir appuyé sur chaque bouton de test.
tr_tr: Her bir test düğmesine bastıktan sonra açılır pencerelerdeki talimatları izleyin.

source: The trackwidth test will spin your robot to determine an empirical trackwidth. It compares how far the wheel encoders drove against the reported rotation from the gyroscope. To get the best results your wheels should maintain contact with the ground.
es_mx: La prueba de trackwidth hará girar su robot para determinar un ancho de vía empírico. Compara la distancia que recorrieron los codificadores de rueda con la rotación informada del giroscopio. Para obtener los mejores resultados, sus ruedas deben mantener contacto con el suelo.
fr_ca: Le test trackwidth (soubassement-essieux et roues) fera tourner votre robot pour déterminer une mesure empirique de ce soubassement. Il compare la distance parcourue par les codeurs de roue par rapport à la mesure de rotation donnée par le gyroscope. Pour obtenir les meilleurs résultats, vos roues doivent maintenir le contact avec le sol.
tr_tr: İz genişliği testi, deneysel bir iz genişliği belirlemek için robotunuzu döndürecektir. Tekerlek kodlayıcılarının jiroskoptan bildirilen dönüşe karşı ne kadar uzağa gittiğini karşılaştırır. En iyi sonuçları elde etmek için, tekerleklerinizin yerle temas halinde olması gerekir.

source: If your robot is having trouble turning during the Trackwidth test you should increase the :guilabel:`Rotation Wheel voltage (V):` value until your robot is smoothly turning and run the test again.
es_mx: Si su robot esta teniendo problemas al girar durante la prueba de Trackwidth debe aumentar el valor de :guilabel:`Rotation Wheel voltage (V):` hasta que su robot esté girando tranquilamente y ejecute la prueba de nuevo.
fr_ca: Si votre robot a de la difficulté à tourner pendant le test Trackwidth, vous devez augmenter la valeur du paramètre :guilabel:`Rotation Wheel voltage (V):` jusqu’à ce que votre robot tourne en douceur et exécuter à nouveau le test.
tr_tr: Robotunuz Trackwidth testi sırasında dönmekte sorun yaşıyorsa, robotunuz sorunsuz bir şekilde dönene kadar :guilabel:`Rotation Wheel voltage (V):` değerini artırmalı ve testi tekrar çalıştırmalısınız.

source: For high-friction wheels (like pneumatic tires), the empirical trackwidth calculated by frc-characterization may be significantly different from the real trackwidth (e.g., off by a factor of 2). The empirical value should be preferred over the real one in robot code.
es_mx: Para ruedas de alta fricción (como neumáticos), el trackwidth empírico calculado mediante la caracterización de frc puede ser significativamente diferente del ancho de vía real (por ejemplo, con un factor de 2). Se debe preferir el valor empírico al real en el código del robot.
fr_ca: Pour les roues qui ont un coefficient de frottement élevé (comme les pneumatiques), la largeur de voie empirique calculée par caractérisation FRC peut être significativement différente de la largeur de voie réelle (par exemple, un facteur de 2). La valeur empirique doit être préférée à la valeur réelle dans le code du robot.
tr_tr: Yüksek sürtünmeli tekerlekler için (havalı lastikler gibi), frc-karakterizasyonu ile hesaplanan deneysel iz genişliği, gerçek iz genişliğinden önemli ölçüde farklı olabilir (örneğin, 2 faktörüyle kapalı). Robot kodunda ampirik değer gerçek olana tercih edilmelidir.

source: The entire routine should look something like this:
es_mx: La rutina entera deberá verse algo así:
fr_ca: Toute la routine devrait ressembler à ceci:
tr_tr: Tüm rutin şuna benzer şekilde görünmelidir:

source: After all four tests have been completed, the :guilabel:`Save Data` button will become activated.
es_mx: Después que las cuatro pruebas sean completadas , el botón :guilabel:`Save Data` será activado.
fr_ca: Une fois les quatre tests terminés, le bouton :guilabel:`Save Data` sera activé.
tr_tr: Dört testin tamamı tamamlandıktan sonra :guilabel:`Save Data` düğmesi etkinleştirilecektir.

source: This will save the data as a JSON file with the specified location/name. A timestamp (``%Y%m%d-%H%M``) will be appended to the chosen filename if the :guilabel:`Add Timestamp` button is checked.
es_mx: Esto guardará los datos como un archivo JSON con una localización/nombre específico. Un sello de tiempo (``%Y%m%d-%H%M``) se adjuntará al nombre del archivo elegido si el botón :guilabel:`Add Timestamp` es marcado.
fr_ca: Cela permettra d’enregistrer les données en tant que fichier JSON avec l’emplacement/nom spécifié. Une estampille temporelle (``%Y%m %d-%H%M``) sera ajoutée au nom de fichier choisi si le bouton :guilabel:`Add Timestamp` est coché.
tr_tr: Bu, verileri belirtilen konum / ad ile bir JSON dosyası olarak kaydedecektir. :guilabel:`Add Timestamp` düğmesi işaretlenirse, seçilen dosya adına bir zaman damgası ("% Y% m%d-% H% M") eklenecektir.

source: You can run a preliminary check on the quality of the characterization data by enabling prints on Driver Station. After exiting autonmous in each test, the console should output ``Collected : n in t seconds`` where ``n`` should be ``200 * t`` (rounded). More information can be found :ref:`here <docs/software/wpilib-tools/robot-characterization/viewing-diagnostics:Template Lag>`
es_mx: Puede ejecutar una verificación preliminar de la calidad de los datos de caracterización habilitando las impresiones en la Driver Station. Después de salir del autónomo en cada prueba, la consola debería mostrar ``Collected : n in t seconds`` donde ``n`` debería ser ``200 * t``(redondeado). Se puede encontrar más información :ref:`aquí <docs/software/wpilib-tools/robot-characterization/viewing-diagnostics:Template Lag>`
fr_ca: Vous pouvez exécuter une vérification préliminaire de la qualité des données de caractérisation en écrivant des instructions d'affichage sur la Driver Station. Après avoir quitté le mode autonmous dans chaque test, la console devrait afficher ``Collected : n in t seconds`` où ``n`` devrait être ``200 * t`` (arrondi). Pour plus d’informations, rendez-vous :ref:`ici <docs/software/wpilib-tools/robot-characterization/viewing-diagnostics:Template Lag>`
tr_tr: Driver Station üzerinde baskıları etkinleştirerek karakterizasyon verilerinin kalitesine yönelik bir ön kontrol gerçekleştirebilirsiniz. Her testte otonmdan çıktıktan sonra, konsol ``Toplandı: n saniye içinde`` çıktısını vermelidir, burada ``n`` ``200 * t `` olmalıdır (rounded-yuvarlanmış) Daha fazla bilgi bulunabilir :ref:`here <docs/software/wpilib-tools/robot-characterization/viewing-diagnostics:Template Lag>`
