Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-characterization/generating-project.po
Languages: es_mx, tr_tr

source: Generating a Project
es_mx: Generando un proyecto
tr_tr: Proje Oluşturmak

source: To use the toolsuite, we first need to generate a robot project.
es_mx: Para usar el conjunto de herramientas, primero necesitamos generar un proyecto de robot.
tr_tr: Toolsuit kullanmak için önce bir robot projesi oluşturmamız gerekiyor.

source: Select Project Location
es_mx: Seleccionar la locación del proyecto
tr_tr: Proje Yeri Seçiniz

source: First, select the desired project location on the new project GUI:
es_mx: Primero, seleccione la locación del proyecto deseado en el nuevo proyecto GUI:
tr_tr: İlk olarak, yeni proje GUI'sinde istenen proje konumunu seçin:

source: The project type dropdown now chooses between the different types of characterization tests as the previous motor setups have been integrated into the :guilabel:`Control Type` field.
es_mx: El menú desplegable del tipo del proyecto le hace escoger entre diferentes tipos de pruebas de caracterización como las configuraciones del motor previas han sido integradas al campo de :guilabel:`Control Type` .
tr_tr: Önceki motor kurulumları:guilabel:`Control Type` alanına entegre edildiğinden, proje türü açılır menüsü artık farklı karakterizasyon testleri türleri arasında seçim yapıyor.

source: Configure Project Parameters
es_mx: Configuración de los parámetros del proyecto
tr_tr: Proje Parametrelerini Yapılandırın

source: In order to run on your robot, the tool must know some parameters about how your robot is set up.
es_mx: Para funcionar en su robot, la herramienta debe conocer algunos parámetros sobre cómo está configurado su robot.
tr_tr: Robotunuzda çalışabilmesi için aracın, robotunuzun nasıl kurulduğuna ilişkin bazı parametreleri bilmesi gerekir.

source: First, you need to use the :guilabel:`Control Type` field to select the appropriate project config template. ``Simple`` is for PWM Based motor controllers, ``CTRE`` is for CAN connected CTRE Motor Controllers (e.g. Talon SRX), and ``SparkMax`` is for the Spark Max Motor Controller. This allows you to fill out the parameters specific to the type of controllers you are using.
es_mx: Primero, debe usar el campo :guilabel:`Control Type` para seleccionar la plantilla de configuración del proyecto adecuada. ``Simple`` es para controladores de motor basados ​​en PWM, `` CTRE`` es para controladores de motor CTRE conectados a CAN (por ejemplo, Talon SRX) y `` SparkMax`` es para el controlador de motor Spark Max. Esto le permite completar los parámetros específicos del tipo de controladores que está utilizando.
tr_tr: İlk olarak, uygun proje yapılandırma şablonunu seçmek için: guilabel: "Kontrol Türü" alanını kullanmanız gerekir. `` ``Simple-Basit``, PWM Tabanlı motor denetleyicileri içindir, ``CTRE`` CAN bağlantılı CTRE Motor Denetleyicileri (örn.Talon SRX) ve ``SparkMax``, Spark Max Motor Denetleyici içindir. Bu, kullandığınız denetleyicilerin türüne özgü parametreleri doldurmanıza olanak tanır.

source: Project config settings are formatted as a `Python dictionary literal <https://docs.python.org/3/library/stdtypes.html#mapping-types-dict>`__. These can be modified via the in-window config editor:
es_mx: Los ajustes de configuración del proyecto tienen el formato `Literal de diccionario de Phynton<https://docs.python.org/3/library/stdtypes.html#mapping-types-dict>`__. Estos pueden ser modificados por el editor de configuración de ventana:
tr_tr: Proje yapılandırma ayarları, bir`Python sözlüğü değişmez değeri <https://docs.python.org/3/library/stdtypes.html#mapping-types-dict>`__ olarak biçimlendirilir. Bunlar, pencere içi yapılandırma düzenleyicisi aracılığıyla değiştirilebilir:

source: Take care of the following caveats when entering your robot specifications:
es_mx: Tenga cuidado con los siguientes advertencias al introducir las especificaciones de su robot:
tr_tr: Robot özelliklerinizi girerken aşağıdaki uyarılara dikkat edin:

source: The key names must *not be changed*, as they are hard-coded for each project type. Only the values (i.e. the things on the right-hand side of the colons) should be modified.
es_mx: Los nombres en clave *no se deben cambiar*, ya que están codificados de forma rígida para cada tipo de proyecto. solamente los valores (i.e. es decir, las cosas en el lado derecho de los dos puntos) deben modificarse.
tr_tr: Her proje türü için kodlanmış oldukları için anahtar adları *değiştirilmemelidir*. Yalnızca değerler (yani, iki nokta üst üste işaretlerinin sağ tarafındakiler) değiştirilmelidir.

source: ``True`` and ``False`` *must* be capitalized, as they are evaluated as native Python.
es_mx: ``Verdadero`` y ``Falso`` deben ser capitalizados, a medida que se evalúan como Python nativo.
tr_tr: Doğal Python olarak değerlendirildikleri için ``True`` ve ``False`` *büyük harfle yazılmalıdır*.

source: All string values (e.g. controller names and unit types) *must* be wrapped in quotes and *must* correspond exactly to one of the options described.
es_mx: Todos los valores de cadena (por ejemplo, nombres de controlador y tipos de unidad) deben incluirse entre comillas y debe corresponder exactamente a una de las opciones descritas.
tr_tr: Tüm string değerleri (ör. Kontrol cihazı adları ve birim türleri) tırnak işaretleri içine *alınmalı* ve açıklanan seçeneklerden birine tam olarak karşılık gelmelidir.

source: Read the comments provided in the config file carefully.
es_mx: Lea los comentarios proporcionados en el archivo de configuración cuidadosamente.
tr_tr: Yapılandırma dosyasında verilen yorumları dikkatlice okuyun.

source: Once your robot configuration is set, you may save it to a location/name of your choice:
es_mx: Una vez que las configuraciones de su robot están listas, debe guardarlo en una locación/nombre de su elección:
tr_tr: Robot konfigürasyonunuz ayarlandıktan sonra, bunu seçtiğiniz bir konuma / ada kaydedebilirsiniz:

source: Accordingly, you can also load an existing config file (config files are project-type-specific):
es_mx: Por consiguiente, usted también puede cargar una configuración existente (los archivos de configuración son de tipo proyecto específico):
tr_tr: Buna göre, mevcut bir yapılandırma dosyasını da yükleyebilirsiniz (yapılandırma dosyaları proje türüne özeldir):

source: Setting Units
es_mx: Unidades de ajuste
tr_tr: Birimleri Ayarlama

source: Now is also a good time to set the Team Number box and modify the units and units per rotation if necessary (units per rotation is NOT equivalent to the wheel diameter from last year's tool).
es_mx: Ahora es un buen momento para establecer el Team Number box y modificar las unidades y unidades por rotación si es necesario (las unidades por rotación NO son equivalentes a el diámetro de la rueda de la herramienta del año anterior).
tr_tr: Şimdi, Takım Numarası kutusunu ayarlamak ve gerekirse dönüş başına birimleri ve birimleri değiştirmek için de iyi bir zamandır (dönüş başına birimler, geçen yılın araçtaki tekerlek çapına eşdeğer DEĞİLDİR).

source: The :guilabel:`Unit Type` field lets you choose between various rotational and translational units (rotations, radians, degrees, feet, meters, and inches). You should choose a unit that facilitates a rough validation of the recorded measurements. For example, you could choose rotations when testing a flywheel to see if the tool's recorded rotations seem reasonable, or you could choose feet when testing a drive base to see if the recorded distance seems reasonable.
es_mx: El campo :guilabel:`Unit Type` le permite elegir entre varias unidades de rotación y traslación (rotaciones, radianes, grados, pies, metros y pulgadas). Usted debería de elegir una unidad que le facilite la validación aproximada de las medidas registradas. Por ejemplo, podría elegir rotaciones al probar un volante para ver si las rotaciones que fueron registradas por la herramienta son razonables, o podría escoger pies al probar una drive base para ver si las distancias registradas son razonables.
tr_tr: :guilabel:`Unit Type` alanı, çeşitli döndürme ve öteleme birimleri (döndürme, radyan, derece, fit, metre ve inç) arasında seçim yapmanızı sağlar. Kaydedilen ölçümlerin kabaca doğrulanmasını kolaylaştıran bir birim seçmelisiniz. Örneğin, aletin kaydedilen dönüşlerinin makul görünüp görünmediğini görmek için bir volanı test ederken rotasyonları seçebilir veya kaydedilen mesafenin makul görünüp görünmediğini görmek için bir sürücü tabanını test ederken ayakları seçebilirsiniz.

source: On the other hand, the :guilabel:`Units per Rotation` entry is how many of the previously specified units are recorded per rotation of the shaft. Do note that rotational units (rotations, radians, and degrees) have predefined/unmutable units per rotations. In contrast, translational units (meters, feet, inches) require that you specify the conversion, such as a wheel with a 3-inch diameter can be converted to 9.42 inches per rotation (:math:`\pi * 3`).
es_mx: Por otra parte, la entrada de :guilabel:`Units per Rotation` es cuantas de las unidades previamente especificadas son registradas por rotación del eje. Tenga en cuenta que las unidades de rotación (rotaciones, radianes, y grados) tienen unidades predefinidas/inalterables por rotación. En contraste, las unidades de traslación (metros, pies, pulgadas) requieren que especifique la conversión, tal como una rueda con un diámetro de 3 pulgadas se puede convertir a 9.42 pulgadas por rotación (:math:`\pi * 3`).
tr_tr: Öte yandan :guilabel:`Units per Rotation` girişi, şaftın dönüşü başına önceden belirtilen birimlerin kaçının kaydedildiğidir. Dönme birimlerinin (döndürmeler, radyanlar ve dereceler) dönüş başına önceden tanımlanmış / değiştirilemez birimlere sahip olduğunu unutmayın. Tersine, öteleme birimleri (metre, fit, inç) dönüşümü belirtmenizi gerektirir, örneğin 3 inç çapında bir tekerlek dönüş başına 9,42 inç'e dönüştürülebilir (: math: `\ pi * 3`).

source: Generate Project
es_mx: Generar un Proyecto
tr_tr: Generate-Proje Oluştur

source: Once your project has been configured, it's time to generate a deployable robot project to run the characterization:
es_mx: Una vez que tu proyecto ha sido configurado, es tiempo de generar un proyecto de robot desplegable para ejecutar la caracterización:
tr_tr: Projeniz yapılandırıldıktan sonra, karakterizasyonu çalıştırmak için yüklenebilir bir robot projesi oluşturma zamanı:

source: A generated robot project will be placed in a subfolder (named characterization-project) of your specified project location.
es_mx: Un proyecto de robot generado se colocará en una subcarpeta (llamada caracterización de proyecto) de la ubicación del proyecto especificada.
tr_tr: Oluşturulan bir robot projesi, belirtilen proje konumunuzun bir alt klasörüne (characterization-project ) yerleştirilecektir.

source: The generated robot code will be in Java, and will reflect the settings specified in your config file. Advanced users are free to modify the generated code to their liking, if the existing configuration options do not suffice.
es_mx: El código del robot será generado en Java y reflejará la configuración especificada en su archivo de configuración. Los usuarios avanzados son libres de modificar el código generado a su gusto, si las opciones de configuración no son suficientes.
tr_tr: Oluşturulan robot kodu Java'da olacak ve yapılandırma dosyanızda belirtilen ayarları yansıtacaktır. Gelişmiş kullanıcılar, mevcut yapılandırma seçenekleri yeterli değilse, üretilen kodu istedikleri şekilde değiştirmekte özgürdür.
