Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-characterization/introduction.po
Languages: es_mx, tr_tr, zh_cn

source: If you are on Ubuntu, you will have to manually install tkinter with ``sudo apt-get install python3-tk``. You will also have to use the ``pip3`` command instead of ``pip`` as ``pip`` refers to Python 2 on Ubuntu distributions.
es_mx: Si usted esta en Ubuntu, tendrá que instalar manualmente tkinter con ``sudo apt-get install Python3-tk``. También tendrá que usar el comando ``pip3`` en lugar del comando ``pip`` como ``pip`` refiriéndose a Python2 en distribuciones de Ubuntu.
tr_tr: Ubuntu'daysanız, tkinter'ı ``sudo apt-get install python3-tk`` ile manuel olarak yüklemeniz gerekecektir. Ubuntu dağıtımlarında ``pip`` Python 2'ye atıfta bulunduğundan, ``pip`` yerine ``pip3`` komutunu da kullanmanız gerekecektir.
zh_cn: 如果您使用的是Ubuntu，则必须使用`` sudo apt-get install python3-tk ''手动安装tkinter。您还必须使用pip3命令而不是pip，因为pip指的是Ubuntu发行版上的Python 2。

source: If you already have the toolsuite installed, be sure to update it regularly to benefit from bugfixes and new features additions:
es_mx: Si usted tiene instalado ya el conjunto de herramientas, asegúrese de actualizarlo regularmente para prevenir errores y agregar nuevas funciones.
tr_tr: Araç takımını zaten yüklediyseniz, hata düzeltmelerinden ve yeni özellik eklemelerinden yararlanmak için düzenli olarak güncellediğinizden emin olun:
zh_cn: 如果您已经安装了工具套件，请确保定期进行更新以从错误修正和新增功能中受益：

source: If you would like to use the beta version of this tool, you must type ``pip install --pre --upgrade frc-characterization`` instead.
es_mx: Si desea utilizar la versión beta de esta herramienta, debe escribir ``pip install --pre --upgrade frc-characterization`` en su lugar.
tr_tr: Bu aracın beta sürümünü kullanmak istiyorsanız, bunun yerine``pip install --pre --upgrade frc-characterization`` yazmalısınız.
zh_cn: 如果您想使用该工具的beta版本，则必须键入“ pip install --pre --upgrade frc-characterization ”。

source: Once the toolsuite has been installed, launch a new drive characterization project to ensure that it works by running the following command from powershell or a terminal window.
es_mx: Una vez que el conjunto de herramientas ha sido instalado, debe iniciar un nuevo proyecto de caracterización de unidades para garantizar que funciona ejecutando el siguiente comando desde powershell o una ventana de terminal.
tr_tr: Araç takımı kurulduktan sonra, powershell' den veya bir terminal penceresinden aşağıdaki komutu çalıştırarak çalıştığından emin olmak için yeni bir sürücü karakterizasyon projesi başlatın.
zh_cn: 安装工具套件后，请从Powershell或终端窗口运行以下命令，启动一个新的驱动器表征项目，以确保其工作。

source: The new project GUI should open momentarily. To launch other characterization projects, simply replace ``drive`` with the desired characterization type (``arm``, ``elevator``, ``simple-motor``).
es_mx: El nuevo proyecto GUI debería abrirse momentáneamente. Para lanzar otros proyectos de caracterización, simplemente reemplaza ``drive`` con el tipo de caracterización deseado (``arm``, ``elevator``, ``simple-motor``).
tr_tr: Yeni proje GUI' si anlık olarak açılmalıdır. Diğer karakterizasyon projelerini başlatmak için, ``drive`` ı istenen karakterizasyon tipiyle (``arm``, ``elevator``, ``simple-motor``) değiştirin.
zh_cn: 新的项目GUI应该会立即打开。要启动其他表征项目，只需用所需的表征类型（“ arm ”，“ elevator ”，“ simple-motor ”）替换“ drive ”。

source: While the new project GUI has buttons for launching both the logging tool and the analyzer tool, these can also be launched directly from the CLI by replacing ``new`` with ``logger`` or ``analyzer``.
es_mx: Mientras que el nuevo proyecto GUI tiene botones para iniciar ambos la herramienta de registro y el analizador de herramientas, estos también se pueden iniciar directamente desde la CLI reemplazando ``new`` con ``logger`` o ``analyzer``.
tr_tr: Yeni proje GUI'sinde hem günlük kaydı aracını hem de analiz aracını başlatmak için düğmeler bulunurken, bunlar``new`` yerine ``logger`` veya ``analyzer`` kullanılarak doğrudan CLI 'den başlatılabilir.
zh_cn: 尽管新的项目GUI具有用于启动日志记录工具和分析器工具的按钮，但是也可以通过将`` new ''替换为`` logger ''或`` analyzer ''来直接从CLI启动这些按钮。

source: It is highly recommended that you utilize the new project GUI to launch the logger and analyzer tools for more effective unit conversions rather than launching the logger and analyzer from the CLI.
es_mx: Se recomienda encarecidamente que utilice la nueva GUI del proyecto para iniciar las herramientas de registrador y analizador para conversiones de unidades más efectivas en lugar de iniciar el registrador y el analizador desde la CLI.

source: For more information on CLI usage, enter ``frc-characterization -h``.
es_mx: Para más información en uso de CLI, enter ``frc-characterization -h``.
tr_tr: CLI kullanımı hakkında daha fazla bilgi için, `` frc-characterization -h '' girin.
zh_cn: 有关CLI使用的更多信息，请输入“ frc-characterization -h ”。

source: The characterization tools consist of a python application that runs on the user's PC and matching robot code that runs on the user's robot. The PC application will send control signals to the robot over network tables, while the robot sends data back to the application. The application then processes the data and determines characterization parameters for the user's robot mechanism, as well as producing diagnostic plots. Data can be saved (in JSON format) for future use, if desired.
tr_tr: Karakterizasyon araçları, kullanıcının bilgisayarında çalışan bir python uygulamasından ve kullanıcının robotunda çalışan eşleşen robot kodundan oluşur. Bilgisayar uygulaması robota ağ tabloları üzerinden kontrol sinyalleri gönderirken, robot verileri uygulamaya geri gönderir. Uygulama daha sonra verileri işler ve kullanıcının robot mekanizması için karakterizasyon parametrelerini belirler ve ayrıca teşhis grafikleri üretir. Veriler, istenirse ileride kullanılmak üzere kaydedilebilir (JSON formatında).
zh_cn: 表征工具包括在用户PC上运行的python应用程序和在用户机器人上运行的匹配机器人的代码。 PC应用程序将通过网络表将控制信号发送给机器人，而机器人将数据发送回应用程序。然后，该应用程序处理数据并确定用户机器人机构的表征参数，并生成诊断图。如果需要，数据可以保存（JSON格式）以备将来使用。

source: ``kV`` describes how much voltage is needed to hold (or “cruise”) at a given constant velocity while overcoming the `electromagnetic resistance in the motor <https://en.wikipedia.org/wiki/Counter-electromotive_force>`__ and any additional friction that increases with speed (known as `viscous drag <https://en.wikipedia.org/wiki/Drag_(physics)#Very_low_Reynolds_numbers:_Stokes'_drag>`__). The relationship between speed and voltage (at constant acceleration) is almost entirely linear (with FRC\ |reg| components, anyway) because of how permanent-magnet DC motors work.
tr_tr: `` kV``, motoru belirli bir sabit hızda tutmak (veya "seyir") için ne kadar voltaj gerektiğini açıklar, `motordaki elektromanyetik direnç <https://en.wikipedia.org/wiki/Counter-electromotive_force>" __ ve hızla artan herhangi bir ek sürtünme (`viskoz sürükleme <https://en.wikipedia.org/wiki/Drag_(physics)#Very_low_Reynolds_numbers:_Stokes'_drag>`__ ) olarak bilinir. Hız ve gerilim arasındaki ilişki (sabit ivmede), kalıcı mıknatıslı DC motorların çalışma şekli nedeniyle neredeyse tamamen doğrusaldır (with FRC\ |reg| components, anyway) .
