Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-characterization/introduction.po
Languages: es_mx, tr_tr, zh_cn

source: Introduction to Robot Characterization
es_mx: Introducción a la caracterización del robot
tr_tr: Robot Karakterizasyonuna Giriş
zh_cn: 机械表征介绍<br>

source: What is "Characterization?"
es_mx: ¿Qué es "caracterización"?
tr_tr: "Karakterizasyon" nedir?
zh_cn: 什么是“表征”？

source: "Characterization" - or, more formally, `system identification <https://en.wikipedia.org/wiki/System_identification>`__ - is the process of determining a mathematical model for the behavior of a system through statistical analysis of its inputs and outputs.
es_mx: "Caracterización" - o formalmente como `sistema de identificación <https://en.wikipedia.org/wiki/System_identification>`__ - es el proceso para determinar un modelo matemático para el comportamiento a través de análisis estadístico de sus entradas y salidas.
tr_tr: "Karakterizasyon" - veya daha resmi olarak, "sistem tanımlama <https://en.wikipedia.org/wiki/System_identification>`__ - bir sistemin davranışına ilişkin matematiksel bir modeli, girdilerinin ve çıktılarının istatistiksel analizi yoluyla belirleme sürecidir.
zh_cn: "表征" ， 或者更正式地说，"系统识别”<https://en.wikipedia.org/wiki/System_identification>`__ - 是通过对系统的投入和输出进行统计分析来确定系统行为的过程。

source: In FRC, the most common system that we're interested in characterizing is the `permanent-magnet DC motor <https://en.wikipedia.org/wiki/Brushed_DC_electric_motor#Permanent-magnet_motors>`__. In particular, we're interested in figuring out which motor *input* (i.e. voltage from the motor controller) is required to achieve our desired *outputs* (i.e. velocity and acceleration of the motor).
es_mx: En FRC, el sistema mas común en el que estamos interesados en caracterizar es el `imán permanente de motor DC <https://en.wikipedia.org/wiki/Brushed_DC_electric_motor#Permanent-magnet_motors>`__. en particular estamos interesados en averiguar que entrada de motor (i.e. voltaje desde el controlador del motor) es necesario para lograr nuestras salidas deseadas (i.e velocidad y aceleración del motor).
tr_tr: FRC'de, karakterize etmekle ilgilendiğimiz en yaygın sistem, "Sabit mıknatıslı DC motor <https://en.wikipedia.org/wiki/Brushed_DC_electric_motor#Permanent-magnet_motors>`__. Özellikle, istenen * çıkışlarımızı * (yani motorun hızı ve ivmesini) elde etmek için hangi motor * input-giriş* inin (yani motor kontrolöründen gelen voltajın) gerekli olduğunu bulmakla ilgileniyoruz.
zh_cn: 在FRC比赛中，我们想表征化的最常见的系统是'永磁直流电机<https://en.wikipedia.org/wiki/Brushed_DC_electric_motor#Permanent-magnet_motors>`__. 具体来说，我们想要找出需要哪个电机“输入”（即电机控制器的电压）来实现我们所需的“输出”（即电机的速度和加速度）。

source: Fortunately, it is not so difficult to do this. A permanent-magnet DC motor (with no load other than friction and inertia) will obey the following "voltage-balance equation" (for more information, see `this paper <https://www.chiefdelphi.com/uploads/default/original/3X/f/7/f79d24101e6f1487e76099774e4ba60683e86cda.pdf>`__):
es_mx: Afortunadamente, esto no es difícil de hacer. Un motor de DC imán permanente (sin mas carga que la fricción y la inercia) obedecerá lo siguiente “ecuación de balance de voltaje” (para mas información, vea `el siguiente documento <https://www.chiefdelphi.com/uploads/default/original/3X/f/7/f79d24101e6f1487e76099774e4ba60683e86cda.pdf>`__):
tr_tr: Neyse ki bunu yapmak o kadar da zor değil. Sabit mıknatıslı bir DC motor (sürtünme ve atalet dışında yüksüz) aşağıdaki "voltaj-denge denklemine" uyacaktır (daha fazla bilgi için, bu kağıt <https://www.chiefdelphi.com/uploads/default/original/3X/f/7/f79d24101e6f1487e76099774e4ba60683e86cda.pdf> `__ 'e bakın):
zh_cn: 幸运的是，这样做并不是那么困难。永磁直流电动机（除摩擦和惯性外无负载）将遵循以下“电压平衡方程式”（有关更多信息，请参见本文<https://www.chiefdelphi.com/uploads/default/original/3X/f/7/f79d24101e6f1487e76099774e4ba60683e86cda.pdf>`__):

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the motor, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration (the "overdot" notation traditionally denotes the `derivative <https://en.wikipedia.org/wiki/Derivative>`__ with respect to time).
es_mx: Donde :math:`V` es el voltaje aplicado, :math:`d` es el desplazamiento (Posición) del motor, :math:`\dot{d}` es la velocidad y :math:`\ddot{d}` es la aceleración (la notación de overdot tradicionalmente denota el `derivado <https://en.wikipedia.org/wiki/Derivative>`__ con respecto al tiempo).
tr_tr: burada: math:`V` uygulanan voltajdır, : math:`d` motorun yer değiştirmesidir (konumudur),: math:`\ dot {d}` hızıdır ve: math:`\ ddot { d}` ivmesidir (" aşırı nokta "gösterimi geleneksel olarak zamana göre `türev <https://en.wikipedia.org/wiki/Derivative>`__ 'i belirtir).
zh_cn: 其中：V是施加的电压，D是电动机的位移（位置），\ dot {d}是其速度，而\ ddot{d}是它的加速度（传统上，“ 过点”符号表示相对于时间的导数”<https://en.wikipedia.org/wiki/Derivative>`__ ）。

source: Heuristically, we can interpret the coefficients in the above equation as follows:
es_mx: Heurísticamente, podemos interpretar los coeficientes en la ecuación anterior de la siguiente manera:
tr_tr: Sezgisel olarak, yukarıdaki denklemdeki katsayıları aşağıdaki gibi yorumlayabiliriz:
zh_cn: 试探性地，我们可以将上式中的系数解释如下：

source: ``kS`` is the voltage needed to overcome the motor's static friction, or in other words to just barely get it moving; it turns out that this static friction (because it’s, well, static) has the same effect regardless of velocity or acceleration. That is, no matter what speed you’re going or how fast you're accelerating, some constant portion of the voltage you've applied to your motor (depending on the specific mechanism assembly) will be going towards overcoming the static friction in your gears, bearings, etc; this value is your kS. Note the presence of the `signum function <https://en.wikipedia.org/wiki/Sign_function>`__, because friction force always opposes the direction-of-motion.
es_mx: ``kS`` es el voltaje que se necesita para sobrellevar la fricción estática del motor , o en otras palabras para apenas conseguirlo en movimiento; resulta que esta fricción estática (porque es, bueno, estática) tiene el mismo efecto independientemente de la velocidad o aceleración. Quiere decir que no importa la rapidez con la que viajes o que tan rápido aceleres, una porción constante del voltaje que ha aplicado a su motor (dependiendo en el ensamblaje especifico del mecanismo) se dirigirá hacia la superación de la fricción estática en sus engranajes, cojinetes, etc.; este valor es su kS. Note la presencia de `signo de función <https://en.wikipedia.org/wiki/Sign_function>`__, porque la fricción se opone a la dirección de movimiento.
tr_tr: ``kS``, motorun statik sürtünmesinin üstesinden gelmek veya başka bir deyişle onu zar zor hareket ettirmek için gereken voltajdır; Bu statik sürtünmenin (çünkü statik olduğu için) hız veya ivmeden bağımsız olarak aynı etkiye sahip olduğu ortaya çıktı. Yani, hangi hızda giderseniz gidin veya ne kadar hızlanırsanız hızlanın, motora uyguladığınız voltajın sabit bir kısmı (belirli mekanizma montajına bağlı olarak), motorunuzdaki statik sürtünmenin üstesinden gelmeye doğru gidecektir. dişliler, yataklar vb; bu değer sizin kS' nizdir. `Signum function <https://en.wikipedia.org/wiki/Sign_function>`__ varlığına dikkat edin, çünkü sürtünme kuvveti her zaman hareket yönüne karşı gelir.
zh_cn: ``kS''是克服电动机静摩擦，或换句话说，就是使电动机运动所需的最小电压。事实证明，无论速度还是加速度，这种静摩擦都具有相同的效果。也就是说，无论您以多大的速度或多大的速度加速，施加在电机上的电压的恒定部分（取决于特定的机构组件）都将克服您齿轮，轴承上的静摩擦。这个值就是您的kS。一定要注意到信号功能”<https://en.wikipedia.org/wiki/Sign_function>`__, 的存在，因为摩擦力始终与运动方向相反。

source: ``kV`` describes how much voltage is needed to hold (or "cruise") at a given constant velocity while overcoming the `electromagnetic resistance in the motor <https://en.wikipedia.org/wiki/Counter-electromotive_force>`__ and any additional friction that increases with speed (known as `viscous drag <https://en.wikipedia.org/wiki/Drag_(physics)#Very_low_Reynolds_numbers:_Stokes'_drag>`__). The relationship between speed and voltage (at constant acceleration) is almost entirely linear (with FRC\ |reg| components, anyway) because of how permanent-magnet DC motors work.
es_mx: ``kV`` describe la cantidad de tensión necesaria para mantener (o "navegar") a una velocidad constante determinada mientras se supera la "resistencia electromagnética en el motor" <https://en.wikipedia.org/wiki/Counter-electromotive_force>`__ y cualquier fricción adicional que aumente con la velocidad (conocida como "resistencia viscosa"<https://en.wikipedia.org/wiki/Drag_(physics)#Very_low_Reynolds_numbers:_Stokes'_drag>`__). La relación entre la velocidad y el voltaje (a aceleración constante) es casi totalmente lineal (con componentes FRC\ |reg| , de todos modos) debido a cómo funcionan los motores de corriente continua de imán permanente.

source: ``kA`` describes the voltage needed to induce a given acceleration in the motor shaft. As with ``kV``, the relationship between voltage and acceleration (at constant velocity) is almost perfectly linear for FRC components.
es_mx: "kA" describe el voltaje necesario para inducir una aceleración proporcionada al eje del motor. Como con "kV", la relación entre voltaje y aceleración (a una velocidad constante) es casi perfectamente lineal para los componentes de FRC.
tr_tr: `` kA`` , motor şaftında belirli bir ivmeyi indüklemek için gereken voltajı tanımlar. `` KV`` ile olduğu gibi, gerilim ve ivme arasındaki ilişki (sabit hızda) FRC bileşenleri için neredeyse mükemmel doğrusaldır.
zh_cn: ``kA''描述了在电机轴中感应给定加速度所需的电压。与``kV''一样，对于FRC组件，电压和加速度（在恒定速度下）之间的关系几乎完全呈线性关系。

source: Once these coefficients have been determined (here accomplished by a `multiple linear regression <https://en.wikipedia.org/wiki/Linear_regression>`__), we can then take a given desired velocity and acceleration for the motor and calculate the voltage that should be applied to achieve it. This is very useful - not only for, say, following motion profiles, but also for making mechanisms more controllable in open-loop control, because your joystick inputs will more closely match the actual mechanism motion.
es_mx: Una vez que estos coeficientes han sido determinados (aquí logrado por una `regresión lineal múltiple <https://en.wikipedia.org/wiki/Linear_regression>`__), podemos tomar una velocidad y aceleración deseadas dadas por el motor y calcular el voltaje que debe ser aplicado para lograrlo. Esto es muy útil no solo por decir, seguir perfiles de movimiento, sino también para hacer que los mecanismos sean mas controlables en el control de bucle abierto, porque las entradas de su joystick serán mas cercanas con el actual mecanismo de movimiento.
tr_tr: Bu katsayılar belirlendikten sonra (burada bir `çoklu doğrusal regresyon <https://en.wikipedia.org/wiki/Linear_regression>`__ ile gerçekleştirilir), daha sonra motor için belirli bir hız ve ivmeyi alabilir ve buna ulaşmak için uygulanması gereken voltajı hesaplayabiliriz. Bu çok kullanışlıdır - örneğin hareket profillerini takip etmek için değil, aynı zamanda açık döngü kontrolünde mekanizmaları daha kontrol edilebilir hale getirmek için de çok kullanışlıdır, çünkü joystick girişleriniz gerçek mekanizma hareketiyle daha yakından eşleşecektir.
zh_cn: 一旦确定了这些系数（此处通过“多次线性回归<https://en.wikipedia.org/wiki/Linear_regression>”完成），我们就可以为电动机获取给定的所需速度和加速度，并计算为达到该速度而应施加的电压。这非常有用：不仅用于跟随运动曲线，而且还可以使机械装置在开环控制中更可控，因为操纵杆输入将更接近实际机械装置的运动。

source: Some of the tools in this toolsuite introduce additional terms into the above equation to account for known differences from the simple case described above - details for each tool can be found below:
es_mx: Algunas de las herramientas en el conjunto de herramientas introducen términos adicionales en la ecuación anterior para tener en cuenta las diferencias conocidas del caso simple descrito anteriormente- los detalles para cada herramienta se pueden encontrar aquí abajo:
tr_tr: Bu araç takımındaki araçlardan bazıları, yukarıda açıklanan basit durumdan bilinen farklılıkları hesaba katmak için yukarıdaki denkleme ek terimler sunar - her bir aracın ayrıntıları aşağıda bulunabilir:
zh_cn: 该工具套件中的某些工具在上述方程式中引入了其他术语，以说明与上述简单情况的已知差异-每个工具的详细信息如下：

source: Included Characterization Tools
es_mx: Herramientas de Caracterización Incluidas
tr_tr: Dahil Edilen Karakterizasyon Araçları
zh_cn: 随附的表征工具

source: Many other types of mechanisms can be characterized by simply adapting the existing code in this library.
es_mx: Muchos otros tipos de mecanismos pueden ser caracterizados por una sencilla adaptación en el código existente en la biblioteca.
tr_tr: Diğer birçok mekanizma türü, bu kitaplıktaki mevcut kodun basitçe uyarlanmasıyla karakterize edilebilir.
zh_cn: 很多其他类型的机制可以通过简单地修改该库中的现有代码来表征

source: The robot characterization toolsuite currently supports characterization for:
es_mx: El conjunto de herramientas para la caracterización del robot actualmente soporta caracterización para:
tr_tr: Robot karakterizasyon araç takımı şu anda aşağıdakiler için karakterizasyonu desteklemektedir:
zh_cn: 机器人特征化工具套件目前支持以下特征化：

source: Simple Motor Setups
es_mx: Configuraciones simples del robot
tr_tr: Basit Motor Kurulumları
zh_cn: 简单的电机设置

source: Drivetrains
es_mx: Transmisiones
tr_tr: Aktarma organları
zh_cn: 动力总成

source: Arms
es_mx: Brazos
tr_tr: Kollar
zh_cn: 臂

source: Elevators
es_mx: Elevadores
tr_tr: Kaldırıcılar
zh_cn: 电梯

source: Simple Motor Characterization
es_mx: Caracterización Simple Motora
tr_tr: Basit Motor Karakterizasyonu
zh_cn: 简单的电机表征

source: The simple motor characterization tool determines the best-fit parameters for the equation:
es_mx: La caracterización simple motora de herramientas determina los mejores parámetros para la siguiente ecuación:
tr_tr: Basit motor karakterizasyon aracı, denklem için en uygun parametreleri belirler:
zh_cn: 这个简单的电机表征工具确定方程的最佳拟合参数：

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the drive, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration. This is the model for a permanent-magnet dc motor with no loading other than friction and inertia, as mentioned above, and is an accurate model for flywheels, turrets, and horizontal linear sliders.
es_mx: donde :math:`V` es el voltaje aplicado, :math:`d` es el desplazamiento (posición) del variador, :math:`\dot{d}` es su velocidad, y :math:`\ddot{d}` es su aceleración. Este es el modelo para un motor de corriente continua de imán permanente sin carga más que la fricción y la inercia, como se mencionó anteriormente, y es un modelo preciso para flywheels, torretas y deslizadores lineales horizontales.
tr_tr: burada: :math:`V` uygulanan voltajdır,: :math:`d` sürücünün yer değiştirmesidir (konumudur), :math:`\dot{d}` hızı ve :math:`\ddot{d}` ivmesidir. Bu, yukarıda belirtildiği gibi, sürtünme ve atalet dışında hiçbir yükü olmayan sabit mıknatıslı bir DC motor modelidir, volanlar, taretler ve yatay doğrusal kaydırıcılar için doğru bir modeldir.
zh_cn: 其中math：`V`是施加的电压，math：`d`是驱动器的位移（位置），math：`\ ddot {d}`是其速度，而math：`\ ddot { d}`是它的加速度。如上所述，该模型是除摩擦和惯性外没有负载的永磁直流电动机的模型，并且是飞轮，转塔和水平线性滑块的精确模型。

source: Drivetrain Characterization
es_mx: Caracterización de la transmisión
tr_tr: Aktarma Organları Karakterizasyonu
zh_cn: 传动系统表征

source: The drivetrain characterization tool determines the best-fit parameters for the equation:
es_mx: La caracterización de la transmisión determina los mejores parámetros para la siguiente ecuación:
tr_tr: Aktarma organı karakterizasyon aracı, denklem için en uygun parametreleri belirler:
zh_cn: 传动系统表征工具确定方程的最佳拟合参数：

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the drive, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration. This is the same modeling equation as is used in the simple motor characterization - however, the drivetrain characterizer is specifically set up to run on differential drives, and will characterize each side of the drive independently if desired.
es_mx: Donde :math:`V` es el voltaje aplicado, :math:`d` es el desplazamiento (posición) de camino, :math:`\dot{d}` es la velocidad, y :math:`\ddot{d}` es la aceleración. Este es el mismo modelo de la ecuación que se usó en la caracterización simple motora, sin embargo, el caracterizador de la transmisión está configurado específicamente para funcionar en unidades diferenciales, y caracterizará cada lado de la unidad de forma independiente si se desea.
tr_tr: burada :math:`V` uygulanan voltajdır, :math:`d` sürücünün yer değiştirmesidir (konumudur), :math:`\dot{d}` onun hızıdır ve:math:`\ddot{d}` ivmesidir. Bu, basit motor karakterizasyonunda kullanılanla aynı modelleme denklemidir - ancak, aktarma organı karakterizörü, özellikle diferansiyel sürücüler üzerinde çalışacak şekilde ayarlanmıştır ve istenirse sürücünün her bir tarafını bağımsız olarak karakterize edecektir.
zh_cn: 其中:math:`V`是施加的电压， :math:`d` 是驱动器的位移（位置），:math:`\dot{d}`是其速度，而:math:`\ddot{d}`是它的加速度。这与简单的电动机表征描述中使用的建模方程式相同。但是，传动系统表征器专门设置为在差动驱动器上运行，并且在需要时将独立地描述驱动器的每一侧。

source: The drivetrain characterizer can also determine the effective trackwidth of your robot using a gyro. More information on how to run the characterization is available in the :ref:`track width characterization <docs/software/wpilib-tools/robot-characterization/characterization-routine:Running Tests>` article.
es_mx: El caracterizador de la transmisión también puede determinar la efectividad del ancho de la vía de su robot usando un gyro. Más información sobre como ejecutar la caracterización disponible en el articulo de pista con caracterización. :ref:`track width characterization <docs/software/wpilib-tools/robot-characterization/characterization-routine:Running Tests>` article.
tr_tr: Aktarma organı karakterizatörü ayrıca bir gyro sensör kullanarak robotunuzun etkili iz genişliğini de belirleyebilir. Karakterizasyonun nasıl çalıştırılacağına dair daha fazla bilgi aşağıdaki makalede bulunmaktadır, :ref:`track width characterization <docs/software/wpilib-tools/robot-characterization/characterization-routine:Running Tests>` article.
zh_cn: 传动系特性也可以通过陀螺确定机器人的有效轨迹宽度。关于如何运行表征的更多信息可参见：ref：‘轨迹宽度表征<docs/software/wpilib-tools/robot-characterization/characterization-routine:Running Te sts>文章中提供了有关如何运行表征的更多信息。

source: Arm Characterization
es_mx: Caracterización del brazo
tr_tr: Kol Karakterizasyonu
zh_cn: 臂表征化

source: The arm characterization tool determines the best-fit parameters for the equation:
es_mx: La herramienta de caracterización del brazo determina los parámetros de mejor ajuste para la ecuación:
tr_tr: Kol karakterizasyon aracı, denklem için en uygun parametreleri belirler:
zh_cn: 臂表征工具确定方程的最佳拟合参数：

source: where :math:`V` is the applied voltage, :math:`\theta` is the angular displacement (position) of the arm, :math:`\dot{\theta}` is its angular velocity, and :math:`\ddot{\theta}` is its angular acceleration. The cosine term (:math:`kCos`) is added to correctly account for the effect of gravity.
es_mx: Donde :math:`V` es el voltaje aplicado, :math:`\theta` es el desplazamiento angular (posición) del brazo, :math:`\dot{\theta}` es la velocidad angular y :math:`\ddot{\theta}` es la aceleración angular. El término coseno (:math:`kCos`) se añade correctamente a el efecto de gravedad.
tr_tr: burada :math:`V` uygulanan gerilimdir, :math:`\theta` kolun açısal yer değiştirmesidir (konum), :math:`\dot{\theta}` açısal hızıdır ve :math:`\ddot{\theta}` açısal ivmesidir. Kosinüs terimi (: math:`kCos`), yerçekiminin etkisini doğru bir şekilde hesaba katmak için eklenir.
zh_cn: 其中 :math:`V`是施加的电压， :math:`\ theta`是手臂的角位移（位置）， :math:`\ dot {\ theta}`是其角速度，而 :math: \ ddot {\ theta}是它的角加速度。添加了余弦项（ :math:`kCos`）以正确说明重力的影响。

source: Elevator Characterization
es_mx: Caracterización del elevador
tr_tr: Kaldırıcı Karakterizasyonu
zh_cn: 电梯表征

source: The elevator characterization tool determines the best-fit parameters for the equation:
es_mx: La herramienta de caracterización del elevador determina los parámetros de mejor ajuste para la ecuación:
tr_tr: Kaldırıcı karakterizasyon aracı, denklem için en uygun parametreleri belirler:
zh_cn: 电梯表征工具确定方程的最佳拟合参数：

source: where :math:`V` is the applied voltage, :math:`d` is the displacement (position) of the drive, :math:`\dot{d}` is its velocity, and :math:`\ddot{d}` is its acceleration. The constant term (:math:`kG`) is added to correctly account for the effect of gravity.
es_mx: Donde :math:`V` es el voltaje aplicado, :math:`d` es el desplazamiento (posición) del camino, :math:`\dot{d}` es la velocidad, :math:`\ddot{d}` es la aceleración. El término constante (:math:`kG`) se añade correctamente a el efecto de gravedad.
tr_tr: burada :math:`V` uygulanan voltajdır, :math:`d` sürücünün yer değiştirmesidir (konumudur), :math:`\dot{d}` onun hızıdır ve:math:`\ddot{d}` ivmesidir. Sabit terim (: math:`kG`) yerçekiminin etkisini doğru bir şekilde hesaba katmak için eklenir.
zh_cn: 其中：math：`V`是施加的电压，：math：`d`是驱动器的位移（位置），：math：`\ dot {d}`是其速度，而：math：`\ ddot { d}`是它的加速度。添加常数项（：math：`kG`）可以正确说明重力的影响。

source: Prerequisites
es_mx: Requisitos previos
tr_tr: Önkoşullar
zh_cn: 先决条件

source: To use the Robot Characterization Toolsuite, you must have Python 3.7 installed on your computer, as well as the standard WPILib programming toolsuite.
es_mx: Para usar el conjunto de herramientas de caracterización del robot, debe tener instalado el Phyton 3.7 instalado en su computadora, así como el conjunto de herramientas de programación WPILib estándar.
tr_tr: Robot Karakterizasyon Araç Takımı'nı kullanmak için, bilgisayarınızda Python 3.7'nin yanı sıra standart WPILib programlama araç takımının kurulu olması gerekir.
zh_cn: 要使用Robot Characterization Toolsuite，您必须在计算机上安装Python 3.7以及标准的WPILib编程工具。

source: Do not install Python from the Microsoft Store. Please use the link above to download and install Python.
es_mx: No instale el Pyhton desde la tienda de Microsoft. Por favor use el link previo para descargar e instalar Python.
tr_tr: Python'u Microsoft Store'dan yüklemeyin. Python'u indirmek ve yüklemek için lütfen yukarıdaki bağlantıyı kullanın.
zh_cn: 不要从Microsoft Store安装Python。请使用上面的链接下载并安装Python。

source: Installing and Launching the Toolsuite
es_mx: Instalación y lanzamiento del conjunto de herramientas
tr_tr: Araç Takımını Kurma ve Başlatma
zh_cn: 安装和启动Toolsuite

source: To install the Robot Characterization Toolsuite, open a console and enter the following command
es_mx: Para instalar el conjunto de herramientas de caracterización del robot, abra un programa y escriba el siguiente comando.
tr_tr: Robot Karakterizasyon Araç Takımı'nı kurmak için bir konsol açın ve aşağıdaki komutu girin
zh_cn: 要安装Robot Characterization Toolsuite，请打开控制台并输入以下命令

source: The toolsuite, and all of its dependencies, should be automatically downloaded and installed. If you are using a Windows machine and the command pip is not recognized, ensure that your python scripts folder `has been added to the PATH <https://datatofish.com/add-python-to-windows-path/>`__.
es_mx: El conjunto de herramientas, y todas sus dependencias, deberán ser automáticamente descargadas e instaladas. Si usted está usando una maquina de Windows y el comando pip no es reconocido, asegúrese de que su carpeta scripts de Python `ha sido añadido al PATH <https://datatofish.com/add-python-to-windows-path/>`__.
tr_tr: Araç takımı ve tüm bağımlılıkları otomatik olarak indirilmeli ve kurulmalıdır. Bir Windows makinesi kullanıyorsanız ve pip komutu tanınmıyorsa, python betikleri klasörünüzün PATH <https://datatofish.com/add-python-to-windows-path/> "__.
zh_cn: 工具套件及其所有依赖项均应自动下载并安装。如果您使用的是Windows计算机，并且无法识别命令pip，请确保将python脚本文件夹已添加到PATH https://datatofish.com/add-python-to-windows-path/
