Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-characterization/viewing-diagnostics.po
Languages: tr_tr

source: Viewing Diagnostics
tr_tr: Veri Tanılama

source: The first diagnostic to look at is the r-squared - it should be somewhere north of ~.9. If it is significantly lower than this, there is likely a problem with your characterization data.
tr_tr: Bakılması gereken ilk veri ~0.9 'un kuzeyinde olan r-squared' dir. Bundan önemli ölçüde düşükse, muhtemelen karakterizasyon verilerinizle ilgili bir sorun vardır.

source: To investigate further, you can generate a number of diagnostic plots with the buttons on the left-hand side:
tr_tr: Daha fazla araştırma yapmak için sol taraftaki düğmelerle bir dizi tanılama grafiği oluşturabilirsiniz:

source: Time-Domain Diagnostics
tr_tr: Zaman-Alan Tanılama

source: The Time-Domain Diagnostics plots display velocity and acceleration versus time over the course of the analyzed tests. For a typical drive characterization, these should look something like this (other mechanisms will be highly similar):
tr_tr: Zaman-Alan Tanılama grafikleri, analiz edilen testler boyunca zamana karşı hız ve ivmeyi gösterir. Tipik bir sürücü karakterizasyonu için bunlar şuna benzer şekilde görünmelidir (diğer mekanizmalar oldukça benzer olacaktır):

source: The vertical "mirroring" visible here is normal, and is simply the result of the left- and right-side encoders having different signs - this does not cause any trouble for the characterization tool.
tr_tr: Burada görülen dikey "mirroring-aynalama" normaldir ve basitçe farklı işaretlere sahip sol ve sağ taraf kodlayıcıların sonucudur - bu, karakterizasyon aracı için herhangi bir soruna neden olmaz.

source: The quasistatic test ought to have nearly linear velocity, and nearly-zero acceleration (hense "quasistatic"). The dynamic test ought to have velocity that asymptotically approaches a steady-state speed (the shape of the curve should be exponential, in fact), and acceleration that, accordingly, rapidly falls to zero (also exponentially, as the derivative of an exponential function is also an exponential function).
tr_tr: Yarıistatik testin , neredeyse sıfır ivmeye (yoğun "quasistatic-yarı statik"), neredeyse doğrusal hıza sahip olması gerekir. Dinamik test, asimptotik olarak kararlı durum hızına yaklaşan hıza (aslında eğrinin şekli üstel olmalıdır) ivmeye sahip olmalıdır, buna göre (üstel bir fonksiyonun türevi aynı zamanda üstel bir fonksiyon olduğu için ayrıca üstel olarak) hızla sıfıra düşer.

source: Deviation from this behavior is a sign of an :ref:`error <docs/software/wpilib-tools/robot-characterization/viewing-diagnostics:Common Failure Modes>`, either in your robot setup, analysis settings, or your test procedure.
tr_tr: Bu davranıştan sapma, robot kurulumunuzda, analiz ayarlarınızda veya test prosedürünüzde bir :ref:`error <docs/software/wpilib-tools/robot-characterization/viewing-diagnostics:Common Failure Modes>` hatasının bir işaretidir.

source: Voltage-Domain Diagnostics
tr_tr: Gerilim Alanı Tanılama

source: The :guilabel:`Voltage-Domain` Diagnostics button plots velocity and acceleration versus voltage. Velocity is ploted for the quasistatic test, and acceleration is plotted for the dynamic test. For a typical drive characterization, the plots should resemble this (again, other mechanisms will be similar)
tr_tr: :guilabel:`Voltage-Domain` Diagnostics düğmesi, voltaja karşı hız ve ivmeyi planlar. Quasistatic test için hız, dinamik test için ise ivme grafiği çizilir. Tipik bir sürücü karakterizasyonu için, grafikler buna benzemelidir (yine, diğer mekanizmalar benzer olacaktır)

source: Both plots should be linear, however the dynamic plot will almost certainly have substantially-more noise. The noise on the dynamic plot may be reduced by increasing the ``Accel Window Size`` setting.
tr_tr: Her iki grafik de doğrusal olmalıdır, ancak dinamik grafik neredeyse kesinlikle önemli ölçüde daha fazla gürültüye sahip olacaktır. Dinamik grafik üzerindeki parazit, `` Accel Window Size-Hızlanma Pencere Boyutu`` ayarı artırılarak azaltılabilir.

source: However, if your robot or mechanism has low mass compared to the motor power, this may "eat" what little meaningful acceleration data you have (however, in these cases ``kA`` will tend towards zero and can usually be ignored, anyway).
tr_tr: Bununla birlikte, robotunuzun veya mekanizmanızın kütlesi motor gücüne kıyasla düşükse, bu, sahip olduğunuz küçük anlamlı hızlanma verilerini "eat-yiyebilir" (ancak bu durumlarda, ``kA`` sıfıra doğru eğilim gösterir ve genellikle göz ardı edilebilir. ).

source: The x-axis corresponds to ``velocity-portion voltage`` and ``acceleration-portion voltage``, respectively - as the governing voltage-balance equations are multi-dimensional, plots against raw voltage are not as useful as one might expect.
tr_tr: X ekseni, sırasıyla `` hız kısmı voltajı`` ve `` ivme kısmı voltajı`` na karşılık gelir - yöneten voltaj-denge denklemleri çok boyutlu olduğundan, ham voltaja karşı grafikler beklenildiği kadar kullanışlı değildir. .

source: 3D Diagnostics
tr_tr: 3D Tanılama

source: The :guilabel:`3D Diagnostics` button will generate a 3d plot of voltage over the entire velocity-acceleration plane (this may be an adjusted voltage to remove the nonlinearity in mechanisms with nonlinear equations, such as arms).
tr_tr: :guilabel:`3D Diagnostics` düğmesi, tüm hız-ivme düzlemi üzerinde 3 boyutlu bir voltaj grafiği oluşturacaktır (bu, kollar gibi doğrusal olmayan denklemlere sahip mekanizmalardaki doğrusal olmayışı ortadan kaldırmak için ayarlanmış bir voltaj olabilir).

source: This plot is interactive, and may be rotated by clicking-and-dragging. The quasistatic and dynamic tests should both be clearly visible as streaks of data, and the best fit-plane should pass through all the data points. The data from both the quasistatic and dynamic tests should appear as straight lines (the reason for this is left as an exercise for the reader).
tr_tr: Bu grafik etkileşimlidir ve tıklayıp sürükleyerek döndürülebilir. Yarıistatik ve dinamik testlerin her ikisi de veri çizgileri olarak açıkça görülebilir olmalı ve en iyi uyum düzlemi tüm veri noktalarından geçmelidir. Hem quasistatik hem de dinamik testlerden elde edilen veriler düz çizgiler olarak görünmelidir (bunun nedeni okuyucuya alıştırma olarak bırakılmıştır).

source: The discontinuity corresponds to ``kS``, which always opposes the direction of motion and thus changes direction as the plot crosses the 0 velocity mark.
tr_tr: Süreksizlik, her zaman hareket yönüne karşı çıkan ve böylece grafik 0 hız işaretini geçerken yön değiştiren``kS`` ye karşılık gelir.

source: Common Failure Modes
tr_tr: Yaygın Arıza Biçimleri

source: When something has gone wrong with the characterization, diagnostic plots and console output provide crucial clues as to *what* has gone wrong. This section describes some common failures encountered while running the characterization tool, the identifying features of their diagnostic plots, and the steps that can be taken to fix them.
tr_tr: Karakterizasyonda bir şeyler ters gittiğinde, tanılama grafikleri ve konsol çıktısı, * neyin * yanlış gittiğine dair çok önemli ipuçları sağlar. Bu bölümde, karakterizasyon aracını çalıştırırken karşılaşılan bazı yaygın arızalar, teşhis grafiklerinin tanımlayıcı özellikleri ve bunları düzeltmek için atılabilecek adımlar açıklanmaktadır.

source: Improperly Set Motion Threshold
tr_tr: Hareket Eşiğini Yanlış Ayarlamak

source: One of the most-common errors is an inappropriate value for the motion threshold.
tr_tr: En yaygın hatalardan biri, hareket eşiği için uygun olmayan bir değerdir.

source: Motion Threshold Too Low
tr_tr: Hareket Eşiği Çok Düşük

source: The presence of a "leading tail" (emphasized by added red circle) on the time-domain and voltage-domain plots indicates that the :guilabel:`Motion Threshold` setting is too low, and thus data points from before the robot begins to move are being included.
tr_tr: Zaman alanı ve voltaj alanı çizimlerinde "leading tail-önde gelen kuyruk" (kırmızı daire eklenmesi ile vurgulanır) varlığı :guilabel: "Motion Threshold-Hareket Eşiği" ayarının çok düşük olduğunu ve dolayısıyla robotun başlamasından önceki veri noktalarının olduğunu gösterir. hareket dahil ediliyor.

source: To solve this, increase the setting and re-analyze the data.
tr_tr: Bunu çözmek için ayarı artırın ve verileri yeniden analiz edin.

source: Motion Threshold Too High
tr_tr: Hareket Eşiği Çok Yüksek

source: While not nearly as problematic as a too-low threshold, a motion threshold that is too high will result in a large "gap" in the voltage domain quasistatic plot.
tr_tr: Çok düşük bir eşik kadar neredeyse sorunlu olmasa da, çok yüksek bir hareket eşiği, voltaj alanı yarı statik grafiğinde büyük bir "gap-boşluk" ile sonuçlanacaktır.

source: To solve this, decrease the setting and re-analyze the data.
tr_tr: Bunu çözmek için ayarı azaltın ve verileri yeniden analiz edin.

source: Magnetic Encoders Velocity Noise
tr_tr: Manyetik Kodlayıcılar Hız Gürültüsü

source: Magnetic encoders such as the `CTRE Mag Encoder <http://www.ctr-electronics.com/srx-magnetic-encoder.html>`__ and the `AndyMark magnetic encoder <https://www.andymark.com/products/am-mag-encoder>`__ are extremely popular in FRC. However, a particular noise pattern has been observed when these encoders are used on robot drives, whose particular cause is not yet known. This noise pattern is uniquely distinguished by significant velocity noise proportional to motor velocity, and is particularly common on the kit-of-parts `toughbox mini <https://www.andymark.com/products/toughbox-mini-options>`__ gearboxes.
tr_tr: `CTRE Mag Encoder <http://www.ctr-electronics.com/srx-magnetic-encoder.html>`__ ve "AndyMark manyetik kodlayıcı <https://www.andymark.com/products/am-mag-encoder>`__ gibi manyetik kodlayıcılar, FRC'de oldukça popülerdir. Bununla birlikte, bu kodlayıcılar, belirli nedeni henüz bilinmeyen robot sürücülerinde kullanıldığında belirli bir kirlilik modeli gözlemlenmiştir. Bu kirlilik modeli, motor hızıyla orantılı önemli hız kirliliği ile benzersiz bir şekilde ayırt edilir ve özellikle parça kitinde `toughbox mini <https://www.andymark.com/products/toughbox-mini-options>`__ dişli kutularında yaygındır.

source: Characterization constants can sometimes be accurately determined even from data polluted this noise by increasing the accel window size setting. However, this sort of encoder noise is problematic for robot code much the same way it is problematic for the characterization tool. As the root cause of the noise is not known, it is recommended to try a different encoder setup if this is observed, either by moving the encoders to a different shaft or replacing them with a different type of encoder.
tr_tr: Karakterizasyon sabitleri bazen hızlanma penceresi boyutu ayarını artırarak bu gürültüyü kirleten verilerden bile doğru bir şekilde belirlenebilir. Bununla birlikte, bu tür bir kodlayıcı kirliliği, karakterizasyon aracı için sorunlu olduğu gibi, robot kodu için de sorunludur. Kirliliğin temel nedeni bilinmediğinden, bu gözlenirse, kodlayıcıları farklı bir şafta taşıyarak veya farklı türde bir kodlayıcıyla değiştirerek farklı bir kodlayıcı kurulumunun denenmesi önerilir.

source: Template Lag
tr_tr: Şablon Gecikmesi

source: With the new characterization tool, the logging code might not be able to keep up with its 5 ms refresh rate thus causing faulty data to be collected.
tr_tr: Yeni karakterizasyon aracı ile, kayıt kodu 5 ms'lik yenileme hızına yetişemeyebilir ve bu da hatalı verilerin toplanmasına neden olabilir.

source: To see if this is the case, enable print statements on the Driver Station whenever running the data logger. When Autonomous mode is exited, the console will output ``Collected : n in t seconds`` where ``n`` is the number of samples and ``t`` is the time elapsed. If the sampling was successful, ``n`` should equal ``200t`` (rounded).
tr_tr: Durumun böyle olup olmadığını görmek için, veri kaydediciyi her çalıştırdığınızda Driver Station'da yazdırma bildirimlerini etkinleştirin. Otonom moddan çıkıldığında, konsol ``Toplandı: t saniye içinde n`` çıktısını verecektir; burada ``n`` örnek sayısı ve ``t`` geçen süredir. Örnekleme başarılı olduysa, ``n``, ``200t`` ye (yuvarlanmış) eşit olmalıdır.
