Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/creating-robot-programs/command-and-control-tutorial.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Called once for each disabled packet and can be used to debug sensors when you don’t want the robot to move.
es_mx: Se llama una vez por cada paquete deshabilitado y se puede usar para depurar sensores cuando no desea que el robot se mueva.
fr_ca: Appelé une fois pour chaque paquet désactivé et peut être utilisé pour déboguer les capteurs lorsque vous ne voulez pas que le robot se déplace.
tr_tr: Devre dışı bırakılan her paket için bir kez çağrılır ve robotun hareket etmesini istemediğinizde sensörlerde hata ayıklamak için kullanılabilir.
zh_cn: 为每个禁用的数据包调用一次，当您不希望机器移动时，可用于调试传感器。

source: Finish
es_mx: Terminar
zh_cn: 结束

source: During development, this may be called when robot code finishes. Not called on abort or when power is turned off.
es_mx: Durante el desarrollo, esto puede ser llamado cuando el código del robot termine. No se llama "abortar" o cuando se apaga la energía.
fr_ca: Pendant l'exécution du code du robot, ce VI peut être appelé lorsque le code du robot se termine. Il n'est pas appelé lorsque le programme avorte ou lorsque l’alimentation est coupée.
tr_tr: Geliştirme sırasında bu, robot kodu bittiğinde çağrılabilir. Durdurulduğunda veya güç kapatıldığında çağrılmaz.
zh_cn: 在开发过程中，机器代码完成时可以调用此方法。在中止或电源关闭时不调用。

source: Periodic Tasks
es_mx: Tareas periódicas
zh_cn: 周期任务

source: A good place for ad hoc periodic loops for debugging or monitoring
es_mx: Un buen lugar para los bucles periódicos ad hoc para la depuración o la vigilancia
fr_ca: Un bon endroit pour les boucles périodiques ad hoc pour le débogage ou la surveillance
tr_tr: Hata ayıklama veya izleme için ad hoc periyodik döngüler için iyi bir yer
zh_cn: 临时循环进行调试或监视的好方法

source: Robot Global Data
es_mx: Datos globales del robot
zh_cn: 机器全局数据

source: Useful for sharing robot information that doesn’t belong to a subsystem.
es_mx: Útil para compartir información de los robots que no pertenece a un subsistema.
fr_ca: Utile pour partager des informations du robot qui n’appartiennent pas à un sous-système en particulier.
tr_tr: Bir alt sisteme ait olmayan robot bilgilerini paylaşmak için kullanışlıdır.
zh_cn: 用于共享不属于子系统的机器信息。

source: Support Code
es_mx: Código de apoyo
tr_tr: Destek Kodu
zh_cn: 支持代码

source: Debugging and code development aids.
es_mx: Ayudas para la depuración y el desarrollo de códigos.
fr_ca: Débogage et aides au développement du code.
tr_tr: Hata ayıklama ve kod geliştirme yardımcıları.
zh_cn: 调试和代码开发辅助工具。

source: Vision
es_mx: Visión
zh_cn: 视图

source: Subsystem and commands for the camera and image processing.
es_mx: Subsistema y comandos para la cámara y el procesamiento de imágenes.
fr_ca: Sous-système et commandes pour la caméra et le traitement d’image.
tr_tr: Kamera ve görüntü işleme için alt sistem ve komutlar.
zh_cn: 相机和图像处理的子系统和命令。

source: Top level VI that you will run while developing code.
es_mx: El máximo nivel VI que se ejecutará mientras se desarrolla el código.
fr_ca: C'est le VI que vous lancez pour l'execution du code au complet de votre robot.
tr_tr: Kod geliştirirken çalıştıracağınız en üst seviye VI.
zh_cn: 开发代码时将运行的最高级VI。

source: VI that runs during autonomous period.
es_mx: VI que se desarrolla durante el período autónomo.
fr_ca: Ce VI est exécuté pendant le mode autonome.
tr_tr: Otonom periyodu boyunca çalışan VI.
zh_cn: 在自动阶段内运行的VI。

source: VI that is called for each TeleOp packet.
es_mx: VI que se llama para cada paquete de TeleOp.
fr_ca: Ce VI est appelé pour chaque paquet du mode TeleOp.
tr_tr: Her TeleOp paketi için çağrılan VI.
zh_cn: 被每个TeleOp数据包调用的VI。

source: VI that runs when driver station is in test mode.
es_mx: VI que se ejecuta cuando la "driver station" está en modo de prueba.
fr_ca: Ce VI est exécuté lorsque la Driver Station est en mode test.
tr_tr: Driver Station test modundayken çalışan VI.
zh_cn: 在driver station处于测试模式时运行的VI。

source: VI that contains and starts all subsystems.
es_mx: VI que contiene y pone en marcha todos los subsistemas.
fr_ca: Ce VI renferme et démarre tous les sous-système.
tr_tr: Tüm alt sistemleri içeren ve başlatan VI.
zh_cn: 包含并启动所有子系统的VI。

source: Shows the files used by the robot code.
es_mx: Muestra los archivos usados por el código del robot.
fr_ca: Affiche les fichiers utilisés par le code robot.
tr_tr: Robot kodu tarafından kullanılan dosyaları gösterir.
zh_cn: 显示机器代码使用的文件。

source: Used to build and run the code as a startup application once code works correctly.
es_mx: Se usa para construir y ejecutar el código como una aplicación de inicio una vez que el código funciona correctamente.
fr_ca: Utilisé pour compiler et exécuter le code en tant qu’application de démarrage une fois que le code fonctionne correctement.
tr_tr: Kod doğru çalıştıktan sonra kodu bir başlangıç uygulaması olarak oluşturmak ve çalıştırmak için kullanılır.
zh_cn: 一旦代码正常运行，它将被用于将代码作为启动应用程序构建和运行。

source: Drive Subsystem Project Explorer
es_mx: Explorador del proyecto del subsistema de conducción
fr_ca: Explorateur de projets pour le sous-système lecteur
zh_cn: 驱动器子系统项目资源管理器

source: Commands:
es_mx: Comandos:
zh_cn: 命令：

source: This folder contains the command VIs that request the controller carry out an operation. It also contains templates for creating additional drive commands.
es_mx: Esta carpeta contiene el comando VIs que solicita al controlador realizar una operación. Además contiene plantillas para crear comandos de unidad adicionales.
fr_ca: Ce dossier contient les VIs de commandes qui commandent au contrôleur d’effectuer une opération. Il contient également des modèles pour la création de commandes de déplacement supplémentaires.
tr_tr: Bu klasör, denetleyiciden bir işlem gerçekleştirmesini isteyen komut VI'ları içerir. Ayrıca, ek sürücü komutları oluşturmak için şablonlar içerir.
zh_cn: 该文件夹包含要求控制器执行操作的指令VI。它还包含用于创建其他驱动器命令的模板。

source: After creating a new command, you may need to edit ``Drive Setpoints.ctl`` to add or update fields that controller uses to define the new operation. You also need to go into the Drive Controller.vi and modify the case structure to add a case for every value.
es_mx: Después de crear un nuevo comando, podría necesitar editar ``Drive Setpoints.ctl`` para añadir o actualizar campos que el controlador usa para definir la nueva operación. También podría necesitar ir dentro del Drive Controller.vi y modificar la estructura del caso para añadir un caso para cada valor.
fr_ca: Après avoir créé une nouvelle commande, vous pouvez avoir besoin de modifier ``Drive Setpoints.ctl`` pour ajouter ou mettre à jour les champs utilisés par le contrôleur pour définir la nouvelle fonctionnalité. Vous pouvez également avoir besoin d'entrer dans le Controller.vi pour le déplacement et modifier la **structure case** afin d'ajouter un cas pour chaque valeur.
tr_tr: Yeni bir komut oluşturduktan sonra, denetleyicinin yeni işlemi tanımlamak için kullandığı alanları eklemek veya güncellemek için ``Drive Setpoints.ctl`` dosyasını düzenlemeniz gerekebilir. Ayrıca, her değer için bir durum eklemek için Drive Controller.vi'ye gitmeniz ve durum yapısını değiştirmeniz gerekir.
zh_cn: 创建新指令后，您可能需要对 ``Drive Setpoints.ctl`` 进行编辑以添加或更新控制器以定义新操作的字段。您还需要进入Drive Controller.vi并修改案例结构以为每个值添加案例。

source: Implementation
es_mx: Implementación
fr_ca: Implémentation
tr_tr: Uygulama
zh_cn: 执行

source: These are the VIs and Controls used to build the subsystem.
es_mx: Estos son los VIs y Controles usados para construir el subsistema.
fr_ca: Il s’agit des VIS et des contrôles utilisés pour construire le sous-système.
tr_tr: Bunlar, alt sistemi oluşturmak için kullanılan VI'lar ve Kontrollerdir.
zh_cn: 这些是用于构建子系统的VI和控件。

source: Infrastructure VIs
es_mx: Infraestructura VIs
tr_tr: Altyapı VI ları
zh_cn: 基础架构VI

source: Drive Check for New Command: It is called each iteration of the controller loop. It checks for new commands, updates timing data, and upon completion notifies a waiting command.
es_mx: Comprobación de conducción para el Nuevo Comando: Se llama cada iteración del bucle controlador. Comprueba si hay nuevos comandos, actualiza los datos de tiempo, y al terminar notifica un comando de espera.
fr_ca: Drive Check for New Command: Il est appelé à chaque itération de la boucle du contrôleur. Il vérifie les nouvelles commandes, met à jour les données de synchronisation et, une fois terminé, notifie une commande en attente.
tr_tr: Drive Check for New Command: Denetleyici döngüsünün her yinelemesi olarak adlandırılır. Yeni komutları kontrol eder, zamanlama verilerini günceller ve tamamlandığında bir bekleme komutunu bildirir.
zh_cn: 驱动器检查新指令：称为控制器循环的每次迭代。它检查新指令，定时更新数据，并在完成后通知等待的指令。

source: Drive Command Helper.vi: Commands call this VI to notify the controller that a new command has been issued.
es_mx: Conduzca el Ayudante de Comando.vi: Los comandos llaman a este VI para notificar al controlador que se ha emitido un nuevo comando.
fr_ca: Drive Command Helper.vi: Les commandes appellent ce VI pour informer le contrôleur qu’une nouvelle commande a été émise.
tr_tr: Drive Command Helper.vi: Komutlar, yeni bir komutun verildiğini kontrolöre bildirmek için bu VI'yı çağırır.
zh_cn: 驱动器指令帮助.vi：命令调用该VI以通知控制器已发出新指令。

source: Drive Controller Initialization.vi: It allocates the notifier and combines the timing, default command, and other information into a single data wire.
es_mx: Drive Controller Initialization.vi: Asigna el notificador y combina el tiempo, el comando predeterminado y otra información en un solo cable de datos.
fr_ca: Drive Controller Initialization.vi: Il alloue le notifiant et combine la synchronisation, la commande par défaut et d’autres informations dans un seul câble de données.
tr_tr: Drive Controller Initialization.vi: Bildiriciyi tahsis eder ve zamanlamayı, varsayılan komutu ve diğer bilgileri tek bir veri kablosunda birleştirir.
zh_cn: 驱动器控制器初始化.vi：它分配通知程序，并将定时、默认指令和其他信息组合到一条数据线上。

source: Drive Controller.vi: This VI contains the control/state machine loop. The panel may also contain displays useful for debugging.
es_mx: Drive Controller.vi: Este VI contiene el bucle de la máquina de control/estado. El panel también puede contener pantallas útiles para la depuración.
fr_ca: Drive Controller.vi: Ce VI contient la boucle pour le contrôle/la machine à états. Le panneau peut également contenir des affichages utiles pour le débogage.
tr_tr: Drive Controller.vi: Bu VI, control/state machine döngüsünü içerir. Panel ayrıca hata ayıklama için yararlı ekranlar içerebilir.
zh_cn: 驱动器控制器.vi：该VI包含控制/状态机制循环。该面板还可能包含对调试有用的显示。

source: Drive Operation.ctl: This typedef defines the operational modes of the controller. Many commands can share an operation.
es_mx: Drive Operation.ctl: Este tipedef define los modos de funcionamiento del controlador. Muchos comandos pueden compartir una operación.
fr_ca: Drive Operation.ctl: Ce typedef définit les modes opérationnels du contrôleur. De nombreuses commandes peuvent partager une opération.
tr_tr: Drive Operation.ctl: Bu typedef, denetleyicinin çalışma modlarını tanımlar. Birçok komut bir işlemi paylaşabilir.
zh_cn: 驱动器操作.ctl：此typedef定义控制器的操作模式。许多命令可以共享一个操作。

source: Drive Setpoint.ctl: It contains the data fields used by all operating modes of the Drive subsystem.
es_mx: Drive Setpoint.ctl: Contiene los archivos de datos usados por todos los modos de funcionamiento del subsistema Drive.
fr_ca: Drive Setpoint.ctl: Il contient les champs de données utilisés par tous les modes d’opération du sous-système de déplacement.
tr_tr: Drive Setpoint.ctl: Drive alt sisteminin tüm çalışma modları tarafından kullanılan veri alanlarını içerir.
zh_cn: 驱动器设定.ctl：它包含Drive子系统的所有操作模式所使用的数据字段。

source: Drive Published Globals.vi: A useful place for publishing global information about the drive subsystem.
es_mx: Drive Published Globals.vi:: Un lugar útil para publicar información global sobre el subsitema drive.
fr_ca: Drive Published Globals.vi: Une place utile pour publier des informations globales du sous-système de déplacement.
tr_tr: Drive Published Globals.vi: Sürücü alt sistemi hakkında genel bilgileri yayınlamak için yararlı bir yer.
zh_cn: 驱动器发布的全局变量.vi：发布有关驱动器子系统的全局信息的有用位置。

source: Part 2: Initializing the Drive Subsystem
es_mx: Parte 2: Iniciando el subsistema de accionamiento
fr_ca: Partie 2 : Initialisation du sous-système de déplacement
tr_tr: Bölüm 2: Drive Subsystem-Sürücü Alt Sistemini Başlatma
zh_cn: 第2部分：初始化驱动器子系统

source: There are green comments on the controller’s block diagram that point out key areas that you will want to know how to edit.
es_mx: Hay comentarios en verde en el diagrama de bloques del controlador que señalan áreas clave que querrás saber cómo editar.
fr_ca: Sur le diagramme bloc du contrôleur, il y a des commentaires en fond vert qui soulignent les zones clés qu'il serait judicieux de savoir comment modifier.
tr_tr: Denetleyicinin blok diyagramında, nasıl düzenleneceğini bilmek isteyeceğiniz önemli alanları gösteren yeşil yorumlar vardır.
zh_cn: 控制器程序框图上有绿色注释，在关键区域指出了如何编辑的方法。

source: The area to the left of the control loop will execute once when the subsystem starts up. This is where you will typically allocate and initialize all I/O and state data. You may publish the I/O refnums, or you may register them for Test Mode Only to keep them private so that other code cannot update motors without using a command.
es_mx: El área a la izquierda del bucle de control se ejecutará una vez cuando el subsistema se ponga en marcha. Aquí es donde normalmente se asignarán e inicializarán todos los datos de E/S y de estado. Puedes publicar los refnums de E/S, o puedes registrarlos en el modo de prueba sólo para mantenerlos privados de modo que otros códigos no puedan actualizar los motores sin usar un comando.
fr_ca: La zone située à gauche de la boucle de contrôle s’exécute une fois lorsque le sous-système démarre. C’est là que vous allouez et initialisez généralement toutes les données d’I/O et d’état. Vous pouvez publier les I/O refnums, ou vous pouvez les enregistrer en mode test uniquement pour les garder privés afin que d’autres codes externes ne puissent pas mettre à jour les moteurs sans utiliser une commande.
tr_tr: Kontrol döngüsünün solundaki alan, alt sistem başladığında bir kez çalıştırılacaktır. Burası, genellikle tüm I/O ve durum verilerini tahsis edeceğiniz ve başlatacağınız yerdir. I/O refnum'larını yayınlayabilirsiniz veya onları yalnızca Test Modu'na kaydederek diğer kodların bir komut kullanmadan motorları güncelleyememesi için onları gizli tutabilirsiniz.
zh_cn: 子系统启动时，控制循环左侧的区域将执行一次。通常在这里分配和初始化所有I / O和状态数据。您可以发布I / O引用句柄，也可以将它们注册为“测试模式”仅是为了使其私有，以便其他代码在不使用指令的情况下无法更新电动机。

source: Initializing the resources for each subsystem in their respective Controller.vi rather than in Begin.vi improves I/O encapsulation, reducing potential resource conflicts and simplifies debugging.
es_mx: La inicialización de los recursos de cada subsistema en su respectivo Controller.vi en lugar de en Begin.vi mejora la encapsulación de E/S, reduciendo los posibles conflictos de recursos y simplifica la depuración.
fr_ca: L’initialisation des ressources pour chaque sous-système dans leur Controller.vi respectif plutôt que dans Begin.vi améliore l’encapsulation des I/O, réduisant les conflits de ressources potentiels et simplifie le débogage.
tr_tr: Her bir alt sistem için kaynakları Begin.vi yerine ilgili Controller.vi'de başlatmak, I/O kapsüllemeyi geliştirir, olası kaynak çakışmalarını azaltır ve hata ayıklamayı basitleştirir.
zh_cn: 在各自的Controller.vi中而不是Begin.vi中初始化每个子系统的资源可以改善I / O封装，减少潜在的资源冲突并简化调试。

source: Part of the initialization is to select the default operation and set point values when no other operation is being processed.
es_mx: Parte de la inicialización consiste en seleccionar la operación predeterminada y los valores de punto de ajuste cuando no se está procesando ninguna otra operación.
fr_ca: Une partie de l’initialisation consiste à sélectionner l’opération par défaut et à définir des valeurs de points de consigne lorsqu’aucune autre opération n’est en cours de traitement.
tr_tr: Başlatma işleminin bir kısmı, başka hiçbir işlem işlenmediğinde varsayılan işlemi ve ayar noktası değerlerini seçmektir.
zh_cn: 初始化的一部分是在不处理其他任何操作时选择默认操作和节点值。

source: Inside the control loop is a case statement where operations are actually implemented. Set point values, iteration delay, iteration count, and sensors can all have influence on how the subsystem operates. This case structure has a value for each operation state of the subsystem.
es_mx: Dentro del bucle de control hay una declaración de caso donde las operaciones se llevan a cabo realmente. Los valores del punto de ajuste, el retardo de iteración, el recuento de iteración y los sensores pueden influir en el funcionamiento del subsistema. Esta estructura de caso tiene un valor para cada estado de operación del subsistema.
fr_ca: À l’intérieur de la boucle de contrôle se trouve une statement à conditions où les opérations sont effectivement implémentées. Les points de consigne, les délais d’itération, le nombre d’itérations et les capteurs peuvent tous avoir une influence sur la façon de fonctionner du sous-système. Cette structure à condition a une valeur pour chaque état d’opération du sous-système.
tr_tr: Kontrol döngüsünün içinde, işlemlerin gerçekte uygulandığı bir durum ifadesi bulunur. Ayar noktası değerleri, yineleme gecikmesi, yineleme sayısı ve sensörlerin tümü, alt sistemin nasıl çalıştığını etkileyebilir. Bu case yapısı, alt sistemin her çalışma durumu için bir değere sahiptir.
zh_cn: 控制循环内部实际执行了操作的是一个case语句。设定节点值，迭代延迟，迭代计数和传感器都可能影响子系统的运行方式。此案例结构具有子系统的每个操作状态的值。

source: Each iteration of the controller loop will optionally update the Trace VI. The framework already incorporates the subsystem name, operation, and description, and you may find it helpful to format additional set point values into the trace information. Open the Trace VI and click Enable while the robot code is running to current setpoints and commands sent to each subsystem.
es_mx: Cada iteración del bucle controlador actualizará opcionalmente el Trace VI. El marco ya incorpora el nombre del subsistema, la operación y la descripción, y puede resultar útil dar formato a valores de puntos de ajuste adicionales en la información de la traza. Abra el Trace VI y haga clic en Activar mientras el código del robot se ejecuta a los puntos de ajuste actuales y a los comandos enviados a cada subsistema.
fr_ca: Chaque itération de la boucle du contrôleur mettra éventuellement à jour le *Trace VI*. Le cadre de développement intègre déjà le nom, l’opération et la description du sous-système, et vous trouverez peut-être utile de mettre en forme des valeurs des points de consigne dans les informations de trace. Ouvrez le Trace VI et cliquez sur Enable pendant que le code robot s’exécute pour atteindre les points de consigne actuels et les commandes envoyées à chaque sous-système.
tr_tr: Denetleyici döngüsünün her yinelemesi isteğe bağlı olarak Trace VI'yı güncelleyecektir. Çerçeve zaten alt sistem adını, çalışmasını ve açıklamasını içerir ve izleme bilgilerine ek ayar noktası değerlerini biçimlendirmeyi yararlı bulabilirsiniz. Trace VI'yı açın ve robot kodu her bir alt sisteme gönderilen mevcut ayar noktaları ve komutlarda çalışırken Enable'e tıklayın.
zh_cn: 控制器循环的每次迭代将可选地更新跟踪VI。该框架已经包含子系统名称，操作和描述，您可能会发现将其他设置点值格式化为跟踪信息很有用。在机器代码运行到当前设置点和发送到每个子系统的命令时，打开Trace VI，然后单击“启动”。

source: The primary goal of the controller is to update actuators for the subsystem. This can occur within the case structure, but many times, it is beneficial to do it downstream of the structure to ensure that values are always updated with the correct value and in only one location in the code.
es_mx: El objetivo principal del controlador es actualizar los actuadores del subsistema. Esto puede ocurrir dentro de la estructura de la caja, pero muchas veces, es beneficioso hacerlo aguas abajo de la estructura para asegurar que los valores se actualizan siempre con el valor correcto y en una sola ubicación en el código.
fr_ca: L’objectif principal du contrôleur est de mettre à jour les actionneurs du sous-système. Cela peut se produire dans la structure à conditions, mais très souvent, il est avantageux de le faire en aval de la structure pour s’assurer que les valeurs sont toujours mises à jour avec la valeur correcte et dans un seul emplacement dans le code.
tr_tr: Kontrolörün birincil amacı, alt sistem için aktüatörleri güncellemektir. Bu, case yapısı içinde meydana gelebilir, ancak çoğu zaman, değerlerin her zaman doğru değerle ve kodda yalnızca bir konumda güncellendiğinden emin olmak için bunu yapının aşağı yönünde yapmak yararlıdır.
zh_cn: 控制器的主要目标是更新子系统的执行器。这可以在case结构内进行，但是很多时候，在结构的下游进行操作以确保始终在代码中的一个位置始终以正确的值更新值是有益的。

source: Part 3: Drive Subsystem Shipped Commands
es_mx: Parte 3: Comandos enviados por el subsistema de conducción
fr_ca: Partie 3 : Commandes intégrées dans le sous-système de déplacement
tr_tr: Bölüm 3: Drive Subsystem Taşınan Komutlar
zh_cn: 第3部分：驱动器子系统附带的命令

source: There are 3 shipped example commands for each new subsystem:
es_mx: Hay 3 comandos de ejemplo enviados para cada nuevo subsistema:
fr_ca: Il existe 3 commandes d’exemple jointes pour chaque nouveau sous-système :
tr_tr: Her yeni alt sistem için gönderilen 3 örnek komut vardır:
zh_cn: 每个新子系统都有3个附带的示例命令：

source: Drive For Time.vi
es_mx: Conduzca por el tiempo.vi
tr_tr: Time For Drive.vi

source: This VI sets the motors to run for a given number of seconds. It optionally synchronizes with the completion of the command.
es_mx: Este VI pone los motores en marcha durante un número determinado de segundos. Opcionalmente se sincroniza con la finalización del comando.
fr_ca: Ce VI configure les moteurs de manière à fonctionner pendant un certain nombre de secondes. Il se synchronise éventuellement avec la fin de l'exécution de la commande.
tr_tr: Bu VI, motorları belirli bir saniye kadar çalışacak şekilde ayarlar. İsteğe bağlı olarak komutun tamamlanmasıyla senkronize olur.
zh_cn: 该VI将电动机设置为运行给定的秒数。它可以选择与指令的完成同步。

source: The Drive for Time case will operate the motors at the set point until the timer elapses or a new command is issued. If the motors have the safety timeout enabled, it is necessary to update the motors at least once every 100ms. This is why the code waits for the smaller of the remaining time and 50ms.
es_mx: El caso Drive for Time hará funcionar los motores en el punto de ajuste hasta que el temporizador transcurra o se emita un nuevo comando. Si los motores tienen el tiempo de seguridad habilitado, es necesario actualizar los motores al menos una vez cada 100ms. Por eso el código espera el menor de los tiempos restantes y 50ms.
fr_ca: La condition *The Drive for Time* actionnera les moteurs au point de consigne jusqu’à ce que le délai s’écoule ou qu’une nouvelle commande soit émise. Si les moteurs ont le paramètre *safety timeout* activé, il est nécessaire de les mettre à jour au moins une fois tous les 100ms. C’est pourquoi le code attend la plus petite fraction du temps restant et 50ms.
tr_tr: Drive for Time durumu, zamanlayıcı sona erene veya yeni bir komut verilene kadar motorları ayar noktasında çalıştıracaktır. Motorlarda güvenlik zaman aşımı etkinleştirilmişse, motorların en az 100 ms'de bir güncellenmesi gerekir. Bu nedenle kod kalan sürenin küçük olanını ve 50ms'yi bekler.
zh_cn: “时间驱动”情况将在设定点操作电动机，直到计时器过去或发出新指令为止。如果电动机启用了安全超时功能，则必须每100毫秒至少更新一次电动机。这就是代码等待剩余时间和50ms中较小者的原因。

source: Drive Immediate.vi
es_mx: Conduzca inmediatamente.vi
