Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/creating-robot-programs/command-and-control-tutorial.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Next, add code to the Drive Controller to define what happens when the Drive for Distance command executes. Right click on the Case Structure and Duplicate or Add Case for Every Value. This will create a new “Drive for Distance” case.
fr_ca: Ensuite, ajoutez du code au **Drive Controller** pour définir ce qui se passe lorsque la commande *Drive for Distance* s’exécute. Cliquez avec le bouton droit sur la Structure de conditions et le dupliquer ou ajouter d'autres cas chaque valeur. Cela créera une nouvelle condition “Drive for Distance”.

source: In order to access new setpoint fields, grow the “Access Cmd setpoints” unbundle node. Open your encoder(s) on the outside, to the left of the loop. In the new diagram of the case structure, we added a call to reset the encoder on the first loop iteration and read it otherwise. There is also some simple code that compares encoder values and updates the motor power. If new controls are added to the setpoints cluster, you should also consider adding them to the Trace. The necessary changes are shown in the image below.
fr_ca: Afin d’accéder aux nouveaux champs de setpoint, développez le nœud de dissocation “Access Cmd setpoints”. Ouvrez votre encodeur(s) à l’extérieur, à gauche de la boucle. Dans le nouveau diagramme de la structure case, nous avons ajouté un appel pour réinitialiser l’encodeur sur la première itération de boucle et le lire autrement. Il y a aussi un simple code qui compare les valeurs de l’encodeur et met à jour la puissance du moteur. Si de nouveaux contrôles sont ajoutés au cluster des points de consigne, vous devez également envisager de les ajouter au Trace VI. Les modifications nécessaires sont indiquées dans l’image ci-dessous.
