Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/creating-robot-programs/command-and-control-tutorial.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Command and Control Tutorial
es_mx: Tutorial de comando y control
fr_ca: Didacticiel de commande et de contrôle
tr_tr: Command ve Control Eğitimi
zh_cn: 指令与控制教程

source: Introduction
es_mx: Introducción
tr_tr: Giriş
zh_cn: 简介

source: Command and Control is a new LabVIEW template added for the 2016 season which organizes robot code into commands and controllers for a collection of robot-specific subsystems. Each subsystem has an independent control loop or state machine running at the appropriate rate for the mechanism and high-level commands that update desired operations and set points. This makes it very easy for autonomous code to build synchronous sequences of commands. Meanwhile, TeleOp benefits because it can use the same commands without needing to wait for completion, allowing for easy cancellation and initiation of new commands according to the drive team input. Each subsystem has a panel displaying its sensor and control values over time, and command tracing to aid in debugging.
es_mx: *Command and Control* es una nueva plantilla de LabVIEW agregada para la temporada 2016 que organiza el código del robot en comandos y controladores para una colección de subsistemas específicos del robot. Cada subsistema tiene un bucle de control independiente o una máquina de estado que se ejecuta a la velocidad adecuada para el mecanismo y los comandos de alto nivel que actualizan las operaciones y los puntos de ajuste deseados. Esto hace que sea muy fácil para el código autónomo construir secuencias síncronas de comandos. Mientras tanto, TeleOp se beneficia porque puede usar los mismos comandos sin necesidad de esperar a que se completen, lo que permite una fácil cancelación e inicio de nuevos comandos de acuerdo con la entrada del equipo de manejo. Cada subsistema tiene un panel que muestra sus valores de sensor y control a lo largo del tiempo, y seguimiento de comandos para ayudar en la depuración.
fr_ca: **Command and Control** est un nouveau modèle LabVIEW ajouté pour la saison 2016 qui organise le code robot en commandes et contrôleurs pour une collection de sous-systèmes spécifiques aux robots. Chaque sous-système dispose d’une boucle de contrôle indépendante ou d’une machine à état fonctionnant au taux approprié pour le mécanisme et les commandes de haut niveau qui mettent à jour les opérations souhaitées et définissent les points de consigne. Il est ainsi très facile dans le code autonome de construire des séquences synchrones de commandes. Pendant ce temps, TeleOp en tire profit, car il peut utiliser les mêmes commandes sans avoir besoin d’attendre la terminaison, permettant l’annulation facile et l’initiation de nouvelles commandes en fonction des entrées émanant de l’équipe de pilotage. Chaque sous-système dispose d’un panneau affichant ses valeurs de capteurs et de contrôle en fonction du temps, et de traçage des commandes pour faciliter le débogage.
tr_tr: Command and Control, robota özgü alt sistemlerden oluşan bir koleksiyon için robot kodunu komutlar ve denetleyiciler halinde düzenleyen 2016 sezonu için eklenen yeni bir LabVIEW şablonudur. Her bir alt sistem, mekanizma için uygun hızda çalışan bağımsız bir kontrol döngüsüne veya state machine ve istenen işlemleri ve ayar noktalarını güncelleyen yüksek seviyeli komutlara sahiptir. Bu, otonom kodun eşzamanlı komut dizileri oluşturmasını çok kolaylaştırır. Bu arada TeleOp, aynı komutları tamamlanmayı beklemeye gerek kalmadan kullanabildiği ve sürücü ekibinin girdisine göre yeni komutların kolay iptaline ve başlatılmasına izin verdiği için avantaj sağlar. Her alt sistemde, zaman içindeki sensör ve kontrol değerlerini gösteren bir panel ve hata ayıklamaya yardımcı olmak için komut izleme bulunur.
zh_cn: 命令与控制是为2016赛季添加的新LabVIEW模板，用于将机器代码植入命令和控制器以形成机器特定子系统的集合。每个子系统都有一个独立的控制循环或状态机制，以适当的速率运行，用于更新所需操作和设置节点的方法和高级命令。这使得自动代码非常容易构建命令的同步序列。同时，TeleOp的好处在于它可以重复执行相同的命令而无需等待完成，从而可以根据驱动团队的输入轻松取消或启动新命令。每个子系统都有一个面板，显示其随时间变化的传感器和控制值以及命令跟踪，以帮助调试。

source: What is Command and Control?
es_mx: ¿Qué es Command and Control?
fr_ca: Qu'entend-t-on par commande et contrôle?
tr_tr: Command ve Control nedir ?
zh_cn: 什么是指令与控制？

source: Command and Control recognizes that FRC\ |reg| robots tend to be built up of relatively independent mechanisms such as Drive, Shooter, Arm, etc. Each of these is referred to as a subsystem and needs code that will coordinate the various sensors and actuators of the subsystem in order to complete requested commands, or actions, such as "Close Gripper" or "Lower Arm". One of the key principles of this framework is that subsystems will each have an independent controller loop that is solely responsible for updating motors and other actuators. Code outside of the subsystem controller can issue commands which may change the robot’s output, but should not directly change any outputs. The difference is very subtle but this means that outputs can only possibly be updated from one location in the project. This speeds up debugging a robot behaving unexpectedly by giving you the ability to look through a list of commands sent to the subsystem rather than searching your project for where an output may have been modified. It also becomes easier to add an additional sensor, change gearing, or disable a mechanism without needing to modify code outside of the controller.
es_mx: Command and Control reconoce que los robots FRC\ |reg| tienden a estar formados por mecanismos relativamente independientes como Drive, Shooter, Arm, etc. Cada uno de estos se conoce como un subsistema y necesita un código que coordine los diversos sensores y actuadores del subsistema para completar los comandos solicitados. o acciones, como "Cerrar pinza" o "Brazo inferior". Uno de los principios clave de este marco es que los subsistemas tendrán cada uno un circuito de controlador independiente que es el único responsable de actualizar los motores y otros actuadores. El código fuera del controlador del subsistema puede emitir comandos que pueden cambiar la salida del robot, pero no deben cambiar directamente ninguna salida. La diferencia es muy sutil, pero esto significa que los resultados solo pueden actualizarse desde una ubicación en el proyecto. Esto acelera la depuración de un robot que se comporta de manera inesperada al brindarle la capacidad de revisar una lista de comandos enviados al subsistema en lugar de buscar en su proyecto donde se haya modificado una salida. También se vuelve más fácil agregar un sensor adicional, cambiar de marcha o deshabilitar un mecanismo sin necesidad de modificar el código fuera del controlador.
zh_cn: 指令与控制系统认识到FRC\ |reg|机器倾向于由相对独立的机制组成，例如Drive，Shooter，Arm等。每一个机制都称为子系统，并且需要代码来协调子系统的各种传感器和执行器以完成要求的命令或动作，例如“合拢抓手”或“放下手臂”。该框架的主要原理之一是，每个子系统将具有一个独立的控制回路，该回路仅负责更新电机和其他执行器。子系统控制器外部的代码可以发出命令，这些命令可能会更改机器的输出，但不应直接更改任何输出。两者差异非常细微，但这意味着只能从项目中的一个位置更新输出。这通过使您能够查看发送到子系统的命令列表加快了调试行为异常的机器的速度，而不是通过在项目中搜索可能已修改输出的地方。无需在控制器外部修改代码也将添加其他传感器、更改齿轮或禁用机制变得更加容易。

source: Game code, primarily consisting of Autonomous and TeleOp, will typically need to update set points and react to the state of certain mechanisms. For Autonomous, it is very common to define the robot’s operation as a sequence of operations – drive here, pick that up, carry it there, shoot it, etc. Commands can be wired sequentially with additional logic to quickly build complex routines. For teleOp, the same commands can execute asynchronously, allowing the robot to always process the latest driver inputs, and if implemented properly, new commands will interrupt, allowing the drive team to quickly respond to field conditions while also taking advantage of automated commands and command sequences.
es_mx: El código del juego, principalmente consiste en el Autónomo y Teleoperado, va a necesitar actualizar los puntos de ajuste y reaccionar al estado de ciertos mecanismos. Para el Autónomo, es muy común definir la operación del robot como una secuencia de operaciones – maneja aquí, recoge eso, llévalo allá, dispara, etc. Los comandos se pueden conectar secuencialmente con lógica adicional para construir rápido rutinas complejas. Para Teleoperado, los mismos comandos pueden operar de manera síncrona, dejando que el robot siempre procese las últimas entradas del driver, y si lo implementa apropiadamente, nuevos comandos van a interrumpir, dejando que el drive team responda rápido en las condiciones de la cancha mientras también toma ventaja de comandos automatizados y secuencias de comandos.
fr_ca: Game code, composé principalement des modes Autonome et TeleOp, devra généralement mettre à jour les points de consigne et réagir à l’état de certains mécanismes. Pour le mode Autonome, il est très courant de définir le fonctionnement du robot comme une séquence d’opérations – déplacement, ramasser, transporter là, le tirer, etc. Les commandes peuvent être agencées séquentiellement avec une logique supplémentaire pour construire rapidement des routines complexes. Pour le monde teleOp, les mêmes commandes peuvent s’exécuter de façon asynchrone, ce qui permet au robot de toujours traiter les dernières entrées du pilote, et si elle sont implémentées correctement, de nouvelles commandes s’interrompent, permettant à l’équipe de pilotage de répondre rapidement aux conditions du terrain tout en profitant des commandes automatisées et des séquences de commandes.
tr_tr: Öncelikle Otonom ve TeleOp'tan oluşan oyun kodunun tipik olarak ayar noktalarını güncellemesi ve belirli mekanizmaların durumuna tepki vermesi gerekecektir. Autonomous için, robotun çalışmasını bir dizi işlem olarak tanımlamak çok yaygındır - buraya sürün, alın, oraya taşıyın, ateş edin, vb. Komutlar, hızlı bir şekilde karmaşık rutinler oluşturmak için ek mantıkla sırayla bağlanabilir. TeleOp için, aynı komutlar eşzamansız olarak yürütülebilir, robotun her zaman en son sürücü girdilerini işlemesine izin verir ve uygun şekilde uygulanırsa yeni komutlar kesintiye uğrayarak, sürücü ekibinin saha koşullarına hızlı bir şekilde yanıt verirken aynı zamanda otomatikleştirilmiş komutlardan ve komutlardan dizilerinden yararlanmasını sağlar..
zh_cn: 游戏代码（主要由自动程序和TeleOp组成）通常需要更新节点并对某些方法的状态做出反应。对于自动程序，常见的做法是将机器的操作定义为一系列操作-前进到这里、拾取、搬运、射出等。可以将命令与附加逻辑顺序连接，以快速构建复杂的例程。对于teleOp，相同的命令可以异步执行，从而使机器始终能够处理最新的驱动程序输入，如果实施得当，新命令将中断，从而使驱动团队可以快速响应现场条件，同时还利用自动化命令和命令序列。

source: Why should I use Command and Control?
es_mx: ¿Por qué debemos usar Command and Control?
fr_ca: Pourquoi devrais-je utiliser la commande et le contrôle ?
tr_tr: Neden Commdnf and Control kullanmalıyım?
zh_cn: z为什么要使用指令和控制？

source: Command and Control adds functionality to the existing LabVIEW project templates, allowing code to scale better with more sophisticated robots and robot code. Subsystems are used to abstract the details of the implementation, and game code is built from sequences of high level command VIs. The commands themselves are VIs that can update set points, perform numerical scaling/mapping between engineering units and mechanism units, and offer synchronization options. If physical changes are made to the robot, such as changing a gearing ratio, changes can be made to just a few command Vis to reflect this change across the entire code base.
es_mx: Command and Control añade funcionalidad a las plantillas de proyecto existentes en LabVIEW, permitiendo que el código se escale mejor con robots y códigos de robot mas sofisticados. Se usan subsistemas para abstraer los detalles de la implementación, y el código de juego es creado a partir de secuencias de VIs de comando de alto nivel. Los comandos por si mismos son VIS que pueden actualizar puntos fijos, realizar mapeo/escalado numérico entre unidades de ingeniería y unidades del mecanismo y pueden ofrecer opciones de sincronización. Si se realizan cambios físicos al robot, como modificar un a relaciona de engranes, se pueden realizar los cambios a solo un poco de VIs de comando para reflejar este cambio a través de todo el código fuente.
fr_ca: **Command and Control** ajoute des fonctionnalités aux modèles de projet LabVIEW existants, permettant au code de mieux évoluer avec des robots et des code plus sophistiqués. Les sous-systèmes sont utilisés pour abstraire les détails de l’implémentation, et le code du jeu est construit à partir de séquences de commande Vi de haut niveau. Les commandes elles-mêmes sont des VIs qui peuvent mettre à jour les points de consigne, effectuer une mise à l’échelle numérique/correspondance entre les unités d’ingénierie et les unités de mécanisme et offrir des options de synchronisation. Si des modifications physiques sont apportées au robot, telles que la modification d’un rapport d’engrenage, des modifications peuvent être apportées à quelques commandes Vis pour refléter cette modification sur l’ensemble du code.
tr_tr: Command ve Control, mevcut LabVIEW proje şablonlarına işlevsellik ekleyerek kodun daha karmaşık robotlar ve robot koduyla daha iyi ölçeklenmesini sağlar. Alt sistemler, uygulamanın ayrıntılarını soyutlamak için kullanılır ve oyun kodu, yüksek seviyeli komut VI dizilerinden oluşturulur. Komutların kendileri, ayar noktalarını güncelleyebilen, mühendislik birimleri ve mekanizma birimleri arasında sayısal ölçeklendirme / haritalama gerçekleştirebilen ve senkronizasyon seçenekleri sunan VI'lardır. Robotta dişli oranının değiştirilmesi gibi fiziksel değişiklikler yapılırsa, bu değişikliği kod tabanının tamamında yansıtmak için yalnızca birkaç Vis komutunda değişiklikler yapılabilir.
zh_cn: 指令与控制功能为现有的LabVIEW项目模板增加了功能，使代码可以通过更复杂的机器和机器代码更好地扩展。子系统用于抽象实现细节，游戏代码由高级指令VI组成的序列构建而成。这些指令本身是VI，可以更新节点，在工程单位和机械单位之间执行数值缩放/映射并提供同步选项。如果对机器进行了物理更改，例如更改传动比，则可以仅对几个指令Vi进行更改，以在整个代码库中反映此更改。

source: I/O encapsulation makes for more predictable operation and quicker debugging when resource conflicts do occur. Because each command is a VI, you are able to single step through commands or use the built in Trace functionality to view a list of all commands sent to each subsystem.The framework uses asynchronous notification and consistent data propagation making it easy to program a sequence of commands or add in simple logic to determine the correct command to run.
es_mx: La encapsulación I/O ayuda a tener una operación mas predecible y una depuración mas rápida en caso de que ocurran conflictos entre los recursos. Debido a que cada comando es un VI, puede realizar un solo paso a través de los comandos o utilizar la funcionalidad Trace incorporada para ver una lista de todos los comandos enviados a cada subsistema. de comandos o agregue una lógica simple para determinar el comando correcto para ejecutar.
fr_ca: L’encapsulation des I/O permet un fonctionnement plus prévisible et un débogage plus rapide lorsque des conflits de ressources se produisent. Étant donné que chaque commande est un VI, vous pouvez passer une seule étape à travers les commandes ou utiliser la fonctionnalité intégrée *Trace* pour afficher une liste de toutes les commandes envoyées à chaque sous-système. Le cadre de développement utilise une notification asynchrone et une propagation cohérente des données, ce qui facilite le codage d’une séquence de commandes ou l’ajout d’une logique simple pour déterminer la commande adéquate à exécuter.
tr_tr: I/O kapsülleme, daha öngörülebilir işlem ve kaynak çakışmaları meydana geldiğinde daha hızlı hata ayıklama sağlar. Her bir komut bir VI olduğu için, komutlar arasında tek adım atabilir veya her bir alt sisteme gönderilen tüm komutların bir listesini görüntülemek için yerleşik Trace işlevini kullanabilirsiniz. Çerçeve, eşzamansız bildirim ve tutarlı veri yayılımı kullanır, bu da bir diziyi programlamayı kolaylaştırır çalıştırılacak doğru komutu belirlemek için basit bir mantık ekleyin.
zh_cn: 当发生资源冲突时，I / O封装可实现更可预测的操作和更快的调试。由于每个指令都是VI，因此您可以单步执行命令，也可以使用内置的Trace功能查看发送给每个子系统的所有命令的列表。该框架使用异步通知和一致的数据传播，可以轻松地对序列进行编程命令或添加简单的逻辑以确定要运行的正确指令。

source: Part 1: Project Explorer
es_mx: Parte 1: Explorador de proyectos
fr_ca: Partie 1 : Explorateur de projet
tr_tr: Part 1: Proje Gezgini
zh_cn: 第1部分：项目资源管理器

source: The Project Explorer provides organization for all of the Vis and files you will use for your robot system. Below is a description of the major components in the Project Explorer to help with the expansion of our system. The most frequently used items have been marked in bold.
es_mx: El Explorador de proyectos proporciona organización para todos los Vis y archivos que usted usará para su sistema de robot. A continuación se muestra una descripción de los componentes principales del Explorador de proyectos para ayudar con la expansión de nuestro sistema. Los elementos utilizados con más frecuencia se han marcado en negrita.
fr_ca: L’Explorateur de projets fournit une organisation pour tous les Vis et les fichiers que vous utiliserez pour votre système robot. Vous trouverez ci-dessous une description des principaux composants de l’Explorateur de projets pour aider à l’expansion de votre système. Les éléments les plus fréquemment utilisés ont été marqués en gras.
tr_tr: Proje Gezgini, robot sisteminiz için kullanacağınız tüm Vis ve dosyalar için organizasyon sağlar. Aşağıda, sistemimizin genişletilmesine yardımcı olmak için Proje Gezgini'ndeki ana bileşenlerin bir açıklaması bulunmaktadır. En sık kullanılan öğeler kalın olarak işaretlenmiştir.
zh_cn: 项目资源管理器将用于为机器系统的所有Vi和文件提供组织。以下是项目资源管理器中有助于扩展系统的主要组件的说明。最常用的项目以粗体标出。

source: My Computer
es_mx: Mi computadora
fr_ca: Mon ordinateur
zh_cn: 我的电脑

source: The items that define operation on the computer that the project was loaded on. For a robot project, this is used as a simulation target and is populated with simulation files.
es_mx: Los elementos que definen la operación en la computadora en la que se cargó el proyecto. Para un proyecto de robot, esto se utiliza como un objetivo de simulación y se completa con archivos de simulación.
fr_ca: Les éléments qui définissent l’opération sur l’ordinateur sur lequel le projet a été chargé. Pour un projet de robot, il est utilisé comme cible de simulation et est rempli de fichiers de simulation.
tr_tr: Projenin yüklendiği bilgisayardaki işlemi tanımlayan öğeler. Bir robot projesi için, bu bir simülasyon hedefi olarak kullanılır ve simülasyon dosyalarıyla doldurulur.
zh_cn: 定义在项目被加载到的计算机上的操作的项目。对于机器项目，将其用作模拟目标并填充模拟文件。

source: Sim Support Files
es_mx: Archivos de soporte de Sim
fr_ca: Fichiers de support Sim
tr_tr: Sim Destek Dosyaları
zh_cn: Sim支持文件

source: The folder containing 3D CAD models and description files for the simulated robot.
es_mx: La carpeta que contiene modelos CAD en 3D y archivos de descripción del robot simulado.
fr_ca: Le dossier contenant des modèles CAO 3D et des fichiers de description pour le robot simulé.
tr_tr: Simüle robot için 3D CAD modelleri ve açıklama dosyalarını içeren klasör.
zh_cn: 该文件夹包含3D CAD模型和模拟机器的描述文件。

source: Robot Simulation Readme.html
es_mx: Simulación del robot Readme.html
fr_ca: Simulation de robot Readme.html
zh_cn: 机器人仿真文档.html

source: Documents the PWM channels and robot info you will need in order to write robot code that matches the wiring of the simulated robot.
es_mx: Documente los canales PWM y la información del robot que necesitará para escribir un código de robot que coincida con el cableado del robot simulado.
fr_ca: Documente les canaux PWM et les informations relatives au robot dont vous aurez besoin pour écrire le code robot qui correspond au câblage du robot simulé.
tr_tr: Simüle edilmiş robotun kablolamasına uyan robot kodunu yazmak için ihtiyacınız olacak PWM kanallarını ve robot bilgilerini belgeler.
zh_cn: 记录您需要的PWM通道和机器信息，以便编写与模拟机器的接线匹配的机器代码。

source: Dependencies
es_mx: Posesiones
fr_ca: Dépendances
tr_tr: Dependencies-Bağımlılıklar
zh_cn: 依赖

source: Shows the files used by the simulated robot’s code. This will populate when you designate the code for the simulated robot target.
es_mx: Muestra los archivos usados en la simulación del código del robot. Esto se completará cuando designe el código para el objetivo del robot simulado.
fr_ca: Expose les fichiers utilisés par le code du robot simulé; se remplira lorsque vous concevez le code de la cible du robot simulé.
tr_tr: Simüle edilmiş robotun kodu tarafından kullanılan dosyaları gösterir. Simüle edilmiş robot hedefi için kod belirlediğinizde bu doldurulacaktır.
zh_cn: 显示模拟机器代码使用的文件。

source: Build Specifications
es_mx: Especificaciones de construcción
tr_tr: Derleme Özellikleri
zh_cn: 构造规范

source: This will contain the files that define how to build and deploy code for the simulated robot target.
es_mx: Esto contendrá los archivos que definen cómo construir y desplegar el código para el objetivo de robot simulado.
fr_ca: Cela contiendra les fichiers qui spécifient comment compiler et déployer du code pour le robot simulé cible .
tr_tr: Bu, simüle edilmiş robot hedefi için kodun nasıl oluşturulacağını ve dağıtılacağını tanımlayan dosyaları içerecektir.
zh_cn: 这将包含有关定义如何为模拟机器目标构建并部署代码的文件。

source: Target (roboRIO-TEAM-FRC.local)
es_mx: Objetivo (roboRIO-TEAM-FRC.local)
fr_ca: Cible (roborio-TEAM-FRC.local)
zh_cn: 目标 (roboRIO-TEAM-FRC.local)

source: The items that define operation on the roboRIO located at (address).
es_mx: Los elementos que definen la operación en el roboRIO ubicado en (dirección).
fr_ca: Les éléments qui définissent l’opération sur le roboRIO situé à (adresse).
tr_tr: (Adres) konumunda bulunan roboRIO'da operasyonu tanımlayan öğeler.
zh_cn: 定义roboRIO上位于（地址）上的操作与项目。

source: Drive
es_mx: Unidad
fr_ca: Lecteur
tr_tr: Drive - Sürüş

source: The subsystem implementation and commands for the robot drive base. This serves as a custom replacement for the WPILib RobotDrive VIs.
es_mx: La implementación del subsistema y los comandos para la base de accionamiento del robot. Esto sirve como un reemplazo personalizado para los VIs de WPILib RobotDrive.
fr_ca: L’implémentation du sous-système et les commandes de la base pilotable du robot. Elle sert une alternative personnalisée aux RobotDrive VIs de la WPILib .
tr_tr: Robot sürücü tabanı için alt sistem uygulaması ve komutları. Bu, WPILib RobotDrive VI'lar için özel bir yedek görevi görür.
zh_cn: 机器驱动基础的子系统执行和命令。这可以自行替代WPILib RobotDrive VI。

source: Framework
es_mx: Marco de trabajo
fr_ca: Environnement de développement
tr_tr: Framework-Çerçeve
zh_cn: 框架

source: VIs used for robot code that is not part of a subsystem that are not used very often.
es_mx: VI utilizados para código de robot que no forma parte de un subsistema que no se utilizan con mucha frecuencia.
fr_ca: Les Vis utilisés pour le code robot qui ne fait pas partie d’un sous-système et qui ne sont pas très souvent utilisés.
tr_tr: Çok sık kullanılmayan bir alt sistemin parçası olmayan robot kodu için kullanılan VI'lar.
zh_cn: 用于不属于子系统的机器代码的VI很少被使用。

source: Begin
es_mx: Comienzo
zh_cn: 开始

source: Called once when robot code first starts. This is useful for initialization code that doesn’t belong to a particular subsystem.
es_mx: Se manda a llamar una vez cuando el código del robot comienza. Esto es útil para códigos de iniciación que no pertenecen a un subsistema en particular.
fr_ca: Appelé une fois quand le code robot démarre pour la première fois. Ceci est utile pour le code d’initialisation qui n’appartient pas à un sous-système en particulier.
tr_tr: Robot kodu ilk başladığında bir kez çağrılır. Bu, belirli bir alt sisteme ait olmayan başlatma kodu için kullanışlıdır.
zh_cn: 机器代码首次启动时调用一次。这对于不属于特定子系统的初始化代码很有用。

source: Disabled
es_mx: Deshabilitado
zh_cn: 禁用
