Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/creating-robot-programs/command-and-control-tutorial.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Gets the desired left and right speeds for the motors and will set the motors immediately to those set points.
es_mx: Consigue las velocidades izquierda y derecha deseadas para los motores y ajustará los motores inmediatamente a esos puntos de ajuste.
fr_ca: Obtient les vitesses souhaitées à gauche et à droite pour les moteurs et configurera ces moteurs immédiatement à ces points de consigne.
tr_tr: Motorlar için istenen sol ve sağ hızları alır ve motorları hemen bu ayar noktalarına ayarlar.
zh_cn: 获得所需的电动机左右速度，并将电动机立即设置为这些设定点。

source: The Immediate case updates the motors to the set point defined by the command. The command is not considered finished since you want the motors to maintain this value until a new command comes in or until a timeout value. The timeout is useful anytime a command includes a dead band. Small values will not be requested if smaller than the dead band, and will result in growling or creeping unless the command times out.
es_mx: El caso inmediato actualiza los motores al punto de ajuste definido por el comando. El comando no se considera terminado ya que se quiere que los motores mantengan este valor hasta que llegue un nuevo comando o hasta un valor de tiempo de espera. El tiempo de espera es útil siempre que un comando incluye una banda muerta. No se solicitarán valores pequeños si son menores que la banda muerta, y resultarán en gruñidos o arrastramientos a menos que el comando se agote.
fr_ca: La condition *Immediate* met à jour les moteurs au point de consigne défini par la commande. La commande n’est pas considérée comme terminée puisque vous souhaitez que les moteurs conservent cette valeur jusqu’à ce qu’une nouvelle commande entre ou jusqu’à ce qu’un délai d’expiration soit atteint. Le délai d’attente est utile è chaque fois qu’une commande comprend une *zone morte*. De petites valeurs ne seront pas demandées si elles sont plus petites que la zone morte, et entraîneront un grongnement ou un fluage à moins que la commande ne temporise.
tr_tr: Immediate durumu, motorları komutla tanımlanan ayar noktasına günceller. Yeni bir komut gelene kadar veya bir zaman aşımı değerine kadar motorların bu değeri korumasını istediğiniz için komut bitmiş sayılmaz. Zaman aşımı, bir komutun ölü bant içerdiği her zaman yararlıdır. Ölü banttan daha küçükse küçük değerler istenmez ve komut zaman aşımına uğramadıkça hırıltı veya sürünmeye neden olur.
zh_cn: 立即将电动机情况更新到指令定义的设定点。该指令未完成，因为您希望电动机在输入新指令或超时值之前保持该值。每当指令包含死区时，超时都是有用的。如果该值小于死区，则不会请求较小的值，且将导致咆哮或爬行除非指令超时。

source: Stop Driving.vi
es_mx: Stop Driving.vl

source: Zero the drive motors, making the robot stationary.
es_mx: Detiene los motores, haciendo que el robot permanezca estacionario.
fr_ca: met les moteurs d’entraînement à zéro, ce qui immobilise le robot.
tr_tr: Robotu sabit hale getirerek tahrik motorlarını sıfırlayın.
zh_cn: 将驱动马达调零，使机器静止。

source: The Reserve command turns off the motors and waits for a new command. When used with a named command sequence, reserve identifies that the drive subsystem is part of a sequence, even if not currently moving the robot. This helps to arbitrate subsystem resource between simultaneously running commands.
es_mx: El comando de reserva apaga los motores y espera un nuevo comando. Cuando se utiliza con una secuencia de comandos con nombre, reserva identifica que el subsistema de accionamiento forma parte de una secuencia, incluso si no está moviendo el robot en ese momento. Esto ayuda a arbitrar el recurso del subsistema entre los comandos que se ejecutan simultáneamente.
fr_ca: La commande Reserve éteint les moteurs et attend une nouvelle commande. Lorsqu’elle est utilisée avec une séquence de commande nommée, Reserve identifie que le sous-système de déplacement fait partie de cette séquence, même si elle n’est pas en train de déplacer le robot. Cela permet d’arbitrer la ressource sous-système entre les commandes simultanément en cours d’exécution.
tr_tr: Reserve komutu motorları kapatır ve yeni bir komut bekler. Reserve, adlandırılmış bir komut dizisi ile kullanıldığında, robotu hareket ettirmiyor olsa bile sürücü alt sisteminin bir dizinin parçası olduğunu tanımlar. Bu, aynı anda çalışan komutlar arasında alt sistem kaynağında arabuluculuk yapmaya yardımcı olur.
zh_cn: 预定命令关闭电动机，并等待新指令。当与命名指令序列一起使用时，即使当前未移动机械臂，预定指令也标识驱动子系统是序列的一部分。这有助于在同时运行的指令之间仲裁子系统资源。

source: Part 4: Creating New Commands
es_mx: Parte 4: Creando Comandos Nuevos
fr_ca: Partie 4 : Création de nouvelles commandes
tr_tr: Part 4: Yeni Komutlar Yaratmak
zh_cn: 第4部分：创建新命令

source: The Command and Control framework allows users to easily create new commands for a subsystem. To Create a new command open the subsystem folder/Commands In the project explorer window, choose one of the VI Templates to use as the starting point of your new command, right click, and select New From Template.
es_mx: El comando y el Control framework permite a los usuarios crear fácilmente nuevos comandos para un subsistema. Para crear un nuevo comando abra la carpeta del subsistema/Comandos en la ventana del explorador de proyectos, seleccione una de las plantillas de VI para usar como partida inicial de su nuevo comando, clic derecho, y seleccione Nuevo Desde Plantilla.
fr_ca: Le cadre de développement *Command and Control* permet aux utilisateurs de créer facilement de nouvelles commandes pour un sous-système. Pour créer une nouvelle commande ouvrez le dossier sous-système/Commands dans la fenêtre explorateur de projet, choisissez l’un des VI Templates à utiliser comme point de départ de votre nouvelle commande, cliquez avec le bouton droit et sélectionnez New From Template.
tr_tr: Komut ve Kontrol çerçevesi, kullanıcıların bir alt sistem için kolayca yeni komutlar oluşturmasına olanak tanır. Yeni bir komut oluşturmak için alt sistem klasörünü açın / Commands project explorer penceresinde, yeni komutunuzun başlangıç noktası olarak kullanmak için VI Şablonlarından birini seçin, sağ tıklayın ve New From Template öğesini seçin.
zh_cn: 指令和控制框架使用户可以轻松地为子系统创建新指令。要创建新指令，请打开子系统文件夹/命令，在项目浏览器窗口中，选择一个VI模板作为新指令的起点，右键单击并选择“从模板新建”。

source: **Immediate**: This VI notifies the subsystem about the new setpoint.
es_mx: **Inmediato**: Este VI notifica al subsistema sobre el nuevo punto de ajuste.
fr_ca: **Immediate**: Ce VI informe le sous-système d'un nouveau point de consigne.
tr_tr: **Immediate-Hemen**: Bu VI, alt sistemi yeni ayar noktası hakkında bilgilendirir.
zh_cn: **瞬时**: 该VI将新的设定值通知子系统。

source: **Immediate with deadband**: This VI compares the input value to the deadband and optionally notifies the subsystem about the new setpoint. This is very useful when joystick continuous values are being used.
es_mx: **Inmediatamente con la banda muerta**: Este VI compara el valor de entrada con la banda muerta y opcionalmente notifica al subsistema sobre el nuevo punto de ajuste. Esto es muy útil cuando se utilizan valores continuos de joystick.
fr_ca: **Immediate with deadband**: Ce VI compare la valeur d’entrée de la zone morte et informe éventuellement le sous-système du nouveau point de consigne. Ceci est très utile lorsque des valeurs continues joystick sont utilisées.
tr_tr: **Immediate with deadband** : Bu VI, giriş değerini ölü bantla karşılaştırır ve isteğe bağlı olarak alt sistemi yeni ayar noktası hakkında bilgilendirir. Bu, joystick devamlı değerleri kullanıldığında çok kullanışlıdır.
zh_cn: **带有死区的瞬时**: 该VI将输入值与死区进行比较，并有选择地将新的设定值通知子系统。当使用操纵杆连续值时，这非常有用。

source: **With duration**: This VI notifies the subsystem to perform this command for the given duration, and then return to the default state. Synchronization determines whether this VI Starts the operation and returns immediately, or waits for the operation to complete. The first option is commonly used for TeleOp, and the second for Autonomous sequencing.
es_mx: **Con la duración**: Este VI notifica al subsistema para que realice este comando durante la duración dada, y luego volver al estado por defecto. La sincronización determina si este VI inicia la operación y regresa inmediatamente, o espera a que la operación se complete. La primera opción se usa comúnmente para TeleOp, y la segunda para Secuenciación Autónoma.
fr_ca: **With duration**: Ce VI informe le sous-système d’exécuter cette commande pendant la durée donnée, puis de revenir à l’état par défaut. La synchronisation détermine si ce VI démarre l’opération et retourne immédiatement ou attend que l’opération se termine. La première option est couramment utilisée pour le mode TeleOp, et la seconde pour des séquences en mode autonome.
tr_tr: **With duration** : Bu VI, alt sistemi verilen süre boyunca bu komutu yerine getirmesi ve ardından varsayılan duruma geri dönmesi için bilgilendirir. Senkronizasyon, bu VI'nın işlemi başlatıp başlatmayacağını ve hemen geri dönüp dönmeyeceğini veya işlemin tamamlanmasını bekleyip beklemeyeceğini belirler. İlk seçenek genellikle TeleOp için ve ikincisi Otonom dizileme için kullanılır.
zh_cn: **持续时间**：该VI通知子系统在给定的持续时间内执行该命令，然后返回默认状态。同步决定该VI是启动该操作并立即返回，还是等待该操作完成。第一个选项通常用于TeleOp，第二个选项用于自动排序。

source: In this example we will add the new command "Drive for Distance".
es_mx: En este ejemplo, agregaremos el nuevo comando "Conducir por distancia".
zh_cn: 在此示例中，我们将添加新指令“ Drive for Distance”。

source: First, save the new VI with a descriptive name such as "Drive for Distance". Next, determine whether the new command needs a new value added the Drive Operations enum typedef. The initial project code already has an enum value of Drive for Distance, but the following image shows how you would add one if needed.
es_mx: Primero, guarde el nuevo VI con un nombre descriptivo como "Drive for Distance". A continuación, determine si el nuevo comando necesita un nuevo valor agregado en Drive Operations enum typedef. El código del proyecto inicial ya tiene un valor de enumeración de Drive for Distance, pero la siguiente imagen muestra cómo agregaría uno si fuera necesario.
zh_cn: 首先，使用诸如“ Drive for Distance”之类的描述性名称保存新的VI。接下来，确定新指令是否需要添加驱动器操作枚举typedef的新值。初始项目代码已经具有枚举Drive for Distance，但是下图显示了如何在需要时添加一个。

source: If a command needs additional information to execute, add it to the setpoints control. By default, the Drive subsystem has fields for the Left Setpoint, Right Setpoint, and Duration along with the operation to be executed. The Drive for Distance command could reuse Duration as distance, but let’s go ahead and add a numeric control to the Drive Setpoints.ctl called Distance (feet).
es_mx: Si un comando necesita información adicional para ejecutarse, añádalo al control de puntos de ajuste. Por defecto, el subsistema Drive tiene campos para el Left Setpoint, Right Setpoint y Duration junto con la operación que se va a ejecutar. El comando Drive for Distance podría reutilizar la duración como distancia, pero sigamos adelante y agreguemos un control numérico a Drive Setpoints.ctl llamdo Distance (pies).
fr_ca: Si une commande a besoin d’informations supplémentaires pour les exécuter, ajoutez-les au contrôle des points de consigne. Par défaut, le sous-système de déplacement comporte des champs pour le point de consigne gauche, le point de consigne droit et la durée ainsi que l’opération à exécuter. La commande *Drive for Distance* peut réutiliser *Duration* en tant que distance, mais ajoutons un contrôle numérique au Drive Setpoints.ctl appelé Distance (pieds).
tr_tr: Bir komutun yürütülmesi için ek bilgiye ihtiyaç duyarsa, bunu ayar setpoint kontrolüne ekleyin. Varsayılan olarak, Sürücü alt sistemi, yürütülecek işlemle birlikte Sol Ayar Noktası-Setpoint, Sağ Ayar Noktası-Setpoint ve Duration-süre için alanlara sahiptir. Drive for Distance komutu, Süreyi-Duration mesafe olarak yeniden kullanabilirdi, ancak devam edelim ve Drive Setpoints.ctl'ye Distance (feet) adı verilen sayısal bir kontrol ekleyelim.
zh_cn: 如果指令需要其他信息才能执行，请将其添加到设定控件中。驱动器子系统具有“左设定点”，“右设定点”和“持续时间”字样以及要执行的操作。默认情况下， “行驶距离”指令可以将“持续时间”重新用作距离，但让我们继续向“行驶距离”设置一个数字控件，称为“距离（英尺）”。

source: Once that we have all of the fields needed to specify our command, we can modify the newly created Drive for Distance.vi. As shown below, select Drive for Distance from the enum’s drop down menu and add a VI parameters to specify distance, speeds, etc. If the units do not match, the command VI is a great place to map between units.
es_mx: Una vez que tenemos todos los campos necesarios para especificar nuestro comando, podemos modificar el recién creado Drive for Distance.vi. Como se muestra a continuación, seleccione Drive for Distance en el menú desplegable del enum y añada un parámetro VI para especificar la distancia, las velocidades, etc. Si las unidades no coinciden, el comando VI es un gran lugar para mapear entre unidades.
fr_ca: Une fois que nous avons tous les champs nécessaires pour spécifier notre commande, nous pouvons modifier *Drive for Distance.vi*, nouvellement créé. Comme indiqué ci-dessous, sélectionnez *Drive for Distance* à partir du menu déroulant de l'enum’s et ajouter les paramètres au VI pour spécifier la distance, les vitesses, etc. Si les unités ne correspondent pas, la commande VI est un excellent endroit pour effectuer la correspondance entre les unités.
tr_tr: Bundan sonra, komutumuzu belirtmek için gereken tüm alanlara sahip olduğumuzda, yeni oluşturulan Drive for Distance.vi ı değiştirebiliriz. Aşağıda gösterildiği gibi, enum açılır menüsünden Drive for Distance öğesini seçin ve mesafeyi, hızları vb. belirtmek için bir VI parametresi ekleyin. Birimler uyuşmuyorsa, VI komutu birimler arasında haritalamak için harika bir yerdir.
zh_cn: 一旦有了指定指令所需的所有字段，便可以修改新创建的Drive for Distance.vi。如下所示，从枚举的下拉菜单中选择“Drive for Distance”，并添加VI参数以指定距离，速度等。如果单位不匹配，则指令VI是在单位之间进行映射的好方法。

source: Next, add code to the Drive Controller to define what happens when the Drive for Distance command executes. Right click on the Case Structure and Duplicate or Add Case for Every Value. This will create a new "Drive for Distance" case.
es_mx: A continuación, agregue código al controlador de unidad para definir qué sucede cuando se ejecuta el comando de unidad para distancia. Haga clic derecho en la estructura del caso y duplique o agregue caso para cada valor. Esto creará un nuevo caso "Drive for Distance".
zh_cn: 接下来，将代码添加到“驱动器控制器”中，以定义执行“Drive for Distance”指令时发生的情况。右键单击案例结构，然后为每个值复制或添加案例。这将创建一个新的“ Drive for Distance”案例。

source: In order to access new setpoint fields, grow the "Access Cmd setpoints" unbundle node. Open your encoder(s) on the outside, to the left of the loop. In the new diagram of the case structure, we added a call to reset the encoder on the first loop iteration and read it otherwise. There is also some simple code that compares encoder values and updates the motor power. If new controls are added to the setpoints cluster, you should also consider adding them to the Trace. The necessary changes are shown in the image below.
es_mx: Para acceder a nuevos campos de puntos de ajuste, haga crecer el nodo de deshacer "Puntos de ajuste de Cmd de acceso". Abra su codificador (o codificadores) en el exterior, a la izquierda del bucle. En el nuevo diagrama de la estructura del caso, agregamos una llamada para restablecer el codificador en la primera iteración del bucle y leerlo de otra manera. También hay un código simple que compara los valores del codificador y actualiza la potencia del motor. Si se agregan nuevos controles al grupo de puntos de ajuste, también debe considerar agregarlos al Trace. Los cambios necesarios se muestran en la imagen a continuación.
zh_cn: 为了访问新的设置点字段，请为“Access Cmd设置点”取消捆绑。在循环左侧的外部打开编码器。在新的案例结构图中，我们添加了一个调用以在第一次循环迭代时重置编码器，否则将其读取。还有一些简单的代码可以比较编码器值并更新电动机功率。如果将新控件添加到设定点集合中，则还应考虑将它们添加到跟踪中。下图显示了必要的更改。

source: Part 5: Creating a Subsystem
es_mx: Parte 5: Creando un Subsistema
fr_ca: Partie 5 : Création d’un sous-système
tr_tr: Bölüm 5: Bir Alt Sistem Oluşturma
zh_cn: 第5部分：创建子系统

source: In order to create a new subsystem, right click on the roboRIO target and select New» Subsystem. In the pop up dialog box, enter the name of the subsystem, list the operational modes, and specify the color of the icon.
es_mx: Para crear un nuevo subsistema, haga clic con el botón derecho del ratón en el objetivo de roboRIO y seleccione New» Subsystem. En el cuadro de diálogo emergente, introduzca el nombre del subsistema, enumere los modos de funcionamiento y especifique el color del icono.
fr_ca: Afin de créer un nouveau sous-système, cliquez avec le bouton droit sur la cible roboRIO et sélectionnez New» Subsystem. Dans la boîte de dialogue contextuel, entrez le nom du sous-système, répertoriez les modes d'opération et spécifiez la couleur de l’icône.
tr_tr: Yeni bir alt sistem oluşturmak için roboRIO hedefine sağ tıklayın ve New» Subsystem Sistem öğesini seçin. Açılan iletişim kutusunda, alt sistemin adını girin, işletim modlarını listeleyin ve simgenin rengini belirtin.
zh_cn: 为了创建一个新的子系统，右键单击roboRIO目标并选择New»Subsystem。在弹出的对话框中，输入子系统的名称，列出操作模式，并指定图标的颜色。

source: When you click OK, the subsystem folder will be generated and added to the project disk folder and tree. It will contain a base implementation of the VIs and controls that make up a subsystem. A call to the new controller will be inserted into the Subsystems VI. The controller VI will open, ready for you to add I/O and implement state machine or control code. Generated VI icons will use the color and name provided in the dialog. The generated code will use typedefs for set point fields and operations.
es_mx: Cuando haga clic en OK, la carpeta del subsistema se generará y se añadirá a la carpeta y al árbol del disco del proyecto. Contendrá una implementación base de los VIs y controles que componen un subsistema. Una llamada al nuevo controlador se insertará en los VI de los subsistemas. El controlador VI se abrirá, listo para que usted añada I/O e implemente el código de estado de la máquina o del control. Los iconos de los VI generados utilizarán el color y el nombre proporcionados en el diálogo. El código generado usará typedefs para los campos de puntos de ajuste y operaciones.
fr_ca: Lorsque vous cliquez sur OK, le dossier du sous-système sera généré et ajouté au dossier et à l’arborescence du disque de projet. Il contiendra une implémentation de base des VIS et des contrôles qui constituent un sous-système. Un appel au nouveau contrôle sera inséré dans les sous-systèmes VI. Le contrôle VI s’ouvrira, prêt pour que vous ajoutiez des E/S et à implémenter une machine d’état ou un code de contrôle. Les icônes VI générées utilisent la couleur et le nom fournis dans la boîte de dialogue. Le code généré utilise des typedefs pour définir des champs et des points de consigne et des opérations.
tr_tr: OK'e tıkladığınızda, alt sistem klasörü oluşturulacak ve proje disk klasörüne ve ağacına eklenecektir. Bir alt sistemi oluşturan VI'ların ve kontrollerin temel bir uygulamasını içerecektir. Yeni denetleyiciye bir çağrı, Alt Sistemler VI'ya eklenecektir. Controller VI açılacak, I/O eklemeniz ve state-machine veya kontrol kodunu uygulamanız için hazır olacaktır. Oluşturulan VI simgeleri, iletişim kutusunda sağlanan rengi ve adı kullanacaktır. Oluşturulan kod, ayar noktası alanları ve işlemleri için typedef'leri kullanacaktır.
zh_cn: 单击确定时，将生成子系统文件夹并将其添加到项目磁盘文件夹和项目树中。它将包含构成子系统的VI和控件的基本执行操作。对新控制器的调用将插入子系统VI。控制器VI将打开，准备添加I / O并实现状态机或控制代码。生成的VI图标将使用对话框中提供的颜色和名称。生成的代码将typedef用于设置点字样和操作。

source: Below is the block diagram of the newly created subsystem. This code will be generated automatically when you create the subsystem.
es_mx: A continuación se muestra el diagrama de bloques del subsistema recién creado. Este código se generará automáticamente cuando se cree el subsistema.
fr_ca: Vous trouverez ci-dessous le diagramme bloc du sous-système nouvellement créé. Ce code est généré automatiquement lorsque vous créez le sous-système.
tr_tr: Aşağıda yeni oluşturulan alt sistemin blok şeması bulunmaktadır. Bu kod, alt sistemi oluşturduğunuzda otomatik olarak üretilecektir.
zh_cn: 下面是新创建的子系统的程序框图。创建子系统时，将自动生成此代码。

source: Command and Control recognizes that FRC\ |reg| robots tend to be built up of relatively independent mechanisms such as Drive, Shooter, Arm, etc. Each of these is referred to as a subsystem and needs code that will coordinate the various sensors and actuators of the subsystem in order to complete requested commands, or actions, such as “Close Gripper” or “Lower Arm”. One of the key principles of this framework is that subsystems will each have an independent controller loop that is solely responsible for updating motors and other actuators. Code outside of the subsystem controller can issue commands which may change the robot’s output, but should not directly change any outputs. The difference is very subtle but this means that outputs can only possibly be updated from one location in the project. This speeds up debugging a robot behaving unexpectedly by giving you the ability to look through a list of commands sent to the subsystem rather than searching your project for where an output may have been modified. It also becomes easier to add an additional sensor, change gearing, or disable a mechanism without needing to modify code outside of the controller.
fr_ca: Command and Control reconnaît que les robots FRC\ |reg| ont tendance à être construits de mécanismes relativement indépendants tels que Drive, Shooter, Arm, etc. Chacun d’eux est appelé sous-système et a besoin de code qui coordonnera les différents capteurs et actionneurs du sous-système afin de compléter les commandes demandées, ou des actions, telles que “Close Gripper” ou “Lower Arm”. L’un des principes clés de ce cadre est que les sous-systèmes auront chacun une boucle de contrôleur indépendante qui est uniquement responsable de la mise à jour des moteurs et autres actionneurs. Le code en dehors du contrôleur de sous-système peut émettre des commandes qui peuvent modifier la sortie du robot, mais ne doivent pas modifier directement les sorties. La différence est très subtile, mais cela signifie que les sorties ne peuvent être mises à jour qu’à partir d’un seul emplacement du projet. Cela accélère le débogage d’un robot se comportant de façon inattendue en vous donnant la possibilité de regarder à travers une liste de commandes envoyées au sous-système plutôt que de rechercher votre projet pour dénicher l’endroit où une sortie peut avoir été modifiée. Il devient également plus facile d’ajouter un capteur supplémentaire, de changer d’engrenage ou de désactiver un mécanisme sans avoir besoin de modifier le code à l’extérieur du contrôleur.

source: In this example we will add the new command “Drive for Distance”.
fr_ca: Dans cet exemple, nous allons ajouter la nouvelle commande “Drive for Distance”.

source: First, save the new VI with a descriptive name such as “Drive for Distance”. Next, determine whether the new command needs a new value added the Drive Operations enum typedef. The initial project code already has an enum value of Drive for Distance, but the following image shows how you would add one if needed.
fr_ca: Premièrement, enregistrez le nouveau VI avec un nom descriptif tel que “Drive for Distance”. Ensuite, déterminez si la nouvelle commande a besoin d’une nouvelle valeur ajoutée à *enum typedef* des *Drive Operations*. Le code de projet initial a déjà une valeur enum de Drive for Distance, mais l’image suivante montre comment vous en ajouteriez une si nécessaire.
