Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/creating-robot-programs/creating-building-and-loading-your-benchtop-test-program.po
Languages: es_mx, tr_tr, zh_cn

source: Creating, Building and Loading your Benchtop Test Program
es_mx: Creando, Construyendo y Cargando su Programa de Pruebas en Escritorio
tr_tr: Benchtop Test Programınızı Oluşturma-create, derleme-build ve yükleme
zh_cn: 创建，构建和加载机器测试程序

source: This document covers how to create, build and load an FRC LabVIEW program onto a roboRIO. Before beginning, make sure that you have installed LabVIEW for FRC and the FRC Driver Station and that you have configured and imaged your roboRIO as described in the :ref:`Getting Started with the Control System section <docs/getting-started/getting-started-frc-control-system/index:Getting Started>`.
es_mx: Este documento muestra cómo crear, construir y cargar un programa FRC de LabVIEW en una roboRIO. Antes de comenzar, asegúrese de que ha instalado LabVIEW para FRC y la Driver Station de FRC y que ha configurado e imaginado su roboRIO como se describe en la sección :ref:`Getting Started with the Control System section <docs/getting-started/getting-started-frc-control-system/index:Getting Started>`.

source: Creating a Project
es_mx: Creando un Proyecto
tr_tr: Proje yaratmak
zh_cn: 创建一个项目

source: Launch LabVIEW and click the FRC roboRIO Robot Project link in the Projects window to display the Create New FRC Robot Project dialog box.
es_mx: Ejecute LabVIEW y haga clic en el link del Proyecto de Robot de la roboRIO en la ventana Proyectos para mostrar el cuadro de diálogo Create New FRC Robot Project.
tr_tr: LabVIEW'i başlatın ve Create New FRC Robot Project iletişim kutusunu görüntülemek için Projeler penceresindeki FRC roboRIO Robot Project bağlantısını tıklayın.
zh_cn: 启动LabVIEW，然后在“项目”窗口中单击FRC roboRIO机器项目链接，以显示“创建新的FRC机器项目”对话框。

source: Configuring Project
es_mx: Configurar el Proyecto
tr_tr: Projeyi yapılandırma
zh_cn: 配置项目

source: Fill in the Create New FRC Project Dialog:
es_mx: Rellene el cuadro de diálogo Create New FRC Project Dialog:
tr_tr: Create New FRC Project iletişim kutusunu doldurun:
zh_cn: 填写“创建新的FRC项目”对话框：

source: Pick a name for your project
es_mx: Elija un nombre para su proyecto
tr_tr: Projeniz için bir isim seçin
zh_cn: 为您的项目选择一个名称

source: Select a folder to place the project in.
es_mx: Seleccione una carpeta para poner el proyecto
tr_tr: Projeyi saklamak için bir klasör seçin
zh_cn: 选择一个文件夹以放置项目。

source: Enter your team number
es_mx: Introduzca el número de su equipo
tr_tr: Takım numaranızı girin
zh_cn: 输入您的团队编号

source: Select a project type. If unsure, select Arcade Drive - roboRIO.
es_mx: Seleccione el tipo de proyecto, seleccione Arcade Drive - roboRIO.
tr_tr: Bir proje türü seçin. Eğer emin değilseniz Arcade Drive - roboRIO seçin.
zh_cn: 选择一个项目类型。如果不确定，请选择Arcade Drive-roboRIO。

source: Click Finish
es_mx: Dele clic en Finalizar
tr_tr: Finish'e tıklayın
zh_cn: 点击完成

source: Running the Program
es_mx: Ejecute el Programa
tr_tr: Programı çalıştırmak
zh_cn: 运行程序

source: Note that a program deployed in this manner will not remain on the roboRIO after a power cycle. To deploy a program to run every time the roboRIO starts follow the next step, Deploying the program.
es_mx: Tengan en cuenta que un programa desplegado de esta manera no permanecerá en el roboRIO después de un ciclo de energía. Para desplegar un programa para que se ejecute cada vez que el roboRIO se inicie, siga el siguiente paso, Deploying the program.
tr_tr: Bu şekilde dağıtılan bir program, bir güç döngüsünden sonra roboRIO'da kalmayacaktır. Bir programı roboRIO her başladığında çalışacak şekilde dağıtmak için bir sonraki adım olan Programı Dağıtma'yı izleyin.
zh_cn: 请注意，以这种方式部署的程序在重启后将不会保留在roboRIO上。要部署在roboRIO每次启动时都运行的程序，请执行下一步：部署程序。

source: In the Project Explorer window, double-click the Robot Main.vi item to open the Robot Main VI.
es_mx: En la ventana del Explorador del Proyecto, haga doble clic en Robot Main.vi para abrir el Robot Main VI.
tr_tr: Project Explorer penceresinde, Robot Main.vi'yı açmak için Robot Main.vi öğesine çift tıklayın.
zh_cn: 在项目浏览器窗口中，双击Robot Main.vi项目以打开Robot Main VI。

source: Click the Run button (White Arrow on the top ribbon) of the Robot Main VI to deploy the VI to the roboRIO. LabVIEW deploys the VI, all items required by the VI, and the target settings to memory on the roboRIO. If prompted to save any VIs, click Save on all prompts.
es_mx: Haga clic en el botón Run (Flecha blanca en la cinta superior) del Robot Main VI para desplegar el VI a la roboRIO. LabVIEW desplega el VI, todos los elementos requeridos por el VI, y los ajustes del objetivo a la memoria en el roboRIO. Si se le pide que guarde cualquier VI, haga clic en Guardar en todas las indicaciones.
tr_tr: VI'yı roboRIO'ya göndermek için Robot Main VI 'nın Run düğmesine (üst şeritte Beyaz Ok) tıklayın. LabVIEW VI'yı, VI'nın gerektirdiği tüm öğeleri ve hedef ayarları roboRIO'daki belleğe aktarır. Herhangi bir VI'yı kaydetmeniz istenirse, tüm istemlerde Save'e tıklayın.
zh_cn: 单击Robot Main VI的运行按钮（顶部功能区上的白色箭头），将VI部署到roboRIO。LabVIEW会将VI、VI所需的所有项目以及目标设置部署到roboRIO的内存中。如果提示您保存任何VI，请在所有提示上单击“保存”。

source: Using the Driver Station software, put the robot in Teleop Mode. For more information on configuring and using the Driver Station software, see the FRC Driver Station Software article.
es_mx: Usando el software de la Driver Station, ponga el robot en Modo de Teleoperado. Para obtener más información sobre la configuración y el uso del software de la Driver Station, vea el artículo del Software de la Driver Station de FRC.
tr_tr: Driver Station yazılımını kullanarak robotu Teleop Moduna getirin. Driver Station yazılımının yapılandırılması ve kullanılması hakkında daha fazla bilgi için, FRC Driver Station Yazılımı makalesine bakın.
zh_cn: 使用Driver Station软件，将机器置于Teleop模式。有关配置和使用Driver Station软件的更多信息，请参见FRC Driver Station Software文章。

source: Click Enable.
es_mx: Haga clic en Habilitar
tr_tr: Enable'a tıklayın.
zh_cn: 单击启用。

source: Move the joysticks and observe how the robot responds.
es_mx: Mueva las palancas y observe cómo responde el robot.
tr_tr: Kumanda kollarını hareket ettirin ve robotun nasıl tepki verdiğini gözlemleyin.
zh_cn: 移动操纵杆，观察机器人的反应。

source: Click the Abort button of the Robot Main VI. Notice that the VI stops. When you deploy a program with the Run button, the program runs on the roboRIO, but you can manipulate the front panel objects of the program from the host computer.
es_mx: Haga clic en el botón Abortar del Robot Main VI. Observe que el VI se detiene. Cuando despliega un programa con el botón Ejecutar, el programa se ejecuta en el roboRIO, pero puede manipular los objetos del panel frontal del programa desde el ordenador central.
tr_tr: Robot Main VI'nın Abort butonuna tıklayın. VI'nın durduğuna dikkat edin. Run düğmesiyle bir programı konuşlandırdığınızda, program roboRIO üzerinde çalışır, ancak programın ön panel nesnelerini ana bilgisayardan değiştirebilirsiniz.
zh_cn: 单击机器主VI的终止按钮。注意到VI停止了。使用“运行”按钮部署程序时，该程序在roboRIO上运行，但是您可以从主机上操纵该程序的前面板对象。

source: Deploying the Program
es_mx: Desplegando el Programa
tr_tr: Yazılımı Robota göndermek
zh_cn: 部署程序

source: To run in the competition, you will need to deploy a program to your roboRIO. This allows the program to survive across reboots of the controller, but doesn't allow the same debugging features (front panel, probes, highlight execution) as running from the front panel. To deploy your program:
es_mx: Para ejecutarlo durante la competencia, necesitará desplegar un programa a la roboRIO. Esto permite que el programa sobreviva a través de los reinicios del controlador, pero no permite las mismas características de depuración (panel frontal, sondas, ejecución de resaltado) que si se ejecutara desde el panel frontal. Para desplegar su programa:
tr_tr: Yarışmayı denemek için roboRIO'nuza bir program yüklemeniz gerekecek. Bu, programın denetleyicinin yeniden başlatılması sırasında hafızada kalmasını sağlar, ancak ön panelden çalıştırılanla aynı hata ayıklama özelliklerine (ön panel, problar, vurgulu yürütme) izin vermez. Programınızı yüklemek için:
zh_cn: 要参加比赛，您需要将程序部署到roboRIO。这使程序可以在控制器重新启动后继续存在，但不允许使用与从前面板运行相同的调试功能（前面板，探针，突出显示执行）。部署程序：

source: In the Project Explorer, click the + next to Build Specifications to expand it.
es_mx: En el Explorador de Proyecto, haga clic en + a lado de las Especificaciones de Construcción para expandirlo.
tr_tr: Proje Gezgini'nde, genişletmek için Yapı Özellikleri yanındaki + işaretini tıklayın.
zh_cn: 在项目资源管理器中，单击“构建结构”旁边的+以将其展开。

source: Right-click on FRC Robot Boot-up Deployment and select Build. Wait for the build to complete.
es_mx: Haga clic derecho en FRC Robot Boot-up Deployment y seleccione Build. Espere a que la construcción se complete.
tr_tr: FRC Robot Boot-up Deployment 'ne sağ tıklayın ve Build'i seçin. İşlemin tamamlanmasını bekleyin.
zh_cn: 右键单击FRC FRC机器启动部署，然后选择”构建”。等待构建完成。

source: Right-click again on FRC Robot Boot-Up Deployment and select Run as Startup. If you receive a conflict dialog, click OK. This dialog simply indicates that there is currently a program on the roboRIO which will be terminated/replaced.
es_mx: Vuelva a dar clic derecho en FRC Robot Boot-Up Deployment y seleccione Run as Startup. Si aparece un diálogo de conflicto, haga clic en OK. Este dialogo simplemente indica que actualmente hay un programa en la roboRIO que será terminado/ reemplazado.
tr_tr: RC Robot Boot-Up Deployment a tekrar sağ tıklayın ve Run as Starup'ı seçin. Çakışma-conflict ile ilgili bir iletişim kutusu alırsanız, OK'e tıklayın. Bu iletişim kutusu, roboRIO'da şu anda sonlandırılacak / değiştirilecek bir program olduğunu gösterir.
zh_cn: 再次右键单击FRC机器启动部署，然后选择“以启动方式运行”。如果收到冲突对话框，请单击“确定”。该对话框仅表明roboRIO上当前有一个程序将被终止/替换。

source: Either check the box to close the deployment window on successful completion or click the close button when the deployment completes.
es_mx: Marque la casilla para cerrar la ventana de despliegue al finalizar con éxito o haga clic en el botón de cierre cuando el despliegue se complete.
tr_tr: Başarılı bir şekilde tamamlandığında yükleme penceresini kapatmak için kutuyu işaretleyin veya close button when the deployment completes düğmesini tıklayın.
zh_cn: 选中该复选框可在成功完成后关闭部署窗口，或者在部署完成后单击关闭按钮。

source: The roboRIO will automatically start running the deployed code within a few seconds of the dialog closing.
es_mx: La roboRIO automáticamente va a empezar a ejecutar el código desplegado a los pocos segundos de cerrar el dialogo.
tr_tr: RoboRIO, iletişim kutusu kapandıktan sonra birkaç saniye içinde yüklenen kodu otomatik olarak çalıştırmaya başlayacaktır.
zh_cn: roboRIO将在对话框关闭后的几秒钟内自动开始运行已部署的代码。

source: This document covers how to create, build and load an FRC\ |reg| LabVIEW program onto a roboRIO. Before beginning, make sure that you have installed LabVIEW for FRC and the FRC Driver Station and that you have configured and imaged your roboRIO as described in the :ref:`Zero-to-Robot tutorial <docs/zero-to-robot/introduction:Introduction>`.
tr_tr: Bu belge bir FRC'nin nasıl oluşturulacağını, oluşturulacağını ve yükleneceğini kapsar \ |reg| RoboRIO'ya LabVIEW programı. Başlamadan önce, FRC için LabVIEW ve FRC Sürücü İstasyonunu kurduğunuzdan ve roboRIO'nuzu ref: ``Zero-to-Robota öğretici <docs/zero-to-robot/introduction:Introduction>`` bölümünde açıklandığı gibi yapılandırıp görüntülediğinizden emin olun.
zh_cn: 本文档介绍如何在roboRIO上创建，构建FRC\ |reg|LabVIEW程序并将其加载。在开始之前，请确保已安装LabVIEW for FRC和FRC Driver Station，并且已按照:ref:`Zero-to-Robot tutorial <docs/zero-to-robot/introduction:Introduction>`教程中的说明配置和镜像了roboRIO 。
