Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/creating-robot-programs/tank-drive-tutorial.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Tank Drive Tutorial
es_mx: Tutorial de conducción de tanques
fr_ca: Didacticiel Tank Drive
tr_tr: Tank Sürüşü Rehberi
zh_cn: 坦克驾驶模式教程

source: **Question:** How do I get my robot to drive with two joysticks using tank drive?
es_mx: **Pregunta:** ¿Cómo consigo que mi robot se conduzca con dos joysticks usando el accionamiento por tanque?
fr_ca: **Question:** Comment puis-je faire piloter mon robot avec deux joysticks à l’aide du mode de conduite tank drive?
tr_tr: **Soru:** Robotumun tank sürücüyü kullanarak iki kumanda kolu ile sürmesini nasıl sağlayabilirim?
zh_cn: **问题**：如何使用坦克驾驶模式使我的机器通过两个操纵杆驱动？

source: **Solution:** There are four components to consider when setting up tank drive for your robot. The first thing you will want to do is make sure the tank drive.vi is used instead of the arcade drive.vi or whichever drive VI you were utilizing previously. The second item to consider is how you want your joysticks to map to the direction you want to drive. In tank drive, the left joystick is used to control the left motors and the right joystick is used to control the right motors. For example, if you want to make your robot turn right by pushing up on the left joystick and down on the right joystick you will need to set your joystick’s accordingly in LabVIEW (this is shown in more detail below). Next, you will want to confirm the PWM lines that you are wired into, are the same ones your joysticks will be controlling. Lastly, make sure your motor controllers match the motor controllers specified in LabVIEW. The steps below will discuss these ideas in more detail:
es_mx: **Solución:** Hay cuatro componentes a considerar al configurar el accionamiento del tanque para su robot. Lo primero que querrá hacer es asegurarse de que se utilice el tank drive.vi en lugar del arcade drive.vi o cualquier unidad VI que esté utilizando anteriormente. El segundo elemento a considerar es cómo desea que sus joysticks se asignen a la dirección en la que desea conducir. En la transmisión por tanque, el joystick izquierdo se usa para controlar los motores izquierdos y el joystick derecho se usa para controlar los motores derechos. Por ejemplo, si desea que su robot gire a la derecha presionando hacia arriba el joystick izquierdo y hacia abajo el joystick derecho, deberá configurar el joystick en consecuencia en LabVIEW (esto se muestra con más detalle a continuación). A continuación, querrá confirmar las líneas PWM a las que está conectado, son las mismas que controlarán sus joysticks. Por último, asegúrese de que sus controladores de motor coincidan con los controladores de motor especificados en LabVIEW. Los pasos a continuación discutirán estas ideas con más detalle:
fr_ca: **Réponse:** Il y a quatre éléments à considérer lors vous configurez votre robot en mode Tank drive. La première chose que vous devez faire est de vous assurer que l'instrument virtuel tank.vi est utilisé au lieu de Arcade drive.vi ou tout autre type d'entraînement que vous utilisiez précédemment. Le deuxième élément à considérer est la façon dont vous voulez que vos joysticks se conforment à votre direction de conduite. Dans la configuration Tank drive, le joystick gauche est utilisé pour contrôler les moteurs gauches de votre robot et le joystick droit est utilisé pour contrôler les moteurs droits de votre robot. Ainsi, vous pouvez faire tourner votre robot vers la droite en dirigeant vers l'avant l'axe **y** du joystick gauche et en dirigeant vers l'arrière l'axe **y** du joystick droit; vous aurez besoin de définir vos joysticks en conséquence dans LabVIEW (ceci est montré plus en détail ci-dessous). Ensuite, vous devez vous assurer que vos joysticks contrôlent bien les lignes PWM auxquelles vous êtes connectés. Finalement, assurez-vous aussi que vos contrôleurs de moteurs correspondent à ceux spécifiés dans LabVIEW. Les étapes ci-dessous aborderont ces points plus en détail :
tr_tr: **Çözüm:** Robotunuz için tank tahriki ayarlarken dikkate alınması gereken dört bileşen vardır. Yapmak isteyeceğiniz ilk şey, arcade drive.vi veya daha önce kullandığınız VI sürücüsü yerine tank drive.vi'nin kullanıldığından emin olmaktır. Dikkate alınması gereken ikinci öğe, kumanda kollarınızın sürmek istediğiniz yöne nasıl eşlenmesini istediğinizdir. Tank sürüşünde, sol kumanda kolu sol motorları kontrol etmek için, sağ kumanda kolu ise sağ motorları kontrol etmek için kullanılır. Örneğin, sol kumanda çubuğunu yukarı ve sağ kumanda çubuğunu aşağı iterek robotunuzun sağa dönmesini istiyorsanız, kumanda çubuklarınızı LabVIEW'de buna göre ayarlamanız gerekecektir (bu, aşağıda daha ayrıntılı olarak gösterilmiştir). Ardından, kabloladığınız PWM hatlarının kumanda kollarınızın kontrol edeceği hatların aynısı olduğunu onaylamak isteyeceksiniz. Son olarak, motor denetleyicilerinizin LabVIEW'de belirtilen motor denetleyicileriyle eşleştiğinden emin olun. Aşağıdaki adımlar bu fikirleri daha ayrıntılı olarak tartışacaktır:
zh_cn: **答**：为机器设置坦克驾驶模式时，需要考虑四件事。您要做的第一件事就是确保使用tank drive.vi而不是arcade drive.vi或以前使用的驱动VI。要考虑的第二项是您希望操纵杆如何映射到要行驶的方向。在坦克驾驶模式中，左操纵杆用于控制左马达，右操纵杆用于控制右马达。例如，如果您想通过向上推左操纵杆并向下推向右操纵杆来使机器向右转，则需要在LabVIEW中相应地设置操纵杆的位置（下面将更详细地显示）。接下来，您将要确认连接到的PWM线与您的操纵杆将控制的PWM线相同。最后，确保您的电机控制器与LabVIEW中指定的电机控制器匹配。以下步骤将更详细地讨论这些想法：

source: Open LabVIEW and double click ``FRC roboRIO Project``.
es_mx: Abra LabVIEW y haga doble clic en ``Proyecto FRC roboRIO``.
fr_ca: Ouvrez LabVIEW et double-cliquez sur ``FRC roboRIO Project``.
zh_cn: 打开LabVIEW并双击“FRC roboRIO Project”

source: Give your project a name, add your team number, and select ``Arcade Drive Robot roboRIO``. You can select another option, however, this tutorial will discuss how to setup tank drive for this project.
es_mx: Dé un nombre a su proyecto, agregue el número de su equipo y seleccione ``Arcade Drive Robot roboRIO``. Puede seleccionar otra opción, sin embargo, este tutorial discutirá cómo configurar la unidad de tanque para este proyecto.
fr_ca: Donnez un nom à votre projet, ajoutez votre numéro d’équipe et sélectionnez ``Arcade Drive Robot roboRIO``. Vous pouvez sélectionner une autre option, cependant, ce tutoriel traite de la façon de configurer le mode Tank drive pour ce projet.
tr_tr: Projenize bir isim verin, takım numaranızı ekleyin ve ``Arcade Drive Robot roboRIO`` yu seçin. Başka bir seçenek seçebilirsiniz, ancak bu eğitimde bu proje için tank sürücüsünün nasıl ayarlanacağı anlatılacaktır.
zh_cn: 为项目命名，添加团队编号，然后选择Arcade Drive Robot roboRIO。您可以选择其他选项，但是，本教程将讨论如何为该项目设置坦克驾驶模式。

source: In the Project Explorer window, open up the ``Robot Main.vi``.
es_mx: En la ventana del Explorador de proyectos, abra el ``Robot Main.vi``.
fr_ca: Dans la fenêtre Explorateur de projets, ouvrez l'instrument virtuel ``Robot Main.vi``.
tr_tr: Project Explorer penceresinde, ``Robot Main.vi`` yi açın.
zh_cn: 在“项目资源管理器”窗口中，打开Robot Main.vi

source: Push :kbd:`Ctrl+E` to see the block diagram. It should look like the following image:
es_mx: Presione:kbd:`Ctrl+E` para ver el diagrama de bloque. Debería verse como la siguiente imagen:
fr_ca: Appuyez sur :kbd:`Ctrl + E` pour voir le diagramme. Cela devrait ressembler à l'image suivante:
zh_cn: 按下Ctrl+E即可查看框图。它应如下图所示：

source: Double click the "Teleop" vi inside of the Teleop Enabled case structure. Look at its block diagram. You will want to make two changes here:
es_mx: Haga doble clic en "Teleop" vi dentro de la estructura del caso Teleop Enabled. Mire su diagrama de bloques. Querrá hacer dos cambios aquí:
fr_ca: Double-cliquez sur l'instrument virtuel “Teleop” à l’intérieur de la Structure de condition Teleop Enabled. Observez son diagramme bloc. Vous y apporterez deux modifications:
zh_cn: 双击启用Teleop的案例结构内部的“ Teleop” vi。查看其框图。您将要在此处进行两项更改：

source: Replace Arcade Drive with the tank drive.vi. This can be found by right clicking on the block diagram >> WPI Robotics Library >> Robot Drive >> and clicking the Tank Drive VI.
es_mx: Reemplace Arcade Drive con el tanque drive.vi. Esto se puede encontrar haciendo clic derecho en el diagrama de bloques >> WPI Robotics Library >> Robot Drive >> y haciendo clic en Tank Drive VI.
fr_ca: Remplacez l'instrument virtuel Arcade Drive par l'instrument virtuel Tank drive. Vous le trouvez en cliquant à droite sur le diagramme bloc >> WPI Robotics Library >> Robot Drive >> et en cliquant sur le Tank Drive VI.
tr_tr: Arcade Drive'ı tank drive.vi ile değiştirin. Bu, blok diyagram >> WPI Robotics Library >> Robot Drive>> üzerine sağ tıklayıp Tank Drive VI'ya tıklayarak bulunabilir.
zh_cn: 用tank drive.vi替换Arcade Drive。右键单击程序框图>> WPI机器库>>机器驱动器>>，然后单击Tank Drive VI，可以找到该文件。

source: Find the Index Array function that is after the Get Values.vi. You will need to create two numeric constants and wire each into one of the index inputs. You can determine what the values of each index should be by looking at the USB Devices tab in the FRC\ |reg| Driver Station. Move the two joysticks to determine which number (index) they are tied to. You will likely want to use the Y-axis index for each joystick. This is because it is intuitive to push up on the joystick when you want the motors to go forward, and down when you when them to go in reverse. If you select the X-axis index for each, then you will have to move the joystick left or right (x-axis directions) to get the robot motors to move. In my setup, I’ve selected index 1 for my left motors Y-axis control and index 5 as the right motors Y-axis control. You can see the adjustments in LabVIEW in the following image:
es_mx: Encuentre la función Array que está en el Índice después de Get Values.vi. Necesitará crear dos constantes numéricas y conectar cada una a una de las entradas de índice. Puede determinar cuáles son los valores de cada índice mirando la pestaña de Dispositivos USB en el FRC\ |reg|.driver station. Mueva los dos joysticks para determinar a qué número (índice) están vinculados. Probablemente querrás usar el índice del eje Y para cada joystick. Esto se debe a que es intuitivo presionar el joystick hacia arriba cuando quieres que los motores vayan hacia adelante, y hacia abajo cuando quieres que vayan en reversa. Si seleccionas el índice del eje X para cada uno, entonces tendrás que mover el joystick a la izquierda o a la derecha (direcciones del eje x) para que los motores del robot se muevan. En mi configuración, he seleccionado el índice 1 para el control del eje Y de mis motores izquierdos y el índice 5 como control del eje Y de los motores derechos. Puedes ver los ajustes en LabVIEW en la siguiente imagen:
fr_ca: Recherchez la fonction Index Array qui se trouve après l’instrument virtuel Get Values.vi . Vous devrez créer deux constantes numériques et relier chacune d'elles dans à l’une des entrées d’index. Vous pouvez déterminer quelles sont les valeurs de chaque index en regardant l’onglet USB Devices dans l'application FRC\ |reg| Driver Station. Déplacez les deux joysticks pour déterminer les numéro des ports auxquels (index) ils sont liés. Il serait judicieux d'utiliser l’index de l’axe Y pour chaque joystick. C’est qu’il est intuitif de pousser vers le haut sur le joystick quand vous voulez commander les moteurs de votre robot de manière à aller vers l’avant, et vers le bas quand vous voulez le commander pour aller en sens inverse. Si vous sélectionnez l’index de l'axe x pour chacun, alors vous devrez déplacer le joystick à gauche ou à droite (directions x-axe) pour commander les moteurs du robot et avoir les déplacements précedemment décrits. Dans ma configuration, j’ai sélectionné l’index 1 pour mes moteurs gauches Y-axe de contrôle et l’indice 5 comme les moteurs droits Y-axe de contrôle. Vous pouvez voir les ajustements sous LabVIEW dans l’image suivante :
zh_cn: 找到位于Get Values.vi之后的索引数组函数。您将需要创建两个数字常量，并将每个常量连接到索引输入之一。您可以通过查看FRC®Driver Station中的USB Devices选项卡来确定每个索引的值。移动两个操纵杆以确定它们绑定到的数字（索引）。您可能希望对每个操纵杆使用Y轴索引。这是因为，当您希望电动机前进时，向上推操纵杆很直观；而当电动机反向时，推下操纵杆很直观。如果为每个轴选择X轴索引，则必须向左或向右移动操纵杆（X轴方向）才能使电机转动。在我的设置中，我为左电机Y轴控制选择了索引1，为右电机Y轴控制选择了索引5。你可以在LabVIEW中看到如下图所示的调整:

source: Next you will want to go back to your "Robot Main.vi" and double click on the "Begin.vi."
es_mx: A continuación, querrá volver a su "Robot Main.vi" y haga doble clic en "Begin.vi".
fr_ca: Ensuite, revenez à votre "Robot Main.vi" et double-cliquez sur l'instrument virtuel "Begin.vi."
zh_cn: 接下来，您将要返回到“ Robot Main.vi”并双击“ Begin.vi”。

source: The first thing to confirm in this VI is that your left and right motors are connected to the same PWM lines in LabVIEW as they are on your PDP (Power Distribution Panel).
es_mx: Lo primero que debe confirmar en este VI es que sus motores izquierdo y derecho están conectados a las mismas líneas PWM en LabVIEW que en su PDP (Panel de distribución de energía).
fr_ca: La première chose à confirmer dans ce VI est que vos moteurs gauche et droit sont connectés aux mêmes câbles PWM aussi bien dans LabVIEW que sur votre PDP (Panneau de distribution de puissance).
tr_tr: Bu VI'da onaylanması gereken ilk şey, sol ve sağ motorlarınızın LabVIEW'deki PDP'nizdeki (Güç Dağıtım Paneli) ile aynı PWM hatlarına bağlı olmasıdır.
zh_cn: 在该VI中首先要确认的是，您的左右电机连接到LabVIEW中与PDP（配电面板）上相同的PWM线。

source: The second thing to confirm in this VI is that the "Open 2 Motor.vi" has the correct motor controller selected (Talon, Jaguar, Victor, etc.).
es_mx: Lo segundo a confirmar en este VI es que el "Open 2 Motor.vi" tiene seleccionado el controlador de motor correcto (Talon, Jaguar, Victor, etc.).
fr_ca: La deuxième chose à confirmer dans ce VI est que l'instrument virtuel "Open 2 Motor.vi" a le bon contrôleur de moteurs sélectionné (Talon, Jaguar, Victor, etc.).
zh_cn: 在该VI中要确认的第二件事是“ Open 2 Motor.vi”已选择了正确的电机控制器（Talon，Jaguar，Victor等）。

source: For example, I am using Jaguar motor controllers and my motors are wired into PWM 8 and 9. The image below shows the changes I need to make:
es_mx: Por ejemplo, estoy usando controladores de motor Jaguar y mis motores están conectados a PWM 8 y 9. La siguiente imagen muestra los cambios que necesito hacer:
fr_ca: Par exemple, j’utilise des contrôleurs de moteurs de type Jaguar et mes moteurs sont reliés à PWM 8 et 9. L’image ci-dessous montre les changements que j’ai besoin de faire:
tr_tr: Örneğin, Jaguar motor denetleyicileri kullanıyorum ve motorlarım PWM 8 ve 9'a bağlı. Aşağıdaki resim, yapmam gereken değişiklikleri gösteriyor:
zh_cn: 例如，我正在使用Jaguar电动机控制器，并且电动机已连接到PWM 8和9。下图显示了我需要进行的更改：

source: Save all of the Vis that you have made adjustments to and you are now able to drive a robot with tank drive!
es_mx: ¡Guarde todos los Vis en los que ha realizado ajustes y ahora puede conducir un robot con un tanque de impulsión!
fr_ca: Enregistrez tous les Vis auxquels vous avez fait des ajustements et vous êtes maintenant en mesure de piloter votre robot en mode Tank drive!
tr_tr: Ayarlamalar yaptığınız tüm Vis'i kaydedin ve artık tank sürücülü bir robotu sürebilirsiniz!
zh_cn: 保存所有已进行调整的Vi，现在就可以使用坦克驾驶模式来驱动机器了！

source: Double click the “Teleop” vi inside of the Teleop Enabled case structure. Look at its block diagram. You will want to make two changes here:
tr_tr: Teleop Enabled durum yapısının içindeki “Teleop” vi 'ye çift tıklayın. Blok şemasına bakın. Burada iki değişiklik yapmak isteyeceksiniz:

source: Find the Index Array function that is after the Get Values.vi. You will need to create two numeric constants and wire each into one of the index inputs. You can determine what the values of each index should be by looking at the USB Devices tab in the FRC Driver Station. Move the two joysticks to determine which number (index) they are tied to. You will likely want to use the Y-axis index for each joystick. This is because it is intuitive to push up on the joystick when you want the motors to go forward, and down when you when them to go in reverse. If you select the X-axis index for each, then you will have to move the joystick left or right (x-axis directions) to get the robot motors to move. In my setup, I’ve selected index 1 for my left motors Y-axis control and index 5 as the right motors Y-axis control. You can see the adjustments in LabVIEW in the following image:
tr_tr: Get Values.vi 'den sonraki Index Array işlevini bulun. İki sayısal sabit oluşturmanız ve her birini dizin girişlerinden birine bağlamanız gerekecektir. FRC Sürücü İstasyonundaki USB Aygıtları sekmesine bakarak her bir dizinin değerinin ne olması gerektiğini belirleyebilirsiniz. Hangi numaraya (indeks) bağlı olduklarını belirlemek için iki kumanda çubuğunu hareket ettirin. Her bir kumanda kolu için Y ekseni dizinini kullanmak isteyebilirsiniz. Bunun nedeni, motorların ileri gitmesini istediğinizde joystick'i yukarı, geri gittiğinizde aşağı doğru itmenin sezgisel olmasıdır. Her biri için X ekseni dizinini seçerseniz, robot motorlarının hareket etmesini sağlamak için kumanda çubuğunu sola veya sağa (x ekseni yönleri) hareket ettirmeniz gerekir. Kurulumumda, sol motorlarım Y ekseni kontrolü için dizin 1'i ve sağ motorlar Y ekseni kontrolü olarak dizin 5'i seçtim. LabVIEW'deki ayarlamaları aşağıdaki resimde görebilirsiniz:

source: Next you will want to go back to your “Robot Main.vi” and double click on the “Begin.vi.”
tr_tr: Daha sonra “Robot Main.vi” ye geri dönüp “Begin.vi” ye çift tıklayın.

source: The second thing to confirm in this VI is that the “Open 2 Motor.vi” has the correct motor controller selected (Talon, Jaguar, Victor, etc.).
tr_tr: Bu VI'da doğrulanması gereken ikinci şey, “Open 2 Motor.vi” nin doğru motor denetleyicisinin seçili olmasıdır (Talon, Jaguar, Victor, vb.).
