Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/trajectories/constraints.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Trajectory Constraints
es_mx: Restricciones de trayectoria
fr_ca: Les contraintes de trajectoire
tr_tr: Yörünge Kısıtlamaları
zh_cn: 轨迹约束

source: In the :ref:`previous article <docs/software/advanced-controls/trajectories/trajectory-generation:Generating the trajectory>`, you might have noticed that no custom constraints were added when generating the trajectories. Custom constraints allow users to impose more restrictions on the velocity and acceleration at points along the trajectory based on location and curvature.
es_mx: En el :ref:`artículo previo <docs/software/advanced-controls/trajectories/trajectory-generation:Generating the trajectory>`, es posible que haya notado que no se agregaron restricciones personalizadas al generar las trayectorias. Las restricciones personalizadas permiten a los usuarios imponer más restricciones a la velocidad y la aceleración en puntos a lo largo de la trayectoria según la ubicación y la curvatura.
fr_ca: Dans :ref:`l'article précédent <docs/software/advanced-controls/trajectories/trajectory-generation:Generating the trajectory>`, vous avez peut-être remarqué qu'aucune contrainte personnalisée n'a été ajoutée lors de la génération des trajectoires. Les contraintes personnalisées permettent aux utilisateurs d'imposer plus de restrictions sur la vitesse et l'accélération aux points le long de la trajectoire en fonction de l'emplacement et de la courbure.
tr_tr: :ref:`Önceki makale <docs/software/advanced-controls/trajectories/trajectory-generation:Generating the trajectory>` 'de, yörüngeleri oluştururken hiçbir özel kısıtlamanın eklenmediğini fark etmiş olabilirsiniz. Özel kısıtlamalar, kullanıcıların konuma ve eğriliğe bağlı olarak yörünge boyunca bulunan noktalarda hız ve ivmeye daha fazla kısıtlama getirmesine olanak tanır.
zh_cn: 在 :ref:`previous article <docs/software/advanced-controls/trajectories/trajectory-generation:Generating the trajectory>`中，您可能已经注意到在生成轨迹时没有添加自定义约束。自定义约束允许用户基于位置和曲率对轨迹上点的速度和加速度施加更多的限制。

source: For example, a custom constraint can keep the velocity of the trajectory under a certain threshold in a certain region or slow down the robot near turns for stability purposes.
es_mx: Por ejemplo, una restricción personalizada puede mantener la velocidad de la trayectoria por debajo de un cierto umbral en una determinada región o ralentizar el robot cerca de los giros por motivos de estabilidad.
fr_ca: Par exemple, une contrainte personnalisée peut maintenir la vitesse de la trajectoire sous un certain seuil dans une certaine région ou ralentir le robot près des virages à des fins de stabilité.
tr_tr: Örneğin, özel bir kısıtlama, belirli bir bölgede yörüngenin hızını belirli bir eşiğin altında tutabilir veya stabilite amacıyla robotu yakın dönüşlerde yavaşlatabilir.
zh_cn: 例如，自定义约束可以将轨迹的速度保持在某一区域的某一阈值以下，或者在转弯附近使机器人减速以达到稳定的目的。

source: WPILib-Provided Constraints
es_mx: Restricciones proporcionadas por WPILib
fr_ca: Les contraintes fournies par WPILib
tr_tr: WPILib Tarafından Sağlanan Kısıtlamalar
zh_cn: WPILib-Provided约束

source: WPILib includes a set of predefined constraints that users can utilize when generating trajectories. The list of WPILib-provided constraints is as follows:
es_mx: WPILib incluye un conjunto de restricciones predefinidas que los usuarios pueden utilizar al generar trayectorias. La lista de restricciones proporcionadas por WPILib es la siguiente:
fr_ca: WPILib inclut un ensemble de contraintes prédéfinies que les utilisateurs peuvent utiliser lors de la génération de trajectoires. La liste des contraintes fournies par WPILib est la suivante:
tr_tr: WPILib, kullanıcıların yörüngeler oluştururken kullanabilecekleri önceden tanımlanmış bir dizi kısıtlama içerir. WPILib tarafından sağlanan kısıtlamaların listesi aşağıdaki gibidir:
zh_cn: WPILib包括一组预定义的约束，用户在生成轨迹时可以利用这些约束。 WPILib提供的约束列表如下：

source: ``CentripetalAccelerationConstraint``: Limits the centripetal acceleration of the robot as it traverses along the trajectory. This can help slow down the robot around tight turns.
es_mx: ``CentripetalAccelerationConstraint``: Limita la aceleración centrípeta del robot a medida que atraviesa la trayectoria. Esto puede ayudar a reducir la velocidad del robot en curvas cerradas.
fr_ca: ``CentripetalAccelerationConstraint``: Limite l'accélération centripète du robot lorsqu'il se déplace le long de la trajectoire. Cela peut aider à ralentir le robot dans les virages serrés.
tr_tr: ``CentripetalAccelerationConstraint``: Robot yörünge boyunca ilerlerken merkezcil ivmesini sınırlar. Bu, robotun sıkı dönüşlerde yavaşlamasına yardımcı olabilir.
zh_cn: ``CentripetalAccelerationConstraint''：限制机器人沿轨迹行进时的向心加速度。这可以帮助机器人在急转弯时减速。

source: ``DifferentialDriveKinematicsConstraint``: Limits the velocity of the robot around turns such that no wheel of a differential-drive robot goes over a specified maximum velocity.
es_mx: ``DifferentialDriveKinematicsConstraint``: Limita la velocidad del robot en los giros de modo que ninguna rueda de un robot differential-drive supere una velocidad máxima especificada.
fr_ca: ``DifferentialDriveKinematicsConstraint``: limite la vitesse du robot autour des virages de sorte qu'aucune roue d'un robot à entraînement différentiel ne dépasse une vitesse maximale spécifiée.
tr_tr: ``DifferentialDriveKinematicsConstraint``: Robotun dönüşlerinin hızını, diferansiyel tahrikli bir robotun hiçbir tekerleği belirtilen maksimum hızın üzerine çıkmayacak şekilde sınırlar.
zh_cn: ``DifferentialDriveKinematicsConstraint''：限制转弯时机器人的速度，以使差速驱动机器人的车轮都不会超过指定的最大速度。

source: ``DifferentialDriveVoltageConstraint``: Limits the acceleration of a differential drive robot such that no commanded voltage goes over a specified maximum.
es_mx: ``DifferentialDriveVoltageConstraint``: Limita la aceleración de un robot de differential drive de modo que ningún voltaje comandado supere un máximo especificado.
fr_ca: ``DifferentialDriveVoltageConstraint``: limite l'accélération d'un robot à entraînement différentiel de sorte qu'aucune tension de commande ne dépasse un voltage maximum spécifié.
tr_tr: ``DifferentialDriveVoltageConstraint``: Bir diferansiyel sürücü robotunun ivmesini, komut verilen hiçbir gerilimin belirtilen maksimum değeri aşmayacak şekilde sınırlar.
zh_cn: ``DifferentialDriveVoltageConstraint''：限制差动驱动机器人的加速度，以使命令电压不超过指定的最大值。

source: ``EllipticalRegionConstraint``: Imposes a constraint only in an elliptical region on the field.
es_mx: ``EllipticalRegionConstraint``: Impone una restricción solo en una región elíptica del campo.
fr_ca: ``EllipticalRegionConstraint``: impose une contrainte uniquement dans une région elliptique du champ.
tr_tr: ``EllipticalRegionConstraint``: Sahada yalnızca eliptik bir bölgede bir kısıtlama uygular.
zh_cn: ``EllipticalRegionConstraint''：仅在赛场上的椭圆区域中施加约束。

source: ``MaxVelocityConstraint``: Imposes a max velocity constraint. This can be composed with the ``EllipticalRegionConstraint`` or ``RectangularRegionConstraint`` to limit the velocity of the robot only in a specific region.
es_mx: ``MaxVelocityConstraint``: Impone una restricción de velocidad máxima. Esto se puede componer con ``EllipticalRegionConstraint`` o `` RectangularRegionConstraint`` para limitar la velocidad del robot solo en una región específica.
fr_ca: ``MaxVelocityConstraint``: Impose une contrainte de vitesse maximale. Cela peut être composé avec la ``EllipticalRegionConstraint`` ou la ``RectangularRegionConstraint`` pour limiter la vitesse du robot uniquement dans une région spécifique.
tr_tr: ``MaxVelocityConstraint``: Bir maksimum hız kısıtlaması uygular. Bu, robotun hızını yalnızca belirli bir bölgede sınırlamak için ``EllipticalRegionConstraint`` veya ``RectangularRegionConstraint`` ile oluşturulabilir.
zh_cn: ``MaxVelocityConstraint''：施加最大速度约束。这可以与``EllipticalRegionConstraint''或``RectangularRegionConstraint''组成，以仅在特定区域限制机器人的速度。

source: ``MecanumDriveKinematicsConstraint``: Limits the velocity of the robot around turns such that no wheel of a mecanum-drive robot goes over a specified maximum velocity.
es_mx: ``MecanumDriveKinematicsConstraint``: Limita la velocidad del robot en los giros de modo que ninguna rueda de un robot de mecanum-drive supere una velocidad máxima especificada.
fr_ca: ``MecanumDriveKinematicsConstraint``: limite la vitesse du robot dans les virages de sorte qu'aucune roue d'un robot avec entraînement Mécanum ne dépasse une vitesse maximale spécifiée.
tr_tr: ``MecanumDriveKinematicsConstraint``: Robotun dönüş hızını, mecanum sürücülü bir robotun hiçbir tekerleği belirtilen maksimum hızın üzerine çıkmayacak şekilde sınırlar.
zh_cn: ``MecanumDriveKinematicsConstraint''：限制转弯时机器人的速度，以使麦克纳姆驱动机器人的车轮都不会超过指定的最大速度。

source: ``RectangularRegionConstraint``: Imposes a constraint only in a rectangular region on the field.
es_mx: ``RectangularRegionConstraint``: Impone una restricción solo en una región rectangular del campo.
fr_ca: ``RectangularRegionConstraint``: impose une contrainte uniquement dans une région spécifique du terrain (de forme rectangualire).
tr_tr: ``RectangularRegionConstraint``: Alan üzerinde sadece dikdörtgen bir bölgede bir kısıtlama uygular.
zh_cn: ``RectangularRegionConstraint''：仅在字段的矩形区域中施加约束。

source: ``SwerveDriveKinematicsConstraint``: Limits the velocity of the robot around turns such that no wheel of a swerve-drive robot goes over a specified maximum velocity.
es_mx: ``SwerveDriveKinematicsConstraint``: Limita la velocidad del robot alrededor de los giros de manera que ninguna rueda de un robot de swerve-drive supere una velocidad máxima especificada.
fr_ca: ``SwerveDriveKinematicsConstraint``: Limite la vitesse du robot autour des virages de telle sorte qu'aucune roue d'un robot de type Swerve ne dépasse une vitesse maximale spécifiée.
tr_tr: ``SwerveDriveKinematicsConstraint``: Robotun dönüşler sırasındaki hızını, dönüşlü bir robotun hiçbir tekerleği belirtilen maksimum hızın üzerine çıkmayacak şekilde sınırlar.
zh_cn: ``SwerveDriveKinematicsConstraint''：限制转弯时机器人的速度，以使转弯驱动机器人的车轮都不会超过指定的最大速度。

source: The ``DifferentialDriveVoltageConstraint`` only ensures that theoretical voltage commands do not go over the specified maximum using a :ref:`feedforward model <docs/software/advanced-controls/controllers/feedforward:SimpleMotorFeedforward>`. If the robot were to deviate from the reference while tracking, the commanded voltage may be higher than the specified maximum.
es_mx: El `` DifferentialDriveVoltageConstraint '' solo asegura que los comandos de voltaje teórico no superen el máximo especificado usando un :ref:`feedforward model <docs/software/advanced-controls/controllers/feedforward:SimpleMotorFeedforward>`. Si el robot se desviara de la referencia durante el seguimiento, el voltaje ordenado puede ser más alto que el máximo especificado.
fr_ca: La ``DifferentialDriveVoltageConstraint`` garantit que les commandes de tension calculées ne dépassent pas le voltage maximum spécifié en utilisant un :ref:`modèle Feedforward <docs/software/advanced-controls/controllers/feedforward:SimpleMotorFeedforward>`. Si le robot s'écarte de la référence pendant le suivi du parcours, la tension commandée pourrait être supérieure au voltage maximum spécifié.
tr_tr: ``DifferentialDriveVoltageConstraint``, yalnızca teorik gerilim komutlarının :ref:`feedforward model <docs/software/advanced-controls/controllers/feedforward:SimpleMotorFeedforward>` kullanarak belirtilen maksimum değeri aşmamasını sağlar. Robot izleme sırasında referanstan saparsa, komut verilen voltaj belirtilen maksimumdan daha yüksek olabilir.
zh_cn: ``DifferentialDriveVoltageConstraint''只确保使用:ref:`feedforward model <docs/software/advanced-controls/controllers/feedforward:SimpleMotorFeedforward>`的理论电压命令不会超过指定的最大值。如果机器人在跟踪过程中偏离基准，指令电压可能会高于指定的最大电压。

source: Creating a Custom Constraint
es_mx: Crear una restricción personalizada
fr_ca: La création d'une contrainte personnalisée
tr_tr: Özel Bir Kısıtlama Oluşturma
zh_cn: 创建自定义约束

source: Users can create their own constraint by implementing the ``TrajectoryConstraint`` interface.
es_mx: Los usuarios pueden crear su propia restricción implementando la ``TrajectoryConstraint`` .
fr_ca: Les utilisateurs peuvent créer leur propre contrainte en appelant l'interface ``TrajectoryConstraint``.
tr_tr: Kullanıcılar, ``TrajectoryConstraint`` arayüzünü uygulayarak kendi kısıtlamalarını oluşturabilirler.
zh_cn: 用户可以通过实现``TrajectoryConstraint''接口来创建自己的约束。

source: The ``MaxVelocity`` method should return the maximum allowed velocity for the given pose, curvature, and original velocity of the trajectory without any constraints. The ``MinMaxAcceleration`` method should return the minimum and maximum allowed acceleration for the given pose, curvature, and constrained velocity.
es_mx: El método ``MaxVelocity`` debe devolver la velocidad máxima permitida para la pose, curvatura y velocidad original de la trayectoria dadas sin ninguna restricción. El método ``MinMaxAcceleration`` debe devolver la aceleración mínima y máxima permitida para la pose, curvatura y velocidad restringidas dadas.
fr_ca: La méthode ``MaxVelocity`` retourne la vitesse maximale autorisée pour la pose, la courbure et la vitesse d'origine données de la trajectoire sans aucune contrainte. La méthode ``MinMaxAcceleration`` retourne l'accélération minimale et maximale autorisée pour la pose donnée, la courbure et la vitesse.
tr_tr: ``MaxVelocity`` yöntemi, herhangi bir kısıtlama olmaksızın yörüngenin verilen poz, eğrilik ve orijinal hızı için izin verilen maksimum hızı döndürmelidir. ``MinMaxAcceleration`` methodu, verilen pozda, eğrilik ve kısıtlanmış hız için izin verilen minimum ve maksimum hızlanmayı döndürmelidir.
zh_cn: MaxVelocity方法应返回给定姿势，曲率和轨迹的原始速度的最大允许速度，且无任何限制。MinMaxAcceleration``方法应返回给定姿势，曲率和约束速度的最小和最大允许加速度。

source: See the source code (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpimath/src/main/java/edu/wpi/first/math/trajectory/constraint>`_, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpimath/src/main/native/cpp/trajectory/constraint>`_) for the WPILib-provided constraints for more examples on how to write your own custom trajectory constraints.
fr_ca: Voir le code source (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpimath/src/main/java/edu/wpi/first/math/trajectory/constraint>`_, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpimath/src/main/native/cpp/trajectory/constraint>`_) pour les contraintes fournies par WPILib pour plus d’exemples sur la façon d’écrire vos propres contraintes de trajectoire personnalisées.
