Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/trajectories/holonomic.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Holonomic Drive Controller
es_mx: Controlador de impulsión holonómico
fr_ca: Contrôleur pour entraînement de type holonomique
tr_tr: Holonomik Sürücü Kontrolcüsü
zh_cn: 全向驱动控制器

source: The holonomic drive controller is a trajectory tracker for robots with holonomic drivetrains (e.g. swerve, mecanum, etc.). This can be used to accurately track trajectories with correction for minor disturbances.
es_mx: El controlador de propulsión holonómico es un rastreador de trayectoria para robots con transmisiones holonómicas (por ejemplo, swerve, mecanum, etc.). Esto se puede usar para rastrear trayectorias con precisión con corrección para pequeñas perturbaciones.
fr_ca: Le contrôleur pour entraînement de type holonomique permet de tracer la trajectoire pour un robot ayant une transmission holonomique (par exemple, à embardée (Swerve) ou Mécanum, etc.). Ceci peut être utilisé pour suivre avec précision une trajectoire avec la possibilité de corriger des perturbations mineures.
tr_tr: Holonomik sürücü kontrolcüsü, holonomik aktarma organlarına sahip robotlar için bir yörünge izleyicidir (örn. sapma, mekanum, vb.). Bu, küçük sıkıntılar için düzeltme ile yörüngeleri doğru bir şekilde izlemek için kullanılabilir.
zh_cn: 全向驱动器控制器是一种轨迹跟踪器，适用于具有全向传动系统（例如，swerve底盘，麦克纳姆轮等）的机器人。可以使用它来校正微小的扰动，从而准确地跟踪轨迹。

source: Constructing a Holonomic Drive Controller
es_mx: Construcción de un controlador de impulsión holonómico
fr_ca: Construire un contrôleur holonomique
tr_tr: Holonomik Sürücü Kontrolcüsü Oluşturma
zh_cn: 构造全向驱动控制器

source: The holonomic drive controller should be instantiated with 2 PID controllers and 1 profiled PID controller.
es_mx: El controlador de accionamiento holonómico debe instanciarse con 2 controladores PID y 1 controlador PID perfilado.
fr_ca: Le contrôleur d'entraînement holonomique doit être instancié avec 2 contrôleurs PID et 1 contrôleur PID profilé.
tr_tr: Holonomik sürücü kontrolcüsü, 2 PID kontrolcüsü ve 1 profilli PID kontrolcüsü ile somutlaştırılmalıdır.
zh_cn: 全向驱动控制器应使用2个PID控制器和1个简略PID控制器实例化。

source: For more information on PID control, see :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
es_mx: Para obtener más información sobre el control PID, consulte :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
fr_ca: Pour plus d'informations sur le contrôle PID, voir :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
tr_tr: PID kontrolü hakkında daha fazla bilgi için bakınız :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`.
zh_cn: 有关PID控制的更多信息，请参见 :ref:`docs/software/advanced-controls/controllers/pidcontroller:PID Control in WPILib`。

source: The 2 PID controllers are controllers that should correct for error in the field-relative x and y directions respectively. For example, if the first 2 arguments are ``PIDController(1, 0, 0)`` and ``PIDController(1.2, 0, 0)`` respectively, the holonomic drive controller will add an additional meter per second in the x direction for every meter of error in the x direction and will add an additional 1.2 meters per second in the y direction for every meter of error in the y direction.
es_mx: Los 2 controladores PID son controladores que deben corregir el error en las direcciones X e Y relativas al campo, respectivamente. Por ejemplo, si los primeros 2 argumentos son ``PIDController(1, 0, 0)`` y ``PIDController(1.2, 0, 0)`` respectivamente, el controlador holonómico agregará un metro adicional por segundo en la x dirección por cada metro de error en la dirección x y agregará 1,2 metros adicionales por segundo en la dirección y por cada metro de error en la dirección y.
fr_ca: Les 2 contrôleurs PID sont des contrôleurs qui doivent corriger les erreurs respectivement dans les directions x et y relatives au champ. Par exemple, si les 2 premiers arguments sont respectivement ``PIDController(1, 0, 0)`` et ``PIDController(1.2, 0, 0)``, le contrôleur de lecteur holonomique ajoutera un mètre supplémentaire par seconde dans le x direction pour chaque mètre d'erreur dans la direction x et ajoutera 1,2 mètre supplémentaire par seconde dans la direction y pour chaque mètre d'erreur dans la direction y.
tr_tr: 2 PID kontrolcü, sırasıyla alana-göre x ve y yönlerindeki hatayı düzeltmesi gereken kontrolcülerdir. Örneğin, ilk 2 bağımsız değişken sırasıyla ``PIDController (1, 0, 0)`` ve ``PIDController (1.2, 0, 0)`` ise, holonomik sürücü kontrolcüsü; x yönündeki her hata metresi için x' e saniyede ek bir metre ekleyecektir ve y yönündeki her hata metresi için y' ye saniyede ek 1,2 metre ekleyecektir.
zh_cn: 2个PID控制器是分别应校正相对于磁场的x和y方向误差的控制器。例如，如果前两个参数分别是``PIDController(1, 0, 0)`` 和``PIDController(1.2, 0, 0)``，则完整驱动控制器将在x方向上为x方向上每米的误差增加每秒1米的附加误差。在y方向上为y方向上每米的误差增加每秒1.2米的附加误差。

source: The final parameter is a ``ProfiledPIDController`` for the rotation of the robot. Because the rotation dynamics of a holonomic drivetrain are decoupled from movement in the x and y directions, users can set custom heading references while following a trajectory. These heading references are profiled according to the parameters set in the ``ProfiledPIDController``.
es_mx: El último parámetro es un ``ProfiledPIDController`` para la rotación del robot. Debido a que la dinámica de rotación de un tren motriz holonómico está desacoplada del movimiento en las direcciones x,y, los usuarios pueden establecer referencias de rumbo personalizadas mientras siguen una trayectoria. Estas referencias de encabezado se perfilan de acuerdo con los parámetros establecidos en el ``ProfiledPIDController``.
fr_ca: Le paramètre final est un ``ProfiledPIDController`` pour la rotation du robot. Étant donné que la dynamique de rotation d'une transmission holonomique est découplée du mouvement dans les directions x et y, les utilisateurs peuvent définir des références de cap personnalisées lorsque le but est de suivre une trajectoire. Ces références d'en-tête sont profilées en fonction des paramètres définis dans le ``ProfiledPIDController``.
tr_tr: Son parametre, robotun dönüşü için bir ``ProfiledPIDController``dır. Bir holonomik aktarma organının dönüş dinamikleri x ve y yönlerindeki hareketten ayrıldığından, kullanıcılar bir yörüngeyi izlerken özel yön referansları ayarlayabilir. Bu rota referansları, ``ProfiledPIDController`` içinde ayarlanan parametrelere göre profillenmiştir.
zh_cn: 最后一个参数是用于机器人旋转的“ProfiledPIDController”。由于完整传动系统的旋转动力学在x和y方向上与运动解耦，用户可以设置自定义的航向参考，同时遵循轨迹。这些标题引用是根据``ProfiledPIDController``中的参数设置的概要。

source: Getting Adjusted Velocities
es_mx: Obtener velocidades ajustadas
fr_ca: Obtenir des vitesses ajustées
tr_tr: Ayarlanmış Hızları Alma
zh_cn: 调整速度

source: The holonomic drive controller returns "adjusted velocities" such that when the robot tracks these velocities, it accurately reaches the goal point. The controller should be updated periodically with the new goal. The goal is comprised of a desired pose, linear velocity, and heading.
es_mx: El controlador de impulsión holonómico devuelve "velocidades ajustadas" de modo que cuando el robot sigue estas velocidades, alcanza con precisión el punto objetivo. El controlador debe actualizarse periódicamente con el nuevo objetivo. El objetivo se compone de una pose deseada, velocidad lineal y rumbo.
fr_ca: Le contrôleur d'entraînement holonomique renvoie des "vitesses ajustées" de telle sorte que lorsque le robot suit ces vitesses, il atteint avec précision le point cible. Le contrôleur doit être mis à jour périodiquement avec le nouvel objectif. L'objectif est composé d'une pose désirée, d'une vitesse linéaire et d'un cap souhaités.
tr_tr: Holonomik sürücü kontrolcüsü, robot bu hızları takip ettiğinde hedef noktasına doğru bir şekilde ulaşacak şekilde "ayarlanmış hızları" geri döndürür. Kontrolcü, yeni hedefle periyodik olarak güncellenmelidir. Hedef, istenen bir poz, doğrusal hız ve rotadan oluşur.
zh_cn: 完整的驱动控制器返回“已调整的速度”，以便当机器人跟踪这些速度时，它可以精确地达到目标点。 应使用新目标定期更新控制器。目标包括所需的姿势，线速度和航向。

source: The "goal pose" represents the position that the robot should be at a particular timestamp when tracking the trajectory. It does NOT represent the trajectory's endpoint.
es_mx: La "pose objetivo" representa la posición en la que debería estar el robot en un momento determinado al seguir la trayectoria. NO representa el punto final de la trayectoria.

source: The controller can be updated using the ``Calculate`` (C++) / ``calculate`` (Java/Python) method. There are two overloads for this method. Both of these overloads accept the current robot position as the first parameter and the desired heading as the last parameter. For the middle parameters, one overload accepts the desired pose and the linear velocity reference while the other accepts a ``Trajectory.State`` object, which contains information about the goal pose. The latter method is preferred for tracking trajectories.
es_mx: El controlador puede ser actualizado usando el método ``Calculate`` (C++) / ``calculate`` (Java/Python). Existen 2 sobrecargas de este método. Ambas de estas sobrecargas aceptan la posición actual del robot como el primer parámetro, y la orientación deseada en el segundo parámetro. Para los parámetros de en medio, una sobrecarga acepta la posición deseada y la referencia de velocidad linear mientras que otra acepta un objeto ``Trajectory.State``, el cual contiene información sobre la posición deseada. El ultimo método es preferible para rastrear trayectorias

source: Using the Adjusted Velocities
es_mx: Usando velocidades ajustadas.
fr_ca: Utilisation des vitesses ajustées
tr_tr: Ayarlanmış Hızları Kullanma
zh_cn: 使用调整后的速度

source: The adjusted velocities are of type ``ChassisSpeeds``, which contains a ``vx`` (linear velocity in the forward direction), a ``vy`` (linear velocity in the sideways direction), and an ``omega`` (angular velocity around the center of the robot frame).
es_mx: Las velocidades ajustadas son un tipo de ``ChassisSpeeds``, que contiene un ``vx`` (velocidad lineal en dirección de avance), a ``vy`` (velocidad lineal en direcciones laterales), y ``omega`` (velocidad angular al rededor del centro del marco del robot).
fr_ca: Les vitesses ajustées sont de type ``ChassisSpeeds``, qui contient un ``vx`` (vitesse linéaire dans le sens avant), un ``vy`` (vitesse linéaire dans le sens latéral) et un ``omega`` (vitesse angulaire autour du centre du châssis du robot).
tr_tr: Ayarlanan hızlar ``ChassisSpeeds`` tipindedir, bir `` vx '' (ileri yönde doğrusal hız) içerir, a `` vy '' (yan yöndeki doğrusal hız) ve bir `` omega '' (robot çerçevesinin merkezi etrafındaki açısal hız).
zh_cn: 调整后的速度为``ChassisSpeeds''类型，其中包含``vx''（向前方向的线速度），``vy''（横向方向的线速度）和``omega'' （围绕机器人框架中心的角速度）。

source: The returned adjusted speeds can be converted into usable speeds using the kinematics classes for your drivetrain type. In the example code below, we will assume a swerve drive robot; however, the kinematics code is exactly the same for a mecanum drive robot except using ``MecanumDriveKinematics``.
es_mx: La velocidad ajustada que nos da puede ser convertida en velocidad utilizable usando clases de cinemática para su chasis. En el código de ejemplo de abajo, podemos asumir un robot con swerve drive; de todas formas, el codigo cinemático es exactamente igual para un robot con mecanum drive usando ``MecanumDriveKinematics``.
fr_ca: Les vitesses ajustées renvoyées peuvent être converties en vitesses utilisables à l'aide des classes de cinématique correspondant à votre type de transmission. Dans l'exemple de code ci-dessous, nous supposerons un robot à entraînement de type Swerve; cependant, le code cinématique est exactement le même pour un robot avec entraînement Mécanum sauf en utilisant ``MecanumDriveKinematics``.
tr_tr: Döndürülen ayarlanmış hızlar, aktarma sistemi tipiniz için kinematik sınıfları kullanılarak kullanılabilir hızlara dönüştürülebilir. Aşağıdaki örnek kodda, bir swerve sürücü robotu varsayacağız; bununla birlikte, kinematik kodu, ``MecanumDriveKinematics`` kullanımı haricinde bir mecanum tahrik robotu için tamamen aynıdır.
zh_cn: 可以使用适用于您的传动系统类型的运动学类将返回的调整速度转换为可用速度。在下面的示例代码中，我们将假定一个弧形驱动机器人；但是，除了使用``MecanumDriveKinematics''外，运动学代码与麦克纳姆驱动机器人完全相同。

source: Because these swerve module states are still speeds and angles, you will need to use PID controllers to set these speeds and angles.
es_mx: Porque estos módulos swerve son aún velocidades y ángulos, se necesitará usar controladores PID para marcar estos ángulos y velocidades.
fr_ca: Étant donné que les états de module pour un entraînement de type Swerve sont définis par des vitesses et des angles, vous devrez utiliser des contrôleurs PID pour définir ces vitesses et ces angles.
tr_tr: Bu sapma modülü durumları, hala hızlar ve açılar olduğundan; bu hızları ve açıları ayarlamak için PID kontrolcüleri kullanmanız gerekecektir.
zh_cn: 由于这些转弯模块状态仍然是速度和角度，因此您将需要使用PID控制器来设置这些速度和角度。

source: The "goal pose" represents the position that the robot should be at at a particular timestamp when tracking the trajectory. It does NOT represent the trajectory's endpoint.
fr_ca: La "pose désirée" représente la position à laquelle le robot doit être à un horodatage particulier lors du suivi de la trajectoire. Elle ne représente PAS le point final de la trajectoire.
tr_tr: "goal pose-hedef pozu", yörüngeyi izlerken robotun belirli bir zaman diliminde olması gereken konumu temsil eder. Yörüngenin son noktasını temsil ETMEZ.
zh_cn: “目标姿势”表示机器人在跟踪轨迹时应处于特定时间戳的位置。它不代表轨迹的终点。

source: The controller can be updated using the ``Calculate`` (C++) / ``calculate`` (Java) method. There are two overloads for this method. Both of these overloads accept the current robot position as the first parameter and the desired heading as the last parameter. For the middle parameters, one overload accepts the desired pose and the linear velocity reference while the other accepts a ``Trajectory.State`` object, which contains information about the goal pose. The latter method is preferred for tracking trajectories.
fr_ca: Le contrôleur peut être mis à jour à l'aide de la méthode ``Calculate`` (C++) / ``calculate`` (Java). Il y a deux surcharges pour cette méthode. Ces deux surcharges acceptent la position actuelle du robot comme premier paramètre et le cap souhaité comme dernier paramètre. Pour les paramètres du milieu, une surcharge accepte la pose souhaitée et la référence de vitesse linéaire tandis que l'autre accepte un objet ``Trajectory.State``, qui contient des informations sur la pose désirée. Cette dernière méthode est préférable pour suivre les trajectoires.
tr_tr: Kontrolcü, ``Calculate`` (C++) / ``calculate`` (Java) yöntemi kullanılarak güncellenebilir. Bu yöntem için iki aşırı yük vardır. Bu aşırı yüklerin her ikisi de mevcut robot konumunu ilk parametre olarak ve istenen rotayı son parametre olarak kabul eder. Ortadaki parametreler için, bir aşırı yük istenen pozu ve doğrusal hız referansını kabul ederken, diğeri hedef pozu hakkında bilgi içeren bir ``Trajectory.State`` nesnesini kabul eder. İkinci yöntem, yörüngeleri izlemek için tercih edilir.
zh_cn: 控制器可以使用``Calculate`` (c++) / ``Calculate`` (Java)方法更新。此方法有两个重载。这两种重载都接受当前机器人位置作为第一个参数，并将期望的航向作为最后一个参数。对于中间的参数，一个重载接受所需的姿态和线速度参考，而另一个接受' '轨迹。对象，它包含关于目标姿态的信息。后一种方法是跟踪轨迹的首选方法。
