Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/trajectories/manipulating-trajectories.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Manipulating Trajectories
es_mx: Manipulando trayectorias
fr_ca: La manipulation des trajectoires
tr_tr: Yörüngeleri Manipüle Etmek
zh_cn: 操纵轨迹

source: Once a trajectory has been generated, you can retrieve information from it using certain methods. These methods will be useful when writing code to follow these trajectories.
es_mx: Una vez que se ha generado una trayectoria, puede recuperar información de ella utilizando ciertos métodos. Estos métodos serán útiles al escribir el código para seguir estas trayectorias.
fr_ca: Une fois qu'une trajectoire a été générée, vous pouvez en extraire des informations à l'aide de certaines méthodes. Ces méthodes seront utiles lors de l'écriture de code pour suivre ces trajectoires.
tr_tr: Bir yörünge oluşturulduktan sonra, belirli yöntemleri kullanarak ondan bilgi alabilirsiniz. Bu yöntemler, bu yörüngeleri izlemek için kod yazarken faydalı olacaktır.
zh_cn: 生成轨迹后，您可以使用某些方法从中检索信息。在编写代码以追踪这些轨迹时，这些方法将非常有用。

source: Getting the total duration of the trajectory
es_mx: Obteniendo la duración total de la trayectoria
fr_ca: Obtenir la durée totale de la trajectoire
tr_tr: Yörüngenin Toplam Süresini Elde Etmek
zh_cn: 获取轨迹的总持续时间

source: Because all trajectories have timestamps at each point, the amount of time it should take for a robot to traverse the entire trajectory is pre-determined. The ``TotalTime()`` (C++) / ``getTotalTimeSeconds()`` (Java) method can be used to determine the time it takes to traverse the trajectory.
es_mx: Debido a que todas las trayectorias tienen marcas de tiempo en cada punto, la cantidad de tiempo que debe tomar un robot para atravesar toda la trayectoria está predeterminada. El método ``TotalTime()`` (C++) / ``getTotalTimeSeconds()`` (Java) puede ser usado para determinar el tiempo que le toma en atravesar toda la trayectoria.
fr_ca: Étant donné que toutes les trajectoires ont des horodatages à chaque point, le temps nécessaire à un robot pour parcourir la trajectoire entière est prédéterminé. La méthode `` TotalTime () '' (C ++) / `` getTotalTimeSeconds () '' (Java) peut être utilisée pour déterminer le temps qu'il faut pour parcourir la trajectoire.
tr_tr: Tüm yörüngelerin her noktada zaman damgaları olduğundan, bir robotun tüm yörüngeyi geçmesi için gereken süre önceden belirlenir. ``TotalTime ()`` (C ++) / `` getTotalTimeSeconds ()`` (Java) yöntemi yörüngede gezinmek için gereken süreyi belirlemek için kullanılabilir.
zh_cn: 因为所有轨迹在每个点上都有时间戳，所以预先确定了机器人穿越整个轨迹所需要的时间已被预先确定了。 TotalTime() (C++) / getTotalTimeSeconds() (Java) 方法可用于确定追踪轨迹所需的时间

source: Sampling the trajectory
es_mx: Una muestra de la trayectoria
fr_ca: Échantillonnage de la trajectoire
tr_tr: Yörüngeyi Örnekleme
zh_cn: 轨迹采样

source: The trajectory can be sampled at various timesteps to get the pose, velocity, and acceleration at that point. The ``Sample(units::second_t time)`` (C++) / ``sample(double timeSeconds)`` (Java) method can be used to sample the trajectory at any timestep. The parameter refers to the amount of time passed since 0 seconds (the starting point of the trajectory). This method returns a ``Trajectory::Sample`` with information about that sample point.
es_mx: Se puede hace una muestra de la trayectoria en varios pasos de tiempo para obtener la pose, la velocidad y la aceleración en ese punto. El método ``Sample(units::second_t time)`` (C++) / ``sample(double timeSeconds)`` (Java) se puede utilizar para hacer una muestra de la trayectoria en cualquier paso de tiempo. El parámetro se refiere a la cantidad de tiempo transcurrido desde 0 segundos (el punto de inicio de la trayectoria). Este método devuelve una ``Trajectory::Sample`` con información sobre ese punto de muestra.
fr_ca: La trajectoire peut être échantillonnée à différents pas de temps pour obtenir la pose, la vitesse et l'accélération à ce point. La méthode `` Sample (units :: second_t time) '' (C ++) / `` sample (double timeSeconds) '' (Java) peut être utilisée pour échantillonner la trajectoire à n'importe quel pas de temps. Le paramètre fait référence au temps écoulé depuis 0 seconde (le point de départ de la trajectoire). Cette méthode renvoie un `` Trajectory :: Sample`` avec des informations sur ce point d'échantillonnage.
tr_tr: Yörünge, o noktada pozu, hızı ve ivmeyi elde etmek için çeşitli zaman adımlarında örneklenebilir. Herhangi bir zaman adımında yörüngeyi örneklemek için ``Sample(units::second_t time)`` (C++) / ``sample(double timeSeconds)`` (Java) yöntemi kullanılabilir. Parametre, 0 saniyeden bu yana geçen süreyi ifade eder (yörüngenin başlangıç noktası). Bu yöntem, o örnek noktası hakkında bilgi içeren bir ``Trajectory::Sample`` döndürür.
zh_cn: 可以在各个时间步长采样轨迹，以获取该点的姿态，速度和加速度。(units::second_t time) (C++) / sample(double timeSeconds) (Java)方法可用于在任何时间步采样轨迹。该参数指的是自0秒（轨迹的起点）以来经过的时间量。此方法返回一个Trajectory :: Sample，包含关该采样点的信息。

source: The ``Trajectory::Sample`` struct has several pieces of information about the sample point:
es_mx: La estructura ``Trajectory::Sample`` tiene varias piezas de información acerca del punto de muestra:
fr_ca: La structure `` Trajectory :: Sample`` contient plusieurs informations sur le point d'échantillonnage:
tr_tr: `` Yörünge :: Örnek`` yapısı, örnek nokta hakkında birkaç parça bilgi içerir:
zh_cn: Trajectory::Sample结构包含有关采样点的几条信息：

source: ``t``: The time elapsed from the beginning of the trajectory up to the sample point.
es_mx: ``t``: El tiempo transcurrido desde el inicio de la trayectoria hasta el punto de muestra.
fr_ca: `` t``: Le temps écoulé depuis le début de la trajectoire jusqu'au point d'échantillonnage.
tr_tr: ``t``: Yörüngenin başlangıcından örnekleme noktasına kadar geçen süre.
zh_cn: t：从轨迹开始到采样点为止的时间。

source: ``velocity``: The velocity at the sample point.
es_mx: ``velocity``: La velocidad en el punto de muestra.
fr_ca: `` velocity '': la vélocité au point d'échantillonnage.
tr_tr: ``velocity``: Numune noktasındaki hız.
zh_cn: velocity：采样点的速度。

source: ``acceleration``: The acceleration at the sample point.
es_mx: ``acceleration``: La aceleracion en el punto de muestra.
fr_ca: `` acceleration '': l'accélération au point d'échantillonnage.
tr_tr: ``acceleration``: Örnek noktadaki ivme.
zh_cn: acceleration: 采样点的加速度。

source: ``pose``: The pose (x, y, heading) at the sample point.
es_mx: ```pose``: la pose (x, y, rumbo) en el punto de muestra.
fr_ca: `` pose '': la pose (x, y, cap) au point d'échantillonnage.
tr_tr: `` pose``: Örnek noktadaki poz (x, y, başlık).
zh_cn: pose：采样点的姿态 (x, y, heading)

source: ``curvature``: The curvature (rate of change of heading with respect to distance along the trajectory) at the sample point.
es_mx: ``curvature``: la curvatura (tasa de cambio de rumbo con respecto a la distancia a lo largo de la trayectoria) en el punto de muestra.
fr_ca: `` curvature'': la courbure (taux de changement de cap par rapport à la distance le long de la trajectoire) au point d'échantillonnage.
tr_tr: ``curvature``: Numune noktasındaki eğrilik (yörünge boyunca mesafeye göre yön değişim oranı).
zh_cn: “曲率”：采样点的曲率（航向的变化率，相对于沿着轨迹的距离）。

source: Note: The angular velocity at the sample point can be calculated by multiplying the velocity by the curvature.
es_mx: Nota: La velocidad angular en el punto de muestra se puede calcular multiplicando la velocidad por la curvatura.
fr_ca: Remarque: La vitesse angulaire au point d'échantillonnage peut être calculée en multipliant la vitesse par la courbure.
tr_tr: Not: Numune noktasındaki açısal hız, hızı eğrilik ile çarparak hesaplanabilir.
zh_cn: 注意：可以通过将速度乘以曲率来计算采样点的角速度。

source: Getting all states of the trajectory (advanced)
es_mx: Obteniendo todos los estados de la trayectoria (avanzado)
fr_ca: Obtention de tous les états de la trajectoire (avancé)
tr_tr: Yörüngenin Tüm Durumlarını Alma (Gelişmiş)
zh_cn: 获取轨迹的所有状态（高级）

source: A more advanced user can get a list of all states of the trajectory by calling the ``States()`` (C++) / ``getStates()`` (Java) method. Each state represents a point on the trajectory. :ref:`When the trajectory is created <docs/software/advanced-controls/trajectories/trajectory-generation:Generating the trajectory>` using the ``TrajectoryGenerator::GenerateTrajectory(...)`` method, a list of trajectory points / states are created. When the user samples the trajectory at a particular timestep, a new sample point is interpolated between two existing points / states in the list.
es_mx: Un usuario más avanzado puede obtener una lista de todos los estados de la trayectoria llamando al método ``States()`` (C++) / ``getStates()`` (Java). Cada estado representa un punto en la trayectoria. :ref:`When the trajectory is created <docs/software/advanced-controls/trajectories/trajectory-generation:Generating the trajectory>` usando el método ``TrajectoryGenerator::GenerateTrajectory(...)``, una lista de trayectoria se crean puntos / estados. Cuando el usuario muestrea la trayectoria en un paso de tiempo particular, se interpola un nuevo punto de muestra entre dos puntos / estados existentes en la lista.
fr_ca: Un utilisateur expérimenté peut obtenir une liste de tous les états de la trajectoire en appelant la méthode `` States () '' (C ++) / `` getStates () '' (Java). Chaque état représente un point sur la trajectoire. : ref: `Lorsque la trajectoire est créée <documents / logiciels / commandes avancées / trajectoires / génération de trajectoire: génération de la trajectoire>` en utilisant la méthode `` TrajectoryGenerator :: GenerateTrajectory (...) '', une liste de trajectoire des points / états sont créés. Lorsque l'utilisateur échantillonne la trajectoire à un moment particulier, un nouveau point d'échantillonnage est interpolé entre deux points / états existants dans la liste.
tr_tr: Daha ileri düzey bir kullanıcı, ``States()`` (C++) / ``getStates()`` (Java) yöntemini çağırarak yörüngenin tüm durumlarının bir listesini alabilir. Her durum yörünge üzerindeki bir noktayı temsil eder. :ref:`When the trajectory is created <docs/software/advanced-controls/trajectories/trajectory-generation:Generating the trajectory>` ``TrajectoryGenerator::GenerateTrajectory(...)`` kullanılarak yöntem, yörünge noktalarının / durumlarının bir listesi oluşturulur. Kullanıcı belirli bir zaman adımında yörüngeyi örneklediğinde, listedeki iki mevcut nokta / durum arasında yeni bir örnek noktası enterpolasyonu yapılır.
zh_cn: 更高级的用户可以通过调用States() (C++) / getStates() (Java)方法获得轨迹的所有状态列表。每个状态代表轨迹上的一个点。当轨迹被通过TrajectoryGenerator::GenerateTrajectory(...)方法创建时，轨迹点和状态的列表也被创建了。当用户在一个特定的时间步长采样轨迹时，一个新的采样点被插入到列表中两个现有的点/状态之间。
