Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/trajectories/ramsete.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Ramsete Controller
es_mx: Controlador ramsete
fr_ca: Contrôleur Ramsete
tr_tr: Ramsete Denetleyicisi
zh_cn: 斜坡控制器

source: The Ramsete Controller is a trajectory tracker that is built in to WPILib. This tracker can be used to accurately track trajectories with correction for minor disturbances.
es_mx: El controlador Ramsete es un rastreador de trayectoria integrado en WPILib. Este rastreador se puede utilizar para rastrear trayectorias con precisión con corrección de perturbaciones menores.
fr_ca: Le contrôleur Ramsete est un tracker de trajectoire intégré à WPILib. Ce tracker peut être utilisé pour suivre avec précision les trajectoires avec correction des perturbations mineures.
tr_tr: Ramsete Kontrol Cihazı, WPILib'e yerleşik bir yörünge izleyicidir. Bu izleyici, küçük rahatsızlıklar için düzeltme ile yörüngeleri doğru bir şekilde izlemek için kullanılabilir.
zh_cn: Ramsete控制器是WPILib内置的轨迹跟踪器。该跟踪器可用于通过对较小干扰的校正来准确跟踪轨迹。

source: Constructing the Ramsete Controller Object
es_mx: Construcción del objeto controlador Ramsete
fr_ca: Construire l'objet contrôleur Ramsete
tr_tr: Ramsete Denetleyici Nesnesinin-Object Oluşturulması
zh_cn: 构造Ramsete控制器对象

source: The Ramsete controller should be initialized with two gains, namely ``b`` and ``zeta``. Larger values of ``b`` make convergence more aggressive like a proportional term whereas larger values of ``zeta`` provide more damping in the response. These controller gains only dictate how the controller will output adjusted velocities. It does NOT affect the actual velocity tracking of the robot. This means that these controller gains are generally robot-agnostic.
es_mx: El controlador Ramsete debe inicializarse con dos ganancias, a saber, ``b`` y ``zeta``. Los valores más altos de ``b`` hacen que la convergencia sea más agresiva como un término proporcional, mientras que los valores más altos de ``zeta`` proporcionan más amortiguación en la respuesta. Estas ganancias del controlador solo dictan cómo el controlador generará velocidades ajustadas. NO afecta el seguimiento de la velocidad real del robot. Esto significa que estas ganancias del controlador son generalmente independientes del robot.
fr_ca: Le contrôleur Ramsete doit être initialisé avec deux gains, à savoir ``b`` et ``zeta``. Des valeurs plus grandes de ``b`` rendent la convergence plus agressive comme un terme proportionnel tandis que des valeurs plus grandes de ``zeta`` fournissent plus d'amortissement dans la réponse. Ces gains de contrôleur dictent uniquement la manière dont le contrôleur produira les vitesses ajustées. Cela n'affecte PAS le suivi de la vitesse réelle du robot. Cela signifie que ces gains de contrôleur sont généralement indépendants du robot.
tr_tr: Ramsete kontrolörü, ``b`` ve ``zeta`` olmak üzere iki kazançla başlatılmalıdır. Daha büyük ``b`` değerleri yakınsamayı orantılı bir terim gibi daha agresif hale getirirken, daha büyük ``zeta`` değerleri yanıtta daha fazla sönümleme sağlar. Bu kontrolör kazançları, sadece kontrolörün ayarlanan hızları nasıl çıkaracağını belirler. Robotun gerçek hız takibini ETKİLEMEZ. Bu, bu denetleyici kazançlarının genellikle robottan bağımsız olduğu anlamına gelir.
zh_cn: Ramsete控制器应该初始化为两个增益，即' ' b ' '和' ' zeta ' '。较大的值' ' b ' '使收敛更猛烈，就像一个比例项，而较大的值' ' zeta ' '在响应中提供更多的阻尼。这些控制器增益只决定控制器将如何输出调整的速度。它不影响机器人的实际速度跟踪。这意味着这些控制器增益通常与机器人无关。

source: Gains of ``2.0`` and ``0.7`` for ``b`` and ``zeta`` have been tested repeatedly to produce desirable results when all units were in meters. As such, a zero-argument constructor for ``RamseteController`` exists with gains defaulted to these values.
es_mx: Las ganancias de ``2.0`` y ``0.7``para ``b`` y ``zeta`` se han probado repetidamente para producir resultados deseables cuando todas las unidades estaban en metros. Como tal, existe un constructor de argumento cero para ``RamseteController`` con ganancias predeterminadas a estos valores.
fr_ca: Les gains de ``2.0`` et ``0.7`` pour ``b`` et ``zeta`` ont été testés à plusieurs reprises pour produire des résultats souhaitables lorsque toutes les unités étaient en mètres. En tant que tel, un constructeur qui ne passe aucun argument à ``RamseteController`` aura ses gains réglés par défaut à ces valeurs.
tr_tr: ``B`` ve ``zeta`` için ``2.0`` ve ``0.7`` kazançları, tüm birimler metre cinsinden olduğunda istenen sonuçları üretmek için tekrar tekrar test edilmiştir. Bu nedenle, ``RamseteController`` için sıfır bağımsız değişkenli bir kurucu, bu değerlere varsayılan kazançlarla birlikte mevcuttur.
zh_cn: 当所有单位均以米为单位时，对b和zeta的增益分别为2.0和0.7进行了反复测试，以产生理想的结果。这样，``RamseteController''的零参数构造函数就存在，其增益默认为这些值。

source: Getting Adjusted Velocities
es_mx: Obtener velocidades ajustadas
fr_ca: Obtention de vitesses ajustées
tr_tr: Ayarlanmış Hızları Alma
zh_cn: 调整速度

source: The Ramsete controller returns "adjusted velocities" so that the when the robot tracks these velocities, it accurately reaches the goal point. The controller should be updated periodically with the new goal. The goal comprises of a desired pose, desired linear velocity, and desired angular velocity. Furthermore, the current position of the robot should also be updated periodically. The controller uses these four arguments to return the adjusted linear and angular velocity. Users should command their robot to these linear and angular velocities to achieve optimal trajectory tracking.
es_mx: El controlador Ramsete devuelve "velocidades ajustadas" de modo que cuando el robot rastrea estas velocidades, alcanza con precisión el punto objetivo. El controlador debe actualizarse periódicamente con el nuevo objetivo. El objetivo comprende una pose deseada, una velocidad lineal deseada y una velocidad angular deseada. Además, la posición actual del robot también debe actualizarse periódicamente. El controlador usa estos cuatro argumentos para devolver la velocidad lineal y angular ajustada. Los usuarios deben ordenar a su robot estas velocidades lineales y angulares para lograr un seguimiento de trayectoria óptimo.
fr_ca: Le contrôleur Ramsete renvoie des «vitesses ajustées» de sorte que lorsque le robot respecte ces vitesses, il atteint avec précision le point cible. Le contrôleur doit être mis à jour périodiquement avec le nouvel objectif. Le point cible comprend une pose souhaitée, une vitesse linéaire souhaitée et une vitesse angulaire souhaitée. De plus, la position actuelle du robot doit également être mise à jour périodiquement. Le contrôleur utilise ces quatre arguments pour renvoyer la vitesse linéaire et angulaire ajustée. Les utilisateurs doivent commander leur robot à ces vitesses linéaires et angulaires pour obtenir un suivi de trajectoire optimal.
tr_tr: Ramsete kontrolörü, robot bu hızları takip ettiğinde hedef noktasına doğru bir şekilde ulaşması için "ayarlanmış hızları" geri döndürür. Denetleyici, yeni hedefle periyodik olarak güncellenmelidir. Hedef, istenen bir pose, istenen doğrusal hız ve istenen açısal hızdan oluşur. Ayrıca robotun mevcut konumu da periyodik olarak güncellenmelidir. Kontrolör, ayarlanmış doğrusal ve açısal hızı döndürmek için bu dört argümanı kullanır. Kullanıcılar, optimum yörünge takibini elde etmek için robotlarına bu doğrusal ve açısal hızlara kumanda etmelidir.
zh_cn: Ramsete控制器返回“已调整的速度”，以便当机器人跟踪这些速度时，它可以精确地达到目标点。应使用新目标定期更新控制器。目标包括期望的姿势，期望的线速度和期望的角速度。此外，机器人的当前位置也应定期更新。控制器使用这四个参数返回调整后的线速度和角速度。用户应命令机器人以这些线性和角速度实现最佳轨迹跟踪。

source: The "goal pose" represents the position that the robot should be at at a particular timestep when tracking the trajectory. It does NOT represent the final endpoint of the trajectory.
es_mx: La "pose del objetivo" representa la posición en la que el robot debe estar en un paso de tiempo particular al rastrear la trayectoria. NO representa el punto final de la trayectoria.
fr_ca: La "pose d'objectif" (goal pose) représente la position à laquelle le robot doit se trouver à un moment particulier lors du suivi de la trajectoire. Il ne représente PAS le point final de la trajectoire.
tr_tr: "goal pose" Hedef pozu, yörüngeyi izlerken robotun belirli bir zaman diliminde olması gereken konumu temsil eder. Yörüngenin son son noktasını temsil ETMEZ.
zh_cn: “目标姿势”表示机器人在跟踪轨迹时应处于特定时间步的位置。它不代表轨迹的最终终点。

source: The controller can be updated using the ``Calculate`` (C++) / ``calculate`` (Java) method. There are two overloads for this method. Both of these overloads accept the current robot position as the first parameter. For the other parameters, one of these overloads takes in the goal as three separate parameters (pose, linear velocity, and angular velocity) whereas the other overload accepts a ``Trajectory.State`` object, which contains information about the goal pose. For its ease, users should use the latter method when tracking trajectories.
es_mx: El controlador se puede actualizar utilizando el método ``Calculate`` (C++) / ``calculate`` (Java). Hay dos sobrecargas para este método. Ambas sobrecargas aceptan la posición actual del robot como primer parámetro. Para los otros parámetros, una de estas sobrecargas toma el objetivo como tres parámetros separados (pose, velocidad lineal y velocidad angular) mientras que la otra sobrecarga acepta un objeto ``Trajectory.State``, que contiene información sobre la pose del objetivo. Por su facilidad, los usuarios deben utilizar el último método al rastrear trayectorias.
fr_ca: Le contrôleur peut être actualisé à partir de la méthode ``Calculate`` (C++) / ``calculate`` (Java). Il existe deux surcharges (overloads) pour cette méthode. Ces deux surcharges acceptent la position actuelle du robot comme premier paramètre. Pour les autres paramètres, l'une de ces surcharges prend l'objectif comme trois paramètres distincts (pose, vitesse linéaire et vitesse angulaire) tandis que l'autre surcharge accepte un objet ``Trajectory.State``, qui contient des informations sur la pose de l'objectif. Comme elle est plus facile d'utilisation, nous recommendons cette dernière méthode lors du suivi des trajectoires.
tr_tr: Kontrolör, ``Calculate`` (C++) / ``calculate`` (Java) yöntemi kullanılarak güncellenebilir. Bu yöntem için iki aşırı yük vardır. Bu aşırı yüklerin her ikisi de mevcut robot konumunu ilk parametre olarak kabul eder. Diğer parametreler için, bu aşırı yüklerden biri hedefi üç ayrı parametre (pose, doğrusal hız ve açısal hız) olarak alırken, diğer aşırı yük, hedef pose hakkında bilgi içeren bir ``Trajectory.State`` nesnesini kabul eder. Kolaylık için, kullanıcılar yörüngeleri izlerken ikinci yöntemi kullanmalıdır.
zh_cn: 可以使用Calculate（C ++）/ calculate（Java）方法更新控制器。此方法有两个重载。这两个过载都将当前机器人位置作为第一个参数。对于其他参数，这些重载之一将目标作为三个单独的参数（姿态，线速度和角速度）接收，而另一个重载接受“ Trajectory.State”对象，其中包含有关目标姿态的信息。为了简便起见，用户在跟踪轨迹时应使用后一种方法。

source: These calculations should be performed at every loop iteration, with an updated robot position and goal.
es_mx: Estos cálculos deben realizarse en cada iteración de bucle, con una posición y un objetivo actualizados del robot.
fr_ca: Ces calculs doivent être effectués à chaque itération de boucle, avec une position et un objectif du robot mis à jour.
tr_tr: Bu hesaplamalar, güncellenmiş bir robot konumu ve hedefi ile her döngü yinelemesinde gerçekleştirilmelidir.
zh_cn: 这些计算应在每次循环迭代时执行，并具有更新的机器人位置和目标

source: Using the Adjusted Velocities
es_mx: Usando las velocidades ajustadas
fr_ca: Utilisation des vitesses ajustées
tr_tr: Ayarlanmış Hızları Kullanma
zh_cn: 使用调整后的速度

source: The adjusted velocities are of type ``ChassisSpeeds``, which contains a ``vx`` (linear velocity in the forward direction), a ``vy`` (linear velocity in the sideways direction), and an ``omega`` (angular velocity around the center of the robot frame). Because the Ramsete controller is a controller for non-holonomic robots (robots which cannot move sideways), the adjusted speeds object has a ``vy`` of zero.
es_mx: Las velocidades ajustadas son del tipo ``ChassisSpeeds``, que contiene un ``vx`` (velocidad lineal en la dirección de avance), una ``vy`` (velocidad lineal en la dirección lateral) y un ``omega`` (velocidad angular alrededor del centro del marco del robot). Debido a que el controlador Ramsete es un controlador para robots no holonómicos (robots que no pueden moverse hacia los lados), el objeto de velocidades ajustadas tiene una ``vy`` de cero.
fr_ca: Les vitesses ajustées sont de type ``ChassisSpeeds``, qui contient un ``vx`` (vitesse linéaire dans la direction avant), un ``vy`` (vitesse linéaire dans la direction latérale) et un ``omega`` (vitesse angulaire autour du centre du châssis du robot). Étant donné que le contrôleur Ramsete est un contrôleur pour les robots non holonomiques (robots qui ne peuvent pas se déplacer latéralement), l'objet à vitesses ajustées a un ``vy`` de zéro.
tr_tr: Ayarlanan hızlar, bir ``vx`` (ileri yönde doğrusal hız), bir ``vy`` (yan yönde doğrusal hız) ve bir ``omega`` (robot çerçevesinin merkezi etrafındaki açısal hız) içeren ``ChassisSpeeds`` tipindedir . Ramsete denetleyicisi, holonomik olmayan robotlar (yanlara doğru hareket edemeyen robotlar) için bir denetleyici olduğundan, ayarlanmış hız nesnesinin sıfır ``vy`` değeri vardır.
zh_cn: 调整后的速度为``ChassisSpeeds''类型，其中包含``vx''（向前方向的线速度），``vy''（横向方向的线速度）和``omega'' `（围绕机器人框架中心的角速度）。由于Ramsete控制器是用于非完整机器人（不能侧向移动的机器人）的控制器，因此调整后的速度对象的``vy''为零。

source: The returned adjusted speeds can be converted to usable speeds using the kinematics classes for your drivetrain type. For example, the adjusted velocities can be converted to left and right velocities for a differential drive using a ``DifferentialDriveKinematics`` object.
es_mx: Las velocidades ajustadas de regreso pueden ser convertidas a velocidades para usar utilizando las clases cinemáticas para el tipo de chasis. Por ejemplo, las velocidades ajustadas pueden convertirse en velocidades de derecha e izquierda para un manejo diferencial usando el objeto ``DifferentialDriveKinematics``.
fr_ca: Les vitesses ajustées renvoyées peuvent être converties en vitesses utilisables en utilisant les classes cinématiques pour votre type de transmission. Par exemple, les vitesses ajustées peuvent être converties en vitesses gauche et droite pour un entraînement différentiel à l'aide d'un objet ``DifferentialDriveKinematics``.
tr_tr: Döndürülen ayarlanmış hızlar, aktarma sistemi tipiniz için kinematik sınıfları kullanılarak kullanılabilir hızlara dönüştürülebilir. Örneğin, ayarlanmış hızlar, bir ``DifferentialDriveKinematics`` nesnesi kullanılarak bir diferansiyel sürücü için sol ve sağ hızlara dönüştürülebilir.
zh_cn: 可以使用适用于您的传动系统类型的运动学类将返回的调整速度转换为可用速度。例如，可以使用``DifferentialDriveKinematics''对象将差速器的调整速度转换为左右速度。

source: Because these new left and right velocities are still speeds and not voltages, two PID Controllers, one for each side may be used to track these velocities. Either the WPILib PIDController (`C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDController.html>`_, `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`_) can be used, or the Velocity PID feature on smart motor controllers such as the TalonSRX and the SPARK MAX can be used.
es_mx: Debido a que estas nuevas velocidades izquierda y derecha siguen siendo velocidades y no tensiones, se pueden utilizar dos controladores PID, uno para cada lado, para seguir estas velocidades. Se puede utilizar el controlador PID de WPILib (`C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PIDController.html>`_, `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/controller/PIDController.html>`_), o la función PID de velocidad de los controladores de motor inteligentes como el TalonSRX y el SPARK MAX.

source: Ramsete in the Command-Based Framework
es_mx: Ramsete en el Framework con base comando
fr_ca: Ramsete dans un environnement basé sur les commandes (Command -based Framework)
tr_tr: Komut Tabanlı Çerçevede - Command-Based Framework Ramsete
zh_cn: 基于命令的框架中的Ramsete

source: For the sake of ease for users, a ``RamseteCommand`` class is built in to WPILib. For a full tutorial on implementing a path-following autonomous using RamseteCommand, see :ref:`docs/software/examples-tutorials/trajectory-tutorial/index:Trajectory Tutorial`.
es_mx: Con motivos de facilitar a los usuarios, la clase ``RamseteCommand`` está contruida en WPILab. PAra un tutorial completo en la implementación de un autónomo que siga un camino usando RamseteCommand, vea :ref:`docs/software/examples-tutorials/trajectory-tutorial/index:Trajectory Tutorial`.
tr_tr: Kullanıcılar için kolaylık sağlamak amacıyla, WPILib'e bir ``RamseteCommand`` sınıfı dahil edilmiştir. RamseteCommand kullanarak bir yolu takip eden otonom uygulama hakkında tam bir eğitim için bkz :ref:`docs/software/examples-tutorials/trajectory-tutorial/index:Trajectory Tutorial`.

source: Because these new left and right velocities are still speeds and not voltages, two PID Controllers, one for each side may be used to track these velocities. Either the WPILib PIDController (`C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_p_i_d_controller.html>`_, `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/controller/PIDController.html>`_) can be used, or the Velocity PID feature on smart motor controllers such as the TalonSRX and the SPARK MAX can be used.
fr_ca: Étant donné que ces nouvelles vitesses gauche et droite sont toujours des vitesses et non des tensions, deux contrôleurs PID, un pour chaque côté, peuvent être utilisés pour suivre ces vitesses. Soit le PIDController WPILIb (`C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1_p_i_d_controller.html>`_, `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/math/controller/PIDController.html>`_) peut être utilisé, ou alors la fonction Velocity PID sur des contrôleurs de moteurs intelligents tels que le TalonSRX et le SPARK MAX.

source: For the sake of ease for users, a ``RamseteCommand`` class is built in to WPILib. For a full tutorial on implementing a path-following autonomous using RamseteCommand, see :ref:`docs/software/pathplanning/trajectory-tutorial/index:Trajectory Tutorial`.
fr_ca: Par souci de facilité pour les utilisateurs, une classe ``RamseteCommand`` est intégrée à WPILib. Pour un didacticiel complet sur la mise en œuvre d'un mode autonome qui suit une trajectoire précise à l'aide de RamseteCommand, voir :ref:`docs/software/pathplanning/trajectory-tutorial/index:Trajectory Tutorial`.
