Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/trajectories/trajectory-generation.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: The more complex overload accepts "control vectors" for splines. This method is used when generating trajectories with Pathweaver, where you are able to control the magnitude of the tangent vector at each point. The ``ControlVector`` class consists of two ``double`` arrays. Each array represents one dimension (x or y), and its elements represent the derivatives at that point. For example, the value at element 0 of the ``x`` array represents the x coordinate (0th derivative), the value at element 1 represents the 1st derivative in the x dimension and so on.
es_mx: La sobrecarga más compleja acepta "vectores de control" para los splines. Este método se utiliza cuando se generan trayectorias con Pathweaver, en las que se puede controlar la magnitud del vector tangente en cada punto. La clase ``ControlVector`` consiste de dos arreglos "dobles". Cada arreglo representa una dimensión (x o y), y sus elementos representan las derivadas en ese punto. Por ejemplo, el valor en el elemento 0 de la matriz ``x`` representa la coordenada x (0ª derivada), el valor en el elemento 1 representa la 1ª derivada en la dimensión x y así sucesivamente.
fr_ca: La surcharge qui est plus complexe accepte les "vecteurs de contrôle" pour les Splines. Cette méthode est utilisée lors de la génération de trajectoires avec "Pathweaver", où vous pouvez contrôler l'amplitude du vecteur tangent à chaque point. La classe ``ControlVector`` se compose de deux tableaux ``double``. Chaque tableau représente une dimension (x ou y) et ses éléments représentent les dérivées à ce point. Par exemple, la valeur à l'élément 0 du tableau ``x`` représente la coordonnée x (dérivée 0), la valeur à l'élément 1 représente la dérivée 1 dans la dimension x et ainsi de suite.
tr_tr: Daha karmaşık aşırı yük, spline'lar için "kontrol vektörlerini-control vectors" kabul eder. Bu yöntem, her noktada teğet vektörün büyüklüğünü kontrol edebileceğiniz Pathweaver ile yörüngeler oluştururken kullanılır. `` ControlVector`` sınıfı iki `` çift`-double`` diziden oluşur. Her dizi bir boyutu (x veya y) temsil eder ve onun elemanları bu noktadaki türevleri temsil eder. Örneğin, `` x`` dizisinin 0 öğesindeki değer x koordinatını (0. türev), 1. öğedeki değer x boyutundaki 1. türevi temsil eder ve bu böyle devam eder.
zh_cn: 更复杂的重载接受样条曲线的“控制向量”。在使用Pathweaver生成轨迹时可以使用此方法，在该轨迹中，您可以控制每个点处切线向量的大小。 ControlVector类由两个double数组组成。每个数组表示一个维度（x或y），其元素表示该点的导数。例如，``x''数组的元素0处的值表示x坐标（第0导数），元素1处的值表示x维度上的一阶导数，依此类推。

source: When using clamped cubic splines, the length of the array must be 2 (0th and 1st derivatives), whereas when using quintic splines, the length of the array should be 3 (0th, 1st, and 2nd derivative). Unless you know exactly what you are doing, the first and simpler method is HIGHLY recommended for manually generating trajectories. (i.e. when not using Pathweaver JSON files).
es_mx: Al usarse clamped cubic splines, la longitud de la matriz debe ser 2 (0ª y 1ª derivadas), mientras que cuando se utilizan quintic splines, la longitud del conjunto debe ser 3 (0ª, 1ª y 2ª derivadas). A menos que sepas exactamente lo que estás haciendo, el primer y más simple método es ALTAMENTE recomendado para generar trayectorias manualmente. (es decir, cuando no se utilizan los archivos JSON de Pathweaver).
fr_ca: Lorsque vous utilisez des Splines cubiques, la taille du tableau doit permettre 2 éléments (dérivées 0 et 1), tandis que lorsque vous utilisez des Splines quintiques, la longueur du tableau doit être 3 (dérivée 0, 1 et 2). À moins que vous ne sachiez exactement ce que vous faites, la première méthode (et la plus simple) est FORTEMENT recommandée pour générer manuellement des trajectoires. (c'est-à-dire lorsque vous n'utilisez pas de fichiers JSON Pathweaver).
tr_tr: Sabitlenmiş kübik spline'lar kullanılırken, dizinin uzunluğu 2 (0. ve 1. türevler) olmalıdır, oysa beşli spline'lar kullanılırken, dizinin uzunluğu 3 (0., 1. ve 2. türev) olmalıdır. Tam olarak ne yaptığınızı bilmiyorsanız, yörüngeleri manuel olarak oluşturmak için ilk ve daha basit yöntem ŞİDDETLE önerilir. (yani Pathweaver JSON dosyalarını kullanmadığınızda).
zh_cn: 使用钳制三次样条曲线时，数组的长度必须为2（0和1的导数），而使用五次样条曲线时，数组的长度应为3（0、1和2的导数）。除非您确切地知道自己在做什么，否则强烈建议您使用第一种更简单的方法来手动生成轨迹。 （即不使用Pathweaver JSON文件时）。

source: Here is an example of generating a trajectory using clamped cubic splines for the 2018 game, FIRST Power Up:
es_mx: Aquí hay un ejemplo de cómo generar una trayectoria usando clamped cubic splines para el juego de 2018, FIRST Power Up.
fr_ca: Voici un exemple de génération d'une trajectoire à l'aide de splines cubiques serrées pour le jeu 2018, FIRST Power Up:
tr_tr: 2018 oyunu FIRST Power Up için sabitlenmiş kübik eğriler kullanarak bir yörünge oluşturmanın bir örneği:
zh_cn: 这是为2018年游戏FIRST Power Up使用艾尔米特的三次方生成轨迹的示例：

source: The Java code utilizes the `Units <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/util/Units.html>`_ utility, which was added to WPILib in 2020 for easy unit conversions.
fr_ca: Le code Java utilise l'utilitaire`Units <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/util/Units.html>`_, qui a été ajouté à WPILib en 2020 pour des conversions d'unités faciles.
zh_cn: Java代码利用`Units <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/util/Units.html>`程序，该实用程序于2020年添加到WPILib中，以方便进行单位转换。

source: Even though this trajectory generation is orders of magnitude faster than Pathfinder, it is highly recommended to generate all trajectories on startup (``robotInit``) as the generation time is still not negligible. Generation time often ranges from 10 ms to 25 ms for each trajectory.
fr_ca: Même si cette génération de trajectoire est beaucoup plus rapide que Pathfinder, il est fortement recommandé de générer toutes les trajectoires au démarrage (``robotInit``) car le temps de génération n'est toujours pas négligeable. Le temps de génération varie souvent de 10 mSec à 25 mSec pour chaque trajectoire.
zh_cn: 尽管此轨迹生成比Pathfinder快几个数量级，但强烈建议在启动时生成所有轨迹（``robotInit``），因为生成时间仍然可以忽略不计。每个轨迹的生成时间通常在10毫秒至25毫秒之间。

source: Concatenating Trajectories
fr_ca: Concaténation des trajectoires

source: Trajectories in Java can be combined into a single trajectory using the ``concatenate(trajectory)`` function. C++ users can simply add (``+``) the two trajectories together.
fr_ca: Les trajectoires en Java peuvent être combinées en une seule trajectoire à l’aide de la fonction ``concatenate(trajectory)``. Les utilisateurs de C++ peuvent simplement additionner (``+``) les deux trajectoires ensemble.

source: It is up to the user to ensure that the end of the initial and start of the appended trajectory match. It is also the user's responsibility to ensure that the start and end velocities of their trajectories match.
fr_ca: Il appartient à l’utilisateur de s’assurer que la fin de la trajectoire initiale et le début de la trajectoire ajoutée correspondent. Il est également de la responsabilité de l’utilisateur de s’assurer que les vitesses de début et de fin de ses trajectoires correspondent.

source: ``setStartVelocity(double startVelocityMetersPerSecond)`` (Java) / ``SetStartVelocity(units::meters_per_second_t startVelocity)`` (C++)
tr_tr: ``setStartVelocity (double startVelocityMetersPerSecond) '' (Java) / `` SetStartVelocity (units :: meter_per_second_t startVelocity)`` (C ++)

source: ``setEndVelocity(double endVelocityMetersPerSecond)`` (Java) / ``SetEndVelocity(units::meters_per_second_t endVelocity)`` (C++)
tr_tr: ``setEndVelocity (double endVelocityMetersPerSecond) '' (Java) / `` SetEndVelocity (units :: meter_per_second_t endVelocity)`` (C ++)

source: ``setReversed(boolean reversed)`` (Java) / ``SetReversed(bool reversed)`` (C++)
tr_tr: ``setReversed (boolean tersine çevrildi) `` (Java) / `` SetReversed (bool tersine çevrildi)`` (C ++)

source: ``addConstraint(TrajectoryConstraint constraint)`` (Java) / ``AddConstraint(TrajectoryConstraint constraint)`` (C++)
tr_tr: ``addConstraint (TrajectoryConstraint kısıtlaması) `` (Java) / `` AddConstraint (TrajectoryConstraint kısıtlaması)`` (C ++)
