Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/trajectories/trajectory-generation.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Trajectory Generation
es_mx: Generación de Trayectoria
fr_ca: La génération de trajectoire
tr_tr: Yörünge Üretimi
zh_cn: 轨迹生成

source: The 2020 release of WPILib contains classes that help generating trajectories. A trajectory is a smooth curve, with velocities and accelerations at each point along the curve, connecting two endpoints on the field. Generation and following of trajectories is incredibly useful for performing autonomous tasks. Instead of a simple autonomous routine -- which involves moving forward, stopping, turning 90 degrees to the right, then moving forward -- using trajectories allows for motion along a smooth curve. This has the advantage of speeding up autonomous routines, creating more time for other tasks; and when implemented well, makes autonomous navigation more accurate and precise.
fr_ca: La version 2020 de WPILib contient des classes qui aident à générer des trajectoires. Une trajectoire est une courbe lisse, avec des vitesses et des accélérations à chaque point le long de la courbe, reliant deux points d'extrémité sur le terrain. La génération et le suivi de trajectoires sont incroyablement utiles pour effectuer des tâches autonomes. Au lieu d'une simple routine autonome - qui implique d'avancer, de s'arrêter, de tourner de 90 degrés vers la droite, puis d'avancer - l'utilisation de trajectoires permet de se déplacer le long d'une courbe lisse. Cela a l'avantage d'accélérer les routines autonomes, créant ainsi plus de temps pour d'autres tâches; et lorsqu'il est bien mis en œuvre, rend la navigation autonome plus précise.
zh_cn: 2020年发布的WPILib上包含有助于生成轨迹的类。轨迹是一条平滑的曲线，在曲线的每个点上都有速度和加速度，连接了场上的两个端点。轨迹的生成和跟踪对于自动阶段任务非常有用。代替简单的自动阶段动作-涉及向前移动，停止，向右旋转90度然后向前移动-使用轨迹可以沿着平滑曲线运动。这样做的好处是可以加快自动阶段的执行速度，为其他任务腾出更多时间。如果实施得当，可以使自动阶段更加准确和精确。

source: This article goes over how to generate a trajectory. The next few articles in this series will go over how to actually follow the generated trajectory. There are a few things that your robot must have before you dive into the world of trajectories:
es_mx: Este artículo trata sobre cómo generar una trayectoria. Los próximos artículos de esta serie repasarán cómo seguir realmente la trayectoria generada. Hay algunas cosas que tu robot debe tener antes de sumergirse en el mundo de las trayectorias:
fr_ca: Cet article explique comment générer une trajectoire. Les prochains articles de cette série examineront comment suivre réellement la trajectoire générée. Afin de pouvoir suivre une trajectoire donnée, votre robot doit être capable de faire tout d'abord les mesures suivantes, en utilisant certains senseurs:
tr_tr: Bu makale, bir yörüngenin nasıl oluşturulacağını anlatıyor. Bu dizideki sonraki birkaç makale, oluşturulan yörüngenin gerçekte nasıl izleneceğini ele alacaktır. Yörüngeler dünyasına dalmadan önce robotunuzun sahip olması gereken birkaç şey var:
zh_cn: 本文介绍了如何生成轨迹。本系列的下几篇文章将介绍如何实际遵循生成的轨迹。在深入研究轨迹世界之前，您的机器人必须具备一些条件：

source: A way to measure the position and velocity of each side of the robot. An encoder is the best way to do this; however, other options may include optical flow sensors, etc.
es_mx: Una forma de medir la posición y la velocidad de cada lado del robot. Un codificador es la mejor manera de hacerlo; sin embargo, otras opciones pueden incluir sensores ópticos de flujo, etc.
fr_ca: La mesure de la position et la vitesse de chaque côté du robot. Un encodeur est le meilleur moyen de le faire; cependant, d'autres options peuvent inclure des capteurs optiques de débit (optical flow sensors), etc.
tr_tr: Robotun her iki tarafının konumunu ve hızını ölçmenin bir yolu. Bunu yapmanın en iyi yolu kodlayıcıdır; ancak diğer seçenekler optik akış sensörleri vb. içerebilir.
zh_cn: 一种测量机器人每一边的位置和速度的方法。编码器是实现这一点的最佳方式;然而，其他方法可能包括光流量传感器等。

source: A way to measure the angle or angular rate of the robot chassis. A gyroscope is the best way to do this. Although the angular rate can be calculated using encoder velocities, this method is NOT recommended because of wheel scrubbing.
es_mx: Una forma de medir el ángulo o la velocidad angular del chasis del robot. Un giroscopio es la mejor manera de hacerlo. Aunque la tasa angular puede ser calculada usando las velocidades del codificador, este método NO es recomendado debido al lavado de las ruedas.
fr_ca: Un moyen de mesurer l'angle ou la vitesse angulaire du châssis du robot. Un gyroscope est la meilleure façon de procéder. Bien que la vitesse angulaire puisse être calculée en utilisant les vitesses obtenues par les encodeurs, cette méthode n'est PAS recommandée en raison du glissement éventuel des roues lors d'un virage (Scrubbing).
tr_tr: Robot kasasının açısını veya açısal oranını ölçmenin bir yolu. Bunu yapmanın en iyi yolu jiroskoptur. Açısal hız enkoder hızları kullanılarak hesaplanabilmesine rağmen, bu yöntem tekerlek dönme kaybı nedeniyle ÖNERİLMEZ.
zh_cn: 一种测量机器人底盘的角度或角速度的方法。陀螺仪是做到这一点的最好方法。虽然角速率可以计算使用编码器速度，但这种方法不推荐，因为车轮会刮磨。

source: If you are looking for a simpler way to perform autonomous navigation, see :ref:`the section on driving to a distance <docs/software/hardware-apis/sensors/encoders-software:Driving to a distance>`.
fr_ca: Si vous cherchez un moyen plus simple d'effectuer une navigation autonome, voir :ref:`la section relative au déplacement sur une distance donnée <docs/software/hardware-apis/sensors/encoders-software:Driving to a distance>`.

source: Splines
fr_ca: Courbes d'interpolation (Splines)
tr_tr: Spline'lar - Eğri setleri
zh_cn: 样条函数

source: A spline refers to a set of curves that interpolate between points. Think of it as connecting dots, except with curves. WPILib supports two types of splines: hermite clamped cubic and hermite quintic.
es_mx: Un spline se refiere a un conjunto de curvas que se interpolan entre puntos. Piense en esto como conectar puntos, excepto con las curvas. WPILib apoya dos tipos de splines: cúbico sujetado por la hérmite y quístico sujetado por la hérmite.
fr_ca: (N.D.T. Le mot anglais Spline sera utilisé dans cette section pour alléger le texte). Une Spline fait référence à un ensemble de courbes qui interpolent entre les points. Considérez-les comme des points de connexion, sauf avec des courbes. WPILib prend en charge deux types de Splines: "hermite cubic clamped" et "hermite quintic".
tr_tr: Spline, noktalar arasında enterpolasyon yapan bir dizi eğriyi ifade eder. Eğriler dışında, noktaları birleştiren noktalar olarak düşünün. WPILib iki tür spline'ı destekler: hermit kenetli kübik ve hermit beşli.
zh_cn: 样条曲线是指在点之间插入的一组曲线。可以将其视为连接点，但曲线除外。 WPILib支持两种类型的样条：艾尔米特三次方和艾尔米特五次方。

source: Hermite clamped cubic: This is the recommended option for most users. Generation of trajectories using these splines involves specifying the (x, y) coordinates of all points, and the headings at the start and end waypoints. The headings at the interior waypoints are automatically determined to ensure continuous curvature (rate of change of the heading) throughout.
es_mx: Hermite clamped cubic: Esta es la opción recomendada para la mayoría de los usuarios. La generación de trayectorias utilizando estas splines implica especificar las coordenadas (x, y) de todos los puntos, y los encabezamientos en los puntos de inicio y final. Los encabezamientos en los waypoints interiores se determinan automáticamente para asegurar una curvatura continua (tasa de cambio de rumbo) en todo momento.
fr_ca: "Hermite cubic clamped": C'est l'option recommandée pour la plupart des utilisateurs. La génération de trajectoires à l'aide de ces Splines implique de spécifier les coordonnées (x, y) de tous les points et les caps (direction angulaire) pour les points de départ et de fin. Les changements de cap à l'intérieur de la Spline sont automatiquement calculés pour assurer une courbure continue (taux de changement du cap) sur tout le long du parcours.
tr_tr: Hermite sıkıştırılmış kübik: Bu, çoğu kullanıcı için önerilen seçenektir. Bu eğri çizgiler kullanılarak yörüngelerin oluşturulması, tüm noktaların (x, y) koordinatlarının ve başlangıç ve bitiş yol noktalarındaki başlıkların belirlenmesini içerir. İç yol noktalarındaki başlıklar, sürekli eğriliği (yön değiştirme hızı) sağlamak için otomatik olarak belirlenir.
zh_cn: 艾尔米特三次方：对于大多数用户，建议使用此选项。使用这些样条线生成轨迹涉及指定所有点的（x，y）坐标以及起点和终点的航向。内部航路点的航向会自动确定，以确保始终保持连续的曲率（航向的变化率）。

source: Hermite quintic: This is a more advanced option which requires the user to specify (x, y) coordinates and headings for *all* waypoints. This should be used if you are unhappy with the trajectories that are being generated by the clamped cubic splines or if you want finer control of headings at the interior points.
es_mx: Hermite quintic: Esta es una opción más avanzada que requiere que el usuario especifique coordenadas (x, y) y encabezamientos para *todos* los waypoints. Esto debería utilizarse si no se está satisfecho con las trayectorias que están siendo generadas por las clamped cubic splines o si se desea un control más fino de los encabezamientos en los puntos interiores.
fr_ca: Hermite quintic: Il s'agit d'une option plus avancée qui nécessite que l'utilisateur spécifie les coordonnées (x, y) et les caps (direction angulaire) pour *tous* les points internes au parcours. Cela doit être utilisé si vous n'êtes pas satisfait des trajectoires générées par les Splines cubiques décrites ci-dessus, ou si vous souhaitez un contrôle plus fin des caps sur points intérieurs au parcours.
tr_tr: Hermite quintic: Bu, kullanıcının * tüm * yol noktaları için (x, y) koordinatlarını ve başlıklarını belirtmesini gerektiren daha gelişmiş bir seçenektir. Bu, kenetlenmiş kübik yivlerin oluşturduğu yörüngelerden memnun değilseniz veya iç noktalardaki başlıkların daha iyi kontrolünü istiyorsanız kullanılmalıdır.
zh_cn: 艾尔米特五次方：这是一个更高级的选项，要求用户为所有航路点指定（x，y）坐标和航向。如果对艾尔米特三次方样条曲线生成的轨迹不满意，或者希望对内部点的航向进行更好的控制，则应使用此方法。

source: Splines are used as a tool to generate trajectories; however, the spline itself does not have any information about velocities and accelerations. Therefore, it is not recommended that you use the spline classes directly. In order to generate a smooth path with velocities and accelerations, a *trajectory* must be generated.
es_mx: Los splines son usados como una herramienta para generar trayectorias; sin embargo, el propio spline no tiene ninguna información sobre las velocidades y aceleraciones. Por lo tanto, no se recomienda utilizar las clases de spline directamente. Para generar una trayectoria suave con velocidades y aceleraciones, se debe generar una *trayectoria*.
fr_ca: Les splines sont utilisées comme un outil pour générer des trajectoires; cependant, la spline elle-même n'a aucune information sur les vitesses et les accélérations. Par conséquent, il n'est pas recommandé d'utiliser directement les classes de splines. Afin de générer un chemin lisse avec des vitesses et des accélérations, une *trajectoire* doit être générée.
tr_tr: Spline'lar yörüngeler oluşturmak için bir araç olarak kullanılır; ancak, spline'ın kendisi hızlar ve ivmeler hakkında herhangi bir bilgiye sahip değildir. Bu nedenle, spline sınıflarını doğrudan kullanmanız önerilmez. Hızları ve ivmeleri olan düzgün bir yol oluşturmak için, bir * yörünge * oluşturulmalıdır.
zh_cn: 样条线用作生成轨迹的工具；但是，样条本身没有有关速度和加速度的任何信息。因此，不建议您直接使用样条线类。为了生成具有速度和加速度的平滑路径，必须生成轨迹。

source: Creating the trajectory config
es_mx: Creando la configuración de la trayectoria
fr_ca: La création de la configuration de trajectoire
tr_tr: Yörünge yapılandırmasını oluşturma
zh_cn: 创建轨迹配置

source: A configuration must be created in order to generate a trajectory. The config contains information about special constraints, the max velocity, the max acceleration in addition to the start velocity and end velocity. The config also contains information about whether the trajectory should be reversed (robot travels backward along the waypoints). The ``TrajectoryConfig`` class should be used to construct a config. The constructor for this class takes two arguments, the max velocity and max acceleration. The other fields (``startVelocity``, ``endVelocity``, ``reversed``, ``constraints``) are defaulted to reasonable values (``0``, ``0``, ``false``, ``{}``) when the object is created. If you wish to modify the values of any of these fields, you can call the following methods:
es_mx: Se debe crear una configuración para generar una trayectoria. La configuración contiene información sobre las restricciones especiales, la velocidad máxima, la aceleración máxima además de la velocidad inicial y la velocidad final. La configuración también contiene información sobre si la trayectoria debe ser invertida (el robot viaja hacia atrás a lo largo de los puntos de ruta). La clase ``TrajectoryConfig`` debe ser usada para construir una configuración. El constructor de esta clase toma dos argumentos, la velocidad máxima y la aceleración máxima. Los otros campos (``startVelocity``, ``endVelocity``, ``reversed``, ``constraints``) son predeterminados a valores razonables (``0``, ``0``, ``false``, ``{}``) cuando se crea el objeto. Si desea modificar los valores de cualquiera de estos campos, puede llamar a los siguientes métodos:
fr_ca: Une configuration doit être créée afin de générer une trajectoire. La configuration contient des informations sur les contraintes spéciales, dont la vitesse maximale, l'accélération maximale, en plus de la vitesse de départ et de la vitesse de fin. La configuration contient également des informations sur l'opportunité d'inverser la trajectoire (le robot recule sur certains points internes). La classe ``TrajectoryConfig`` doit être utilisée pour construire une configuration. Le constructeur de cette classe prend deux arguments, la vitesse maximale et l'accélération maximale. Les autres champs (``startVelocity``, ``endVelocity``, ``inversé``, ``contraintes``) ont par défaut des valeurs raisonnables (``0``, ``0``, ``false``, ``{}``) lorsque l'objet est créé. Si vous souhaitez modifier les valeurs de l'un de ces champs, vous pouvez appeler les méthodes suivantes:
tr_tr: Bir yörünge oluşturmak için bir konfigürasyon oluşturulmalıdır. Yapılandırma, başlangıç hızı ve bitiş hızına ek olarak özel kısıtlamalar, maksimum hız, maksimum ivme hakkında bilgi içerir. Yapılandırma ayrıca yörüngenin tersine çevrilmesi gerekip gerekmediği hakkında bilgi içerir (robot yol noktaları boyunca geriye doğru gider). Bir yapılandırma oluşturmak için `` TrajectoryConfig '' sınıfı kullanılmalıdır. Bu sınıfın yapıcısı iki argüman alır: maksimum hız ve maksimum ivme. Diğer alanlar (`` startVelocity '', `` endVelocity '', `` reversed '', `` kısıtlamalar '') varsayılan değerlere (`` 0 '', `` 0 '', `` false` Nesne oluşturulduğunda `,` {} ``). Bu alanlardan herhangi birinin değerlerini değiştirmek isterseniz, aşağıdaki yöntemleri çağırabilirsiniz:
zh_cn: 必须创建配置才能生成轨迹。该配置除了开始速度和结束速度外，还包含有关特殊约束，最大速度，最大加速度的信息。该配置还包含有关是否应该反转轨迹（机器人沿航路点向后移动）的信息。 应该使用“TrajectoryConfig”类来构造配置。此类的构造函数采用两个参数，即最大速度和最大加速度。创建对象时，其他字段(``startVelocity``, ``endVelocity``, ``reversed``, ``constraints``) 默认为合理值(``0``, ``0``, ``false``, ``{}``) 。如果你想修改任何这些字段的值，则可以调用以下方法：

source: The ``reversed`` property simply represents whether the robot is traveling backward. If you specify four waypoints, a, b, c, and d, the robot will still travel in the same order through the waypoints when the ``reversed`` flag is set to ``true``. This also means that you must account for the direction of the robot when providing the waypoints. For example, if your robot is facing your alliance station wall and travels backwards to some field element, the starting waypoint should have a rotation of 180 degrees.
es_mx: La propiedad "invertida" simplemente representa si el robot está viajando hacia atrás. Si especificas cuatro puntos, a, b, c y d, el robot seguirá viajando en el mismo orden a través de los puntos cuando la bandera "invertida" se ponga en "verdadero". Esto también significa que debe tener en cuenta la dirección del robot cuando proporcione los puntos de ruta. Por ejemplo, si su robot está de cara a la pared de la estación de la alianza y viaja hacia atrás a algún elemento del campo, el waypoint inicial debe tener una rotación de 180 grados.
fr_ca: La propriété ``reversed`` représente simplement si le robot recule durant son parcours. Si vous spécifiez quatre points de cheminement, a, b, c et d, le robot continuera de voyager dans le même ordre à travers les points de cheminement lorsque le drapeau ``reversed`` est réglé sur ``true`` (vrai). Cela signifie également que vous devez tenir compte de la direction du robot lorsque vous fournissez les points de cheminement. Par exemple, si votre robot fait face au mur de votre station d'alliance et se déplace vers l'arrière vers un élément situé sur le terrain, le point de cheminement de départ doit avoir une rotation de 180 degrés.
tr_tr: `` Ters-reversed '' özelliği, basitçe robotun geriye doğru hareket edip etmediğini gösterir. Dört yol noktası, a, b, c ve d belirtirseniz, robot, `` ters-reversed`` bayrağı `` doğru-true`` olarak ayarlandığında, yol noktaları boyunca aynı sırayla seyahat edecektir. Bu aynı zamanda, yol noktalarını sağlarken robotun yönünü hesaba katmanız gerektiği anlamına gelir. Örneğin, robotunuz ittifak istasyonu duvarınıza bakıyorsa ve bazı alan unsurlarına geri giderse, başlangıç yol noktasının 180 derece dönüşü olmalıdır.
zh_cn: ``reversed''属性仅表示机器人是否向后移动。如果您指定了四个航路点a，b，c和d，则当“ reversed”标记设置为“ true”时，机器人仍将以相同的顺序通过航路点。这也意味着在提供航路点时必须考虑机器人的方向。例如，如果您的机器人正对着联盟站墙并向后移动到某个场地元素，则起始航路点应旋转180度。

source: Generating the trajectory
es_mx: Generando la trayectoria
fr_ca: La génération de la trajectoire
tr_tr: Yörünge oluşturmak
zh_cn: 生成轨迹

source: The method used to generate a trajectory is ``generateTrajectory(...)``. There are four overloads for this method. Two that use clamped cubic splines and the two others that use quintic splines. For each type of spline, there are two ways to construct a trajectory. The easiest methods are the overloads that accept ``Pose2d`` objects.
es_mx: El método usado para generar una trayectoria es ``generateTrajectory(...)``. Hay cuatro sobrecargas para este método. Dos que usan clamped cubic splines y otras dos que usan quintic splines. Por cada tipo de spline, hay dos formas para construir una trayectoria. Los métodos más sencillos son las sobrecargas que aceptan objetos ``Pose2d``.
fr_ca: La méthode utilisée pour générer une trajectoire est ``generateTrajectory(...)``. Il existe quatre "surcharges" (Overloads) pour cette méthode. Deux qui utilisent des Splines cubiques et les deux autres qui utilisent des splines quintiques. Pour chaque type de Spline, il existe deux façons de construire une trajectoire. Les méthodes les plus simples utilisent des surcharges qui acceptent les objets ``Pose2d``.
tr_tr: Bir yörünge oluşturmak için kullanılan yöntem ``generateTrajectory (...)`` şeklindedir. Bu yöntem için dört aşırı yük vardır. Kenetli kübik spline kullanan iki tanesi ve beşli spline kullanan diğer ikisi. Her bir spline türü için bir yörünge oluşturmanın iki yolu vardır. En kolay yöntemler, ``Pose2d`` nesnelerini kabul eden aşırı yüklemelerdir.
zh_cn: 用于生成轨迹的方法是``generateTrajectory（...）``。此方法有四个重载。其中两个使用夹紧的三次样条曲线，另外两个使用五次样条曲线。对于每种类型的样条，都有两种构造轨迹的方法。最简单的方法是接受“ Pose2d”对象的重载。

source: For clamped cubic splines, this method accepts two ``Pose2d`` objects, one for the starting waypoint and one for the ending waypoint. The method takes in a vector of ``Translation2d`` objects which represent the interior waypoints. The headings at these interior waypoints are determined automatically to ensure continuous curvature. For quintic splines, the method simply takes in a list of ``Pose2d`` objects, with each ``Pose2d`` representing a point and heading on the field.
es_mx: Para los clamped cubic splines, este método acepta dos objetos ``Pose2d``, uno para el punto de inicio y otro para el punto final. El método toma un vector de objetos "Translation2d" que representan los puntos de ruta interiores. Los encabezamientos de estos waypoints interiores se determinan automáticamente para asegurar una curvatura continua. Para las curvas quínticas, el método simplemente toma una lista de objetos ``Pose2d``, con cada ``Pose2d`` representando un punto y un encabezamiento en la cancha.
fr_ca: Pour les Splines cubiques, cette méthode accepte deux objets ``Pose2d``, un pour le point de cheminement de départ et un pour le point de cheminement de fin. La méthode utilise un vecteur d'objets ``Translation2d`` qui représentent les points de cheminement intérieurs. Les caps à ces points intérieurs sont déterminés automatiquement pour assurer une courbure continue. Pour les splines quintiques, la méthode prend simplement une liste d'objets ``Pose2d``, chaque ``Pose2d`` représentant un point et un cap sur le champ.
tr_tr: Kelepçeli kübik eğriler için bu yöntem, biri başlangıç yol noktası ve diğeri bitiş yol noktası için olmak üzere iki ``Pose2d`` nesnesini kabul eder. Yöntem, iç yol noktalarını temsil eden `` Translation2d`` nesnelerinin bir vektörünü alır. Bu iç yol noktalarındaki başlıklar, sürekli eğriliği sağlamak için otomatik olarak belirlenir. Beşli spline'lar için, yöntem basitçe `` Pose2d`` nesnelerinin bir listesini alır ve her bir `` Pose2d`` , bir noktayı ve alandaki başlığı temsil eder.
zh_cn: 对于钳制三次样条曲线，此方法接受两个“ Pose2d”对象，一个对象为起点，另一个为终点。该方法接受代表内部航路点的``Translation2d''对象的向量。这些内部航路点的航向是自动确定的，以确保连续的曲率。对于五次样条曲线，该方法仅获取“ Pose2d”对象的列表，每个“ Pose2d”代表一个点并指向该字段。
