Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/trajectories/transforming-trajectories.po
Languages: es_mx, fr_ca, zh_cn

source: Transforming Trajectories
es_mx: Transformando trayectorias
fr_ca: La transformation des trajectoires
zh_cn: 转变轨迹

source: Trajectories can be transformed from one coordinate system to another and moved within a coordinate system using the ``relativeTo`` and the ``transformBy`` methods. These methods are useful for moving trajectories within space, or redefining an already existing trajectory in another frame of reference.
es_mx: Las trayectorias se pueden transformar de un sistema de coordenadas a otro y moverse dentro de un sistema de coordenadas usando los métodos ``relativeTo`` y ``transformBy``. Estos métodos son útiles para mover trayectorias dentro del espacio o re definir una trayectoria ya existente en otro marco de referencia.
fr_ca: Les trajectoires peuvent être transformées d'un système de coordonnées à un autre et déplacées dans un système de coordonnées à l'aide des méthodes ``relativeTo`` et ``transformBy``. Ces méthodes sont utiles pour déplacer des trajectoires dans l'espace ou redéfinir une trajectoire déjà existante dans un autre cadre de référence.
zh_cn: 可以使用“ relativeTo”和“ transformBy”方法将轨迹从一个坐标系转换为另一个坐标系，并在坐标系内移动。这些方法对于在空间内移动轨迹或在另一个参考系中重新定义已经存在的轨迹很有用。

source: Neither of these methods changes the shape of the original trajectory.
es_mx: Ninguno de estos métodos cambia la forma de la trayectoria original.
fr_ca: Aucune de ces méthodes ne modifie la forme de la trajectoire d'origine.
zh_cn: 这些方法都不能改变原始轨迹的形状。

source: The ``relativeTo`` Method
es_mx: El metodo ``relativeTo``
fr_ca: La méthode ``relativeTo``
zh_cn: ``relativeTo``方法

source: The ``relativeTo`` method is used to redefine an already existing trajectory in another frame of reference. This method takes one argument: a pose, (via a ``Pose2d`` object) that is defined with respect to the current coordinate system, that represents the origin of the new coordinate system.
es_mx: El método ``relativeTo`` es usado para redefinir una trayectoria ya existente en otro marco de referencia. Este método toma un argumento: pose, (objeto dirigido a ``Pose2d``) que es definido respecto al sistema de coordenadas actual , que representa el origen de un nuevo sistema de coordenadas.
fr_ca: La méthode ``relativeTo`` permet de redéfinir une trajectoire déjà existante dans un autre référentiel. Cette méthode prend un argument: une pose, (via un objet ``Pose2d``) qui est définie par rapport au système de coordonnées courant, qui représente l'origine du nouveau système de coordonnées.
zh_cn: ``relativeTo``方法用于在另一个参考系中重新定义一个已经存在的轨迹。该方法采用一个参数：一个姿势（通过“ Pose2d”对象），该姿势是相对于当前坐标系定义的，代表新坐标系的原点。

source: For example, a trajectory defined in coordinate system A can be redefined in coordinate system B, whose origin is at (3, 3, 30 degrees) in coordinate system A, using the ``relativeTo`` method.
es_mx: Por ejemplo, una trayectoria definida en el sistema de coordenadas A se puede redefinir en el sistema de coordenadas B, cuyo origen está en (3, 3, 30 grados) en el sistema de coordenadas A, utilizando el método ``relativeTo``.
fr_ca: Par exemple, une trajectoire définie dans le système de coordonnées A peut être redéfinie dans le système de coordonnées B, dont l’origine est à (3, 3, 30 degrés) dans le système de coordonnées A, en utilisant la méthode ``relativeTo``.
zh_cn: 例如，可以使用``relativeTo''方法在坐标系B中重新定义在A坐标系中定义的轨迹，该坐标系的原点在坐标系A中为（2、2、30度）。

source: Coordinate system representation of the trajectory.
fr_ca: Représentation du système de coordonnées de la trajectoire.

source: In the diagram above, the original trajectory (``aTrajectory`` in the code above) has been defined in coordinate system A, represented by the black axes. The red axes, located at (3, 3) and 30° with respect to the original coordinate system, represent coordinate system B. Calling ``relativeTo`` on ``aTrajectory`` will redefine all poses in the trajectory to be relative to coordinate system B (red axes).
es_mx: En el diagrama de arriba, la trayectoria original (``aTrajectory`` en el código de arriba) se ha definido en el sistema de coordenadas A, representado por los ejes negros. Los ejes rojos, ubicados en (3, 3) y 30 ° con respecto al sistema de coordenadas original, representan el sistema de coordenadas B. Llamar a ``relativeTo`` en ``aTrajectory`` redefinirá todas las poses en la trayectoria para que sean relativas a sistema de coordenadas B (ejes rojos).
fr_ca: Dans le diagramme ci-dessus, la trajectoire originale (``aTrajectory`` dans le code ci-dessus) a été définie dans le système de coordonnées A, représenté par les axes noirs. Les axes rouges, situés à (3, 3) et 30° par rapport au système de coordonnées d’origine, représentent le système de coordonnées B. Appeler ``relativeTo`` sur ``aTrajectory`` redéfinira toutes les poses de la trajectoire pour être par rapport au système de coordonnées B (axes rouges).
zh_cn: 在上图中，原始轨迹（上面代码中的``aTrajectory``）已在坐标系A中定义，由黑轴表示。相对于原始坐标系位于（2,2）和30°的红色轴代表坐标系B. 在``aTrajectory``上调用``relativeTo`` 将重新定义轨迹中的所有姿势，使其相对于坐标系B（红色轴）。

source: The ``transformBy`` Method
es_mx: El método ``transformBy``
fr_ca: La méthode ``transformBy``
zh_cn: ``transformBy`` 方法

source: The ``transformBy`` method can be used to move (i.e. translate and rotate) a trajectory within a coordinate system. This method takes one argument: a transform (via a ``Transform2d`` object) that maps the current initial position of the trajectory to a desired initial position of the same trajectory.
es_mx: El método ``transformBy`` se puede utilizar para mover (es decir, trasladar y rotar) una trayectoria dentro de un sistema de coordenadas. Este método toma un argumento: una transformación (a través de un objeto ``Transform2d``) que mapea la posición inicial actual de la trayectoria a una posición inicial deseada de la misma trayectoria.
fr_ca: La méthode ``transformBy`` peut être utilisée pour déplacer (c'est-à-dire traduire et faire pivoter) une trajectoire dans un système de coordonnées. Cette méthode prend un seul argument: soit une transformation (via un objet ``Transform2d``) qui mappe la position initiale actuelle de la trajectoire à une position initiale souhaitée de la même trajectoire.
zh_cn: 可以使用``transformBy''方法在坐标系内移动（即平移和旋转）轨迹。此方法有一个参数：一个转换（通过“ Transform2d”对象），该转换将轨迹的当前初始位置映射到同一轨迹的所需初始位置。

source: For example, one may want to transform a trajectory that begins at (2, 2, 30 degrees) to make it begin at (4, 4, 50 degrees) using the ``transformBy`` method.
es_mx: Por ejemplo, uno puede querer transformar una trayectoria que comienza en (2, 2, 30 grados) para que comience en (4, 4, 50 grados) usando el método ``transformBy``.
fr_ca: Par exemple, on peut vouloir transformer une trajectoire qui commence à (2, 2, 30 degrés) pour la faire commencer à (4, 4, 50 degrés) en utilisant la méthode ``transformBy``.
zh_cn: 例如，您可能想使用``transformBy''方法将以（2、2、30度）开始的轨迹转换为以（4、4、50度）开始的轨迹。

source: Coordinate system plot of a transformed trajectory.
fr_ca: Tracé du système de coordonnées d’une trajectoire transformée.

source: In the diagram above, the original trajectory, which starts at (2, 2) and at 30° is visible in blue. After applying the transform above, the resultant trajectory's starting location is changed to (4, 4) at 50°. The resultant trajectory is visible in orange.
es_mx: En el diagrama de arriba, la trayectoria original, que comienza en (2, 2) y en 30 °, es visible en azul. Después de aplicar la transformación anterior, la ubicación inicial de la trayectoria resultante se cambia a (4, 4) a 50 °. La trayectoria resultante es visible en naranja.
fr_ca: Dans le diagramme ci-dessus, la trajectoire d'origine, qui commence à (2, 2) et à 30 ° est visible en bleu. Après avoir appliqué la transformation ci-dessus, l'emplacement de départ de la trajectoire résultante est changé en (4, 4) à 50 °. La trajectoire résultante est visible en orange.
zh_cn: 在上图中，以（2，2）和30°开始的原始轨迹显示为蓝色。在应用上面的变换之后，合成轨迹的起始位置在50°处更改为（4，4）。生成的轨迹以橙色显示。
