Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/trajectories/troubleshooting.po
Languages: es_mx, fr_ca, he_il, tr_tr, zh_cn

source: Troubleshooting
es_mx: Solución de problemas
fr_ca: Dépannage
he_il: פתרון בעיות
tr_tr: Sorun giderme
zh_cn: 故障排除

source: Troubleshooting Complete Failures
es_mx: Solución a fallas totales
fr_ca: Dépannage des échecs complets
he_il: פתרון כשלונות מוחלטים
tr_tr: Tam Arızaların Giderilmesi
zh_cn: 排除完全故障

source: There are a number of things that can cause your robot to do completely the wrong thing. The below checklist covers some common mistakes.
es_mx: Hay algunas cosas que pueden causar una falla total en tu robot. La lista inferior cubre algunos de estos errores comunes.
fr_ca: Il y a un certain nombre de choses qui peuvent amener votre robot à complètement avoir le mauvais comportement. La liste de vérification ci-dessous couvre les erreurs les plus courantes.
he_il: יש כמה דברים שיכולים לגרום לרובוט לעשות דבר לגמרי לא נכון. הרשימה למטה עוברת על כמה טעויות נפוצות.
tr_tr: Robotunuzun tamamen yanlış bir şey yapmasına neden olabilecek birkaç şey vardır. Aşağıdaki kontrol listesi bazı yaygın hataları kapsamaktadır.
zh_cn: 有很多事情会导致你的机器人做完全错误的事情。下面的清单包含了一些常见的错误。

source: My robot doesn't move.
es_mx: Mi robot no se mueve
fr_ca: Mon robot ne bouge pas.
he_il: הרובוט לא זז.
tr_tr: Robotum hareket etmiyor.
zh_cn: 我的机器人不动了

source: Are you actually outputting to your motors?
es_mx: ¿En verdad esta dando energía a sus motores?
fr_ca: Produisez-vous réellement vos moteurs?
he_il: האם אתם באמת כותבים למנועים?
tr_tr: Gerçekten motorlarınıza çıktı mı veriyorsunuz?
zh_cn: 你真的在输出给你的马达输出吗?

source: Is a ``MalformedSplineException`` getting printed to the driver station? If yes, go to the ``MalformedSplineException`` section below.
es_mx: Si a usted le esta apareciendo el mensaje ``MalformedSplineException`` en la driver station, vaya a la sección ``MalformedSplineException``
fr_ca: Une ``MalformedSplineException`` est-elle imprimée sur le poste de conduite? Si oui, passez à la section ``MalformedSplineException`` ci-dessous.
he_il: האם מודפס ``MalformedSplineException`` ל-Driver Station? אם כן, הסתכלו בקטע ``MalformedSplineException`` למטה.
tr_tr: Sürücü istasyonuna bir ``MalformedSplineException`` yazdırılıyor mu? Evet ise, aşağıdaki ``MalformedSplineException`` bölümüne gidin.
zh_cn: driver station是否出现了MalformedSplineException？如果是，请转到下面有关MalformedSplineException的部分。

source: Is your trajectory very short or in the wrong units?
es_mx: ¿Su trayectoria es muy corta o está en unidades equivocadas?
fr_ca: Votre trajectoire est-elle très courte ou dans les mauvaises unités?
he_il: האם המסלול קצר מאוד או ביחידות שגויות?
tr_tr: Yörüngeniz çok kısa mı yoksa yanlış birimlerde mi?
zh_cn: 您的轨迹是否太短或有单位错误？

source: My robot swings around to drive the trajectory facing the other direction.
es_mx: Mi robot gira alrededor para conducir la trayectoria en la otra dirección
fr_ca: Mon robot pivote pour suivre la trajectoire dans l'autre sens.
tr_tr: Robotum, yörüngeyi diğer yöne bakacak şekilde sürmek için dönüyor.
zh_cn: 我的机器人沿着轨迹移动却不停摆动，朝向另一个方向。

source: Are the start and end headings of your trajectory wrong?
es_mx: ¿Son incorrectas las orientaciones inicial y final de tu trayectoria?
fr_ca: Les titres de début et de fin de votre trajectoire sont-ils incorrects?
tr_tr: Yörüngenizin başlangıç ve bitiş yörüngeleri yanlış mı?
zh_cn: 轨迹的起点和终点的朝向是否有错误？

source: Is your robot's gyro getting reset to the wrong heading?
es_mx: ¿El giróscopo de su robot se restablece al rumbo incorrecto?
fr_ca: Le gyroscope de votre robot est-il réinitialisé dans la mauvaise direction?
tr_tr: Robotunuzun jiroskopu yanlış yöne mi sıfırlanıyor?
zh_cn: 你的机器人陀螺仪是否重置了错误的方向？

source: :ref:`Do you have the reverse flag set incorrectly? <docs/software/advanced-controls/trajectories/trajectory-generation:Creating the trajectory config>`
es_mx: :ref:`¿Tiene la bandera de reversa configurada incorrectamente?<docs/software/advanced-controls/trajectories/trajectory-generation:Creating the trajectory config>`
fr_ca: :ref:`Avez-vous le drapeau inversé mal réglé? <docs/software/advanced-controls/trajectories/trajectory-generation:Creating the trajectory config>`
tr_tr: :ref:`Ters bayrağı yanlış mı ayarlanmış? <docs/software/advanced-controls/trajectories/trajectory-generation:Creating the trajectory config>`
zh_cn: 你是否将reverse flag错误设置？

source: Are your gyro angles clockwise positive? If so, you should negate them.
es_mx: Si los ángulos de giro son positivos asegúrese de cambiarlos a negativo.
fr_ca: Vos angles gyroscopiques sont-ils positifs dans le sens horaire? Si oui, vous devez inverser le signe (nouvel angle = 0 - angle gyro).
tr_tr: Gyro açılarınız saat yönünde pozitif mi? Eğer öyleyse, onları reddetmelisiniz.
zh_cn: 陀螺仪角度是设定顺时针为正吗？如果是这样，则应该反过来。

source: My robot just drives in a straight line even though it should turn.
es_mx: Mi robot simplemente conduce en línea recta aunque debería girar.
fr_ca: Mon robot roule en ligne droite même s'il doit tourner.
he_il: הרובוט רק נוסע בקו ישר למרות שהוא אמור לפנות.
tr_tr: Robotum dönmesi gerekmesine rağmen sadece düz bir çizgide ilerliyor.
zh_cn: 我的机器人只是沿着直线行驶，即使它应该转弯。

source: Is your gyro set up correctly and returning good data?
es_mx: ¿Su giróscopo está configurado correctamente y devuelve buenos datos?
fr_ca: Votre gyroscope est-il correctement configuré et renvoie-t-il de bonnes données?
he_il: האם הג׳יירו (Gyro) מחובר נכון ומחזיר מידע תקין?
tr_tr: Gyro'nuz doğru bir şekilde kurulmuş ve iyi veriler döndürüyor mu?
zh_cn: 你的陀螺仪是否设置正确并返回好的数据?

source: Are you passing your gyro heading to your odometry object with the correct units?
es_mx: ¿Está pasando su giróscopo rumbo a su objeto de odometría con las unidades correctas?
fr_ca: Utilisez-vous les bonnes unités de mesure lorsque vous passez votre cap gyroscopique à votre objet odométrique ?
tr_tr: Gyro başlığınızı odometri nesnenize doğru birimlerle mi geçiriyorsunuz?
zh_cn: 你是否使用正确的单位将陀螺仪航向传递到里程表对象？

source: Is your track width correct? Is it in the correct units?
es_mx: ¿Es correcto el ancho de su ruta? ¿Está en las unidades correctas?
fr_ca: La largeur spécifiée de votre robot (track width) est-elle correcte? Est-ce dans les bonnes unités?
tr_tr: İz genişliğiniz doğru mu? Doğru birimlerde mi?
zh_cn: 轨道宽度正确吗？它的单位正确吗？

source: I get a ``MalformedSplineException`` printout on the driver station and the robot doesn't move.
es_mx: Apareció el mensaje ``MalformedSplineException`` impreso en la driver station y el robot no se mueve
fr_ca: Je reçois un message ``MalformedSplineException`` sur le poste de pilotage et le robot ne bouge pas.
he_il: ``MalformedSplineException`` מודפס ל-Driver Station והרובוט לא זז.
tr_tr: Sürücü istasyonunda bir ``MalformedSplineException`` çıktısı alıyorum ve robot hareket etmiyor.
zh_cn: 我的driver station显示“MalformedSplineException”，但是机器人不动。

source: Do you have two waypoints very close together with approximately opposite headings?
es_mx: ¿Tiene dos coordenadas muy cercas con grados aproximadamente opuestos?
fr_ca: Avez-vous deux points de cheminement très proches l'un de l'autre avec des caps diamétralement opposés?
tr_tr: Yaklaşık olarak zıt başlıklarla birbirine çok yakın iki ara noktanız var mı?
zh_cn: 你是否有两个航路点非常接近且朝向相反？

source: Do you have two waypoints with the same (or nearly the same) coordinates?
es_mx: ¿Tiene dos puntos con las mismas(o casi las mismas) coordenadas?
fr_ca: Avez-vous deux points de cheminement avec les mêmes (ou presque les mêmes) coordonnées?
tr_tr: Aynı (veya neredeyse aynı) koordinatlara sahip iki ara noktanız var mı?
zh_cn: 你是否有两个具有相同（或几乎相同）坐标的航路点？

source: My robot drives way too far.
es_mx: Mi robot conduce demasiado lejos.
fr_ca: Mon robot va trop loin.
he_il: הרובוט נוסע יותר מדי.
tr_tr: Robotum çok uzağa gidiyor.
zh_cn: 我的机器人移动得太远了。

source: Are your encoder unit conversions set up correctly?
es_mx: ¿Están configuradas correctamente las conversiones de unidades de codificador?
fr_ca: Vos conversions d'unités d'encodeur sont-elles correctement configurées?
he_il: האם היחידות של האנקודרים נכונות?
tr_tr: Kodlayıcı birimi dönüştürmeleriniz doğru ayarlanmış mı?
zh_cn: 你的编码器单位转换设置正确吗?

source: Are your encoders connected?
es_mx: ¿Están tus enconders conectados?
fr_ca: Vos encodeurs sont-ils connectés?
he_il: האם האנקודרים מחוברים?
tr_tr: Kodlayıcılarınız bağlı mı?
zh_cn: 你的编码器连接了吗?

source: My robot mostly does the right thing, but it's a little inaccurate.
es_mx: Mi robot generalmente hace lo correcto, pero es un poco inexacto.
fr_ca: Mon robot fait surtout ce qu'il faut, mais c'est un peu inexact.
he_il: הרובוט לרוב עושה את הדבר הנכון, אבל קצת לא מדוייק.
tr_tr: Robotum çoğunlukla doğru olanı yapıyor, ancak biraz yanlış.
zh_cn: 我的机器人基本上能做正确的事情，但有一点不准确。

source: Go to the next section.
es_mx: Diríjase a la siguiente sección
fr_ca: Passez à la section suivante.
he_il: המשך לקטע הבא.
tr_tr: Sonraki bölüme gidin.
zh_cn: 转到下一部分。

source: Troubleshooting Poor Performance
es_mx: Solución de problemas de bajo rendimiento
fr_ca: Dépannage des mauvaises performances
tr_tr: Kötü Performans Sorunlarını Giderme
zh_cn: 解决性能不佳的问题

source: This section is mostly concerned with troubleshooting poor trajectory tracking performance like a meter of error, not catastrophic failures like compilation errors, robots turning around and going in the wrong direction, or ``MalformedSplineException``\s.
es_mx: Esta sección se ocupa principalmente de la resolución de problemas de rendimiento de seguimiento de trayectoria deficiente, como un metro de error, no fallas catastróficas como errores de compilación, robots que giran y van en la dirección incorrecta o ``MalformedSplineException``\s.
fr_ca: Cette section concerne principalement le dépannage des performances de suivi de trajectoire médiocres, comme une erreur de positionnement de 1 mètre, et non les défaillances catastrophiques comme les erreurs de compilation, les robots se retournant et allant dans la mauvaise direction, ou les erreurs comme ``MalformedSplineException``\s.
tr_tr: Bu bölüm çoğunlukla, derleme hataları, dönen ve yanlış yöne giden robotlar veya ``MalformedSplineException`` lar gibi yıkıcı arızalar değil, bir metre hata gibi zayıf yörünge izleme performansının giderilmesiyle ilgilidir.
zh_cn: 本节主要涉及对轨迹跟踪性能不佳，例如一米的误差，进行故障排除，而不是像编译错误，机器人不停转向并朝错误的方向或"MalformedSplineException''那样的灾难性故障。

source: This section is designed for differential drive robots, but most of the ideas can be adapted to swerve drive or mecanum.
es_mx: Esta sección está diseñada para robots de accionamiento diferencial, pero la mayoría de las ideas se pueden adaptar para desvío o mecanum.
fr_ca: Cette section est conçue pour les robots à entraînement différentiel, mais la plupart des idées peuvent être adaptées pour les robots de type Swerve ou Mécanum
tr_tr: Bu bölüm diferansiyel tahrikli robotlar için tasarlanmıştır, ancak fikirlerin çoğu swerve veya mecanum sürüşü yönlendirmek için uyarlanabilir.
zh_cn: 本节专为差速驱动机器人的而设计，但是大多数想法都可以适用于转向驱动或麦克纳姆转向。

source: Poor trajectory tracking performance can be difficult to troubleshoot. Although the trajectory generator and follower are intended to be easy-to-use and performant out of the box, there are situations where your robot doesn't quite end up where it should. The trajectory generator and followers have many knobs to tune and many moving parts, so it can be difficult to know where to start, especially because it is difficult to locate the source of trajectory problems from the robot's general behavior.
es_mx: El rendimiento deficiente del seguimiento de la trayectoria puede ser difícil de solucionar. Aunque el generador de trayectoria y el seguidor están pensados ​​para ser fáciles de usar y con un rendimiento inmediato, hay situaciones en las que su robot no termina donde debería. El generador de trayectoria y los seguidores tienen muchas perillas para sintonizar y muchas partes móviles, por lo que puede ser difícil saber por dónde empezar, especialmente porque es difícil localizar la fuente de los problemas de trayectoria a partir del comportamiento general del robot.
fr_ca: Les mauvaises performances de suivi de trajectoire peuvent être difficiles à dépanner. Bien que le générateur de trajectoire et le suiveur soient faciles à utiliser et performants tel quel, il y a des situations où votre robot n'accomplit pas toute sa trajectoire. Le générateur de trajectoire et les suiveurs ont de nombreux ajustements logiciels et mécaniques, il peut donc être difficile de savoir par où commencer, en particulier parce qu'il est difficile de localiser la source des problèmes de trajectoire à partir du comportement général du robot.
tr_tr: Zayıf yörünge izleme performansının giderilmesi zor olabilir. Yörünge oluşturucu ve takipçinin kullanımı kolay ve kutudan çıkar çıkmaz performans göstermesi amaçlansa da, robotunuzun olması gerektiği yere tam olarak varmadığı durumlar vardır. Yörünge oluşturucu ve takipçilerin ayarlanması gereken çok sayıda düğmesi ve birçok hareketli parçası vardır, bu nedenle, özellikle robotun genel davranışından yörünge sorunlarının kaynağını bulmak zor olduğu için nereden başlayacağını bilmek zor olabilir.
zh_cn: 不良的轨迹跟踪性能可能难以排除。虽然轨迹生成器和跟随器的目的是易于使用和卓越的表现，有情况下，机器人的表现不如预期。轨迹产生器和跟随器有很多需要调节的旋钮和运动部件，因此很难知道从哪里开始，特别是很难从机器人的大致运动中找到轨迹问题的根源。

source: Because it can be so hard to locate the layer of the trajectory generator and followers that is misbehaving, a systematic, layer-by-layer approach is recommended for general poor tracking performance (e.g. the robot is off by few feet or more than twenty degrees). The below steps are listed in the order that you should do them in; it is important to follow this order so that you can isolate the effects of different steps from each other.
es_mx: Debido a que puede ser muy difícil de localizar la capa de el generador de trayectoria y los siguientes que se están portando mal, se recomienda un enfoque sistemático capa por capa para un rendimiento de seguimiento deficiente en general (por ejemplo, el robot se aleja unos pocos pies o más de veinte grados ). Los pasos siguientes se enumeran en el orden en el que debe realizarlos; Es importante seguir este orden para poder aislar los efectos de los diferentes pasos entre sí.
fr_ca: Parce qu'il peut être si difficile de localiser la section du générateur de trajectoire et des suiveurs qui est fautive, une approche systématique, étape par étape est recommandée pour les mauvaises performances de suivi générales (comme exemple, le robot a dévié de 20 degrés ou est hors-parcours de quelques pieds). Les étapes ci-dessous sont répertoriées dans l'ordre dans lequel vous devez les effectuer; il est important de suivre cet ordre afin de pouvoir isoler les effets des différentes étapes les unes des autres.
tr_tr: Yörünge oluşturucu katmanını ve hatalı davranan takipçileri bulmak çok zor olabileceğinden, genel olarak kötü izleme performansı için sistematik, katman katman bir yaklaşım önerilir (örneğin, robot birkaç feet veya yirmi dereceden fazla uzakta) . Aşağıdaki adımlar, yapmanız gereken sıraya göre listelenmiştir; Farklı adımların etkilerini birbirinden ayırabilmeniz için bu sırayı takip etmeniz önemlidir.
zh_cn: 因为很难定位异常轨迹生成器和追踪器的层次，所以对于一般跟踪性能较差的情况(如机器人偏离几英尺或超过20度)，建议采用一种系统的、逐层的方法。以下是你应该做的步骤的顺序；遵循这个顺序是很重要的，这样您就可以孤立不同步骤的效果。

source: The below examples put diagnostic values onto :term:`NetworkTables`. The easiest way to graph these values is to :ref:`use Shuffleboard's graphing capabilities <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-graphs:Working With Graphs>`.
fr_ca: Les exemples ci-dessous mettent des valeurs de diagnostic sur les :term:`NetworkTables`. La façon la plus simple de représenter graphiquement ces valeurs est d'utiliser les capacités graphiques de :ref:`Shuffleboard <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-graphs:Working With Graphs>`.

source: Verify Odometry
es_mx: Verifique la odometría
fr_ca: Vérifier l'odométrie
tr_tr: Odometriyi Doğrula
zh_cn: 核查里程表

source: If your odometry is bad, then your Ramsete controller may misbehave, because it modifies your robot's target velocities based on where your odometry thinks the robot is.
es_mx: Si su odometría es mala, entonces su controlador Ramsete puede comportarse mal, porque modifica las velocidades objetivo de su robot en función de dónde cree que la odometría está el robot.
fr_ca: Si votre odométrie est mauvaise, votre contrôleur Ramsete peut se comporter de façon erronée, car il modifie les vitesses cibles de votre robot en fonction de l'endroit où votre odométrie pense que le robot se trouve.
tr_tr: Odometreniz kötüyse, Ramsete kontrol cihazınız yanlış davranabilir, çünkü robotunuzun hedef hızlarını, odometrenizin robotun nerede olduğunu düşündüğüne bağlı olarak değiştirir.
zh_cn: 如果您的里程表不正确，则Ramsete控制器可能会发生异常，因为它会根据您的里程表认为机器人的位置来修改机器人的目标速度。

source: :doc:`Sending your robot pose and trajectory to field2d </docs/software/dashboards/glass/field2d-widget>` can help verify that your robot is driving correctly relative to the robot trajectory.
fr_ca: :doc:`Envoi de la pose et de la trajectoire de votre robot à field2d </docs/software/dashboards/glass/field2d-widget>` peut aider à vérifier que votre robot se déplace correctement par rapport à sa trajectoire.

source: Set up your code to record your robot's position after each odometry update:
es_mx: Configure su código para que registre la posición del robot cada vez que se actualice la odometría.
fr_ca: Configurez votre code pour enregistrer la position de votre robot après chaque mise à jour de l'odométrie:
tr_tr: Her odometre güncellemesinden sonra robotunuzun konumunu kaydetmek için kodunuzu ayarlayın:
zh_cn: 设置代码以记录每次里程表更新后机器人的位置：

source: Lay out a tape measure parallel to your robot and push your robot out about one meter along the tape measure. Lay out a tape measure along the Y axis and start over, pushing your robot one meter along the X axis and one meter along the Y axis in a rough arc.
es_mx: Coloque una cinta métrica paralela a su robot y empuje su robot aproximadamente un metro a lo largo de la cinta métrica. Coloque una cinta métrica a lo largo del eje Y y comience de nuevo, empujando su robot un metro a lo largo del eje X y un metro a lo largo del eje Y en un arco aproximado.
fr_ca: Disposez un ruban à mesurer parallèle à votre robot et poussez votre robot d'environ un mètre le long du ruban à mesurer. Disposez un ruban à mesurer le long de l'axe Y et recommencez, en poussant votre robot d'un mètre le long de l'axe X et d'un mètre le long de l'axe Y en arc de cercle.
tr_tr: Robotunuza paralel bir mezura yerleştirin ve robotunuzu şerit metre boyunca yaklaşık bir metre dışarı doğru itin. Y ekseni boyunca bir şerit metre yerleştirin ve baştan başlayın, robotunuzu X ekseni boyunca bir metre ve Y ekseni boyunca bir metre kaba bir yay çizerek itin.
zh_cn: 布置一条与您的机器人平行的卷尺，然后沿着卷尺将您的机器人推出约一米。沿Y轴布置一个卷尺并重新开始，将您的机器人沿X轴推一米，沿Y轴推一米，形成一个粗糙的弧度。

source: Compare X and Y reported by the robot to actual X and Y. If X is off by more than 5 centimeters in the first test then you should check that you measured your wheel diameter correctly, and that your wheels are not worn down. If the second test is off by more than 5 centimeters in either X or Y then your track width (distance from the center of the left wheel to the center of the right wheel) may be incorrect; if you're sure that you measured the track width correctly with a tape measure then your robot's wheels may be slipping in a way that is not accounted for by track width--if this is the case then you should :ref:`run the track width characterization <docs/software/pathplanning/robot-characterization/characterization-routine:Running Tests>` and use that track width instead of the one from your tape measure.
fr_ca: Comparez les X et Y enregistrés par le robot à ceux des mesures X et Y réels. Si X dévie de la valeur réelle par plus de 5 centimètres lors du premier test, vous devez vérifier que vous avez correctement mesuré le diamètre de vos roues et que vos roues ne sont pas usées. Si le deuxième test est décalé de plus de 5 centimètres en X ou Y, alors la largeur de votre robot (la distance du centre de la roue gauche au centre de la roue droite) peut être incorrecte; si vous êtes sûr d'avoir correctement mesuré la largeur entre les roues avec un ruban à mesurer, les roues de votre robot peuvent avoir glissé d'une manière qui n'est pas prise en compte par le paramètre qui représente la largeur du robot - si tel est le cas, vous devez :ref:`exécuter la caractérisation de la largeur du robot <docs/software/pathplanning/robot-characterization/characterization-routine:Running Tests>` et utilisez cette largeur de robot plutôt que celle obtenue par votre ruban à mesurer.

source: Highlights the trackwidth section of characterization.
fr_ca: Met en évidence la section relative à la largeur de voie dans l'outil de caractérisation

source: Verify Feedforward
es_mx: Verificar Feedforward
fr_ca: Vérifier la fonction Feedforward
tr_tr: Feedforward - ileribesleme'yi Doğrula
zh_cn: 核查前馈

source: If your feedforwards are bad then the P controllers for each side of the robot will not track as well, and your ``DifferentialDriveVoltageConstraint`` will not limit your robot's acceleration accurately. We mostly want to turn off the wheel P controllers so that we can isolate and test the feedforwards.
es_mx: Si sus feedforwards son malos, entonces los controladores P para cada lado del robot no seguirán tan bien, y su ``DifferentialDriveVoltageConstraint`` no limitará la aceleración de su robot con precisión. En general, queremos apagar los controladores P de la rueda para poder aislar y probar los feedforwards.
fr_ca: Si vos informations sont mauvaises, les contrôleurs P de chaque côté du robot ne suivront pas aussi bien et votre ``DifferentialDriveVoltageConstraint`` ne limitera pas l'accélération de votre robot avec précision. Nous voulons surtout désactiver les contrôleurs P de la roue afin de pouvoir isoler et tester les feedforwards.
tr_tr: İleri beslemeniz kötüyse, robotun her iki tarafındaki P denetleyicileri de takip etmeyecek ve ``DifferentialDriveVoltageConstraint``, robotunuzun hızlanmasını doğru bir şekilde sınırlamayacaktır. İleriye doğru ilerlemeyi izole edip test edebilmek için çoğunlukla tekerlek P kontrol cihazlarını kapatmak istiyoruz.
zh_cn: 如果前馈不良，则机器人各侧的P控制器也将无法跟踪，并且 differentialDriveVoltageConstraint不会精确地限制机器人的加速度。 我们主要想关闭车轮的P控制器，以便我们可以单独测试前馈。

source: First, we must set disable the P controller for each wheel. Set the ``P`` gain to 0 for every controller. In the ``RamseteCommand`` example, you would set ``kPDriveVel`` to 0:
es_mx: Primero, debemos configurar la desactivación del controlador P para cada rueda. Poner la ganancia ``P`` a 0 para cada controlador. En el ejemplo de "Comando Ramsete", pondrías "kPDriveVel" a 0:
fr_ca: Tout d'abord, nous devons désactiver le paramètre P pour neutraliser le PID pour chaque roue. Réglez le gain ``P`` à 0 ​​pour chaque contrôleur. Dans l'exemple ``RamseteCommand``, vous définiriez ``kPDriveVel`` à 0:
tr_tr: İlk olarak, her tekerlek için P kontrolörünü devre dışı bırakmalıyız. Her kontrolör için ``P`` kazancını 0'a ayarlayın. ``RamseteCommand`` örneğinde, ``kPDriveVel`` değerini 0 olarak ayarlarsınız:
zh_cn: 首先，必须为每个车轮设置禁用P控制器。将每个控制器的P增益设置为0。在RamseteCommand示例中，您可以将kPDriveVel设置为0：

source: Next, we want to disable the Ramsete controller to make it easier to isolate our problematic behavior. To do so, simply call ``setEnabled(false)`` on the ``RamseteController`` passed into your ``RamseteCommand``:
fr_ca: Ensuite, nous voulons désactiver le contrôleur Ramsete pour faciliter l'isolement de notre comportement problématique. Pour ce faire, invoquer simplement la méthode ``setEnabled(false)`` sur ``RamseteController`` passé à votre ``RamseteCommand``:
