Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/trajectories/troubleshooting.po
Languages: es_mx, fr_ca, he_il, tr_tr, zh_cn

source: Finally, we need to log desired wheel velocity and actual wheel velocity (you should put actual and desired velocities on the same graph if you're using Shuffleboard, or if your graphing software has that capability):
es_mx: Finalmente, necesitamos registrar la velocidad de la rueda deseada y la velocidad real de la rueda (deberías poner las velocidades real y deseada en el mismo gráfico si estás usando Shuffleboard, o si tu software de gráficos tiene esa capacidad):
fr_ca: Enfin, nous devons enregistrer la vitesse de roue souhaitée et la vitesse de roue réelle (vous devez mettre les vitesses réelles et souhaitées sur le même graphique si vous utilisez Shuffleboard, ou si votre logiciel graphique a cette capacité):
tr_tr: Son olarak, istenen tekerlek hızını ve gerçek tekerlek hızını kaydetmemiz gerekir (Shuffleboard kullanıyorsanız veya grafik yazılımınız bu özelliğe sahipse, gerçek ve istenen hızları aynı grafiğe koymalısınız):
zh_cn: 最后，我们需要记录所需的车轮速度和实际的车轮速度（如果您使用Shuffleboard，或者您的绘图软件具有该功能，则应将实际速度和所需速度记录在同一张图表上）

source: Run the robot on a variety of trajectories (curved and straight line), and check to see if the actual velocity tracks the desired velocity by looking at graphs from NetworkTables.
es_mx: Ejecute el robot en una variedad de trayectorias (línea curva y recta), y compruebe si la velocidad real sigue la velocidad deseada mirando los gráficos de las NetworkTables.
fr_ca: Exécutez le robot sur une variété de trajectoires (courbe et ligne droite) et vérifiez si la vitesse réelle suit la vitesse souhaitée en regardant les graphiques de NetworkTables.
zh_cn: 在各种轨迹（曲线和直线）上运行机器人，并通过查看NetworkTables中的图表来检查实际速度是否跟踪所需速度。

source: If the desired and actual are off by *a lot* then you should check if the wheel diameter and ``encoderEPR`` you used for characterization were correct. If you've verified that your units and conversions are correct, then you should try recharacterizing on the same floor that you're testing on to see if you can get better data.
fr_ca: Si les valeurs souhaitées et réelles sont décalées de *beaucoup*, vous devez vérifier si le diamètre de la roue et ``encoderEPR`` que vous avez utilisés pour la caractérisation étaient corrects. Si vous avez vérifié que vos unités et conversions sont correctes, vous devriez essayer de recaractériser sur le même type de tapis de sol que celui utilisé lors des compétitions, et vérifier si vous pouvez obtenir de meilleures données.
tr_tr: İstenilen ve gerçek olan *çok* yanlışsa, karakterizasyon için kullandığınız tekerlek çapının ve ``kodlayıcı EPR`` nin doğru olup olmadığını kontrol etmelisiniz. Birimlerinizin ve dönüştürmelerinizin doğru olduğunu doğruladıysanız, daha iyi veri alıp alamayacağınızı görmek için test ettiğiniz aynı zeminde yeniden nitelendirmeyi denemelisiniz.

source: Verify P Gain
es_mx: Verificación de la Ganancia P
fr_ca: Vérifiez le gain proportionnel P
tr_tr: P Kazancını Doğrula
zh_cn: 核查P增益

source: If you completed the previous step and the problem went away then your problem can probably be found in one of the next steps. In this step we're going to verify that your wheel P controllers are well-tuned. If you're using Java then we want to turn off Ramsete so that we can just view our PF controllers on their own.
es_mx: Si has completado el paso anterior y el problema ha desaparecido, entonces es probable que tu problema se encuentre en uno de los siguientes pasos. En este paso vamos a verificar que los controladores P de tu rueda están bien ajustados. Si estás usando Java entonces queremos que apague Ramsete para que podamos ver nuestros controladores PF por su cuenta.
fr_ca: Si vous avez effectué l'étape précédente et que le problème est réglé, alors le problème initial se situe peut-être dans la boucle de contrôle. Dans cette étape, nous allons vérifier que les paramètres P pour les contrôleurs de roue soient bien réglés. Si vous utilisez Java, nous voulons désactiver Ramsete afin que nous puissions simplement visualiser nos contrôleurs PF par eux-mêmes.
tr_tr: Önceki adımı tamamladıysanız ve sorun ortadan kalktıysa, sorununuz muhtemelen sonraki adımlardan birinde bulunabilir. Bu adımda, tekerlek P kontrol cihazlarınızın iyi ayarlanmış olduğunu doğrulayacağız. Java kullanıyorsanız, Ramsete'yi kapatmak istiyoruz, böylece PF denetleyicilerimizi kendi başlarına görüntüleyebilelim.
zh_cn: 如果您完成了上一步，并且问题消失了，那么可能会在后续步骤之一中找到您的问题。 在此步骤中，我们将核查车轮的P控制器是否已正确调整。如果您使用的是Java，那么我们要关闭Ramsete，以便我们可以自己查看PF控制器。

source: You must re-use all the code from the previous step that logs actual vs. desired velocity (and the code that disables Ramsete, if you're using Java), except that **the P gain must be set back to its previous nonzero value.**
es_mx: Debes reutilizar todo el código del paso anterior que registra la velocidad actual frente a la deseada (y el código que desactiva Ramsete, si usas Java), excepto que **la ganancia P debe volver a su valor anterior distinto de cero.**
fr_ca: Vous devez réutiliser tout le code de l'étape précédente qui enregistre la vitesse réelle par rapport à la vitesse souhaitée (et le code qui désactive Ramsete, si vous utilisez Java), sauf que **le gain P doit être ramené à sa valeur initiale**
tr_tr: **P kazancının önceki sıfır olmayan değere ayarlanması dışında **, gerçek ve istenen hızı (ve Java kullanıyorsanız Ramsete'yi devre dışı bırakan kodu) günlüğe kaydeden önceki adımdaki tüm kodu tekrar kullanmanız gerekir.
zh_cn: 除了必须将P增益重新设置为之前的非零值之外，您必须重新使用记录实际速度与所需速度的上一步中的所有代码（如果使用Java，则禁用Ramsete的代码）。

source: Run the robot again on a variety of trajectories, and check that your actual vs. desired graphs look good.
es_mx: Conduzca de nuevo el robot en distintas trayectorias, y revise que las gráficas reales se vean bien en comparación a las gráficas deseadas.
fr_ca: Exécutez à nouveau le robot sur une variété de trajectoires et vérifiez que vos graphiques réels et souhaités semblent bons
tr_tr: Robotu çeşitli yörüngelerde tekrar çalıştırın ve gerçek ve istenen grafiklerin iyi göründüğünü kontrol edin.
zh_cn: 在各种轨迹上再次运行机器人，并检查您的实际图形与所需图形之间是否相符。

source: If the graphs do not look good (i.e. the actual velocity is very different from the desired) then you should try tuning your P gain and rerunning your test trajectories.
es_mx: Si las gráficas no se ven bien (ej. la velocidad al momento es muy diferente a la deseada) entonces debería intentar afinar su ganancia P y re ejecutar sus trayectorias de prueba.
fr_ca: Si les graphiques ne semblent pas bons (c'est-à-dire que la vitesse réelle est très différente de celle souhaitée), vous devriez essayer de régler votre gain P et de réexécuter vos trajectoires de test.
tr_tr: Grafikler iyi görünmüyorsa (yani gerçek hız, istenenden çok farklıysa), P kazancınızı ayarlamayı ve test yörüngelerini yeniden çalıştırmayı denemelisiniz.
zh_cn: 如果图形看起来不好（即实际速度与期望的速度有很大不同），则应尝试调整P增益并重新运行测试轨迹。

source: Check Constraints
es_mx: Compruebe las restricciones
fr_ca: Vérifier les contraintes
tr_tr: Kısıtlamaları Kontrol Et
zh_cn: 核查约束

source: Make sure that your P gain is nonzero for this step and that you still have the logging code added in the previous steps. If you're using Java then you should remove the code to disable Ramsete.
es_mx: Asegúrese de que su ganancia P sea distinta de cero en este paso y que aún tenga el código de registro añadido en los pasos anteriores. Si estás usando Java entonces deberías quitar el código para desactivar Ramsete.
fr_ca: Assurez-vous que votre gain P est différent de zéro pour cette étape et que vous avez toujours le code de prises de données ajouté dans les étapes précédentes. Si vous utilisez Java, vous devez supprimer le code pour désactiver Ramsete.
tr_tr: Bu adım için P kazancınızın sıfır olmadığından ve önceki adımlarda eklenen günlük kodunun hala bulunduğundan emin olun. Java kullanıyorsanız, Ramsete'yi devre dışı bırakmak için kodu kaldırmalısınız.
zh_cn: 确保此步骤的P增益不为零，并且仍在前面的步骤中添加了日志记录代码。如果您使用的是Java，则应删除代码以禁用Ramsete。

source: If your accuracy issue persisted through all of the previous steps then you might have an issue with your constraints. Below are a list of symptoms that the different available constraints will exhibit when poorly tuned.
es_mx: Si su problema de exactitud persiste a través de todos los pasos anteriores, entonces podría tener un problema con sus limitaciones. A continuación hay una lista de síntomas que las diferentes restricciones disponibles exhibirán cuando no estén bien afinadas.
fr_ca: Si votre problème de précision a persisté à travers toutes les étapes précédentes, vous pourriez avoir un problème avec vos contraintes. Vous trouverez ci-dessous une liste des symptômes que les différentes contraintes disponibles présenteront lorsqu'elles sont mal réglées.
tr_tr: Doğruluk sorununuz önceki adımların tümünde devam ettiyse, kısıtlamalarınızla ilgili bir sorununuz olabilir. Aşağıda, farklı mevcut kısıtlamaların yetersiz ayarlandığında göstereceği belirtilerin bir listesi bulunmaktadır.
zh_cn: 如果您的准确性问题在上述所有步骤中仍然存在，则说明您的约束可能存在问题。以下是调整不良时不同可用约束出现问题的列表。

source: Test one constraint at a time! Remove the other constraints, tune your one remaining constraint, and repeat that process for each constraint you want to use. The below checklist assumes that you only use one constraint at a time.
es_mx: ¡Prueba una restricción a la vez! Elimina las otras restricciones, ajusta la que te queda y repite el proceso para cada restricción que quieras usar. La siguiente lista de comprobación supone que sólo se utiliza una restricción a la vez.
fr_ca: Vérifiez une seule contrainte à la fois! Supprimez les autres contraintes, ajustez l'unique contrainte restante et répétez ce processus pour chaque contrainte que vous souhaitez vérifier. La liste de contrôle ci-dessous suppose que vous n'utilisez qu'une seule contrainte à la fois.
tr_tr: Her seferinde bir kısıtlamayı test edin! Diğer kısıtlamaları kaldırın, kalan kısıtlamalardan birini ayarlayın ve kullanmak istediğiniz her kısıtlama için bu işlemi tekrarlayın. Aşağıdaki kontrol listesi, bir seferde yalnızca bir kısıtlama kullandığınızı varsayar.
zh_cn: 一次测试一个约束！删除其他约束，调整剩下的一个约束，并对每个要使用的约束重复该过程。以下清单假定您一次仅使用一个约束。

source: If your robot accelerates very slowly then it's possible that the max voltage for this constraint is too low.
es_mx: Si tu robot acelera muy lentamente, entonces es posible que el voltaje máximo para esta restricción sea demasiado bajo.
fr_ca: Si votre robot accélère très lentement, il est possible que la tension maximale (voltage) pour cette contrainte soit trop faible.
tr_tr: Robotunuz çok yavaş hızlanırsa, bu kısıtlama için maksimum voltajın çok düşük olması mümkündür.
zh_cn: 如果您的机器人加速非常慢，则该约束的最大电压可能太低。

source: If your robot doesn't reach the end of the path then your characterization data may problematic.
fr_ca: Si votre robot n'atteint pas la fin de son cheminement, vos données de caractérisation peuvent être problèmatiques.
tr_tr: Robotunuz yolun sonuna ulaşmazsa, karakterizasyon verileriniz sorunlu olabilir.

source: If your robot ends up at the wrong heading then it's possible that the max drivetrain side speed is too low, or that it's too high. The only way to tell is to tune the max speed and to see what happens.
es_mx: Si tu robot termina en el rumbo equivocado, es posible que la velocidad máxima del lado de la transmisión sea demasiado baja, o que sea demasiado alta. La única manera de saberlo es ajustando la velocidad máxima y ver qué pasa.
fr_ca: Si le cap de votre robot est orienté vers la mauvaise direction, il est possible que la vitesse maximale permise du contrôleur soit trop faible ou trop élevée. La seule façon de vérifier cela est d'ajuster la vitesse maximale à une valeur différente et de voir ce qui se passe.
tr_tr: Robotunuz yanlış istikamette biterse, maksimum aktarma organı yan hızının çok düşük veya çok yüksek olması mümkündür. Bunu söylemenin tek yolu maksimum hızı ayarlamak ve ne olacağını görmektir.
zh_cn: 如果机器人的前进方向错误，则可能是最大动力传动系统侧向速度太低或太高。唯一方法是调整最大速度并查看会发生什么。

source: If your robot ends up at the wrong heading then this could be the culprit. If your robot doesn't seem to turn enough then you should increase the max centripetal acceleration, but if it seems to go around tight turns to quickly then you should decrease the maximum centripetal acceleration.
es_mx: Si su robot termina en la dirección equivocada, entonces este podría ser el culpable. Si su robot no parece girar lo suficiente, entonces debe aumentar la aceleración centrípeta máxima, pero si parece girar en giros cerrados demasiado rápido, entonces debe disminuir la aceleración centrípeta máxima.
fr_ca: Si le cap de votre robot pointe vers la mauvaise direction, ce paramètre ci-haut pourrait être le coupable. Si votre robot ne semble pas tourner suffisamment, vous devez augmenter l'accélération centripète maximale, mais s'il semble faire des virages serrés trop rapidement, vous devez diminuer l'accélération centripète maximale.
tr_tr: Robotunuz yanlış istikamette biterse, suçlu bu olabilir. Robotunuz yeterince dönmüyorsa, maksimum merkezcil ivmeyi artırmalısınız, ancak hızlı dönüşler hızla dönüyorsa, maksimum merkezcil ivmeyi-maximum centripetal azaltmalısınız.
zh_cn: 如果您的机器人的航向错误，那么这可能是罪魁祸首。如果您的机器人似乎转弯不充分，则应增加最大向心加速度，但如果机器人转弯时转弯太快，则应减小最大向心加速度。

source: Check Trajectory Waypoints
es_mx: Comprobación de los puntos de ruta de la trayectoria
fr_ca: Vérifier les points de cheminement de la trajectoire
tr_tr: Yörünge Yol Noktalarını Kontrol Edin
zh_cn: 检查轨迹航路点

source: It is possible that your trajectory itself is not very driveable. Try moving waypoints (and headings at the waypoints, if applicable) to reduce sharp turns.
es_mx: Es posible que su trayectoria en sí no sea muy manejable. Intente mover las coordenadas (y rumbos en las coordenadas, si corresponde) para reducir los giros bruscos.
fr_ca: Il est possible que votre trajectoire elle-même ne soit pas très pilotable. Essayez de déplacer certains points de cheminement (et les caps aux points de cheminement, le cas échéant) pour réduire les virages serrés.
tr_tr: Yörüngenizin kendisinin pek sürülebilir olmaması mümkündür. Keskin dönüşleri azaltmak için ara noktaları (ve varsa ara noktalardaki yönleri) hareket ettirmeyi deneyin.
zh_cn: 您的轨迹本身可能不太容易追踪。尝试移动航路点（以及航路点的标题，如果适用），并减少急转弯。

source: The below examples put diagnostic values onto Network Tables. The easiest way to graph these values is to :ref:`use Shuffleboard's graphing capabilities <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-graphs:Working With Graphs>`.
tr_tr: Aşağıdaki örnekler, teşhis değerlerini Ağ Tablolarına yerleştirir. Bu değerleri grafiğe dökmenin en kolay yolu şudur :ref:`Shuffleboard's graphing kabileylerini kullanın <docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-graphs:Working With Graphs>`.

source: Compare X and Y reported by the robot to actual X and Y. If X is off by more than 5 centimeters in the first test then you should check that you measured your wheel diameter correctly, and that your wheels are not worn down. If the second test is off by more than 5 centimeters in either X or Y then your track width (distance from the center of the left wheel to the center of the right wheel) may be incorrect; if you're sure that you measured the track width correctly with a tape measure then your robot's wheels may be slipping in a way that is not accounted for by track width--if this is the case then you should :ref:`run the track width characterization <docs/software/wpilib-tools/robot-characterization/characterization-routine:Running Tests>` and use that track width instead of the one from your tape measure.
tr_tr: Robot tarafından bildirilen X ve Y'yi gerçek X ve Y ile karşılaştırın. X ilk testte 5 santimetreden fazla sapmışsa, tekerlek çapınızı doğru ölçtüğünüzü ve tekerleklerinizin aşınmadığını kontrol etmelisiniz. İkinci test X veya Y'de 5 santimetreden fazla saparsa, iz genişliğiniz (sol tekerleğin merkezinden sağ tekerleğin merkezine olan mesafe) yanlış olabilir; İz genişliğini bir şerit metre ile doğru ölçtüğünüzden eminseniz, robotunuzun tekerlekleri iz genişliğine göre hesaba katılmayacak bir şekilde kayıyor olabilir - bu durumda yapmanız gerekenler :ref:`iz genişliği karakterizasyonu <docs/software/wpilib-tools/robot-characterization/characterization-routine:Running Tests>` `ve şerit ölçünüzdeki iz genişliği yerine bu iz genişliğini kullanın.

source: (Java only) Next, we want to disable the Ramsete controller to make it easier to isolate our problematic behavior. This is a bit more involved, because we can't just set the gains (b and zeta) to 0. Pass the following into your ``RamseteCommand``:
tr_tr: (Yalnızca Java) Daha sonra, sorunlu davranışımızı izole etmeyi kolaylaştırmak için Ramsete denetleyicisini devre dışı bırakmak istiyoruz. Bu biraz daha karmaşık çünkü kazançları (b ve zeta) 0'a ayarlayamayız. Aşağıdakileri ``RamseteCommand`` e aktarın:

source: Run the robot on a variety of trajectories (curved and straight line), and check to see if the actual velocity tracks the desired velocity by looking at graphs from Network Tables.
tr_tr: Robotu çeşitli yörüngelerde (eğimli ve düz çizgi) çalıştırın ve Ağ Tablolarından grafiklere bakarak gerçek hızın istenen hızı takip edip etmediğini kontrol edin.
