Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/frcvision/image-thresholding.po
Languages: es_mx, fr_ca

source: Thresholding an Image
es_mx: Descomponer los colores de una imagen
fr_ca: Trouver le seuil d'une image (Thresholding)

source: In order to turn a colored image, such as the one captured by your camera, into a binary image, with the target as the "foreground", we need to threshold the image using the hue, saturation, and value of each pixel.
es_mx: Para convertir una imagen en color, como la capturada por su cámara, en una imagen binaria, con el objetivo como el "primer plano", necesitamos poner el umbral de la imagen usando el tono, saturación y valor de cada píxel.
fr_ca: Afin de transformer une image colorée, telle que celle capturée par votre caméra, en une image binaire, avec la cible en "premier plan", nous devons seuiller l'image en utilisant la teinte, la saturation et la valeur de chaque pixel.

source: The HSV Model
es_mx: El Modelo HSV
fr_ca: L'espace de couleur HSV (teinte, saturation et luminosité)

source: Unlike RGB, HSV allows you to not only filter based on the colors of the pixels, but also by the intensity of color and the brightness.
es_mx: A diferencia de RGB, HSV le permite no sólo filtrar según los colores de los píxeles, sino también por la intensidad del color y el brillo.
fr_ca: Il existe plusieurs façon de définir une même couleur: l'espace RGB (rouge, vert, bleu) et l'espace HSV. Ils ont chacun leur utilité selon le traitement désiré. Contrairement à l'espace RGB, l'espace HSV vous permet d'isoler le vert par exemple, peu importe son intensité sa luminosité.

source: Hue: Measures the color of the pixel.
es_mx: Tono: mide el color del píxel.
fr_ca: Teinte: mesure la tonalité d'une couleur dans le spectre lumineux.

source: Saturation: Measures the intensity of color of the pixel.
es_mx: Saturación: mide la intensidad del color del píxel.
fr_ca: Saturation: mesure l'intensité de la couleur du pixel.

source: Value: Measures the brighness of the pixel.
es_mx: Valor: mide el brillo del píxel.
fr_ca: Valeur: mesure la luminosité du pixel.

source: You can use OpenCV to convert a BGR image matrix to HSV.
es_mx: Puede usar OpenCV para convertir una matriz de imagen BGR a HSV.
fr_ca: Vous pouvez utiliser OpenCV pour convertir une matrice d'images BGR (bleu, vert, rouge) en HSV. En OpenCV, l'ordre des couleurs primaires, communément appelée l'espace RGB, est différente (BGR).

source: OpenCV's hue range is from 1° to 180° instead of the common 1° to 360°. In order to convert a common hue value to OpenCV, divide by 2.
es_mx: El rango de tono de OpenCV es de 1 ° a 180 ° en lugar del común de 1 ° a 360 °. A fin de que convierta un valor de tono común a OpenCV, dividir por 2.
fr_ca: La gamme de teintes d'OpenCV est de 1° à 180° au lieu des 1° à 360° habituels. Afin de convertir une valeur de teinte commune en OpenCV, divisez par 2.

source: Thresholding
es_mx: Descomponer los colores
fr_ca: Seuillage

source: We will use this field image as an example for the whole process of image processing.
es_mx: Utilizaremos esta imagen de campo como ejemplo para todo el proceso de procesamiento de imágenes.
fr_ca: Nous utiliserons cette image du terrain de jeu comme exemple pour l'ensemble du processus de traitement d'image.

source: By thresholding the image using HSV, you can separate the image into the vision target (foreground), and the other things that the camera sees (background). The following code example converts a HSV image into a binary image by thresholding with HSV values.
es_mx: Al descomponer en colores la imagen usando HSV, usted puede separar la imagen en: objetivo de visión (primer plano) y todo lo demás (segundo plano). El siguiente código de ejemplo convierte una imagen HSV a una imagen binaria al descomponer en colores con valores HSV.
fr_ca: En limitant l'image à l'aide de HSV, vous pouvez séparer l'image en la cible de vision (premier plan) et les autres éléments que la caméra voit (arrière-plan). L'exemple de code suivant convertit une image HSV en image binaire par seuillage avec des valeurs HSV.

source: These values may have to be tuned on an per-venue basis, as ambient lighting may differ across venues. It is recommended to allow editing of these values through NetworkTables in order to facilitate on-the-fly editing.
es_mx: Es posible que estos valores tengan que ajustarse según el lugar, ya que la iluminación ambiental puede diferir según los lugares. Se recomienda permitir la edición de estos valores a través de NetworkTables para facilitar la edición sobre la marcha.
fr_ca: Ces valeurs peuvent devoir être ajustées sur le terrain, car l'éclairage ambiant peut différer d'un site à l'autre. Il est recommandé d'autoriser la modification de ces valeurs via NetworkTables afin de faciliter les changements rapides de valeurs.

source: After thresholding, your image should look like this.
es_mx: Después de la descomposición, su imagen debería verse así.
fr_ca: Après le seuillage, votre image devrait ressembler à ceci.

source: As you can see, the thresholding process may not be 100% clean. You can use morphological operations to deal with the noise.
es_mx: Como puede ver, el proceso de descomposición puede no ser 100% limpio. Puedes usar operaciones morfológicas para lidiar con el ruido.
fr_ca: Comme vous pouvez le voir, le processus de seuillage peut ne pas être 100% efficace. Vous pouvez utiliser des opérations morphologiques pour amenuiser le bruit.
