Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/frcvision/installing-the-image-to-your-microsd-card.po
Languages: es_mx, fr_ca, tr_tr

source: Installing the image to your MicroSD card
es_mx: Instalación de la imagen en su tarjeta MicroSD
fr_ca: Installation de l'image RPi sur votre carte MicroSD
tr_tr: Imaj dosyasını MicroSD kartınıza yükleme

source: Getting the FRC Raspberry PI image
es_mx: Obteniendo la imagen FRC Raspberry PI
fr_ca: Obtenir l'image FRC Raspberry PI
tr_tr: FRC Raspberry PI görüntüsünü alma

source: The image is stored on the GitHub release page for the FRC\ |reg| PI-gen repository: https://github.com/wpilibsuite/FRCVision-pi-gen/releases.
fr_ca: L'image est stockée sur la page de publication de GitHub pour le FRC\ |reg| PI-gen repository: https://github.com/wpilibsuite/FRCVision-pi-gen/releases.

source: In addition to the instructions on this page, see the documentation on the GitHub web page (below).
es_mx: Además de las instrucciones de esta página, consulte la documentación en la página web de GitHub (abajo).
fr_ca: En plus des instructions sur cette page, consultez la documentation sur la page Web GitHub (ci-dessous).
tr_tr: Bu sayfadaki talimatlara ek olarak GitHub web sayfasındaki (aşağıda) belgelere bakın.

source: The image is fairly large so have a fast internet connection when downloading it. Always use the most recent release from the top of the list of releases.
es_mx: La imagen es bastante grande, así que tenga una conexión rápida a Internet cuando la descargue. Siempre use el lanzamiento más reciente de la parte superior de la lista de lanzamientos.
fr_ca: L'image est assez grande, il faut donc une connexion Internet rapide lors du téléchargement. Utilisez toujours la version la plus récente en haut de la liste des versions.
tr_tr: İmaj dosyası oldukça büyük olduğundan, indirirken hızlı bir internet bağlantısına sahip olun. Her zaman sürüm listesinin en üstündeki en son sürümü kullanın.

source: Copy the image to your MicroSD card
es_mx: Copie la imagen a su tarjeta MicroSD
fr_ca: Copiez l'image sur votre carte MicroSD
tr_tr: Görüntüyü MicroSD kartınıza kopyalayın

source: Download and install Etcher (https://www.balena.io/etcher/) to image the micro SD card. The micro SD card needs to be at least 4 GB. Note: a micro SD to USB dongle such as https://www.amazon.com/gp/product/B0779V61XB works well for writing to micro SD cards.
es_mx: Descargue e instale Etcher (https://www.balena.io/etcher/) para crear una imagen de la tarjeta micro SD. La tarjeta micro SD debe tener al menos 4 GB. Nota: una micro SD para un dongle USB como https://www.amazon.com/gp/product/B0779V61XB funciona bien para escribir en tarjetas micro SD.
fr_ca: Téléchargez et installez Etcher (https://www.balena.io/etcher/) pour créer une image de la carte micro SD. La carte micro SD doit être d'au moins 4 Go. Remarque: un dongle micro SD vers USB tel que https://www.amazon.com/gp/product/B0779V61XB fonctionne bien pour écrire sur des cartes micro SD.
tr_tr: Mikro SD kartı görüntülemek için Etcher'ı (https://www.balena.io/etcher/) indirin ve yükleyin. Mikro SD kartın en az 4 GB olması gerekir. Not: https://www.amazon.com/gp/product/B0779V61XB gibi bir mikro SD'den USB donglea, mikro SD kartlara yazmak için iyi çalışır.

source: Flash the MicroSD card with the image using Etcher by selecting the zip file as the source, your SD card as the destination and click "Flash". Expect the process to take about 3 minutes on a fairly fast laptop.
es_mx: Escriba la tarjeta MicroSD con la imagen usando Etcher seleccionando el archivo zip como fuente, su tarjeta SD como destino y haga clic en "Flash". Espere que el proceso toma alrededor de 3 minutos en una laptop bastante rápida.
fr_ca: Flashez la carte MicroSD avec l'image en utilisant Etcher en sélectionnant le fichier zip comme source, votre carte SD comme destination et cliquez sur "Flash". Attendez-vous à ce que le processus prenne environ 3 minutes sur un ordinateur portable assez rapide.
tr_tr: Kaynak olarak zip dosyasını, hedef olarak SD kartınızı seçerek ve "Flash" seçeneğine tıklayarak MicroSD kartını Etcher kullanarak imajlayın. Oldukça hızlı bir dizüstü bilgisayarda işlemin yaklaşık 3 dakika sürmesini bekleyin.

source: Testing the Raspberry PI
es_mx: Probando la Raspberry Pi
fr_ca: Test du Raspberry PI
tr_tr: Raspberry PI Test Etme

source: Put the micro SD card in a rPi 3 and apply power.
es_mx: Coloque la tarjeta micro SD en un rPi 3 y aplique energía.
fr_ca: Mettez la carte micro SD dans un rPi 3 et mettez-la sous tension.
tr_tr: Mikro SD kartı bir rPi 3'e yerleştirin ve güç verin.

source: Connect the rPi 3 ethernet to a LAN or PC. Open a web browser and connect to ``http://frcvision.local/`` to open the web dashboard. On the first bootup the filesystem will be writable, but later bootups will default to read only, so it's necessary to click the "writable" button to make changes.
es_mx: Conecte el rPi 3 ethernet a una LAN o PC. Abra un navegador web y conéctese a http://frcvision.local/ para abrir el dashboard web. En el primer arranque, el sistema de archivos se puede escribir, pero los arranques posteriores serán de solo lectura, por lo que es necesario hacer clic en el botón "grabable" para realizar cambios.
fr_ca: Connectez le rPi 3 ethernet à un LAN ou un PC. Ouvrez un navigateur Web et connectez-vous à ``http://frcvision.local/`` pour ouvrir le tableau de bord Web. Au premier démarrage, le système de fichiers sera accessible en écriture, mais les démarrages ultérieurs seront par défaut en lecture seule, il est donc nécessaire de cliquer sur le bouton "Writable" pour apporter des modifications.
tr_tr: RPi 3 ethernet'i bir LAN veya PC'ye bağlayın. Bir web tarayıcısı açın ve web panosunu açmak için ``http://frcvision.local/`` adresine bağlanın. İlk önyüklemede dosya sistemi yazılabilir olacaktır, ancak sonraki önyüklemeler varsayılan olarak salt okunur olacaktır, bu nedenle değişiklik yapmak için "writable" düğmesine tıklamak gerekir.

source: Logging into the Raspberry PI
es_mx: Iniciar sesión en la Raspberry PI
fr_ca: Connexion au Raspberry PI
tr_tr: Raspberry PI'da oturum açma

source: Most tasks with the rPi can be done from the web console interface. Sometimes for advanced use such as program development on the rPi it is necessary to log in. To log in, use the default Raspberry PI password: ::
es_mx: La mayoría de las tareas con el rPi se pueden realizar desde la interfaz de la consola web. A veces para uso avanzado como el desarrollo de programas en el rPi es necesario iniciar sesión. Para iniciar sesión, utilice la contraseña predeterminada de Raspberry PI:
fr_ca: La plupart des tâches avec le rPi peuvent être effectuées à partir de l'interface de la console Web. Parfois, pour une utilisation avancée telle que le développement de programmes sur le rPi, il est nécessaire de se connecter. Pour se connecter, utilisez le mot de passe Raspberry PI par défaut: ::
tr_tr: RPi ile çoğu görev, web konsolu arayüzünden yapılabilir. Bazen rPi'de program geliştirme gibi gelişmiş kullanım için oturum açmak gerekir. Oturum açmak için varsayılan Raspberry PI şifresini kullanın: ::

source: Known issues with this release (errata). These will be fixed in the next release.
es_mx: Problemas conocidos con esta versión (erratas). Estos se solucionarán en la próxima versión.
fr_ca: Problèmes connus avec cette version (errata). Ceux-ci seront corrigés dans la prochaine version.

source: Downloading the Java example program on the web dashboard does not work. Grab it manually from /home/pi/zips instead (using ssh).
es_mx: La descarga del programa de ejemplo Java en el dashboard web no funciona. Agarrarlo manualmente desde / home / pi / zips en su lugar (usando ssh).
fr_ca: Le téléchargement de l'exemple de programme Java sur le tableau de bord Web ne fonctionne pas. Récupérez-le manuellement depuis /home/pi/zips à la place (en utilisant ssh).

source: Console output enable button on the web dashboard doesn't persist correctly through a rPi reboot (it needs to be disabled and re-enabled to again get console output).
es_mx: El botón de activación de salida de consola en el dashboard web no persiste correctamente a través de un reinicio de rPi (se debe deshabilitar y volver a habilitar para obtener nuevamente la salida de la consola).
fr_ca: Le bouton d'activation de la sortie de la console sur le tableau de bord Web ne garde pas sa valeur lors d'un redémarrage rPi (il doit être désactivé et réactivé pour obtenir à nouveau la sortie de la console).
