Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/frcvision/morphological-operations.po
Languages: es_mx

source: Morphological Operations
es_mx: Operaciones morfológicas

source: Sometimes, after thresholding your image, you have unwanted noise in your binary image. Morphological operations can help remove that noise from the image.
es_mx: A veces, después de descomponer su imagen, tiene ruido no deseado en su imagen binaria. Las operaciones morfológicas pueden ayudar a eliminar ese ruido de la imagen.

source: Kernel
es_mx: Núcleo

source: The kernel is a simple shape where the origin is superimposed on each pixel of value 1 of the binary image. OpenCV limits the kernel to a NxN matrix where N is an odd number. The origin of the kernel is the center. A common kernel is
es_mx: El núcleo es una forma simple donde el origen se superpone en cada píxel de valor 1 de la imagen binaria. OpenCV limita el núcleo a una matriz NxN donde N es un número impar. El origen del núcleo es el centro. Un núcleo común es

source: Different kernels can affect the image differently, such as only eroding or dilating vertically.
es_mx: Diferentes núcleos pueden afectar la imagen de manera diferente, como erosionarse o dilatarse verticalmente.

source: For reference, this is our binary image we created:
es_mx: Como referencia, esta es nuestra imagen binaria que creamos:

source: Erosion
es_mx: Erosión

source: Erosion in computer vision is similar to erosion on soil. It takes away from the borders of foreground objects. This process can remove noise from the background.
es_mx: La erosión en la visión por computadora es similar a la erosión en el suelo. Le quita las fronteras de objetos en primer plano. Este proceso puede eliminar el ruido del fondo.

source: During erosion, if the superimposed kernel's pixels are not contained completely by the binary image's pixels, the pixel that it was superimposed on is deleted.
es_mx: Durante la erosión, si los píxeles superpuestos del núcleo no están contenidos completamente por los píxeles de la imagen binaria, se elimina el píxel en el que se superpuso.

source: Dilation
es_mx: Dilatación

source: Dilation is opposite of erosion. Instead of taking away from the borders, it adds to them. This process can remove small holes inside a larger region.
es_mx: La dilatación es opuesta a la erosión. En lugar de alejarse de las fronteras, se agrega a ellos. Este proceso puede eliminar pequeños agujeros dentro de una región más grande.

source: During dilation, every pixel of every superimposed kernel is included in the dilation.
es_mx: Durante la dilatación, cada píxel de cada núcleo superpuesto se incluye en la dilatación.

source: Opening
es_mx: Apertura

source: Opening is erosion followed by dilation. This process removes noise without affecting the shape of larger features.
es_mx: La apertura es erosión seguida de dilatación. Este proceso elimina el ruido sin afectar el forma de características más grandes.

source: In this specific case, it is appropriate to do more iterations of opening in order to get rid of the pixels in the top right.
es_mx: En este caso específico, es apropiado hacer más iteraciones de apertura para lograr deshacerse de los píxeles en la parte superior derecha.

source: Closing
es_mx: Clausura

source: Closing is dilation followed by erosion. This process removes small holes or breaks without affecting the shape of larger features.
es_mx: El cierre es dilatación seguida de erosión. Este proceso elimina pequeños agujeros o roturas sin afectar la forma de las características más grandes.
