Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/frcvision/the-raspberry-pi-frc-console.po
Languages: es_mx, zh_cn

source: The Raspberry PI
es_mx: La Raspberry Pi
zh_cn: 树莓派

source: FRC Console
es_mx: Consola FRC
zh_cn: FRC终端

source: The FRC\ |reg| image for the Raspberry PI includes a console that can be viewed in any web browser that makes it easy to:
es_mx: La imagen de FRC\ |reg| para el Raspberry PI incluye una consola que se puede ver en cualquier navegador que hace fácil:

source: Look at the Raspberry PI status
es_mx: Ver el estado de Raspberry PI
zh_cn: 查看树苺派的状态

source: View the status of the background process running the camera
es_mx: Ver el estado del proceso en segundo plano ejecutando la cámara
zh_cn: 查看摄像头的后台进程状态

source: View or change network settings
es_mx: Ver o cambiar la configuración de red
zh_cn: 查看或者更改网络设置

source: Look at each camera plugged into the rPI and add additional cameras
es_mx: Ver cada cámara conectada al rPI y agregar cámaras adicionales
zh_cn: 查看接入树莓派的摄像头以及额外的摄像头

source: Load a new vision program onto the rPI
es_mx: Cargar un nuevo programa de visión en el rPI
zh_cn: 加载一个视觉程序到树莓派上

source: Setting the rPI to be Read-Only vs. Writable
es_mx: Configurar el rPI para que sea de solo lectura en lugar de escribible
zh_cn: 设置树莓派为只读还是读写

source: The rPI is normally set to Read-Only which means that the file system cannot be changed. This ensures that if power is removed without first shutting down the rPi the file system isn't corrupted. When settings are changed (following sections), the new settings cannot be saved while the rPI file system is set as Read-Only. Buttons are provided that allow the file system to be changed from Read-Only to Writable and back whenever changes are made. If the other buttons that change information stored on the rPI cannot be press, check the Read-Only status of the system.
es_mx: El rPI normalmente está configurado en Solo lectura, lo que significa que el sistema de archivos no se puede cambiar. Esto garantiza que si se corta la alimentación sin apagar primero el rPi, el sistema de archivos no se apagará. Cuando se cambia la configuración (siguientes secciones), la nueva configuración no se puede guardar mientras el sistema de archivos rPI está configurado como de solo lectura. Se proporcionan botones que permiten el sistema de archivos para cambiar de solo lectura a escritura y viceversa cada vez que se realicen cambios. Si los otros botones que cambian la información almacenada en el rPI no se pueden presionar, verifique el estado de solo lectura del sistema.
zh_cn: 通常来说树莓派是被设置为只读的，这意味着其文件系统是无法被更改的，这保证了如果电源在树莓派的文件系统关闭前先关闭，文件系统不会被破坏。但是当一些设置被改变了(接下来的内容），那么新的设置将无法被保存在树莓派的文件系统当中。提供了按钮来允许文件系统设置为只读或者读写。如果按钮无法被点击，请查看系统的只读状态。

source: Status of the network connection to the rPI
es_mx: Estado de la conexión de red al rPI
zh_cn: 树莓派的网络连接状态

source: There is a label in the top right corner of the console that indicates if the rPi is currently connected. It will change from Connected to Disconnected if there is no longer a network connection to the rPi.
es_mx: Hay una etiqueta en la esquina superior derecha de la consola que indica si el rPi está actualmente conectado. Cambiará de Conectado a Desconectado si ya no hay una conexión red a la rPi.
zh_cn: 在终端的右上角有一个标签显示树苺派是否处于连接状态。如果树苺派断开了连接，那么标签就会从Connected变为Disconnected。

source: System status
es_mx: Estado de la visión
zh_cn: 系统状态

source: The system status shows what the CPU on the rPI is doing at any time. There are two columns of status values, on being a 1 second average and the other a 5 second average. Shown is:
es_mx: El estado del sistema muestra lo que está haciendo la CPU en el rPI en cualquier momento. Hay dos columnas de valores de estado, al ser un promedio de 1 segundo y el otro un promedio de 5 segundos. Lo que se muestra es:
zh_cn: 系统状态显示了在任何时候树莓派的CPU状态。这里有两列状态值：第一列是在过去1s当中的平均值，第二列是在过去5s当中的平均状态。如下：

source: free and available RAM on the PI
es_mx: RAM libre y disponible en el PI
zh_cn: 树莓派上可用的RAM

source: CPU usage for user processes and system processes as well as idle time.
es_mx: Uso de CPU para procesos de usuario y procesos del sistema, así como tiempo de inactividad.
zh_cn: CPU使用率（包括系统进程、用户进程、空闲时间）

source: And network bandwidth - which allows one to determine if the used camera bandwidth is exceeding the maximum bandwidth allowed in the robot rules for any year.
es_mx: Y el ancho de banda de la red, que permite determinar si el ancho de banda de la cámara utilizada excede el ancho de banda máximo permitido en las reglas del robot para cualquier año.
zh_cn: 网络频宽值- 可以用来查看所使用的摄像头的带宽是否超过了该年机器人赛季规则所允许的最大带宽。

source: Vision Status
es_mx: Estado de la visión
zh_cn: 视觉状态

source: Allows monitoring of the task which is running the camera code in the rPI, either one of the default programs or your own program in Java, C++, or Python. You can also enable and view the console output to see messages coming from the background camera service. In this case there are number of messages about being unable to connect to network tables (NT: connect()) because in this example the rPI is simply connected to a laptop with no Network Tables server running (usually the roboRIO.)
es_mx: Permite el monitoreo de la tarea que ejecuta el código de la cámara en el rPI, ya sea uno de los programas predeterminados o su propio programa en Java, C ++ o Python. También puedes habilitar y ver la salida de la consola para ver los mensajes que provienen del servicio de cámara de fondo. En este caso, hay varios mensajes sobre la imposibilidad de conectarse a las tablas de red (NT: connect ()) porque en este ejemplo, el rPI simplemente está conectado a una computadora portátil sin Servidor de tablas de red en ejecución (generalmente el roboRIO).
zh_cn: 用来监控树苺派中运行摄像头程序的进程，可能是默认程序，也可能是使用Java，C++， Python编写的自定义程序。同样，你可以允许控制台输出并查看后台摄像头服务的输出信息。在这个示例中，树莓派只是被连接到电脑的，而没有连接到网络表（Network Table）服务器（通常是roboRIO），所以将会出现很多无法连接到网络表（Network Tables）的提示信息（NT：connect( )）

source: Network Settings
es_mx: Configuración de la red
zh_cn: 网络设置

source: The rPI network settings have options to connect to the PI:
es_mx: La configuración de red rPI tiene opciones para conectarse al PI:
zh_cn: 树莓派有以下几个网络连接选项：

source: DHCP - the default name resolution usually used by the roboRIO. The default name is raspberry.local.
es_mx: DHCP - la resolución de nombre predeterminada que usualmente usa el roboRIO. El nombre predeterminado es raspberry.local.
zh_cn: DHCP - roboRIO通常使用预设的域名解析方案。默认域名：raspberry.local

source: Static - where a fixed IP address, network mask, and router settings are filled in explicitly
es_mx: Estática - donde una dirección IP fija, una máscara de red y la configuración del enrutador se completan explícitamente
zh_cn: Static - 需要明确填写静态IP地址，网络掩码，以及路由器信息

source: DHCP with Static Fallback - DHCP with Static Fallback - the PI will try to get an IP address via DHCP, but if it can't find a DHCP server, it will use the provided static IP address and parameters
es_mx: DHCP con recuperación estática - DHCP con recuperación estática - el PI intentará obtener una dirección IP a través de DHCP, pero si no puede encontrar un servidor DHCP, utilizará la IP estática proporcionando dirección y parámetros
zh_cn: DHCP with Static FallBack - 树苺派将通过DHCP获得IP地址。但如果找不到DHCP服务器，那么它会使用提供的静态IP地址和其他参数

source: The picture above is showing the settings for both DHCP and Static IP Addressing. The mDNS name for the rPi should always work regardless of the options selected above.
es_mx: La imagen de arriba muestra la configuración de DHCP y direccionamiento IP estático. El nombre mDNS para el rPi siempre debería funcionar independientemente de las opciones seleccionadas anteriormente.
zh_cn: 上图描述的是DHCP和静态IP地址的设置。无论使用那种选项，树莓派的mDNS域名应始终有效。

source: Vision Settings
es_mx: Configuraciones de visión
zh_cn: 视觉设置

source: The Vision Settings are to set the parameters for each camera and whether the rPI should be a NetworkTables client or server. There can only be one server on the network and the roboRIO is always a server. Therefor when connected to a roboRIO, the rPI should always be in client mode with the team number filled in. If testing on a desktop setup with no roboRIO or anything acting as a server then it should be set to Server (Client switch is off).
es_mx: Los ajustes de visión son para establecer los parámetros para cada cámara y si el rPI debe ser un cliente o servidor de NetworkTables. Solo puede haber un servidor en la red y el roboRIO es siempre un servidor. Por lo tanto, cuando se conecta a un roboRIO, el rPI siempre debe ser en modo cliente con el número de equipo lleno. Si está probando en una configuración de escritorio sin roboRIO o cualquier cosa que actúe como un servidor, entonces debe establecerse en Servidor (el interruptor del Cliente está apagado).
zh_cn: 视觉设置是设置每个摄像头的参数，以及设置树莓派成为网络表（Network Tables）的客户端或服务器。网络中只有一个服务端，而这个服务端是roboRIO。因此当接入roboRIO时，树莓派应该设置为客户端模式，并配置队号。如果是在电脑上进行测试而并未连接roboRIO，或是没有设备为服务器时，树莓派应该被设置为服务器（客户端选为关）。

source: To view and manipulate all the camera settings click on the camera in question. In this case the camera is called "Camera rPi Camera 0" and clicking on the name reveals the current camera view and the associated settings.
es_mx: Para ver y manipular todos los ajustes de la cámara, haga clic en la cámara en cuestión. En este caso la cámara se llama "Camera rPi Camera 0" y al hacer clic en el nombre se muestra la actual vista de cámara y la configuración asociada.
zh_cn: 如果要查看并更改某一摄像头的所有设置，请点击此摄像头的名称。如上图所示，摄像头的名称是Camera rPi Camera 0。点击后，会有如下图所示的配置界面。

source: Manipulating the camera settings is reflected in the current camera view. The bottom of the page shows all the possible camera modes (combinations of Width, Height, and frame rates) that are supported by this camera.
es_mx: La manipulación de la configuración de la cámara se refleja en la vista actual de la cámara. El fondo de la página muestra todos los modos de cámara posibles (combinaciones de ancho, alto y velocidad de fotogramas) que son compatibles con esta cámara.
zh_cn: 在这个状态下可以对摄像头进行设置。在图示页面的底部还有此摄像头所支持的所有模式(包含长度，宽度，帧率）。

source: Getting the current settings to persist over reboots
es_mx: Conseguir que la configuración actual persista durante los reinicios
zh_cn: 保存现在的设置以在重启后使用

source: The rPi will load all the camera settings on startup. Editing the camera configuration in the above screen is temporary. To make the values persist click on the "Load Source Config From Camera" button and the current settings will be filled in on the camera settings fields. Then click "Save" at the bottom of the page. Note: you must set the file system Writeable in order to save the settings. *The Writeable button is at the top of the page.*
es_mx: El rPi cargará todos los ajustes de la cámara al inicio. La edición de la configuración de la cámara en el la pantalla de arriba es temporal. Para que los valores persistan, haga clic en "Cargar configuración de origen desde Cámara " y la configuración actual se completará en los campos de configuración de la cámara. Luego haga clic en "Guardar" en la parte inferior de la página. Nota: debe configurar el sistema de archivos de escritura en orden para guardar la configuración. *El botón de escritura se encuentra en la parte superior de la página.*
zh_cn: 树苺派会在启动的时候加载所有的摄像头设置。如上图所示的修改是临时的。想要让其储存下来，需要点击按钮“Load Source Config From Camera”，之后当前设置会填入如下所示的界面。最后点击页面下方的保存按钮。提醒：必须要让文件系统处于Writeable（读写）的状态，设置其的按钮位于页面的顶部。

source: There are some commonly used camera settings values shown in the camera settings (above). These values Brightness, White Balance, and Exposure are loaded into the camera before the user JSON file is applied. So if a user JSON file contains those settings they will overwrite the ones from the text field.
es_mx: Hay algunos valores de configuración de la cámara de uso común que se muestran en la configuración de la cámara (arriba). Estos valores de Brillo, Balance de blancos y Exposición se cargan en la cámara antes de Se aplica el archivo JSON del usuario. Entonces, si un archivo JSON de usuario contiene esa configuración, se sobrescribirán los del campo de texto.
zh_cn: 上图展示了一些常用的摄像头设定值，包括亮度、白平衡、曝光。这些都会在用户的JSON文件被应用之前载入摄像头。所以如果用户JSON文件包含了这些设置，那么文本框内的这些内容将会被用户JSON中的相关内容覆盖。

source: Application
es_mx: Aplicación
zh_cn: 应用程序

source: The Application tab shows the application that is currently running on the rPi.
es_mx: La pestaña Aplicación muestra la aplicación que se está ejecutando actualmente en el rPi.
zh_cn: 应用程序一栏展示了当前正在树苺派上运行的程序。

source: Vision workflows
es_mx: Flujos de trabajo de Visión
zh_cn: 视觉工作流

source: There is a sample vision program using OpenCV in each of the supported languages, C++, Java, or Python. Each sample program can capture and stream video from the rPi. In addition, the samples have some minimal OpenCV. They are all set up to be extended to replace the provided OpenCV sample code with the code needed for the robot application. The rPi Application tab supports a number of programming workflows:
es_mx: Hay un programa de visión de muestra que usa OpenCV en cada uno de los lenguajes compatibles, C ++, Java o Python. Cada programa de muestra puede capturar y transmitir video desde el rPi. Además, las muestras tienen algunos OpenCV mínimos. Todos están configurados para ser extendidos para reemplazar el código de muestra de OpenCV proporcionado con el código necesario para la aplicación del robot. La pestaña Aplicación de rPI admite varios flujos de trabajo de programación:
zh_cn: 对于每一种支持的编程语言：C++、Java、Python，都有OpenCV的样例程序。这些样例程序都可以捕获并且传输视频流到树苺派上。另外，这些示例程序少量地使用了OpenCV，并都可作为模板根据具体需求扩展内容。树苺派的应用程序一栏还支持以下的程序工作流：

source: Stream one or more cameras from the rPi for consumption on the driver station computer and displayed using ShuffleBoard
es_mx: Transmita una o más cámaras desde el rPi para consumo en la computadora de la driver station y se muestra usando ShuffleBoard
zh_cn: 传输一个或者多个摄像头的视频到Driver Station，并通过ShuffleBoard显示图像

source: Edit and build one of the sample programs (one for each language: Java, C++ or Python) on the rPi using the included toolchains
es_mx: Edite y cree uno de los programas de muestra (uno para cada idioma: Java, C ++ o Python) en el rPi usando las cadenas de herramientas incluidas
zh_cn: 在树苺派上通过内置的工具链编辑并编译一个示例程序（每种程序语言都有对应的一个示例：C++、Java、Python）

source: Download a sample program for the chosen language and edit and build it on your development computer. Then upload that built program back to the rPi
es_mx: Descargue un programa de muestra para el idioma elegido y edítelo y compílelo en su computadora de desarrollo. Luego cargue ese programa construido de nuevo en el rPi
zh_cn: 下载一个你所需要的编程语言的示例程序并且在开发用电脑上进行编辑和编译。之后再将其上传至树苺派

source: Do everything yourself using completely custom applications and scripts (probably based on one of the samples)
es_mx: Haga todo usted mismo utilizando aplicaciones y scripts completamente personalizados (probablemente basados en una de las muestras)
zh_cn: 通过自定义的应用程序和脚本（DIY）完成所有的任务（通常是基于一个示例的）

source: The running application can be changed by selecting one of the choices in the drop-down menu. The choices are:
es_mx: La aplicación en ejecución se puede cambiar seleccionando una de las opciones en el menú desplegable. Las opciones son:
zh_cn: 通过选择下拉菜单中的选项，可以改变正在运行的应用程序。选择有：

source: Built-in multi camera streaming which steams whatever cameras are plugged into the rPi. The camera configuration including number of cameras can be set on the "Vision Settings" tab.
es_mx: Transmisión de cámaras múltiples incorporada que vaporiza cualquier cámara que esté conectada a rPi. La configuración de la cámara, incluida la cantidad de cámaras, se puede configurar en la “Configuración de Visión "
zh_cn: 使用内置的（多）摄像头视频流传回，无论哪些摄像头连上了树苺派。摄像头设置可以在“Vision Settings”（视觉设置）标签更改

source: Custom application which doesn't upload anything to the rPi and assumes that the developer wants to have a custom program and script.
es_mx: Aplicación personalizada que no carga nada en el rPi y supone que el desarrollador quiere tener un programa y script personalizados.
zh_cn: 自定义的应用程序，不会上传任何东西到树苺派，假定开发者想要运行其自己的程序和脚本

source: Java, C++ or Python pre-installed sample programs that can be edited into your own application.
es_mx: Programas de muestra preinstalados de Java, C ++ o Python que se pueden editar en su propia solicitud.
zh_cn: 使用Java、C++、Python的示例程序（示例程序可被修改成你所要的样子）

source: Java, C++, or Python uploaded program. Java programs require a ``.jar`` file with the compiled program and C++ programs require an rPi executable to be uploaded to the rPI.
es_mx: Programa cargado en Java, C ++ o Python. Los programas Java requieren un archivo ``.jar`` con el programa compilado y los programas C ++ requieren que se cargue un ejecutable rPi en el rPI.

source: When selecting one of the Upload options, a file chooser is presented where the jar, executable or Python program can be selected and uploaded to the rPi. In the following picture an Uploaded Java jar is chosen and the "Choose File" button will select a file and clicking on the "Save" button will upload the selected file.
es_mx: Al seleccionar una de las opciones de Carga, se presenta un selector de archivos donde el archivo jar, ejecutable o el programa Python se puede seleccionar y cargar en el rPi. En la siguiente imagen Java jar subida es elegida y el botón "Elegir archivo" seleccionará un archivo y hará clic en el botón "Guardar" cargará el archivo seleccionado.
zh_cn: 当选择上传选项时，只可在文件选择窗口选择 jar文件，可执行文件或是Python程序上传到树莓派。下列的图片展示了选择Upload Java jar选项之后，可单击“选择文件”按钮选择jar文件，最后点击“Save”按钮上传已选择的文件。

source: Note: in order to Save a new file onto the rPi, the file system has to be set writeable using the "Writable" button at the top left of the web page. After saving the new file, set the file system back to "Read-Only" so that it is protected against accidental changes.
es_mx: Nota: para guardar un nuevo archivo en el rPi, el sistema de archivos debe configurarse para que se pueda escribir usando el botón "Writable" en la esquina superior izquierda de la página web. Después de guardar el nuevo archivo, configure el archivo sistema de nuevo a "Solo lectura" para que esté protegido contra cambios accidentales.
zh_cn: 提醒：为了向树莓派保存新文件，必须要让文件系统处于Writeable（读写）的状态，而设置其的按钮位于页面的上方。但是在保存之后，建议将其改回只读状态，这样可以保护文件系统不被误操作。

source: The FRC image for the Raspberry PI includes a console that can be viewed in any web browser that makes it easy to:
zh_cn: FRC的树苺派镜像包含一个终端，并且可以在任何浏览器中：

source: Java, C++, or Python uploaded program. Java programs require a .jar file with the compiled program and C++ programs require an rPi executable to be uploaded to the rPI.
zh_cn: 上传Java、C++、Python的程序。若选择Java程序需要上传编译好的*.jar文件。若选择C++程序需要上传可以在树苺派上执行的可执行文件
