Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/frcvision/using-the-raspberry-pi-for-frc.po
Languages: fr_ca

source: Using the Raspberry Pi for FRC
fr_ca: Utilisation du Raspberry Pi pour FRC

source: One of the most popular coprocessor choices is the Raspberry Pi because:
fr_ca: Un des coprocesseurs les plus populaires est le Raspberry Pi car:

source: Low cost - around $35
fr_ca: Il a un coût raisonnable- environ $35 US

source: High availability - it's easy to find Raspberry Pis from a number of suppliers, including Amazon
fr_ca: Sa disponibilité - il est facile de trouver le Raspberry Pi auprès d'un certain nombre de fournisseurs, y compris Amazon

source: Very good performance - the current Raspberry Pi 3b+ has the following specifications:
fr_ca: Il a de très bonnes performances - le Raspberry Pi 3b + a les spécifications suivantes:

source: Technical Specifications: - Broadcom BCM2837BO 64 bit ARMv8 QUAD Core A53 64bit Processor powered Single Board Computer run at 1.4GHz - 1GB RAM - BCM43143 WiFi on board - Bluetooth Low Energy (BLE) on board - 40 pin extended GPIO - 4 x USB2 ports - 4 pole Stereo output and Composite video port - Full size HDMI - CSI camera port for connecting the Raspberry - Pi camera - DSI display port for connecting the Raspberry - Pi touch screen display - MicroSD port for loading your operating system and storing data - Upgraded switched Micro USB power source (now supports up to 2.5 Amps.
fr_ca: Spécifications techniques: - Ordinateur à carte unique Broadcom BCM2837BO 64 bits ARMv8 QUAD Core A53 64 bits alimenté par processeur à 1,4 GHz - 1 Go de RAM - BCM43143 WiFi à bord - Bluetooth Low Energy (BLE) à bord - GPIO étendu à 40 broches - 4 ports USB2 - Sortie stéréo 4 pôles et port vidéo composite - HDMI pleine taille - Port de caméra CSI pour connecter la caméra Raspberry Pi - Port d'affichage DSI pour connecter un écran tactile - Port MicroSD pour charger votre système d'exploitation et stocker des données - Connecteur pour la source d'alimentation capable de prendre en charge jusqu'à 2.5 ampères sur les ports USB.

source: Pre-built Raspberry Pi image
fr_ca: Image Raspberry Pi pré-construite

source: To make using the Raspberry Pi as easy as possible for teams, there is a provided Raspberry Pi image. The image can be copied to a micro SD card, inserted into the Pi, and booted. By default it supports:
fr_ca: Pour rendre l'utilisation du Raspberry Pi aussi simple que possible pour les équipes, une image Raspberry Pi est fournie. L'image peut être copiée sur une carte micro SD, insérée dans le Pi et démarrée. Par défaut, il prend en charge:

source: A web interface for configuring it for the most common functions
fr_ca: Une interface web pour configurer le rPi pour les fonctions les plus courantes

source: Supports an arbitrary number camera streams (defaults to one) that are published on the network interface
fr_ca: Prend en charge un nombre arbitraire de flux de caméras (par défaut un) qui sont publiés sur l'interface réseau

source: OpenCV, Network Tables, Camera Server, and language libraries for C++, Java, and Python custom programs
fr_ca: OpenCV, Network Tables, Camera Server et bibliothèques de langues pour les programmes personnalisés C++, Java et Python

source: If the only requirement is to stream one or more cameras to the network (and dashboard) then no programming is required and can be completely set up through the web interface.
fr_ca: Si la seule exigence est de diffuser une ou plusieurs caméras sur le réseau (et le tableau de bord), aucune programmation n'est requise et ces tâches peuvent être entièrement configurées via l'interface Web.

source: The next section discusses how to install the image onto a flash card and boot the Pi.
fr_ca: La section suivante explique comment installer l'image sur une carte flash et démarrer le Pi.
