Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/frcvision/working-with-contours.po
Languages: es_mx

source: Working with Contours
es_mx: Trabajar con Contornos

source: After thresholding and removing noise with morphological operations, you are now ready to use OpenCV's ``findContours`` method. This method allows you to generate contours based on your binary image.
es_mx: Después de reducir y eliminar el ruido con operaciones morfológicas, ahora está listo para usar el método findContours de OpenCV. Este método le permite generar contornos basados ​​en tu imagen binaria.

source: Finding and Filtering Contours
es_mx: Encontrar y filtrar Contornos

source: In cases where there is only one vision target, you can just take the largest contour and assume that that is the target you are looking for. When there is more than one vision target, you can use size, shape, fullness, and other properties to filter unwanted contours out.
es_mx: En los casos en que solo hay un objetivo de visión, puede tomar el contorno más grande y suponga que ese es el objetivo que está buscando. Cuando hay más de un objetivo de visión, puede usar tamaño, forma, plenitud y otras propiedades para filtrar contornos no deseados.

source: If you draw the contour you just found, it should look something like this:
es_mx: Si dibuja el contorno que acaba de encontrar, debería verse más o menos así:

source: Extracting Information from Contours
es_mx: Extracción de información de Contornos

source: Now that you've found the contour(s) that you want, you now want to get information about it, such as the center, corners, and rotation.
es_mx: Ahora que ha encontrado los contorno(s) que desea, ahora desea obtener información sobre estos como el centro, las esquinas y la rotación.

source: Center
es_mx: Centro

source: Corners
es_mx: Esquinas

source: Rotation
es_mx: Rotación

source: For more information on how you can use these values, see :ref:`docs/software/vision-processing/introduction/identifying-and-processing-the-targets:Measurements`
es_mx: Para obtener más información sobre cómo puede usar estos valores, consulte :ref:`docs/software/vision-processing/introduction/identifying-and-processing-the-targets:Measurements`

source: Publishing to NetworkTables
es_mx: Publicar a NetworkTables

source: You can use NetworkTables to send these properties to the Driver Station and the RoboRIO. Additional processing could be done on the Raspberry Pi, or the RoboRIO itself.
es_mx: Puede usar NetworkTables para enviar estas propiedades a la Driver Station y RoboRIO. Se podría realizar un procesamiento adicional en la Raspberry Pi o en el propio RoboRIO.
