Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/controls-overviews/control-system-software.po
Languages: fr_ca, ja, tr_tr, zh_cn

source: The FRC Driver Station Log Viewer is used to view logs created by the FRC Driver Station. These logs contain a variety of information important for understanding what happened during a practice session or FRC match. More information about the FRC Driver Station Log Viewer and understanding the logs can be found :ref:`here <docs/software/driverstation/driver-station-log-viewer:Driver Station Log File Viewer>`
fr_ca: La visionneur FRC Driver Station Log Viewer est utilisé pour afficher les journaux créés par FRC Driver Station. Ces journaux contiennent une variété d’informations importantes pour comprendre ce qui s’est passé lors d’une séance de pratique ou d’un match FRC. Vous pouvez trouver plus d’informations sur le visionneur FRC Driver Station Log Viewer et l'interprétation des informations des journaux :ref:`ici <docs/software/driverstation/driver-station-log-viewer:Driver Station Log File Viewer>`
ja: FRCドライバーステーションのログビューアは、FRCドライバーステーションが書き込んだログを表示するために使用します。これらのログには、練習セッションやFRCの試合中に何が起こったかを理解するために重要な、様々な情報が含まれています。FRCドライバーステーションのログビューアの使い方や、ログを理解するための詳しい情報は、 :ref:`こちら <docs/software/driverstation/driver-station-log-viewer:Driver Station Log File Viewer>` をご覧ください。
tr_tr: FRC Driver Station Günlük Görüntüleyicisi, FRC Driver Station tarafından oluşturulan günlükleri görüntülemek için kullanılır. Bu günlükler, bir antrenman seansı veya FRC maçı sırasında ne olduğunu anlamak için önemli çeşitli bilgiler içerir. FRC Sürücü İstasyonu Günlük Görüntüleyicisi hakkında daha fazla bilgi ve günlükleri anlamak şu adreste bulunabilir :ref:`burada <docs/software/driverstation/driver-station-log-viewer:Driver Station Log File Viewer>` .
zh_cn: FRC Driver Station日志查看器可用于查看FRC Driver Station创建的日志。 这些日志包含各种信息，对于理解练习或FRC比赛期间发生的事情非常重要。 有关FRC Driver Station Log Viewer和了解日志的更多信息，请参见 :ref:`此处 <docs/software/driverstation/driver-station-log-viewer:Driver Station Log File Viewer>`

source: RobotBuilder
zh_cn: RobotBuilder 软件

source: RobotBuilder building a robot with two subsystems.
fr_ca: RobotBuilder construisant un robot avec deux sous-systèmes.
ja: 2つのサブシステムでロボットを構築するRobotBuilder。
tr_tr: İki alt sistemli robot kuran RobotBuilder.
zh_cn: RobotBuilder构建了一个有两个子系统的机器人。

source: RobotBuilder is a tool designed to aid in setup and structuring of a Command Based robot project for C++ or Java. RobotBuilder allows you to enter in the various components of your robot subsystems and operator interface and define what your commands are in a graphical tree structure. RobotBuilder will then generate structural template code to get you started. More information about RobotBuilder can be found :ref:`here <docs/software/wpilib-tools/robotbuilder/index:RobotBuilder>`. More information about the Command Based programming architecture can be found :ref:`here <docs/software/commandbased/index:Command-Based Programming>`.
fr_ca: RobotBuilder est un outil conçu pour faciliter la configuration et la structuration d’un projet de robot orienté commande pour C++ ou Java. RobotBuilder vous permet d’entrer dans les différents composants de vos sous-systèmes robot et interface opérateur et de définir ce que vos commandes sont dans une structure graphique arborescente. RobotBuilder générera alors un modèle structurel du code pour vous aider à démarrer. Plus d’informations sur RobotBuilder peuvent être trouvées :ref:`ici <docs/software/wpilib-tools/robotbuilder/index:RobotBuilder>`. Pour plus d’informations sur l’architecture de programmation commande, cliquez sur :ref:`ici <docs/software/commandbased/index:Command-Based Programming>`.
zh_cn: RobotBuilder是一种工具，旨在帮助设置和构建用于C ++或Java的基于命令的机器人项目。 RobotBuilder允许您输入机器人子系统和操作员界面的各个组件，并定义图形树形结构中的命令。然后，RobotBuilder将生成结构化模板代码，以帮助您入门。有关RobotBuilder的更多信息，请参见：此处<docs/software/wpilib-tools/robotbuilder/index:RobotBuilder>`。可以在此处找到有关基于指令的编程体系结构的更多信息。

source: Robot Simulation
fr_ca: Simulateur de robot
ja: ロボット・シミュレーション
tr_tr: Robot Simülasyonu
zh_cn: Robot Simulation 软件

source: The Simulation GUI similar to Glass but also has Joysticks and control over the robot state and a few other features.
fr_ca: L’interface graphique de simulation est similaire à Glass, mais dispose également de joysticks et d’un contrôle sur l’état du robot et quelques autres fonctionnalités.
ja: シミュレーションのGUIはGlassに似ていますが、ジョイスティックがあり、ロボットの状態や他のいくつかの機能をコントロールできます。
tr_tr: Simülasyon kullanıcı arayüzü Glass'a benzemekte, ancak oyun kollarına ve robot durumuna dair kontrol ile başka birkaç özelliğe de sahiptir.
zh_cn: 模拟GUI类似于谷歌眼镜，但也有操纵杆和控制机器人状态和一些其他功能。

source: Robot Simulation offers a way for Java and C++ teams to verify their actual robot code is working in a simulated environment. This simulation can be launched directly from VS Code and includes a 2D field that users can visualize their robot's movement on. For more information see the :ref:`Robot Simulation section <docs/software/wpilib-tools/robot-simulation/introduction:Introduction to Robot Simulation>`.
fr_ca: Robot Simulation est un outil qui offre aux équipes Java et C++ un moyen de vérifier que leur code robot réel fonctionne dans un environnement simulé. Cette simulation peut être lancée directement à partir de VS Code et comprend un terrain 2D dont les utilisateurs peuvent servir pour visualiser le mouvement de leur robot. Pour plus d’informations, consultez la section :ref:`Simulation du robot <docs/software/wpilib-tools/robot-simulation/introduction:Introduction to Robot Simulation>`.
zh_cn: Robot Simulation为Java和C ++团队提供了一种验证编好的机器人代码在仿真环境中运行的途径。 该环境可以直接用VS Code启动，包含一个2D字段，以使用户直观地看到机器人的运动。 有关更多信息，请见:ref:`Robot Simulation section <docs/software/wpilib-tools/robot-simulation/introduction:Introduction to Robot Simulation>`。

source: FRC LabVIEW Robot Simulator (Windows Only)
fr_ca: FRC LabVIEW Simulateur de robot (Windows seulement)
ja: FRC LabVIEWのロボット・シミュレーター（Windowsのみ）
tr_tr: FRC LabVIEW Robot Simülatörü (Yalnızca Windows)
zh_cn: FRC LabVIEW Robot Simulator (仅支持 Windows)

source: The FRC Robot Simulator is a component of the LabVIEW programming environment that allows you to operate a predefined robot in a simulated environment to test code and/or Driver Station functions. Information on using the FRC Robot Simulator can be found `here <https://forums.ni.com/t5/FIRST-Robotics-Competition/LabVIEW-Tutorial-10-Robot-Simulation/ta-p/3739702?profile.language=en>`__ or by opening the Robot Simulation Readme.html file in the LabVIEW Project Explorer.
fr_ca: Le simulateur FRC Robot Simulatordriver station est un composant de l’environnement de programmation LabVIEW qui vous permet d’utiliser un robot prédéfini dans un environnement simulé pour tester le code et/ou les fonctions de la Driver Station. Vous pouvez trouver des informations sur l’utilisation du simulateur FRC Robot Simulator `ici <https://forums.ni.com/t5/FIRST-Robotics-Competition/LabVIEW-Tutorial-10-Robot-Simulation/ta-p/3739702?profile.language=en>`__ ou en ouvrant le fichier Robot Simulation Readme.html dans l'explorateur LabVIEW Project Explorer.
zh_cn: FRC LabVIEW Robot Simulator 是LabVIEW编程环境的组件，允许您在模拟环境中操作预先设定好的机器人以测试代码和/或driver station的功能。 有关使用FRC LabVIEW Robot Simulator的信息，可在`这里 <https://forums.ni.com/t5/FIRST-Robotics-Competition/LabVIEW-Tutorial-10-Robot-Simulation/ta-p/3739702?profile.language=en>`找到，或在LabVIEW项目浏览器中打开Robot Simulation Readme.html文件。

source: PathWeaver
zh_cn: PathWeaver 软件

source: PathWeaver UI with a project for FRC Deep Space plotting a trajectory to the back of the rocket.
fr_ca: PathWeaver UI avec un projet pour FRC Deep Space traçant une trajectoire à l’arrière de la fusée.
ja: FRC Deep Spaceで使用されたプロジェクトを表示するPathWeaver UI。ロケット後部への軌道をプロットしている。
zh_cn: PathWeaver UI与一个项目的FRC深空绘制轨道到火箭的背面。

source: System Identification
fr_ca: Identification du système
tr_tr: System Identification - Sistem Tanımlama
zh_cn: 系统识别

source: System Identification new project screen.
fr_ca: Écran de nouveau projet d'identification du système.
zh_cn: 系统识别新项目屏幕。

source: This tool helps teams automatically calculate constants that can be used to describe the physical properties of your robot for use in features like robot simulation, trajectory following, and PID control. For more information see the :ref:`System Identification section <docs/software/pathplanning/system-identification/introduction:Introduction to System Identification>`.
fr_ca: Cet outil aide les équipes à calculer automatiquement les constantes qui peuvent être utilisées pour décrire les propriétés physiques de votre robot pour une utilisation dans des fonctionnalités telles que la simulation de robot, le suivi de trajectoire et le contrôle PID. Pour plus d'informations, consultez la section :ref:`System Identification <docs/software/pathplanning/system-identification/introduction:Introduction to System Identification>`.
zh_cn: 该工具帮助团队自动计算可以用来描述机器人物理特性的常数，用于机器人仿真、轨迹跟踪和PID控制等功能。更多信息请参阅:ref: ' System Identification section '。

source: OutlineViewer with the preferences dialog box.
fr_ca: OutlineViewer avec la boîte de dialogue des préférences.
ja: ダイアログボックスを表示するOutlineViewer。
zh_cn: 带有首选项对话框的OutlineViewer。

source: OutlineViewer is a utility used to view, modify and add to all of the contents of the NetworkTables for debugging purposes. LabVIEW teams can use the Variables tab of the LabVIEW Dashboard to accomplish this functionality. For more information see the :ref:`Outline Viewer section <docs/software/wpilib-tools/outlineviewer/index:OutlineViewer>`.
fr_ca: OutlineViewer est un utilitaire utilisé pour afficher, modifier et ajouter à tout le contenu des NetworkTables à des fins de débogage. Les équipes LabVIEW peuvent utiliser l'onglet Variables du tableau de bord LabVIEW pour accomplir cette fonctionnalité. Pour plus d'informations, consultez la section :ref:`Outline Viewer <docs/software/wpilib-tools/outlineviewer/index:OutlineViewer>`.
ja: OutlineViewerは、デバッグ目的でNetworkTablesのエントリーを追加、更新、表示できるユーティリティです。LabViewを使用しているチームはこの機能を使うには、LabView DashboardにあるVariablesタブを使用できます。詳細は、 :ref:`OutlineViewerセクション <docs/software/wpilib-tools/outlineviewer/index:OutlineViewer>` をご覧ください。
zh_cn: OutlineViewer是一个实用工具，用于查看、修改和添加到NetworkTables的所有内容，以进行调试。LabVIEW团队可以使用LabVIEW仪表盘的Variables选项卡来完成这个功能。有关更多信息，请参见ref:`Outline Viewer section <docs/software/wpilib-tools/outlineviewer/index:OutlineViewer>`.

source: FRC LabVIEW Robot Simulator
fr_ca: Simulateur de robot FRC LabVIEW
ja: FRC LabVIEWのロボット・シミュレーター
tr_tr: FRC LabVIEW Robot Simülatörü

source: The primary supported OS for FRC components is Windows. All required FRC software components have been tested on Windows 10 & 11.
ja: FRCコンポーネントの主な対応OSはWindowsです。すべての必要なFRCソフトウェア・コンポーネントは、Windows 10および11上で使用することが確認されています。
tr_tr: FRC bileşenleri için desteklenen birincil işletim sistemi Windows'tur. Tüm gerekli FRC yazılım bileşenleri Windows 10 & 11 'de test edilmiştir.

source: Many of the tools for C++/Java/Python programming are also supported and tested on macOS and Linux. Teams programming in C++/Java/Python should be able to develop using these systems, using a Windows system for the Windows-only operations such as the Driver Station, Radio Configuration Utility, and roboRIO Imaging Tool.
ja: C++/Java/Pythonのプログラミング用のツールの多くはmacOSやLinuxでもテストされました。C++/Java/Pythonを使うチームは、これらのオペレーティングシステムを使用して開発できます。そうしても、Driver Station、Wireless Configuration Utility、roboRIOイメージングツールなどのWindowsしかできない操作にはWindowsを使用する必要が残ります。

source: Visual Studio Code is the supported development environment for C++, Java. A guide to getting started with Java and C++ for FRC, including the installation and configuration of Visual Studio Code can be found :ref:`here <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`.
ja: Visual Studio Codeは、C++とJavaの公式サポートされている開発環境です。Visual Studio Codeのインストールと設定を含む、FRCのためのC++またはJavaを使い始めるためのガイドは、 :ref:`こちら <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>` をご覧ください。
tr_tr: Visual Studio Code, C++ ve Java için desteklenen geliştirme ortamıdır. Visual Studio Code'un yüklenmesi ve kurulumu da dahil olmak üzere, FRC özelinde Java ve C++ dillerine başlangıç niteliğindeki kaynaklara :ref:`buradan <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>` ulaşılabilmektedir.

source: RobotBuilder is a tool designed to aid in setup and structuring of a Command Based robot project for C++ or Java (Python not currently supported). RobotBuilder allows you to enter in the various components of your robot subsystems and operator interface and define what your commands are in a graphical tree structure. RobotBuilder will then generate structural template code to get you started. More information about RobotBuilder can be found :ref:`here <docs/software/wpilib-tools/robotbuilder/index:RobotBuilder>`. More information about the Command Based programming architecture can be found :ref:`here <docs/software/commandbased/index:Command-Based Programming>`.
ja: RobotBuilderは、C++やJava（Pythonは現在サポートされていない）を使用したコマンドベースのロボットプロジェクトの構成と設定を支援するツールです。ロボットのサブシステムやオペレータインターフェースの様々なコンポーネントを入力し、グラフィカルなツリー構造でコマンドを定義することができます。すると、RobotBuilderが構造テンプレートコードを生成します。RobotBuilderについての詳細は :ref:`こちら <docs/software/wpilib-tools/robotbuilder/index:RobotBuilder>` にあります。コマンドベースプログラミングアーキテクチャについての詳細は :ref:`こちら <docs/software/commandbased/index:Command-Based Programming>` を参照してください。
tr_tr: RobotBuilder, C++ veya Java yazılımlarında (Python henüz desteklenmemektedir.) Komut Tabanlı - Command Based robot projesinin kurulumu ve yapılandırmasına destek olmak amacıyla tasarlanmış bir araçtır. RobotBuilder, robot alt sistemlerinizin çeşitli bileşenleri ile operatör arayüzünüzü girmenize ve grafiksel bir ağaç yapısı içerisinde komutlarınızı tanımlamanıza olanak tanımaktadır. RobotBuilder, bu girdilerden yola çıkarak, yapısal bir şablon kodu oluşturacaktır. RobotBuilder'a dair daha fazla bilgiye :ref:`buradan <docs/software/wpilib-tools/robotbuilder/index:RobotBuilder>` ulaşabilirsiniz. Komut Tabanlı programlama mimarisine dair daha fazla bilgiye :ref:`buradan <docs/software/commandbased/index:Command-Based Programming>` ulaşabilirsiniz.

source: Robot Simulation offers a way for Java, C++, and Python teams to verify their actual robot code is working in a simulated environment. This simulation can be launched directly from VS Code and includes a 2D field that users can visualize their robot's movement on. For more information see the :ref:`Robot Simulation section <docs/software/wpilib-tools/robot-simulation/introduction:Introduction to Robot Simulation>`.
ja: ロボット・シミュレーションは、Java、C++、およびPythonを使用しているチームが、シミュレーション環境で実際のロボット・コードをチェックする方法を提供します。このシミュレーションはVS Codeから直接起動でき、ユーザーがロボットの動きを視覚化できる2Dフィールドを含んでいます。 詳細は :ref:`ロボットシミュレーションのセクション <docs/software/wpilib-tools/robot-simulation/introduction:Introduction to Robot Simulation>` を参照してください。
tr_tr: Robot Simülasyonu; Java, C++ ve Python kullanan takımlara simülasyon ortamında robot kodlarının çalışıp çalışmadığını doğrulama imkanı sunmaktadır. Bu simülasyon doğruca VS Code üzerinden başlatılabilmekte ve kullanıcıların robotun hareketini görselleştirebileceği 2 boyutlu bir ortam içermektedir. Daha fazla bilgi için bkz. :ref:`Robot Simulation section <docs/software/wpilib-tools/robot-simulation/introduction:Introduction to Robot Simulation>`.

source: PathWeaver allows teams to quickly generate and configure paths for advanced autonomous routines. These paths have smooth curves allowing the team to quickly navigate their robot between points on the field. For more information see the :ref:`PathWeaver section <docs/software/pathplanning/pathweaver/introduction:Introduction to PathWeaver>`.
ja: PathWeaverにより、チームは高度な自律ルーチンの軌道を素早く生成し、設定することができます。これらの軌道は滑らかな曲線を描いており、チームはフィールド上のポイント間でロボットを素早く移動させることができます。詳細は :ref:`PathWeaverのセクション <docs/software/pathplanning/pathweaver/introduction:Introduction to PathWeaver>` をご覧ください。

source: SysId UI showing diagnostics and analysis for a flywheel.
ja: SysId UIは、フライホイールの診断と分析を表示します。
tr_tr: Bir volan için teşhis ve analiz gösteren Sysld arayüzü.

source: This tool helps teams automatically calculate constants that can be used to describe the physical properties of your robot for use in features like robot simulation, trajectory following, and PID control. For more information see the :ref:`System Identification section <docs/software/advanced-controls/system-identification/introduction:Introduction to System Identification>`.
ja: このツールは、ロボットシミュレーション、軌道追従、PID制御などの機能で使用するロボットの物理的特性を記述するために使用できる定数を、チームが自動的に計算するのに役立ちます。詳しい情報は、 :ref:`System Identificationのセクション <docs/software/advanced-controls/system-identification/introduction:Introduction to System Identification>` をご覧ください。
tr_tr: Bu araç, takımların robotun robot simülasyonu, yörünge takibi ve PID kontrolü gibi özelliklerde kullanıma uygun fiziksel özelliklerinin tanımlanmasında kullanılabilen sabitlerin hesaplamasına yardım etmektedir. daha fazla bilgi için bkz. :ref:`System Identification section <docs/software/advanced-controls/system-identification/introduction:Introduction to System Identification>`.

source: roboRIO Team Number Setter tool.
ja: roboRIO Team Number Setter ツール。

source: The roboRIO Team Number Setter is a cross-platform utility that can be used to set the team number on the roboRIO. It is an alternative to the roboRIO imaging tool for setting the team number. For more information see the :ref:`roboRIO Team Number Setter section <docs/software/wpilib-tools/roborio-team-number-setter/index:roboRIO Team Number Setter>`.
ja: roboRIO Team Number Setter ツールは、roboRIO上のチーム番号を設定するために使用できるクロスプラットフォームユーティリティです。チーム番号を設定するためのroboRIOイメージングツールの代替手段です。詳細については、 :ref:`roboRIO Team Number Setter セクション <docs/software/wpilib-tools/roborio-team-number-setter/index:roboRIO Team Number Setter>` を参照してください。
tr_tr: roboRIO Takım Numarası Belirleyicisi, roboRIO'da takım numarasını belirlemek için kullanılabilen birden fazla programla uyumlu yardımcı bir programdır. Program, takımlara takım numarasını belirlemek için roboRIO imaging tool dışında bir seçenek sunmaktadır. Daha fazla bilgi için bkz. :ref:`roboRIO Team Number Setter section <docs/software/wpilib-tools/roborio-team-number-setter/index:roboRIO Team Number Setter>`.

source: Many of the tools for C++/Java/Python programming are also supported and tested on macOS and Linux. Teams programming in C++/Java/Python should be able to develop using these systems, using a Windows system for the Windows-only operations such as the Driver Station and roboRIO Imaging Tool.
tr_tr: C++/Java/Python programlama araçları için geliştirilmiş birçok araç aynı zamanda macOS ve Linux'da desteklenmekte ve bu işletim sistemleri için test edilmektedir. C++/Java/Python programlarını tercih eden takımlar, Driver Station - Sürücü İstasyonu ve roboRIO Imaging Tool gibi Windows'a özel uygulamalarda Windows sistemi kullanarak, macOS ve Linux programlarıyla geliştiricilik yapabilmektedir..

source: Visual Studio Code
tr_tr: Visual Studio Kodu

source: :ref:`Glass <docs/software/dashboards/glass/index:Glass>` is a Dashboard focused on being a programmer's tool for debugging. The primary advantages are the field view, pose visualization, and advanced signal plotting tools.
tr_tr: :ref:`Glass <docs/software/dashboards/glass/index:Glass>` debugging - hata ayıklama için bir programlama aracı olma odağına sahip bir Dashboard - Gösterge Panelidir. Glass'ın başlıca avantajı alan görünümü, poz görselleştirmesi ve gelişmiş sinyal çizim araçlarıdır

source: Screenshot of an AdvantageScope window displaying a line graph, a list of fields, and a series of miscellaneous tabs.
tr_tr: Bir çizgi grafiği, bir alanlar listesi ve bir dizi çeşitli sekmeleri gösteren AdvantageScope penceresinin ekran görüntüsü.

source: AdvantageScope is a data visualization tool for :ref:`NetworkTables <docs/software/networktables/networktables-intro:What is NetworkTables>`, :ref:`WPILib data logs <docs/software/telemetry/datalog:On-Robot Telemetry Recording Into Data Logs>`, and :ref:`Driver Station logs <docs/software/driverstation/driver-station-log-viewer:Driver Station Log File Viewer>`. It is a programmer's tool (rather than a competition dashboard) and can be used to debug real or simulated robot code from a log file or live over the network. For more information see the :doc:`AdvantageScope section </docs/software/dashboards/advantagescope>`.
tr_tr: AdvantageScope :ref:`NetworkTables <docs/software/networktables/networktables-intro:What is NetworkTables>`, :ref:`WPILib data logs <docs/software/telemetry/datalog:On-Robot Telemetry Recording Into Data Logs>`, ve :ref:`Driver Station logs <docs/software/driverstation/driver-station-log-viewer:Driver Station Log File Viewer>` için kullanılan bir veri görüntüleme aracıdır. Bu araç (müsabakaya uygun bir gösterge panelinden ziyade) bir programlama aracıdır ve günlük dosyası "log file" üzerinden ya da ağ üzerinden canlı bir şekilde gerçek veya simüle edilen robot kodlamasındaki hataları düzeltmek için kullanılabilmektedir. Daha fazla bilgi için bkz. :doc:`AdvantageScope section </docs/software/dashboards/advantagescope>`.

source: Screenshot of an Elastic showing field trajectory, match time, and several other widgets
tr_tr: Saha yörüngesi, maç süresi ve başka birkaç araç görüntüleyen Elastic'in ekran görüntüsü.

source: Elastic is a simple and modern dashboard made by Team 353. It is meant to serve as a dashboard for competition but can also be used for testing. It was built with the goal of being a drag & drop dashboard with an easy setup and elegant UI designed for a high pressure competition environment. For more information see the :doc:`Elastic section </docs/software/dashboards/elastic>`.
tr_tr: Elastic, Takım 353 tarafından geliştirilmiş basit ve modern bir gösterge panelidir. Müsabakalarda kullanılan bir gösterge paneli olarak kullanılması amaçlanmış olsa da test yapmak için de kullanılabilmektedir. Basit bir kuruluma sahip ve zorlayıcı müsabaka ortamları için tasarlanmış bir kullanıcı arayüzüyle taşı ve bırak tarzı bir gösterge paneli olması amaçlanmıştır. Daha fazla bilgi için bkz. :doc:`Elastic section </docs/software/dashboards/elastic>`.

source: PathWeaver allows teams to quickly generate and configure paths for advanced autonomous routines for differential drivetrains. These paths have smooth curves allowing the team to quickly navigate their robot between points on the field. For more information see the :ref:`PathWeaver section <docs/software/pathplanning/pathweaver/introduction:Introduction to PathWeaver>`.
tr_tr: PathWeaver, takımlara diferansiyel aktarma sistemlerinin otonom rutinleri için hızlıca bir yol oluşturma ve bu yolları yapılandırma olanağı tanımaktadır. Bu yollar, takımların sahadaki noktalar arasında robotlarını hızlı bir şekilde yönlendirebilmeleri için pürüzsüz kavislere sahiptir. Daha fazla bilgi için bkz. :ref:`PathWeaver section <docs/software/pathplanning/pathweaver/introduction:Introduction to PathWeaver>`.

source: OutlineViewer is a utility used to view, modify, and add to all of the contents of the NetworkTables for debugging purposes. LabVIEW teams can use the Variables tab of the LabVIEW Dashboard to accomplish this functionality. For more information see the :ref:`Outline Viewer section <docs/software/wpilib-tools/outlineviewer/index:OutlineViewer>`.
tr_tr: OutlineViewer, tüm NetworkTables içeriklerinin hata giderme amacıyla görüntülenmesi, değiştirilmesi ve içeriklere eklenti yapmak için kullanılan yardımcı bir yazılımdır. LabVIEW kullanan takımlar, LabVIEW Dashboard'daki Variables sekmesini bu işlevi gerçekleştirmek için kullanabilmektedir. Daha fazla bilgi için bkz. :ref:`Outline Viewer section <docs/software/wpilib-tools/outlineviewer/index:OutlineViewer>`.

source: WPIcal tool.
tr_tr: WPIcal aracı
