Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/controls-overviews/control-system-hardware.po
Languages: fr_ca, tr_tr, zh_cn

source: Hardware Component Overview
fr_ca: Aperçu des composants matériels
tr_tr: Donanım Bileşenine Genel Bakış
zh_cn: 硬件组件概述

source: The goal of this document is to provide a brief overview of the hardware components that make up the FRC\ |reg| Control System. Each component will contain a brief description of the component function and a link to more documentation.
fr_ca: Le but de ce document est de fournir un bref aperçu des composants matériels qui composent le Système de contrôle FRC\ |reg|. Chaque composant contient une brève description de la fonction du composant et un lien vers plus de documentation.
tr_tr: Bu belgenin amacı, FRC\ |reg| Kontrol sisteminin birer parçası olan donanım bileşenlerine kısa, genel bir bakış sağlamaktır. Her bileşen için, bileşenin işlevine dair kısa bir açıklama ve bileşene dair ek belgelere yönlendirmede bulunan birer bağlantı bulunacaktır..
zh_cn: 本文档的目的是简要概述构成FRC\ |reg| 控制系统的硬件组件。每个组件都将包含对该组件功能的简短描述以及指向更多文档的链接。

source: For wiring instructions/diagrams, please see the :doc:`Wiring the FRC Control System </docs/zero-to-robot/step-1/intro-to-frc-robot-wiring>` document.
fr_ca: Pour les instructions/schémas de câblage, veuillez consulter le document :doc:`Wiring the FRC Control System </docs>`.
tr_tr: Kablolama talimatları/şemaları için bkz. :doc:`Wiring the FRC Control System </docs/zero-to-robot/step-1/intro-to-frc-robot-wiring>` belgesi.

source: Overview of Control System
fr_ca: Survol du système de contrôle
tr_tr: Kontrol Sistemine Genel Bakış
zh_cn: 控制系统概述

source: Layout of all popular components of the control system including REV Control System Components
fr_ca: Disposition et connexions des composants les plus courants du système de contrôle incluant les composants du système de contrôle REV
tr_tr: REV Kontrol Sistemi Bileşenleri dahil olmak üzere kontrol sisteminin yaygın tüm bileşenlerinin yerleşim düzeni

source: Diagram courtesy of FRC\ |reg| Team 3161 and Stefen Acepcion.
fr_ca: Diagramme gracieuseté de l'équipe FRC\ |reg| 3161 et Stefen Acepcion.
tr_tr: Kontrol sistemi şeması, FRC\ |reg| Takım 3161 ve Stefen Acepcion tarafından sağlanmıştır.

source: Layout of all of the core components of the control system and how they are connected.
fr_ca: Disposition de tous les composants de base du système de contrôle et de la façon dont ils sont connectés.

source: NI roboRIO
fr_ca: Contrôleur principal NI RoboRIO de National Instrument

source: The :ref:`NI-roboRIO <docs/software/roborio-info/roborio-introduction:roboRIO Introduction>` is the main robot controller used for FRC. The roboRIO serves as the "brain" for the robot running team-generated code that commands all of the other hardware.
fr_ca: Le :ref:`NI-roboRIO <docs / software / roborio-info / roborio-introduction: roboRIO Introduction>` est le contrôleur principal de robot utilisé pour FRC. Le roboRIO sert de «cerveau» pour le robot en exécutant le code généré par l'équipe et qui commande tous les dispositifs électroniques et mécaniques.
tr_tr: :ref:`NI-roboRIO <docs/software/roborio-info/roborio-introduction:roboRIO Introduction>` , FRC için kullanılan ana robot denetleyicisidir. RoboRIO, diğer tüm donanımlara komuta eden ekip tarafından oluşturulan kodu çalıştıran robot için "brain-beyin" görevi görür.
zh_cn: :ref:`NI-roboRIO <docs/software/roborio-info/roborio-introduction:roboRIO Introduction>`是用于FRC的主要机器人控制器。 roboRIO充当机器人运行团队生成的代码的“大脑”，该代码命令所有其他硬件。

source: CTRE Power Distribution Panel
fr_ca: Panneau de distribution de puissance CTRE
tr_tr: CTRE Power Distribution Panel - Güç Dağıtım Paneli

source: The :ref:`CTRE Power Distribution Panel <docs/software/can-devices/power-distribution-module:Power Distribution Module>` (PDP) is designed to distribute power from a 12VDC battery to various robot components through auto-resetting circuit breakers and a small number of special function fused connections. The PDP provides 8 output pairs rated for 40A continuous current and 8 pairs rated for 30A continuous current. The PDP provides dedicated 12V connectors for the roboRIO, as well as connectors for the Voltage Regulator Module and Pneumatics Control Module. It also includes a CAN interface for logging current, temperature, and battery voltage. For more detailed information, see the `PDP User Manual <https://store.ctr-electronics.com/content/user-manual/PDP%20User%27s%20Guide.pdf>`__.
fr_ca: Le :ref:`Panneau de distribution de puissance CTRE <docs/software/can-devices/power-distribution-module:Power Distribution Module>` (PDP) est conçu pour distribuer le courant d'une batterie 12V CC aux divers composants du robot, par le biais d'un fusible à auto-réinitialisation et plusieurs connexions à fusibles. le PDP fournit 8 paires de sorties à puissance continue de 40 ampères et 8 paires de sorties à puissance continue de 30 ampères. Le PDP fournit des connecteurs dédiés à tension de 12V pour le roboRIO, ainsi que des connecteurs pour le Module de régulation de voltage et Module de contrôle pneumatique. Il inclut aussi une interface CAN pour la journalisation du courant, température interne et voltage de la batterie. Pour des informations plus détaillées, consultez le `manuel de l'utilisateur du PDP <https://store.ctr-electronics.com/content/user-manual/PDP%20User%27s%20Guide.pdf>`__.

source: REV Power Distribution Hub
fr_ca: Concentrateur de distribution de puissance REV
tr_tr: REV Power Distribution Hub - REV Güç Dağıtım Merkezi

source: The `REV Power Distribution Hub <https://docs.revrobotics.com/rev-11-1850/>`__ (PDH) is designed to distribute power from a 12VDC battery to various robot components. The PDH features 20 high-current (40A max) channels, 3 low-current (15A max), and 1 switchable low-current channel. The Power Distribution Hub features toolless latching WAGO terminals, an LED voltage display, and the ability to connect over CAN or USB-C to the REV Hardware Client for real-time telemetry.
fr_ca: Le `Concentrateur de Distribution de Puissance REV <https://docs.revrobotics.com/rev-11-1850/>`__ (PDH) est conçu pour distribuer l’énergie d’une batterie 12VDC à divers composants du robot. Le PDH dispose de 20 canaux à courant élevé (40 A max), 3 canaux à faible courant (15 A max) et 1 canal commutable à faible courant. Le concentrateur de distribution de puissance dispose de bornes WAGO à verrouillage sans outil, d’un affichage de tension LED et de la possibilité de se connecter via CAN ou USB-C au client matériel REV pour une télémétrie en temps réel.

source: CTRE Voltage Regulator Module
fr_ca: Module régulateur de tension CTRE
tr_tr: CTRE Voltage Düzenleme Modülü

source: The CTRE Voltage Regulator Module (VRM) is an independent module that is powered by 12 volts. The device is wired to a dedicated connector on the PDP. The module has multiple regulated 12V and 5V outputs. The purpose of the VRM is to provide regulated power for the robot radio, custom circuits, and IP vision cameras. For more information, see the `VRM User Manual <https://store.ctr-electronics.com/content/user-manual/VRM%20User%27s%20Guide.pdf>`__.
fr_ca: Le module régulateur de tension CTRE (VRM) est un module indépendant alimenté par 12 volts. L’appareil est câblé à un connecteur dédié sur le PDP. Le module dispose de plusieurs sorties régulées 12V et 5V. Le but du VRM est de fournir une alimentation régulée pour la radio du robot, les circuits personnalisés et les caméras de vision IP. Pour plus d’informations, consultez le manuel `VRM User Manual <https://store.ctr-electronics.com/content/user-manual/VRM%20User%27s%20Guide.pdf>`__.

source: REV Radio Power Module
fr_ca: Module d’alimentation de radio REV

source: The `REV Radio Power Module <https://docs.revrobotics.com/rev-11-1856/>`__ is designed to keep one of the most critical system components, the OpenMesh WiFi radio, powered in the toughest moments of the competition. The Radio Power Module eliminates the need for powering the radio through a traditional barrel power jack. Utilizing 18V Passive POE with two socketed RJ45 connectors, the Radio Power Module passes signal between the radio and roboRIO while providing power directly to the radio. After connecting the radio and roboRIO, easily add power to the Radio Power Module by wiring it to the low-current channels on the Power Distribution Hub utilizing the color coded push button WAGO terminals.
fr_ca: Le `Module d’alimentation de radio REV <https://docs.revrobotics.com/rev-11-1856/>`__ est conçu pour maintenir alimenté l’un des composants les plus critiques du système, la radio WiFi OpenMesh, qui doit être alimenté en continu même dans les moments les plus difficiles de la compétition. Le module d’alimentation radio élimine le besoin d’alimenter la radio via une prise d’alimentation à barillet traditionnelle. Utilisant un POE passif 18V avec deux connecteurs RJ45 à prise, le module d’alimentation radio transmet le signal entre la radio et roboRIO tout en fournissant de l’énergie directement à la radio. Après avoir connecté la radio et le roboRIO, il envoie facilement de l’énergie au module d’alimentation radio en le câblant sur les canaux à faible courant du concentrateur de distribution de puissance à l’aide des bornes WAGO à bouton-poussoir à code couleur.

source: OpenMesh OM5P-AN or OM5P-AC Radio
fr_ca: Radio OpenMesh OM5P-AN ou OM5P-AC
zh_cn: OpenMesh OM5P-AN或OM5P-AC无线路由器

source: Either the OpenMesh OM5P-AN or `OpenMesh OM5P-AC <https://www.andymark.com/products/open-mesh-om5p-ac-dual-band-1-17-gbps-access-point-radio>`__ wireless radio is used as the robot radio to provide wireless communication functionality to the robot. The device can be configured as an Access Point for direct connection of a laptop for use at home. It can also be configured as a bridge for use on the field. The robot radio should be powered by one of the 12V/2A outputs on the VRM and connected to the roboRIO controller over Ethernet. For more information, see :ref:`Programming your Radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`.
fr_ca: Soit l'OpenMesh OM5P-AN ou `OpenMesh OM5P-AC <https://www.andymark.com/products/open-mesh-om5p-ac-dual-band-1-17-gbps-access-point-radio>`__ la radio sans fil est utilisée comme radio du robot pour fournir une fonctionnalité de communication sans fil au robot. L'appareil peut être configuré comme point d'accès pour la connexion directe d'un ordinateur portable à utiliser à la maison. Il peut également être configuré comme un pont pour une utilisation sur le terrain. La radio du robot doit être alimentée par l'une des sorties 12 V/2 A du VRM et connectée au contrôleur roboRIO via Ethernet. Pour plus d'informations, voir :ref:`Programmer votre radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`.

source: The OM5P-AN `is no longer available for purchase <https://www.firstinspires.org/robotics/frc/blog/radio-silence>`__. The OM5P-AC is slightly heavier, has more cooling grates, and has a rough surface texture compared to the OM5P-AN.
fr_ca: Le OM5P-AN `n'est plus disponible pour achat <https://www.firstinspires.org/robotics/frc/blog/radio-silence>`__. Le OM5P-AC est légèrement plus lourd, possède plus de grilles de refroidissement et a une texture de surface rugueuse par rapport au OM5P-AN.
zh_cn: OM5P-AN`不再可用于购买<https://www.firstinspires.org/robotics/frc/blog/radio-silence>`__。与OM5P-AN相比，OM5P-AC稍重，具有更多的冷却格栅，并且具有粗糙的表面纹理。

source: 120A Circuit Breaker
fr_ca: Disjoncteur 120A
tr_tr: 120A Devre Kesici - 120A Circuit Breaker
zh_cn: 120A断路器

source: The 120A Main Circuit Breaker serves two roles on the robot: the main robot power switch and a protection device for downstream robot wiring and components. The 120A circuit breaker is wired to the positive terminals of the robot battery and Power Distribution boards. For more information, please see the `Cooper Bussmann 18X Series Datasheet (PN: 185120F) <https://www.mouser.com/datasheet/2/87/BUS_Tns_DS_18X_CIRCUITBREAKER-515519.pdf>`__
fr_ca: Le disjoncteur principal de 120 A joue deux rôles sur le robot, soit l'interrupteur d'alimentation principal du robot et un dispositif de protection pour le câblage et les composants du robot en aval. Le disjoncteur de 120 A est câblé aux bornes positives de la batterie du robot et des tableaux de distribution d'alimentation. Pour plus d'informations, veuillez consulter la `Fiche technique de la série Cooper Bussmann 18X (PN: 185120F) <https://www.mouser.com/datasheet/2/87/BUS_Tns_DS_18X_CIRCUITBREAKER-515519.pdf>`__
tr_tr: 120A Ana Devre Kesici, robot üzerinde iki göreve sahiptir: robotun ana güç anahtarı ve aşağı akışlı robot kablolaması ile bileşenleri için bir koruma cihazı olmak. 120A devre kesici, robot aküsünün ve Güç Dağıtım panellerinin pozitif uçlarına bağlanmaktadır. Daha fazla bilgi için bkz. `Cooper Bussmann 18X Serisi Veri Sayfası'na (PN: 185120F) <https://www.mouser.com/datasheet/2/87/BUS_Tns_DS_18X_CIRCUITBREAKER-515519.pdf>`.
zh_cn: 120A主断路器在机器人上起着两个作用：主机器人电源开关和用于下游机器人接线和组件的保护装置。 120A断路器已连接至机器人电池和配电板的正极。有关更多信息，请参见`Cooper Bussmann 18X系列数据表（PN：185120F）<https://www.mouser.com/datasheet/2/87/BUS_Tns_DS_18X_CIRCUITBREAKER-515519.pdf>`__

source: Snap Action Circuit Breakers
fr_ca: Disjoncteurs à Action rapide
tr_tr: Snap Action Devre Kesiciler
zh_cn: 速动断路器

source: Snap Action Circuit Breakers to be inserted in the PDP.
fr_ca: Disjoncteurs à fixation immédiate à insérer dans le PDP.
tr_tr: PDP'ye eklenecek Snap Action Devre Kesiciler.

source: The Snap Action circuit breakers, `MX5 series <https://www.snapaction.net/assets/img/MX5-Spec-Sheet-Revision-2023.pdf>`__ and `VB3 Series <https://www.snapaction.net/assets/img/VB3-Spec-Sheet-Revision-2023.pdf>`__, are used with the Power Distribution Panel to limit current to branch circuits. The ratings on these circuit breakers are for continuous current, temporary peak values can be considerably higher.
fr_ca: Les disjoncteurs Snap Action, `série MX5 <https://www.snapaction.net/assets/img/MX5-Spec-Sheet-Revision-2023.pdf>`__ et `série VB3 <https://www.snapaction.net/assets/img/VB3-Spec-Sheet-Revision-2023.pdf>`__, sont utilisés avec le panneau de distribution d'alimentation pour limiter le courant vers les circuits de dérivation. Les valeurs nominales de ces disjoncteurs concernent un courant continu, les valeurs de crête temporaires peuvent être considérablement plus élevées.
tr_tr: `MX5 <https://www.snapaction.net/assets/img/MX5-Spec-Sheet-Revision-2023.pdf>`__ ve `VB3 Serisi <https://www.snapaction.net/assets/img/VB3-Spec-Sheet-Revision-2023.pdf>`__ Snap Action devre kesiciler, Power Distribution Panel - Güç Dağıtım Paneliyle beraber giden akımı branşman devrelerine sınırlamak için kullanılmaktadır. Bu devre kesicilerdeki derecelendirmeler sürekli akım içindir, geçici tepe değerleri bu derecelendirmeden oldukça yüksek çıkabilir.

source: Robot Battery
fr_ca: Batterie du Robot
tr_tr: Robot Aküsü
zh_cn: 机器人电池

source: The power supply for an FRC robot is a single 12V 18Ah Sealed Lead Acid (SLA) battery, capable of meeting the high current demands of an FRC robot. For more information, see the :ref:`Robot Battery page. <docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>`
fr_ca: L'alimentation électrique d'un robot FRC est composé d'une seule batterie plomb-acide scellée (SLA) 12V 18Ah, capable de répondre aux demandes de courant élevées d'un robot FRC. Pour plus d'informations, consultez la page :ref:`Batterie du Robot. <docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>`
tr_tr: Bir FRC robotunun güç kaynağı, robotunun yüksek akım taleplerini karşılayabilen tek bir 12V 18Ah Mühürlü Kurşun Asit (SLA) aküdür. Daha fazla bilgi için bkz. :ref:`Robot Battery sayfasına bakınız. <docs/hardware/hardware-temelleri/robot-battery:Robot Battery Basics>`
zh_cn: FRC机器人的电源是一个12V 18Ah密封铅酸（SLA）电池，能够满足FRC机器人的高电流需求。有关更多信息，请参见“机器人电池”页面。 <docs/hardware/hardware-basics/robot-battery:Robot Battery Basics>`

source: Multiple battery part numbers may be legal, consult the `FRC Manual <https://www.firstinspires.org/resource-library/frc/competition-manual-qa-system>`__ for a complete list.
fr_ca: Plusieurs numéros de modèles de batterie peuvent être légalement utiisé. Consultez le `Manuel FRC <https://www.firstinspires.org/resource-library/frc/competition-manual-qa-system>`__ pour une liste complète.
zh_cn: 多个电池部件号可能是合法的，有关完整列表，请参考`FRC手册<https://www.firstinspires.org/resource-library/frc/competition-manual-qa-system>`__。

source: Robot Signal Light
fr_ca: Signal lumineux du robot
tr_tr: Robot Sinyal Işığı - Robot Signal Light - RSL
zh_cn: 机器人信号灯

source: Orange Robot Signal Light (Allen-Bradley)
fr_ca: Voyant lumineux orange du robot (Allen-Bradley)
tr_tr: Turuncu Robot Sinyal Işığı - Orange Robot Signal Light (Allen-Bradley)

source: Orange Robot Signal Light (AndyMark)
fr_ca: Voyant lumineux orange du robot (AndyMark)
tr_tr: Turuncu Robot Sinyal Işığı - Orange Robot Signal Light (AndyMark)

source: The Robot Signal Light (RSL) is required to be either Allen-Bradley 855PB-B12ME522 or AndyMark am-3583. It is directly controlled by the roboRIO and will flash when enabled and stay solid while disabled.
fr_ca: Le voyant de signalisation du robot (RSL) doit être le Allen-Bradley 855PB-B12ME522 ou bien le AndyMark am-3583. Il est directement contrôlé par le roboRIO et clignote lorsqu'il est activé et reste fixe lorsqu'il est désactivé.
tr_tr: Robot Sinyal Işığının (RSL) ya "Allen-Bradley 855PB-B12ME522" ya da "AndyMark am-3583" modellerinden biri olması şarttır. RSL doğrudan roboRIO tarafından kontrol edilmekte ve etkinleştirildiğinde yanıp sönerken devre dışı bırakıldığında sabit kalmaktadır.

source: CTRE Pneumatics Control Module
fr_ca: Module de commande pneumatique CTRE
tr_tr: CTRE Pnömatik Kontrol Modülü - CTRE Pneumatics Control Module

source: The :ref:`CTRE Pneumatics Control Module <docs/software/can-devices/pneumatics-control-module:Pneumatics Control Module>` (PCM) contains all of the inputs and outputs required to operate 12V or 24V pneumatic solenoids and the on board compressor. The PCM contains an input for the pressure sensor and will control the compressor automatically when the robot is enabled and a solenoid has been created in the code. For more information see the `PCM User Manual <https://store.ctr-electronics.com/content/user-manual/PCM%20User%27s%20Guide.pdf>`__.
fr_ca: Le :ref:`module de contrôle pneumatique<docs/software/can-devices/pneumatics-control-module:Pneumatics Control Module>` (PCM) contient toutes les entrées et sorties nécessaires au fonctionnement des solénoïdes pneumatiques 12V ou 24V et du compresseur embarqué. Le PCM contient une entrée pour le capteur de pression et contrôle automatiquement le compresseur lorsque le robot est activé et qu’un solénoïde a été créé dans le code. Pour plus d’informations, consultez le document `PCM User Manual <https://store.ctr-electronics.com/content/user-manual/PCM%20User%27s%20Guide.pdf>`__..

source: REV Pneumatic Hub
fr_ca: Concentrateur pneumatique REV
tr_tr: REV Pneumatic Hub - REV Pnömatik Merkezi

source: The `REV Pneumatic Hub <https://docs.revrobotics.com/rev-11-1852/>`__ is a standalone module that is capable of switching both 12V and 24V pneumatic solenoid valves. The Pneumatic Hub features 16 solenoid channels which allow for up to 16 single-acting solenoids, 8 double-acting solenoids, or a combination of the two types. The user selectable output voltage is fully regulated, allowing even 12V solenoids to stay active when the robot battery drops as low as 4.75V.
fr_ca: Le `Concentrateur pneumatique REV <https://docs.revrobotics.com/rev-11-1852/>`__ est un module autonome capable de commuter des électrovannes pneumatiques 12V et 24V. Le concentrateur pneumatique dispose de 16 canaux solénoïdes qui permettent prendre en charge jusqu’à 16 solénoïdes à simple effet, 8 solénoïdes à double effet ou une combinaison des deux types. La tension de sortie sélectionnable par l’utilisateur est entièrement régulée, ce qui permet même aux solénoïdes de 12 V de rester actifs lorsque la batterie du robot tombe aussi bas que 4.75 V.

source: Digital and analog pressure sensor ports are built into the device, increasing the flexibility and feedback functionality of the pneumatic system. The USB-C connection on the Hub works with the REV Hardware Client, allowing users to test pneumatic systems without a need for an additional robot controller.
fr_ca: Des ports relatifs aux capteur de pression numériques et analogiques sont intégrés à l’appareil, ce qui augmente la flexibilité et la fonctionnalité de rétroaction du système pneumatique. La connexion USB-C sur le Concentrateur fonctionne avec le client matériel REV, permettant aux utilisateurs de tester des systèmes pneumatiques sans avoir besoin d’un contrôleur de robot supplémentaire.
tr_tr: Cihaza entegre edilmiş dijital ve analog basınç sensörü bağlantı noktaları, pnömatik sistemin esnekliğini ve geri bildirim işlevselliğini arttırmaktadır. Hub üzerindeki USB-C bağlantısı, REV Hardware Client ile birlikte çalışarak kullanıcıların ek bir robot kontrolörüne ihtiyaç duymadan pnömatik sistemleri test etmelerine olanak tanımaktadır.

source: Motor Controllers
fr_ca: Contrôleurs de Moteurs
tr_tr: Motor Kontrolörleri
zh_cn: 电机控制器

source: There are a variety of different :ref:`motor controllers <docs/software/hardware-apis/index:Hardware APIs>` which work with the FRC Control System and are approved for use. These devices are used to provide variable voltage control of the brushed and brushless DC motors used in FRC. They are listed here in order of `usage <https://www.firstinspires.org/robotics/frc/blog/2021-beta-testing-usage-report>`__.
fr_ca: Il existe une variété de différents :ref:`contrôleurs de moteur <docs/software/hardware-apis/index:Hardware APIs>` qui fonctionnent avec le système de contrôle FRC et sont approuvés pour utilisation. Ces dispositifs sont utilisés pour fournir un contrôle de tension variable des moteurs à courant continu à balais et sans balais utilisés dans le FRC. Ils sont répertoriés ici par ordre `d’utilisation <https://www.firstinspires.org/robotics/frc/blog/2021-beta-testing-usage-report>`__.

source: 3rd Party CAN control is not supported from WPILib. See this section on :ref:`docs/software/can-devices/third-party-devices:Third-Party CAN Devices` for more information.
fr_ca: Le contrôle CAN des tierce-parties n'est pas pris en charge par WPILib. Consultez cette section sur :ref:`docs/software/can-devices/third-party-devices:Third-Party CAN Devices` pour plus d'informations.
tr_tr: 3. Taraf CAN kontrolü WPILib tarafından desteklenmemektedir. Daha fazla bilgi için aşağıdaki bölüme bakınız: ref: `docs/software/can-devices/ üçüncü taraf cihazlar: Üçüncü Taraf CAN Cihazları`
zh_cn: WPILib不支持第三方CAN控制。有关更多信息，请参见docs / software / can-devices / third-party-devices：第三方CAN设备`上的此部分。
