Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/controls-overviews/control-system-hardware.po
Languages: fr_ca, tr_tr, zh_cn

source: The `Talon SRX Motor Controller <https://store.ctr-electronics.com/talon-srx/>`__ is a "smart motor controller" from Cross The Road Electronics/VEX Robotics. The Talon SRX can be controlled over the CAN bus or :term:`PWM` interface. When using the CAN bus control, this device can take inputs from limit switches and potentiometers, encoders, or similar sensors in order to perform advanced control. For more information see the `Talon SRX User's Guide <https://store.ctr-electronics.com/content/user-manual/Talon%20SRX%20User's%20Guide.pdf>`__.
fr_ca: Le `contrôleur de moteur Talon SRX <https://store.ctr-electronics.com/talon-srx/>`__ est un « contrôleur de moteur intelligent » de Cross The Road Electronics/VEX Robotics. Le Talon SRX peut être contrôlé via le bus CAN ou l'interface :term:`PWM`. Lors de l'utilisation du contrôle par bus CAN, cet appareil peut prendre les entrées des interrupteurs de fin de course et des potentiomètres, des encodeurs ou des capteurs similaires afin d'effectuer un contrôle avancé. Pour plus d'informations, consultez le `Guide de l'utilisateur Talon SRX <https://store.ctr-electronics.com/content/user-manual/Talon%20SRX%20User'suide.pdf>`__.

source: The `Victor SPX Motor Controller <https://store.ctr-electronics.com/victor-spx/>`__ is a CAN or PWM controlled motor controller from Cross The Road Electronics/VEX Robotics. The device is connectorized to allow easy connection to the roboRIO PWM connectors or a CAN bus. The case is sealed to prevent debris from entering the controller. For more information, see the `Victor SPX User Guide <https://store.ctr-electronics.com/content/user-manual/Victor%20SPX%20User's%20Guide.pdf>`__.
fr_ca: Le `contrôleur de moteur Victor SPX <https://store.ctr-electronics.com/victor-spx/>`__ est un contrôleur de moteur contrôlé CAN ou PWM de Cross The Road Electronics/VEX Robotique. Le dispositif est connecté pour permettre une connexion facile aux connecteurs roboRIO PWM ou à un bus CAN. Le boîtier est scellé pour empêcher les débris de pénétrer dans le contrôleur. Pour plus d'informations, consultez le `Victor SPX User Guide <https://store.ctr-electronics.com/content/user-manual/Victor%20SPX%20User's%20Guide.pdf>`__.

source: SPARK MAX Motor Controller
fr_ca: Contrôleur de Moteur SPARK MAX
tr_tr: SPARK MAX Motor Kontrolörü
zh_cn: SPARK MAX电机控制器

source: The `SPARK MAX Motor Controller <https://www.revrobotics.com/rev-11-2158/>`__ is an advanced brushed and brushless DC motor controller from REV Robotics. When using CAN bus or USB control, the SPARK MAX uses input from limit switches, encoders, and other sensors, including the integrated encoder of the REV NEO Brushless Motor, to perform advanced control modes. The SPARK MAX can be controlled over PWM, CAN or USB (for configuration/testing only). For more information, see the `SPARK MAX User's Manual <https://docs.revrobotics.com/sparkmax/>`__.
fr_ca: Le `contrôleur de moteurs SPARK MAX <https://www.revrobotics.com/rev-11-2158/>`__ est un contrôleur de moteur DC avancé avec balais et sans balais de REV Robotics. Lors de l’utilisation du bus CAN ou par contrôle USB, le SPARK MAX utilise des signaux d’entrée provenant des interrupteurs de fin de course, des encodeurs et d’autres capteurs, y compris l’encodeur intégré du moteur sans balais REV NEO, pour effectuer des modes de commande avancés. Le SPARK MAX peut être contrôlé sur PWM, CAN ou USB (pour configuration/test uniquement). Pour plus d’informations, consultez le document `SPARK MAX User's Manual <https://docs.revrobotics.com/sparkmax/>`__.
zh_cn: SPARK MAX电动机控制器<https://www.revrobotics.com/rev-11-2158/>`__是REV Robotics提供的高级有刷和无刷直流电动机控制器。当使用CAN总线或USB控制时，SPARK MAX使用限位开关，编码器和其他传感器（包括REV NEO无刷电机的集成编码器）的输入来执行高级控制模式。 SPARK MAX可以通过PWM，CAN或USB进行控制（仅用于配置/测试）。有关更多信息，请参见`SPARK MAX用户手册<https://docs.revrobotics.com/sparkmax/>`__。

source: TalonFX Motor Controller
fr_ca: Contrôleur de moteur TalonFX
tr_tr: TalonFX Motor Kontrol Cihazı
zh_cn: TalonFX电机控制器

source: The `TalonFX Motor Controller <https://store.ctr-electronics.com/falcon-500-powered-by-talon-fx/>`__ is integrated into the Falcon 500 brushless motor. It features an integrated encoder and all of the smart features of the Talon SRX and more! For more information see the `Falcon 500 User Guide <https://store.ctr-electronics.com/content/user-manual/Falcon%20500%20User%20Guide.pdf>`__.
fr_ca: Le `contrôleur de moteur TalonFX <https://store.ctr-electronics.com/falcon-500-powered-by-talon-fx/>`__ est intégré au moteur sans balais du Falcon 500. Il dispose d'un encodeur intégré et de toutes les fonctionnalités intelligentes du Talon SRX et plus encore! Pour plus d'informations, consultez le document `Falcon 500 User Guide <https://store.ctr-electronics.com/content/user-manual/Falcon%20500%20User%20Guide.pdf>`__.

source: SPARK Motor Controller
fr_ca: Contrôleur de Moteur Spark
tr_tr: SPARK Motor Kontrolörü
zh_cn: SPARK电机控制器

source: While this motor controller is still legal for FRC use, the manufacturer has discontinued this product.
fr_ca: Bien que ce contrôleur moteur soit toujours légal pour une utilisation en FRC, le manufacturier a mis fin à la production de ce composant.
tr_tr: Bu motor kontrolörü FRC kullanımı için hala yasal olsa da, üretici bu ürünün üretimini durdurmuştur.
zh_cn: 尽管此电机控制器仍可用于FRC，但制造商已停止使用该产品。

source: The `Victor SP Motor Controller <https://store.ctr-electronics.com/content/user-manual/Victor-SP-Quick-Start-Guide.pdf>`__ is a PWM motor controller from Cross The Road Electronics/VEX Robotics. The Victor SP has an electrically isolated metal housing for heat dissipation, making the use of the fan optional. The case is sealed to prevent debris from entering the controller. The controller is approximately half the size of previous models.
fr_ca: Le `contrôleur de moteur Victor SP <https://store.ctr-electronics.com/content/user-manual/Victor-SP-Quick-Start-Guide.pdf>`__ est un contrôleur de moteur PWM de Cross The Road Electronics/VEX Robotics . Le Victor SP a un boîtier métallique isolé électriquement pour la dissipation thermique, ce qui rend l'utilisation du ventilateur facultative. Le boîtier est scellé pour empêcher les débris de pénétrer dans le contrôleur. Le contrôleur fait environ la moitié de la taille des modèles précédents.

source: Talon Motor Controller
fr_ca: Contrôleur de Moteur Talon
tr_tr: Talon Motor Kontrolörü
zh_cn: Talon电机控制器

source: The `Talon Motor Controller <https://files.andymark.com/Talon_User_Manual_1_3.pdf>`__ from Cross the Road Electronics is a PWM controlled brushed DC motor controller with passive cooling.
fr_ca: Le `contrôleur de moteurs <https://files.andymark.com/Talon_User_Manual_1_3.pdf>`__ de Cross the Road Electronics est un contrôleur de moteur DC avec balais à refroidissement passif contrôlé via les connexions PWM .
tr_tr: `Talon Motor Controller- Motor Kontrol Cihazı <https://files.andymark.com/Talon_User_Manual_1_3.pdf>`__ Cross the Road Electronics tarafından geliştiriliş pasif soğutmalı, PWM kontrollü, fırçalı bir DC motor kontrol cihazıdır.

source: Victor 888 Motor Controller / Victor 884 Motor Controller
fr_ca: Contrôleur de Moteur Victor 888 / Contrôleur de Moteur Victor 884
tr_tr: Victor 888 Motor Kontrolörü/ Victor 884 Motor Kontrolörü
zh_cn: Victor 888电机控制器/ Victor 884电机控制器

source: Victor 888 Motor Controller
fr_ca: Contrôleur de moteur Victor 888

source: The `Victor 884 <https://content.vexrobotics.com/docs/ifi-v884-users-manual-9-25-06.pdf>`__ and `Victor 888 <https://content.vexrobotics.com/docs/217-2769-Victor888UserManual.pdf>`__ motor controllers from VEX Robotics are variable speed PWM motor controllers for use in FRC. The Victor 888 replaces the Victor 884, which is also usable in FRC.
fr_ca: Les contrôleurs de moteurs `Victor 884 <https://content.vexrobotics.com/docs/ifi-v884-users-manual-9-25-06.pdf>`__ et `Victor 888 <https://content.vexrobotics.com/docs/217-2769-Victor888UserManual.pdf>`__ de VEX Robotics sont des contrôleurs de moteurs de type PWM à vitesse variable à utiliser dans FRC. Le Victor 888 remplace le Victor 884, qui est également utilisable en FRC.
zh_cn: VEX Robotics的`Victor 884 <https://content.vexrobotics.com/docs/ifi-v884-users-manual-9-25-06.pdf>`__和`Victor 888 <https://content.vexrobotics.com/docs/217-2769-Victor888UserManual.pdf>`__电动机控制器是用于FRC的变速PWM电动机控制器。Victor888替代了也在FRC中使用的Victor884。

source: Jaguar Motor Controller
fr_ca: Contrôleur de Moteur Jaguar
tr_tr: Jaguar Motor Kontrolörü
zh_cn: Jaguar电机控制器

source: The `Jaguar Motor Controller <https://www.ti.com/lit/an/spma033a/spma033a.pdf?ts=1607574399581>`__ from VEX Robotics (formerly made by Luminary Micro and Texas Instruments) is a variable speed motor controller for use in FRC. For FRC, the Jaguar may only be controlled using the PWM interface.
fr_ca: Le `contrôleur de moteur Jaguar <https://www.ti.com/lit/an/spma033a/spma033a.pdf?ts=1607574399581>`__ de VEX Robotics (anciennement fabriqué par Luminary Micro et Texas Instruments) est un contrôleur de moteur à vitesse variable pour utilisation en FRC. En FRC, le Jaguar ne peut être contrôlé qu'à l'aide de l'interface PWM.
tr_tr: (Daha önce Luminary Micro ve Texas Instruments tarafından yapılmış) VEX Robotics tarafından geliştirilmiş `Jaguar Motor Kontrolörü <https://www.ti.com/lit/an/spma033a/spma033a.pdf?ts=1607574399581>`__, FRC'de kullanım amacına sahip değişken hızlı bir motor kontrolörüdür. FRC için Jaguar yalnızca PWM arayüzü kullanılarak kontrol edilebilmektedir.
zh_cn: VEX Robotics（以前由Luminary Micro和Texas Instruments生产）的`Jaguar Motor Controller <https://www.ti.com/lit/an/spma033a/spma033a.pdf?ts=1607574399581>`__是用于FRC的变速电动机控制器。对于FRC，Jaguar只能使用PWM接口进行控制。

source: DMC-60 and DMC-60C Motor Controller
fr_ca: Contrôleurs de Moteurs DMC-60 et DMC-60C
tr_tr: DMC-60 ve DMC-60C Motor Kontrolörü
zh_cn: DMC-60和DMC-60C电机控制器

source: DMC-60C Motor Controller
fr_ca: Contrôleur de moteur DMC-60C

source: The DMC-60 is a PWM motor controller from Digilent. The DMC-60 features integrated thermal sensing and protection including current-foldback to prevent overheating and damage, and four multi-color LEDs to indicate speed, direction, and status for easier debugging. For more information, see the `DMC-60 reference manual <https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__
fr_ca: Le DMC-60 est un contrôleur de motor PWM de la compagnie Digilent. Le DMC-60 dispose d'une détection thermique intégrée et d'une protection comprenant un repli-courant pour éviter la surchauffe et les dommages, de quatre LED multicolore pour indiquer la vitesse, la direction, et le statut pour un débogage plus facile. Pour d'autres informations, veuillez consulter le `Manuel de référence DMC-60 <https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__
tr_tr: DMC-60, Digilent tarafından geliştirilmiş bir PWM motor kontrolörüdür. DMC-60, aşırı ısınmayı ve hasarı önlemek için akım bükme dahil entegre termal algılama, koruma ve daha kolay hata ayıklama için hızı, yönü ve durumu gösteren dört çok renkli LED'i içerir. Daha fazla bilgi için, `DMC-60 referans kılavuzuna bakın <https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__
zh_cn: DMC-60是Digilent的PWM电机控制器。 DMC-60具有集成的热感应和保护功能，包括电流折返功能以防止过热和损坏，以及四个多色LED指示速度，方向和状态，以便于调试。有关更多信息，请参见`DMC-60参考手册<https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__

source: The DMC-60C adds CAN smart controller capabilities to the DMC-60 controller. Due to the manufacturer discontinuing this product, the DMC-60C is only usable with PWM. For more information see the `DMC-60C Product Page <https://reference.digilentinc.com/dmc-60c/start/>`__
fr_ca: Le DMC-60C ajoute des capacités de contrôleur intelligent CAN au contrôleur DMC-60. En raison de l’arrêt de production de ce produit par le fabricant, le DMC-60C n’est utilisable qu’avec des connexions PWM. Pour plus d’informations, consultez la documentation `DMC-60C Product Page <https://reference.digilentinc.com/dmc-60c/start/>`__
tr_tr: DMC-60C, DMC-60 kontrol cihazına CAN akıllı kontrolör yetenekleri ekler. Üreticinin bu ürünü durdurması nedeniyle, DMC-60C yalnızca PWM ile kullanılabilir. Daha fazla bilgi için bakınız, `DMC-60C Product Page- Ürün sayfası <https://reference.digilentinc.com/dmc-60c/start/>`__
zh_cn: DMC-60C在DMC-60控制器中增加了CAN智能控制器功能。由于制造商停止生产该产品，因此DMC-60C仅可与PWM一起使用。有关更多信息，请参见`DMC-60C产品页面<https://reference.digilentinc.com/dmc-60c/start/>`__

source: Venom Motor Controller
fr_ca: Contrôleur de moteur Venom
tr_tr: Venom Motor Kontrolörü
zh_cn: Venom电机控制器

source: The `Venom Motor Controller <https://www.playingwithfusion.com/productview.php?pdid=99>`__ from Playing With Fusion is integrated into a motor based on the original :term:`CIM`. Speed, current, temperature, and position are all measured onboard, enabling advanced control modes without complicated sensing and wiring schemes.
fr_ca: Le `Venom Motor Controller <https://www.playingwithfusion.com/productview.php?pdid=99>`__ de Playing With Fusion est intégré dans un moteur basé sur le :term:`CIM` original. La vitesse, le courant, la température et la position sont tous mesurés à bord, permettant des modes de contrôle avancés sans schémas de détection et de câblage compliqués.

source: Nidec Dynamo BLDC Motor with Controller
fr_ca: Moteur Nidec Dynamo BLDC avec contrôleur
tr_tr: Kontrolörlü Nidec Dynamo BLDC Motoru
zh_cn: 带控制器的Nidec Dynamo BLDC电机

source: The `Nidec Dynamo BLDC Motor with Controller <https://www.andymark.com/products/dynamo-brushless-motor-controller>`__ is the first brushless motor and controller legal in FRC. This motor's controller is integrated into the back of the motor. The `motor data sheet <https://cdn.andymark.com/media/W1siZiIsIjIwMTkvMDUvMDkvMDkvNTEvNDQvZjQwYjliZDctYzdkOC00MWFlLWIzZmYtZTQyNTJhYjRkNmIyL2FtLTM3NDAgTmlkZWMgRHluYW1vIERNMzAxMi0xMDYzLUIgU3BlYy5wZGYiXV0/am-3740%20Nidec%20Dynamo%20DM3012-1063-B%20Spec.pdf?sha=eb03d3f578fe782e>`__ provides more device specifics.
fr_ca: Le `moteur Nidec Dynamo BLDC avec contrôleur <https://www.andymark.com/products/dynamo-brushless-motor-controller>`__ est le premier moteur sans balais avec contrôleur intégré légal en FRC. Le contrôleur est intégré à l’arrière du moteur. La `fiche de données du moteur <https://andymark-weblinc.netdna-ssl.com/media/W1siZiIsIjIwMTkvMDUvMDkvMDkvNTEvNDQvZjQwYjliZDctYzdkOC00MWFlLWIzZmYtZTQyNTJhYjRkNmIyL2FtLTM3NDAgTmlkZWMgRHluYW1vIERNMzAxMi0xMDYzLUIgU3BlYy5wZGYiXV0/am-3740%20Nidec%20Dynamo%20DM3012-1063-B%20Spec.pdf?sha=eb03d3f578fe782e>`__ fournit plus de détails sur ce périphérique.

source: SD540B and SD540C Motor Controllers
fr_ca: Contrôleurs de Moteur SD540B et SD540C
tr_tr: SD540B ve SD540C Motor Kontrolörleri
zh_cn: SD540B和SD540C电机控制器

source: SD540B Motor Controller
fr_ca: Contrôleur de moteur SD540B

source: The SD540B and SD540C Motor Controllers from Mindsensors are controlled using PWM. CAN control is no longer available for the SD540C due to lack of manufacturer support. Limit switches may be wired directly to the SD540 to limit motor travel in one or both directions. For more information see the `Mindsensors FRC page <http://www.mindsensors.com/68-frc>`__
fr_ca: Les contrôleurs moteurs SD540B et SD540C de Mindsensors sont contrôlés à l’aide des ports PWM. Le contrôle par réseau CAN n’est plus disponible pour le SD540C en raison du manque de soutien du fabricant. Les détecteurs de fin de course peuvent être câblés directement au SD540 pour limiter les déplacements des moteurs dans une ou les deux directions. Pour plus d’informations, voir la page `Mindsensors FRC page <http://www.mindsensors.com/68-frc>`__
tr_tr: Mindsensors'tan SD540B ve SD540C Motor Kontrolörleri, PWM kullanılarak kontrol edilir. Üretici desteğinin olmaması nedeniyle SD540C için CAN kontrolü artık mevcut değil. Motor hareketini bir veya her iki yönde sınırlamak için limit anahtarları doğrudan SD540'a bağlanabilir. Daha fazla bilgi için `Mindsensors FRC sayfasına bakın <http://www.mindsensors.com/68-frc>`__
zh_cn: Mindsensors的SD540B和SD540C电机控制器使用PWM控制。由于缺乏制造商的支持，SD540C不再可以使用CAN控制。限位开关可以直接连接到SD540，以限制电机在一个或两个方向上的行程。有关更多信息，请参见`Mindsensors FRC页面<http://www.mindsensors.com/68-frc>`__

source: Spike H-Bridge Relay
fr_ca: Relais H-Bridge Spike
tr_tr: Spike H-Bridge Rölesi
zh_cn: Spike H-Bridge继电器

source: While this relay is still legal for FRC use, the manufacturer has discontinued this product.
fr_ca: Bien que ce relais soit toujours légal pour l’utilisation eb FRC, le manufacturier a cessé de fabriquer ce produit.
tr_tr: Bu röle FRC kullanımı için hala yasal olmakla birlikte, üretici bu ürünün üretimini durdurmuştur.
zh_cn: 尽管该继电器仍可用于FRC，但制造商已停止使用该产品。

source: The Spike H-Bridge Relay from VEX Robotics is a device used for controlling power to motors or other custom robot electronics. When connected to a motor, the Spike provides On/Off control in both the forward and reverse directions. The Spike outputs are independently controlled so it can also be used to provide power to up to 2 custom electronic circuits. The Spike H-Bridge Relay should be connected to a relay output of the roboRIO and powered from the Power Distribution Panel. For more information, see the `Spike User’s Guide <https://content.vexrobotics.com/docs/spike-blue-guide-sep05.pdf>`__.
fr_ca: Le Relais H-Bridge Spike de VEX Robotics est un dispositif utilisé pour contrôler l'alimentation des moteurs ou d'autre circuits électroniques personnalisés de robot. Quand il est connecté à un moteur, le Spike procure un contrôle de Marche/Arrêt dans les deux sens de rotation. Les sorties du Spike sont contrôlées indépendamment donc ils peuvent également être utilisés pour alimenter jusqu'à 2 circuits électroniques personnalisés. Le Relais H-Bridge Spike devrait être connecté à une sortie relais du roboRIO et alimenté du Panneau de Distribution de puissance. Pour d'autres informations, veuillez consulter le `Manuel de l'Utilisateur Spike <https://content.vexrobotics.com/docs/spike-blue-guide-sep05.pdf>`__.
zh_cn: VEX Robotics的Spike H桥继电器是一种用于控制电动机或其他自定义机器人电子设备电源的设备。当连接到电动机时，Spike可以在正向和反向上提供开/关控制。 Spike输出是独立控制的，因此它也可以用于为最多2个定制电子电路提供电源。 Spike H桥继电器应连接到roboRIO的继电器输出，并由配电盘供电。有关更多信息，请参见 `Spike用户指南<https://content.vexrobotics.com/docs/spike-blue-guide-sep05.pdf>`__。

source: Servo Power Module
fr_ca: Module d'Alimentation Servo
tr_tr: Servo Güç Modülü
zh_cn: 伺服电源模块

source: The Servo Power Module from Rev Robotics is capable of expanding the power available to servos beyond what the roboRIO integrated power supply is capable of. The Servo Power Module provides up to 90W of 6V power across 6 channels. All control signals are passed through directly from the roboRIO. For more information, see the `Servo Power Module webpage <https://www.revrobotics.com/rev-11-1144/>`__.
fr_ca: Le Module d'Alimentation Servo de REV Robotics est capable d'étendre la puissance disponible aux servos au-délà de ce que l'alimentation intégrée du roboRIO peut fournir. Le Module d'Alimentation Servo fournit jusqu'à 90W de puissance 6Volts sur 6 canaux. Tous les signaux de commande passent directement du roboRIO. Pour d'autres informations, veuillez consulter la `page web du Module d'Alimentation Servo <https://www.revrobotics.com/rev-11-1144/>`__.
zh_cn: Rev Robotics的伺服电源模块能够将伺服器可用的功率扩展到roboRIO集成电源所不具备的能力。伺服电源模块可通过6个通道提供高达90W的6V电源。所有控制信号都直接从roboRIO传递。有关更多信息，请参见`伺服电源模块网页<https://www.revrobotics.com/rev-11-1144/>`__。

source: The Microsoft Lifecam HD3000 is a USB webcam that can be plugged directly into the roboRIO. The camera is capable of capturing up to 1280x720 video at 30 FPS. For more information about the camera, see the `Microsoft product page <https://www.microsoft.com/en/accessories/business/lifecam-hd-3000-for-business>`__. For more information about using the camera with the roboRIO, see the :ref:`Vision Processing <docs/software/vision-processing/index:Vision Processing>` section of this documentation.
fr_ca: La caméra Microsoft Lifecam HD3000 est une webcam USB qui peut être branchée directement dans le roboRIO. Cette caméra peut capturer des vidéos à une résolution maximale de 1280x720 à 30 IPS. Pour plus d'information sur la caméra, consultez la `page de produit Microsoft <https://www.microsoft.com/en/accessories/business/lifecam-hd-3000-for-business>`__. Pour plus d'information à propos de l'utilisation de la caméra avec le roboRIO, consultez la section :ref:`Vision Processing <docs/software/vision-processing/index:Vision Processing>` de cette documentation.

source: Image Credits
fr_ca: Crédits d'Images
tr_tr: Görsel Alıntılar
zh_cn: 图片积分

source: Image of roboRIO courtesy of National Instruments. Image of DMC-60 courtesy of Digilent. Image of SD540 courtesy of Mindsensors. Images of Jaguar Motor Controller, Talon SRX, Talon FX, Victor 888, Victor SP, Victor SPX, and Spike H-Bridge Relay courtesy of VEX Robotics, Inc. Image of SPARK MAX, Power Distribution Hub, Radio Power Module, and Pneumatic Hub courtesy of REV Robotics. Lifecam, PDP, PCM, SPARK, and VRM photos courtesy of *FIRST*\ |reg|. All other photos courtesy of AndyMark Inc.
fr_ca: Image du roboRIO avec l'aimable autorisation de National Instruments. Image du DMC-60, une gracieuseté de Digilent. Image du SD540, une gracieuseté de Mindsensors. Images du contrôleur de moteur Jaguar, du Talon SRX, du Talon FX, du Victor 888, du Victor SP, du Victor SPX et du relais Spike H-Bridge, une gracieuseté de VEX Robotics, Inc. Images du SPARK MAX, du concentrateur de distribution de puissance, du module d'alimentation de la radio, et pneumatique, une gracieuseté de REV Robotics. Les photos des composants Lifecam, PDP, PCM, SPARK et VRM sont fournies par *FIRST*\ |reg|. Toutes les autres photos sont une gracieuseté d'AndyMark Inc.

source: Basic
tr_tr: Temel

source: Layout of the core components of the control system and introductory information for them.
tr_tr: Kontrol sistemindeki ana bileşenlerinin yerleşim düzeni ve bu bileşenlere dair tanıtıcı bilgiler.

source: Layout of all popular components of the control system including CTRE Control System Components
tr_tr: CTRE Kontrol Sistemi Bileşenleri dahil olmak üzere kontrol sistemindeki yaygın bileşenlerinin yerleşim düzeni

source: The :ref:`CTRE Power Distribution Panel <docs/software/can-devices/power-distribution-module:Power Distribution Module>` (PDP) is designed to distribute power from a 12VDC battery to various robot components through auto-resetting circuit breakers and a small number of special function fused connections. The PDP provides 8 output pairs rated for 40A continuous current and 8 pairs rated for 30A continuous current. The PDP provides dedicated 12V connectors for the roboRIO, as well as connectors for the Voltage Regulator Module and Pneumatics Control Module. It also includes a CAN interface for logging current, temperature, and battery voltage. For more detailed information, see the `PDP User Manual <https://ctre.download/files/user-manual/PDP%20User's%20Guide.pdf>`__.
tr_tr: The :ref:`CTRE Power Distribution Panel - CTRE Güç Dağıtım Paneli <docs/software/can-devices/power-distribution-module:Power Distribution Module>` (PDP) otomatik olarak sıfırlanan devre kesicileri ve az sayıdaki özel işlevli sigortalı bağlantıları aracılığıyla 12VDC aküden çeşitli robot parçalarına güç dağıtmak için tasarlanmıştır. PDP, 8 adet 40A sürekli akım çıkış çifti ile 8 adet 30A sürekli akım çıkış çifti içermektedir. PDP, roboRIO için 12V özel konnektörlerin yanı sıra Voltaj Regülatör Modülü ve Pnömatik Kontrol Modülü için de konnektörlere sahiptir. Panel ayrıca akım, sıcaklık ve pil voltajı bilgilerinin kaydedilebileceği bir CAN arayüzü içermektedir. Daha detaylı bilgi için bkz. `PDP User Manual <https://ctre.download/files/user-manual/PDP%20User's%20Guide.pdf>`__.

source: CTRE Power Distribution Panel 2.0
tr_tr: CTRE Power Distribution Panel 2.0 - CTRE Güç Dağıtım Paneli 2.0
