Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/controls-overviews/control-system-hardware.po
Languages: fr_ca, tr_tr, zh_cn

source: The `CTRE Power Distribution Panel 2.0 <https://store.ctr-electronics.com/products/pdp-2>`__ (PDP 2.0) is designed to distribute power from a 12VDC battery to various robot components. The PDP 2.0 features 24 40A channels and can accoommodate ATO breakers. The PDP 2.0 is designed to maximize efficiency.
tr_tr: `CTRE Power Distribution Panel 2.0 <https://store.ctr-electronics.com/products/pdp-2>`__ (PDP 2.0), 12VDC bir aküden çeşitli robot parçalarına güç dağıtmak için tasarlanmıştır. PDP 2.0, 24 adet 40A kanal içermekte ve panele ATO devre kesicileri eklenebilmektedir. PDP 2.0 mümkün olan en yüksek verimi almak için tasarlanmıştır.

source: The `REV Power Distribution Hub <https://docs.revrobotics.com/ion-control-system/pdh/overview>`__ (PDH) is designed to distribute power from a 12VDC battery to various robot components. The PDH features 20 high-current (40A max) channels, 3 low-current (15A max), and 1 switchable low-current channel. The Power Distribution Hub features toolless latching WAGO terminals, an LED voltage display, and the ability to connect over CAN or USB-C to the REV Hardware Client for real-time telemetry.
tr_tr: `REV Güç Dağıtım Merkezi - Power Distribution Hub <https://docs.revrobotics.com/ion-control-system/pdh/overview>`__ (PDH), 12VDC bir aküden çeşitli robot parçalarına güç dağıtmak için tasarlanmıştır. PDH 20 adet yüksek akım (maks. 40A) kanalı, 3 adet düşük akım (maks. 15A) ve 1 adet değiştirilebilir düşük akım kanalı içermektedir. Power Distribution Hub; merkezin üzerine aletsiz monte edilebilen WAGO terminallerine, LED voltaj göstergelerine ve CAN üzerinden veya USB-C aracılığıyla REV Hardware Client - REV Donanım İstemcisine bağlanma özelliğine sahiptir.

source: The CTRE Voltage Regulator Module (VRM) is an independent module that is powered by 12 volts. The device is wired to a dedicated connector on the PDP. The module has multiple regulated 12V and 5V outputs. The purpose of the VRM is to provide regulated power for the custom circuits, and IP vision cameras. For more information, see the `VRM User Manual <https://ctre.download/files/user-manual/VRM%20User's%20Guide.pdf>`__.
tr_tr: CTRE Voltage Regulator Module - Voltage Düzenleme Modülü (VRM), 12 voltluk bağımsız bir modüldür. Cihaz PDP üzerindeki özel bir konektöre bağlanmaktadır. Modül birçok 12 ve 5V regüle edilmiş çıkışa sahiptir. VRM'nin amacı özel devreler ve IP görüş kameralarına kontrollü güç sağlamaktır. Daha fazla bilgi için bkz. `VRM Kullanıcı Kılavuzu <https://ctre.download/files/user-manual/VRM%20User's%20Guide.pdf>`__.

source: Vivid-Hosting VH-109 Radio
tr_tr: Vivid-Hosting VH-109 Radyosu

source: VH-109 Radio on a white background with nothing plugged in.
tr_tr: Beyaz bir arkaplanda, cihaza hiçbir kablo takılmamış VH-109 Radyosu

source: The `Vivid-Hosting VH-109 radio <https://frc-radio.vivid-hosting.net/>`__ is designed specifically for FRC. It uses Wi-Fi 6E to avoid the common congestion problems that plague 2.4 GHz Wi-Fi networks. The ruggedized design allows for unfiltered power input coming directly from a power distribution device. It also has 4 Ethernet ports reducing the need for an additional network switch.
tr_tr: `Vivid-Hosting VH-109 Radyosu <https://frc-radio.vivid-hosting.net/>`__ FRC için özel olarak tasarlanmıştır. Radyoda, 2.4 GHz Wi-Fi ağlarının sıklıkla karşılaştığı yoğunluk sorununun üstesinden gelmek için Wi-Fi 6E kullanılmaktadır. Sert koşullara dayanıklı tasarımı doğrudan güç dağıtım cihazından gelen, değiştirilmemiş güç girişine elverişlidir. Radyo aynı zamanda ek ağ anahtarına olan ihtiyacı azaltan 4 adet ethernet girişine sahiptir.

source: Rev ATO Circuit Breakers
tr_tr: REV ATO Devre Kesiciler

source: The `Rev ATO Circuit Breakers <https://www.revrobotics.com/content/docs/REV-11-1860-1863-DS.pdf>`__ are used with the Power Distribution Panel, Power Distribution Hub and Power Distribution Panel 2.0 to limit current to branch circuits. They come in `40A <https://www.revrobotics.com/rev-11-1863/>`__, `30A <https://www.revrobotics.com/rev-11-1862/>`__, `20A <https://www.revrobotics.com/rev-11-1861/>`__ and `10A <https://www.revrobotics.com/rev-11-1860/>`__ variants. The ratings on these circuit breakers are for continuous current, temporary peak values can be considerably higher.
tr_tr: `Rev ATO Devre Kesiciler <https://www.revrobotics.com/content/docs/REV-11-1860-1863-DS.pdf>`__ Power Distribution Panel, Power Distribution Hub ve Power Distribution Panel 2.0 ile birlikte akımı branşman devrelerine sınırlamak için kulanılmaktadır. Devre kesicilerin; `40A <https://www.revrobotics.com/rev-11-1863/>`__, `30A <https://www.revrobotics.com/rev-11-1862/>`__, `20A <https://www.revrobotics.com/rev-11-1861/>`__ ve `10A <https://www.revrobotics.com/rev-11-1860/>`__ çeşitleri mevcuttur. Bu devre kesicilerdeki derecelendirmeler sürekli akım içindir, geçici tepe değerleri bu derecelendirmeden oldukça yüksek çıkabilir.

source: The :ref:`CTRE Pneumatics Control Module <docs/software/can-devices/pneumatics-control-module:Pneumatics Control Module>` (PCM) contains all of the inputs and outputs required to operate 12V or 24V pneumatic solenoids and the on board compressor. The PCM contains an input for the pressure sensor and will control the compressor automatically when the robot is enabled and a solenoid has been created in the code. For more information see the `PCM User Manual <https://ctre.download/files/user-manual/PCM%20User's%20Guide.pdf>`__.
tr_tr: :ref:`CTRE Pneumatics Control Module - CTRE Pnömatik Kontrol Modülü <docs/software/can-devices/pneumatics-control-module:Pneumatics Control Module>` (PCM) 12 veya 24V pnömatik solenoidleri ve donanımdaki kompresörü çalıştırmak için gerekli tüm giriş ve çıkışlara sahiptir. PCM basınç sensörü için bir giriş içermekte ve robot etkin hale getirilip, kodda bir solenoid oluşturulduğunda PCM kompresörü kendiliğinden kontrol edecektir. Daha fazla bilgi için bkz. `PCM User Manual <https://ctre.download/files/user-manual/PCM%20User's%20Guide.pdf>`__.

source: The `REV Pneumatic Hub <https://docs.revrobotics.com/ion-control-system/ph/overview>`__ is a standalone module that is capable of switching both 12V and 24V pneumatic solenoid valves. The Pneumatic Hub features 16 solenoid channels which allow for up to 16 single-acting solenoids, 8 double-acting solenoids, or a combination of the two types. The user selectable output voltage is fully regulated, allowing even 12V solenoids to stay active when the robot battery drops as low as 4.75V.
tr_tr: `REV Pneumatic Hub <https://docs.revrobotics.com/ion-control-system/ph/overview>`__ 12 ve 24V pnömatik solenoid valflerinden ikisini de değiştirebilen bağımsız bir modüldür. Pnömatik Hub, 16 adede kadar tek etkili solenoid, 8 adet çift etkili solenoid ve iki türün karışımına elverişli 16 adet solenoid kanalı içermektedir. Kullanıcı tarafından belirlenebilen çıkış voltajı tamamıyla regüle edilmiştir; bu sayede robot aküsü 4,75V kadar düştüğünde Pneumatic Hub 12V solenoidlerin bile etkin kalmasını sağlayabilmektedir.

source: There are a variety of different :ref:`motor controllers <docs/software/hardware-apis/index:Hardware APIs>` which work with the FRC Control System and are approved for use. These devices are used to provide variable voltage control of the brushed and brushless DC motors used in FRC. They are listed here in order of `usage <https://community.firstinspires.org/control-system-beta-testing-and-usage-reporting>`__ placement is estimated for devices where data is unavailable.
tr_tr: FRC Kontrol Sistemiyle uyumlu ve kullanıma uygun çeşitli :ref:`motor kontrolörleri <docs/software/hardware-apis/index:Hardware APIs>` bulunmaktadır. Bu cihazlar, FRC'de kullanılan fırçalı ve fırçasız DC motorlarına değişken voltaj kontrolü sağlamak için kullanılmaktadır. Cihazlar burada `kullanımlarına <https://community.firstinspires.org/control-system-beta-testing-and-usage-reporting>`__ göre sıralanmaktadır, hakkında veri bulunmayan cihazların sıralaması tahminidir.

source: The `SPARK MAX Motor Controller <https://www.revrobotics.com/rev-11-2158/>`__ is an advanced brushed and brushless DC motor controller from REV Robotics. When using CAN bus or USB control, the SPARK MAX uses input from limit switches, encoders, and other sensors, including the integrated encoder of the REV NEO Brushless Motor, to perform advanced control modes. The SPARK MAX can be controlled over PWM, CAN, or USB (for configuration/testing only). For more information, see the `SPARK MAX Documentation <https://docs.revrobotics.com/brushless/spark-max/overview>`__.
tr_tr: `SPARK MAX Motor Kontrolörü <https://www.revrobotics.com/rev-11-2158/>`__ REV Robotics tarafından geliştirilmiş gelişmiş fırçalı veya fırçasız bir DC motor kontrolörüdür. CAN veri yolu veya USB kontrolü kullanılırken gelişmiş kontrol modları yerine getirmek için SPARK MAX limit anahtarlarından, kodlayıcılardan ve, REV NEO Fırçasız Motorunun dahili kodlayıcısı dahil olmak üzere, çeşitli sensörlerden gelen girdileri kullanmaktadır. SPARK MAX; PMW, CAN veya (sadece kurulum/test amaçları için) USB aracılığıyla kontrol edilebilmektedir. Daha fazla bilgi için bkz. `SPARK MAX Belgeleri <https://docs.revrobotics.com/brushless/spark-max/overview>`__.

source: The TalonFX Motor Controller is a brushless motor controller from Cross The Road Electronics which is integrated into the Falcon 500, Kraken X60 and Kraken X44 brushless motors. It features an integrated encoder and all of the smart features of the Talon SRX and more! For more information see the `TalonFX Hardware Reference <https://v6.docs.ctr-electronics.com/en/stable/docs/hardware-reference/talonfx/>`__.
tr_tr: TalonFX Motor Kontrol Cihazı; Falcon 500, Kraken X60 ve Kraken X44 fırçasız motorlarına entegre edilmiş, Cross The Road Electronics tarafından geliştirilmiş fırçasız bir motor kontrolörüdür. Kontrolör dahili bir kodlayıcıya ve Talon SRX ile daha fazlasının tüm akıllı özelliklerine sahiptir! Daha fazla bilgi için bkz. `TalonFX Donanım Kılavuzu <https://v6.docs.ctr-electronics.com/en/stable/docs/hardware-reference/talonfx/>`__.

source: Victor SPX
tr_tr: Victor SPX Motor Kontrolörü

source: The `Victor SPX Motor Controller <https://store.ctr-electronics.com/victor-spx/>`__ is a CAN or PWM controlled motor controller from Cross The Road Electronics/VEX Robotics. The device is connectorized to allow easy connection to the roboRIO PWM connectors or a CAN bus. The case is sealed to prevent debris from entering the controller. For more information, see the `Victor SPX User Guide <https://ctre.download/files/user-manual/Victor%20SPX%20User's%20Guide.pdf>`__.
tr_tr: `Victor SPX Motor Kontrolörü <https://store.ctr-electronics.com/victor-spx/>`__ CAN veya PWM ile kontrol edilen, Cross The Road Electronics/VEX Robotics tarafından geliştirilmiş bir motor kontrolörüdür. Cihaz, roboRIO PWM konektörleri veya CAN veri yolu ile kolay bağlantıya izin verecek bir şekilde bağlanmıştır. Cihazın kasası kotrolöre toz vb. yabancı maddelerin kaçmasını engelleyecek şekilde tasarlanmıştır. Daha fazla bilgi için bkz. Victor SPX Kullanıcı Kılavuzu <https://ctre.download/files/user-manual/Victor%20SPX%20User's%20Guide.pdf>`__.

source: The `SPARK Motor Controller <https://www.revrobotics.com/content/docs/REV-11-1200-UM.pdf>`__ from REV Robotics is an inexpensive brushed DC motor controller. The SPARK is controlled using the PWM interface. Limit switches may be wired directly to the SPARK to limit motor travel in one or both directions.
tr_tr: REV Robotics tarafından geliştirilmiş `SPARK Motor Kontrolörü <https://www.revrobotics.com/content/docs/REV-11-1200-UM.pdf>`__ ucuz, fırçalı bir DC motor kontrolörüdür. SPARK, PWM arayüzü kullanılarak kontrol edilmektedir. Limit anahtarları, bir yönde ya da her iki yönedeki motor hareketini sınırlandırmak için doğrudan SPARK'ın kendisine bağlanabilmektedir.

source: Victor SP
tr_tr: Victor SP Motor Kontrolörü

source: SPARK Flex Motor Controller
tr_tr: SPARK MAX Motor Kontrolörü

source: Image of roboRIO courtesy of National Instruments. Image of DMC-60 courtesy of Digilent. Image of SD540 courtesy of Mindsensors. Images of Jaguar Motor Controller, Talon SRX, Victor 888, Victor SP, Victor SPX, and Spike H-Bridge Relay courtesy of VEX Robotics, Inc. Image of SPARK MAX, SPARK Flex, Servo Hub, ATO Breakers, Power Distribution Hub, and Pneumatic Hub courtesy of REV Robotics. Images of TalonFX, TalonFXS, and Power Distribution Panel 2.0 courtesy of Cross The Road Electronics, LLC. Image of Thrifty Nova courtesy of The Thrifty Bot. Lifecam, PDP, PCM, SPARK, and VRM photos courtesy of *FIRST*\ |reg|. Image of the VH-109 radio courtesy of Vivid-Hosting. All other photos courtesy of AndyMark Inc.
tr_tr: RoboRIO görüntüsü National Instruments tarafından; DMC-60 görüntüsü Digilent tarafından; SD540 görüntüsü Mindsensors' tarafından; Jaguar Motor Kontrolörü, Talon SRX, Talon FX, Victor 888, Victor SP, Victor SPX ve Spike H-Bridge Relay görüntüleri VEX Robotics, Inc tarafından; SPARK MAX, Güç Dağıtım Merkezi, Radyo Güç Modülü ve Pneumatic Hub görüntüleri REV Robotics tarafından; TalonFX, TalonFXS, and Power Distribution Panel 2.0 görüntüleri Cross The Road Electronics, LLC. tarafından; Thrifty Nova görüntüsü The Thrifty Bot tarafından; Lifecam, PDP, PCM, SPARK ve VRM fotoğrafları *FIRST*\ |reg| tarafından; VH-109 radyosunun görüntüsü Vivid-Hosting tarafından; diğer tüm fotoğraflar AndyMark Inc. tarafından sağlanmış ve kullanılan tüm görseller sahiplerine aittir.

source: For complete wiring instructions/diagrams, please see the :doc:`Wiring the FRC Control System </docs/zero-to-robot/step-1/how-to-wire-a-robot>` document.
zh_cn: 有关完整的接线说明/图表，请参阅文档：:doc:`FRC控制系统的接线</docs/zero-to-robot/step-1/how-to-wire-a-robot>`

source: Either the OpenMesh OM5P-AN or `OpenMesh OM5P-AC <https://www.openmesh.com/resource-downloads/OM-Series-Datasheet.pdf>`__ wireless radio is used as the robot radio to provide wireless communication functionality to the robot. The device can be configured as an Access Point for direct connection of a laptop for use at home. It can also be configured as a bridge for use on the field. The robot radio should be powered by one of the 12V/2A outputs on the VRM and connected to the roboRIO controller over Ethernet. For more information, see :ref:`Programming your Radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`.
zh_cn: OpenMesh OM5P-AN或`OpenMesh OM5P-AC <https://www.openmesh.com/resource-downloads/OM-Series-Datasheet.pdf>`__无线无线电都被用作机器人无线电，以向机器人提供无线通信功能。可以将设备配置为接入点，以直接连接笔记本电脑以在家中使用。也可以将其配置为在现场使用的桥梁。机器人无线电应由VRM上的12V / 2A输出之一供电，并通过以太网连接到roboRIO控制器。有关更多信息，请参见：:ref:`对无线电编程 <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`.

source: The Snap Action circuit breakers, `MX5 series <http://www.snapaction.net/pdf/MX5%20Spec%20Sheet.pdf>`__ and `VB3 Series <http://www.snapaction.net/pdf/vb3.pdf>`__, are used with the Power Distribution Panel to limit current to branch circuits. The ratings on these circuit breakers are for continuous current, temporary peak values can be considerably higher.
zh_cn: 速动断路器，MX5系列<http://www.snapaction.net/pdf/MX5%20Spec%20Sheet.pdf>`__和`VB3系列<http://www.snapaction.net/pdf/vb3.pdf>`__，与配电面板一起使用，以限制分支电路的电流。这些断路器的额定值适用于连续电流，临时峰值可能会更高。

source: The Robot Signal Light (RSL) is required to be the Allen-Bradley 855PB-B12ME522. It is directly controlled by the roboRIO and will flash when enabled and stay solid while disabled.
zh_cn: 机器人信号灯（RSL）必须是Allen-Bradley 855PB-B12ME522。它由roboRIO直接控制，启用后会闪烁，禁用时会保持稳定。

source: The `Talon SRX Motor Controller <https://www.ctr-electronics.com/talon-srx.html>`__ is a "smart motor controller" from Cross The Road Electronics/VEX Robotics. The Talon SRX can be controlled over the CAN bus or PWM interface. When using the CAN bus control, this device can take inputs from limit switches and potentiometers, encoders, or similar sensors in order to perform advanced control. For more information see the `Talon SRX User's Guide <http://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__.
zh_cn: `Talon SRX 电机控制器<https://www.ctr-electronics.com/talon-srx.html>`__ 是Cross The Road Electronics / VEX Robotics的“智能电动机控制器”。 Talon SRX可以通过CAN总线或PWM接口进行控制。使用CAN总线控制时，此设备可以从限位开关和电位计，编码器或类似传感器获取输入，以执行高级控制。有关更多信息，请参见`《 Talon SRX用户指南<http://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__。

source: The `Victor SPX Motor Controller <http://www.ctr-electronics.com/control-system/motor-control/victor-spx.html>`__ is a CAN or PWM controlled motor controller from Cross The Road Electronics/VEX Robotics. The device is connectorized to allow easy connection to the roboRIO PWM connectors or a CAN bus. The case is sealed to prevent debris from entering the controller. For more information, see the `Victor SPX User Guide <http://www.ctr-electronics.com/downloads/pdf/Victor%20SPX%20User's%20Guide.pdf>`__.
zh_cn: `Victor SPX电动机控制器<http://www.ctr-electronics.com/control-system/motor-control/victor-spx.html>`__是Cross The Road Electronics / VEX Robotics提供的CAN或PWM控制的电动机控制器。该设备已连接，可轻松连接到roboRIO PWM连接器或CAN总线。外壳被密封以防止碎屑进入控制器。有关更多信息，请参见`Victor SPX用户指南<http://www.ctr-electronics.com/downloads/pdf/Victor%20SPX%20User's%20Guide.pdf>` __。

source: The `TalonFX Motor Controller <http://www.ctr-electronics.com/talon-fx.html>`__ is integrated into the Falcon 500 brushless motor. It features an integrated encoder and all of the smart features of the Talon SRX and more! For more information see the `Falcon 500 User Guide <http://www.ctr-electronics.com/downloads/pdf/Falcon%20500%20User%20Guide.pdf>`__.
zh_cn: `TalonFX电动机控制器<http://www.ctr-electronics.com/talon-fx.html>`__已集成到Falcon 500无刷电动机中。它具有集成的编码器以及Talon SRX的所有智能功能以及更多功能！有关更多信息，请参见`Falcon 500用户指南<http://www.ctr-electronics.com/downloads/pdf/Falcon%20500%20User%20Guide.pdf>`__。

source: The `SPARK Motor Controller <https://www.revrobotics.com/rev-11-1200/>`__ from REV Robotics is an inexpensive brushed DC motor controller. The SPARK is controlled using the PWM interface. Limit switches may be wired directly to the SPARK to limit motor travel in one or both directions. For more information, see the `SPARK User's Manaul <https://www.revrobotics.com/content/docs/REV-11-1200-UM.pdf>`__.
zh_cn: REV Robotics的`SPARK电动机控制器<https://www.revrobotics.com/rev-11-1200/>`__是一种廉价的有刷直流电动机控制器。使用PWM接口控制SPARK。限位开关可以直接连接到SPARK，以限制电机在一个或两个方向上的行程。有关更多信息，请参见“ SPARK用户的手册<https://www.revrobotics.com/content/docs/REV-11-1200-UM.pdf>” __。

source: The `Victor SP Motor Controller <https://www.ctr-electronics.com/downloads/pdf/Victor-SP-Quick-Start-Guide.pdf>`__ is a PWM motor controller from Cross The Road Electronics/VEX Robotics. The Victor SP has an electrically isolated metal housing for heat dissipation, making the use of the fan optional. The case is sealed to prevent debris from entering the controller. The controller is approximately half the size of previous models.
zh_cn: `Victor SP Motor Controller <https://www.ctr-electronics.com/downloads/pdf/Victor-SP-Quick-Start-Guide.pdf>`__是Cross The Road Electronics / VEX Robotics的PWM电机控制器。 Victor SP具有用于散热的电气隔离金属外壳，因此可以选择使用风扇。外壳被密封以防止碎屑进入控制器。该控制器的尺寸约为以前型号的一半。

source: The `Talon Motor Controller <https://ctr-electronics.com/Talon_User_Manual_1_1.pdf>`__ from Cross the Road Electronics is a PWM controlled brushed DC motor controller with passive cooling.
zh_cn: Cross the Road Electronics的`Talon电动机控制器<https://ctr-electronics.com/Talon_User_Manual_1_1.pdf>`__是具有被动冷却功能的PWM控制的有刷直流电动机控制器。

source: The `Venom Motor Controller <https://www.playingwithfusion.com/productview.php?pdid=99>`__ from Playing With Fusion is integrated into a motor based on the original CIM. Speed, current, temperature, and position are all measured onboard, enabling advanced control modes without complicated sensing and wiring schemes.
zh_cn: Play With Fusion的`Venom电机控制器<https://www.playingwithfusion.com/productview.php?pdid=99>`__已集成到基于原始CIM的马达中。速度，电流，温度和位置都在机上测量，从而实现了高级控制模式，而无需复杂的检测和接线方案。

source: The `Nidec Dynamo BLDC Motor with Controller <https://www.andymark.com/products/dynamo-brushless-motor-controller>`__ is the first brushless motor and controller legal in FRC. This motor's controller is integrated into the back of the motor. The `motor data sheet <https://andymark-weblinc.netdna-ssl.com/media/W1siZiIsIjIwMTkvMDUvMDkvMDkvNTEvNDQvZjQwYjliZDctYzdkOC00MWFlLWIzZmYtZTQyNTJhYjRkNmIyL2FtLTM3NDAgTmlkZWMgRHluYW1vIERNMzAxMi0xMDYzLUIgU3BlYy5wZGYiXV0/am-3740%20Nidec%20Dynamo%20DM3012-1063-B%20Spec.pdf?sha=eb03d3f578fe782e>`__ provides more device specifics.
zh_cn: `具有控制器的Nidec Dynamo BLDC电动机<https://www.andymark.com/products/dynamo-brushless-motor-controller>`__是FRC中首款合法的无刷电动机和控制器。该电动机的控制器集成在电动机的背面。`电机数据表<https://andymark-weblinc.netdna-ssl.com/media/W1siZiIsIjIwMTkvMDUvMDkvMDkvNTEvNDQvZjQwYjliZDctYzdkOC00MWFlLWIzZmYtZTQyNTJhYjRkNmIyL2FtLTM3NDAgTmlkZWMgRHluYW1vIERNMzAxMi0xMDYzLUIgU3BlYy5wZGYiXV0/am-3740%20Nidec%20Dynamo%20DM3012-1063-B%20Spec.pdf?sha=eb03d3f578fe782e>`__提供了更多设备详细信息。

source: Axis M1013/M1011/206 Ethernet Camera
zh_cn: Axis M1013 / M1011 / 206以太网摄像机

source: While this camera is legal for FRC use, the manufacturer has discontinued support.
zh_cn: 尽管此相机在FRC是合法的，但制造商已停止支持。

source: The Axis M1013, M1011 and Axis 206 Ethernet cameras are used for capturing images for vision processing and/or sending video back to the Driver Station laptop. The camera should be wired to a 5V power output on the Voltage Regulator Module and an open ethernet port on the robot radio. For more information, see :ref:`Configuring an Axis Camera <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>` and the `Axis 206 <https://www.axis.com/en-us/products/axis-206>`__, `Axis M1011 <https://www.axis.com/en-us/products/axis-m1011>`__, `Axis M1013 pages <https://www.axis.com/en-us/products/axis-m1013>`__.
zh_cn: Axis M1013，M1011和Axis 206以太网摄像机用于捕获图像以进行视觉处理和/或将视频发送回Driver Station便携式计算机。摄像机应连接至稳压器模块上的5V电源输出以及机器人无线电上的开放以太网端口。有关更多信息，请参阅 :ref:`配置Axis 相机<docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>` and the `Axis 206 <https://www.axis.com/en-us/products/axis-206>`__, `Axis M1011 <https://www.axis.com/en-us/products/axis-m1011>`__, `Axis M1013 pages <https://www.axis.com/en-us/products/axis-m1013>`__.

source: The Microsoft Lifecam HD3000 is a USB webcam that can be plugged directly into the roboRIO. The camera is capable of capturing up to 1280x720 video at 30 FPS. For more information about the camera, see the `Microsoft product page <https://www.microsoft.com/accessories/en-us/business/lifecam-hd-3000-for-business/t4h-00002>`__. For more information about using the camera with the roboRIO, see the :ref:`Vision Processing <docs/software/vision-processing/index:Vision Processing>` section of this documentation.
zh_cn: Microsoft Lifecam HD3000是可直接插入roboRIO的USB网络摄像头。该摄像机能够以30 FPS的速度捕获多达1280x720的视频。有关相机的更多信息，请参见`Microsoft产品页面<https://www.microsoft.com/accessories/en-us/business/lifecam-hd-3000-for-business/t4h-00002>`__。有关将相机与roboRIO结合使用的更多信息，请参阅本文档的“视觉处理”部分。

source: Image of roboRIO courtesy of National Instruments. Image of DMC-60 courtesy of Digilent. Image of SD540 courtesy of Mindsensors. Images of Jaguar Motor Controller, Talon SRX, Talon FX, Victor 888, Victor SP, Victor SPX, and Spike H-Bridge Relay courtesy of VEX Robotics, Inc. Image of SPARK MAX courtesy of REV Robotics. Lifecam, PDP, PCM, SPARK, and VRM photos courtesy of *FIRST*\ |reg|. All other photos courtesy of AndyMark Inc.
zh_cn: roboRIO的图片由National Instruments提供。 DMC-60的图片由Digilent提供。 SD540图片由Mindsensors提供。Jaguar电机控制器，Talon SRX，Talon FX，Victor 888，Victor SP，Victor SPX和Spike H-Bridge继电器的图像由VEX Robotics，Inc.提供。SPARK MAX的图像由REV Robotics提供。 Lifecam，PDP，PCM，SPARK和VRM照片由*FIRST*\ |reg|提供。所有其他照片均由AndyMark Inc.提供。
