Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/controls-overviews/control-system-software.po
Languages: fr_ca, ja, tr_tr, zh_cn

source: WPIcal is a cross-platform utility that can be used to calibrate the Apriltags on FRC fields to correct for field setup error. For more information see the :ref:`WPIcal section <docs/software/wpilib-tools/wpical/index:WPIcal>`.
tr_tr: WPIcal birden fazla programla uyumlu, FRC sahalarında saha kurulumundaki hataları düzeltmek için Apriltagl'eri ayarlamakta kullanılabilen yardımcı bir programdır. Daha fazla bilgi için bkz. :ref:`WPIcal section <docs/software/wpilib-tools/wpical/index:WPIcal>`.
