Repository: wpilibsuite/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/controls-overviews/control-system-software.po
Languages: fr_ca, ja, tr_tr, zh_cn

source: Software Component Overview
fr_ca: Aperçu des composants logiciels
ja: ソフトウエアコンポーネントの概要
tr_tr: Yazılım Bileşenine Genel Bakış
zh_cn: 软件组件概述

source: The FRC\ |reg| software consists of a wide variety of mandatory and optional components. These elements are designed to assist you in the design, development, and debugging of your robot code as well as assist with control robot operation and to provide feedback when troubleshooting. For each software component this document will provide a brief overview of its purpose, a link to the package download, if appropriate, and a link to further documentation where available.
fr_ca: La partie logicielle FRC\ |reg| se compose d’une grande variété de composants obligatoires et optionnels. Ces éléments sont conçus pour vous aider dans la conception, le développement et le débogage de votre code robot ainsi que pour aider au contrôle fonctionnement du robot et pour fournir des informations de retour lors du dépannage. Pour chaque composant logiciel, ce document fournira un bref aperçu de son objet, un lien vers le téléchargement du package, le cas échéant, et un lien vers d’autres documents, le cas échéant.
ja: FRC\ |reg| ソフトウェアは、様々な必須コンポーネントとオプション・コンポーネントで構成されています。これらの要素は、ロボットコードの設計、開発、デバッグを支援し、ロボット操作の制御を支援し、トラブルシューティング時にフィードバックを提供するように設計されています。このドキュメントでは、各ソフトウェアコンポーネントについて、その目的の簡単な概要、必要に応じてパッケージのダウンロードへのリンク、および利用可能な場合には詳細なドキュメントへのリンクを提供します。
tr_tr: FRC \ |reg| yazılım, çok çeşitli zorunlu ve isteğe bağlı bileşenlerden oluşur. Bu öğeler, robot kodunuzun tasarımı, geliştirilmesi ve hata ayıklamasında size yardımcı olmanın yanı sıra kontrol robotunun çalışmasına yardımcı olmak ve sorun giderme sırasında geri bildirim sağlamak için tasarlanmıştır. Bu belge, her bir yazılım bileşeni için, amacına ilişkin kısa bir genel bakış, uygunsa paket indirme bağlantısı ve varsa diğer belgelere bağlantı sağlar.
zh_cn: FRC\ |reg| 软件包含各种强制性和可选性组件。它们旨在帮助您设计，开发和调试机器人代码、您控制机器人，并在排除故障时提供反馈。本文档将简要概述每个软件组件的用途，提供软件包下载链接以及其他文档的链接。

source: Operating System Compatibility
fr_ca: Compatibilité du système d'exploitation
ja: オペレーティング・システムの互換性
tr_tr: İşletim Sistemi Uyumluluğu
zh_cn: 操作系统兼容性

source: The primary supported OS for FRC components is Windows. All required FRC software components have been tested on Windows 10. NI Tools do not support Windows 7 or 8.1.
fr_ca: Le principal système d’exploitation pris en charge pour les composants FRC est Windows. Tous les composants logiciels FRC requis ont été testés sur Windows 10. Les outils NI ne prennent pas en charge Windows 7 ou 8.1.
zh_cn: FRC组件主要支持的操作系统是Windows。所有所需的FRC软件组件已在Windows 10上测试过。说明NI Tools不支持Windows 7、8.1操作系统。

source: Many of the tools for C++/Java programming are also supported and tested on macOS and Linux. Teams programming in C++/Java should be able to develop using these systems, using a Windows system for the Windows-only operations such as the Driver Station, Radio Configuration Utility, and roboRIO Imaging Tool.
fr_ca: La plupart des outils de programmation C++/Java sont également pris en charge et testés sous macOS et Linux. Les équipes qui programment en C++/Java devraient être en mesure de développer à l’aide de ces systèmes, en utilisant un système Windows pour les opérations windows uniquement telles que l'application Driver Station, l’utilitaire Radio Configuration Utility et l’outil roboRIO Imaging Tool
zh_cn: 在macOS和Linux上也支持并测试了许多用于C ++ / Java编程的工具。使用C ++ / Java进行编程的团队应该能够使用这些系统进行开发，并且使用Windows系统完成仅限Windows的操作，例如Driver Station，Radio Configuration Utility和roboRIO Imaging Tool。

source: The minimum supported macOS version is Mojave (10.14.x).
fr_ca: La version macOS minimale prise en charge est Mojave (10.14.x).
zh_cn: 支持的最低macOS版本是Mojave（10.14.x）。

source: LabVIEW FRC (Windows Only)
fr_ca: LabVIEW FRC (Windows seulement)
ja: LabVIEW FRC (Windowsのみ)
tr_tr: LabVIEW FRC (Yalnızca Windows)
zh_cn: LabVIEW FRC（仅支持Windows）

source: LabVIEW FRC Getting Started screen.
fr_ca: Fenêtre Pour Commencer LabVIEW FRC
ja: LabVIEW FRCのGetting Started画面。
tr_tr: LabVIEW FRC Başlangıç Ekranı
zh_cn: 35/5000 LabVIEW FRC开始屏幕。

source: LabVIEW FRC, based on a recent version of LabVIEW Professional, is one of the three officially supported languages for programming an FRC robot. LabVIEW is a graphical, dataflow-driven language. LabVIEW programs consist of a collection of icons, called VIs, wired together with wires which pass data between the VIs. The LabVIEW FRC installer is distributed on a DVD found in the Kickoff Kit of Parts and is also available for download. A guide to getting started with the LabVIEW FRC software, including installation instructions can be found :ref:`here <docs/zero-to-robot/step-2/labview-setup:Installing LabVIEW for FRC (LabVIEW only)>`.
fr_ca: LabVIEW FRC, basé sur une version récente de LabVIEW Professional, est l’un des trois langages officiellement pris en charge pour la programmation d’un robot FRC. LabVIEW est un langage graphique axé sur le flux de données. Les programmes LabVIEW consistent en une collection d’icônes, appelées Instruments Virtuels ou VIs, connectées avec des fils qui transmettent des données entre les VIs. L’installateur LabVIEW FRC est distribué sur un DVD livré au lancement dans le kit de pièces et est également disponible en ligne par téléchargement. Un guide pour commencer avec le logiciel LabVIEW FRC, comprenant les instructions d’installation peut être trouvé :ref:`ici <docs/zero-to-robot/step-2/labview-setup:Installing LabVIEW for FRC (LabVIEW only)>`.
ja: LabVIEW Professionalの最新バージョンをベースにしたLabVIEW FRCは、FRCロボットをプログラミングするために公式にサポートされている3つの言語のうちの1つです。データフロー駆動型のビジュアルプログラミング言語です。LabVIEWプログラムは、VIというアイコンの集まりで構成され、その間でデータを受け渡すワイヤで接続されています。LabVIEW FRCのインストーラはキックオッフのKit of Partsに入ったDVD、またはオンラインダウンロードで入手が出来ます。インストールの説明を含むLabVIEW FRCソフトウェアのスタートガイドは :ref:`こちら <docs/zero-to-robot/step-2/labview-setup:Installing LabVIEW for FRC (LabVIEW only)>` です。
tr_tr: LabVIEW Professional'ın son sürümüne dayanan LabVIEW FRC, bir FRC robotu programlamak için resmi olarak desteklenen üç dilden biridir. LabVIEW grafiksel, veri akışı odaklı bir dildir. LabVIEW programları, VI'lar arasında veri ileten kablolarla birlikte bağlanan ve VI adı verilen bir simgeler koleksiyonundan oluşur. LabVIEW FRC yükleyici, Kickoff Parça Kitinde bulunan bir DVD'de dağıtılır ve ayrıca indirilebilir. Kurulum talimatları dahil olmak üzere LabVIEW FRC yazılımına başlama kılavuzu bulunabilir :ref:`here <docs/zero-to-robot/step-2/labview-setup:Installing LabVIEW for FRC (LabVIEW only)>`.
zh_cn: 基于最新版本的LabVIEW Professional语言的LabVIEW FRC语言，是得到官方支持的用于FRC机器人编程的三种的语言之一。 LabVIEW是一种图形化、数据流驱动的语言。 LabVIEW程序由称为VI的图标集合组成，这些图标通过在VI之间传递数据的导线连接在一起。 LabVIEW FRC安装程序在Kickoff套件里的DVD中，也可以从网上下载。 LabVIEW FRC软件入门指南，与安装说明，可在:ref:`此处 <docs/zero-to-robot/step-2/labview-setup:Installing LabVIEW for FRC (LabVIEW only)>`找到。

source: Welcome screen of Visual Studio Code.
fr_ca: Écran d’accueil de Visual Studio Code.
ja: Visual Studio Codeのようこそ画面。
tr_tr: Visual Studio Code Başlangıç Ekranı
zh_cn: VisualStudio Code 开始界面

source: Visual Studio Code is the supported development environment for C++ and Java (the other two supported languages). Both are object-oriented text based programming languages. A guide to getting started with C++ or Java for FRC, including the installation and configuration of Visual Studio Code can be found :ref:`here <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`.
fr_ca: Visual Studio Code est l’environnement de développement pris en charge pour C++ et Java (les deux autres langages pris en charge). Ce sont tous deux des langages de programmation orientés objet basés sur le texte. Un guide pour commencer avec C++ ou Java pour FRC, comprenant l’installation et la configuration de Visual Studio Code est disponible :ref:`ici <docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>`.
zh_cn: Visual Studio Code是C ++和Java（其他两种受支持的语言）支持的开发环境。两者都是面向对象的基于文本的编程语言。可以在此处找到<docs/zero-to-robot/step-2/wpilib-setup:WPILib Installation Guide>的C ++或Java for FRC入门指南，包括Visual Studio Code的安装和配置。

source: FRC Driver Station Powered by NI LabVIEW (Windows Only)
fr_ca: FRC Driver Station par NI LabVIEW (Windows seulement)
ja: FRC Driver Station Powered by NI LabVIEW (Windowsのみ)
tr_tr: NI LabVIEW Tarafından Desteklenen FRC Sürücü İstasyonu (Yalnızca Windows)
zh_cn: NI LabVIEW支持的FRC Driver Station（仅支持Windows）

source: Driver Station on the first tab with the robot disabled and disconnected.
fr_ca: Driver Station sur le premier onglet avec le robot désactivé et déconnecté.
ja: ロボットが無効化され、切断された状態で最初のタブにあるドライバーステーション。
zh_cn: 机器操控台在机器人被禁用并断开连接的第一个选项卡上。

source: This is the only software allowed to be used for the purpose of controlling the state of the robot during competition. This software sends data to your robot from a variety of input devices. It also contains a number of tools used to help troubleshoot robot issues. More information about the FRC Driver Station Powered by NI LabVIEW can be found :ref:`here <docs/software/driverstation/driver-station:FRC Driver Station Powered by NI LabVIEW>`.
fr_ca: C’est le seul logiciel autorisé à être utilisé dans le but de contrôler l’état du robot pendant la compétition. Ce logiciel envoie des données à votre robot à partir d’une variété de périphériques d’entrée. Il contient également un certain nombre d’outils utilisés pour aider à résoudre les défaillances du robot. Plus d’informations sur FRC Driver Station Optimisé par NI LabVIEW peuvent être trouvées :ref:`ici <docs/software/driverstation/driver-station:FRC Driver Station Powered by NI LabVIEW>`.
ja: 競技中にロボットの状態を制御する目的で使用できる唯一のソフトウェアです。このソフトウェアは、様々な入力デバイスからロボットにデータを送信します。また、ロボットの問題のトラブルシューティングに使用される多くのツールも含まれています。 FRC Driver Station Powered by NI LabVIEW についての詳細は :ref:`こちら <docs/software/driverstation/driver-station:FRC Driver Station Powered by NI LabVIEW>` にあります。
tr_tr: Yarışma sırasında robotun durumunu kontrol etmek amacıyla kullanılmasına izin verilen tek yazılım budur. Bu yazılım, robotunuza çeşitli giriş cihazlarından veri gönderir. Ayrıca, robot sorunlarını gidermeye yardımcı olmak için kullanılan bir dizi araç içerir. NI LabVIEW Tarafından Desteklenen FRC Sürücü İstasyonu hakkında daha fazla bilgi bulunabilir :ref:`here <docs/software/driverstation/driver-station:FRC Driver Station Powered by NI LabVIEW>`.
zh_cn: 这是唯一一个能用来在比赛期间控制机器人状态的软件。 它可通过各种输入设备将数据发送到您的机器人。 它还包含许多工具，用于帮助对机器人问题进行故障排除。 可以 :ref:`在此 <docs/software/driverstation/driver-station:FRC Driver Station Powered by NI LabVIEW>`找到有关它的更多信息。

source: Dashboard Options
fr_ca: Options du Dashboard
ja: ダッシュボード設定
tr_tr: Gösterge Tablosu Seçenekleri
zh_cn: Dashboard选项

source: LabVIEW Dashboard (Windows Only)
fr_ca: LabVIEW Dashboard (Windows seulement)
ja: LabVIEWダッシュボード (Windowsのみ)
tr_tr: LabVIEW Dashboard (Yalnızca Windows)
zh_cn: LabVIEW Dashboard（仅支持Windows）

source: The default LabVIEW Dashboard on the Drive tab.
fr_ca: Le Dashboard LabVIEW par défaut dans l’onglet Drive.
ja: デフォルト状態では、ドライブのタブにあるLabVIEWダッシュボード。
tr_tr: Drive sekmesindeki varsayılan LabVIEW Dashboard.
zh_cn: 驱动器选项卡上的默认LabVIEW仪表盘。

source: The LabVIEW Dashboard is automatically launched by the FRC Driver Station by default. The purpose of the Dashboard is to provide feedback about the operation of the robot using tabbed display with a variety of built in features. More information about the FRC Default Dashboard software can be found :ref:`here <docs/software/dashboards/labview-dashboard/driver-station-labview-dashboard:FRC LabVIEW Dashboard>`.
fr_ca: Le tableau de bord LabVIEW est lancé automatiquement par la FRC Driver Station par défaut. L'objectif du tableau de bord est de fournir des informations sur le fonctionnement du robot à l'aide d'un affichage à onglets avec une variété de fonctionnalités intégrées. Vous trouverez plus d'informations sur le logiciel FRC Default Dashboard :ref:`ici <docs/software/dashboards/labview-dashboard/driver-station-labview-dashboard:FRC LabVIEW Dashboard>`.
ja: LabVIEW DashboardはデフォルトでFRC Driver Stationによって自動的に起動されます。ダッシュボードの目的は、様々な機能が組み込まれたタブ表示を使ってロボットの操作に関するフィードバックを提供することです。 FRCデフォルトダッシュボードソフトウェアの詳細は :ref:`こちら <docs/software/dashboards/labview-dashboard/driver-station-labview-dashboard:FRC LabVIEW Dashboard>` をご覧ください。
tr_tr: LabVIEW Dashboard, varsayılan olarak FRC Driver Station tarafından otomatik olarak başlatılmaktadır. Dashboard'un amacı, çeşitli yerleşik özelliklere sahip sekmeli ekranı kullanarak robotun çalışması hakkında geri bildirim sağlamaktır. FRC Default Dashboard yazılımı hakkında daha fazla bilgiye :ref:`buradan <docs/software/labview-dashboard/driver-station-labview-dashboard:FRC LabVIEW Dashboard>` ulaşabilirsiniz.
zh_cn: LabVIEW Dashboard默认由FRC机器操控台自动启动。Dashboard的目的是使用带有各种内置功能的选项卡显示提供关于机器人操作的反馈。更多关于FRC默认仪表盘软件的信息可以在这里找到:ref: '<docs/software/dashboards/labview-dashboard/driver-station-labview-dashboard:FRC LabVIEW Dashboard>`.

source: SmartDashboard
zh_cn: 智能仪表盘

source: SmartDashboard with 3 widgets added.
fr_ca: SmartDashboard avec 3 widgets ajoutés.
ja: SmartDashboardに3つのウィジェットが追加されました。
zh_cn: SmartDashboard添加了3个小部件。

source: SmartDashboard allows you to view your robot data by automatically creating customizable indicators specifically for each piece of data sent from your robot. Additional documentation on SmartDashboard can be found :ref:`here <docs/software/dashboards/smartdashboard/index:SmartDashboard>`.
fr_ca: SmartDashboard vous permet de visualiser les données de votre robot en créant automatiquement des indicateurs personnalisables spécifiquement pour chaque donnée envoyée par votre robot. Une documentation supplémentaire sur SmartDashboard peut être trouvée :ref:`ici <docs/software/dashboards/smartdashboard/index:SmartDashboard>`.
ja: SmartDashboardは、ロボットから送信される各データに特化したカスタマイズ可能なインジケータを自動的に作成することで、ロボットのデータを表示することができます。SmartDashboardに関するその他のドキュメントは :ref:`こちら <docs/software/dashboards/smartdashboard/index:SmartDashboard>` をご覧ください。
zh_cn: SmartDashboard允许您通过为机器人发送的每条数据自动创建可定制的指标来查看机器人数据。SmartDashboard的其他文档可以找到:ref:`here <docs/software/dashboards/smartdashboard/index:SmartDashboard>`.

source: Shuffleboard
zh_cn: 模块化仪表盘

source: Shuffleboard with 3 widgets from their NetworkTables entries added.
fr_ca: Shuffleboard avec 3 widgets ajoutés à partir de leurs entrées NetworkTables.
ja: Shuffleboardに3つのウィジェットが、NetworkTablesのエントリに基づいて追加されました。
zh_cn: 模块化仪表盘与3小部件从他们的网络表条目添加。

source: Shuffleboard has the same features as SmartDashboard. It also improves on the setup and visualization of your data with new features and a modern design at the cost of being less resource efficient. Additional documentation on Shuffleboard can be found :ref:`here <docs/software/dashboards/shuffleboard/index:Shuffleboard>`.
fr_ca: Shuffleboard a les mêmes fonctionnalités que SmartDashboard. Il améliore également la configuration et la visualisation de vos données avec de nouvelles fonctionnalités et une conception moderne au prix d'une utilisation moins efficace des ressources. Une documentation supplémentaire sur Shuffleboard peut être trouvée :ref:`ici <docs/software/dashboards/shuffleboard/index:Shuffleboard>`.
ja: ShuffleboardはSmartDashboardと同じ機能を備えています。また、新機能とモダンなデザインにより、データのセットアップとビジュアライゼーションを改善しますが、パフォーマンスは犠牲になります。Shuffleboardに関する詳しいドキュメントは :ref:`こちら <docs/software/dashboards/shuffleboard/index:Shuffleboard>` をご覧ください。
zh_cn: 模块化仪表盘和SmartDashboard具有相同的功能。它还通过新特性和现代设计改进了数据的设置和可视化，但降低了资源效率。额外的文件沙狐球可以找到:ref:`here <docs/software/dashboards/shuffleboard/index:Shuffleboard>`.

source: Glass connected and showing NetworkTables, a Field2D window, and a plot of a couple signals.
fr_ca: Glass connecté et affichant NetworkTables, une fenêtre Field2D et un tracé de quelques signaux.
ja: Glassは接続状態で、NetworkTables、Field2Dウインドウ、複数信号のプロットを表示します。
zh_cn: 玻璃连接并显示NetworkTables, Field2D窗口和一对信号的图

source: :ref:`Glass <docs/software/dashboards/glass/index:Glass>` is a Dashboard focused on being a programmer's tool for debugging. The primary advantages are the field view, pose visualization and advanced signal plotting tools.
fr_ca: :ref:`Glass <docs/software/dashboards/glass/index:Glass>` est un tableau de bord destiné à être un outil de programmation pour le débogage. Les principaux avantages sont la vue sur le terrain, la visualisation de la pose et les outils avancés de traçage du signal.
ja: :ref:`Glass <docs/software/dashboards/glass/index:Glass>` は、プログラマーのためのデバッグ・ツールであることに重点を置いたダッシュボードです。主な利点は、フィールドビュー、ポーズの可視化、高度な信号プロットツールです。
zh_cn: :ref:`Glass <docs/software/dashboards/glass/index:Glass>` 是一个Dashboard，专注于成为程序员的调试工具。主要优点是现场视图，姿态可视化和先进的信号绘图工具。

source: LiveWindow showing two different subsystems.
fr_ca: LiveWindow affichant deux sous-systèmes différents.
ja: 2つの異なるサブシステムを表示するLiveWindow。
tr_tr: İki farklı alt sistem gösteren LiveWindow.
zh_cn: 显示两个不同的子系统。

source: LiveWindow is a feature of SmartDashboard and Shuffleboard, designed for use with the Test Mode of the Driver Station. LiveWindow allows the user to see feedback from sensors on the robot and control actuators independent of the written user code. More information about LiveWindow can be found :ref:`here <docs/software/dashboards/smartdashboard/test-mode-and-live-window/index:SmartDashboard: Test Mode and Live Window>`.
fr_ca: LiveWindow est une fonctionnalité de SmartDashboard et Shuffleboard, conçue pour être utilisée avec le mode test de la Driver Station. LiveWindow permet à l'utilisateur de voir les retours des capteurs sur le robot et les actionneurs de contrôle indépendamment du code utilisateur écrit. Plus d'informations sur LiveWindow peuvent être trouvées :ref:`ici <docs/software/dashboards/smartdashboard/test-mode-and-live-window/index:SmartDashboard: Test Mode and Live Window>`.
ja: LiveWindowはSmartDashboardとShuffleboardの機能で、ドライバーステーションのテストモードで使用するために設計されています。LiveWindowにより、ユーザーはロボットのセンサーからのフィードバックを見たり、ユーザーが書いたコードから独立してアクチュエーターを制御することができます。LiveWindowに関する詳しいドキュメントは :ref:`こちら <docs/software/dashboards/shuffleboard/index:Shuffleboard>` をご覧ください。
tr_tr: LiveWindow, Driver Station Test Moduyla kullanılmak üzere tasarlanmış SmartDashboard ve Shuffleboard'un bir özelliğidir. LiveWindow, yazılı kullanıcı kodundan bağımsız olarak, kullanıcının robot üzerindeki sensörlerden gelen geri bildirimleri görüntülemesine ve aktüatörleri kontrol etmesine olanak tanımaktadır. LiveWindow hakkında daha fazla bilgiye :ref:`buradan <docs/software/wpilib-tools/smartdashboard/test-mode-and-live-window/index:SmartDashboard: Test Mode and Live Window>` ulaşabilirsiniz.
zh_cn: LiveWindow是SmartDashboard和Shuffleboard的一个功能，专为机器操控台的测试模式而设计。LiveWindow允许用户看到来自机器人传感器和控制执行器的反馈，而无需编写用户代码。可以找到更多关于LiveWindow的信息 :ref:`here<docs/software/dashboards/smartdashboard/test-mode-and-live-window/index:SmartDashboard: Test Mode and Live Window>`.

source: FRC roboRIO Imaging Tool (Windows Only)
fr_ca: Outil d'installation d'image roboRIO FRC (Windows Seulement)
ja: FRC roboRIO イメージングツール（Windowsのみ）
tr_tr: FRC roboRIO Imaging Tool (Yalnızca Windows)
zh_cn: FRC roboRIO Imaging Tool (仅支持Windows)

source: roboRIO Imaging Tool after it has found a connected roboRIO.
fr_ca: Outil roboRIO Imaging Tool après avoir trouvé un roboRIO connecté.
ja: 接続されているroboRIOを見つけた後のroboRIOイメージングツール。
tr_tr: roboRIO Görüntüleme Aracı, bağlı bir roboRIO bulduktan sonra.
zh_cn: 找到连接的roboRIO后的成像工具。

source: This tool is used to format and setup a roboRIO for use in FRC. Installation instructions can be found :ref:`here <docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools>`. Additional instructions on imaging your roboRIO using this tool can be found :doc:`here </docs/zero-to-robot/step-3/imaging-your-roborio>`.
fr_ca: Cet outil est utilisé pour formater et configurer un roboRIO pour une utilisation en FRC. Les instructions d’installation peuvent être trouvées :ref:`ici <docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools>`. Des instructions supplémentaires sur l’installation de l'image de votre roboRIO à l’aide de cet outil peuvent être trouvées :doc:`ici </docs/zero-to-robot/step-3/imaging-your-roborio>`.
ja: このツールは、FRCで使用するroboRIOのフォーマットとセットアップに使用します。インストール方法は :ref:`こちら <docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools>` にあります。このツールを使ってroboRIOをイメージイングする追加指示については、 :doc:`こちら </docs/zero-to-robot/step-3/imaging-your-roborio>` を参照してください。
tr_tr: Bu araç, FRC'de kullanılmak üzere bir roboRIO'yu biçimlendirmek ve kurmak için kullanılmaktadır. Kurulum talimatlarına :ref:`buradan <docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools>` ulaşabilirsiniz. Bu aracı kullanarak roboRIO'nuzu görüntüleme hakkında ek talimatlara :doc:`buradan </docs/zero-to-robot/step-3/imaging-your-roborio>` ulaşabilirsiniz.
zh_cn: 此工具用于格式化和设置roboRIO以在FRC中使用。可以在:ref:`此处 <docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools>`找到安装说明。 您可以在 :doc:`此处 </docs/zero-to-robot/step-3/imaging-your-roborio>`找到有关使用此工具对roboRIO进行成像的其他说明。

source: FRC Radio Configuration Utility (Windows Only)
fr_ca: Utilitaire de Configuration de Radio FRC (Windows Seulement)
ja: FRC無線設定ユーティリティ（Windowsのみ）
zh_cn: FRC Radio Configuration Utility（仅支持Windows）

source: Initial screen of the FRC Radio Configuration Utility.
fr_ca: Écran initial de l’utilitaire FRC Radio Configuration Utility.
ja: FRC無線設定ユーティリティの最初の画面。
zh_cn: FRC无线电配置实用程序的初始屏幕。

source: The FRC Radio Configuration Utility is a tool used to configure the standard radio for practice use at home. This tool sets the appropriate network settings to mimic the experience of the FRC playing field. The FRC Radio Configuration Utility is installed by a standalone installer that can be found :ref:`here <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`.
fr_ca: L'outil FRC Radio Configuration Utility est utilisé pour configurer la radio standard pour une utilisation pratique à domicile. Cet outil définit les paramètres réseau appropriés pour imiter l’expérience du terrain de jeu FRC. L’utilitaire FRC Radio Configuration Utility est installé à l'aide d'un installateur autonome qui peut être trouvé :ref:`ici <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`.
ja: FRC無線設定ユーティリティは、競技会以外での練習用に標準無線を設定するためのツールです。FRCの競技場を模倣するために適切なネットワーク設定を行います。インストールするためのスタンドアローンインストーラは :ref:`こちら <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>` です。
zh_cn: FRC Radio Configuration Utility是用于配置标准无线连接以在家中练习的工具。 该工具设置适当的网络设置，以模仿FRC赛场的体验。 它由独立安装程序安装，可以在 :ref:`这里 <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`找到。

source: FRC Driver Station Log Viewer (Windows Only)
fr_ca: Visionneur de Journaux de la Driver Station FRC (Windows Seulement)
ja: FRCドライバーステーションのログビューア（Windowsのみ）
tr_tr: FRC Driver Station Günlük Görüntüleyicisi (Yalnızca Windows)
zh_cn: FRC Driver Station Log Viewer (仅支持Windows)

source: Driver Station Log Viewer showing a logged practice session.
fr_ca: Visionneuse du journal de Driver Station affichant une séance d’entraînement enregistrée.
ja: ドライバーステーションのログビューアは記録された練習セッションを表示します。
tr_tr: Kaydedilmiş bir uygulama oturumunu gösteren Sürücü İstasyonu Günlük Görüntüleyicisi.
zh_cn: 机器操控台日志查看器显示已记录的练习会话
